{
  "id": "11265",
  "name": "Abu al-Juza' - Aws bin 'Abdullah أبو الجوزاء - أوس بن عبد الله الربعي",
  "full_name": "Abu al-Juza' - Aws bin 'Abdullah أبو الجوزاء - أوس بن عبد الله الربعي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "83",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "NA"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Rabi'",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4143",
      "name": "Safwan bin 'Assal ( صفوان بن عسال ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10672",
      "name": "Badayl bin Maysarah بديل بن ميسرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11273",
      "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4908",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسلم، حدثنا أبو الأشهب، حدثنا أبو الجوزاء، عن ابن عباس، رضى الله عنهما في قوله ‏{‏اللات والعزى‏}‏ كان اللات رجلا يلت سويق الحاج‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding His Statement about the Lat and the `Uzza: Lat was originally a man who used to mix Sawiq for the pilgrim.",
      "chain": [
        "20285",
        "11273",
        "11265",
        "17"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني الأحمر - عن حسين المعلم، ح قال وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا عيسى بن يونس، حدثنا حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستفتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجدة لم يسجد حتى يستوي جالسا وكان يقول في كل ركعتين التحية وكان يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقبة الشيطان وينهى أن يفترش الرجل ذراعيه افتراش السبع وكان يختم الصلاة بالتسليم ‏.‏ وفي رواية ابن نمير عن أبي خالد وكان ينهى عن عقب الشيطان ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to begin prayer with takbir (saying Allih-o-Akbar) and the recitation:\" Praise be to Allah, the Lord of the Universe.\" When he bowed he neither kept his head up nor bent it down, but kept it between these extremes; when he raised his bead after bow- ing he did not prostrate himself till he had stood erect; when he raised his head after prostration he did not prostrate himself again till he satup. At the end of every two rak'ahs he recited the tahiyya; and he used to place his left foot flat (on the ground) and raise up the right; he prohibited the devil's way of sitting on the heels, and he forbade people to spread out their arms like a wild beast. And he used to finish the prayer with the taslim.",
      "chain": [
        "30212",
        "20326",
        "11278",
        "30123",
        "20347",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حسين بن عيسى، حدثنا طلق بن غنام، حدثنا عبد السلام بن حرب الملائي، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا استفتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ قال أبو داود وهذا الحديث ليس بالمشهور عن عبد السلام بن حرب لم يروه إلا طلق بن غنام وقد روى قصة الصلاة عن بديل جماعة لم يذكروا فيه شيئا من هذا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) began his prayer, he said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name, and Exalted is Thy greatness, sand there is no god but Allah.\"Abu Dawud said: This tradition is not well known from 'Abd al-Salam b. Harb. No one narrated this except Talq b. Ghannam. A group of narrators reported the description of prayer from (the narrator) Budail; they did not mention therein this supplication.",
      "chain": [
        "30326",
        "30197",
        "20248",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث بن سعيد، عن حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يفتتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين ‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجود لم يسجد حتى يستوي قاعدا وكان يقول في كل ركعتين ‏\"‏ التحيات ‏\"‏ ‏.‏ وكان إذا جلس يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقب الشيطان وعن فرشة السبع وكان يختم الصلاة بالتسليم ‏.‏",
      "text_en": " ‘A’ishah said:                      The Messenger of Allah(ﷺ) began prayer with the takbir (Allah is most great) and with reciting “Praise be to Allah, the Lord of the Universe”. And when he bowed, he neither raised up nor lowered down his head, but kept it between the two (conditions). And when he raised his head after bowing, he did not prostrate himself until he stood up straight; and when he raised his head after prostration, he did not prostrate (the second time) until he sat down properly; and he recited al-tahiyyat after every pair of rak’ahs; and when he sat, he spread out his left foot and raised his right. He forbade to sit like the sitting of the devil, and to spread out to hands (on the ground in prostration) like animals. He used to finish prayer with uttering the salutation.",
      "chain": [
        "30175",
        "20258",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "1298",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سفيان الأبلي، حدثنا حبان بن هلال أبو حبيب، حدثنا مهدي بن ميمون، حدثنا عمرو بن مالك، عن أبي الجوزاء، قال حدثني رجل، كانت له صحبة يرون أنه عبد الله بن عمرو قال قال النبي صلى الله عليه وسلم ‏\"‏ ائتني غدا أحبوك وأثيبك وأعطيك ‏\"‏ ‏.‏ حتى ظننت أنه يعطيني عطية قال ‏\"‏ إذا زال النهار فقم فصل أربع ركعات ‏\"‏ ‏.‏ فذكر نحوه قال ‏\"‏ ترفع رأسك - يعني من السجدة الثانية - فاستو جالسا ولا تقم حتى تسبح عشرا وتحمد عشرا وتكبر عشرا وتهلل عشرا ثم تصنع ذلك في الأربع ركعات ‏\"‏ ‏.‏ قال ‏\"‏ فإنك لو كنت أعظم أهل الأرض ذنبا غفر لك بذلك ‏\"‏ ‏.‏ قلت فإن لم أستطع أن أصليها تلك الساعة قال ‏\"‏ صلها من الليل والنهار ‏\"‏ ‏.‏ قال أبو داود حبان بن هلال خال هلال الرائي ‏.‏ قال أبو داود رواه المستمر بن الريان عن أبي الجوزاء عن عبد الله بن عمرو موقوفا ورواه روح بن المسيب وجعفر بن سليمان عن عمرو بن مالك النكري عن أبي الجوزاء عن ابن عباس قوله وقال في حديث روح فقال حديث النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     AbulJawza' said: A man who attended the company of the Prophet (ﷺ) narrated to me (it is thought that he was Abdullah ibn Amr): The Prophet (ﷺ) said to me: Come to me tomorrow; I shall give you something, I shall give you something, I shall reward you something, I shall donate something to you. I thought that he would give me some present.  He said (to me when I came to him): When the day declines, stand up and pray four rak'ahs. He then narrated something similar.  This version adds: Do not stand until you glorify Allah ten times, and praise Him ten times, and exalt Him ten times, and say, \"There is no god but Allah\" ten times. Then you should do that in four rak'ahs. If you are the greatest sinner on earth, you will be forgiven (by Allah) on account of this (prayer).  I asked: If I cannot pray this the appointed hour, (what should I do)? He replied: Pray that by night or by day (at any time).Abu Dawud said: Habban b. Hilal is the maternal uncle of Hilal al-Ra'i.Abu Dawud said: This tradition has been narrated by al-Mustamir b. al-Riyyan from Ibn al-Jawza' from 'Abd Allah b. 'Amr without referring to the Prophet (ﷺ), - narrated as a statement of 'Abd Allah b. 'Amr himself (mauquf). This has also been narrated by Rawh b. al-Musayyab, and Ja'far b. Sulaiman from 'Amr b. Malik al-Nakri from Abu al-Jauza' from Ibn 'Abbas as his own statement (and not the statement of the Prophet). But the version of Rawh has the words: \"The tradition of the Prophet (ﷺ).\"",
      "chain": [
        "38508",
        "20218",
        "11307",
        "11265",
        "29"
      ]
    },
    {
      "hadith_no": "2935",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا نوح بن قيس، عن يزيد بن كعب، عن عمرو بن مالك، عن أبي الجوزاء، عن ابن عباس، قال السجل كاتب كان للنبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Prophet (ﷺ) has a secretary named Sijill.",
      "chain": [
        "30367",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "hadith_no": "3133",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يحيى بن عمرو بن مالك النكري، عن أبيه، عن أبي الجوزاء، عن ابن عباس، قال ضرب بعض أصحاب النبي صلى الله عليه وسلم خباءه على قبر وهو لا يحسب أنه قبر فإذا فيه إنسان يقرأ سورة تبارك الذي بيده الملك حتى ختمها فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إني ضربت خبائي على قبر وأنا لا أحسب أنه قبر فإذا فيه إنسان يقرأ سورة تبارك الملك حتى ختمها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي المانعة هي المنجية تنجيه من عذاب القبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"One of the Companions of the Prophet (ﷺ) put up a tent upon a grave without knowing that it was a grave. When he realized that is was a person's grave, he recited Surat Al-Mulk until its completion. Then he went to the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ) [Indeed] I erected my tent without realizing that it was upon a grave. So when I realized there was a person in it I recited Surat Al-Mulk until its completion.' So the Prophet (ﷺ) said: \"It is a prevention, it is a salvation delivering from the punishment of the grave.'\"",
      "chain": [
        "30450",
        "24495",
        "24343",
        "11265",
        "17"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا نوح بن قيس الحداني، عن عمرو بن مالك، عن أبي الجوزاء، عن ابن عباس، قال كانت امرأة تصلي خلف رسول الله صلى الله عليه وسلم - حسناء من أحسن الناس فكان بعض القوم يتقدم حتى يكون في الصف الأول لئلا يراها ويستأخر بعضهم حتى يكون في الصف المؤخر فإذا ركع نظر من تحت إبطيه فأنزل الله ‏:‏ ‏(‏ ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين ‏)‏ ‏.‏ قال أبو عيسى وروى جعفر بن سليمان هذا الحديث عن عمرو بن مالك عن أبي الجوزاء نحوه ولم يذكر فيه عن ابن عباس وهذا أشبه أن يكون أصح من حديث نوح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"There was a woman who performed Salat behind the Messenger of Allah (ﷺ) who was the most beautiful among the people. Some of the people would go forward to the first line so as not to see her. Others would go back to the last line so when he would bow, he could look at her from under his armpit. So Allah revealed: Indeed We know those who try to come forward among you, and We know those who try to go back (15:24).",
      "chain": [
        "30367",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "hadith_no": "870",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا نوح، - يعني ابن قيس - عن ابن مالك، - وهو عمرو - عن أبي الجوزاء، عن ابن عباس، قال كانت امرأة تصلي خلف رسول الله صلى الله عليه وسلم حسناء من أحسن الناس - قال - فكان بعض القوم يتقدم في الصف الأول لئلا يراها ويستأخر بعضهم حتى يكون في الصف المؤخر فإذا ركع نظر من تحت إبطه فأنزل الله عز وجل ‏{‏ ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                      \"There was a woman who used to pray behind the Messenger of Allah (ﷺ) who was beautiful, one of the most beautiful of people. Some of the people used to go to the front row to avoid seeing her, and some used to go tothe back row so that when they bowed they could see her from beneath their armpits. Then Allah revealed the words: 'To Us areknown those of you who hasten forward and those who lag behind.\"",
      "chain": [
        "30367",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "hadith_no": "861",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يفتتح القراءة ب ‏{الحمد لله رب العالمين }‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ), AbuBakr, ‘Umar and ‘Uthman used to start their recitation with “Allpraises and thanks are to Allah, the Lord of all that exists.(Al-hamdu Lillahi Rabbil-‘Alamin).’” [1:2]",
      "chain": [
        "30201",
        "20472",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "918",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Messenger of Allah (ﷺ)bowed, he neither raised his head nor lowered it, rather (he didsomething) between that.”",
      "chain": [
        "30201",
        "20472",
        "11278",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "943",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما فإذا سجد فرفع رأسه لم يسجد حتى يستوي جالسا وكان يفترش رجله اليسرى ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Messenger of Allah (ﷺ)raised his head from bowing, he would not prostrate until he hadstoodup straight. When he prostrated, he would raise his head andnotprostrate again until he had sat up straight. And he used tospreadout his left leg.”",
      "chain": [
        "30201",
        "20472",
        "11278",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "1099",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حميد بن مسعدة، وأبو بكر بن خلاد قالا حدثنا نوح بن قيس، حدثنا عمرو بن مالك، عن أبي الجوزاء، عن ابن عباس، قال كانت امرأة تصلي خلف النبي  صلى الله عليه وسلم  حسناء من أحسن الناس فكان بعض القوم يستقدم في الصف الأول لئلا يراها ويستأخر بعضهم حتى يكون في الصف المؤخر فإذا ركع قال هكذا ينظر من تحت إبطه فأنزل الله ‏{ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين}‏ في شأنها ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A woman used to perform prayerbehind the Prophet (ﷺ), and she was one of the most beautiful ofpeople. Some of the people used to go into the first row so that theywould not see her, and some of them used to lag behind so that theywould be in the last row, and when they bowed, they would do likethisso that they could see her from beneath their armpits. ThenAllahrevealed: “And indeed, We know the first generations of youwho hadpassed away, and indeed, We know the present generations ofyou(mankind), and also those who will some afterwards.” [15:24]concerning her matter.",
      "chain": [
        "30430",
        "30357",
        "20572",
        "11265",
        "17"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن سليمان بن علي الربعي، عن أبي الجوزاء، قال سمعته يأمر، بالصرف - يعني ابن عباس - ويحدث ذلك عنه ثم بلغني أنه رجع عن ذلك فلقيته بمكة فقلت إنه بلغني أنك رجعت ‏.‏ قال نعم إنما كان ذلك رأيا مني وهذا أبو سعيد يحدث عن رسول الله  صلى الله عليه وسلم  أنه نهى عن الصرف ‏.‏",
      "text_en": " It was narrated that Abu Jawza' said:                     \"I heard him meaning Ibn 'Abbas allowing exchange (of Dirhams for Dirham etc., if extra was given) and that was narrated from him. Then I heard that he has taken back this opinion. I met him in Makkah and said: 'I heard that you had taken back (your opinion).' He said: 'Yes. That was just my own opinion, but Abu Sa'eed narrated from the Messenger of Allah (ﷺ) that he forbade exchange (of like items if extra is given).\"'",
      "chain": [
        "30423",
        "20022",
        "10685",
        "11265",
        "38"
      ]
    }
  ],
  "total_hadiths": 14
}