{
  "id": "11263",
  "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
  "full_name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس  أبو الزبير",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "B.Asad",
      "Client",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11370",
      "name": "'Ubaida bin 'Amr al-Salamani عبيدة بن عمرو",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10950",
      "name": "'Ali bin 'Abdullah علي بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10806",
      "name": "'Awn bin 'Abdullah bin 'Utba عون بن عبد الله بن عتبة بن مسعود الهذلي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13127",
      "name": "Nafid, Abu Ma'bad, Client Of Ibn 'Abbas نافذ أبو معبد مولى بن عباس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "1133",
      "name": "Ma'bad bin Ka'b bin Malik ( معبد بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11277",
      "name": "Hjaj bin Abi 'Uthman حجاج بن أبي عثمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20535",
      "name": "Hrb bin Abi al-'Alih حرب بن أبي العالية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10945",
      "name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10802",
      "name": "'Ammar bin Mua'wiya bin Aslam al-Dahni عمار بن معاوية الدهني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20514",
      "name": "'Ayyad bin 'Abdullah عياض بن عبد الله بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2189",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، أخبرنا ابن جريج، عن عطاء، وأبي الزبير، عن جابر  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن بيع الثمر حتى يطيب، ولا يباع شىء منه إلا بالدينار والدرهم إلا العرايا‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet forbade the selling of fruits unless they get ripe, and none of them should be sold except for Dinar or Dirham (i.e. money), except the 'Araya trees (the dates of which could be sold for dates).",
      "chain": [
        "30220",
        "20029",
        "11070",
        "11029",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4161",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قال يوم الخندق ‏\"‏ ملأ الله عليهم بيوتهم وقبورهم نارا كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (i.e. Trench), the Prophet said '(Let) Allah fill their (i.e. the infidels') houses and graves with fire just as they have prevented us from offering the Middle Prayer (i.e. `Asr prayer) till the sun had set.\"",
      "chain": [
        "30021",
        "20229",
        "20295",
        "11263",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4180",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال معاذ حدثنا هشام، عن أبي الزبير، عن جابر، قال كنا مع النبي صلى الله عليه وسلم بنخل‏.‏ فذكر صلاة الخوف‏.‏ قال مالك وذلك أحسن ما سمعت في صلاة الخوف‏.‏ تابعه الليث عن هشام عن زيد بن أسلم أن القاسم بن محمد حدثه صلى النبي صلى الله عليه وسلم في غزوة بني أنمار‏.‏",
      "text_en": "",
      "chain": [
        "32",
        "11065",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال أبو الزبير عن جابر، كنا مع النبي صلى الله عليه وسلم بنخل فصلى الخوف‏.‏ وقال أبو هريرة صليت مع النبي صلى الله عليه وسلم غزوة نجد صلاة الخوف‏.‏ وإنما جاء أبو هريرة إلى النبي صلى الله عليه وسلم أيام خيبر‏.‏",
      "text_en": "",
      "chain": [
        "11263"
      ]
    },
    {
      "hadith_no": "119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، أن رجلا، سأل رسول الله صلى الله عليه وسلم فقال أرأيت إذا صليت الصلوات المكتوبات وصمت رمضان وأحللت الحلال وحرمت الحرام ولم أزد على ذلك شيئا أأدخل الجنة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال والله لا أزيد على ذلك شيئا ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that a man once said to the Messenger of Allah (may peace be upon him):                      Shall I enter Paradise in case I say the obligatory prayers, observe the (fasts) of Ramadan and treat that as lawful which has been made permissible (by the Shari'ah) and deny myself that what is forbidden, and make no addition to it? He (the Holy Prophet) replied in the affirmative. He (the inquirer) said: By Allah, I would add nothing to it.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - قالا جميعا حدثنا سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏ ثم قرأ ‏{‏ إنما أنت مذكر * لست عليهم بمسيطر‏}‏",
      "text_en": " It is narrated on the authority of Jabir that the Messenger of Allah said:                      I have been commanded that I should fight against people till they declare that there is no god but Allah, and when they profess it that there is no god but Allah, their blood and riches are guaranteed protection on my behalf except where it is justified by law, and their affairs rest with Allah, and then he (the Holy Prophet) recited (this verse of the Holy Qur'an):\" Thou art not over them a warden\" (lxxxviii, 22).",
      "chain": [
        "30201",
        "20032",
        "30170",
        "20033",
        "20005",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حسن الحلواني، وعبد بن حميد، جميعا عن أبي عاصم، - قال عبد أنبأنا أبو عاصم، - عن ابن جريج، أنه سمع أبا الزبير، يقول سمعت جابرا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ المسلم من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that he heard the (Holy Prophet) say:                      A Muslim is he from whose hand and tongue the Muslim's are safe.",
      "chain": [
        "130115",
        "30553",
        "20241",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الله بن الحارث المخزومي، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ غلظ القلوب والجفاء في المشرق والإيمان في أهل الحجاز ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Jabir b. Abdullah that the Messenger of Allah (may peace and, blessings be upon him) observed:                      The callousness of heart and sternness is in the East and faith is among the people of the Hijaz.",
      "chain": [
        "30123",
        "20524",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو غسان المسمعي، حدثنا الضحاك بن مخلد، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بين الرجل وبين الشرك والكفر ترك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Zubair that he heard Jabir b. 'Abdullah saying. I heard the Messenger of Allah (may peace and blessings be upon him) observing this:                      Between man and polytheism and unbelief is the abandonment of salat.",
      "chain": [
        "30456",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو أيوب الغيلاني، سليمان بن عبيد الله وحجاج بن الشاعر قالا حدثنا عبد الملك بن عمرو، حدثنا قرة، عن أبي الزبير، حدثنا جابر بن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لقي الله لا يشرك به شيئا دخل الجنة ومن لقيه يشرك به دخل النار ‏\"‏ ‏.‏ قال أبو أيوب قال أبو الزبير عن جابر ‏.‏",
      "text_en": " It is narrated on the authority of Jabir b. Abdullah:                      I heard the Messenger of Allah (may peace be upon him) saying: He who met Allah without associating anything with Allah entered Paradise and he who met Him associating (anything) with Him entered Fire.",
      "chain": [
        "11301",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "281",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن أبي الزبير، عن جابر، أن نبي الله صلى الله عليه وسلم قال بمثله ‏.‏",
      "text_en": " The same hadith has been narrated by Ishaq b. Mansur on the authority of Jabir with another chain of transmitters.",
      "chain": [
        "30313",
        "20287",
        "20295",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن سليمان، - قال أبو بكر حدثنا سليمان بن حرب، - حدثنا حماد بن زيد، عن حجاج الصواف، عن أبي الزبير، عن جابر، أن الطفيل بن عمرو الدوسي، أتى النبي صلى الله عليه وسلم فقال يا رسول الله هل لك في حصن حصين ومنعة - قال حصن كان لدوس في الجاهلية - فأبى ذلك النبي صلى الله عليه وسلم للذي ذخر الله للأنصار فلما هاجر النبي صلى الله عليه وسلم إلى المدينة هاجر إليه الطفيل بن عمرو وهاجر معه رجل من قومه فاجتووا المدينة فمرض فجزع فأخذ مشاقص له فقطع بها براجمه فشخبت يداه حتى مات فرآه الطفيل بن عمرو في منامه فرآه وهيئته حسنة ورآه مغطيا يديه فقال له ما صنع بك ربك فقال غفر لي بهجرتي إلى نبيه صلى الله عليه وسلم فقال ما لي أراك مغطيا يديك قال قيل لي لن نصلح منك ما أفسدت ‏.‏ فقصها الطفيل على رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم وليديه فاغفر ‏\"‏",
      "text_en": " It is narrated on the authority of Jabir that Tufail son of Amr al-Dausi came to the Apostle (may peace be upon him) and said:                      Do you need strong, fortified protection? The tribe of Daus had a fort in the pre-Islamic days. The Apostle (may peace be upon him) declined this offer, since it (the privilege of protecting the Holy Prophet) had already been reserved for the Ansar. When the Apostle (may peace be upon him) migrated to Medina, Tufail son of Amr also migrated to that place, and there also migrated along with him a man of his tribe. But the climate of Medina did not suit him, and he fell sick. He felt very uneasy. So he took hold of an iron head of an arrow and cut his finger-joints. The blood streamed forth from his hands, till he died. Tufail son of Amr saw him in a dream. His state was good and he saw him with his hands wrapped. He (Tufail) said to him: What treatment did your Allah accord to you? He replied. Allah granted me pardon for my migration to the Apostle (may peace be upon him): He (Tufail) again said: What is this that I see you wrapping up your hands? He replied: I was told (by Allah): We would not set right anything of yours which you damaged yourself. Tufail narrated this (dream) to the Messenger of Allah (may peace be upon him). Upon this he prayed: O Allah I grant pardon even to his hands.",
      "chain": [
        "30201",
        "30123",
        "20160",
        "20436",
        "20193",
        "20022",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الوليد بن شجاع، وهارون بن عبد الله، وحجاج بن الشاعر، قالوا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة - قال - فينزل عيسى ابن مريم صلى الله عليه وسلم فيقول أميرهم تعال صل لنا ‏.‏ فيقول لا ‏.‏ إن بعضكم على بعض أمراء ‏.‏ تكرمة الله هذه الأمة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard the Messenger of Allah (may peace be upon him) say: A section of my people will not cease fighting for the Truth and will prevail till the Day of Resurrection. He said: Jesus son of Mary would then descend and their (Muslims') commander would invite him to come and lead them in prayer, but he would say: No, some amongst you are commanders over some (amongst you). This is the honour from Allah for this Ummah.",
      "chain": [
        "30482",
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "441",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عرض على الأنبياء فإذا موسى ضرب من الرجال كأنه من رجال شنوءة ورأيت عيسى ابن مريم - عليه السلام - فإذا أقرب من رأيت به شبها عروة بن مسعود ورأيت إبراهيم صلوات الله عليه فإذا أقرب من رأيت به شبها صاحبكم - يعني نفسه - ورأيت جبريل - عليه السلام - فإذا أقرب من رأيت به شبها دحية ‏\"‏ ‏.‏ وفي رواية ابن رمح ‏\"‏ دحية بن خليفة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that the Messenger of Allah (may peace be upon him) said:                      There appeared before me the apostles, and Moses was among men as if he was one of the people of Shanu'a, and I saw Jesus son of Mary (peace be upon him) and I saw nearest in resemblance with him was 'Urwa b. Mas'ud, and I saw Ibrahim (blessings of Allah be upon him) and I see your companions much in resemblance with him, i. e. his personality, and I saw Gabriel (peace be upon him) and I saw Dihya nearest in resemblance to him; but in the narration of Ibn Rumh it is Dihya b. Khalifa.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "489",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبيد الله بن سعيد، وإسحاق بن منصور، كلاهما عن روح، قال عبيد الله حدثنا روح بن عبادة القيسي، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يسأل عن الورود، فقال نجيء نحن يوم القيامة عن كذا، وكذا، انظر أى ذلك فوق الناس - قال - فتدعى الأمم بأوثانها وما كانت تعبد الأول فالأول ثم يأتينا ربنا بعد ذلك فيقول من تنظرون فيقولون ننظر ربنا ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون حتى ننظر إليك ‏.‏ فيتجلى لهم يضحك - قال - فينطلق بهم ويتبعونه ويعطى كل إنسان منهم - منافق أو مؤمن - نورا ثم يتبعونه وعلى جسر جهنم كلاليب وحسك تأخذ من شاء الله ثم يطفأ نور المنافقين ثم ينجو المؤمنون فتنجو أول زمرة وجوههم كالقمر ليلة البدر سبعون ألفا لا يحاسبون ثم الذين يلونهم كأضوإ نجم في السماء ثم كذلك ثم تحل الشفاعة ويشفعون حتى يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة فيجعلون بفناء الجنة ويجعل أهل الجنة يرشون عليهم الماء حتى ينبتوا نبات الشىء في السيل ويذهب حراقه ثم يسأل حتى تجعل له الدنيا وعشرة أمثالها معها ‏.‏",
      "text_en": " It is reported on the authority of Abu Zubair that he heard from Jabir b 'Abdullah, who was asked about the arrival (of people on the Day of Resurrection). He said. We would come on the Day of Resurrection like this, like this, and see. carefully. that which concerns\" elevated people\". He (the narrator) said:                      Then the people would be summoned along with their idols whom they worshipped, one after another. Then our Lord would come to us and say: Whom are you waiting for? They would say: We are waiting for our Lord. He would say: I am your Lord. They would say: (We are not sure) till we gaze at Thee, and He would manifest Himself to them smilingly, and would go along with them and they would follow Him; and every person, whether a hypocrite or a believer, would be endowed with a light, and there would be spikes and hooks on the bridge of the Hell, which would catch hold of those whom Allah willed. Then the light of the hypocrites would be extinguished, and the believers would secure salvation. and the first group to achieve it would comprise seventy thousand men who would have the brightness of full moon on their faces, and they would not be called to account. Then the people immediately following them would have their faces as the brightest stars in the heaven. This is how (the groups would follow one after another). Then the stage of intercession would come, and they (who are permitted to intercede) would intercede, till he who had declared:\" There is no god but Allah\" and had in his heart virtue of the weight of a barley grain would come out of the Fire. They would be then brought in the courtyard of Paradise and the inhabitants of Paradise would begin to sprinkle water over them till they would sprout like the sprouting of a thing in flood water, and their burns would disappear. They would ask their Lord till they would be granted (the bounties) of the world and with it ten more besides it.",
      "chain": [
        "30359",
        "30313",
        "20229",
        "11201",
        "20229",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا روح، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول عن النبي صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة قد دعا بها في أمته وخبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair heard Jabir b. Abdullah reporting it from the Apostle of Allah (may peace be upon him):                      For every apostle was a prayer with which he prayed (to his Lord) for his Ummah, but I have reserved my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "chain": [
        "30560",
        "20229",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، قال ابن رافع حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استجمر أحدكم فليوتر ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that he heard the Messenger of Allah (may peace be upon him) say:                      When anyone wipes himself with pebbles (after answering the call of nature) he should do this odd number of times.",
      "chain": [
        "30123",
        "30375",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "243",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن محمد بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أخبرني عمر بن الخطاب، أن رجلا، توضأ فترك موضع ظفر على قدمه فأبصره النبي صلى الله عليه وسلم فقال ‏\"‏ ارجع فأحسن وضوءك ‏\"‏ ‏.‏ فرجع ثم صلى ‏.‏",
      "text_en": " Jabir reported:                      'Umar b. Khattab said that a person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah (may peace be upon him) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، أنه سمع جابرا، يقول نهى رسول الله صلى الله عليه وسلم أن يتمسح بعظم أو ببعر ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) forbade the use of bone or the droppings of camels for wiping (after excretion).",
      "chain": [
        "30022",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني سلمة بن شبيب، قال حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، عن أبي هريرة، أنه أخبره أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم فليفرغ على يده ثلاث مرات قبل أن يدخل يده في إنائه فإنه لا يدري فيم باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "13"
      ]
    },
    {
      "hadith_no": "281",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى، ومحمد بن رمح، قالا أخبرنا الليث، ح وحدثنا قتيبة، حدثنا الليث، عن أبي الزبير، عن جابر، عن رسول الله صلى الله عليه وسلم أنه نهى أن يبال في الماء الراكد ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) forbade to urinate in stagnant water.",
      "chain": [
        "30399",
        "30490",
        "20023",
        "30367",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وعلي بن حجر جميعا عن ابن علية، قال يحيى أخبرنا إسماعيل ابن علية، عن أيوب، عن أبي الزبير، عن عبيد بن عمير، قال بلغ عائشة أن عبد، الله بن عمرو يأمر النساء إذا اغتسلن أن ينقضن رءوسهن فقالت يا عجبا لابن عمرو هذا يأمر النساء إذا اغتسلن أن ينقضن رءوسهن أفلا يأمرهن أن يحلقن رءوسهن لقد كنت أغتسل أنا ورسول الله صلى الله عليه وسلم من إناء واحد ولا أزيد على أن أفرغ على رأسي ثلاث إفراغات ‏.‏",
      "text_en": " 'Ubaid b. Umair reported:                      It was conveyed to 'A'isha that 'Abdullah b. 'Amr ordered the women to undo the (plaits) of hair on their heads. She said: How strange it is for Ibn 'Amr that he orders the women to undo the plaits of their head while taking a bath; why does he not order them to shave their beads? I and the Messenger of Allah (may peace be upon him) took bath from one vessel. I did no more than this that I poured three handfuls of water over my head.",
      "chain": [
        "30399",
        "20208",
        "20031",
        "20208",
        "11015",
        "11263",
        "11259"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني عياض بن عبد الله، عن أبي الزبير، عن جابر بن عبد الله، عن أم كلثوم، عن عائشة، زوج النبي صلى الله عليه وسلم قالت إن رجلا سأل رسول الله صلى الله عليه وسلم عن الرجل يجامع أهله ثم يكسل هل عليهما الغسل وعائشة جالسة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأفعل ذلك أنا وهذه ثم نغتسل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha the wife of the Apostle of Allah (may peace be upon him) reported. A person asked the Messenger of Allah (may peace be upon him) about one who has sexual intercourse with his wife and parts away (without orgasm) whether bathing is obligatory for him. 'A'isha was sitting by him. The Messenger of Allah (may peace be upon him) said:                      I and she (the Mother of the Faithful) do it and then take a bath.",
      "chain": [
        "30280",
        "30492",
        "20029",
        "20514",
        "11263",
        "34",
        "10500"
      ]
    },
    {
      "hadith_no": "403",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن أبي الزبير، عن سعيد بن جبير، وعن طاوس، عن ابن عباس، أنه قال كان رسول الله صلى الله عليه وسلم يعلمنا التشهد كما يعلمنا السورة من القرآن فكان يقول ‏\"‏ التحيات المباركات الصلوات الطيبات لله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا رسول الله ‏\"‏ ‏.‏ وفي رواية ابن رمح كما يعلمنا القرآن ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) used to teach us tashahbud just as he used to teach us a Sura of the Qur'an, and he would say: All services rendered by., words, acts of worship. and all good thirgs are due to Allah. Peace be upon you,0 Prophet. and Allah's mercy and blessings. Peace be upon us and upon Allah's upright servants. I testify that there is no god but Allah, and I testify that Muhammad is the Messenger of Allah. In the narration of Ibn Rumb (the words are):\" As he would teach us the Qur'an.\"",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11263",
        "11050",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "403",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا عبد الرحمن بن حميد، حدثني أبو الزبير، عن طاوس، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يعلمنا التشهد كما يعلمنا السورة من القرآن ‏.‏",
      "text_en": " Tawus narrated it on the authority of Ibn 'Abbas that he said:                      The Messenger of Allah (may peace be upon him) used to teach us tashahhud as he would teach us a Sura of the Qur'an.",
      "chain": [
        "30201",
        "20364",
        "11193",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، قال اشتكى رسول الله صلى الله عليه وسلم فصلينا وراءه وهو قاعد وأبو بكر يسمع الناس تكبيره فالتفت إلينا فرآنا قياما فأشار إلينا فقعدنا فصلينا بصلاته قعودا فلما سلم قال ‏\"‏ إن كدتم آنفا لتفعلون فعل فارس والروم يقومون على ملوكهم وهم قعود فلا تفعلوا ائتموا بأئمتكم إن صلى قائما فصلوا قياما وإن صلى قاعدا فصلوا قعودا ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) was ill and we said prayer behind him and he was sitting. And Abu Bakr was making audible to the people his takbir. As he paid his attention towards us he saw us standing and (directed us to sit down) with a gesture. So we sat down and said our prayer with his prayer in a sitting posture. After uttering salutation he said: You were at this time about to do an act like that of the Persians and the Romans. They stand before their kings while they sit, so don't do that; follow your Imams. If they say prayer standing, you should also do so, and if they say prayer sitting, you should also say prayer sitting.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا حميد بن عبد الرحمن الرؤاسي، عن أبيه، عن أبي الزبير، عن جابر، قال صلى بنا رسول الله صلى الله عليه وسلم وأبو بكر خلفه فإذا كبر رسول الله صلى الله عليه وسلم كبر أبو بكر ليسمعنا ‏.‏ ثم ذكر نحو حديث الليث ‏.‏",
      "text_en": " Jabir said:                      The Messenger of Allah (may peace be upon him) led the prayer and Abu Bakr was behind him. When the Messenger of Allah (may peace be upon him) recited the takbir, Abu Bakr also recited (it) in order to make it audible to us. And the rest of the hadith is like one transmitted by Laith.",
      "chain": [
        "30399",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا ابن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، أنه قال صلى معاذ بن جبل الأنصاري لأصحابه العشاء فطول عليهم فانصرف رجل منا فصلى فأخبر معاذ عنه فقال إنه منافق ‏.‏ فلما بلغ ذلك الرجل دخل على رسول الله صلى الله عليه وسلم فأخبره ما قال معاذ فقال له النبي صلى الله عليه وسلم ‏\"‏ أتريد أن تكون فتانا يا معاذ إذا أممت الناس فاقرأ بالشمس وضحاها ‏.‏ وسبح اسم ربك الأعلى ‏.‏ واقرأ باسم ربك ‏.‏ والليل إذا يغشى ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      'Mu'adh b jabal al-Ansari led his companions in the night prayer and prolonged it for them. A person amongst us said prayer (after having separated himself from the congregation). Mu'adh was informed of this, and he remarked that he wasa hypocrite. When it (the remark) was conveyed to the man, he went to the Messenger of Allah (may peace be upon him) and informed him of what Mu'adh had said. Upon this the Apostle of Allah (may peace be upon him) said to him: Mu'adh, do you want to become a person putting (people) to trial? When you lead people in prayer, recite:\" By the Sun and its morning brightness\" (Surah xci.),\" Glorify the name of thy most high Lord\" (Surah lxxxvi.) and\" Read in the name of Lord\" (Surah xcvi.), and\" By the night when it spreads\" (Surah xcii.).",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن أبي الزبير، عن جابر، قال رأيت النبي صلى الله عليه وسلم يصلي في ثوب واحد متوشحا به ‏.‏",
      "text_en": " Jabir reported:                      I saw the Messenger of Allah (may peace be upon him) praying in a single garment crossing the two ends.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو، أن أبا الزبير المكي، حدثه أنه، رأى جابر بن عبد الله يصلي في ثوب متوشحا به وعنده ثيابه ‏.‏ وقال جابر إنه رأى رسول الله صلى الله عليه وسلم يصنع ذلك ‏.‏",
      "text_en": " Abu Zubair reported that he saw Jabir b. 'Abdullah praying in a single garment crossing Its ends even though he had the garments, and Jabir said:                      He saw the Messenger of Allah (may peace be upon him) doing like this.",
      "chain": [
        "30487",
        "20029",
        "20377",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، ح قال وحدثنا حسن الحلواني، حدثنا عبد الرزاق، - وتقاربا في اللفظ - قالا جميعا أخبرنا ابن جريج أخبرني أبو الزبير أنه سمع طاوسا يقول قلنا لابن عباس في الإقعاء على القدمين فقال هي السنة ‏.‏ فقلنا له إنا لنراه جفاء بالرجل ‏.‏ فقال ابن عباس بل هي سنة نبيك صلى الله عليه وسلم ‏.‏",
      "text_en": " Tawus reported:                      We asked Ibn Abbas about sitting on one's buttocks (in prayer). (ala alqad mein) He said: It is sunnah. We said to him: We find it a sort of cruelty to the foot. Ibn 'Abbas said: It is the sunnah of your Apostle (may peace be upon him).",
      "chain": [
        "30123",
        "20277",
        "130115",
        "11070",
        "11263",
        "11053"
      ]
    },
    {
      "hadith_no": "1233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن أبي الزبير، عن جابر، أنه قال إن رسول الله صلى الله عليه وسلم بعثني لحاجة ثم أدركته وهو يسير - قال قتيبة يصلي - فسلمت عليه فأشار إلى فلما فرغ دعاني فقال ‏\"‏ إنك سلمت آنفا وأنا أصلي ‏\"‏ ‏.‏ وهو موجه حينئذ قبل المشرق ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) sent me on an errand. I (having done the business assigned to me came back and) joined him as he was going (on a ride). Qutaiba said that he was saying prayer while he rode. I greeted him. He gestured to me. When he completed the prayer. he called me and said: You greeted me just now while I was engaged in prayer. (Qutaiba said): His (Prophet's face) was towards the east, as he was praying.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثني أبو الزبير، عن جابر، قال أرسلني رسول الله صلى الله عليه وسلم وهو منطلق إلى بني المصطلق فأتيته وهو يصلي على بعيره فكلمته فقال لي بيده هكذا - وأومأ زهير بيده - ثم كلمته فقال لي هكذا - فأومأ زهير أيضا بيده نحو الأرض - وأنا أسمعه يقرأ يومئ برأسه فلما فرغ قال ‏\"‏ ما فعلت في الذي أرسلتك له فإنه لم يمنعني أن أكلمك إلا أني كنت أصلي ‏\"‏ ‏.‏ قال زهير وأبو الزبير جالس مستقبل الكعبة فقال بيده أبو الزبير إلى بني المصطلق فقال بيده إلى غير الكعبة ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) sent me (on an errand) while he was going to Banu Mustaliq. I came to him and he was engaged in prayer on the back of his camel. I talked to him and he gestured to me With his hand, and Zuhair gestured with his hand. I then again talked and he again (gestured to me with his hand). Zuhair pointed with his hand towards the ground. I heard him (the Holy Prophet) reciting the Qur'an and making a sign with his head. When he com- pleted the prayer he sa'id: What have you done (with regard to that business) for which I sent you? I could not talk with you but for the fact that I was engaged in prayer. Zuhair told that Abu Zubair was sitting with his face turned towards Qibla (as he transmitted this hadith). Abu Zuhair pointed towards Banu Mustaliq with his hand and the direction to which he pointed with his hand was not towards the Ka'ba.",
      "chain": [
        "30184",
        "20321",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا كثير بن هشام، عن هشام الدستوائي، عن أبي الزبير، عن جابر، قال نهى رسول الله صلى الله عليه وسلم عن أكل البصل والكراث ‏.‏ فغلبتنا الحاجة فأكلنا منها فقال ‏\"‏ من أكل من هذه الشجرة المنتنة فلا يقربن مسجدنا فإن الملائكة تأذى مما يتأذى منه الإنس ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) forbade eating of onions and leek. When we were overpowered by a desire (to eat) we ate them. Upon this he (the Holy Prophet) said: He who eats of this offensive plant must not approach our mosque, for the angels are harmed by the same things as men.",
      "chain": [
        "30201",
        "20633",
        "20295",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، - فيما قرئ عليه - عن أبي الزبير، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يعلمهم هذا الدعاء كما يعلمهم السورة من القرآن يقول ‏\"‏ قولوا اللهم إنا نعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏ قال مسلم بن الحجاج بلغني أن طاوسا قال لابنه أدعوت بها في صلاتك فقال لا ‏.‏ قال أعد صلاتك لأن طاوسا رواه عن ثلاثة أو أربعة أو كما قال ‏.‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace he upon him) used to teach them this supplication (in the same spirit) with which he used to teach them a surah of the Qur'an. He would thus instruct us:                     \" Say, O Allah I we seek refuge with Thee from the torment of Hell, and I seek refuge with Thee from the torment of the grave, and I seek refuge with Thee from the trial of Masih al-Dajjal. and I seek refuge with Thee from the trial of life and death.\" Muslim b. Hajjaj said: It has reached me that Tawus said to his son: Did you make this supplication in prayer? He said: No. (Upon this) he (Tawus) said: Repeat the prayer. Tawus has narrated this hadith through three or four (transmitters) with words to the same effect.",
      "chain": [
        "30367",
        "20001",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا هشام، عن أبي الزبير، قال كان ابن الزبير يقول في دبر كل صلاة حين يسلم ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا حول ولا قوة إلا بالله لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏\"‏ ‏.‏ وقال كان رسول الله صلى الله عليه وسلم يهلل بهن دبر كل صلاة ‏.‏",
      "text_en": " Abu Zubair reported:                      Ibn Zubair uttered at the end of every prayer after pronouncing salutation (these words):\" There is no god but Allah. He is alone. There is no partner with Him. Sovereignty belongs to Him and He is Potent over everything. There is no might or power except with Allah. There is no god but Allah and we do not worship but Him alone. To Him belong all bounties, to Him belongs all Grace, and to Him is worthy praise accorded. There is no god but Allah, to Whom we are sincere in devotion, even though the unbelievers should disapprove it.\" (The narrator said): He (the Holy Prophet) uttered it at the end of every (obligatory) prayer.",
      "chain": [
        "30212",
        "20331",
        "20295",
        "11263",
        "106"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا ابن علية، حدثنا الحجاج بن أبي عثمان، حدثني أبو الزبير، قال سمعت عبد الله بن الزبير، يخطب على هذا المنبر وهو يقول كان رسول الله صلى الله عليه وسلم يقول إذا سلم في دبر الصلاة أو الصلوات ‏.‏ فذكر بمثل حديث هشام بن عروة ‏.‏",
      "text_en": " Abu Zubair reported:                      I heard Abdullah b. Zubair addressing (people) on the pulpit and saying: When the Messenger of Allah (may peace be upon him) pronounced salutation at the end of the prayer or prayers, and then he made a mention of the hadith as transmitted by Hisham b. 'Urwa.",
      "chain": [
        "30400",
        "20208",
        "11263"
      ]
    },
    {
      "hadith_no": "1374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يحيى بن عبد الله بن سالم، عن موسى بن عقبة، أن أبا الزبير المكي، حدثه أنه، سمع عبد الله بن الزبير، وهو يقول في إثر الصلاة إذا سلم ‏.‏ بمثل حديثهما وقال في آخره وكان يذكر ذلك عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Zubair al-Makki reported that he had heard 'Abdullah b. Zubair uttering (the words) like that of the hadith (narrated above) at the end of the prayer after pronouncing salutation. He at the conclusion also said that he was making a mention of that from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30491",
        "20029",
        "11106",
        "11263",
        "106"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، أخبرني الحجاج بن أبي عثمان، عن أبي الزبير، عن عون بن عبد الله بن عتبة، عن ابن عمر، قال بينما نحن نصلي مع رسول الله صلى الله عليه وسلم إذ قال رجل من القوم الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من القائل كلمة كذا وكذا ‏\"‏ ‏.‏ قال رجل من القوم أنا يا رسول الله ‏.‏ قال ‏\"‏ عجبت لها فتحت لها أبواب السماء ‏\"‏ ‏.‏ قال ابن عمر فما تركتهن منذ سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏  حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح  قال وحدثني محمد بن جعفر بن زياد، أخبرنا إبراهيم، - يعني ابن سعد - عن الزهري، عن سعيد، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": " Ibn 'Umar reported:                      While we said prayer with the Messenger of Allah (may peace be upon him), one among the people said: Allah is truly Great, praise be to Allah in abundance. Glory be to Allah in the morning and the evening. The Messenger of Allah (may peace be upon, him) said: Who uttered such and such a word? A person among the people said: It is I, Messenger of Allah (who have recited these words). He (the Holy Prophet) said: It (its utterance) surprised me, for the doors of heaven were opened for It. Ibn 'Umar said: I have not abandoned them (these words) since I heard the Messenger of Allah (may peace be upon him) saying this.",
      "chain": [
        "30022",
        "20208",
        "11263",
        "10806",
        "18"
      ]
    },
    {
      "hadith_no": "1550",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، قال سمعت جابر بن عبد الله، قال كانت ديارنا نائية عن المسجد، فأردنا أن نبيع، بيوتنا فنقترب من المسجد فنهانا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن لكم بكل خطوة درجة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah narrated:                      Our houses were situated far away from the mosque; we, therefore, decided to sell our houses so that we may be able to come near the mosque. The Messenger of Allah (may peace be upon him) forbade us (to do so) and said: There is for every step (towards the mosque) a degree (of reward) for you.",
      "chain": [
        "38834",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1635",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن أبي الزبير، عن جابر، ح",
      "text_en": "",
      "chain": [
        "30399",
        "30022",
        "11263"
      ]
    },
    {
      "hadith_no": "1636",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أحمد بن يونس، قال حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال خرجنا مع رسول الله صلى الله عليه وسلم في سفر فمطرنا فقال ‏\"‏ ليصل من شاء منكم في رحله ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      We set cut with the Messenger of Allah (may peace be upon him) on a journey when it began to rain. Upon this he said: He who desires may pray in his dwelling.",
      "chain": [
        "30184",
        "20321",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي الزبير، عن سعيد بن جبير، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر والعصر جميعا والمغرب والعشاء جميعا في غير خوف ولا سفر ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) observed the noon and afternoon prayers together, and the sunset and Isha' prayers together without being in a state of fear or in a state of journey.",
      "chain": [
        "30399",
        "11263",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1663",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أحمد بن يونس، وعون بن سلام، جميعا عن زهير، - قال ابن يونس حدثنا زهير، - حدثنا أبو الزبير، عن سعيد بن جبير، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر والعصر جميعا بالمدينة في غير خوف ولا سفر ‏.‏ قال أبو الزبير فسألت سعيدا لم فعل ذلك فقال سألت ابن عباس كما سألتني فقال أراد أن لا يحرج أحدا من أمته ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) observed the noon and afternoon prayers together in Medina without being in a state of fear or in a state of journey. (Abu Zubair said: I asked Sa'id [one of the narrators] why he did that. He said: I asked Ibn 'Abbas as you have asked me, and he replied that he [the Holy Prophet] wanted that no one among his Ummah should be put to [unnecessary] hardship.)",
      "chain": [
        "30184",
        "30474",
        "20321",
        "20321",
        "11263",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة، حدثنا أبو الزبير، حدثنا سعيد بن جبير، حدثنا ابن عباس، أن رسول الله صلى الله عليه وسلم جمع بين الصلاة في سفرة سافرها في غزوة تبوك فجمع بين الظهر والعصر والمغرب والعشاء ‏.‏ قال سعيد فقلت لابن عباس ما حمله على ذلك قال أراد أن لا يحرج أمته ‏.‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) combined the prayers as he set on a journey in the expedition to Tabuk. He combined the noon prayer with the afternoon prayer and the sunset prayer with the 'Isha' prayer. Sa'id (one of the rawis) said to Ibn 'Abbas:                      What prompted him to do this? He said: He wanted that his Ummah should not be put to (unnecessary) hardship.",
      "chain": [
        "20226",
        "11301",
        "11263",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1665",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن أبي الطفيل، عامر عن معاذ، قال خرجنا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فكان يصلي الظهر والعصر جميعا والمغرب والعشاء جميعا ‏.‏",
      "text_en": " Mu'adh reported:                      We set out with the Messenger of Allah (may peace be upon him) on the Tabuk expedition, and he observed the noon and afternoon prayers together and the sunset and 'Isha' prayers together.",
      "chain": [
        "30184",
        "20321",
        "11263",
        "32"
      ]
    },
    {
      "hadith_no": "1666",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة بن خالد، حدثنا أبو الزبير، حدثنا عامر بن واثلة أبو الطفيل، حدثنا معاذ بن جبل، قال جمع رسول الله صلى الله عليه وسلم في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ قال فقلت ما حمله على ذلك قال فقال أراد أن لا يحرج أمته ‏.‏",
      "text_en": " Mu'adh b. Jabal reported:                      The Messenger of Allah (may peace be upon him) combined in the expedition to Tabuk the noon prayer with the afternoon prayer and the sunset prayer with the 'Isha' prayer. He (one of the narrators) said: What prompted him to do that? He (Mu'adh) replied that he (the Holy Prophet) wanted that his Ummah should not be put to (unnecessary) hardship.",
      "chain": [
        "20226",
        "11301",
        "11263",
        "32"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أيكم خاف أن لا يقوم من آخر الليل فليوتر ثم ليرقد ومن وثق بقيام من الليل فليوتر من آخره فإن قراءة آخر الليل محضورة وذلك أفضل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent prayer is that in which the duration of standing is longer.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1804",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا أبو عاصم، أخبرنا ابن جريج، أخبرني أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصلاة طول القنوت ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) was asked about the prayer which was most excellent. He said: That in which the standing is longer. (This hadith is narrated by another chain of transmitters too.)",
      "chain": [
        "30553",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الليل ساعة لا يوافقها عبد مسلم يسأل الله خيرا إلا أعطاه إياه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Our Lord, the Blessed and the Exalted, descends every night to the lowest heaven when one-third of the latter part of the night is left, and says: Who supplicates Me so that I may answer him? Who asks Me so that I may give to him? Who asks Me forgiveness so that I may forgive him?",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 651
}