{
  "id": "11264",
  "name": "Yusuf bin Mahk يوسف بن ماهك الفارسي",
  "full_name": "Yusuf bin Mahk يوسف بن ماهك الفارسي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "106",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "423",
      "name": "Hakim ibn Hizam ( حكيم بن حزام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "487",
      "name": "'Abdullah bin Safwan bin Umayyah ( عبد الله بن صفوان بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11259",
      "name": "'Ubaid bin 'Umayr bin Qatada عبيد بن عمير بن قتادة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10521",
      "name": "Hafsa bint 'Abdur-Rahman ibn Abi Bakr حفصة بنت عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19212",
      "name": "Abu Bsrh أبو بسرة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10739",
      "name": "Ibrahim bin Mhajr bin Jabir إبراهيم بن مهاجر بن جابر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11567",
      "name": "Y'la bin Hkym al-Thqfy يعلى بن حكيم الثقفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "13132",
      "name": "al-Walid bin 'Abdullah الوليد بن عبد الله بن أبي مغيث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11369",
      "name": "'Abdul Malik bin Mysrh عبد الملك بن ميسرة الزراد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "60",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو النعمان، عارم بن الفضل قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف عنا النبي صلى الله عليه وسلم في سفرة سافرناها، فأدركنا وقد أرهقتنا الصلاة ونحن نتوضأ، فجعلنا نمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Once the Prophet remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire.\"",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "96",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف رسول الله صلى الله عليه وسلم في سفر سافرناه فأدركنا وقد أرهقنا الصلاة صلاة العصر ونحن نتوضأ، فجعلنا نمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Once Allah's Apostle remained behind us in a journey. He joined us while we were performing ablution for the `Asr prayer which was over-due. We were just passing wet hands over our feet (not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice, \"Save your heels from the fire.\"",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "163",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى، قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف النبي صلى الله عليه وسلم عنا في سفرة سافرناها، فأدركنا وقد أرهقنا العصر، فجعلنا نتوضأ ونمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet remained behind us on a journey. He joined us while we were performing ablution for the `Asr prayer which was overdue and we were just passing wet hands over our feet (not washing them thoroughly) so he addressed us in a loud voice saying twice , \"Save your heels from the fire.\"",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "4876",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، قال كان مروان على الحجاز استعمله معاوية، فخطب فجعل يذكر يزيد بن معاوية، لكى يبايع له بعد أبيه، فقال له عبد الرحمن بن أبي بكر شيئا، فقال خذوه‏.‏ فدخل بيت عائشة فلم يقدروا ‏{‏عليه‏}‏ فقال مروان إن هذا الذي أنزل الله فيه ‏{‏والذي قال لوالديه أف لكما أتعدانني‏}‏‏.‏ فقالت عائشة من وراء الحجاب ما أنزل الله فينا شيئا من القرآن إلا أن الله أنزل عذري‏.‏",
      "text_en": " Narrated Yusuf bin Mahak:                     Marwan had been appointed as the governor of Hijaz by Muawiya. He delivered a sermon and mentioned Yazid bin Muawiya so that the people might take the oath of allegiance to him as the successor of his father (Muawiya). Then `Abdur Rahman bin Abu Bakr told him something whereupon Marwan ordered that he be arrested. But `Abdur-Rahman entered `Aisha's house and they could not arrest him. Marwan said, \"It is he (`AbdurRahman) about whom Allah revealed this Verse:-- 'And the one who says to his parents: 'Fie on you! Do you hold out the promise to me..?'\" On that, `Aisha said from behind a screen, \"Allah did not reveal anything from the Qur'an about us except what was connected with the declaration of my innocence (of the slander).",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11264"
      ]
    },
    {
      "hadith_no": "4925",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني يوسف بن ماهك، قال إني عند عائشة أم المؤمنين قالت لقد أنزل على محمد صلى الله عليه وسلم بمكة، وإني لجارية ألعب ‏{‏بل الساعة موعدهم والساعة أدهى وأمر‏}‏",
      "text_en": " Narrated Yusuf bin Mahik:                     I was in the house of `Aisha, the mother of the Believers. She said, \"This revelation: \"Nay, but the Hour is their appointed time (for their full recompense); and the Hour will be more previous and most bitter.\" (54.46) was revealed to Muhammad at Mecca while I was a playfull little girl.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11264"
      ]
    },
    {
      "hadith_no": "5044",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال وأخبرني يوسف بن ماهك، قال إني عند عائشة أم المؤمنين  رضى الله عنها  إذ جاءها عراقي فقال أى الكفن خير قالت ويحك وما يضرك قال يا أم المؤمنين أريني مصحفك‏.‏ قالت لم قال لعلي أولف القرآن عليه فإنه يقرأ غير مؤلف‏.‏ قالت وما يضرك أيه قرأت قبل، إنما نزل أول ما نزل منه سورة من المفصل فيها ذكر الجنة والنار حتى إذا ثاب الناس إلى الإسلام نزل الحلال والحرام، ولو نزل أول شىء لا تشربوا الخمر‏.‏ لقالوا لا ندع الخمر أبدا‏.‏ ولو نزل‏.‏ لا تزنوا‏.‏ لقالوا لا ندع الزنا أبدا‏.‏ لقد نزل بمكة على محمد صلى الله عليه وسلم وإني لجارية ألعب ‏{‏بل الساعة موعدهم والساعة أدهى وأمر‏}‏ وما نزلت سورة البقرة والنساء إلا وأنا عنده‏.‏ قال فأخرجت له المصحف فأملت عليه آى السور‏.‏",
      "text_en": " Narrated Yusuf bin Mahk:                     While I was with Aisha, the mother of the Believers, a person from Iraq came and asked, \"What type of shroud is the best?\" `Aisha said, \"May Allah be merciful to you! What does it matter?\" He said, \"O mother of the Believers! Show me (the copy of) your Qur'an,\" She said, \"Why?\" He said, \"In order to compile and arrange the Qur'an according to it, for people recite it with its Suras not in proper order.\" `Aisha said, \"What does it matter which part of it you read first? (Be informed) that the first thing that was revealed thereof was a Sura from Al-Mufassal, and in it was mentioned Paradise and the Fire. When the people embraced Islam, the Verses regarding legal and illegal things were revealed. If the first thing to be revealed was: 'Do not drink alcoholic drinks.' people would have said, 'We will never leave alcoholic drinks,' and if there had been revealed, 'Do not commit illegal sexual intercourse, 'they would have said, 'We will never give up illegal sexual intercourse.' While I was a young girl of playing age, the following Verse was revealed in Mecca to Muhammad: 'Nay! But the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.' (54.46) Sura Al-Baqara (The Cow) and Surat An-Nisa (The Women) were revealed while I was with him.\" Then `Aisha took out the copy of the Qur'an for the man and dictated to him the Verses of the Suras (in their proper order) .",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11264"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا شيبان بن فروخ، وأبو كامل الجحدري جميعا عن أبي عوانة، - قال أبو كامل حدثنا أبو عوانة، - عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف عنا النبي صلى الله عليه وسلم في سفر سافرناه فأدركنا وقد حضرت صلاة العصر فجعلنا نمسح على أرجلنا فنادى ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr reported:                      The Messenger of Allah (may peace be upon him) lagged behind us on a journey. We travelled (back) and be took him; and then came the time of the afternoon prayer, and as we were going to wipe our feet he (the Holy Prophet) called out: Woe to the heels because of Hell-fire.",
      "chain": [
        "20656",
        "30559",
        "20469",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "7424",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا الوليد بن صالح، حدثنا عبيد الله بن، عمرو حدثنا زيد بن أبي أنيسة، عن عبد الملك العامري، عن يوسف بن ماهك، أخبرني  عبد الله بن صفوان، عن أم المؤمنين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سيعوذ بهذا البيت - يعني الكعبة - قوم ليست لهم منعة ولا عدد ولا عدة يبعث إليهم جيش حتى إذا كانوا ببيداء من الأرض خسف بهم ‏\"‏ ‏.‏ قال يوسف وأهل الشأم يومئذ يسيرون إلى مكة فقال عبد الله بن صفوان أما والله ما هو بهذا الجيش ‏.‏   قال زيد وحدثني عبد الملك العامري، عن عبد الرحمن بن سابط، عن الحارث، بن أبي ربيعة عن أم المؤمنين، ‏.‏ بمثل حديث يوسف بن ماهك غير أنه لم يذكر فيه الجيش الذي ذكره عبد الله بن صفوان ‏.‏",
      "text_en": " Abdullah b. Safwan reported the Mother of the Faithful as saying that Allah's Messenger (may peace be upon him) said:                      They would soon seek protection in this House, viz. Ka'ba (the defenceless), people who would have nothing to protect themselves in the shape of weapons or the strength of the people. An army would be sent to fight (and kill) them and when they would enter a plain ground the army would be sunk in it. Yiisuf (one of the narrators) said: It was a people of Syria (hordes of Hajjaj) who had been on that day comin. towards Mecca for an attack (on 'Abdulllah b. Zubair) and Abdullah b. Safwan said: By God, it does not imply this army.",
      "chain": [
        "30514",
        "20392",
        "30024",
        "11340",
        "11264",
        "487",
        "53"
      ]
    },
    {
      "hadith_no": "654",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عثمان بن عمر، حدثنا صالح بن رستم أبو عامر، عن عبد الرحمن بن قيس، عن يوسف بن ماهك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فلا يضع نعليه عن يمينه ولا عن يساره فتكون عن يمين غيره إلا أن لا يكون عن يساره أحد وليضعهما بين رجليه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When any of you prays, he should not place his sandals on his right side or on his left so as to be on the right side of someone else, unless no one is at his left, but should place them between his feet.",
      "chain": [
        "30115",
        "20262",
        "17514",
        "11264",
        "13"
      ]
    },
    {
      "hadith_no": "1995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا داود بن عبد الرحمن، حدثني عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن بن أبي بكر، عن أبيها، أن رسول الله صلى الله عليه وسلم قال لعبد الرحمن ‏\"‏ يا عبد الرحمن أردف أختك عائشة فأعمرها من التنعيم فإذا هبطت بها من الأكمة فلتحرم فإنها عمرة متقبلة ‏\"‏ ‏.‏",
      "text_en": " Hafsah, daughter of AbdurRahman ibn AbuBakr, reported on the authority of her father:                      The Messenger of Allah (ﷺ) said to AbdurRahman: AbdurRahman, put your sister Aisha on the back of the camel behind you and make her perform umrah from at-Tan'im. When you come down from the hillock (in at-Tan'im), she must wear (ihram for umrah), for this is an umrah accepted (by Allah).",
      "chain": [
        "30146",
        "20192",
        "10644",
        "11264",
        "10521",
        "107"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، حدثنا إسرائيل، عن إبراهيم بن مهاجر، عن يوسف بن ماهك، عن أمه، عن عائشة، قالت قلت يا رسول الله ألا نبني لك بمنى بيتا أو بناء يظلك من الشمس فقال ‏\"‏ لا إنما هو مناخ من سبق إليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I said: Messenger of Allah, should we not build a house or a building which shades you from the sun? He replied: No, it is a place for the one who reaches there earlier.",
      "chain": [
        "30007",
        "20033",
        "20311",
        "10739",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "2833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن، عن عائشة، قالت أمرنا رسول الله صلى الله عليه وسلم من كل خمسين شاة شاة ‏.‏ قال أبو داود قال بعضهم الفرع أول ما تنتج الإبل كانوا يذبحونه لطواغيتهم ثم يأكلونه ويلقى جلده على الشجر والعتيرة في العشر الأول من رجب ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to sacrifice goat out of every fifty goats.Abu Dawud said: Fara' means the first baby camel born (to the Arabs). They used to sacrifice it for their idols, and then eat it, and its skin was thrown on a tree. 'Atira was a sacrifice made during the first ten days of Rajab.",
      "chain": [
        "20040",
        "20022",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3503",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن حكيم بن حزام، قال يا رسول الله يأتيني الرجل فيريد مني البيع ليس عندي أفأبتاعه له من السوق فقال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " Narrated Hakim ibn Hizam:                     Hakim asked (the Prophet): Messenger of Allah, a man comes to me and wants me to sell him something which is not in my possession. Should I buy it for him from the market? He replied: Do not sell what you do not possess.",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "hadith_no": "3534",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كامل، أن يزيد بن زريع، حدثهم حدثنا حميد، - يعني الطويل - عن يوسف بن ماهك المكي، قال كنت أكتب لفلان نفقة أيتام كان وليهم فغالطوه بألف درهم فأداها إليهم فأدركت لهم من مالهم مثليها ‏.‏ قال قلت أقبض الألف الذي ذهبوا به منك قال لا حدثني أبي أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏",
      "text_en": " Narrated Yusuf ibn Malik al-Makki:                     I used to write (the account of) the expenditure incurred on orphans who were under the guardianship of so-and-so. They cheated him by one thousand dirhams and he paid these (this amount) to them. I then got double the property which they deserved. I said (to the man: Take one thousand (dirhams) which they have taken from you (by cheating). He said: No, my father has told me that he heard the Messenger of Allah (ﷺ) say: Pay the deposit to him who deposited it with you, and do not betray him who betrays you.",
      "chain": [
        "30559",
        "20304",
        "11279",
        "11264"
      ]
    },
    {
      "hadith_no": "3646",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا مسدد، وأبو بكر بن أبي شيبة قالا حدثنا يحيى، عن عبيد الله بن الأخنس، عن الوليد بن عبد الله بن أبي مغيث، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال كنت أكتب كل شىء أسمعه من رسول الله صلى الله عليه وسلم أريد حفظه فنهتني قريش وقالوا أتكتب كل شىء تسمعه ورسول الله صلى الله عليه وسلم بشر يتكلم في الغضب والرضا فأمسكت عن الكتاب فذكرت ذلك لرسول الله صلى الله عليه وسلم فأومأ بأصبعه إلى فيه فقال ‏\"‏ اكتب فوالذي نفسي بيده ما يخرج منه إلا حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I used to write everything which I heard from the Messenger of Allah (ﷺ). I intended (by it) to memorise it. The Quraysh prohibited me saying: Do you write everything  that you hear from him while the Messenger of Allah (ﷺ) is a human being: he speaks in anger and pleasure? So I stopped writing, and mentioned it to the Messenger of Allah (ﷺ). He signalled with his finger to him mouth and said: Write, by Him in Whose hand my soul lies, only right comes out from it.",
      "chain": [
        "30175",
        "30201",
        "20031",
        "20444",
        "13132",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "3905",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومسدد، - المعنى - قالا حدثنا يحيى، عن عبيد الله بن الأخنس، عن الوليد بن عبد الله، عن يوسف بن ماهك، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتبس علما من النجوم اقتبس شعبة من السحر زاد ما زاد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone acquires any knowledge of astrology, he acquires a branch of magic of which he gets more as long as he continues to do so.",
      "chain": [
        "30201",
        "20031",
        "20444",
        "11264",
        "17"
      ]
    },
    {
      "hadith_no": "881",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، ومحمد بن أبان، قالا حدثنا وكيع، عن إسرائيل، عن إبراهيم بن مهاجر، عن يوسف بن ماهك، عن أمه، مسيكة عن عائشة، قالت قلنا يا رسول الله ألا نبني لك بيتا يظلك بمنى قال ‏\"‏ لا منى مناخ من سبق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Aishah said:                     \"We said: 'O Messenger of Allah! Shall we build a structure to shade you at Mina? He said: 'No., Mina is a resting place for whoever arrives.'\"",
      "chain": [
        "30401",
        "30369",
        "20032",
        "20311",
        "10739",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "1232",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا هشيم، عن أبي بشر، عن يوسف بن ماهك، عن حكيم بن حزام، قال أتيت رسول الله صلى الله عليه وسلم فقلت يأتيني الرجل يسألني من البيع ما ليس عندي أبتاع له من السوق ثم أبيعه قال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمر ‏.‏",
      "text_en": " Narrated Hakim b. Hizam:                     \"I asked Messenger of Allah (ﷺ), I said: 'A man came to me asking to buy something that I did not have. Can I buy it from the market for him and then give it to him?' He said: 'Do not sell what is not with you.'\"He said: There are narrations on this topic from 'Abdullah bin 'Umar.",
      "chain": [
        "30367",
        "20468",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "hadith_no": "1233",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن يوسف بن ماهك، عن حكيم بن حزام، قال نهاني رسول الله صلى الله عليه وسلم أن أبيع ما ليس عندي ‏.‏ قال أبو عيسى وهذا حديث حسن ‏.‏ قال إسحاق بن منصور قلت لأحمد ما معنى نهى عن سلف وبيع قال أن يكون يقرضه قرضا ثم يبايعه عليه بيعا يزداد عليه ويحتمل أن يكون يسلف إليه في شيء فيقول إن لم يتهيأ عندك فهو بيع عليك ‏.‏ قال إسحاق يعني ابن راهويه كما قال قلت لأحمد وعن بيع ما لم تضمن قال لا يكون عندي إلا في الطعام ما لم تقبض ‏.‏ قال إسحاق كما قال في كل ما يكال أو يوزن ‏.‏ قال أحمد إذا قال أبيعك هذا الثوب وعلى خياطته وقصارته فهذا من نحو شرطين في بيع وإذا قال أبيعكه وعلى خياطته فلا بأس به أو قال أبيعكه وعلى قصارته فلا بأس به إنما هو شرط واحد ‏.‏ قال إسحاق كما قال ‏.‏",
      "text_en": " Narrated Hakim b. Hizam:                     \"The Messenger of Allah (ﷺ) prohibited me from selling what was not with me.\"[Abu 'Eisa said:] This Hadith is Hasan. He said: There is something on this topic from 'Abdullah bin 'Umar.Ishaq bin Mansur said: \"I said to Ahmad: 'What is the meaning of the prohibition from a loan along with a sale? He said: 'That he gives him a loan and then he makes a sale to him greater then it's actual worth. And, it carries the meaning of him loaning it to him in exchange for something (as collateral), so he says: 'If you are unable to pay it (the loan), the it (the collateral) will be a sale for you.' Ishaq [bin Rahuwyah] said as he said. And I said to Ahmad: 'What about selling what one does not possess?' He said: 'To me it does not apply except in cases of food - meaning one has not taken possession of it.' And Ishaq said the same for all of what is measured or weighed. Ahmad said: 'When he says: \"I will sell you this garment, with the condition that I am the tailor for it, and I am the one who bleaches it.' This is an example of two conditions in one sale. But if he says: \"I am selling it to you with the condition that I am its tailor,\" then there is no harm in it. And, if he said: \"I am selling it to you with the condition that I am the one who bleaches it\" then there is no harm in it, because this is only one condition.' And Ishaq said as he said.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11264",
        "423"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الخلال، وعبدة بن عبد الله الخزاعي البصري أبو سهل، وغير، واحد، قالوا حدثنا عبد الصمد بن عبد الوارث، عن يزيد بن إبراهيم، عن ابن سيرين، عن أيوب، عن يوسف بن ماهك، عن حكيم بن حزام، قال نهاني رسول الله صلى الله عليه وسلم أن أبيع ما ليس عندي ‏.‏ قال أبو عيسى وروى وكيع هذا الحديث عن يزيد بن إبراهيم عن ابن سيرين عن أيوب عن حكيم بن حزام ‏.‏ ولم يذكر فيه عن يوسف بن ماهك ورواية عبد الصمد أصح ‏.‏ وقد روى يحيى بن أبي كثير هذا الحديث عن يعلى بن حكيم عن يوسف بن ماهك عن عبد الله بن عصمة عن حكيم بن حزام عن النبي صلى الله عليه وسلم ‏.‏ والعمل على هذا الحديث عند أكثر أهل العلم كرهوا أن يبيع الرجل ما ليس عنده ‏.‏",
      "text_en": " Narrated Hakim b. Hizam:                     \"The Messenger of Allah (ﷺ) prohibited me from selling what was not with me.\"[Abu 'Eisa said:] Waki' reported this Hadith from Yazid bin Ibrahim, from Ibn Sirin, from Ayyub, from Hakim bin Hizam, and he did not mention in it: \"From Yusuf bin Mahak.\"And the narration of 'Abdus-Samad (a narrator in the chain of Hadith no. 1235) is more correct.Yahya bin Abi Kathir reported this Hadith from Ya'la bin Hakim, from Yusuf bin Mahak, from 'Abdullah bin 'Ismah, from Hakim bin Hizam, from the Prophet (ﷺ).This Hadith is acted upon according to most of the people of knowledge, they dislike for a man to sell what is not with him.",
      "chain": [
        "30115",
        "20250",
        "20303",
        "11035",
        "11015",
        "11264",
        "423"
      ]
    },
    {
      "hadith_no": "1513",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، أخبرنا عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، أنهم دخلوا على حفصة بنت عبد الرحمن فسألوها عن العقيقة، فأخبرتهم أن عائشة أخبرتها أن رسول الله صلى الله عليه وسلم أمرهم عن الغلام شاتان مكافئتان وعن الجارية شاة ‏.‏ قال وفي الباب عن علي وأم كرز وبريدة وسمرة وأبي هريرة وعبد الله بن عمرو وأنس وسلمان بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وحفصة هي بنت عبد الرحمن بن أبي بكر الصديق ‏.‏",
      "text_en": " Narrated Yusuf bin Mahak:                     They entered upon Hafsah bint 'Abdur-Rahman to ask her about the 'Aqiqah. She informed them that 'Aishah had informed her, that the Messenger of Allah (ﷺ) ordered them that for a boy, two sheep were sufficient, and for a girl one sheep.",
      "chain": [
        "30460",
        "20212",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "1084",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن أبي بشر، قال سمعت يوسف، - وهو ابن ماهك - يحدث عن حكيم، قال بايعت رسول الله صلى الله عليه وسلم أن لا أخر إلا قائما ‏.‏",
      "text_en": " It was narrated that Abu Bushr said:                     \"I heard Yusuf-meaning Ibn Mahak- narrating that Hakim said: 'I gave my pledge of allegiance to the Messenger of Allah (ﷺ), pledging that I would go down (in prostration) only after standing up from bowing.'\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11419",
        "11264"
      ]
    },
    {
      "hadith_no": "4613",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا زياد بن أيوب، قال حدثنا هشيم، قال حدثنا أبو بشر، عن يوسف بن ماهك، عن حكيم بن حزام، قال سألت النبي صلى الله عليه وسلم فقلت يا رسول الله يأتيني الرجل فيسألني البيع ليس عندي أبيعه منه ثم أبتاعه له من السوق ‏.‏ قال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"I asked the Prophet \"O Messenger of Allah, a man may come to me and ask me to sell him something that I do not have. Can I sell it to him then go and buy it from the market?' He said: 'Do not sell what you do not have.'''",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "hadith_no": "2117",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، حدثنا عبد الرحمن بن حبيب بن أردك، حدثنا عطاء بن أبي رباح، عن يوسف بن ماهك، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ثلاث جدهن جد وهزلهن جد النكاح والطلاق والرجعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah (ﷺ) said: \"There are three matters in which seriousness is serious and joking is serious: marriage, divorce and taking back (one's wife). \"",
      "chain": [
        "30288",
        "20159",
        "11029",
        "11264",
        "13"
      ]
    },
    {
      "hadith_no": "2271",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي بشر، قال سمعت يوسف بن ماهك، يحدث عن حكيم بن حزام، قال قلت يا رسول الله الرجل يسألني البيع وليس عندي أفأبيعه قال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"I said: 'O Messenger of Allah, a man is asking me to sell him something that I do not possess; Shall I sell it to him?' He said: 'Do not sell what is not with you.\"'",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "hadith_no": "3120",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن إسرائيل، عن إبراهيم بن مهاجر، عن يوسف بن ماهك، عن أمه، عن عائشة، قالت قلت يا رسول الله ألا نبني لك بمنى بيتا قال ‏\"‏ لا منى مناخ من سبق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      ‘I said: ‘O Messenger of Allah,should we not build you a house in Mina?’ He said: ‘No, Mina isjust astopping place for those who get there first.’”",
      "chain": [
        "30201",
        "20032",
        "20311",
        "10739",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3121",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، عن إسرائيل، عن إبراهيم بن مهاجر، عن يوسف بن ماهك، عن أمه، مسيكة عن عائشة، قالت قلنا يا رسول الله ألا نبني لك بمنى بنيانا يظلك قال ‏\"‏ لا منى مناخ من سبق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We said: ‘O Messenger of Allah,should we not build you a house in Mina that will be a means of shadefor you?’ He said: ‘No, Mina is just a stopping place for thosewhoget there first.’”",
      "chain": [
        "38409",
        "20032",
        "20311",
        "10739",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3283",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، أنبأنا عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، عن حفصة بنت عبد الرحمن، عن عائشة، قالت أمرنا رسول الله  صلى الله عليه وسلم  أن نعق عن الغلام شاتين وعن الجارية شاة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ)commanded us to sacrifice two sheep for a boy’s ‘Aqiqah and onesheepfor a girl.”",
      "chain": [
        "30201",
        "30106",
        "20021",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3726",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن سعيد، عن عبيد الله بن الأخنس، عن الوليد بن عبد الله، عن يوسف بن ماهك، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من اقتبس علما من النجوم اقتبس شعبة من السحر زاد ما زاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah(ﷺ) said:                     \"Whoever learns about the stars, he learns a branch of magic; the more he learns (of the former) the more he learns (of the latter).\"",
      "chain": [
        "20436",
        "20031",
        "20444",
        "11264",
        "17"
      ]
    },
    {
      "hadith_no": "3761",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، عن شيبان، عن الأعمش، عن عمرو بن مرة، عن يوسف بن ماهك، عن عبيد بن عمير، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أعظم الناس فرية لرجل هاجى رجلا فهجا القبيلة بأسرها ورجل انتفى من أبيه وزنى أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aisha that the Messenger of Allah(ﷺ) said:                     \"The worst of all people lying is a man who trades insults with another man, disparaging the entire tribe, and a man who denies his father and accuses his mother of adultery.\"",
      "chain": [
        "30201",
        "11201",
        "20240",
        "11060",
        "11381",
        "11264",
        "11259",
        "53"
      ]
    }
  ],
  "total_hadiths": 30
}