{
  "id": "11272",
  "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
  "full_name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "85",
      "date_gregorian": "704",
      "date_display": [
        "85 AH",
        "704 CE"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "170",
      "date_gregorian": "786",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10655",
      "name": "Qays bin Sa'd al-Mky قيس بن سعد المكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20267",
      "name": "'Amr bin 'Asim al-Kalabi عمرو بن عاصم الكلابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20219",
      "name": "Hajjaj bin al-Minhal حجاج بن المنهال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30137",
      "name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20663",
      "name": "Abu Nasr al-Tamar أبو نصر التمار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20294",
      "name": "Hadba bin Khalid bin al-Aswad هدبة بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "467",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت يعلى بن حكيم، عن عكرمة، عن ابن عباس، قال خرج رسول الله صلى الله عليه وسلم في مرضه الذي مات فيه عاصب رأسه بخرقة، فقعد على المنبر، فحمد الله وأثنى عليه ثم قال ‏\"‏ إنه ليس من الناس أحد أمن على في نفسه وماله من أبي بكر بن أبي قحافة، ولو كنت متخذا من الناس خليلا لاتخذت أبا بكر خليلا، ولكن خلة الإسلام أفضل، سدوا عني كل خوخة في هذا المسجد غير خوخة أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"Allah's Apostle in his fatal illness came out with a piece of cloth tied round his head and sat on the pulpit. After thanking and praising Allah he said, \"There is no one who had done more favor to me with life and property than Abu Bakr bin Abi Quhafa. If I were to take a Khalil, I would certainly have taken Abu- Bakr but the Islamic brotherhood is superior. Close all the small doors in this mosque except that of Abu Bakr.\"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11567",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "845",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جرير بن حازم، قال حدثنا أبو رجاء، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى صلاة أقبل علينا بوجهه‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet used to face us on completion of the prayer.",
      "chain": [
        "20040",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "923",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن معمر، قال حدثنا أبو عاصم، عن جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، أن رسول الله صلى الله عليه وسلم أتي بمال أو سبى فقسمه، فأعطى رجالا وترك رجالا فبلغه أن الذين ترك عتبوا، فحمد الله ثم أثنى عليه، ثم قال ‏\"‏ أما بعد، فوالله إني لأعطي الرجل، وأدع الرجل، والذي أدع أحب إلى من الذي أعطي ولكن أعطي أقواما لما أرى في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير، فيهم عمرو بن تغلب ‏\"‏‏.‏ فوالله ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ تابعه يونس‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     Some property or something was brought to Allah's Apostle and he distributed it. He gave to some men and ignored the others. Later he got the news of his being admonished by those whom he had ignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and ignore another, although the one whom I ignore is more beloved to me than the one whom I give. But I give to some people as I feel that they have no patience and no contentment in their hearts and I leave those who are patient and self-content with the goodness and wealth which Allah has put into their hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's Apostle are more beloved to me than the best red camels.",
      "chain": [
        "30172",
        "20241",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "1323",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، قال سمعت نافعا، يقول حدث ابن عمر، أن أبا هريرة  رضى الله عنهم  يقول من تبع جنازة فله قيراط‏.‏ فقال أكثر أبو هريرة علينا‏.‏   فصدقت  يعني عائشة  أبا هريرة وقالت سمعت رسول الله صلى الله عليه وسلم يقوله‏.‏ فقال ابن عمر  رضى الله عنهما  لقد فرطنا في قراريط كثيرة‏.‏ ‏{‏فرطت‏}‏ ضيعت من أمر الله‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar was told that Abu Huraira said, \"Whoever accompanies the funeral procession will have a reward equal to one Qirat.\" Ibn `Umar said, \"Abu Huraira talks of a too enormous reward.\" Aisha attested Abu Huraira's narration and said, \"I heard Allah's Apostle saying like that.\" Ibn `Umar said, \"We have lost numerous Qirats.\"",
      "chain": [
        "20283",
        "11272",
        "11014",
        "18",
        "13"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا أبو رجاء، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى صلاة أقبل علينا بوجهه فقال ‏\"‏ من رأى منكم الليلة رؤيا ‏\"‏‏.‏ قال فإن رأى أحد قصها، فيقول ما شاء الله، فسألنا يوما، فقال ‏\"‏ هل رأى أحد منكم رؤيا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ لكني رأيت الليلة رجلين أتياني فأخذا بيدي، فأخرجاني إلى الأرض المقدسة، فإذا رجل جالس، ورجل قائم بيده كلوب من حديد  قال بعض أصحابنا عن موسى إنه  يدخل ذلك الكلوب في شدقه، حتى يبلغ قفاه، ثم يفعل بشدقه الآخر مثل ذلك، ويلتئم شدقه هذا، فيعود فيصنع مثله‏.‏ قلت ما هذا قالا انطلق‏.‏ فانطلقنا حتى أتينا على رجل مضطجع على قفاه، ورجل قائم على رأسه بفهر أو صخرة، فيشدخ به رأسه، فإذا ضربه تدهده الحجر، فانطلق إليه ليأخذه، فلا يرجع إلى هذا حتى يلتئم رأسه، وعاد رأسه كما هو، فعاد إليه فضربه، قلت من هذا قالا انطلق‏.‏ فانطلقنا إلى ثقب مثل التنور، أعلاه ضيق وأسفله واسع، يتوقد تحته نارا، فإذا اقترب ارتفعوا حتى كاد أن يخرجوا، فإذا خمدت رجعوا فيها، وفيها رجال ونساء عراة‏.‏ فقلت من هذا قالا انطلق‏.‏ فانطلقنا حتى أتينا على نهر من دم، فيه رجل قائم على وسط النهر رجل بين يديه حجارة، فأقبل الرجل الذي في النهر، فإذا أراد أن يخرج رمى الرجل بحجر في فيه، فرده حيث كان، فجعل كلما جاء ليخرج رمى في فيه بحجر، فيرجع كما كان‏.‏ فقلت ما هذا قالا انطلق‏.‏ فانطلقنا حتى انتهينا إلى روضة خضراء، فيها شجرة عظيمة، وفي أصلها شيخ وصبيان، وإذا رجل قريب من الشجرة بين يديه نار يوقدها، فصعدا بي في الشجرة، وأدخلاني دارا لم أر قط أحسن منها، فيها رجال شيوخ وشباب، ونساء وصبيان، ثم أخرجاني منها فصعدا بي الشجرة فأدخلاني دارا هي أحسن وأفضل، فيها شيوخ وشباب‏.‏ قلت طوفتماني الليلة، فأخبراني عما رأيت‏.‏ قالا نعم، أما الذي رأيته يشق شدقه فكذاب يحدث بالكذبة، فتحمل عنه حتى تبلغ الآفاق، فيصنع به إلى يوم القيامة‏.‏ والذي رأيته يشدخ رأسه فرجل علمه الله القرآن، فنام عنه بالليل، ولم يعمل فيه بالنهار، يفعل به إلى يوم القيامة‏.‏ والذي رأيته في الثقب فهم الزناة‏.‏ والذي رأيته في النهر آكلو الربا‏.‏ والشيخ في أصل الشجرة إبراهيم  عليه السلام  والصبيان حوله فأولاد الناس، والذي يوقد النار مالك خازن النار‏.‏ والدار الأولى التي دخلت دار عامة المؤمنين، وأما هذه الدار فدار الشهداء، وأنا جبريل، وهذا ميكائيل، فارفع رأسك، فرفعت رأسي فإذا فوقي مثل السحاب‏.‏ قالا ذاك منزلك‏.‏ قلت دعاني أدخل منزلي‏.‏ قالا إنه بقي لك عمر لم تستكمله، فلو استكملت أتيت منزلك ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     Whenever the Prophet finished the (morning) prayer, he would face us and ask, \"Who amongst you had a dream last night?\" So if anyone had seen a dream he would narrate it. The Prophet would say: \"Ma sha'a-llah\" (An Arabic maxim meaning literally, 'What Allah wished,' and it indicates a good omen.) One day, he asked us whether anyone of us had seen a dream. We replied in the negative. The Prophet said, \"But I had seen (a dream) last night that two men came to me, caught hold of my hands, and took me to the Sacred Land (Jerusalem). There, I saw a person sitting and another standing with an iron hook in his hand pushing it inside the mouth of the former till it reached the jawbone, and then tore off one side of his cheek, and then did the same with the other side; in the meantime the first side of his cheek became normal again and then he repeated the same operation again. I said, 'What is this?' They told me to proceed on and we went on till we came to a man Lying flat on his back, and another man standing at his head carrying a stone or a piece of rock, and crushing the head of the Lying man, with that stone. Whenever he struck him, the stone rolled away. The man went to pick it up and by the time he returned to him, the crushed head had returned to its normal state and the man came back and struck him again (and so on). I said, 'Who is this?' They told me to proceed on; so we proceeded on and passed by a hole like an oven; with a narrow top and wide bottom, and the fire was kindling underneath that hole. Whenever the fire-flame went up, the people were lifted up to such an extent that they about to get out of it, and whenever the fire got quieter, the people went down into it, and there were naked men and women in it. I said, 'Who is this?' They told me to proceed on. So we proceeded on till we reached a river of blood and a man was in it, and another man was standing at its bank with stones in front of him, facing the man standing in the river. Whenever the man in the river wanted to come out, the other one threw a stone in his mouth and caused him to retreat to his original position; and so whenever he wanted to come out the other would throw a stone in his mouth, and he would retreat to his original position. I asked, 'What is this?' They told me to proceed on and we did so till we reached a well-flourished green garden having a huge tree and near its root was sitting an old man with some children. (I saw) Another man near the tree with fire in front of him and he was kindling it up. Then they (i.e. my two companions) made me climb up the tree and made me enter a house, better than which I have ever seen. In it were some old men and young men, women and children. Then they took me out of this house and made me climb up the tree and made me enter another house that was better and superior (to the first) containing old and young people. I said to them (i.e. my two companions), 'You have made me ramble all the night. Tell me all about that I have seen.' They said, 'Yes. As for the one whose cheek you saw being torn away, he was a liar and he used to tell lies, and the people would report those lies on his authority till they spread all over the world. So, he will be punished like that till the Day of Resurrection. The one whose head you saw being crushed is the one whom Allah had given the knowledge of Qur'an (i.e. knowing it by heart) but he used to sleep at night (i.e. he did not recite it then) and did not use to act upon it (i.e. upon its orders etc.) by day; and so this punishment will go on till the Day of Resurrection. And those you saw in the hole (like oven) were adulterers (those men and women who commit illegal sexual intercourse). And those you saw in the river of blood were those dealing in Riba (usury). And the old man who was sitting at the base of the tree was Abraham and the little children around him were the offspring of the people. And the one who was kindling the fire was Malik, the gatekeeper of the Hell-fire. And the first house in which you have gone was the house of the common believers, and the second house was of the martyrs. I am Gabriel and this is Michael. Raise your head.' I raised my head and saw a thing like a cloud over me. They said, 'That is your place.' I said, 'Let me enter my place.' They said, 'You still have some life which you have not yet completed, and when you complete (that remaining portion of your life) you will then enter your place.' \"",
      "chain": [
        "20040",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  أن أسامة  رضى الله عنه  كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى‏.‏ قال فكلاهما قال لم يزل النبي صلى الله عليه وسلم يلبي، حتى رمى جمرة العقبة‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas' said, \"Usama rode behind Allah's Apostle from `Arafat to Al-Muzdalifa; and then Al-Fadl rode behind Allah's Apostle from Al-Muzdalifa to Mina.\" Ibn `Abbas added, \"Both of them said, 'The Prophet kept on reciting Talbiya till he did the Rami of Jamrat-Al-`Aqaba.' \"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1611",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا بيان بن عمرو، حدثنا يزيد، حدثنا جرير بن حازم، حدثنا يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم قال لها ‏\"‏ يا عائشة لولا أن قومك حديث عهد بجاهلية لأمرت بالبيت فهدم، فأدخلت فيه ما أخرج منه وألزقته بالأرض، وجعلت له بابين بابا شرقيا وبابا غربيا، فبلغت به أساس إبراهيم ‏\"‏‏.‏ فذلك الذي حمل ابن الزبير  رضى الله عنهما  على هدمه‏.‏ قال يزيد وشهدت ابن الزبير حين هدمه وبناه وأدخل فيه من الحجر، وقد رأيت أساس إبراهيم حجارة كأسنمة الإبل‏.‏ قال جرير فقلت له أين موضعه قال أريكه الآن‏.‏ فدخلت معه الحجر فأشار إلى مكان فقال ها هنا‏.‏ قال جرير فحزرت من الحجر ستة أذرع أو نحوها‏.‏",
      "text_en": " Narrated Yazid bin Ruman from `Urwa:                     `Aisha said that the Prophet said to her, \"O Aisha! Were your nation not close to the Pre-Islamic Period of Ignorance, I would have had the Ka`ba demolished and would have included in it the portion which had been left, and would have made it at a level with the ground and would have made two doors for it, one towards the east and the other towards the west, and then by doing this it would have been built on the foundations laid by Abraham.\" That was what urged Ibn-Az-Zubair to demolish the Ka`ba. Jazz said, \"I saw Ibn-Az-Zubair when he demolished and rebuilt the Ka`ba and included in it a portion of Al-Hijr (the unroofed portion of Ka`ba which is at present in the form of a compound towards the northwest of the Ka`ba). I saw the original foundations of Abraham which were of stones resembling the humps of camels.\" So Jarir asked Yazid, \"Where was the place of those stones?\" Jazz said, \"I will just now show it to you.\" So Jarir accompanied Yazid and entered Al-Hijr, and Jazz pointed to a place and said, \"Here it is.\" Jarir said, \"It appeared to me about six cubits from Al-Hijr or so.\"",
      "chain": [
        "30320",
        "20472",
        "11272",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1712",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا زهير بن حرب، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  أن أسامة بن زيد  رضى الله عنهما  كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى  قال  فكلاهما قالا لم يزل النبي صلى الله عليه وسلم يلبي حتى رمى جمرة العقبة‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas said, \"Usama bin Zaid rode behind the Prophet from `Arafat to Al-Muzdalifa; and then from Al-Muzdalifa to Mina, Al-Fadl rode behind him.\" He added, \"Both of them (Usama and Al-Fadl) said, 'The Prophet was constantly reciting Talbiya till he did Rami of the Jamarat-Al-`Aqaba.\"",
      "chain": [
        "30022",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، سمعت يونس، عن ابن شهاب، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم اجعل بالمدينة ضعفى ما جعلت بمكة من البركة ‏\"‏‏.‏ تابعه عثمان بن عمر عن يونس‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "2085",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا أبو رجاء، عن سمرة بن جندب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيت الليلة رجلين أتياني، فأخرجاني إلى أرض مقدسة، فانطلقنا حتى أتينا على نهر من دم فيه رجل قائم، وعلى وسط النهر رجل بين يديه حجارة، فأقبل الرجل الذي في النهر فإذا أراد الرجل أن يخرج رمى الرجل بحجر في فيه فرده حيث كان، فجعل كلما جاء ليخرج رمى في فيه بحجر، فيرجع كما كان، فقلت ما هذا فقال الذي رأيته في النهر آكل الربا ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     The Prophet said, \"This night I dreamt that two men came and took me to a Holy land whence we proceeded on till we reached a river of blood, where a man was standing, and on its bank was standing another man with stones in his hands. The man in the middle of the river tried to come out, but the other threw a stone in his mouth and forced him to go back to his original place. So, whenever he tried to come out, the other man would throw a stone in his mouth and force him to go back to his former place. I asked, 'Who is this?' I was told, 'The person in the river was a Riba-eater.\"",
      "chain": [
        "20040",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "2473",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، عن الزبير بن خريت، عن عكرمة، سمعت أبا هريرة  رضى الله عنه  قال قضى النبي صلى الله عليه وسلم إذا تشاجروا في الطريق بسبعة أذرع‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet judged that seven cubits should be left as a public way when there was a dispute about the land.",
      "chain": [
        "20040",
        "11272",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "2483",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان رجل في بني إسرائيل، يقال له جريج، يصلي، فجاءته أمه فدعته، فأبى أن يجيبها، فقال أجيبها أو أصلي ثم أتته، فقالت اللهم لا تمته حتى تريه المومسات‏.‏ وكان جريج في صومعته، فقالت امرأة لأفتنن جريجا‏.‏ فتعرضت له فكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت هو من جريج‏.‏ فأتوه، وكسروا صومعته فأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام، فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There was an Israeli man called Juraij, while he was praying, his mother came and called him, but he did not respond to her call. He said (to himself) whether he should continue the prayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do not let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said that she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. She then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and later she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and broke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the prayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby replied that his father was the shepherd. The people said that they would build for him a hermitage of gold but Juraij asked them to make it of mud only.\"",
      "chain": [
        "20285",
        "11272",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2504",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شقصا له في عبد، أعتق كله إن كان له مال، وإلا يستسع غير مشقوق عليه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to manumit the slave completely if he has sufficient money. Otherwise he should look for some work for the slave (to earn what would enable him to emancipate himself), without overburdening him with work.\"",
      "chain": [
        "20283",
        "11272",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "2526",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن أبي رجاء، حدثنا يحيى بن آدم، حدثنا جرير بن حازم، سمعت قتادة، قال حدثني النضر بن أنس بن مالك، عن بشير بن نهيك، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏{‏من أعتق شقيصا من عبد ‏}‏",
      "text_en": " Narrated Abu Huraira:                     That the Prophet said, \"Whoever frees his portion of a (common) slave.\"",
      "chain": [
        "30300",
        "20364",
        "11272",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "2553",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ من أعتق نصيبا له من العبد، فكان له من المال ما يبلغ قيمته، يقوم عليه قيمة عدل، وأعتق من ماله، وإلا فقد عتق منه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"If one manumits his share of a common slave (Abd), and he has money sufficient to free the remaining portion of the price of the slave (justly estimated), then he should free the slave completely by paying the rest of his price; otherwise the slave is freed partly. \"",
      "chain": [
        "20283",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن تقاتلوا قوما ينتعلون نعال الشعر، وإن من أشراط الساعة أن تقاتلوا قوما عراض الوجوه، كأن وجوههم المجان المطرقة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     The Prophet said, \"One of the portents of the Hour is that you will fight with people wearing shoes made of hair; and one of the portents of the Hour is that you will fight with broad-faced people whose faces will look like shields coated with leather.\"",
      "chain": [
        "20283",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الفضل بن سهل، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن محمد، عن أنس بن مالك  رضى الله عنه  قال فزع الناس فركب رسول الله صلى الله عليه وسلم فرسا لأبي طلحة بطيئا، ثم خرج يركض وحده، فركب الناس يركضون خلفه، فقال ‏\"‏ لم تراعوا، إنه لبحر ‏\"‏‏.‏ فما سبق بعد ذلك اليوم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the people got frightened, so Allah's Apostle rode a slow horse belonging to Abu Talha, and he set out all alone, making the horse gallop. Then the people rode, making their horses gallop after him. On his return he said, \"Don't be afraid (there is nothing to be afraid of) (and I have found) this horse a very fast one.\" That horse was never excelled in running hence forward. (Qastalani Vol. 5)",
      "chain": [
        "30264",
        "20384",
        "11272",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "3145",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا الحسن، قال حدثني عمرو بن تغلب  رضى الله عنه  قال أعطى رسول الله صلى الله عليه وسلم قوما ومنع آخرين، فكأنهم عتبوا عليه فقال ‏\"‏ إني أعطي قوما أخاف ظلعهم وجزعهم، وأكل أقواما إلى ما جعل الله في قلوبهم من الخير والغنى، منهم عمرو بن تغلب ‏\"‏‏.‏ فقال عمرو بن تغلب ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ وزاد أبو عاصم عن جرير قال سمعت الحسن يقول حدثنا عمرو بن تغلب أن رسول الله صلى الله عليه وسلم أتي بمال أو بسبى فقسمه‏.‏ بهذا‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     Allah's Apostle gave (gifts) to some people to the exclusion of some others. The latter seemed to be displeased by that. The Prophet said, \"I give to some people, lest they should deviate from True Faith or lose patience, while I refer other people to the goodness and contentment which Allah has put in their hearts, and `Amr bin Taghlib is amongst them.\" `Amr bin Taghlib said, \"The statement of Allah's Apostle is dearer to me than red camels.\" Narrated Al-Hasan: `Amr bin Taghlib told us that Allah's Apostle got some property or some war prisoners and he distributed them in the above way (i.e. giving to some people to the exclusion of others) .",
      "chain": [
        "20040",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "3214",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وحدثنا إسحاق، أخبرنا وهب بن جرير، حدثنا أبي قال، سمعت حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال كأني أنظر إلى غبار ساطع في سكة بني غنم‏.‏ زاد موسى موكب جبريل‏.‏",
      "text_en": " Narrated Jarir:                     as below.Narrated Humaid bin Hilal:Anas bin Malik said, \"As if I say a cloud of dust swirling up in the lane of Bani Ghanim.\" Musa added, \"That was caused by the procession of Gabriel.\"",
      "chain": [
        "30021",
        "20298",
        "11272",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3312",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا جرير بن حازم، عن نافع، عن ابن عمر، أنه كان يقتل الحيات‏.‏ فحدثه أبو لبابة، أن النبي صلى الله عليه وسلم نهى عن قتل جنان البيوت، فأمسك عنها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to kill snakes but when Abu Lubaba informed him that the Prophet had forbidden the killing of snakes living in houses, he gave up killing them.",
      "chain": [
        "20357",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله، حدثنا وهب، حدثنا أبي، سمعت يونس، عن الزهري، عن سالم، أن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدخلوا مساكن الذين ظلموا أنفسهم إلا أن تكونوا باكين، أن يصيبكم مثل ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Do not enter the ruined dwellings of those who were unjust to themselves unless (you enter) weeping, lest you should suffer the same punishment as was inflicted upon them.\"",
      "chain": [
        "20025",
        "20298",
        "11272",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3357",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن تليد الرعيني، أخبرنا ابن وهب، قال أخبرني جرير بن حازم، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لم يكذب إبراهيم إلا ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Abraham did not tell a lie except on three occasions.\"",
      "chain": [
        "27421",
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3362",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، عن أبيه، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ يرحم الله أم إسماعيل، لولا أنها عجلت لكان زمزم عينا معينا ‏\"‏‏.‏   قال الأنصاري حدثنا ابن جريج، أما كثير بن كثير فحدثني قال إني وعثمان بن أبي سليمان جلوس مع سعيد بن جبير، فقال ما هكذا حدثني ابن عباس، قال أقبل إبراهيم بإسماعيل وأمه عليهم السلام وهى ترضعه، معها شنة  لم يرفعه  ثم جاء بها إبراهيم وبابنها إسماعيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to fill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on the surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his mother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3436",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لم يتكلم في المهد إلا ثلاثة عيسى، وكان في بني إسرائيل رجل يقال له جريج، كان يصلي، فجاءته أمه فدعته، فقال أجيبها أو أصلي‏.‏ فقالت اللهم لا تمته حتى تريه وجوه المومسات‏.‏ وكان جريج في صومعته، فتعرضت له امرأة وكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت من جريج‏.‏ فأتوه فكسروا صومعته، وأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين‏.‏ وكانت امرأة ترضع ابنا لها من بني إسرائيل، فمر بها رجل راكب ذو شارة، فقالت اللهم اجعل ابني مثله‏.‏ فترك ثديها، وأقبل على الراكب فقال اللهم لا تجعلني مثله‏.‏ ثم أقبل على ثديها يمصه  قال أبو هريرة كأني أنظر إلى النبي صلى الله عليه وسلم يمص إصبعه  ثم مر بأمة فقالت اللهم لا تجعل ابني مثل هذه‏.‏ فترك ثديها فقال اللهم اجعلني مثلها‏.‏ فقالت لم ذاك فقال الراكب جبار من الجبابرة، وهذه الأمة يقولون سرقت زنيت‏.‏ ولم تفعل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None spoke in cradle but three: (The first was) Jesus, (the second was), there a man from Bani Israel called Juraij. While he was offering his prayers, his mother came and called him. He said (to himself), 'Shall I answer her or keep on praying?\" (He went on praying) and did not answer her, his mother said, \"O Allah! Do not let him die till he sees the faces of prostitutes.\" So while he was in his hermitage, a lady came and sought to seduce him, but he refused. So she went to a shepherd and presented herself to him to commit illegal sexual intercourse with her and then later she gave birth to a child and claimed that it belonged to Juraij. The people, therefore, came to him and dismantled his hermitage and expelled him out of it and abused him. Juraij performed the ablution and offered prayer, and then came to the child and said, 'O child! Who is your father?' The child replied, 'The shepherd.' (After hearing this) the people said, 'We shall rebuild your hermitage of gold,' but he said, 'No, of nothing but mud.'(The third was the hero of the following story) A lady from Bani Israel was nursing her child at her breast when a handsome rider passed by her. She said, 'O Allah ! Make my child like him.' On that the child left her breast, and facing the rider said, 'O Allah! Do not make me like him.' The child then started to suck her breast again. (Abu Huraira further said, \"As if I were now looking at the Prophet sucking his finger (in way of demonstration.\") After a while the people passed by, with a lady slave and she (i.e. the child's mother) said, 'O Allah! Do not make my child like this (slave girl)!, On that the child left her breast and said, 'O Allah! Make me like her.' When she asked why, the child replied, 'The rider is one of the tyrants while this slave girl is falsely accused of theft and illegal sexual intercourse.\"",
      "chain": [
        "20285",
        "11272",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن تليد، حدثنا ابن وهب، قال أخبرني جرير بن حازم، عن أيوب، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ بينما كلب يطيف بركية كاد يقتله العطش، إذ رأته بغي من بغايا بني إسرائيل، فنزعت موقها فسقته، فغفر لها به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While a dog was going round a well and was about to die of thirst, an Israeli prostitute saw it and took off her shoe and watered it. So Allah forgave her because of that good deed.\"",
      "chain": [
        "27421",
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا جرير بن حازم، سمعت الحسن، يقول حدثنا عمرو بن تغلب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بين يدى الساعة تقاتلون قوما ينتعلون الشعر، وتقاتلون قوما كأن وجوههم المجان المطرقة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Taghlib:                     I heard Allah's Apostle saying, \"Near the Hour you will fight with people who will wear hairy shoes; and you will also fight people with flat faces like shields.\"",
      "chain": [
        "20193",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "4065",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن نافع، أن ابن عمر  رضى الله عنهما  كان يقتل الحيات كلها‏.‏   حتى حدثه أبو لبابة البدري، أن النبي صلى الله عليه وسلم نهى عن قتل جنان البيوت، فأمسك عنها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to kill all kinds of snakes until Abu Lubaba Al-Badri told him that the Prophet had forbidden the killing of harmless snakes living in houses and called Jinan. So Ibn `Umar gave up killing them.",
      "chain": [
        "20283",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4168",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا جرير بن حازم، عن حميد بن هلال، عن أنس  رضى الله عنه  قال كأني أنظر إلى الغبار ساطعا في زقاق بني غنم موكب جبريل حين سار رسول الله صلى الله عليه وسلم إلى بني قريظة‏.‏",
      "text_en": " Narrated Anas:                     As if I am just now looking at the dust rising in the street of Banu Ghanm (in Medina) because of the marching of Gabriel's regiment when Allah's Apostle set out to Banu Quraiza (to attack them).",
      "chain": [
        "20040",
        "11272",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "4699",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن عبد الله السلمي، أخبرنا عبد الله بن المبارك، أخبرنا جرير بن حازم، قال أخبرني الزبير بن خريت، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏إن يكن منكم عشرون صابرون يغلبوا مائتين‏}‏ شق ذلك على المسلمين حين فرض عليهم أن لا يفر واحد من عشرة، فجاء التخفيف فقال رالآن خفف الله عنكم وعلم أن فيكم ضعفا فإن يكن منكم مائة صابرة يغلبوا مائتين‏}‏‏.‏ قال فلما خفف الله عنهم من العدة نقص من الصبر بقدر ما خفف عنهم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:--'If there are twenty steadfast amongst you (Muslims), they will overcome twohundred (non-Muslims).' was revealed, it became hard on the Muslims when it became compulsory that one Muslim ought not to flee (in war) before ten (non-Muslims). So (Allah) lightened the order by revealing: '(But) now Allah has lightened your (task) for He knows that there is weakness in you. So if there are of you one-hundred steadfast, they will overcome (two-hundred (non-Muslims).' (8.66) So when Allah reduced the number of enemies which Muslims should withstand, their patience and perseverance against the enemy decreased as much as their task was lightened for them.",
      "chain": [
        "30398",
        "20025",
        "11272",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4872",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا جرير بن حازم، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخلت على عبد الله ثم قال إن رسول الله صلى الله عليه وسلم لما دعا قريشا كذبوه واستعصوا عليه فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏‏.‏ فأصابتهم سنة حصت  يعني  كل شىء حتى كانوا يأكلون الميتة فكان يقوم أحدهم فكان يرى بينه وبين السماء مثل الدخان من الجهد والجوع ثم قرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين * يغشى الناس هذا عذاب أليم‏}‏ حتى بلغ ‏{‏إنا كاشفو العذاب قليلا إنكم عائدون‏}‏ قال عبد الله أفيكشف عنهم العذاب يوم القيامة قال والبطشة الكبرى يوم بدر‏.‏",
      "text_en": " Narrated Masruq:                     I came upon `Abdullah and he said, \"When Allah's Apostle invited Quraish (to Islam), they disbelieved him and stood against him. So he (the Prophet) said, \"O Allah! Help me against them by afflicting them with seven years of famine similar to the seven years of Joseph.' So they were stricken with a year of drought that destroyed everything, and they started eating dead animals, and if one of them got up he would see something like smoke between him and the sky from the severe fatigue and hunger.\" `Abdullah then recited:-- 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible, covering the people. This is a painful torment... (till he reached) ........ We shall indeed remove the punishment for a while, but truly you will revert (to heathenism): (44.10-15) `Abdullah added: \"Will the punishment be removed from them on the Day of Resurrection?\" He added,\" The severe grasp\" was the Day of the Battle of Badr.\"",
      "chain": [
        "20193",
        "11272",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4942",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت الزبير، عن عكرمة، عن ابن عباس، في قوله تعالى ‏{‏ولا يعصينك في معروف‏}‏ قال إنما هو شرط شرطه الله للنساء‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the saying of Allah: 'And they will not disobey you in any just matter.' (60.12) That was one of the conditions which Allah imposed on The believing) women (who came to take the oath of allegiance to the Prophet).",
      "chain": [
        "30351",
        "20298",
        "11272",
        "7",
        "11023"
      ]
    },
    {
      "hadith_no": "5099",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم الأزدي، حدثنا قتادة، قال سألت أنس بن مالك عن قراءة النبي، صلى الله عليه وسلم فقال كان يمد مدا‏.‏",
      "text_en": " Narrated Qatada:                     I asked Anas bin Malik about the recitation of the Prophet. He said, \"He used to pray long (certain sounds) very much.",
      "chain": [
        "20285",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5140",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن تليد، قال أخبرني ابن وهب، قال أخبرني جرير بن حازم، عن أيوب، عن محمد، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم‏.‏ حدثنا سليمان عن حماد بن زيد عن أيوب عن محمد عن أبي هريرة ‏{‏قال قال النبي صلى الله عليه وسلم‏}‏ ‏\"‏ لم يكذب إبراهيم إلا ثلاث كذبات بينما إبراهيم مر بجبار ومعه سارة  فذكر الحديث  فأعطاها هاجر قالت كف الله يد الكافر وأخدمني آجر ‏\"‏‏.‏ قال أبو هريرة فتلك أمكم يا بني ماء السماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said: Abraham did not tell lies except three. (One of them was) when Abraham passed by a tyrant and (his wife) Sara was accompanying him (Abu Huraira then mentioned the whole narration and said:) (The tyrant) gave her Hajar. Sara said, \"Allah saved me from the hands of the Kafir (i.e. infidel) and gave me Hajar to serve me.\" (Abu Huraira added:) That (Hajar) is your mother, O Banu Ma'-As-Sama' (i.e., the Arabs).",
      "chain": [
        "27421",
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5331",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن عبد الله بن المبارك المخرمي، حدثنا قراد أبو نوح، حدثنا جرير بن حازم، عن أيوب، عن عكرمة، عن ابن عباس، رضى الله عنهما قال جاءت امرأة ثابت بن قيس بن شماس إلى النبي صلى الله عليه وسلم فقالت يا رسول الله ما أنقم على ثابت في دين ولا خلق، إلا أني أخاف الكفر‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتردين عليه حديقته ‏\"‏‏.‏ فقالت نعم‏.‏ فردت عليه، وأمره ففارقها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The wife of Thabit bin Qais bin Shammas came to the Prophet and said, \"O Allah's Apostle! I do not blame Thabit for any defects in his character or his religion, but I am afraid that I (being a Muslim) may become unthankful for Allah's Blessings.\" On that, Allah's Apostle said (to her), 'Will you return his garden to him?\" She said, \"Yes.\" So she returned his garden to him and the Prophet told him to divorce her.",
      "chain": [
        "30271",
        "20440",
        "11272",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5850",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا وهب بن جرير، أخبرنا أبي، عن عمه، جرير بن زيد قال كنت مع سالم بن عبد الله بن عمر على باب داره فقال سمعت أبا هريرة، سمع النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet (narrating as above No. 680).",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11678",
        "13"
      ]
    },
    {
      "hadith_no": "5898",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، عن حذيفة  رضى الله عنه  قال نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج، وأن نجلس عليه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
      "chain": [
        "5",
        "20298",
        "11272",
        "11254",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "5966",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني عمرو بن علي، حدثنا وهب بن جرير، قال حدثني أبي، عن قتادة، قال سألت أنس بن مالك  رضى الله عنه  عن شعر، رسول الله صلى الله عليه وسلم فقال كان شعر رسول الله صلى الله عليه وسلم رجلا، ليس بالسبط، ولا الجعد، بين أذنيه وعاتقه‏.‏",
      "text_en": " Narrated Qatada:                     l asked Anas bin Malik about the hair of Allah's Apostle. He said, \"The hair of Allah's Apostle was neither much straight, nor much curly, and it used to hang down till between his shoulders and his earlobes.",
      "chain": [
        "30153",
        "20298",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5968",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن قتادة، عن أنس  رضى الله عنه  قال كان النبي صلى الله عليه وسلم ضخم اليدين والقدمين حسن الوجه، لم أر بعده ولا قبله مثله، وكان بسط الكفين‏.‏",
      "text_en": " Narrated Anas:                     The Prophet had big hands and feet, and I have not seen anybody like him, neither before nor after him, and his palms were soft.",
      "chain": [
        "20283",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6702",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا أبو النعمان، أخبرنا جرير  هو ابن حازم  عن أبي إسحاق، عن البراء بن عازب، قال رأيت النبي صلى الله عليه وسلم يوم الخندق ينقل معنا التراب وهو يقول ‏\"‏ والله لولا الله ما اهتدينا، ولا صمنا ولا صلينا، فأنزلن سكينة علينا، وثبت الأقدام إن لاقينا، والمشركون قد بغوا علينا، إذا أرادوا فتنة أبينا‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     I saw the Prophet on the Day of (the battle of) Al-Khandaq, carrying earth with us and saying, \"By Allah, without Allah we would not have been guided, neither would we have fasted, nor would we have prayed. O Allah! Send down Sakina (calmness) upon us and make our feet firm when we meet (the enemy). The pagans have rebelled against us, but if they want to put us in affliction (i.e., fight us) we refuse (to flee).\" (See Hadith No. 430, Vol. 5).",
      "chain": [
        "20283",
        "11272",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "6704",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أبو النعمان، محمد بن الفضل حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن بن سمرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا عبد الرحمن بن سمرة لا تسأل الإمارة، فإنك إن أوتيتها عن مسألة وكلت إليها، وإن أوتيتها من غير مسألة أعنت عليها، وإذا حلفت على يمين فرأيت غيرها خيرا منها، فكفر عن يمينك، وأت الذي هو خير ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Samura:                     The Prophet said, \"O `Abdur-Rahman bin Samura! Do not seek to be a ruler, because if you are given authority for it, then you will be held responsible for it, but if you are given it without asking for it, then you will be helped in it (by Allah): and whenever you take an oath to do something and later you find that something else is better than the first, then do the better one and make expiation for your oath.\"",
      "chain": [
        "20283",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "6913",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يعلى بن حكيم، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال لما أتى ماعز بن مالك النبي صلى الله عليه وسلم قال له ‏\"‏ لعلك قبلت أو غمزت أو نظرت ‏\"‏‏.‏ قال لا يا رسول الله‏.‏ قال ‏\"‏ أنكتها ‏\"‏‏.‏ لا يكني‏.‏ قال فعند ذلك أمر برجمه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Ma'iz bin Malik came to the Prophet (in order to confess), the Prophet said to him, \"Probably you have only kissed (the lady), or winked, or looked at her?\" He said, \"No, O Allah's Apostle!\" The Prophet said, using no euphemism, \"Did you have sexual intercourse with her?\" The narrator added: At that, (i.e. after his confession) the Prophet ordered that he be stoned (to death).",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11567",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "7233",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا جرير بن حازم، عن الحسن، عن عبد الرحمن بن سمرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا عبد الرحمن لا تسأل الإمارة، فإنك إن أعطيتها عن مسألة وكلت إليها، وإن أعطيتها عن غير مسألة أعنت عليها، وإذا حلفت على يمين فرأيت غيرها خيرا منها، فكفر يمينك، وأت الذي هو خير ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Samura:                     The Prophet said, \"O `Abdur-Rahman! Do not seek to be a ruler, for if you are given authority on your demand then you will be held responsible for it, but if you are given it without asking (for it), then you will be helped (by Allah) in it. If you ever take an oath to do something and later on you find that something else is better, then you should expiate your oath and do what is better.\"",
      "chain": [
        "20219",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "7629",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن الحسن، حدثنا عمرو بن تغلب، قال أتى النبي صلى الله عليه وسلم مال فأعطى قوما ومنع آخرين فبلغه أنهم عتبوا فقال ‏\"‏ إني أعطي الرجل وأدع الرجل، والذي أدع أحب إلى من الذي أعطي، أعطي أقواما لما في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير منهم عمرو بن تغلب ‏\"‏‏.‏ فقال عمرو ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏",
      "text_en": " Narrated Al-Hasan:                     `Amr bin Taghlib said, \"Some property was given to the Prophet and he gave it to some people and withheld it from some others. Then he came to know that they (the latter) were dissatisfied. So the Prophet said, 'I give to one man and leave (do not give) another, and the one to whom I do not give is dearer to me than the one to whom I give. I give to some people because of the impatience and discontent present in their hearts, and leave other people because of the content and goodness Allah has bestowed on them, and one of them is `Amr bin Taghlib.\" `Amr bin Taghlib said, \"The sentence which Allah's Apostle said in my favor is dearer to me than the possession of nice red camels.\"",
      "chain": [
        "20283",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الحسن، يقول حدثنا جندب بن عبد الله البجلي، في هذا المسجد فما نسينا وما نخشى أن يكون جندب كذب على رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خرج برجل فيمن كان قبلكم خراج ‏\"‏ ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " It is reported on the authority of Hasan:                      Jundab b. 'Abdullah al-Bajali narrated this hadith in this mosque which we can neither forget and at the same time we have no apprehension that Jundab could attribute a lie to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) observed: A person belonging to the people of the past suffered from a boil, and then the rest of the hadith was narrated.",
      "chain": [
        "30161",
        "20298",
        "11272",
        "11016"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير، حدثنا أبي ح، قال وحدثنا إسحاق، أيضا أخبرنا المعتمر بن سليمان، قال سمعت سلم بن أبي الذيال، ح قال وحدثني يوسف بن حماد المعني، حدثنا زياد البكائي، عن عاصم الأحول، كل هؤلاء عن حميد بن هلال، بإسناد يونس كنحو حديثه ‏.‏",
      "text_en": " This hadith has been transmitted by Humaid b. Hilal on the authority of Yunus.",
      "chain": [
        "20656",
        "20236",
        "30170",
        "30160",
        "20173",
        "20020",
        "30123",
        "20298",
        "11272",
        "20288",
        "30573"
      ]
    },
    {
      "hadith_no": "1837",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا وهب بن جرير، أخبرني أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن ابن عباس، قال بعثني العباس إلى النبي صلى الله عليه وسلم وهو في بيت خالتي ميمونة فبت معه تلك الليلة فقام يصلي من الليل فقمت عن يساره فتناولني من خلف ظهره فجعلني على يمينه ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent a night in the house of my mother's sister Maimuna, and the rest of the hadith is the same as narrated above.",
      "chain": [
        "30524",
        "30375",
        "20298",
        "11272",
        "172",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا نافع، قال قيل لابن عمر إن أبا هريرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من تبع جنازة فله قيراط من الأجر ‏\"‏ ‏.‏ فقال ابن عمر أكثر علينا أبو هريرة ‏.‏ فبعث إلى عائشة فسألها فصدقت أبا هريرة فقال ابن عمر لقد فرطنا في قراريط كثيرة ‏.‏",
      "text_en": " Nafi' narrated that it was said to Ibn 'Umar that Abu Huraira reported to have heard Allah's Messenger (may peace be upon him) as saying:                      He who follows the bier, for him is the reward of one qirat. Ibn 'Umar said: Abu Huraira narrated it too often. So he sent (a messenger to) 'A'isha to ascertain (the fact). She ('A'isha) testified Abu Huraira. Ibn 'Umar said: We missed so many qirats.",
      "chain": [
        "20656",
        "11272",
        "11014",
        "13"
      ]
    },
    {
      "hadith_no": "2858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عقبة بن مكرم العمي، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا وهب بن جرير بن حازم، حدثنا أبي قال، سمعت قيسا، يحدث عن عطاء، عن صفوان بن، يعلى بن أمية عن أبيه، رضى الله عنه أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة قد أهل بالعمرة وهو مصفر لحيته ورأسه وعليه جبة فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى ‏.‏ فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " Ya'la b. Umayya (Allah be pleased with him) reported that a person came to the Apostle of Allah (may peace be upon him) as he was staying at Ji'rana and he had put on Ihram for 'Umra and he had dyed his beard and his head with yellow colour and there was a cloak on him. He said:                      I put on Ihram for 'Umra and I am in this state as you see (with dyed beard and head and a cloak over me). He (the Holy Prophet) said: Take off the cloak and wash the yellowness and do in your 'Umra what you do in Hajj.",
      "chain": [
        "30441",
        "30375",
        "20298",
        "11272",
        "11046",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - جميعا عن نافع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي، بن مسهر ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن عبيد الله، ح وحدثني أبو كامل، حدثنا حماد، حدثنا أيوب، ح وحدثنا ابن المثنى، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، كل هؤلاء عن نافع، عن ابن عمر، - رضى الله عنهما - عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك وابن جريج ولم يقل أحد منهم عن نافع عن ابن عمر - رضى الله عنهما - سمعت النبي صلى الله عليه وسلم ‏.‏ إلا ابن جريج وحده وقد تابع ابن جريج على ذلك ابن إسحاق ‏.‏ وحدثنيه فضل بن سهل، حدثنا يزيد بن هارون، أخبرنا محمد بن إسحاق، عن نافع، وعبيد الله بن عبد الله، عن ابن عمر، - رضى الله عنهما - قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خمس لا جناح في قتل ما قتل منهن في الحرم ‏\"‏ ‏.‏ فذكر بمثله‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through be upon him) as saying:                      Five (are the beasts) in killing which or their being killed in the precinct of the Ka'ba there is no sin.\" The rest of the hadith is the same.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20656",
        "11272",
        "11014",
        "30201",
        "20345",
        "30212",
        "11201",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "3392",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، وإبراهيم بن محمد السامي، قالا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يونس، يحدث عن الزهري، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل بالمدينة ضعفى ما بمكة من البركة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik (Allah he pleased with him) reported that Allah's Messenger (may peace be upon him) said:                      O Allah, increase in Medina twice the blessings (Thou showered) on Mecca.",
      "chain": [
        "30022",
        "30426",
        "20298",
        "11272",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا جرير بن حازم، حدثنا أبو فزارة، عن يزيد بن الأصم، حدثتني ميمونة بنت الحارث، أن رسول الله صلى الله عليه وسلم تزوجها وهو حلال قال وكانت خالتي وخالة ابن عباس ‏.‏",
      "text_en": " Yazid b. al-Asamm reported:                      Maimuna daughter of al-Harith narrated to me that Allah's Messenger (may peace be upon him) married her and he was not in the state of Ihram. And she (Maimuna) was my mother's sister and that of Ibn 'Abbas (Allah be pleased with them).",
      "chain": [
        "30201",
        "20364",
        "11272",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثناه قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، ح وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، حدثنا أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، ح وحدثنا محمد بن، المثنى حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثني إسحاق بن منصور، أخبرنا عبد الرزاق، عن ابن جريج، أخبرني إسماعيل بن أمية، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، عن ابن أبي ذئب، كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع.‏",
      "text_en": " This hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20656",
        "11272",
        "30137",
        "20022",
        "11015",
        "30212",
        "20331",
        "11201",
        "30170",
        "20259",
        "11062"
      ]
    },
    {
      "hadith_no": "3848",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت قتادة، يحدث بهذا الإسناد بمعنى حديث ابن أبي عروبة وذكر في الحديث قوم عليه قيمة عدل.",
      "text_en": " A hadith like this is reported on the authority of the same chain of transmitters but with a slight change of words.",
      "chain": [
        "30524",
        "20298",
        "11272",
        "11019"
      ]
    },
    {
      "hadith_no": "3892",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أبو بكر بن نافع، حدثنا غندر، ح وحدثناه محمد بن المثنى، حدثنا وهب، بن جرير ح وحدثنا عبد الوارث بن عبد الصمد، حدثنا أبي قالوا، جميعا حدثنا شعبة، بهذا الإسناد ‏.‏ في حديث غندر ووهب نهي ‏.‏ وفي حديث عبد الصمد أن رسول الله صلى الله عليه وسلم نهى ‏.‏ بمثل حديث معاذ عن شعبة ‏.‏",
      "text_en": "  This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "20278",
        "30170",
        "20298",
        "11272"
      ]
    },
    {
      "hadith_no": "4030",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن يعلى بن، حكيم بهذا الإسناد عن رافع بن خديج، عن النبي صلى الله عليه وسلم ولم يقل عن بعض عمومته ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Rafi' b. Khadij with the same chain of transmitters, but in it no mention is made of some of his uncles.",
      "chain": [
        "20029",
        "11272",
        "11567",
        "1986"
      ]
    },
    {
      "hadith_no": "4084",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن أيوب، بهذا الإسناد نحوه ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Ayyob with the same chain of transmitters.",
      "chain": [
        "20029",
        "11272"
      ]
    },
    {
      "hadith_no": "4140",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير يعني ابن حازم، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، ح وحدثنا محمد بن المثنى، حدثنا ابن، أبي عدي عن ابن عون، كلهم عن نافع، ‏.‏ بنحو حديث الليث عن نافع، عن أبي سعيد، الخدري عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id al-Khudri through another chain of transmitters.",
      "chain": [
        "20656",
        "11272",
        "30170",
        "20259",
        "11062",
        "30170",
        "20276",
        "11014",
        "38"
      ]
    },
    {
      "hadith_no": "4370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن، بن سمرة قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الرحمن بن سمرة لا تسأل الإمارة فإنك إن أعطيتها عن مسألة وكلت إليها وإن أعطيتها عن غير مسألة أعنت عليها وإذا حلفت على يمين فرأيت غيرها خيرا منها فكفر عن يمينك وائت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman b. Samura reported that Allah's Messenger (may peace be upon him) said to me:                      Abd al-Rahman b. Samura, don't ask for authority for if it is granted to you for asking for it, you would be commissioned for it (without having the support of Allah), but if you are granted it without your asking for it. You would be helped (by Allah) in it. And when you take an oath and find something else better than that, expiate for (breaking) your oath, and do that which is better. This hadith has also been transmitted on the authority of Ibn Farrukh.",
      "chain": [
        "20656",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "4384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، حدثنا جرير بن حازم، أن أيوب، حدثه أن نافعا حدثه أن عبد الله بن عمر حدثه أن عمر بن الخطاب سأل رسول الله صلى الله عليه وسلم وهو بالجعرانة بعد أن رجع من الطائف فقال يا رسول الله إني نذرت في الجاهلية أن أعتكف يوما في المسجد الحرام فكيف ترى قال ‏\"‏ اذهب فاعتكف يوما ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم قد أعطاه جارية من الخمس فلما أعتق رسول الله صلى الله عليه وسلم سبايا الناس سمع عمر بن الخطاب أصواتهم يقولون أعتقنا رسول الله صلى الله عليه وسلم ‏.‏ فقال ما هذا فقالوا أعتق رسول الله صلى الله عليه وسلم سبايا الناس ‏.‏ فقال عمر يا عبد الله اذهب إلى تلك الجارية فخل سبيلها ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that 'Umar b. Khattab asked the Messenger of Allah (may peace be upon him) as he was at ji'rana (a town near Mecca) on his way back from Ta'if:                      Messenger of Allah, I had taken a vow during the days of Ignorance that I would observe I'tikaf for one day in the Sacred Mosque. So what is your opinion? He said: Go and observe I'tikaf for a day. And Allah's Messenger (may peace be upon him) gave him a slave girl out of the one-fifth (of the spoils of war meant for the Holy Prophet). And when Allah's Messenger (inay peace be upon him) set the war prisoners free. 'Umar b. Khattab heard their voice as they were saying: Allah's Messenger (may peace be upon him) has set as free. He (Hadrat 'Umar) said: What is this? They said: Allah's Messenger (may peace be upon him) has set free the prisoners of war (which had fallen to the lot of people). Thereupon he (Hadrat 'Umar) said: Abdullah, go to that slave-girl and set her free.",
      "chain": [
        "20029",
        "11272",
        "11015",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، عن نافع، مولى عبد الله بن عمر عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق نصيبا له في عبد فكان له من المال قدر ما يبلغ قيمته قوم عليه قيمة عدل وإلا فقد عتق منه ما عتق ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      He who gives up his share in a slave, and he has money enough to meet the full price, a fair price for him should be fixed; otherwise be has emancipated him to the extent that he has emancipated.",
      "chain": [
        "20656",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير بن حازم، حدثني أبي قال، سمعت قيسا، يحدث عن يزيد بن هرمز، ح وحدثني محمد بن حاتم، - واللفظ له - قال حدثنا بهز، حدثنا جرير بن حازم، حدثني قيس بن سعد، عن يزيد بن هرمز، قال كتب نجدة بن عامر إلى ابن عباس قال فشهدت ابن عباس حين قرأ كتابه وحين كتب جوابه وقال ابن عباس والله لولا أن أرده عن نتن يقع فيه ما كتبت إليه ولا نعمة عين قال فكتب إليه إنك سألت عن سهم ذي القربى الذي ذكر الله من هم وإنا كنا نرى أن قرابة رسول الله صلى الله عليه وسلم هم نحن فأبى ذلك علينا قومنا وسألت عن اليتيم متى ينقضي يتمه وإنه إذا بلغ النكاح وأونس منه رشد ودفع إليه ماله فقد انقضى يتمه وسألت هل كان رسول الله صلى الله عليه وسلم يقتل من صبيان المشركين أحدا فإن رسول الله صلى الله عليه وسلم لم يكن يقتل منهم أحدا وأنت فلا تقتل منهم أحدا إلا أن تكون تعلم منهم ما علم الخضر من الغلام حين قتله وسألت عن المرأة والعبد هل كان لهما سهم معلوم إذا حضروا البأس فإنهم لم يكن لهم سهم معلوم إلا أن يحذيا من غنائم القوم.",
      "text_en": " It has been narrated on the anthority of Yazid b. Hurmuz who said:                      Najda wrote to Ibn Abbas. I was sitting in the company of Ibn 'Abbas when he read his letter and wrote its reply. Ibn Abbas said: Were it not for preventing him from falling into wickedness. I would not have replied to his letter, may he never be joyful. He wrote in reply to him referring to the share of the close relatives (of the Holy Prophet) (from the booty) whom God has mentioned. (I have to tell you that) we thought we were the close relatives of the Messenger of Allah (may peace be upon him), but our people have refused to recognise us as such. You have asked about the orphan as to when his orphanhood comes to an end. (I have to say that) when he reaches the age of marriage, attains maturity of mind, and his property is returned to him, then he is no longer an orphan. You have inquired whether the Messenger of Allah (may peace be upo him) used to kill anyone from the children of the polytheists in the war. (You should know that) the Messenger of Allah (may peace be upon him) used not to kill any one of their children, and you (too) should not kill any one of them, except when you knew about them what Khadir had known about the boy whom he killed. And you have inquired whether there is a fixed share of the booty for women and slaves when they participate in a battle. (I have to tell you that) there is no fixed share for them except that they will be given some reward from the spoils of war.",
      "chain": [
        "30123",
        "20298",
        "11272",
        "11046",
        "10627",
        "38487",
        "20214",
        "11272",
        "172",
        "10627"
      ]
    },
    {
      "hadith_no": "4819",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، حدثنا عبد الرحمن، بن سمرة قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الرحمن لا تسأل الإمارة فإنك إن أعطيتها عن مسألة أكلت إليها وإن أعطيتها عن غير مسألة أعنت عليها ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of 'Abd al-Rahman b. Samura who said:                      The Messenger of Allah (may peace be upon him) said to me: 'Abd al-Rahman, do not ask for a position of authority, for if you are granted this position as a result of your asking for it, you will be left alone (without God's help to discharge the responsibilities attendant thereon), and it you are granted it without making any request for it, you will be helped (by God in the discharge of your duties).",
      "chain": [
        "20656",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "4827",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا ابن مهدي، حدثنا جرير بن حازم، عن حرملة، المصري عن عبد الرحمن بن شماسة، عن عائشة، عن النبي صلى الله عليه وسلم بمثله",
      "text_en": " This hadith has been narrated on the authority of Abd al-Rahman b. Shumasa with another chain of transmitters.",
      "chain": [
        "38487",
        "20033",
        "11272",
        "10867",
        "53"
      ]
    },
    {
      "hadith_no": "4838",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، أن عائذ بن عمرو، - وكان من أصحاب رسول الله صلى الله عليه وسلم - دخل على عبيد الله بن زياد فقال أى بنى إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن شر الرعاء الحطمة فإياك أن تكون منهم ‏\"‏ ‏.‏ فقال له اجلس فإنما أنت من نخالة أصحاب محمد صلى الله عليه وسلم ‏.‏ فقال وهل كانت لهم نخالة إنما كانت النخالة بعدهم وفي غيرهم ‏.‏",
      "text_en": " It has been narrated on the authority of Hasan that A'idh b. 'Amr who was one of the Companions of the Messenger of Allah (may peace be upon him) called on 'Ubaidullah b. Ziyad and said (to him):                      O my son, I have heard the Messenger of Allah (may peace be upon him) say: The worst of guardians is the cruel ruler. Beware of being one of them. Ubaidullah said (to him out of arrogance): Sit you down. You are from the chaff of the Companions of Muhammad (may peace be upon him). A'idh said: Was there worthless chaff among them? Such worthless chaff appeared after them and among other people.",
      "chain": [
        "20656",
        "11272",
        "11016",
        "3240"
      ]
    },
    {
      "hadith_no": "4892",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا غيلان بن، جرير عن أبي قيس بن رياح، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من خرج من الطاعة وفارق الجماعة فمات مات ميتة جاهلية ومن قاتل تحت راية عمية يغضب لعصبة أو يدعو إلى عصبة أو ينصر عصبة فقتل فقتلة جاهلية ومن خرج على أمتي يضرب برها وفاجرها ولا يتحاش من مؤمنها ولا يفي لذي عهد عهده فليس مني ولست منه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      One who defected from obedience (to the Amir) and separated from the main body of the Muslims-if he died in that state-would die the death of one belonging to the days of Jahiliyya (i. e. would not die as a Muslim). One who fights under the banner of a people who ate blind (to the cause for which they are fighting. i. e. do not know whether their cause is just or otherwise), who gets flared up with family pride, calls, (people) to fight for their. family honour, and supports his kith and kin (i. e. fignts not for the cause of Allah but for the sake of this family or tribe) -if he is killed (in this fight), he dies as one belonging to the days of Jhiliyya. Whoso attacks my Umma (indiscriminately) killing the righteous and the wicked of them, sparing not (even) those staunch in faith and fulfilling not his promise made with those who have been given a pledge of security-he has nothing to do with me and I have nothing to do with him.",
      "chain": [
        "20656",
        "11272",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "5260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، سمعت عطاء بن أبي رباح، حدثنا جابر بن عبد الله الأنصاري، أن النبي صلى الله عليه وسلم نهى أن يخلط الزبيب والتمر والبسر والتمر ‏.‏",
      "text_en": " Jabir b. 'Abdullah al-Ansari reported that Allah's Messenger (may peace upon him) prohibited the mixing of grapes and fresh dates, and dry dates and fresh dates.",
      "chain": [
        "20656",
        "11272",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا يعلى بن حكيم، عن سعيد بن جبير، قال سألت ابن عمر عن نبيذ الجر، فقال حرم رسول الله صلى الله عليه وسلم نبيذ الجر ‏.‏ فأتيت ابن عباس فقلت ألا تسمع ما يقول ابن عمر قال وما يقول قلت قال حرم رسول الله صلى الله عليه وسلم نبيذ الجر ‏.‏ فقال صدق ابن عمر حرم رسول الله صلى الله عليه وسلم نبيذ الجر ‏.‏ فقلت وأى شىء نبيذ الجر فقال كل شىء يصنع من المدر ‏.‏",
      "text_en": " Sa'id b. Jubair reported:                      I asked Ibn 'Umar about (the preparation of) Nabidh in a green pitcher (besmeared with pitch), whereupon he said that Allah's Messenger (may peace be upon him) forbade the (preparation of) Nabidh in green pitcher (besmeared with pitch). I then came to Ibn Abbas and said: Do you hear what Ibn 'Umar has said? Thereupon he said: What does he say? I said: He stated that Allah's Messenger (may peace be upon him) has forbidden the (preparation of) Nabidh in a green pitcher (besmeared with pitch), whereupon he said: Ibn 'Umar has told the truth. Allah's Messenger (may peace be upon him) declared unlawful the preparation of Nabidh in a green pitcher (besmeared with pitch). I said: What is this thing, the Nabidh of a pitcher (Nabidh prepared in a pitcher)? Thereupon, he said: Everything that is prepared in earthen pitcher.",
      "chain": [
        "20656",
        "11272",
        "11567",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "5443",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت  جرير بن زيد، يحدث عن عمرو بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأى أبو طلحة رسول الله صلى الله عليه وسلم مضطجعا في المسجد يتقلب ظهرا لبطن فأتى أم سليم فقال إني رأيت رسول الله صلى الله عليه وسلم مضطجعا في المسجد يتقلب ظهرا لبطن وأظنه جائعا ‏.‏ وساق الحديث وقال فيه ثم أكل رسول الله صلى الله عليه وسلم وأبو طلحة وأم سليم وأنس بن مالك وفضلت فضلة فأهديناه لجيراننا ‏.‏",
      "text_en": " Anas b. Malik reported:                      Abu Talha saw Allah's Messenger (may peace be upon him) lying down upon his belly in the mosque. He came to Umm Sulaim and said: I saw Allah's Messenger (may peace be upon him) lying down upon the belly in the mosque, and I think he is hungry. The rest of the hadith is the same (but with the addition of these words) that Allah's messenger (may peace be upon him) ate (the food) and so did Abu Talha, Umm Sulaim and Anas b. Malik, but there was left some. thing which we presented to our neighbours.",
      "chain": [
        "30115",
        "20298",
        "11272",
        "11678",
        "10603",
        "19"
      ]
    },
    {
      "hadith_no": "5508",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - عن عبد الرحمن، السراج كل هؤلاء عن نافع، ‏.‏ بمثل حديث مالك بن أنس بإسناده عن نافع، وزاد، في حديث علي بن مسهر عن عبيد الله، ‏\"‏ أن الذي، يأكل أو يشرب في آنية الفضة والذهب ‏\"‏ ‏.‏ وليس في حديث أحد منهم ذكر الأكل والذهب إلا في حديث ابن مسهر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ubaidullah through other chains of transmitters:                      He who eats or drinks in the vessel of silver and gold, - but there is no mention in any one of them of the words pertaining to eating and gold.",
      "chain": [
        "20656",
        "11272",
        "11014"
      ]
    },
    {
      "hadith_no": "5524",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا نافع، عن ابن عمر، قال رأى عمر عطاردا التميمي يقيم بالسوق حلة سيراء - وكان رجلا يغشى الملوك ويصيب منهم - فقال عمر يا رسول الله إني رأيت عطاردا يقيم في السوق حلة سيراء فلو اشتريتها فلبستها لوفود العرب إذا قدموا عليك - وأظنه قال ولبستها يوم الجمعة - فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إنما يلبس الحرير في الدنيا من لا خلاق له في الآخرة ‏\"‏ ‏.‏ فلما كان بعد ذلك أتي رسول الله صلى الله عليه وسلم بحلل سيراء فبعث إلى عمر بحلة وبعث إلى أسامة بن زيد بحلة وأعطى علي بن أبي طالب حلة وقال ‏\"‏ شققها خمرا بين نسائك ‏\"‏ ‏.‏ قال فجاء عمر بحلته يحملها فقال يا رسول الله بعثت إلى بهذه وقد قلت بالأمس في حلة عطارد ما قلت فقال ‏\"‏ إني لم أبعث بها إليك لتلبسها ولكني بعثت بها إليك لتصيب بها ‏\"‏ ‏.‏ وأما أسامة فراح في حلته فنظر إليه رسول الله صلى الله عليه وسلم نظرا عرف أن رسول الله صلى الله عليه وسلم قد أنكر ما صنع فقال يا رسول الله ما تنظر إلى فأنت بعثت إلى بها فقال ‏\"‏ إني لم أبعث إليك لتلبسها ولكني بعثت بها إليك لتشققها خمرا بين نسائك ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported that Umar saw Utarid al-Tamimi standing in the market (and selling) the silk garments, and he was the person who went to (courts of) kings and got (high prices) for these garments from them. Umar said:                      Allah's Messenger I saw 'Utarid standing in the market with a silk garment; would that you buy and wear it for (receiving) the delegations of Arabs when they visit you? I (the narrator) said: I think he ('Umar) also said: You may wear it on Friday (also). Thereupon, Allah's Messenger (may peace he upon him) said: He who wears silk in this world has no share in the Hereafter. Later on when these silk garments were presented to Allah's Massenger (may peace be upon him) he presented one silk garment to 'Umar and presented one also to Usama b. Zaid and gave one to 'Ali b. Abu 'Talib. saying: Tear them and make head coverings for your ladies. 'Umar came carrying his garment and said: Allah's Messenger, you have sent it to me, whereas you had said yesterday about the (silk) garment of Utarid what you had to say. He (the Holy Prophet) said: I have not sent it to you that you wear it, but I have sent It to you so that you may derive benefit out of it; and Usama (donned) the garment (presented to him) and appeared to be brisk, whereupon Allah's Apostle (may peace be upon him) looked at him with a look by which he perceived that the Messenger of Allah (may peace be upon him) did not like what he had done. He said: Allah's Messenger. why is it that you look at me like this. whereas you yourself presented it to me? He said: I never sent it to you to wear it, but I sent It to you so that you may tear it and make out head covering for your ladies.",
      "chain": [
        "20656",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5698",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم بنحو حديثهم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abdullah.",
      "chain": [
        "20656",
        "11272",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5965",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا نافع، قال كان ابن عمر يقتل الحيات كلهن حتى حدثنا أبو لبابة بن عبد المنذر البدري، أن رسول الله صلى الله عليه وسلم نهى عن قتل جنان البيوت فأمسك ‏.‏",
      "text_en": " Nafi' reported that Ibn 'Urnar used to kill all types of snakes until Abu Lubaba b. 'Abd al-Mundhir Badri reported that Allah's Messenger (may peace be upon him) had forbidden the killing of the snakes of the houses, and so he abstained from it.",
      "chain": [
        "20656",
        "11272",
        "11014"
      ]
    },
    {
      "hadith_no": "5977",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني محمد بن رافع، حدثنا وهب بن جرير بن حازم، حدثنا أبي قال، سمعت  أسماء بن عبيد، يحدث عن رجل، يقال له السائب - وهو عندنا أبو السائب - قال دخلنا على أبي سعيد الخدري فبينما نحن جلوس إذ سمعنا تحت، سريره حركة فنظرنا فإذا حية ‏.‏ وساق الحديث بقصته نحو حديث مالك عن صيفي وقال فيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البيوت عوامر فإذا رأيتم شيئا منها فحرجوا عليها ثلاثا فإن ذهب وإلا فاقتلوه فإنه كافر ‏\"‏ ‏.‏ وقال لهم ‏\"‏ اذهبوا فادفنوا صاحبكم ‏\"‏ ‏.‏",
      "text_en": " Asma' b. 'Ubaid reported about a person who was called as-Sa'ib having said:                      We visited Abu Sa'id Khudri. When we had been sitting (with him) we heard a stir under his bed. When we looked we found a big snake, the rest of the hadith is the same. And in this Allah's Messenger (may peace be upon him) is reported to have said: Verily in these houses there live aged (snakes), so when you see one of them, make life hard for it for three days, and if it goes away (well and good), otherwise kill it for (in that case) it would be a nonbeliever. And he (the Holy Prophet) said (to his Companions): Go and bury your companion (who had died by the snake bite).",
      "chain": [
        "30375",
        "20298",
        "11272",
        "10667"
      ]
    },
    {
      "hadith_no": "5998",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني جرير بن حازم، عن  أيوب السختياني، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينما كلب يطيف بركية قد كاد يقتله العطش إذ رأته بغي من بغايا بني إسرائيل فنزعت موقها فاستقت له به فسقته إياه فغفر لها به ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There was a dog moving around a well whom thirst would have killed. Suddenly a prostitute from the prostitutes of Bani Isra'il happened to see it and she drew water in her shoe and made it drink, and she was pardoned because of this.",
      "chain": [
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "6076",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي، عن أبي رجاء العطاردي، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى الصبح أقبل عليهم بوجهه فقال ‏\"‏ هل رأى أحد منكم البارحة رؤيا ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundab reported that when Allah's Messenger (may peace be upon him) had performed his dawn prayer he turned his face towards them (that is towards his Companions) and said:                      Did any one of you see any vision last night?",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "6117",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا وهب، - يعني ابن جرير - حدثنا أبي قال، سمعت  يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن مرثد، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد ثم صعد المنبر كالمودع للأحياء والأموات فقال ‏\"‏ إني فرطكم على الحوض وإن عرضه كما بين أيلة إلى الجحفة إني لست أخشى عليكم أن تشركوا بعدي ولكني أخشى عليكم الدنيا أن تنافسوا فيها وتقتتلوا فتهلكوا كما هلك من كان قبلكم ‏\"‏ ‏.‏ قال عقبة فكانت آخر ما رأيت رسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " Uqba b. 'Amir reported Allah's Messenger (may peace be upon him) as saying:                      Allah's Messenger offered prayer over those who had fallen matyrs at Uhud. He then climbed the pulpit as if someone is saying good-bye to the living and the dead, and then said: I shall be there as your predecesor on the Cistern before you, and it is as wide as the distance between Aila and Juhfa (Aila is at the top of the gulf of 'Aqaba). I am not afraid that you would associate anything with Allah after me, but I am afraid that you may be (allured) by the world and (vie) with one another (in possessing material wealth) and begin killing one another, and you would be destroyed as were destroyed those who had gone before you. 'Uqba said that that was the last occasion that he saw Allah's Massenger on the pulpit.",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "6213",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا قتادة، قال قلت لأنس بن مالك كيف كان شعر رسول الله صلى الله عليه وسلم قال كان شعرا رجلا ليس بالجعد ولا السبط بين أذنيه وعاتقه ‏.‏",
      "text_en": " Qatada reported:                      I asked Anas b. Malik: How was the hair of Allah's Messenger (may peace be upon him)? Thereupon he said: His hair was neither very curly nor very straight, and they hung over his shoulders and earlobes.",
      "chain": [
        "20656",
        "11272",
        "11019"
      ]
    },
    {
      "hadith_no": "6294",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني جرير بن حازم، عن  أيوب السختياني، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لم يكذب إبراهيم النبي عليه السلام قط إلا ثلاث كذبات ثنتين في ذات الله قوله ‏{‏ إني سقيم‏}‏ ‏.‏ وقوله ‏{‏ بل فعله كبيرهم هذا‏}‏ وواحدة في شأن سارة فإنه قدم أرض جبار ومعه سارة وكانت أحسن الناس فقال لها إن هذا الجبار إن يعلم أنك امرأتي يغلبني عليك فإن سألك فأخبريه أنك أختي فإنك أختي في الإسلام فإني لا أعلم في الأرض مسلما غيري وغيرك فلما دخل أرضه رآها بعض أهل الجبار أتاه فقال له لقد قدم أرضك امرأة لا ينبغي لها أن تكون إلا لك ‏.‏ فأرسل إليها فأتي بها فقام إبراهيم عليه السلام إلى الصلاة فلما دخلت عليه لم يتمالك أن بسط يده إليها فقبضت يده قبضة شديدة فقال لها ادعي الله أن يطلق يدي ولا أضرك ‏.‏ ففعلت فعاد فقبضت أشد من القبضة الأولى فقال لها مثل ذلك ففعلت فعاد فقبضت أشد من القبضتين الأوليين فقال ادعي الله أن يطلق يدي فلك الله أن لا أضرك ‏.‏ ففعلت وأطلقت يده ودعا الذي جاء بها فقال له إنك إنما أتيتني بشيطان ولم تأتني بإنسان فأخرجها من أرضي وأعطها هاجر ‏.‏ قال فأقبلت تمشي فلما رآها إبراهيم عليه السلام انصرف فقال لها مهيم قالت خيرا كف الله يد الفاجر وأخدم خادما ‏.‏ قال أبو هريرة فتلك أمكم يا بني ماء السماء ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying Prophet Ibrahim (peace be upon him) never told a lie but only thrice:                      two times for the sake of Allah (for example, his words):\" I am sick,\" and his words:\" But it was the big one amongst them which has done that\" and because of Sara (his wife). He had come in a land inhabited by haughty and cruel men along with Sara. She was very good-looking amongst the people, so he said to her: If these were to know that you are my wife they would snatch you away from me, so if they ask you tell that you are my sister and in fact you are my sister in Islam, and I do not know of any other Muslim in this land besides I and you. And when they entered that land the tyrants came to see her and said to him (the king): 'there comes to your land a woman, whom you alone deserve to possess, so he (the kings sent someone (towards her) and she was brought and Ibrahim (peace be upon him) stood in preyer, and when she visited him (the tyrant king came) he could help but stretch his hand towards her and his hand was tied up. He said: Supplicate Allah so that He may release my hand and I will do no harm to you. She did that and the man repeated (the same highhandedness) and his hand was again tied up more tightly than on the first occasion and he said to her like that and she again did that (supplicated), but he repeated (the same highhandedness and his hands were tied up more tightly than on the previous occasion). He then again said: Supplicate your Lord so that He may set my hand free; by. @ llah I shall do no harm to you. She did and his hand was freed. Then he called the person who had brought her and said to him: You have brought to me the satan and you have not brought to me a human being, so turn them out from my land, and he gave Hajira as a gift to her. She returned (along with Hajira) and when Ibrahim (peace be upon him) saw her, he said: How have you returned? She said: With full safety (have I returned). Allah held the hand of that debauch and he gave me a maid-servant. Abu Hiaraira said: O sons of the rain of the sky, she is your mother.",
      "chain": [
        "20029",
        "11272",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "6464",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنيه أبو معن الرقاشي، حدثنا وهب، - يعني ابن جرير - عن أبيه، قال سمعت النعمان، - يعني ابن راشد - يحدث عن الزهري، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20298",
        "11272",
        "10971"
      ]
    },
    {
      "hadith_no": "6658",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا وهب بن جرير، حدثنا  أبي، سمعت حرملة المصري، يحدث عن عبد الرحمن بن شماسة، عن أبي بصرة، عن أبي، ذر قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم ستفتحون مصر وهي أرض يسمى فيها القيراط فإذا فتحتموها فأحسنوا إلى أهلها فإن لهم ذمة ورحما ‏\"‏ ‏.‏ أو قال ‏\"‏ ذمة وصهرا فإذا رأيت رجلين يختصمان فيها في موضع لبنة فاخرج منها ‏\"‏ ‏.‏ قال فرأيت عبد الرحمن بن شرحبيل بن حسنة وأخاه ربيعة يختصمان في موضع لبنة فخرجت منها ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      You would soon conquer Egypt and that is a land which is known (as the land of al-qirat). So when you conquer it, treat its inhabitants well. For there lies upon you the responsibility because of blood-tie or relationship of marriage (with them). And when you see two persons falling into dispute amongst themselves for the space of a brick, than get out of that. He (Abu Dharr) said: I saw Abd al-Rahman b. Shurahbil b. Hasana and his brother Rabi'a disputing with one another for the space of a brick. So I left that (land).",
      "chain": [
        "30022",
        "30359",
        "20298",
        "11272",
        "10867",
        "23"
      ]
    },
    {
      "hadith_no": "6673",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يزيد بن هارون، أخبرنا جرير بن حازم، حدثنا  محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لم يتكلم في المهد إلا ثلاثة عيسى ابن مريم وصاحب جريج وكان جريج رجلا عابدا فاتخذ صومعة فكان فيها فأتته أمه وهو يصلي فقالت يا جريج ‏.‏ فقال يا رب أمي وصلاتي ‏.‏ فأقبل على صلاته فانصرفت فلما كان من الغد أتته وهو يصلي فقالت يا جريج فقال يا رب أمي وصلاتي فأقبل على صلاته فانصرفت فلما كان من الغد أتته وهو يصلي فقالت يا جريج ‏.‏ فقال أى رب أمي وصلاتي ‏.‏ فأقبل على صلاته فقالت اللهم لا تمته حتى ينظر إلى وجوه المومسات ‏.‏ فتذاكر بنو إسرائيل جريجا وعبادته وكانت امرأة بغي يتمثل بحسنها فقالت إن شئتم لأفتننه لكم - قال - فتعرضت له فلم يلتفت إليها فأتت راعيا كان يأوي إلى صومعته فأمكنته من نفسها فوقع عليها فحملت فلما ولدت قالت هو من جريج ‏.‏ فأتوه فاستنزلوه وهدموا صومعته وجعلوا يضربونه فقال ما شأنكم قالوا زنيت بهذه البغي فولدت منك ‏.‏ فقال أين الصبي فجاءوا به فقال دعوني حتى أصلي فصلى فلما انصرف أتى الصبي فطعن في بطنه وقال يا غلام من أبوك قال فلان الراعي - قال - فأقبلوا على جريج يقبلونه ويتمسحون به وقالوا نبني لك صومعتك من ذهب ‏.‏ قال لا أعيدوها من طين كما كانت ‏.‏ ففعلوا ‏.‏ وبينا صبي يرضع من أمه فمر رجل راكب على دابة فارهة وشارة حسنة فقالت أمه اللهم اجعل ابني مثل هذا ‏.‏ فترك الثدى وأقبل إليه فنظر إليه فقال اللهم لا تجعلني مثله ‏.‏ ثم أقبل على ثديه فجعل يرتضع ‏.‏ قال فكأني أنظر إلى رسول الله صلى الله عليه وسلم وهو يحكي ارتضاعه بإصبعه السبابة في فمه فجعل يمصها ‏.‏ قال ومروا بجارية وهم يضربونها ويقولون زنيت سرقت ‏.‏ وهي تقول حسبي الله ونعم الوكيل ‏.‏ فقالت أمه اللهم لا تجعل ابني مثلها ‏.‏ فترك الرضاع ونظر إليها فقال اللهم اجعلني مثلها ‏.‏ فهناك تراجعا الحديث فقالت حلقى مر رجل حسن الهيئة فقلت اللهم اجعل ابني مثله ‏.‏ فقلت اللهم لا تجعلني مثله ‏.‏ ومروا بهذه الأمة وهم يضربونها ويقولون زنيت سرقت ‏.‏ فقلت اللهم لا تجعل ابني مثلها ‏.‏ فقلت اللهم اجعلني مثلها قال إن ذاك الرجل كان جبارا فقلت اللهم لا تجعلني مثله ‏.‏ وإن هذه يقولون لها زنيت ‏.‏ ولم تزن وسرقت ولم تسرق فقلت اللهم اجعلني مثلها ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      None spoke in the cradle but only three (persons), Christ son of Mary, the second one the companion of Juraij. Juraij had got constructed a temple and confined himself in that. His mother came to him as he was busy in prayer and she said: Juraij. He said: My Lord, my mother (is calling me while I am engaged in) my prayer. He continued with the prayer. She returned and she came on the next day and he was busy in prayer, and she said: Juraij. And he said: My Lord, my mother (is calling me while I am engaged) in prayer, and he continued with the prayer and she went back, and then on the next day she again came and he was busy in prayer and she said: Juraij. And he said: My Lord, my mother (is calling me while I am engaged in my prayer, and he continued with the prayer, and she said: My Lord, don't give him death unless he has seen the fate of the prostitutes. The story of Juraij and that of his meditation and prayer gained currency amongst Bani Isra'il. There was a prostitute who had been a beauty incarnate. She said (to the people): If you like I can allure him to evil. She presented herself to him but he paid no heed (to her). She came to a shepherd who lived near the temple and she offered herself to him and he had a sexual intercourse with her and so she became pregnant arid when she gave birth to a child she said: This is from Juraij. So they came and asked him to get down and demolished the temple and began to beat him. He said: What is the matter? They said: You have committed fornication with this prostitute and she has given birth to a child from your loins. He said: Where is the child? They brought him (the child) and he said: just leave me so that I should observe prayer. And he observed prayer and when he finished, he came to the child. He struck his stomach and said: O boy, who is your father? lie said: He is such shepherd. So they turned towards Juraij, kissed him and touched him (for seeking blessing) and said: We are prepared to construct your temple with gold. He said. No, just rebuild it with mud as it had been, and they did that. Then there was a babe who was sucking his mother that a person dressed in fine garment came riding upon a beast. His mother said: O Allah, make my child like this one. He (the babe) left sucking and began to see towards him, and said: O Allah, don't make me like him. He then returned to the chest and began to suck the milk of his mother. He (Abu Huraira) said: I perceived as if I am seeing Allah's Messenger (may peace be upon him) as he is explaining the scene of his sucking milk with his forefinger in his mouth and sucking that. He (Abu Huraira) further reported Allah's Apostle (may be peace upon him) as saying: There happened to pass by him a girl who was being beaten and they were saying: You have committed adultery and you have committed theft and she was saying: Allah is enough for me and He is my good Protector, and his mother said: O Allah, don't make my child like her and he left sucking the milk, and looked towards her and said: O Allah, make me like her, and there was a talk between them. She said: O with shaven head, a good-looking person happened to pass by and I said: O Allah, make my child like him, and you said: O Allah, don't make me like him, and they passed by a girl while they were beating her and saying: You committed fornication and you committed theft, and I said: O Allah, don't make my child like her, and you said: O Allah, make me like her. Thereupon he said: That person was a tyrant, and I said: O Allah, don't make me like him, and they were saying about her: You committed fornication whereas in fact she had not committed that and they were saying: You have committed theft whereas she had not committed theft, so I said: O Allah, make me like her.",
      "chain": [
        "30022",
        "20472",
        "11272",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "7575",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، وأحمد بن عثمان النوفلي، قالا حدثنا وهب، بن جرير حدثنا أبي قال، سمعت غيلان بن جرير، يحدث عن الشعبي، عن فاطمة بنت، قيس قالت قدم على رسول الله صلى الله عليه وسلم تميم الداري فأخبر رسول الله صلى الله عليه وسلم أنه ركب البحر فتاهت به سفينته فسقط إلى جزيرة فخرج إليها يلتمس الماء فلقي إنسانا يجر شعره ‏.‏ واقتص الحديث وقال فيه ثم قال أما إنه لو قد أذن لي في الخروج قد وطئت البلاد كلها غير طيبة ‏.‏ فأخرجه رسول الله صلى الله عليه وسلم إلى الناس فحدثهم قال ‏\"‏ هذه طيبة وذاك الدجال ‏\"‏ ‏.‏",
      "text_en": " Tamim Dari came to Allah's Messenger (may peace be upon him) and informed Allah's Messenger (may peace be upon him) that he sailed in an ocean and his ship lost direction and thus landed at an island. They moved about in that land in search of water. There they saw a person who had been pulling his hair. The rest of the hadith is the same. And he (Dajjal) said:                      If I were to be permitted to set out I would have covered all the lands except Taiba. Then Allah's Messerger (may peace be upon him) brought (Tamim Dari) before the public and he narrated to them and said: That is Taiba and that is the Dajjal.",
      "chain": [
        "30115",
        "30185",
        "20298",
        "11272",
        "11300",
        "11052",
        "224"
      ]
    },
    {
      "hadith_no": "13",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن أبان بن صالح، عن مجاهد، عن جابر بن عبد الله، قال نهى نبي الله صلى الله عليه وسلم أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet of Allah (ﷺ) forbade us to face the qiblah at the time of making water.  Then I saw him facing it (qiblah) urinating or easing himself one year before his death.",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "19897",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هارون بن معروف، حدثنا ابن وهب، عن جرير بن حازم، أنه سمع قتادة بن دعامة، حدثنا أنس بن مالك، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وقد توضأ وترك على قدميه مثل موضع الظفر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ارجع فأحسن وضوءك ‏\"‏ ‏.‏ قال أبو داود وهذا الحديث ليس بمعروف عن جرير بن حازم ولم يروه إلا ابن وهب وحده وقد روي عن معقل بن عبيد الله الجزري عن أبي الزبير عن جابر عن عمر عن النبي صلى الله عليه وسلم نحوه قال ‏\"‏ ارجع فأحسن وضوءك ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      A person came to the Messenger of Allah (ﷺ). He performed ablution and left a small part equal to the space of a nail upon his foot. The Messenger of Allah (ﷺ) said to him : Go back and perform ablution well. Abu Dawud said: This tradition is not known through Jarir b. Hazim. It was transmitted only by Ibn Wahab. Another version adds the wording : “ Go back and perform the ablution well.”",
      "chain": [
        "30280",
        "20029",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن المثنى، أخبرنا وهب بن جرير، أخبرنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير المصري، عن عمرو بن العاص، قال احتلمت في ليلة باردة في غزوة ذات السلاسل فأشفقت إن اغتسلت أن أهلك فتيممت ثم صليت بأصحابي الصبح فذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ يا عمرو صليت بأصحابك وأنت جنب ‏\"‏ ‏.‏ فأخبرته بالذي منعني من الاغتسال وقلت إني سمعت الله يقول ‏{‏ ولا تقتلوا أنفسكم إن الله كان بكم رحيما ‏}‏ فضحك رسول الله صلى الله عليه وسلم ولم يقل شيئا ‏.‏ قال أبو داود عبد الرحمن بن جبير مصري مولى خارجة بن حذافة وليس هو ابن جبير بن نفير ‏.‏",
      "text_en": " Narrated Amr ibn al-'As:                     I had a sexual dream on a cold night in the battle of Dhat as-Salasil. I was afraid, if I washed I would die. I, therefore, performed tayammum and led my companions in the dawn prayer. They mentioned that to the Messenger of Allah (ﷺ). He said: Amr, you led your companions is prayer while you were sexually defiled? I informed him of the cause which impeded me from washing. And I said: I heard Allah say: \"Do not kill yourself, verily Allah is merciful to you.\" The Messenger of Allah (ﷺ) laughed and did not say anything.Abu Dawud said: 'Abd al-Rahman b. Jubair is an Egyptian and a freed slave of Kharijah b. Hudhafah. He is not Jubair b. Nufair",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "10605",
        "10865",
        "28"
      ]
    },
    {
      "hadith_no": "381",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير، - يعني ابن حازم - قال سمعت عبد الملك، - يعني ابن عمير - يحدث عن عبد الله بن معقل بن مقرن، قال صلى أعرابي مع النبي صلى الله عليه وسلم بهذه القصة قال فيه وقال يعني النبي صلى الله عليه وسلم ‏\"‏ خذوا ما بال عليه من التراب فألقوه وأهريقوا على مكانه ماء ‏\"‏ ‏.‏ قال أبو داود وهو مرسل ابن معقل لم يدرك النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Ma'qil ibn Muqarrin:                     A bedouin prayed with the Prophet (ﷺ). He then narrated the tradition (No 0380) about urinating of that bedouin. This version adds: The Prophet (ﷺ) said: Remove the earth where he urinated and throw it away and pour water upon the place.Abu Dawud said: This is a mursal tradition (i.e. the narrator quotes the Prophet (ﷺ) directly, although he did not see him). Ibn Ma'qil did not see the Prophet (ﷺ).",
      "chain": [
        "20040",
        "11272",
        "11368",
        "3119"
      ]
    },
    {
      "hadith_no": "814",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد السرخسي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن عمرو بن شعيب، عن أبيه، عن جده، أنه قال ما من المفصل سورة صغيرة ولا كبيرة إلا وقد سمعت رسول الله صلى الله عليه وسلم يؤم الناس بها في الصلاة المكتوبة ‏.‏",
      "text_en": " ‘Amr b. Shu’aib, on his father’s authority, quoted his grandfather as saying:                      There is no short or long surah in al-Mufassal which I have not heard the Messenger of Allah (May peace be upon him) reciting when he led the people in the prescribed prayer.",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1120",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، عن جرير، - هو ابن حازم لا أدري كيف قاله مسلم أو لا - عن ثابت عن أنس قال رأيت رسول الله صلى الله عليه وسلم ينزل من المنبر فيعرض له الرجل في الحاجة فيقوم معه حتى يقضي حاجته ثم يقوم فيصلي ‏.‏ قال أبو داود الحديث ليس بمعروف عن ثابت هو مما تفرد به جرير بن حازم ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I saw the Apostle (ﷺ) would descend from the pulpit and a man stop him for his need. He would remain standing with him until his need was fulfilled. Then he would stand and  pray.Abu Dawud said: This tradition is not well known from the narrator Thabit. Jarir b. Hazim is the only narrator of this tradition.",
      "chain": [
        "20285",
        "11272",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1573",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني جرير بن حازم، وسمى، آخر عن أبي إسحاق، عن عاصم بن ضمرة، والحارث الأعور، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم ببعض أول هذا الحديث قال ‏\"‏ فإذا كانت لك مائتا درهم وحال عليها الحول ففيها خمسة دراهم وليس عليك شىء - يعني في الذهب - حتى يكون لك عشرون دينارا فإذا كان لك عشرون دينارا وحال عليها الحول ففيها نصف دينار فما زاد فبحساب ذلك ‏\"‏ ‏.‏ قال فلا أدري أعلي يقول فبحساب ذلك ‏.‏ أو رفعه إلى النبي صلى الله عليه وسلم ‏\"‏ وليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏ إلا أن جريرا قال ابن وهب يزيد في الحديث عن النبي صلى الله عليه وسلم ‏\"‏ ليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: \"When you possess two hundred dirhams and one year passes on them, five dirhams are payable. Nothing is incumbent on you, that is, on gold, till it reaches twenty dinars. When you possess twenty dinars and one year passes on them, half a dinar is payable. Whatever exceeds, that will be reckoned properly.\" (The narrator said: I do not remember whether the words \"that will be reckoned properly\" were uttered by All himself or he attributed them to the Prophet (ﷺ). No zakat is payable on property till a year passes on it. But Jarir said: Ibn Wahb (sub-narrator) added to this tradition from the Prophet (ﷺ): \"No zakat is payable on property until a year passes away on it.\"",
      "chain": [
        "30584",
        "20029",
        "11272",
        "11049",
        "19871",
        "19865",
        "5"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب، - يعني ابن جرير - قال حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن أبي الزناد، عن عائشة بنت سعد بن أبي وقاص، قالت قال سعد بن أبي وقاص كان نبي الله صلى الله عليه وسلم إذا أخذ طريق الفرع أهل إذا استقلت به راحلته وإذا أخذ طريق أحد أهل إذا أشرف على جبل البيداء ‏.‏",
      "text_en": " Narrated Sa'd ibn Abi Waqqas:                     When the Prophet of Allah (peace be upon him0 undertook his journey by the way of al-Far', he shouted talbiyah when his mount stood up with him on its back. But when he travelled by the way of Uhud, he raised his voice in Talbiyah when he ascended the hill of al-Bayda'.",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "11061",
        "10559",
        "9"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عقبة بن مكرم، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن صفوان بن يعلى بن أمية، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم بالجعرانة وقد أحرم بعمرة وعليه جبة وهو مصفر لحيته ورأسه وساق هذا الحديث ‏.‏",
      "text_en": " It is narrated by Ya’la bin Umayyah that a man came to Prophet (ﷺ) at Ji’ranah, putting on ihram for ‘Umrah. He had a cloak on him and his beard and head had been dyed.",
      "chain": [
        "30441",
        "20298",
        "11272",
        "172",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "2037",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، حدثنا جرير، - يعني ابن حازم - حدثني يعلى بن حكيم، عن سليمان بن أبي عبد الله، قال رأيت سعد بن أبي وقاص أخذ رجلا يصيد في حرم المدينة الذي حرم رسول الله صلى الله عليه وسلم فسلبه ثيابه فجاء مواليه فكلموه فيه فقال إن رسول الله صلى الله عليه وسلم حرم هذا الحرم وقال ‏\"‏ من وجد أحدا يصيد فيه فليسلبه ثيابه ‏\"‏ ‏.‏ فلا أرد عليكم طعمة أطعمنيها رسول الله صلى الله عليه وسلم ولكن إن شئتم دفعت إليكم ثمنه ‏.‏",
      "text_en": " Narrated Sulayman ibn AbuAbdullah:                     Sulayman ibn AbuAbdullah said: I saw Sa'd ibn AbuWaqqas seized a man hunting in the sacred territory of Medina which the Messenger of Allah (ﷺ) had declared to be sacred. He took away his clothes from him.  His patrons came to him and spoke to him about it, but he replied: The Messenger of Allah (ﷺ) declared this territory to be sacred, saying: If anyone catches someone hunting in it he should take away from him his clothes. So I shall not return to you a provision which the Messenger of Allah (ﷺ) has given me, but if you wish I shall pay you its price.",
      "chain": [
        "10567",
        "11272",
        "11567",
        "18383"
      ]
    },
    {
      "hadith_no": "2096",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن أيوب، عن عكرمة، عن ابن عباس، أن جارية، بكرا أتت النبي صلى الله عليه وسلم فذكرت أن أباها زوجها وهي كارهة فخيرها النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A virgin came to the Prophet (ﷺ) and mentioned that her father had married her against her will, so the Prophet (ﷺ) allowed her to exercise her choice.",
      "chain": [
        "30203",
        "20384",
        "11272",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا جرير بن حازم، عن الزبير بن سعيد، عن عبد الله بن علي بن يزيد بن ركانة، عن أبيه، عن جده، أنه طلق امرأته البتة فأتى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما أردت ‏\"‏ ‏.‏ قال واحدة ‏.‏ قال ‏\"‏ آلله ‏\"‏ ‏.‏ قال آلله ‏.‏ قال ‏\"‏ هو على ما أردت ‏\"‏ ‏.‏ قال أبو داود وهذا أصح من حديث ابن جريج أن ركانة طلق امرأته ثلاثا لأنهم أهل بيته وهم أعلم به وحديث ابن جريج رواه عن بعض بني أبي رافع عن عكرمة عن ابن عباس ‏.‏",
      "text_en": " 'Ali b. Yazid b. Rukanah reported on the authority of his father from his grandfather that he  (Rukanah) divorced his wife absolutely; so he came to the Messenger of Allah (ﷺ). He asked (him):                      What did you intend? He said: A single utterance of divorce. He said: Do you swear by Allah? He replied: I swear by Allah. He said: It stands as you intended.Abu Dawud said: This tradition is sounder than that of Ibn Juraij that Rukanah divorced his wife by three pronouncements, for they are the members of his family and they are more aware for him. The tradition of Ibn Juraij has been narrated by some children of Abu Rafi' from 'Ikrimah on the authority of Ibn 'Abbas.",
      "chain": [
        "30584",
        "11272",
        "18549"
      ]
    },
    {
      "hadith_no": "2243",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن معين، حدثنا وهب بن جرير، عن أبيه، قال سمعت يحيى بن أيوب، عن يزيد بن أبي حبيب، عن أبي وهب الجيشاني، عن الضحاك بن فيروز، عن أبيه، قال قلت يا رسول الله إني أسلمت وتحتي أختان ‏.‏ قال ‏\"‏ طلق أيتهما شئت ‏\"‏ ‏.‏",
      "text_en": " Al-Dahhak b. Firuz reported on the authority of his father:                       I said: Messenger of Allah, I have embraced Islam and two sisters are my wives. He said: Divorce any one of them you wish.",
      "chain": [
        "30020",
        "20298",
        "11272",
        "20379",
        "11411",
        "18453"
      ]
    },
    {
      "hadith_no": "2583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، حدثنا قتادة، عن أنس، قال كانت قبيعة سيف رسول الله صلى الله عليه وسلم فضة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The pommel of the sword of the Messenger of Allah (ﷺ) was of silver.",
      "chain": [
        "20285",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2611",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا زهير بن حرب أبو خيثمة، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يونس، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ خير الصحابة أربعة وخير السرايا أربعمائة وخير الجيوش أربعة آلاف ولن يغلب اثنا عشر ألفا من قلة ‏\"‏ ‏.‏ قال أبو داود والصحيح أنه مرسل ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The best number of companions is four, the best number in expeditions four hundred, and the best number in armies four thousand; and twelve thousand will not be overcome through smallness of numbers.Abu Dawud said: What is correct is that this tradition is mursal (i.e. the link of the Companion is missing).",
      "chain": [
        "30022",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2646",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا ابن المبارك، عن جرير بن حازم، عن الزبير بن خريت، عن عكرمة، عن ابن عباس، قال نزلت ‏{‏ إن يكن منكم عشرون صابرون يغلبوا مائتين ‏}‏ فشق ذلك على المسلمين حين فرض الله عليهم أن لا يفر واحد من عشرة ثم إنه جاء تخفيف فقال ‏{‏ الآن خفف الله عنكم ‏}‏ قرأ أبو توبة إلى قوله ‏{‏ يغلبوا مائتين ‏}‏ قال فلما خفف الله تعالى عنهم من العدة نقص من الصبر بقدر ما خفف عنهم ‏.‏",
      "text_en": " Ibn ‘Abbas said “When the verse “If there are twenty amongst you patient and persevering, they will vanquish two hundred” was revealed. It was heavy and troublesome for Muslims when Allaah prescribed for them that one (fighting Muslim) should not fly from ten (fighting Non-Muslims). Then a light commandment was revealed saying “For the present Allaah hath lightened your (task).” The narrator Abu Tawbah recited the verse to “they will vanquish two hundred.” When Allaah lightened the number, patient and perseverance also decreased according to the number lightened from them.”",
      "chain": [
        "30335",
        "20025",
        "11272",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2703",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا جرير، - يعني ابن حازم - عن يعلى بن حكيم، عن أبي لبيد، قال كنا مع عبد الرحمن بن سمرة بكابل فأصاب الناس غنيمة فانتهبوها فقام خطيبا فقال سمعت رسول الله صلى الله عليه وسلم ينهى عن النهبى ‏.‏ فردوا ما أخذوا فقسمه بينهم ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Samurah ibn Kabul:                     AbuLabid said: We were with AbdurRahman ibn Samurah ibn Kabul. The people got booty and plundered it. He stood and addressed (the people): I heard the Messenger of Allah (ﷺ) prohibiting getting property from the booty before its distribution. Therefore, they returned what they had taken, He then distributed it among them.",
      "chain": [
        "20193",
        "11272",
        "11567"
      ]
    },
    {
      "hadith_no": "3075",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا وهب، عن أبيه، عن ابن إسحاق، بإسناده ومعناه إلا أنه قال عند قوله مكان الذي حدثني هذا فقال رجل من أصحاب النبي صلى الله عليه وسلم وأكثر ظني أنه أبو سعيد الخدري فأنا رأيت الرجل يضرب في أصول النخل ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn Ishaq through a different chain of narrators and to the same effect. Instead of the phrase “one who transmitted this tradition to me” this version has “A man from among the Companions of the Prophet (ﷺ) and probably he was Abu Sa’id Al Khudri. I saw the man striking at the roots of the palm trees.”",
      "chain": [
        "30296",
        "20298",
        "11272"
      ]
    },
    {
      "hadith_no": "3088",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا يحيى بن معين، حدثنا وهب بن جرير، حدثنا أبي، سمعت محمد بن إسحاق، يحدث عن إسماعيل بن أمية، عن بجير بن أبي بجير، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول حين خرجنا معه إلى الطائف فمررنا بقبر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا قبر أبي رغال وكان بهذا الحرم يدفع عنه فلما خرج أصابته النقمة التي أصابت قومه بهذا المكان فدفن فيه وآية ذلك أنه دفن معه غصن من ذهب إن أنتم نبشتم عنه أصبتموه معه ‏\"‏ ‏.‏ فابتدره الناس فاستخرجوا الغصن ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     When we went out along with the Messenger of Allah (ﷺ) to at-Ta'if we passed a grave. I heard the Messenger of Allah (ﷺ) say: This is the grave of AbuRighal. He was in this sacred mosque (sanctuary) protecting himself (from punishment). When he came out, he suffered the same punishment which his people suffered at this place, and he was buried in it. The sign of it is that a golden bough was buried with him. If you dig it out, you will find it with him. The people hastened to it and took out the bough.",
      "chain": [
        "30020",
        "20298",
        "11272",
        "11107",
        "11417",
        "29"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا جرير بن حازم، عن الزبير بن خريت، قال سمعت عكرمة، يقول كان ابن عباس يقول إن النبي صلى الله عليه وسلم نهى عن طعام المتباريين أن يؤكل ‏.‏ قال أبو داود أكثر من رواه عن جرير لا يذكر فيه ابن عباس وهارون النحوي ذكر فيه ابن عباس أيضا وحماد بن زيد لم يذكر ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) forbade that the food of two people who were rivalling on another should be eatenAbu Dawud said: Most of those who narrated it from Jarir did not mention the name of Ibn Abbas. Harun al-Nahwi mentioned Ibn 'Abbas in it, and Hammad bin Zaid did not mention Ibn 'Abbas.",
      "chain": [
        "38673",
        "11272",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3801",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عبد الله الخزاعي، حدثنا جرير بن حازم، عن عبد الله بن عبيد، عن عبد الرحمن بن أبي عمار، عن جابر بن عبد الله، قال سألت رسول الله صلى الله عليه وسلم عن الضبع فقال ‏\"‏ هو صيد ويجعل فيه كبش إذا صاده المحرم ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I asked the Messenger of Allah (ﷺ) about the hyena. He replied: It is game, and if one who is wearing ihram (pilgrim's robe) hunts it, he should give a sheep as atonement.",
      "chain": [
        "37563",
        "11272",
        "34"
      ]
    },
    {
      "hadith_no": "3860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير، - يعني ابن حازم - حدثنا قتادة، عن أنس، أن النبي صلى الله عليه وسلم احتجم ثلاثا في الأخدعين والكاهل ‏.‏ قال معمر احتجمت فذهب عقلي حتى كنت ألقن فاتحة الكتاب في صلاتي ‏.‏ وكان احتجم على هامته ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) had himself cupped three times in the veins at the sides of the neck and on the shoulder. Ma'mar said: I got myself cupped, and I lost my memory so much so that I was instructed Surat al-Fatihah by others in my prayer. He had himself cupped at the top of his head.",
      "chain": [
        "20285",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3939",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، وابن أبي عدي، عن سعيد، بإسناده ومعناه ‏.‏ قال أبو داود ورواه روح بن عبادة عن سعيد بن أبي عروبة، لم يذكر السعاية ورواه جرير بن حازم وموسى بن خلف جميعا عن قتادة، بإسناد يزيد بن زريع ومعناه وذكرا فيه السعاية ‏.‏",
      "text_en": " The tradition mentioned above by Rawh b. 'Ubadah from Sa'id b. Abu 'Arubah. In this version he did not mention the words \"the slave should be required to work.\" If has also been transmitted by Jarir b. Hazim and Musa b. Khalaf from Qatadah through the chain of Yazid b. Zurai' and to the same effect. In this version they mentioned the words \"the slave should be required to work\"",
      "chain": [
        "30160",
        "20031",
        "20276",
        "30002",
        "20229",
        "11272"
      ]
    },
    {
      "hadith_no": "4192",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا عقبة بن مكرم، وابن المثنى، قالا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن أبي يعقوب، يحدث عن الحسن بن سعد، عن عبد الله بن جعفر، أن النبي صلى الله عليه وسلم أمهل آل جعفر ثلاثا أن يأتيهم ثم أتاهم فقال ‏\"‏ لا تبكوا على أخي بعد اليوم ‏\"‏ ‏.‏ ثم قال ‏\"‏ ادعوا لي بني أخي ‏\"‏ ‏.‏ فجيء بنا كأنا أفرخ فقال ‏\"‏ ادعوا لي الحلاق ‏\"‏ ‏.‏ فأمره فحلق رءوسنا ‏.‏",
      "text_en": " Narrated Abdullah ibn Ja'far:                     The Prophet (ﷺ) gave the children of Ja'far three day' time to visit them. He then came to visit them, and said: Do not weep over my brother after this day. He said: Call to me the children of my brother. We were brought to him as if we were chicken. He said: Call a barber to me. He then ordered and our heads were shaved.",
      "chain": [
        "30441",
        "30170",
        "20298",
        "11272",
        "10754",
        "108"
      ]
    },
    {
      "hadith_no": "4250",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "قال أبو داود حدثت عن ابن وهب، قال حدثنا جرير بن حازم، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك المسلمون أن يحاصروا إلى المدينة حتى يكون أبعد مسالحهم سلاح ‏\"‏ ‏.‏",
      "text_en": " Abu Dawud said:                      Ibn 'Umar reported the Messenger of Allah (ﷺ) as saying: The Muslims will soon be besieged up to Medina, so that their most distant frontier outpost will be Salah.",
      "chain": [
        "20029",
        "11272",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "قال أبو داود حدثت عن ابن وهب، قال حدثني جرير بن حازم، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك المسلمون أن يحاصروا إلى المدينة حتى يكون أبعد مسالحهم سلاح ‏\"‏ ‏.‏",
      "text_en": " Abu Dawud said:                      Ibn ‘Umar reported the Messenger of Allah (May peace be upon him)As saying: The Muslims will soon be besieged up to Madina so that their most distant frontier outpost will be Salah.",
      "chain": [
        "20029",
        "11272",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4401",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن سليمان بن مهران، عن أبي ظبيان، عن ابن عباس، قال مر على علي بن أبي طالب رضى الله عنه بمعنى عثمان ‏.‏ قال أوما تذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رفع القلم عن ثلاثة عن المجنون المغلوب على عقله حتى يفيق وعن النائم حتى يستيقظ وعن الصبي حتى يحتلم ‏\"‏ ‏.‏ قال صدقت قال فخلى عنها سبيلها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Ibn Abbas said: A lunatic woman passed by Ali ibn AbuTalib. He then mentioned the rest of the tradition to the same effect as Uthman mentioned. This version has: Do you not remember that the Messenger of Allah (ﷺ) has said: There are three whose actions are not recorded: a lunatic whose mind is deranged till he is restored to consciousness, a sleeper till he awakes, and a boy till he reaches puberty?",
      "chain": [
        "30485",
        "20029",
        "11272",
        "19301",
        "17"
      ]
    },
    {
      "hadith_no": "4726",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الأعلى بن حماد، ومحمد بن المثنى، ومحمد بن بشار، وأحمد بن سعيد الرباطي، قالوا حدثنا وهب بن جرير، - قال أحمد كتبناه من نسخته وهذا لفظه - قال حدثنا أبي قال سمعت محمد بن إسحاق يحدث عن يعقوب بن عتبة عن جبير بن محمد بن جبير بن مطعم عن أبيه عن جده قال أتى رسول الله صلى الله عليه وسلم أعرابي فقال يا رسول الله جهدت الأنفس وضاعت العيال ونهكت الأموال وهلكت الأنعام فاستسق الله لنا فإنا نستشفع بك على الله ونستشفع بالله عليك ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ ويحك أتدري ما تقول ‏\"‏ وسبح رسول الله صلى الله عليه وسلم فما زال يسبح حتى عرف ذلك في وجوه أصحابه ثم قال ‏\"‏ ويحك إنه لا يستشفع بالله على أحد من خلقه شأن الله أعظم من ذلك ويحك أتدري ما الله إن عرشه على سمواته لهكذا ‏\"‏ ‏.‏ وقال بأصابعه مثل القبة عليه ‏\"‏ وإنه ليئط به أطيط الرحل بالراكب ‏\"‏ ‏.‏ قال ابن بشار في حديثه ‏\"‏ إن الله فوق عرشه وعرشه فوق سمواته ‏\"‏ ‏.‏ وساق الحديث وقال عبد الأعلى وابن المثنى وابن بشار عن يعقوب بن عتبة وجبير بن محمد بن جبير عن أبيه عن جده قال أبو داود والحديث بإسناد أحمد بن سعيد هو الصحيح وافقه عليه جماعة منهم يحيى بن معين وعلي بن المديني ورواه جماعة عن ابن إسحاق كما قال أحمد أيضا وكان سماع عبد الأعلى وابن المثنى وابن بشار من نسخة واحدة فيما بلغني ‏.‏",
      "text_en": " Muhammad b. Jubair b. Mut’im said from his father on the authority of his grandfather:                      An A’rab(a nomadic Arab) came to the Messenger of Allah(ﷺ) and said: People suffering distress, the children are hungry, the crops are withered, and the animals are perished, so ask Allah to grant us rain, for we seek you as our intercessor with Allah, and Allah as intercessor with you. The Messenger of Allah(ﷺ) said: Woe to you: Do you know what you are saying? Then the Messenger of Allah(ﷺ) declared Allah’s glory and he continued declaring His glory till the effect of that was apparent in the faces of his Companions. He then said: Woe to you: Allah is not to be sought as intercessor with anyone. Allah’s state is greater than that. Woe to you! Do you know how great Allah is? His throne is above the heavens thus(indicating with his fingers like a dome over him), and it groans on account of Him as a saddle does because of the rider.Ibn Bashshar said in his version: Allah is above the throne, and the throne is above the heavens. He then mentioned the rest of the tradition. ‘Abd al-A’la, Ibn al- Muthana and Ibn Bashshar transmitted it from Ya’qub b. ‘Utbah and Jubair b. Muhammad b. Jubair from his father on the authority of his grandfather.Abu Dawud said: This tradition with the chain of Ahmad b. Sa’ad is sound. It has been approved by the body (of traditionists) , which includes Yahya b. Ma’in and ‘Ali b. al-Madani, and a group has transmitted it from Ibn Ishaq, as Ahmad also said. And so far as I have been informed ‘Abd al-A’la, Ibn al-Muthanna, and Ibn Bashshar had heard from the same copy(of the collection of tradition).",
      "chain": [
        "30146",
        "30170",
        "30160",
        "30295",
        "20298",
        "11272",
        "11107",
        "19192",
        "18118"
      ]
    },
    {
      "hadith_no": "4817",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن عيسى النيسابوري، أخبرنا ابن المبارك، أخبرنا جرير بن حازم، عن إسحاق بن سويد، عن ابن حجير العدوي، قال سمعت عمر بن الخطاب، عن النبي صلى الله عليه وسلم في هذه القصة قال ‏\"‏ وتغيثوا الملهوف وتهدوا الضال ‏\"‏ ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     The Prophet (ﷺ) said: the same occasion: Help the oppressed (sorrowful) and guide those who have lost their way.",
      "chain": [
        "20025",
        "11272",
        "11575",
        "3"
      ]
    },
    {
      "hadith_no": "5123",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا الحسين بن محمد، حدثنا جرير بن حازم، عن محمد بن إسحاق، عن داود بن حصين، عن عبد الرحمن بن أبي عقبة، عن أبي عقبة، - وكان مولى من أهل فارس - قال شهدت مع رسول الله صلى الله عليه وسلم أحدا فضربت رجلا من المشركين فقلت خذها مني وأنا الغلام الفارسي فالتفت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ فهلا قلت خذها مني وأنا الغلام الأنصاري ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUqbah:                     AbdurRahman ibn AbuUqbah quoted his father AbuUqbah who was a client from the people of Persia as saying: I was present at Uhud along with the Messenger of Allah (ﷺ), and on smiting one of the polytheists I said: Take this from me who is the young Persian. The Messenger of Allah (ﷺ) then turned to me and said: Why did you not say: Take this from me who is the young Ansari?",
      "chain": [
        "30272",
        "11272",
        "11107",
        "11160"
      ]
    },
    {
      "hadith_no": "9",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا وهب بن جرير، حدثنا أبي، عن محمد بن إسحاق، عن أبان بن صالح، عن مجاهد، عن جابر بن عبد الله، قال نهى النبي صلى الله عليه وسلم أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها ‏.‏ وفي الباب عن أبي قتادة وعائشة وعمار بن ياسر ‏.‏ قال أبو عيسى حديث جابر في هذا الباب حديث حسن غريب ‏.‏",
      "text_en": " Jabir bin Abdullah said:                     \"The Prophet prohibited us from facing the Qiblah while urinating. Then i saw him facing it a year before he died.\"",
      "chain": [
        "30160",
        "30170",
        "20298",
        "11272",
        "11107",
        "19897",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "517",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا جرير بن حازم، عن ثابت، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يكلم بالحاجة إذا نزل عن المنبر ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث جرير بن حازم ‏.‏ قال وسمعت محمدا يقول وهم جرير بن حازم في هذا الحديث والصحيح ما روي عن ثابت عن أنس قال أقيمت الصلاة فأخذ رجل بيد النبي صلى الله عليه وسلم فما زال يكلمه حتى نعس بعض القوم ‏.‏ قال محمد والحديث هو هذا ‏.‏ وجرير بن حازم ربما يهم في الشىء وهو صدوق ‏.‏ قال محمد وهم جرير بن حازم في حديث ثابت عن أنس عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏ ‏.‏ قال محمد ويروى عن حماد بن زيد قال كنا عند ثابت البناني فحدث حجاج الصواف عن يحيى بن أبي كثير عن عبد الله بن أبي قتادة عن أبيه عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏ ‏.‏ فوهم جرير فظن أن ثابتا حدثهم عن أنس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"Allah's Messenger would talk as necessary after descending from the Minbar.\"",
      "chain": [
        "30160",
        "20547",
        "11272",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "845",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا وهب بن جرير، حدثنا أبي قال، سمعت أبا فزارة، يحدث عن يزيد بن الأصم، عن ميمونة، أن رسول الله صلى الله عليه وسلم تزوجها وهو حلال وبنى بها حلالا وماتت بسرف ودفناها في الظلة التي بنى بها فيها ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وروى غير واحد هذا الحديث عن يزيد بن الأصم مرسلا أن رسول الله صلى الله عليه وسلم تزوج ميمونة وهو حلال ‏.‏",
      "text_en": " Yazid bin Al-Asamm narrated about Maimunah:                     \"The Messenger of Allah married he while he was Halal and he stayed with her while he was Halal. She died in Sarif, and we buried her at the (site of the) tent where he had stayed wit her.\"",
      "chain": [
        "30313",
        "20298",
        "11272",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن أبي وهب الجيشاني، عن الضحاك بن فيروز الديلمي، عن أبيه، قال قلت يا رسول الله إني أسلمت وتحتي أختان ‏.‏ قال ‏\"‏ اختر أيتهما شئت ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏ وأبو وهب الجيشاني اسمه الديلم بن هوشع ‏.‏",
      "text_en": " [Abu Wahb Al-Jaishani narrated from Ad-Dhahhak bin Fairuz Ad-Dailami from his father:                     \"I said: 'O Messenger of Allah! I accepted Islam and I had two sisters (as wives).' So Messenger of Allah said: 'Chose whichever of them you will.'\"]",
      "chain": [
        "30160",
        "20298",
        "11272",
        "20379",
        "11411",
        "18453"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا هناد، حدثنا قبيصة، عن جرير بن حازم، عن الزبير بن سعيد، عن عبد الله بن يزيد بن ركانة، عن أبيه، عن جده، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إني طلقت امرأتي البتة ‏.‏ فقال ‏\"‏ ما أردت بها ‏\"‏ ‏.‏ قلت واحدة ‏.‏ قال ‏\"‏ والله ‏\"‏ ‏.‏ قلت والله ‏.‏ قال ‏\"‏ فهو ما أردت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من هذا الوجه وسألت محمدا عن هذا الحديث فقال فيه اضطراب ‏.‏ ويروى عن عكرمة عن ابن عباس أن ركانة طلق امرأته ثلاثا ‏.‏ - وقد اختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في طلاق البتة فروي عن عمر بن الخطاب أنه جعل البتة واحدة وروي عن علي أنه جعلها ثلاثا ‏.‏ وقال بعض أهل العلم فيه نية الرجل إن نوى واحدة فواحدة وإن نوى ثلاثا فثلاث وإن نوى ثنتين لم تكن إلا واحدة ‏.‏ وهو قول الثوري وأهل الكوفة ‏.‏ وقال مالك بن أنس في البتة إن كان قد دخل بها فهي ثلاث تطليقات ‏.‏ وقال الشافعي إن نوى واحدة فواحدة يملك الرجعة وإن نوى ثنتين فثنتان وإن نوى ثلاثا فثلاث ‏.‏",
      "text_en": " Abdullah bin Yazid bin Rukanah narrated from his father, from his grandfather who said:                     'O Messenger of Allah! I irrevocably divorced my wife.' So he said: 'What did you intend by that?' I said: 'One (divorce).' He said: '(Do you swear) By Allah?' I said: 'By Allah.' He said: 'Then it is as you intended.'\"",
      "chain": [
        "30480",
        "20351",
        "11272"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن حجر، أخبرنا جرير بن حازم، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن سليمان بن عبد الرحمن، عن عبيد بن فيروز، عن البراء بن عازب، رفعه قال ‏\"‏ لا يضحى بالعرجاء بين ظلعها ولا بالعوراء بين عورها ولا بالمريضة بين مرضها ولا بالعجفاء التي لا تنقي ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib:                     A Marfu' narration (from the Prophet (ﷺ)), saying: \"A crippled animal whose limp is obvious is not to be slaughtered as sacrifice, nor an animal with a bad eye whose blindness is obvious, nor a sick animal whose sickness is obvious, nor an emaciated animal that has no marrow (in its bones).\"",
      "chain": [
        "20387",
        "11272",
        "11107",
        "11411",
        "30587",
        "19876",
        "400"
      ]
    },
    {
      "hadith_no": "1555",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى الأزدي البصري، وأبو عمار وغير واحد قالوا حدثنا وهب بن جرير، عن أبيه، عن يونس بن يزيد، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير الصحابة أربعة وخير السرايا أربعمائة وخير الجيوش أربعة آلاف ولا يغلب اثنا عشر ألفا من قلة ‏\"‏ ‏.‏ هذا حديث حسن غريب لا يسنده كبير أحد غير جرير بن حازم وإنما روي هذا الحديث عن الزهري عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وقد رواه حبان بن علي العنزي عن عقيل عن الزهري عن عبيد الله بن عبد الله عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏ ورواه الليث بن سعد عن عقيل عن الزهري عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said: \"The best companions are four, the best Saraya (military unit) is four hundred, the best army is four thousand, and twelve thousand will not be beaten due to being too few.\"This Hadith is Hasan Gharib, it was not narrated with a chain by anyone important besides Jarir bin Hazim, and this Hadith was only reported from Az-Zuhri, from the Prophet (ﷺ) in Mursal form. Hibban bin 'Ali Al-'Anazi reported it from 'Uqail, from Az-Zuhri, from 'Ubaidullah, from 'Ibn Abbas, from the Prophet (ﷺ), and Al-Laith bin Sa'd reported it from Sa'd, from 'Uqail, from Az-Zuhri, from the Prophet (ﷺ) in the Mursal form.",
      "chain": [
        "11222",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1691",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير بن حازم، حدثنا أبي، عن قتادة، عن أنس، قال كانت قبيعة سيف رسول الله صلى الله عليه وسلم من فضة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وهكذا روي عن همام عن قتادة عن أنس وقد روى بعضهم عن قتادة عن سعيد بن أبي الحسن قال كانت قبيعة سيف رسول الله صلى الله عليه وسلم من فضة ‏.‏",
      "text_en": " Narrated Anas:                     \"The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said: \"The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver.\"",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1697",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي، عن يحيى بن أيوب، عن يزيد بن أبي حبيب، بهذا الإسناد نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Another chain with similar meaning.[Abu 'Eisa said:                     ] This Hadith is Hasan Gharib Sahih.",
      "chain": [
        "30160",
        "20298",
        "11272",
        "20379",
        "11411"
      ]
    },
    {
      "hadith_no": "2189",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا عمرو بن عاصم، حدثنا همام، وجرير بن حازم، قالا حدثنا قتادة، عن أنس، قال كان رسول الله صلى الله عليه وسلم يحتجم في الأخدعين والكاهل وكان يحتجم لسبع عشرة وتسع عشرة وإحدى وعشرين ‏.‏ قال أبو عيسى وفي الباب عن ابن عباس ومعقل بن يسار ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Anas narrated:                     \"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2175",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان بن راشد، يحدث عن الزهري، عن عبد الله بن الحارث، عن عبد الله بن خباب بن الأرت، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم صلاة فأطالها قالوا يا رسول الله صليت صلاة لم تكن تصليها قال ‏\"‏ أجل إنها صلاة رغبة ورهبة إني سألت الله فيها ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يهلك أمتي بسنة فأعطانيها وسألته أن لا يسلط عليهم عدوا من غيرهم فأعطانيها وسألته أن لا يذيق بعضهم بأس بعض فمنعنيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وفي الباب عن سعد وابن عمر ‏.‏",
      "text_en": " 'Abdullah bin Khabbab bin Al-Aratt narrated from his father:                     \"The Messenger of Allah (s.a.w) performed Salat, making it long. They said: 'O Messenger of Allah! You have performed Salat (in a manner) which you do not ordinarily perform it.' He said: 'Yes, It was a prayer of hope and fear. In it I asked Allah for three things. He granted me two, and withheld one from me. I asked him that my Ummah not be destroyed by drought. He granted that. I asked him that they not be overcome by enemies from other then them. He granted that. And I asked him that some of them not suffer from the harm of others, and He withheld that.\"'",
      "chain": [
        "30160",
        "20298",
        "11272",
        "10971",
        "11013",
        "912",
        "2230",
        "149"
      ]
    },
    {
      "hadith_no": "2463",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير بن حازم، عن أبيه، عن أبي رجاء، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى بنا الصبح أقبل على الناس بوجهه وقال ‏\"‏ هل رأى أحد منكم الليلة رؤيا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ويروى هذا الحديث عن عوف وجرير بن حازم عن أبي رجاء عن سمرة عن النبي صلى الله عليه وسلم في قصة طويلة ‏.‏ قال وهكذا روى محمد بن بشار هذا الحديث عن وهب بن جرير مختصرا ‏.‏",
      "text_en": " Samurah bin Jundub narrated :                     \"When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'\" [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir.",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "3581",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا وهب بن جرير، حدثنا أبي قال، سمعت منصور بن زاذان، يحدث عن ميمون بن أبي شبيب، عن قيس بن سعد بن عبادة، أن أباه، دفعه إلى النبي صلى الله عليه وسلم يخدمه ‏.‏ قال فمر بي النبي صلى الله عليه وسلم وقد صليت فضربني برجله وقال ‏\"‏ ألا أدلك على باب من أبواب الجنة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Qais bin Sa’d bin Ubadah narrated, :                     that his father offered him to the Prophet to serve him. He said: “So the Prophet passed by me, and I had just performed Salat, so he poked me with his foot and said: ‘Should I not direct you to a gate from the gates of Paradise?’ I said: ‘Of course.’ He said: ‘There is no might or power except with Allah (La Hawla Wa La Quwwata Illa Billah).’”",
      "chain": [
        "20298",
        "11272",
        "11444",
        "10834",
        "172"
      ]
    },
    {
      "hadith_no": "3979",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن المطلب بن عبد الله بن قيس بن مخرمة، عن أبيه، عن جده، قال ولدت أنا ورسول الله، صلى الله عليه وسلم عام الفيل ‏.‏ وسأل عثمان بن عفان قباث بن أشيم أخا بني يعمر بن ليث أأنت أكبر أم رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم أكبر مني وأنا أقدم منه في الميلاد ولد رسول الله صلى الله عليه وسلم عام الفيل ورفعت بي أمي على الموضع قال ورأيت خذق الفيل أخضر محيلا ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏",
      "text_en": " Narrated Al-Muttalib bin 'Abdullah bin Qais bin Makhramah:                     from his father, from his grandfather, that he said: \"I and the Messenger of Allah (ﷺ), were born in the Year of the Elephant\" - he said: \"And 'Uthman bin 'Affan asked Qubath bin Ashyam, the brother of Banu Ya'mar bin Laith - 'Are you greater (in age) or the Messenger of Allah (ﷺ)?'\" He said: \"The Messenger of Allah (ﷺ) is greater than me, but I have an earlier birthday.\" He said: \"And I saw the defecation of the birds turning green.\"",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "11120"
      ]
    },
    {
      "hadith_no": "4127",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا وهب بن جرير، حدثني أبي قال، سمعت الأعمش، يحدث عن عمرو بن مرة، عن أبي البختري، عن علي، أن النبي صلى الله عليه وسلم قال لعمر في العباس ‏\"‏ إن عم الرجل صنو أبيه ‏\"‏ ‏.‏ وكان عمر كلمه في صدقته ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Ali:                     that concerning Al-'Abbas, the Prophet (ﷺ) said to 'Umar: \"Indeed, the uncle of a man is the Sinw of his father.\" And 'Umar had spoken to him concerning his charity.",
      "chain": [
        "30494",
        "20298",
        "11272",
        "11060",
        "11381",
        "11347",
        "5"
      ]
    },
    {
      "hadith_no": "4139",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عقبة بن مكرم العمي، حدثنا وهب بن جرير بن حازم، حدثنا أبي، عن محمد بن أبي يعقوب، عن عبد الرحمن بن أبي نعم، أن رجلا، من أهل العراق سأل ابن عمر عن دم البعوض يصيب الثوب فقال ابن عمر انظروا إلى هذا يسأل عن دم البعوض وقد قتلوا ابن رسول الله صلى الله عليه وسلم وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحسن والحسين هما ريحانتاى من الدنيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وقد رواه شعبة ومهدي بن ميمون عن محمد بن أبي يعقوب ‏.‏ وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abu Nu'm:                     that a man from the people of Al-'Iraq asked Ibn 'Umar about the blood of a gnat that gets on the clothes. Ibn 'Umar said \"Look at this one, he asks about the blood of a gnat while they killed the son of the Messenger of Allah (ﷺ)! And I heard the Messenger of Allah (ﷺ) said: 'Indeed Al-Hasan and Al-Husain - they are my two sweet basils in the world.'\"",
      "chain": [
        "30441",
        "20298",
        "11272",
        "11366",
        "18"
      ]
    },
    {
      "hadith_no": "4328",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، وغير، واحد، قالوا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت عبد الله بن ملاذ، يحدث عن نمير بن أوس، عن مالك بن مسروح، عن عامر بن أبي عامر الأشعري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم الحى الأسد والأشعرون لا يفرون في القتال ولا يغلون هم مني وأنا منهم ‏\"‏ ‏.‏ قال فحدثت بذلك معاوية فقال ليس هكذا قال رسول الله قال ‏\"‏ هم مني وإلى ‏\"‏ ‏.‏ فقلت ليس هكذا حدثني أبي ولكنه حدثني قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هم مني وأنا منهم ‏\"‏ ‏.‏ قال فأنت أعلم بحديث أبيك ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث وهب بن جرير ‏.‏ ويقال الأسد هم الأزد ‏.‏",
      "text_en": " Narrated 'Amir bin Abi 'Amir Al-Ash'ari:                     from his father who said: \"The Messenger of Allah (ﷺ) said: 'Blessed are the tribes of Al-Asad and Al-Ash'arun, they flee not from fighting nor do they pilfer the spoils of war. They are from me and I am from them.'\" He ('Amir) said: \"So I narrated that to Mu'awiyah, and he said: \"This is not how the Messenger of Allah (ﷺ) said it, he said: 'They are from me, and for me.' I said, this is not how my father narrated it to me, rather he narrated to me, saying: 'I heard the Messenger of Allah (ﷺ) saying: \"They are from me and I am from them.'\" So he said: 'Then you are more knowledgeable of your father's Hadith.'\"",
      "chain": [
        "38088",
        "20298",
        "11272",
        "28309",
        "19093",
        "17059",
        "18480",
        "408"
      ]
    },
    {
      "hadith_no": "4335",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عبد الرحمن بن شماسة، عن زيد بن ثابت، قال كنا عند رسول الله صلى الله عليه وسلم نؤلف القرآن من الرقاع فقال رسول الله صلى الله عليه وسلم ‏\"‏ طوبى للشأم ‏\"‏ ‏.‏ فقلنا لأى ذلك يا رسول الله قال ‏\"‏ لأن ملائكة الرحمن باسطة أجنحتها عليها ‏\"‏ ‏.‏ قال هذا حديث حسن غريب إنما نعرفه من حديث يحيى بن أيوب ‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     \"We were with the Messenger of Allah (ﷺ) collecting the Qur'an on pieces of cloth, so the Messenger of Allah (ﷺ) said: 'Tuba is for Ash-Sham.' So we said: 'Why is that O Messenger of Allah?' He said: 'Because the angels of Ar-Rahman spread their wings over it.'\"",
      "chain": [
        "30160",
        "20298",
        "11272",
        "20379",
        "11411",
        "10867",
        "49"
      ]
    },
    {
      "hadith_no": "1014",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا جرير بن حازم، عن قتادة، قال سألت أنسا كيف كانت قراءة رسول الله صلى الله عليه وسلم قال كان يمد صوته مدا ‏.‏",
      "text_en": " It was narrated that Qatadah said:                     \"I asked Anas: 'How did the Messenger of Allah (ﷺ) recite Quran?' He said: 'He used to elongate the sounds.'\"",
      "chain": [
        "30153",
        "20033",
        "11272",
        "11019"
      ]
    },
    {
      "hadith_no": "1141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا يزيد بن هارون، قال أنبأنا جرير بن حازم، قال حدثنا محمد بن أبي يعقوب البصري، عن عبد الله بن شداد، عن أبيه، قال خرج علينا رسول الله صلى الله عليه وسلم في إحدى صلاتى العشاء وهو حامل حسنا أو حسينا فتقدم رسول الله صلى الله عليه وسلم فوضعه ثم كبر للصلاة فصلى فسجد بين ظهرانى صلاته سجدة أطالها ‏.‏ قال أبي فرفعت رأسي وإذا الصبي على ظهر رسول الله صلى الله عليه وسلم وهو ساجد فرجعت إلى سجودي فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال الناس يا رسول الله إنك سجدت بين ظهرانى صلاتك سجدة أطلتها حتى ظننا أنه قد حدث أمر أو أنه يوحى إليك ‏.‏ قال ‏\"‏ كل ذلك لم يكن ولكن ابني ارتحلني فكرهت أن أعجله حتى يقضي حاجته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Shaddad, this his father said:                     \"The Messenger of Allah (ﷺ) came out to us for one of the nighttime prayers, and he was carrying Hasan or Husain. The Messenger of Allah (ﷺ) came forward and put him down, then he said the Takbir and started to pray. He prostrated during his prayer, and made the prostration lengthy.\" My father said: \"I raised my head and saw the child on the back of the Messenger of Allah (ﷺ) while he was prostrating so I went back to my prostration. When the Messenger of Allah (ﷺ) finished praying, the people said: \"O Messenger of Allah (ﷺ), you prostrated during the prayer for so long that we thought that something had happened or that you were receiving a revelation.' He said: 'No such thing happened. But my son was riding on my back and I did not like to disturb him until he had enough.'\"",
      "chain": [
        "36587",
        "20472",
        "11272",
        "169",
        "151"
      ]
    },
    {
      "hadith_no": "1188",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا وهب، - يعني ابن جرير - قال حدثنا أبي، عن قيس بن سعد، عن عطاء، عن محمد بن علي، عن عمار بن ياسر، أنه سلم على رسول الله صلى الله عليه وسلم وهو يصلي فرد عليه ‏.‏",
      "text_en": " It was narrated from 'Ammar bin Yasir that:                     He greeted the Messenger of Allah (ﷺ) with the Salam when he was praying, and he returned the greeting.",
      "chain": [
        "30160",
        "20298",
        "11272",
        "172",
        "11029",
        "11442",
        "25"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثنا الفريابي، قال حدثنا جرير بن حازم، عن ثابت البناني، عن أنس، قال كان رسول الله صلى الله عليه وسلم ينزل عن المنبر فيعرض له الرجل فيكلمه فيقوم معه النبي صلى الله عليه وسلم حتى يقضي حاجته ثم يتقدم إلى مصلاه فيصلي ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah (ﷺ) would come down from the minbar and a man would come to him and speak to him, then the Prophet (ﷺ) would listen to him until he gave him an answer, then he would go to his place of prayer and pray.\"",
      "chain": [
        "38556",
        "20034",
        "11272",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2011",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت حميد بن هلال، عن سعد بن هشام بن عامر، عن أبيه، قال ‏:‏ لما كان يوم أحد أصيب من المسلمين، وأصاب الناس جراحات فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ احفروا وأوسعوا، وادفنوا الاثنين والثلاثة في القبر، وقدموا أكثرهم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Hisham bin 'Amir that his father said:                     \"On the day of Uhud some of the people among the Muslims were killed, and people were wounded. The Messenger of Allah said: 'Dig graves and make them wide, and bury two or three in a grave, and put the one who knew more Qur'an in first.\"'",
      "chain": [
        "30172",
        "20298",
        "11272",
        "11281",
        "11166",
        "1331"
      ]
    },
    {
      "hadith_no": "2221",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال أنبأنا ابن وهب، قال أخبرني جرير بن حازم، أن محمد بن عبد الله بن أبي يعقوب الضبي، حدثه عن رجاء بن حيوة، قال حدثنا أبو أمامة الباهلي، قال قلت يا رسول الله مرني بأمر ينفعني الله به ‏.‏ قال ‏\"‏ عليك بالصيام فإنه لا مثل له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Raja bin Haiwah said:                     \"Abu Umamah Al-Bahili narrated to me: 'I said: O Messenger of Allah, tell me of something by which Allah will benefic me. He said: Take to fasting, for there is nothing like it.\"'",
      "chain": [
        "30583",
        "20029",
        "11272",
        "11076",
        "10910",
        "4048"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن صفوان بن يعلى، عن أبيه، قال أتى رسول الله صلى الله عليه وسلم رجل وهو بالجعرانة وعليه جبة وهو مصفر لحيته ورأسه فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجتك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated f rom Safwan bin Ya'la that his father saide:                     \"A man came to the Messenger of Allah when he was in Al-Jirranah wearing a Jubnah, and having applied Khauq to his beard and head. He said: 'O Messenger of Allah! I have entered Ihram for 'Umrah and I am as you see.' He said: 'Take off the Jubbah and wash off the perfume, and whatever you would do for Hajj, do it for 'Umrah.'''",
      "chain": [
        "34188",
        "20298",
        "11272",
        "172",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا يزيد بن هارون، قال أنبأنا جرير بن حازم، قال حدثنا يزيد بن رومان، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ يا عائشة لولا أن قومك حديث عهد بجاهلية لأمرت بالبيت فهدم فأدخلت فيه ما أخرج منه وألزقته بالأرض وجعلت له بابين بابا شرقيا وبابا غربيا فإنهم قد عجزوا عن بنائه فبلغت به أساس إبراهيم عليه السلام ‏\"‏ ‏.‏ قال فذلك الذي حمل ابن الزبير على هدمه ‏.‏ قال يزيد وقد شهدت ابن الزبير حين هدمه وبناه وأدخل فيه من الحجر وقد رأيت أساس إبراهيم عليه السلام حجارة كأسنمة الإبل متلاحكة ‏.‏",
      "text_en": " It was narrated from Aisha that the Messenger of Allah said to her:                     \"O Aishah, were if not for the fact that your people have recently left Jahiliyyah, I would have commanded that the House be knocked down, and I would have incorporated into it what was left out of it. I would have made its (door) in level with the ground and I would have given it two doors, an eastern door and a western door. For they built it too small, and by doing this, it would have been built on the foundation of Ibrahim, peace be upon him.\" He (one of the narrators said: \"This is what motivated Ibn Az-Zubair to knock it down.\" Yazid said: \"I saw Ibn Az-Zubair when he knocked it down and rebuilt it, and included part of the Hijr in it. And I saw the foundation of Ibrahim, peace be upon him, stones like the humps of camels joined to one another.\"",
      "chain": [
        "36587",
        "20472",
        "11272",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3783",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا جرير بن حازم، قال سمعت الحسن، قال حدثنا عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حلفت على يمين فكفر عن يمينك ثم ائت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " 'Abdur-Rahman bin Samurah said:                      \"The Messenger of Allah said: 'If you swear an oath, offer expiation for your oath, then do that which is better.'\"",
      "chain": [
        "38022",
        "30106",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "3859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن جرير بن حازم، عن حماد، - هو ابن أبي سليمان - أنه سئل عن رجل، استأجر أجيرا على طعامه قال لا حتى تعلمه‏.‏‏",
      "text_en": " It was narrated from Hammad -Ibn Abi Sulaiman- that he was asked about a man who hired a worker in return for food and he said:                      \"No, not until he tells him (what his wages will be).\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11272",
        "10756"
      ]
    },
    {
      "hadith_no": "4108",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت عبد الملك بن عمير، يحدثه عن عبد الرحمن بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Abdullah, from his father, that:                     The Messenger of Allah [SAW] said: \"Defaming a Muslim is evildoing and fighting him is Kufr.\"",
      "chain": [
        "30277",
        "20298",
        "11272",
        "20439",
        "11183"
      ]
    },
    {
      "hadith_no": "4402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني محمد بن معمر، قال حدثنا حبان بن هلال، قال حدثنا جرير بن حازم، قال حدثنا أيوب، عن زيد بن أسلم، فلقيت زيد بن أسلم فحدثني عن عطاء بن يسار، عن أبي سعيد الخدري، قال كانت لرجل من الأنصار ناقة ترعى في قبل أحد فعرض لها فنحرها بوتد ‏.‏ فقلت لزيد وتد من خشب أو حديد قال لا بل خشب فأتى النبي صلى الله عليه وسلم فسأله فأمره بأكلها ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"A man form among the Ansar had a she-camel which used to graze in front of Uhud. Something happened to it, and he slaughtered it with a stake,\"- (Ayyub, one of the narrators, said) I said to Zaid:' A stake of wood or of iron?\" He said \"No of wood.\"- \"Then he went to the Prophet and asked him, and he told him to eat it.\" (Sahih )",
      "chain": [
        "30172",
        "20218",
        "11272",
        "11015",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4456",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا وهب بن جرير، قال حدثني أبي، عن يونس، عن الحسن، عن عمرو بن تغلب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن يفشو المال ويكثر وتفشو التجارة ويظهر العلم ويبيع الرجل البيع فيقول لا حتى أستأمر تاجر بني فلان ويلتمس في الحى العظيم الكاتب فلا يوجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Taghilb said:                     \"The Messenger of Allah said: 'One of the portents of the Hour will be that wealth becomes widespread and abundant, and trade will become widespread, but knowledge will disappear. A man will try to sell something and will say: \"No, not until I consult the merchant of banu so and so: and People will look throughout a vast area for a scribe and will not find one.\" (Sahih )",
      "chain": [
        "30153",
        "20298",
        "11272",
        "20475",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "4687",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا وهب بن جرير، قال حدثنا أبي، عن الأعمش، عن حصين بن عبد الرحمن، عن عبيد الله بن عبد الله بن عتبة، أن ميمونة، زوج النبي صلى الله عليه وسلم استدانت فقيل لها يا أم المؤمنين تستدينين وليس عندك وفاء قالت إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أخذ دينا وهو يريد أن يؤديه أعانه الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah that Maimunah, the wife of the Prophet, took a loan, and it was said to her:                     \"O Mother of the Believers, why have you taken a loan when you do not have the means to pay if off?\" She said: \"I heard the Messenger of Allah say: 'Whoever takes a loan intending to pay it back, Allah, the Mighty and Sublime, will help him.\"'",
      "chain": [
        "30170",
        "20298",
        "11272",
        "11060",
        "15097",
        "11004"
      ]
    },
    {
      "hadith_no": "4774",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سعيد الرباطي، قال حدثنا وهب بن جرير، أنبأنا أبي قال، سمعت يحيى، يحدث عن بكير بن عبد الله، عن عبيدة بن مسافع، عن أبي سعيد الخدري، قال بينا رسول الله صلى الله عليه وسلم يقسم شيئا إذ أكب عليه رجل فطعنه رسول الله صلى الله عليه وسلم بعرجون كان معه فصاح الرجل فقال له رسول الله صلى الله عليه وسلم ‏\"‏ تعال فاستقد ‏\"‏ ‏.‏ قال بل عفوت يا رسول الله ‏.‏",
      "text_en": " It was narrated the Abu Sa'eed Al-Khudri said:                     \"While the Messenger of Allah was distributing something, a man came and leaned over him, and the Messenger of Allah hit him with a stick that head with him. The man shouted, and the Messenger of Allah said: 'Come and ask for retaliation. He said: 'No, I pardon you, O Messenger of Allah.\"'",
      "chain": [
        "30295",
        "20298",
        "11272",
        "20031",
        "11154",
        "38"
      ]
    },
    {
      "hadith_no": "5053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت قتادة، يحدث عن أنس، قال كان شعر النبي صلى الله عليه وسلم شعرا رجلا ليس بالجعد ولا بالسبط بين أذنيه وعاتقه ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The hair of the Prophet [SAW] was wavy, neither curly nor straight, and (hung down) between his ears and his shoulders.\"",
      "chain": [
        "30170",
        "20298",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5227",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا وهب بن جرير، قال حدثنا أبي قال، سمعت محمد بن أبي يعقوب، يحدث ‏{‏ عن الحسن بن سعد، ‏}‏ عن عبد الله بن جعفر، قال أمهل رسول الله صلى الله عليه وسلم آل جعفر ثلاثة أن يأتيهم ثم أتاهم فقال ‏\"‏ لا تبكوا على أخي بعد اليوم ‏\"‏ ‏.‏ ثم قال ‏\"‏ ادعوا إلى بني أخي ‏\"‏ ‏.‏ فجيء بنا كأنا أفرخ فقال ‏\"‏ ادعوا لي الحلاق ‏\"‏ ‏.‏ فأمر بحلق رءوسنا ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ja'far said:                     \"The Messenger of Allah [SAW] stayed away from the family of Ja'far (when he died) for three days, then he came to them, and said: 'Do not weep for my brother after today.' Then he said: 'Call my brother's sons to me.' We were brought like little chicks, and he said: 'Call the barber for me.' Then he ordered that our heads be shaved.\"",
      "chain": [
        "30313",
        "20298",
        "11272",
        "10754",
        "108"
      ]
    },
    {
      "hadith_no": "5253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سعيد، قال حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الأعمش، يحدث عن إبراهيم، عن علقمة، عن عبد الله، قال لعن رسول الله صلى الله عليه وسلم الواشمات والمتفلجات والمتنمصات المغيرات خلق الله عز وجل ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] cursed the women who do tattoos, those who have their teeth separated and Al-Mutanammisat who change the creation of Allah, the Mighty and Sublime.\"",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5319",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا العباس بن محمد، قال أنبأنا أبو نوح، قال حدثنا جرير بن حازم، عن عبد الملك بن عمير، عن إياد بن لقيط، عن أبي رمثة، قال خرج علينا رسول الله صلى الله عليه وسلم وعليه ثوبان أخضران ‏.‏",
      "text_en": " It was narrated that Abu Rimthah said:                     \"The Messenger of Allah [SAW] came out to us wearing two green garments.\"",
      "chain": [
        "11272",
        "11368",
        "10892"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، عن أبان بن صالح، عن مجاهد، عن جابر، قال نهى رسول الله  صلى الله عليه وسلم  أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah forbade facing the Qiblah when urinating. But I saw him, one year before he died, facing the Qiblah (while urinating).\"",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "19897",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "710",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، حدثنا جرير بن حازم، عن قتادة، عن أنس، أن رجلا، أتى النبي  صلى الله عليه وسلم  وقد توضأ وترك موضع الظفر لم يصبه الماء فقال له النبي  صلى الله عليه وسلم  ‏\"‏ ارجع فأحسن وضوءك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     A man came to the Prophet; he had performed ablution and has missed a spot the size of a fingernail where water had not reached. The Prophet said to him: 'Go back and perform ablution properly.'\"",
      "chain": [
        "30487",
        "20029",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1171",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا جرير بن حازم، عن ثابت، عن أنس بن مالك، أن النبي  صلى الله عليه وسلم  كان يكلم في الحاجة إذا نزل عن المنبر يوم الجمعة ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the people used to speak totheProphet (ﷺ) about their needs when he came down from the pulpitonFriday.",
      "chain": [
        "30160",
        "20547",
        "11272",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1327",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، والحسن بن أبي الربيع، قالا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان، يحدث عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال خرج رسول الله  صلى الله عليه وسلم  يوما يستسقي فصلى بنا ركعتين بلا أذان ولا إقامة ثم خطبنا ودعا الله وحول وجهه نحو القبلة رافعا يديه ثم قلب رداءه فجعل الأيمن على الأيسر والأيسر على الأيمن ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)wentout one day to pray for rain. He led us in praying two Rak’ahwithout any Adhan or Iqamah, then he addressed us and supplicated toAllah. He turned to face the Qiblah, raising his hands, then heturnedhis cloak around, putting its right on the left and its lefton theright.”",
      "chain": [
        "38001",
        "20298",
        "11272",
        "274",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "1414",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا جرير بن حازم، عن قتادة، قال سألت أنس بن مالك عن قراءة النبي،  صلى الله عليه وسلم  فقال كان يمد صوته مدا ‏.‏",
      "text_en": " It wasnarrated that Qatadah said; “I asked Anas bin Malik about therecitation of the Prophet (ﷺ) and he said:                      ‘He used to elongatehisvoice.’”",
      "chain": [
        "30170",
        "20033",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1696",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، أنبأنا وهب بن جرير، حدثنا أبي، عن محمد بن إسحاق، حدثني حسين بن عبد الله، عن عكرمة، عن ابن عباس، قال لما أرادوا أن يحفروا، لرسول الله  صلى الله عليه وسلم  بعثوا إلى أبي عبيدة بن الجراح وكان يضرح كضريح أهل مكة وبعثوا إلى أبي طلحة وكان هو الذي يحفر لأهل المدينة وكان يلحد فبعثوا إليهما رسولين وقالوا اللهم خر لرسولك ‏.‏ فوجدوا أبا طلحة فجيء به ولم يوجد أبو عبيدة فلحد لرسول الله  صلى الله عليه وسلم  ‏.‏ قال فلما فرغوا من جهازه يوم الثلاثاء وضع على سريره في بيته ‏.‏ ثم دخل الناس على رسول الله  صلى الله عليه وسلم  أرسالا ‏.‏ يصلون عليه حتى إذا فرغوا أدخلوا النساء حتى إذا فرغوا أدخلوا الصبيان ولم يؤم الناس على رسول الله  صلى الله عليه وسلم  أحد ‏.‏ لقد اختلف المسلمون في المكان الذي يحفر له فقال قائلون يدفن في مسجده ‏.‏ وقال قائلون يدفن مع أصحابه ‏.‏ فقال أبو بكر إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما قبض نبي إلا دفن حيث يقبض ‏\"‏ ‏.‏ قال فرفعوا فراش رسول الله  صلى الله عليه وسلم  الذي توفي عليه فحفروا له ثم دفن رسول الله  صلى الله عليه وسلم  وسط الليل من ليلة الأربعاء ‏.‏ ونزل في حفرته علي بن أبي طالب والفضل وقثم ابنا العباس وشقران مولى رسول الله  صلى الله عليه وسلم  ‏.‏ وقال أوس بن خولي وهو أبو ليلى لعلي بن أبي طالب أنشدك الله وحظنا من رسول الله  صلى الله عليه وسلم  ‏.‏ قال له علي انزل ‏.‏ وكان شقران مولاه أخذ قطيفة كان رسول الله  صلى الله عليه وسلم  يلبسها فدفنها في القبر وقال والله لا يلبسها أحد بعدك أبدا ‏.‏ فدفنت مع رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “When they wanted to dig agravefor the Messenger of Allah (ﷺ), they sent for Abu ‘Ubaidah binJarrah, who used to dig graves in the manner of the people of Makkah,and they sent for Abu Talhah, who used to dig graves for the peopleofAl-Madinah, and he used to make a niche in the grave. They senttwomessengers to both of them, and they said: ‘O Allah, choosewhat isbest for Your Messenger.’ They found Abu Talhah and broughthim, butthey did not find Abu ‘Ubaidah. So he dug a grave with aniche for theMessenger of Allah (ﷺ). When they had finishedpreparing him, onTuesday, he was placed on his bed in his house.Then the peopleentered upon the Messenger of Allah (ﷺ) in groupsand offered thefuneral prayer for him, and when they finished thewomen entered, andwhen they finished the children entered, and noone led the people inoffering the funeral prayer for the Messengerof Allah (ﷺ). TheMuslims differed concerning the place where heshould be buried. Somesaid that he should be buried in his mosque.Others said that heshould be buried with his Companions. Then AbuBakr said: ‘I heard theMessenger of Allah (ﷺ) say: “No Prophetever passed away but he wasburied where he died.” So they liftedup the bed of the Messenger ofAllah (ﷺ) on which he had died, anddug the grave for him, then he(ﷺ) was buried in the middle ofTuesday night. ‘Ali bin Abu Talib,Fadl bin ‘Abbas and hisbrother Qutham, and Shuqran the freed slave ofthe Messenger of Allah(ﷺ) went down in his grave. Aws bin Khawli,who was Abu Laila, saidto ‘Ali bin Abi Talib: ‘I adjure you by Allah!Give us our shareof the Messenger of Allah (ﷺ).’ So ‘Ali said tohim: ‘Comedown.’ Shuqran, his freed slave, had taken a Qatifah whichtheMessenger of Allah (ﷺ) used to wear. He buried it in his graveandsaid, ‘By Allah, no one will ever wear it after you.’ So it wasburied with the Messenger of Allah (ﷺ).”",
      "chain": [
        "30395",
        "20298",
        "11272",
        "11107",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1948",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو السقر، يحيى بن يزداد العسكري حدثنا الحسين بن محمد المروذي، حدثني جرير بن حازم، عن أيوب، عن عكرمة، عن ابن عباس، ‏.‏ أن جارية، بكرا أتت النبي  صلى الله عليه وسلم  فذكرت له أن أباها زوجها وهي كارهة ‏.‏ فخيرها النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     a virgin girl came to the Prophet and told him that her father arranged a marriage that she did not like, and the Prophet gave her the choice.",
      "chain": [
        "11272",
        "11015",
        "11023"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا جرير بن حازم، حدثنا أبو فزارة، عن يزيد بن الأصم، حدثتني ميمونة بنت الحارث، ‏.‏ أن رسول الله  صلى الله عليه وسلم  تزوجها وهو حلال ‏.‏ قال وكانت خالتي وخالة ابن عباس ‏.‏",
      "text_en": " Maimunah bint Harith narrated:                     that the Messenger of Allah married her when he was Halal (not in Ihram). (Sahih).He (one of the narrators-Yazid) said: \"And she was my maternal aunt and the maternal aunt of Idn 'Abbas also.\"",
      "chain": [
        "30201",
        "20364",
        "11272",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "2129",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن جرير بن حازم، عن الزبير بن سعيد، عن عبد الله بن علي بن يزيد بن ركانة، عن أبيه، عن جده، أنه طلق امرأته البتة فأتى رسول الله  صلى الله عليه وسلم  فسأله فقال ‏\"‏ ما أردت بها ‏\"‏ ‏.‏ قال واحدة ‏.‏ قال ‏\"‏ آلله ما أردت بها إلا واحدة قال آلله ما أردت بها إلا واحدة ‏.‏ قال فردها عليه ‏.‏ قال محمد بن ماجه سمعت أبا الحسن علي بن محمد الطنافسي يقول ما أشرف هذا الحديث ‏.‏ قال ابن ماجه أبو عبيد تركه ناحية وأحمد جبن عنه ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Ali bin Yazid bin Rukanah, from his father, from his grandfather, that:                     he divorced his wife irrevocably, then he came to the Messenger of Allah (ﷺ) and asked him. He said: \"What did you mean by that?\" He said: \"One (divorce).\" He said: \"By Allah did you only mean one (divorce) thereby?\" He said: \"By Allah, I meant one.\" Then he sent her back to him. (Da'if)Muhammad bin Majah said: I heard Abul-Hasan ' Ali bin Muhammad Tanafisi saying: \"How noble is this Hadith.\" Ibn Majah said: 'Abu 'Ubaid left it (i.e., did not accept its narration) and Ahmad was fearful of it (i.e., of narrating it).\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11272",
        "18549"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عبد الرحمن بن شماسة، عن عقبة بن عامر، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ المسلم أخو المسلم ولا يحل لمسلم باع من أخيه بيعا فيه عيب إلا بينه له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"I heard the Messenger of Allah (ﷺ) say: 'The Muslim is the brother of another Muslim, and it is not permissible for a Muslim to sell his brother goods in which there is a defect, without pointing that out to him.\"'",
      "chain": [
        "30160",
        "20298",
        "11272",
        "20379",
        "11411",
        "10867",
        "189"
      ]
    },
    {
      "hadith_no": "2890",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن محمد بن إسحاق، عن داود بن الحصين، عن عبد الرحمن بن أبي عقبة، عن أبي عقبة، - وكان مولى لأهل فارس - قال شهدت مع النبي صلى الله عليه وسلم يوم أحد فضربت رجلا من المشركين فقلت خذها مني وأنا الغلام الفارسي ‏.‏ فبلغت النبي صلى الله عليه وسلم فقال ‏\"‏ ألا قلت خذها مني وأنا الغلام الأنصاري ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu ‘Uqbah, who was the freed slave of somePersianpeople, said:                      “I was present with the Prophet (ﷺ) on the DayofUhud. I struck a man from among the idolaters and said: ‘Take that!And I am a Persian slave!’ News of that reached the Prophet (ﷺ)andhe said: ‘Why did you not say: “Take that! And I am an Ansarislave!?”",
      "chain": [
        "30201",
        "20384",
        "11272",
        "11107",
        "11160"
      ]
    },
    {
      "hadith_no": "2895",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن على بن رباح، عن أبي قتادة الأنصاري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خير الخيل الأدهم الأقرح المحجل الأرثم طلق اليد اليمنى فإن لم يكن أدهم فكميت على هذه الشية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah Al-Ansari that the Messenger ofAllah (ﷺ)said:                      “The best of horses are those that are deep black,with ablaze on the forehead, white marks on the legs and white noseandupper lip, and with no whiteness on the right foreleg. If notdeep-black, then reddish-brown, with these markings.”",
      "chain": [
        "30160",
        "20298",
        "11272",
        "20379",
        "11411",
        "391"
      ]
    },
    {
      "hadith_no": "3204",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا جرير بن حازم، عن عبد الله بن عبيد بن عمير، عن عبد الرحمن بن أبي عمار، عن جابر، قال جعل رسول الله  صلى الله عليه وسلم  في الضبع يصيبه المحرم كبشا وجعله من الصيد ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ)stipulated(the penalty of) a man for a hyena killed by a man inIhram, and heconsidered it as game.”",
      "chain": [
        "38409",
        "20032",
        "11272",
        "10643",
        "34"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن جرير بن حازم، عن نافع، عن سائبة، - مولاة الفاكه بن المغيرة - أنها دخلت على عائشة فرأت في بيتها رمحا موضوعا فقالت يا أم المؤمنين ما تصنعين بهذا قالت نقتل به هذه الأوزاغ فإن نبي الله  صلى الله عليه وسلم  أخبرنا أن إبراهيم لما ألقي في النار لم تكن في الأرض دابة إلا أطفأت النار غير الوزغ فإنها كانت تنفخ عليه فأمر رسول الله  صلى الله عليه وسلم  بقتله ‏.‏",
      "text_en": " It wasnarrated from Sa’ibah, the freed slave woman of Fakih binMughirah,that she entered upon ‘Aishah and saw a spear in her house.Shesaid:                      “O Mother of the Believers, what do you do with this?” Shesaid: “We kill these house lizards with it, for the Prophet ofAllah(ﷺ) told us that when Ibrahim was thrown into the fire, therewas nobeast on earth that did not try to put it out, apart from thehouselizard that blew on it. So the Messenger of Allah (ﷺ)commanded thatthey should be killed.”",
      "chain": [
        "30201",
        "20393",
        "11272",
        "11014"
      ]
    },
    {
      "hadith_no": "3612",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن أبي الخصيب، حدثنا وكيع، عن جرير بن حازم، عن قتادة، عن أنس، أن النبي  صلى الله عليه وسلم  احتجم في الأخدعين وعلى الكاهل ‏.‏",
      "text_en": " It wasnarrated from Anas that the Prophet (ﷺ) was cupped in thetwo veinsat theside of the neck and the base of the neck.",
      "chain": [
        "20032",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "يزيد بن هارون، أنبأنا جرير بن حازم، عن قتادة، عن أنس، قال كان شعر رسول الله  صلى الله عليه وسلم  شعرا رجلا بين أذنيه ومنكبيه.",
      "text_en": " It wasnarrated that Anas said:                      “The hair of the Messenger of Allah(ﷺ)was wavy, and (hung down) between his ears and his shoulders.”",
      "chain": [
        "20472",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3702",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن جرير بن حازم، عن حنظلة بن عبد الرحمن السدوسي، عن أنس بن مالك، قال قلنا يا رسول الله أينحني بعضنا لبعض قال ‏\"‏ لا ‏\"‏ ‏.‏ قلنا أيعانق بعضنا بعضا قال ‏\"‏ لا ولكن تصافحوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"O Messenger of Allah! Should we bow to one another?\" He said: \"No.\" We said: \"Should we embrace one another?\" He said: \"No, but shake hands with one another.\"",
      "chain": [
        "38409",
        "20032",
        "11272",
        "19"
      ]
    },
    {
      "hadith_no": "3788",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، عن جرير بن حازم، عن قتادة، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ‏{قل هو الله أحد}‏ تعدل ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah(ﷺ) said: Qul Huwa Allahu ahad [Say: He is Allah, (the) One] is equivalent to one third of the Quran.\"",
      "chain": [
        "30115",
        "20472",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4237",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، حدثنا جرير بن حازم، حدثنا الحسن، عن عمرو بن تغلب، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ إن من أشراط الساعة أن تقاتلوا قوما عراض الوجوه كأن وجوههم المجان المطرقة وإن من أشراط الساعة أن تقاتلوا قوما ينتعلون الشعر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Amr bin Taghlib said:                      “I heard the Prophet(ﷺ) say: ‘One of the portents of the Hour is that you fightpeoplewith broad faces, as if their faces are hammered shields. Andone ofhte portents of the Hour is that you will fight people whowear shoesof hair.’”",
      "chain": [
        "30201",
        "20380",
        "11272",
        "11016",
        "5200"
      ]
    }
  ],
  "total_hadiths": 168
}