{
  "id": "11273",
  "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
  "full_name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": [
        "70 AH"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "165",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Sa'di",
      "al-'Atardi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11265",
      "name": "Abu al-Juza' - Aws bin 'Abdullah أبو الجوزاء - أوس بن عبد الله الربعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20656",
      "name": "Shayban bin Farroukh شيبان بن فروخ / أبي شيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4908",
      "hadith_no": "4908",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسلم، حدثنا أبو الأشهب، حدثنا أبو الجوزاء، عن ابن عباس، رضى الله عنهما في قوله ‏{‏اللات والعزى‏}‏ كان اللات رجلا يلت سويق الحاج‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding His Statement about the Lat and the `Uzza: Lat was originally a man who used to mix Sawiq for the pilgrim.",
      "usc_msa_ref": "382",
      "chain": [
        "20285",
        "11273",
        "11265",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7238",
      "hadith_no": "7238",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو نعيم، حدثنا أبو الأشهب، عن الحسن، أن عبيد الله بن زياد، عاد معقل بن يسار في مرضه الذي مات فيه فقال له معقل إني محدثك حديثا سمعته من رسول الله صلى الله عليه وسلم سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ما من عبد استرعاه الله رعية، فلم يحطها بنصيحة، إلا لم يجد رائحة الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Ma'qil:                     I heard the Prophet saying, \"Any man whom Allah has given the authority of ruling some people and he does not look after them in an honest manner, will never feel even the smell of Paradise.\"",
      "usc_msa_ref": "264",
      "chain": [
        "20348",
        "11273",
        "11016"
      ]
    },
    {
      "id": "sahih-muslim-380",
      "hadith_no": "380",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن الحسن، قال عاد عبيد الله بن زياد معقل بن يسار المزني في مرضه الذي مات فيه ‏.‏ قال معقل إني محدثك حديثا سمعته من رسول الله صلى الله عليه وسلم لو علمت أن لي حياة ما حدثتك إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسترعيه الله رعية يموت يوم يموت وهو غاش لرعيته إلا حرم الله عليه الجنة ‏\"‏ ‏.‏",
      "text_en": " Hasan reported:                      'Ubaidullah b. Ziyad paid a visit to Ma'qil b. Yasar Muzani in his illness of which he (later on) died. (At this juncture) Ma'qil said: I am going to narrate to you a hadith which I have heard from the Messenger of Allah (may peace be upon him) and which I would not have transmitted if I knew that I would survive. Verily I have heard the Messenger of Allah (may peace be upon him) say: There is none amongst the bondsmen who was entrusted with the affairs of his subjects and he died in such a state that he was dishonest in his dealings with those over whom he ruled that the Paradise is not forbidden for him.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "11016"
      ]
    },
    {
      "id": "sahih-muslim-438-2",
      "hadith_no": "438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة العبدي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم رأى في أصحابه تأخرا فقال لهم ‏\"‏ تقدموا فائتموا بي وليأتم بكم من بعدكم لا يزال قوم يتأخرون حتى يؤخرهم الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) saw (a tendency ) among his Companions to go to the back, so he said to them: Come forward and follow my lead, and let those who come after you follow your lead. People will continue to keep back till Allah will put them at the back.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2354",
      "hadith_no": "2354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا أبو الأشهب، حدثنا خليد العصري، عن الأحنف، بن قيس قال كنت في نفر من قريش فمر أبو ذر وهو يقول بشر الكانزين بكى في ظهورهم يخرج من جنوبهم وبكى من قبل أقفائهم يخرج من جباههم ‏.‏ - قال - ثم تنحى فقعد ‏.‏ - قال - قلت من هذا قالوا هذا أبو ذر ‏.‏ قال فقمت إليه فقلت ما شىء سمعتك تقول قبيل قال ما قلت إلا شيئا قد سمعته من نبيهم صلى الله عليه وسلم ‏.‏ قال قلت ما تقول في هذا العطاء قال خذه فإن فيه اليوم معونة فإذا كان ثمنا لدينك فدعه‏.‏",
      "text_en": " Ahnaf b. Qais reported:                      While I was in the company of the (elites) of Quraiah, Abu Dharr came there and he was saying: Give glad tidings to the hoarders of riches that their backs would be branded (so deeply) that (the hot Iron) would come out of their sides, and when the backs of their necks would be branded, it would come out of their foreheads. He (Abu Dharr) then went away and sat down. I asked who he was. They said: He is Abu Dharr. I went to him and said to him: What is this that I heard from you which you were saying before? He said: I said nothing but only that which I heard from their Prophet (may peace be upon him). I again said: What do you say about this gift? He said: Take it, for today it is a help. But when it becomes a price for your religion, then abandon it.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "11112"
      ]
    },
    {
      "id": "sahih-muslim-4614",
      "hadith_no": "4614",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما نحن في سفر مع النبي صلى الله عليه وسلم إذ جاء رجل على راحلة له قال فجعل يصرف بصره يمينا وشمالا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه فضل ظهر فليعد به على من لا ظهر له ومن كان له فضل من زاد فليعد به على من لا زاد له ‏\"‏ ‏.‏ قال فذكر من أصناف المال ما ذكر حتى رأينا أنه لا حق لأحد منا في فضل ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      While we were with the Apostle of Allah (may peace be upon him) on a journey, a person came upon his mount and began to stare on the right and on the left, (it was at this moment) that Allah's Messenger (may peace be upon him) said: He who has an extra mount should give that to one who has no mount for him, and he who has surplus of provisions should give them to him who has no provisions, and he made mention of so many kinds of wealth until we were of the opinion that none of us has any right over the surplus.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4834",
      "hadith_no": "4834",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا أبو الأشهب، عن الحسن، قال عاد عبيد الله بن زياد معقل بن يسار المزني في مرضه الذي مات فيه فقال معقل إني محدثك حديثا سمعته من رسول الله صلى الله عليه وسلم لو علمت أن لي حياة ما حدثتك إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يسترعيه الله رعية يموت يوم يموت وهو غاش لرعيته إلا حرم الله عليه الجنة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hasan who said:                      Ubaidullah b Ziyad visited Ma'qil b. Yasir al-Muzani in his last iliness. Ma'qil said (to him): I am narrating to you a tradition I heard from the Messenger of Allah (may peace be upon him). If I knew that I am to survive this illness. I would, not narrate it to you. I heard the Messenger of Allah (may peace be upon him) say: If God appointed anyone ruler over a people and he died while he was still treacherous to his people, God would forbid his entry into Paradige.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "11016"
      ]
    },
    {
      "id": "sahih-muslim-7116",
      "hadith_no": "7116",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا أبو الأشهب، حدثنا أبو رجاء، عن ابن عباس، أن النبي صلى الله عليه وسلم اطلع في النار ‏.‏ فذكر بمثل حديث أيوب ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) stated like this:                      Re looked into the Fire of Hell. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11273",
        "11440",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-680",
      "hadith_no": "680",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، ومحمد بن عبد الله الخزاعي، قالا حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم رأى في أصحابه تأخرا فقال لهم ‏\"‏ تقدموا فائتموا بي وليأتم بكم من بعدكم ولا يزال قوم يتأخرون حتى يؤخرهم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’Id al-Khudri said; The Messenger of Allah (ﷺ) saw a tendency among his companions to go to the back. He said to them; come forward and follow my lead, and let those who come after you follow your lead people will continue to keep to the back till Allah would put them at the back.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "37563",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-1663",
      "hadith_no": "1663",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الله الخزاعي، وموسى بن إسماعيل، قالا حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما نحن مع رسول الله صلى الله عليه وسلم في سفر إذ جاء رجل على ناقة له فجعل يصرفها يمينا وشمالا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان عنده فضل ظهر فليعد به على من لا ظهر له ومن كان عنده فضل زاد فليعد به على من لا زاد له ‏\"‏ ‏.‏ حتى ظننا أنه لا حق لأحد منا في الفضل ‏.‏",
      "text_en": " Abu Sa’id al-Khudri said While we were traveling along with the Messenger of Allah (ﷺ) a man came to him on his she camel, and began to drive her right and left. The Messenger of Allah (ﷺ) said he who has a spare riding beast should give it to him who has no riding beast; and he who has surplus equipment should give it to who has no equipment. We thought that none of us had a right in surplus property.",
      "usc_msa_ref": "",
      "chain": [
        "37563",
        "20040",
        "11273",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4232",
      "hadith_no": "4232",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن إسماعيل، ومحمد بن عبد الله الخزاعي، - المعنى - قالا حدثنا أبو الأشهب، عن عبد الرحمن بن طرفة، أن جده، عرفجة بن أسعد قطع أنفه يوم الكلاب فاتخذ أنفا من ورق فأنتن عليه فأمره النبي صلى الله عليه وسلم فاتخذ أنفا من ذهب ‏.‏",
      "text_en": " AbdurRahman ibn Tarafah said that his grandfather Arfajah ibn As'ad who had his nose cut off at the battle of al-Kilab got a silver nose, but it developed a stench, so the Prophet (ﷺ) ordered him to get a gold nose.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "11273",
        "18630"
      ]
    },
    {
      "id": "sunan-abi-daud-4233",
      "hadith_no": "4233",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يزيد بن هارون، وأبو عاصم قالا حدثنا أبو الأشهب، عن عبد الرحمن بن طرفة، عن عرفجة بن أسعد، بمعناه ‏.‏ قال يزيد قلت لأبي الأشهب أدرك عبد الرحمن بن طرفة جده عرفجة قال نعم ‏.‏",
      "text_en": " The tradition mentioned above (No. 4220) has also been transmitted by Arfajah ibn As'ad through a different chain to the same effect. Yazid said:                      I asked AbulAshhab: Did AbdurRahman ibn Tarafah meet his grandfather Arfajah? He replied: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20472",
        "20241",
        "11273",
        "18630",
        "20472"
      ]
    }
  ],
  "total_hadiths": 12
}