{
  "id": "11278",
  "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
  "full_name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Audhi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10602",
      "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10672",
      "name": "Badayl bin Maysarah بديل بن ميسرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11247",
      "name": "Sulaiman bin Abi Muslim al-Ahwal سليمان بن أبي مسلم سليمان الأحول",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "292",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان فقال أرأيت إذا جامع الرجل امرأته فلم يمن‏.‏ قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك علي بن أبي طالب والزبير بن العوام وطلحة بن عبيد الله وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏ قال يحيى وأخبرني أبو سلمة أن عروة بن الزبير أخبره أن أبا أيوب أخبره أنه سمع ذلك من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Apostle.\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and a gave the same reply. (Abu Aiyub said that he had heard that from Allah's Apostle ) (This order was canceled later on so one has to take a bath. See, Hadith No. 180).",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن أبي سريج، قال أخبرنا شبابة، قال أخبرنا شعبة، عن حسين المعلم، عن ابن بريدة، عن سمرة بن جندب، أن امرأة، ماتت في بطن، فصلى عليها النبي صلى الله عليه وسلم فقام وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet offered the funeral prayer for the dead body of a woman who died during delivery (i.e. childbirth) and he stood by the middle of her body.",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو معمر  هو عبد الله بن عمرو  قال حدثنا عبد الوارث، عن الحسين، قال حدثنا عبد الله بن بريدة، قال حدثني عبد الله المزني، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم المغرب ‏\"‏‏.‏ قال الأعراب وتقول هي العشاء‏.‏",
      "text_en": " Narrated `Abdullah Al-Muzani:                     The Prophet said, \"Do not be influenced by bedouins regarding the name of your Maghrib prayer which is called `Isha' by them.\"",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا حسين، عن زائدة، عن عبد الملك بن عمير، قال حدثني أبو بردة، عن أبي موسى، قال مرض النبي صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إنه رجل رقيق، إذا قام مقامك لم يستطع أن يصلي بالناس‏.‏ قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ فعادت فقال ‏\"‏ مري أبا بكر فليصل بالناس، فإنكن صواحب يوسف ‏\"‏‏.‏ فأتاه الرسول فصلى بالناس في حياة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     \"The Prophet became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
      "chain": [
        "30311",
        "11278",
        "20320",
        "11368",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "وقال إبراهيم بن طهمان عن الحسين المعلم، عن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يجمع بين صلاة الظهر والعصر إذا كان على ظهر سير، ويجمع بين المغرب والعشاء‏.‏",
      "text_en": "  Narrated Ibn `Abbas:                       Allah's Apostle used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet used to offer the Maghrib and the `Isha' prayers together on journeys.",
      "chain": [
        "20187",
        "11278",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1108",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "وعن حسين، عن يحيى بن أبي كثير، عن حفص بن عبيد الله بن أنس، عن أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يجمع بين صلاة المغرب والعشاء في السفر‏.‏ وتابعه علي بن المبارك وحرب عن يحيى عن حفص عن أنس جمع النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle used to offer these two prayers together on journeys i.e. the Maghrib and the `Isha'.",
      "chain": [
        "11278",
        "11449",
        "11686",
        "19"
      ]
    },
    {
      "hadith_no": "1115",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن منصور، قال أخبرنا روح بن عبادة، أخبرنا حسين، عن عبد الله بن بريدة، عن عمران بن حصين  رضى الله عنه  أنه سأل نبي الله صلى الله عليه وسلم‏.‏ أخبرنا إسحاق قال أخبرنا عبد الصمد قال سمعت أبي قال حدثنا الحسين عن ابن بريدة قال حدثني عمران بن حصين  وكان مبسورا  قال سألت رسول الله صلى الله عليه وسلم عن صلاة الرجل قاعدا فقال ‏\"‏ إن صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     (who had piles) I asked Allah's Apostle about the praying of a man while sitting. He said, \"If he prays while standing it is better and he who prays while sitting gets half the reward of that who prays standing; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
      "chain": [
        "30313",
        "20229",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا حسين المعلم، عن عبد الله بن بريدة، أن عمران بن حصين  وكان رجلا مبسورا  وقال أبو معمر مرة عن عمران، قال سألت النبي صلى الله عليه وسلم عن صلاة الرجل وهو قاعد فقال ‏\"‏ من صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏ قال أبو عبد الله نائما عندي مضطجعا ها هنا‏.‏",
      "text_en": " Narrated `Abdullah bin Buraida:                     `Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked the Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray standing; and whoever prays sitting gets half the reward of that who prays while standing; and whoever prays while Lying gets half the reward of that who prays while sitting.' \"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "123",
        "123"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبدان، عن عبد الله، عن إبراهيم بن طهمان، قال حدثني الحسين المكتب، عن ابن بريدة، عن عمران بن حصين  رضى الله عنه  قال كانت بي بواسير فسألت النبي صلى الله عليه وسلم عن الصلاة فقال ‏\"‏ صل قائما، فإن لم تستطع فقاعدا، فإن لم تستطع فعلى جنب ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     had piles, so I asked the Prophet about the prayer. He said, \"Pray while standing and if you can't, pray while sitting and if you cannot do even that, then pray Lying on your side.\"",
      "chain": [
        "30349",
        "20025",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1183",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، قال حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلوا قبل صلاة المغرب ‏\"‏‏.‏  قال في الثالثة  لمن شاء كراهية أن يتخذها الناس سنة‏.‏",
      "text_en": " Narrated `Abdullah Al-Muzni:                     The Prophet said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third time, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to take it as a tradition.",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن سمرة  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها، فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا حسين، عن ابن بريدة، حدثنا سمرة بن جندب  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، أخبرنا بشر بن المفضل، حدثنا حسين المعلم، عن عطاء، عن جابر  رضى الله عنه  قال لما حضر أحد دعاني أبي من الليل فقال ما أراني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز على منك، غير نفس رسول الله صلى الله عليه وسلم، فإن على دينا فاقض، واستوص بأخواتك خيرا‏.‏ فأصبحنا فكان أول قتيل، ودفن معه آخر في قبر، ثم لم تطب نفسي أن أتركه مع الآخر فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته هنية غير أذنه‏.‏",
      "text_en": " Narrated Jabir:                     When the time of the Battle of Uhud approached, my father called me at night and said, \"I think that I will be the first amongst the companions of the Prophet to be martyred. I do not leave anyone after me dearer to me than you, except Allah's Apostle's soul and I owe some debt and you should repay it and treat your sisters favorably (nicely and politely).\" So in the morning he was the first to be martyred and was buried along with another (martyr). I did not like to leave him with the other (martyr) so I took him out of the grave after six months of his burial and he was in the same condition as he was on the day of burial, except a slight change near his ear.",
      "chain": [
        "30175",
        "20212",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2141",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا الحسين المكتب، عن عطاء بن أبي رباح، عن جابر بن عبد الله  رضى الله عنهما  أن رجلا أعتق غلاما له عن دبر، فاحتاج فأخذه النبي صلى الله عليه وسلم فقال ‏\"‏ من يشتريه مني ‏\"‏ فاشتراه نعيم بن عبد الله بكذا وكذا، فدفعه إليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A man decided that a slave of his would be manumitted after his death and later on he was in need of money, so the Prophet took the slave and said, \"Who will buy this slave from me?\" Nu'aim bin `Abdullah bought him for such and such price and the Prophet gave him the slave.",
      "chain": [
        "30318",
        "20025",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2403",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين المعلم، حدثنا عطاء بن أبي رباح، عن جابر بن عبد الله  رضى الله عنهما  قال أعتق رجل غلاما له عن دبر فقال النبي صلى الله عليه وسلم ‏\"‏ من يشتريه مني ‏\"‏‏.‏ فاشتراه نعيم بن عبد الله، فأخذ ثمنه، فدفعه إليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A man pledged that his slave would be manumitted after his death. The Prophet asked, \"Who will buy the slave from me?\" Nu'aim bin `Abdullah bought the slave and the Prophet took its price and gave it to the owner.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2453",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم، أن أبا سلمة، حدثه أنه، كانت بينه وبين أناس خصومة، فذكر لعائشة  رضى الله عنها  فقالت يا أبا سلمة اجتنب الأرض، فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر من الأرض طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     That there was a dispute between him and some people (about a piece of land). When he told `Aisha about it, she said, \"O Abu Salama! Avoid taking the land unjustly, for the Prophet said, 'Whoever usurps even one span of the land of somebody, his neck will be encircled with it down the seven earths.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، قال حدثني يحيى، قال حدثني أبو سلمة، قال حدثني بسر بن سعيد، قال حدثني زيد بن خالد  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا، ومن خلف غازيا في سبيل الله بخير فقد غزا ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     Allah's Apostle said, \" He who pre pares a Ghazi going in Allah's Cause is given a reward equal to that of) a Ghazi; and he who looks after properly the dependents of a Ghazi going in Allah's Cause is (given a reward equal to that of) Ghazi.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "3548",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، قال حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر، ومن ادعى قوما ليس له فيهم فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet said, \"If somebody claims to be the son of any other than his real father knowingly, he but disbelieves in Allah, and if somebody claims to belong to some folk to whom he does not belong, let such a person take his place in the (Hell) Fire.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن رافع، حدثنا حسين، عن زائدة، عن أبي حصين، عن سعد بن عبيدة، قال جاء رجل إلى ابن عمر، فسأله عن عثمان،، فذكر عن محاسن، عمله، قال لعل ذاك يسوؤك‏.‏ قال نعم‏.‏ قال فأرغم الله بأنفك‏.‏ ثم سأله عن علي، فذكر محاسن عمله قال هو ذاك، بيته أوسط بيوت النبي صلى الله عليه وسلم‏.‏ ثم قال لعل ذاك يسوؤك‏.‏ قال أجل‏.‏ قال فأرغم الله بأنفك، انطلق فاجهد على جهدك‏.‏",
      "text_en": " Narrated Sa`d bin 'Ubaida:                     A man came to Ibn `Umar and asked about `Uthman and Ibn `Umar mentioned his good deeds and said to the questioner. \"Perhaps these facts annoy you?\" The other said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you)!' Then the man asked him about `Ali. Ibn `Umar mentioned his good deeds and said, \"It is all true, and that is his house in the midst of the houses of the Prophet. Perhaps these facts have hurt you?\" The questioner said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you or make you do things which you hate) ! Go away and do whatever you can against me.\"",
      "chain": [
        "30375",
        "11278",
        "20320",
        "11371",
        "11344"
      ]
    },
    {
      "hadith_no": "5742",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني الحسين، حدثنا أحمد بن منيع، حدثنا مروان بن شجاع، حدثنا سالم الأفطس، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال ‏\"‏ الشفاء في ثلاثة شربة عسل، وشرطة محجم، وكية نار، وأنهى أمتي عن الكى ‏\"‏‏.‏ رفع الحديث ورواه القمي عن ليث عن مجاهد عن ابن عباس عن النبي صلى الله عليه وسلم في العسل والحجم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (The Prophet said), \"Healing is in three things: A gulp of honey, cupping, and branding with fire (cauterizing).\" But I forbid my followers to use (cauterization) branding with fire.\"",
      "chain": [
        "11278",
        "30242",
        "20388",
        "11691",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5886",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، عن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر  رضى الله عنه  حدثه قال أتيت النبي صلى الله عليه وسلم وعليه ثوب أبيض وهو نائم، ثم أتيته وقد استيقظ فقال ‏\"‏ ما من عبد قال لا إله إلا الله‏.‏ ثم مات على ذلك، إلا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق على رغم أنف أبي ذر ‏\"‏‏.‏ وكان أبو ذر إذا حدث بهذا قال وإن رغم أنف أبي ذر‏.‏ قال أبو عبد الله هذا عند الموت أو قبله، إذا تاب وندم وقال لا إله إلا الله‏.‏ غفر له‏.‏",
      "text_en": " Narrated Abu Dharr:                     I came to the Prophet while he was wearing white clothes and sleeping. Then I went back to him again after he had got up from his sleep. He said, \"Nobody says: 'None has the right to be worshipped but Allah' and then later on he dies while believing in that, except that he will enter Paradise.' I said, \"Even It he had committed illegal sexual intercourse and theft.\" I said. \"Even if he had committed illegal sexual intercourse and theft? He said. 'Even If he had committed illegal sexual intercourse and theft,\" I said, 'Even it he had committed illegal sexual intercourse and thefts.' He said, \"Even If he had committed Illegal sexual intercourse and theft, inspite of the Abu Dharrs dislikeness. Abu `Abdullah said, \"This is at the time of death or before it if one repents and regrets and says \"None has the right to be worshipped but Allah. He will be forgiven his sins.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "6114",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا يرمي رجل رجلا بالفسوق، ولا يرميه بالكفر، إلا ارتدت عليه، إن لم يكن صاحبه كذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     That he heard the Prophet saying, \"If somebody accuses another of Fusuq (by calling him 'Fasiq' i.e. a wicked person) or accuses him of Kufr, such an accusation will revert to him (i.e. the accuser) if his companion (the accused) is innocent.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "6203",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا روح بن عبادة، حدثنا حسين، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال دخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألم أخبر أنك تقوم الليل وتصوم النهار ‏\"‏‏.‏ قلت بلى‏.‏ قال ‏\"‏ فلا تفعل، قم ونم، وصم وأفطر، فإن لجسدك عليك حقا، وإن لعينك عليك حقا، وإن لزورك عليك حقا، وإن لزوجك عليك حقا، وإنك عسى أن يطول بك عمر، وإن من حسبك أن تصوم من كل شهر ثلاثة أيام، فإن بكل حسنة عشر أمثالها فذلك الدهر كله ‏\"‏‏.‏ قال فشددت فشدد على فقلت فإني أطيق غير ذلك‏.‏ قال ‏\"‏ فصم من كل جمعة ثلاثة أيام ‏\"‏‏.‏ قال فشددت فشدد على قلت أطيق غير ذلك‏.‏ قال ‏\"‏ فصم صوم نبي الله داود ‏\"‏‏.‏ قلت وما صوم نبي الله داود قال ‏\"‏ نصف الدهر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle entered upon me and said, \"Have I not been informed that you offer prayer all the night and fast the whole day?\" I said, \"Yes.\" He said, \"Do not do so; Offer prayer at night and also sleep; Fast for a few days and give up fasting for a few days because your body has a right on you, and your eye has a right on you, and your guest has a right on you, and your wife has a right on you. I hope that you will have a long life, and it is sufficient for you to fast for three days a month as the reward of a good deed, is multiplied ten times, that means, as if you fasted the whole year.\" I insisted (on fasting more) so I was given a hard instruction. I said, \"I can do more than that (fasting)\" The Prophet said, \"Fast three days every week.\" But as I insisted (on fasting more) so I was burdened. I said, \"I can fast more than that.\" The Prophet said, \"Fast as Allah's prophet David used to fast.\" I said, \"How was the fasting of the prophet David?\" The Prophet said, \"One half of a year (i.e. he used to fast on alternate days). '",
      "chain": [
        "30313",
        "20229",
        "11278",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "6379",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، حدثنا عبد الله بن بريدة، عن بشير بن كعب العدوي، قال حدثني شداد بن أوس  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ سيد الاستغفار أن تقول اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك على وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت ‏\"‏‏.‏ قال ‏\"‏ ومن قالها من النهار موقنا بها، فمات من يومه قبل أن يمسي، فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها، فمات قبل أن يصبح، فهو من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Shaddad bin Aus:                     The Prophet said \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta Rabbi la ilaha illa anta, Anta Khalaqtani wa ana `Abduka, wa ana 'ala ahdika wa wa'dika mastata'tu, A`udhu bika min Sharri ma sana'tu, abu'u Laka bini'matika 'alaiya, wa abu'u laka bidhanbi faghfir lee fa innahu la yaghfiru adhdhunuba illa anta.\" The Prophet added. \"If somebody recites it during the day with firm faith in it, and dies on the same day before the evening, he will be from the people of Paradise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will be from the people of Paradise.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "6396",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن بشير بن كعب، عن شداد بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ سيد الاستغفار اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أبوء لك بنعمتك، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت، أعوذ بك من شر ما صنعت‏.‏ إذا قال حين يمسي فمات دخل الجنة  أو كان من أهل الجنة  وإذا قال حين يصبح فمات من يومه ‏\"‏‏.‏ مثله‏.‏",
      "text_en": " Narrated Shaddad bin 'Aus:                     The Prophet said, \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta Rabbi la ilaha illa anta. Khalaqtani wa ana `Abduka, wa ana 'ala 'ahdika wa Wa'dika mastata'tu abu'u Laka bi ni 'matika wa abu'u Laka bidhanbi; faghfirli fa'innahu la yaghfiru-dh-dhunuba ill a ant a. A'uidhu bika min sharri ma sana'tu.' If somebody recites this invocation during the night, and if he should die then, he will go to Paradise (or he will be from the people of Paradise). And if he recites it in the morning, and if he should die on the same day, he will have the same fate.\"",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "6448",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الحسين، عن زائدة، عن عبد الملك، عن مصعب، عن أبيه، قال تعوذوا بكلمات كان النبي صلى الله عليه وسلم يتعوذ بهن ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Seek refuge with Allah by saying the words which the Prophet used to say while seeking refuge with Allah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, and seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from the afflictions of the world and from the punishment in the grave.\"",
      "chain": [
        "30123",
        "11278",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "6878",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا الحسين، عن يحيى، عن محمد بن عبد الرحمن الأنصاري، عن عمرة بنت عبد الرحمن، حدثته أن عائشة  رضى الله عنها  حدثتهم عن النبي صلى الله عليه وسلم قال ‏\"‏ يقطع في ربع دينار ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The hand should be cut off for stealing a quarter of a Dinar.\"",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11449",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "7456",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلوا قبل صلاة المغرب  قال في الثالثة  لمن شاء ‏\"‏‏.‏ كراهية أن يتخذها الناس سنة‏.‏",
      "text_en": " Narrated `Abdullah Al Muzam:                     The Prophet said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and the third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna (tradition). (See Hadith No. 277, Vol. 2)",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "7472",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين المعلم، حدثني عبد الله بن بريدة، عن يحيى بن يعمر، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ أعوذ بعزتك الذي لا إله إلا أنت، الذي لا يموت والجن والإنس يموتون ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to say, \"I seek refuge (with YOU) by Your 'Izzat, None has the right to be worshipped but You Who does not die while the Jinns and the human beings die.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "17"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏\"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It is narrated on the authority of Aswad b. Hilal that he heard Mu'adh say this:                      The Messenger of Allah (may peace be upon him) called, me and I replied to him. He (the Holy Prophet) said: Do you know the right of Allah upon the people? and then followed the hadith (mentioned above).",
      "chain": [
        "11278",
        "20320",
        "11371",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "180",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن حسين المعلم، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لا يؤمن عبد حتى يحب لجاره - أو قال لأخيه - ما يحب لنفسه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Anas that the Prophet (may peace blessings be upon him) observed:                      By Him in whose Hand is my life, no, bondsman (truly) believes till he likes for his neighbour, or he (the Holy Prophet) said: for his brother, whatever he likes for himself.",
      "chain": [
        "30022",
        "20031",
        "11278",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا حسين المعلم، عن ابن بريدة، عن يحيى بن يعمر، أن أبا الأسود، حدثه عن أبي ذر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر ومن ادعى ما ليس له فليس منا وليتبوأ مقعده من النار ومن دعا رجلا بالكفر أو قال عدو الله ‏.‏ وليس كذلك إلا حار عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Dharr that he heard the Messenger of Allah (may peace and blessings be upon him) saying:                      No person who claimed knowingly anyone else as his father besides (his own) committed nothing but infidelity, and he who made a claim of anything, which (in fact) did not belong to him, is not amongst us; he should make his abode in Fire, and he who labeled anyone with unbelief or called him the enemy of Allah, and he was in fact not so, it rebounded on him.",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "283",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وأحمد بن خراش، قالا حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي قال، حدثني حسين المعلم، عن ابن بريدة، أن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر حدثه قال أتيت النبي صلى الله عليه وسلم وهو نائم عليه ثوب أبيض ثم أتيته فإذا هو نائم ثم أتيته وقد استيقظ فجلست إليه فقال ‏\"‏ ما من عبد قال لا إله إلا الله ثم مات على ذلك إلا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ ثلاثا ثم قال في الرابعة ‏\"‏ على رغم أنف أبي ذر ‏\"‏ قال فخرج أبو ذر وهو يقول وإن رغم أنف أبي ذر ‏.‏",
      "text_en": " Abu Dharr reported,:                      I came to the Apostle (may peace be upon him ) and he was asleep with a white mantle over him. I again came, he was still asleep, I came again and he had awakened. I sat by his side and (the Holy Prophet) observed: There is none among the bondsmen who affirmed his faith in La illaha ill-Allah there is no God but Allah) and died in this state and did not enter Paradise. I (Abu Dharr) said: Even if he committed adultery and theft? He (the Holy Prophet) replied: (Yes) even though he committed adultery and theft. I (again said): Even if he committed adultery and theft? He replied: (Yes) even though he committed adultery and theft. (Th Holy Prophet repeated it three times) and said for the fourth time: In defiance of Abu Dharr. Abu Dharr then went out and he repeated (these words): In defiance of Abu Dharr.",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني الأحمر - عن حسين المعلم، ح قال وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا عيسى بن يونس، حدثنا حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستفتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجدة لم يسجد حتى يستوي جالسا وكان يقول في كل ركعتين التحية وكان يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقبة الشيطان وينهى أن يفترش الرجل ذراعيه افتراش السبع وكان يختم الصلاة بالتسليم ‏.‏ وفي رواية ابن نمير عن أبي خالد وكان ينهى عن عقب الشيطان ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to begin prayer with takbir (saying Allih-o-Akbar) and the recitation:\" Praise be to Allah, the Lord of the Universe.\" When he bowed he neither kept his head up nor bent it down, but kept it between these extremes; when he raised his bead after bow- ing he did not prostrate himself till he had stood erect; when he raised his head after prostration he did not prostrate himself again till he satup. At the end of every two rak'ahs he recited the tahiyya; and he used to place his left foot flat (on the ground) and raise up the right; he prohibited the devil's way of sitting on the heels, and he forbade people to spread out their arms like a wild beast. And he used to finish the prayer with the taslim.",
      "chain": [
        "30212",
        "20326",
        "11278",
        "30123",
        "20347",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "2279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا عبد الوارث بن سعيد، عن حسين بن، ذكوان قال حدثني عبد الله بن بريدة، عن سمرة بن جندب، قال صليت خلف النبي صلى الله عليه وسلم وصلى على أم كعب ماتت وهي نفساء فقام رسول الله صلى الله عليه وسلم للصلاة عليها وسطها ‏.‏",
      "text_en": " Samura b. Jundub said:                      I prayed behind the Messenger of Allah (may peace be upon him) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.",
      "chain": [
        "30399",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "2281",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، وعقبة بن مكرم العمي، قالا حدثنا ابن أبي عدي، عن حسين، عن عبد الله بن بريدة، قال قال سمرة بن جندب لقد كنت على عهد رسول الله صلى الله عليه وسلم غلاما فكنت أحفظ عنه فما يمنعني من القول إلا أن ها هنا رجالا هم أسن مني وقد صليت وراء رسول الله صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها رسول الله صلى الله عليه وسلم في الصلاة وسطها ‏.‏ وفي رواية ابن المثنى قال حدثني عبد الله بن بريدة قال فقام عليها للصلاة وسطها ‏.‏",
      "text_en": " Samura b. Jundub said:                      I was a young boy during the time of the Holy Prophet (may peace be upon him) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (may peace be upon him) over a woman who had died in the state of delivery, and the Messenger of Allah (may peace be upon him) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"",
      "chain": [
        "30170",
        "30441",
        "20276",
        "11278",
        "11432"
      ]
    },
    {
      "hadith_no": "2788",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا روح بن عبادة، حدثنا حسين المعلم، عن يحيى، بن أبي كثير بهذا الإسناد وزاد فيه بعد قوله ‏\"‏ من كل شهر ثلاثة أيام ‏\"‏ ‏\"‏ فإن لك بكل حسنة عشر أمثالها فذلك الدهر كله ‏\"‏ ‏.‏ وقال في الحديث قلت وما صوم نبي الله داود قال ‏\"‏ نصف الدهر ‏\"‏ ‏.‏ ولم يذكر في الحديث من قراءة القرآن شيئا ولم يقل ‏\"‏ وإن لزورك عليك حقا ‏\"‏ ‏.‏ ولكن قال ‏\"‏ وإن لولدك عليك حقا ‏\"‏ ‏.‏",
      "text_en": "  This hadith has been narrated by Yahya b. Abu Kathir with the same chain of transmitters and he made this addition after these words:                      During every month, (fasting) for three days, there is for you ten times for every good and that is perpetual fasting (for three days would bring a reward for full thirty days). I said: What is the fast of the Apostle of Allah, David? He said: Half of the age (observing fast on alternate days for the whole life). And in the hadith no mention has been made of the recital of the Qur'an, and he did not say: Your visitor has a right upon you, but (instead) he said: Your son has a right upon you.",
      "chain": [
        "20229",
        "11278"
      ]
    },
    {
      "hadith_no": "4432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني عبد الله بن هاشم، حدثنا يحيى، - يعني ابن سعيد - عن الحسين بن، ذكوان المعلم حدثني عطاء، عن جابر، ح.",
      "text_en": "",
      "chain": [
        "20031",
        "11278",
        "11029"
      ]
    },
    {
      "hadith_no": "5012",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا يزيد، - يعني ابن زريع - حدثنا حسين، المعلم حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن بسر بن سعيد، عن  زيد بن خالد الجهني، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏",
      "text_en": " The above tradition has been narrated on the authority of Khalid al- Juhani who said:                      The Prophet of Allah (may peace be upon him) said: He who equips a warrior in the way of Allah (is like one who dctually fights) aud he who looks after the family of a warrior in the way of Allah in fact participated in the battle.",
      "chain": [
        "30137",
        "20304",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "5014",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه إسحاق بن منصور، أخبرنا عبد الصمد، - يعني ابن عبد الوارث - قال سمعت أبي يحدث، حدثنا الحسين، عن يحيى، حدثني أبو سعيد، مولى المهري حدثني  أبو سعيد الخدري، أن رسول الله بعث بعثا ‏.‏ بمعناه ‏.‏",
      "text_en": " The above tradition has also been narrated through two different chains of transmitters on the authority of Abu Sa'id Khudri and Yahya, respectively.",
      "chain": [
        "20250",
        "20258",
        "11278",
        "11449",
        "10992",
        "38"
      ]
    },
    {
      "hadith_no": "5272",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنيه أبو بكر بن إسحاق، حدثنا روح بن عبادة، حدثنا حسين المعلم، حدثنا  يحيى بن أبي كثير، بهذين الإسنادين غير أنه قال ‏\"‏ الرطب والزهو والتمر والزبيب ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20229",
        "11278"
      ]
    },
    {
      "hadith_no": "6629",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وعبد الله بن عمر بن أبان، كلهم عن حسين، - قال أبو بكر حدثنا حسين بن علي الجعفي، - عن مجمع بن يحيى، عن سعيد بن أبي بردة، عن أبي بردة، عن أبيه، قال صلينا المغرب مع رسول الله صلى الله عليه وسلم ثم قلنا لو جلسنا حتى نصلي معه العشاء - قال - فجلسنا فخرج علينا فقال ‏\"‏ ما زلتم ها هنا ‏\"‏ ‏.‏ قلنا يا رسول الله صلينا معك المغرب ثم قلنا نجلس حتى نصلي معك العشاء قال ‏\"‏ أحسنتم أو أصبتم ‏\"‏ ‏.‏ قال فرفع رأسه إلى السماء وكان كثيرا مما يرفع رأسه إلى السماء فقال ‏\"‏ النجوم أمنة للسماء فإذا ذهبت النجوم أتى السماء ما توعد وأنا أمنة لأصحابي فإذا ذهبت أتى أصحابي ما يوعدون وأصحابي أمنة لأمتي فإذا ذهب أصحابي أتى أمتي ما يوعدون ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      We offered the sunset prayer along with Allah's Apostle (may peace be upon him). We then said: If we sit (along with Allah's Messenger) and observe night prayer with him it would be very good, so we sat down and he came to us and said: You are still sitting here. I said: Allah's Messenger, we observed evening prayer with you, then we said: Let us sit down and observe night prayer along with you, whereupon he said: You have done well or you have done right. He then lifted his head towards the sky and it often happened that as he lifted his head towards the sky, he said: The stars are a source of security for the sky and when the stars disappear there comes to the sky, i. e. (it meets the same fate) as it has been promised (it would plunge into darkness). And I am a source of safety and security to my Companions and when I would go away there would fall to the lot (of my Companions) as they have been promised with and my Companions are a source of security for the Umma and as they would go there would fall to the lot of my Umma as (its people) have been promised.",
      "chain": [
        "30201",
        "30123",
        "11278",
        "20436",
        "20315",
        "10821",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7074",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني حجاج بن الشاعر، حدثنا عبد الله بن عمرو أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، حدثني ابن بريدة، عن يحيى بن يعمر، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ اللهم لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت اللهم إني أعوذ بعزتك لا إله إلا أنت أن تضلني أنت الحى الذي لا يموت والجن والإنس يموتون ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) used to say:                     \" O Allah, it is unto Thee that I surrender myself. I affirm my faith in Thee and repose my trust in Thee and turn to Thee in repentance and with Thy help fought my adversaries. O Allah, I seek refuge in Thee with Thine Power; there is no god but Thou, lest Thou leadest me astray. Thou art ever-living that dieth not, while the Jinn and mankind die.\"",
      "chain": [
        "38834",
        "20258",
        "11278",
        "11432",
        "11316",
        "17"
      ]
    },
    {
      "hadith_no": "7389",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو عمار، حسين بن حريث حدثنا الفضل بن موسى، عن الحسين، عن  مطر، حدثني قتادة، عن مطرف بن عبد الله بن الشخير، عن عياض بن حمار، أخي بني مجاشع قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم خطيبا فقال ‏\"‏ إن الله أمرني ‏\"‏ ‏.‏ وساق الحديث بمثل حديث هشام عن قتادة وزاد فيه ‏\"‏ وإن الله أوحى إلى أن تواضعوا حتى لا يفخر أحد على أحد ولا يبغي أحد على أحد ‏\"‏ ‏.‏ وقال في حديثه ‏\"‏ وهم فيكم تبعا لا يبغون أهلا ولا مالا ‏\"‏ ‏.‏ فقلت فيكون ذلك يا أبا عبد الله قال نعم  والله لقد أدركتهم في الجاهلية وإن الرجل ليرعى على الحى ما به إلا وليدتهم يطؤها  ‏.‏",
      "text_en": " Iyad. b. Himar reported tbat, while Allah's Messenger (may peace be upon him) was delivering an address, he stated that Allah commanded me The rest of the hadith is the same, and there is an addition in it:                     \" Allah revealed to me that we should be humble amongst ourselves and none should show pride upon the others, And it does not behove one to do so, and He also said: There are among you people to follow not caring a bit for their family and property. Qatada said: Abu Abdullah, would this happen? Thereupon he said: Yes. By Allah, I found this in the days of ignorance that a person grazed the goat of a tribe and did not find anyone but their slave-girl (and he did not spare her) but committed adultery with her.",
      "chain": [
        "20452",
        "11278",
        "11019",
        "11305",
        "5217"
      ]
    },
    {
      "hadith_no": "7742",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبد الصمد بن عبد الوارث، حدثني أبي، حدثنا حسين، عن قتادة، عن عبد الله بن معبد الزماني، عن عبد الله بن عتبة، عن عبد الله بن، مسعود ‏{‏ أولئك الذين يدعون يبتغون إلى ربهم الوسيلة‏}‏ قال نزلت في نفر من العرب كانوا يعبدون نفرا من الجن فأسلم الجنيون والإنس الذين كانوا يعبدونهم لا يشعرون فنزلت ‏{‏ أولئك الذين يدعون يبتغون إلى ربهم الوسيلة‏}‏",
      "text_en": " Abdullah b. Mas'ud said in connection with the verse:                     \" Those whom they call upon, themselves seek the means of access to their Lord,\" that that verse was revealed in connection with a party of Arabs who used to worship a group amnogst the jinn; the jinn embraced Islam but the people kept worshipping them without being conscious of it. Then this verse was revealed:\" Those whom they call upon, themselves seek the means of access to their Lord.\"",
      "chain": [
        "38834",
        "20250",
        "20258",
        "11278",
        "11019",
        "10697",
        "4145"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عمرو بن أبي الحجاج أبو معمر، حدثنا عبد الوارث، عن الحسين، عن يحيى بن أبي كثير، عن أبي سلمة، قال أخبرتني زينب بنت أبي سلمة، أن امرأة، كانت تهراق الدم - وكانت تحت عبد الرحمن بن عوف - أن رسول الله صلى الله عليه وسلم أمرها أن تغتسل عند كل صلاة وتصلي وأخبرني أن أم بكر أخبرته أن عائشة قالت إن رسول الله صلى الله عليه وسلم قال في المرأة ترى ما يريبها بعد الطهر ‏\"‏ إنما هي - أو قال إنما هو - عرق أو قال عروق ‏\"‏ ‏.‏ قال أبو داود وفي حديث ابن عقيل الأمران جميعا وقال ‏\"‏ إن قويت فاغتسلي لكل صلاة وإلا فاجمعي ‏\"‏ ‏.‏ كما قال القاسم في حديثه وقد روي هذا القول عن سعيد بن جبير عن علي وابن عباس رضى الله عنهما ‏.‏",
      "text_en": " Narrated Zaynab daughter of AbuSalamah:                     AbuSalamah said: Zaynab daughter of AbuSalamah reported to me that a woman had a copious flow of blood. She was the wife of AbdurRahman ibn Awf. The Messenger of Allah (ﷺ) commanded her to take a bath at the time of every prayer, and then to pray. He reported to me that Umm Bakr told him that Aisha said: The Messenger of Allah (ﷺ) said about a woman who was doubtful of her menstruation after purification that it was a vein or veins.Abu Dawud said: The two commands (of which the Prophet gave option) were as follows in the version reported by Ibn 'Aqil: He said: If you are strong enough, then take a bath for every prayer; otherwise combine the (two prayers), as al-Qasim reported in his version. This statement was also narrated by Sa'id b. Jubair from 'Ali and Ibn 'Abbas.",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11449",
        "10567",
        "244"
      ]
    },
    {
      "hadith_no": "579",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كامل، حدثنا يزيد بن زريع، حدثنا حسين، عن عمرو بن شعيب، عن سليمان بن يسار، - يعني مولى ميمونة - قال أتيت ابن عمر على البلاط وهم يصلون فقلت ألا تصلي معهم قال قد صليت إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تصلوا صلاة في يوم مرتين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Sulayman, the freed slave of Maymunah, said: I came to Ibn Umar at Bilat (a place in Medina) while the people were praying. I said: Do you not pray along with them? He said: I heard the Messenger of Allah (ﷺ) say: Do not say a prayer twice in a day.",
      "chain": [
        "30559",
        "20304",
        "11278",
        "19934",
        "11005"
      ]
    },
    {
      "hadith_no": "653",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا علي بن المبارك، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم يصلي حافيا ومنتعلا ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I saw the Messenger of Allah (ﷺ) praying both  barefooted and wearing sandals.",
      "chain": [
        "20285",
        "20449",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث بن سعيد، عن حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يفتتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين ‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجود لم يسجد حتى يستوي قاعدا وكان يقول في كل ركعتين ‏\"‏ التحيات ‏\"‏ ‏.‏ وكان إذا جلس يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقب الشيطان وعن فرشة السبع وكان يختم الصلاة بالتسليم ‏.‏",
      "text_en": " ‘A’ishah said:                      The Messenger of Allah(ﷺ) began prayer with the takbir (Allah is most great) and with reciting “Praise be to Allah, the Lord of the Universe”. And when he bowed, he neither raised up nor lowered down his head, but kept it between the two (conditions). And when he raised his head after bowing, he did not prostrate himself until he stood up straight; and when he raised his head after prostration, he did not prostrate (the second time) until he sat down properly; and he recited al-tahiyyat after every pair of rak’ahs; and when he sat, he spread out his left foot and raised his right. He forbade to sit like the sitting of the devil, and to spread out to hands (on the ground in prostration) like animals. He used to finish prayer with uttering the salutation.",
      "chain": [
        "30175",
        "20258",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "951",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، أنه سأل النبي صلى الله عليه وسلم عن صلاة الرجل قاعدا فقال ‏\"‏ صلاته قائما أفضل من صلاته قاعدا وصلاته قاعدا على النصف من صلاته قائما وصلاته نائما على النصف من صلاته قاعدا ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. Buraidah said :                      ‘Imran b. Hussain asked the prophet (ﷺ) about the prayer a man offers in sitting condition. He replied: his prayer in standing condition is better than his prayer in sitting condition, and his prayer in sitting condition is half the prayer he offers in standing condition, and his prayer in lying condition is half the prayer he offers in sitting condition.",
      "chain": [
        "30175",
        "20031",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "952",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن إبراهيم بن طهمان، عن حسين المعلم، عن ابن بريدة، عن عمران بن حصين، قال كان بي الناصور فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ صل قائما فإن لم تستطع فقاعدا فإن لم تستطع فعلى جنب ‏\"‏ ‏.‏",
      "text_en": " ‘Imran b. Husain said :                      I had a fistula; so I asked the prophet (ﷺ). He said: offer prayer in standing condition; if you are unable to do so, then in sitting condition: if you are then at your side(i.e, in lying condition).",
      "chain": [
        "31160",
        "20032",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عمرو أبو معمر، حدثنا عبد الوارث، حدثنا الحسين المعلم، عن عبد الله بن بريدة، عن حنظلة بن علي، أن محجن بن الأدرع، حدثه قال دخل رسول الله صلى الله عليه وسلم المسجد فإذا هو برجل قد قضى صلاته وهو يتشهد وهو يقول اللهم إني أسألك يا الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم ‏.‏ قال فقال ‏\"‏ قد غفر له قد غفر له ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " Narrated Mihjan ibn al-Adra':                     The Messenger of Allah (ﷺ) entered the mosque and saw a man who had finished his prayer, and was reciting the tashahhud saying: O Allah, I ask you, O Allah, the One, the eternally besought of all, He begetteth not, nor was He begotten, and there is none comparable unto Him, that you may forgive me my sins, you are Most Forgiving, Merciful. He (the Prophet) said: He was forgiven (repeating three times.)",
      "chain": [
        "20258",
        "11278",
        "11432",
        "5275"
      ]
    },
    {
      "hadith_no": "1281",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا عبد الوارث بن سعيد، عن الحسين المعلم، عن عبد الله بن بريدة، عن عبد الله المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلوا قبل المغرب ركعتين ‏\"‏ ‏.‏ ثم قال ‏\"‏ صلوا قبل المغرب ركعتين لمن شاء ‏\"‏ ‏.‏ خشية أن يتخذها الناس سنة ‏.‏",
      "text_en": " Narrated 'Abd Allah al-Muzani:                     The Messenger of Allah (ﷺ) said: Pray two rak'ahs before the Maghrib prayer. He then said (again): Pray two rak'ahs before the Maghrib prayer, it applies to those who wish to do so. That was because he feared that the people might treat it as sunnah.",
      "chain": [
        "11201",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كامل، وحميد بن مسعدة، - المعنى - أن خالد بن الحارث، حدثهم حدثنا حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، أتت رسول الله صلى الله عليه وسلم ومعها ابنة لها وفي يد ابنتها مسكتان غليظتان من ذهب فقال لها ‏\"‏ أتعطين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى النبي صلى الله عليه وسلم وقالت هما لله عز وجل ولرسوله ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority said that his grandfather reported:                     A woman came to the Messenger of Allah (ﷺ) and she was accompanied by her daughter who wore two heavy gold bangles in her hands. He said to her: Do you pay zakat on them? She said: No. He then said: Are you pleased that Allah may put two bangles of fire on your hands? Thereupon she took them off and placed them before the Prophet (ﷺ) saying: They are for Allah and His Apostle.",
      "chain": [
        "30559",
        "30430",
        "20226",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2274",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يزيد بن هارون، أخبرنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال قام رجل فقال يا رسول الله إن فلانا ابني عاهرت بأمه في الجاهلية فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا دعوة في الإسلام ذهب أمر الجاهلية الولد للفراش وللعاهر الحجر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather reported:                      A man got up and said: Messenger of Allah, so-and-so is my son; I had illicit intercourse with his mother in the pre-Islamic period. The Messenger of Allah (ﷺ) said: There is no unlawful claiming of paternity in Islam. What was done in pre-Islamic times has been annulled. The child is attributed to the one on whose bed it is born, and the fornicator is deprived of any right.",
      "chain": [
        "30022",
        "20472",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي، حدثنا حسين، عن زائدة، عن سماك، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا الشهر بصيام يوم ولا يومين إلا أن يكون شىء يصومه أحدكم ولا تصوموا حتى تروه ثم صوموا حتى تروه فإن حال دونه غمامة فأتموا العدة ثلاثين ثم أفطروا و الشهر تسع وعشرون ‏\"‏ ‏.‏ قال أبو داود رواه حاتم بن أبي صغيرة وشعبة والحسن بن صالح عن سماك بمعناه لم يقولوا ‏\"‏ ثم أفطروا ‏\"‏ ‏.‏ قال أبو داود وهو حاتم بن مسلم بن أبي صغيرة وأبو صغيرة زوج أمه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Do not fast one day or two days just before Ramadan except in the case of a man who has been in the habit or observing a fast (on that day); and do not fast until you sight it (the moon). Then fast until you sight it. If a cloud appears on that day (i.e. 29th of Ramadan) then complete the number thirty (days) and then end the fasting: a month consists of twenty-nine days.",
      "chain": [
        "30115",
        "11278",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2381",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو، حدثنا عبد الوارث، حدثنا الحسين، عن يحيى، حدثني عبد الرحمن بن عمرو الأوزاعي، عن يعيش بن الوليد بن هشام، أن أباه، حدثه حدثني معدان بن طلحة، أن أبا الدرداء، حدثه أن رسول الله صلى الله عليه وسلم قاء فأفطر فلقيت ثوبان مولى رسول الله صلى الله عليه وسلم في مسجد دمشق فقلت إن أبا الدرداء حدثني أن رسول الله صلى الله عليه وسلم قاء فأفطر ‏.‏ قال صدق وأنا صببت له وضوءه صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ma'dan b. Talhah:                     That Abu ad-Darda' narrated to him: The Messenger of Allah (ﷺ) vomited and broke his fast. Then I met Thawban, the client of the Messenger of Allah (ﷺ), in the mosque in Damascus, I said (to him): Abu al-Darda has told me that the Messenger of Allah (ﷺ) vomited and broke his fast. He said: He spoke the truth ; and I poured out water for his ablution (ﷺ).",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11449",
        "20024"
      ]
    },
    {
      "hadith_no": "2509",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن عمرو بن أبي الحجاج أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، حدثني يحيى، حدثني أبو سلمة، حدثني بسر بن سعيد، حدثني زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من جهز غازيا في سبيل الله فقد غزا، ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid al Juhani reported that Apostle of Allaah(ﷺ) as saying “He who equips a fighter in Allaah’s path has taken part in the fighting. And he looks after a fighter’s family when he is away has taken part in the fighting.”",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "2872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا حميد بن مسعدة، أن خالد بن الحارث، حدثهم حدثنا حسين، - يعني المعلم - عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني فقير ليس لي شىء ولي يتيم ‏.‏ قال فقال ‏\"‏ كل من مال يتيمك غير مسرف ولا مبادر ولا متأثل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather told that a man came to the Prophet (ﷺ) and said: I am poor, I have nothing (with me), and I have an orphan. He said: Use the property of your orphan without spending it lavishly, hurrying and taking it as your own property.",
      "chain": [
        "30430",
        "20226",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2917",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن عمرو بن أبي الحجاج أبو معمر، حدثنا عبد الوارث، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رئاب بن حذيفة، تزوج امرأة فولدت له ثلاثة غلمة فماتت أمهم فورثوها رباعها وولاء مواليها وكان عمرو بن العاص عصبة بنيها فأخرجهم إلى الشام فماتوا فقدم عمرو بن العاص ومات مولى لها وترك مالا له فخاصمه إخوتها إلى عمر بن الخطاب فقال عمر قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحرز الولد أو الوالد فهو لعصبته من كان ‏\"‏ ‏.‏ قال فكتب له كتابا فيه شهادة عبد الرحمن بن عوف وزيد بن ثابت ورجل آخر فلما استخلف عبد الملك اختصموا إلى هشام بن إسماعيل أو إلى إسماعيل بن هشام فرفعهم إلى عبد الملك فقال هذا من القضاء الذي ما كنت أراه ‏.‏ قال فقضى لنا بكتاب عمر بن الخطاب فنحن فيه إلى الساعة ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported: Rabab ibn Hudhayfah married a woman and three sons were born to him from her. Their mother then died. They inherited her houses and had the right of inheritance of her freed slaves. Amr ibn al-'As was the agnate of her sons. He sent them to Syria where they died. Amr ibn al-'As then came. A freed slave of hers died and left some property. Her brothers disputed with him and brought the case to Umar ibn al-Khattab.  Umar reported the Messenger of Allah (ﷺ) as saying: Whatever property a son or a father receives as an heir will go to his agnates, whoever they may be. He then wrote a document for him, witnessed by AbdurRahman ibn Awf, Zayd ibn Thabit and one other person. When AbdulMalik became caliph, they presented the case to Hisham ibn Isma'il or Isma'il ibn Hisham (the narrator is doubtful).  He sent them to 'Abd al-Malik who said: This is the decision which I have already seen.  The narrator said: So he ('Abd al-Malik) made the decision on the basis of the document of Umar ibn al-Khattab, and that is still with us till this moment.",
      "chain": [
        "30350",
        "20258",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2943",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا أبو عاصم، عن عبد الوارث بن سعيد، عن حسين المعلم، عن عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من استعملناه على عمل فرزقناه رزقا فما أخذ بعد ذلك فهو غلول ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: When we appoint someone to an administrative post and provide him with an allowance, anything he takes beyond that is unfaithful dealing.",
      "chain": [
        "30136",
        "20241",
        "20258",
        "11278",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين المعلم، حدثنا عبد الله بن بريدة، عن سمرة بن جندب، قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها للصلاة وسطها ‏.‏",
      "text_en": " Narrated Samurah bin Jundab:                     I prayed behing the Prophet (ﷺ) over a woman who died in childbirth, and he stood opposite her waist.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "3539",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، - يعني ابن زريع - حدثنا حسين المعلم، عن عمرو بن شعيب، عن طاوس، عن ابن عمر، وابن، عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل أن يعطي عطية أو يهب هبة فيرجع فيها إلا الوالد فيما يعطي ولده ومثل الذي يعطي العطية ثم يرجع فيها كمثل الكلب يأكل فإذا شبع قاء ثم عاد في قيئه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah Ibn Umar ;  Abdullah Ibn Abbas:                     The Prophet (ﷺ) said: It is not lawful for a man to make a donation or give a gift and then take it back, except a father regarding what he gives his child. One who gives a gift and then takes it back is like a dog which eats and vomits when it is full, then returns to its vomit.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "19934",
        "11053",
        "18",
        "17"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كامل، حدثنا خالد، - يعني ابن الحارث - حدثنا حسين، عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: It is not permissible for a woman to present a gift (from her husband's property) except with the permission of her husband.",
      "chain": [
        "30559",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4542",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا عبد الرحمن بن عثمان، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال كانت قيمة الدية على عهد رسول الله صلى الله عليه وسلم ثمانمائة دينار أو ثمانية آلاف درهم ودية أهل الكتاب يومئذ النصف من دية المسلمين قال فكان ذلك كذلك حتى استخلف عمر رحمه الله فقام خطيبا فقال ألا إن الإبل قد غلت ‏.‏ قال ففرضها عمر على أهل الذهب ألف دينار وعلى أهل الورق اثنى عشر ألفا وعلى أهل البقر مائتى بقرة وعلى أهل الشاء ألفى شاة وعلى أهل الحلل مائتى حلة ‏.‏ قال وترك دية أهل الذمة لم يرفعها فيما رفع من الدية ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported that the  value of the blood-money at the time of the Messenger of Allah (ﷺ) was eight hundred dinars or eight thousand dirhams, and the blood-money for the people of the Book was half of that for Muslims.  He said: This applied till Umar (Allah be pleased with him) became caliph and he made a speech in which he said: Take note! Camels have become dear. So Umar fixed the value for those who possessed gold at one thousand dinars, for those who possessed silver at twelve thousand (dirhams), for those who possessed cattle at two hundred cows, for those who possessed sheep at two thousand sheep, and for those who possessed suits of clothing at two hundred suits. He left the blood-money for dhimmis (protected people) as it was, not raising it in proportion to the increase he made in the blood-wit.",
      "chain": [
        "34280",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عمر بن محمد بن أبان، حدثنا أبو تميلة، عن حسين المعلم، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال جعل رسول الله صلى الله عليه وسلم أصابع اليدين والرجلين سواء ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) treated the fingers and toes as equal.",
      "chain": [
        "20183",
        "11278",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته وهو مسند ظهره إلى الكعبة ‏\"‏ في الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: The Prophet (ﷺ) said in his address while he was leaning against the Ka'bah: (The blood-wit) for each finger is ten camels.",
      "chain": [
        "20294",
        "20297",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4563",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا زهير بن حرب أبو خيثمة، حدثنا يزيد بن هارون، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ في الأسنان خمس خمس ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: The Prophet (ﷺ) said: For each tooth are ten camels.",
      "chain": [
        "30022",
        "20472",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين أن خالد بن الحارث، حدثهم قال أخبرنا حسين، - يعني المعلم - عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Blood-wit for every wound which lays bare a bone is five camels.",
      "chain": [
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "5058",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن مسلم، حدثنا عبد الصمد، قال حدثني أبي، حدثنا حسين، عن ابن بريدة، عن ابن عمر، أنه حدثه أن رسول الله صلى الله عليه وسلم كان يقول إذا أخذ مضجعه ‏\"‏ الحمد لله الذي كفاني وآواني وأطعمني وسقاني والذي من على فأفضل والذي أعطاني فأجزل الحمد لله على كل حال اللهم رب كل شىء ومليكه وإله كل شىء أعوذ بك من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     When the Messenger of Allah (ﷺ) went to his bed, he would say: Praise be to Allah Who has given me sufficiency, has guarded me, given me food and drink, been most gracious to me, and given to me most lavishly. Praise be to Allah in every circumstance. O Allah! Lord and King of everything, God of everything, I seek refuge in Thee from Hell.",
      "chain": [
        "30261",
        "20250",
        "20258",
        "11278",
        "11432",
        "18"
      ]
    },
    {
      "hadith_no": "87",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - وهو أحمد بن عبد الله الهمداني الكوفي وإسحاق بن منصور قال أبو عبيدة حدثنا وقال، إسحاق أخبرنا عبد الصمد بن عبد الوارث، حدثني أبي، عن حسين المعلم، عن يحيى بن أبي كثير، قال حدثني عبد الرحمن بن عمرو الأوزاعي، عن يعيش بن الوليد المخزومي، عن أبيه، عن معدان بن أبي طلحة، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قاء فأفطر فتوضأ ‏.‏ فلقيت ثوبان في مسجد دمشق فذكرت ذلك له فقال صدق أنا صببت له وضوءه ‏.‏ قال أبو عيسى وقال إسحاق بن منصور معدان بن طلحة ‏.‏ قال أبو عيسى وابن أبي طلحة أصح ‏.‏ قال أبو عيسى وقد رأى غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم من التابعين الوضوء من القىء والرعاف ‏.‏ وهو قول سفيان الثوري وابن المبارك وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم ليس في القىء والرعاف وضوء ‏.‏ وهو قول مالك والشافعي ‏.‏ وقد جود حسين المعلم هذا الحديث ‏.‏ وحديث حسين أصح شيء في هذا الباب ‏.‏ وروى معمر هذا الحديث عن يحيى بن أبي كثير فأخطأ فيه فقال عن يعيش بن الوليد عن خالد بن معدان عن أبي الدرداء ولم يذكر فيه الأوزاعي وقال عن خالد بن معدان وإنما هو معدان بن أبي طلحة ‏.‏",
      "text_en": " Madan bin Abi Talhah narrated from Abu Ad-Darda that :                     \"Allah's Messenger vomited [so he broke fast] so he performed Wudu.\" So I met Thawban in a Masjid in Damascus, and I mentioned that to him. He said: 'He told the truth, I poured the water for his Wudu.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11278",
        "11449",
        "20024",
        "17555",
        "10977"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا عيسى بن يونس، حدثنا حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، قال سألت رسول الله صلى الله عليه وسلم عن صلاة الرجل وهو قاعد فقال ‏\"‏ من صلى قائما فهو أفضل ومن صلى قاعدا فله نصف أجر القائم ومن صلى نائما فله نصف أجر القاعد ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وأنس والسائب وابن عمر ‏.‏ قال أبو عيسى حديث عمران بن حصين حديث حسن صحيح ‏.‏",
      "text_en": " Imran bin Husain narrated:                     \"I asked Allah's Messenger (S) about the Salat for a man who is sitting. He said: 'Whoever performs Salat while standing then that is more virtuous. And whoever performs Salat while sitting, then he gets half the rewards of the one standing, and whoever performs Salat while lying down, then he gets half the rewards of the one sitting.'\"",
      "chain": [
        "20387",
        "20347",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1035",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عبد الله بن المبارك، والفضل بن موسى، عن حسين المعلم، عن عبد الله بن بريدة، عن سمرة بن جندب، أن النبي صلى الله عليه وسلم صلى على امرأة فقام وسطها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة عن حسين المعلم ‏.‏",
      "text_en": " Samurah bin Jundab narrated:                     \"The Prophet prayed over a woman, so he stood at her middle.\"",
      "chain": [
        "20387",
        "20025",
        "20452",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا بذلك محمد بن بشار حدثنا ابن أبي عدي عن حسين المعلم عن عمرو بن شعيب أنه سمع طاوسا يحدث عن ابن عمر وابن عباس يرفعان الحديث إلى النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ قال أبو عيسى حديث ابن عباس رضى الله عنهما حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا من وهب هبة لذي رحم محرم فليس له أن يرجع فيها ومن وهب هبة لغير ذي رحم محرم فله أن يرجع فيها ما لم يثب منها ‏.‏ وهو قول الثوري ‏.‏ وقال الشافعي لا يحل لأحد أن يعطي عطية فيرجع فيها إلا الوالد فيما يعطي ولده ‏.‏ واحتج الشافعي بحديث عبد الله بن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لأحد أن يعطي عطية فيرجع فيها إلا الوالد فيما يعطي ولده ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     That he heard Tawus narrating from Ibn 'Umar and Ibn 'Abbas, and they both narrated this Hadith from the Prophet (ﷺ). (A Hadith similar to no. 1298).[Abu 'Eisa said:] The Hadith of Ibn 'Abbas (ra), is a Hasan Sahih Hadith. This Hadith is acted upon according to soe of the people of knowledge among the Companions of the Prophet (ﷺ). They said whoever gives a gift to a closely related relative, then he is not to take back his gift. And whoever gives a gift to someone other then a close relative, then he may take it back as long as it has not been reciprocated. This is the view of Ath-Thawri. Ash-Shafi'i said: \"It is not lawful for any that has given a gift to take it back except for what the father gave to his son.\" Ash-Shafi'i argued with the Hadith of 'Abdullah bin 'Umar from the Prophet (ﷺ): \"It is not lawful for anyone that has given a gift to take it back, except for a father who give something to his son.\"",
      "chain": [
        "20276",
        "11278",
        "19934",
        "11053"
      ]
    },
    {
      "hadith_no": "1390",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا حميد بن مسعدة، أخبرنا يزيد بن زريع، أخبرنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس خمس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم وهو قول سفيان الثوري والشافعي وأحمد وإسحاق أن في الموضحة خمسا من الإبل ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) said: \"Regarding the Mawadih; five, five.\"",
      "chain": [
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1585",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال في خطبته ‏\"‏ أوفوا بحلف الجاهلية فإنه لا يزيده يعني الإسلام إلا شدة ولا تحدثوا حلفا في الإسلام ‏\"‏ ‏.‏ قال وفي الباب عن عبد الرحمن بن عوف وأم سلمة وجبير بن مطعم وأبي هريرة وابن عباس وقيس بن عاصم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا قتيبة، حدثنا محمد بن جعفر، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم يشرب قائما وقاعدا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather who said: \"I saw the Messenger of Allah (ﷺ) drinking while standing and sitting.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30367",
        "20173",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2132",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن حسين المعلم، عن عمرو بن شعيب، حدثني طاوس، عن ابن عمر، وابن، عباس يرفعان الحديث قال ‏\"‏ لا يحل للرجل أن يعطي عطية ثم يرجع فيها إلا الوالد فيما يعطي ولده ومثل الذي يعطي العطية ثم يرجع فيها كمثل الكلب أكل حتى إذا شبع قاء ثم عاد في قيئه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال الشافعي لا يحل لمن وهب هبة أن يرجع فيها إلا الوالد فله أن يرجع فيما أعطى ولده ‏.‏ واحتج بهذا الحديث ‏.",
      "text_en": " Ibn 'Umar and Ibn 'Abbas narrated the Marfu Hadith:                     \"It is not lawful for a man to give a gift and then take it back, except in the case of the father with what he gave to his son. And the parable of the one who gives a gift, and then takes it back, is that of a dog who eats until he is full, and vomits, then he returns to his vomit.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Ash-Shafi'i said: \"It is not lawful for one who confers something to take it back, except in the case of the father. He may take back what he gave his son\" and he used this Hadith as proof.",
      "chain": [
        "30160",
        "20276",
        "11278",
        "19934",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "3517",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن حسين، عن عكرمة، عن أم عمارة الأنصارية، أنها أتت النبي صلى الله عليه وسلم فقالت ما أرى كل شيء إلا للرجال وما أرى النساء يذكرن بشيء فنزلت هذه الآية ‏:‏ ‏(‏إن المسلمين والمسلمات والمؤمنين والمؤمنات ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن غريب وإنما يعرف هذا الحديث من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm 'Umarah Al-Ansariyyah:                     that she came to the Prophet (ﷺ) and said: \"I do not see bu that everything is for the men, and I do not see anything being mentioned for the women.\" So this Ayah was revealed: 'Indeed the Muslim men and the Muslim women, the believing men and the believing women... (33:35)'",
      "chain": [
        "30553",
        "28531",
        "20235",
        "11278",
        "11023"
      ]
    },
    {
      "hadith_no": "175",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا أبي، عن حسين المعلم، قال حدثني يحيى بن أبي كثير، عن عبد الرحمن بن عمرو الأوزاعي، أنه سمع المطلب بن عبد الله بن حنطب، يقول قال ابن عباس أتوضأ من طعام أجده في كتاب الله حلالا لأن النار مسته فجمع أبو هريرة حصى فقال أشهد عدد هذا الحصى أن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"Should I perform Wudu' after eating food that I see in the Book of Allah is permissible because fire has touched it?\" Abu Hurairah gathered some pebbles and said: \"I bear witness (as many times as) the number of these pebbles, that the Messenger of Allah (ﷺ) said: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "38088",
        "20250",
        "20258",
        "11278",
        "11449",
        "20024",
        "19944"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، قال حدثنا عطاء بن السائب، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثتني عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة وضع له الإناء فيصب على يديه قبل أن يدخلهما الإناء حتى إذا غسل يديه أدخل يده اليمنى في الإناء ثم صب باليمنى وغسل فرجه باليسرى حتى إذا فرغ صب باليمنى على اليسرى فغسلهما ثم تمضمض واستنشق ثلاثا ثم يصب على رأسه ملء كفيه ثلاث مرات ثم يفيض على جسده ‏.‏",
      "text_en": " 'Aishah narrated that when the Messenger of Allah (ﷺ) performed Ghusl from Janabah, the vessel (of water) would be placed before him, and he would pour water over his hands before putting then into the vessel. When he had washed his hands, he would put his right hand in the vessel then pour water with his right hand and wash his private parts with his left hand. When he had finished, he would pour water with his right hand over his left hand and wash them both. Then he would rinse his mouth and nose three times, then he would pour water filling both of his hands over his head three times, then he would pour water over his body.",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11068",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا حميد بن مسعدة، عن عبد الوارث، عن حسين، - يعني المعلم - عن ابن بريدة، عن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم على أم كعب ماتت في نفاسها فقام رسول الله صلى الله عليه وسلم في الصلاة في وسطها ‏.‏",
      "text_en": " It was narrated that Samurah said:                      \"I offered the funeral prayer with the Messenger of Allah (ﷺ) for Umm Ka'b who had died during childbirth, and during the prayer, the Messenger of Allah (ﷺ) stood at her middle.\"",
      "chain": [
        "30430",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "860",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إبراهيم بن محمد التيمي، قال حدثنا يحيى بن سعيد، عن حسين المعلم، عن عمرو بن شعيب، عن سليمان، مولى ميمونة قال رأيت ابن عمر جالسا على البلاط والناس يصلون قلت يا أبا عبد الرحمن ما لك لا تصلي قال إني قد صليت إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تعاد الصلاة في يوم مرتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sulaiman - the freed slave of Maimunah - said:                      \"I saw Ibn 'Umar sitting in Al-Balat when the people werepraying. I said: '0 Abu 'Abdur- Rahman, why are you not praying?' He said: 'I have already prayed, and I heard the Messenger ofAllah (ﷺ) say: \"Do not repeat a prayer twice in one day.\"",
      "chain": [
        "20031",
        "11278",
        "19934"
      ]
    },
    {
      "hadith_no": "1037",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، قال حدثنا حسين، عن زائدة، عن عطاء، عن سالم أبي عبد الله، عن عقبة بن عمرو، قال ألا أصلي لكم كما رأيت رسول الله صلى الله عليه وسلم يصلي فقلنا بلى ‏.‏ فقام فلما ركع وضع راحتيه على ركبتيه وجعل أصابعه من وراء ركبتيه وجافى إبطيه حتى استقر كل شىء منه ثم رفع رأسه فقام حتى استوى كل شىء منه ثم سجد فجافى إبطيه حتى استقر كل شىء منه ثم قعد حتى استقر كل شىء منه ثم سجد حتى استقر كل شىء منه ثم صنع كذلك أربع ركعات ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يصلي وهكذا كان يصلي بنا ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"Shall I not show you how I saw the Messenger of Allah (ﷺ) pray?\" We said: \"Yes.\" So he stood up and when he bowed, he placed his palms on his knees and put his fingers behind his knees, and held his arms out from his sides, until every part of him settled. Then he raised his head and stood up until every part of him settled. Then he prostrated and held his arms out from his sides, until every part of him settled. Then he sat up until every part of him settled. Then he prostrated again until every part of him settled. Then he did four rak'ahs like that. Then he said: \"This is how I saw the Messenger of Allah (ﷺ) pray, and this is how he used to lead us in prayer.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11029"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا، قال حدثنا حسين، عن زائدة، عن سليمان، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وآل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال عبد الرحمن ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من الذي قبله ولا نعلم أحدا قال فيه عمرو بن مرة غير هذا والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     'We said: \"O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?\" He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) 'abdur Rahman said: \"We used to say: 'And also upon us.'\" Abu Abdur-rahman (An Nasa'i) said: This is more worthy of being correct than the one that is before it. And we do not know of anyone who said \"Amr bin Murrah\" in it other than in this case. And Allah (SWT) knows best.",
      "chain": [
        "36617",
        "11278",
        "20320",
        "11060",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1301",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن يزيد أبو بريد البصري، عن عبد الصمد بن عبد الوارث، قال حدثنا أبي قال، حدثنا حسين المعلم، عن ابن بريدة، قال حدثني حنظلة بن علي، أن محجن بن الأدرع، حدثه أن رسول الله صلى الله عليه وسلم دخل المسجد إذا رجل قد قضى صلاته وهو يتشهد فقال اللهم إني أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد غفر له ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " Hanzalah bin 'Ali narrated that:                     Mihjan bin Al-Adra' narrated to him that the Messenger of Allah (ﷺ) entered the masjid and there was a man who had finished his prayer and he was reciting the tashahhud. He said: \"Allahumma inni as'aluka ya Allah! Bi-annakal-Wahidul-Ahad us-Samad, alladhi lam yalid wa lam yowled, wa lam yakun lahu kufuwan ahad, an taghfirali dhunubi, innaka antal-Ghafurur-Rahim (O Allah, I ask of You, O Allah, as You are the One, the Only, the Self-Sufficient Master, Who begets not nor was He begotten, and there is None equal or comparable to Him, forgive me my sins, for You are the Oft-Forgiving, Most Merciful.)\" The Messenger of Allah (ﷺ) said: \"He has been forgiven,\" three times.",
      "chain": [
        "20250",
        "20258",
        "11278",
        "11432",
        "5275"
      ]
    },
    {
      "hadith_no": "1660",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان بن حبيب، عن حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، قال سألت النبي صلى الله عليه وسلم عن الذي يصلي قاعدا قال ‏\"‏ من صلى قائما فهو أفضل ومن صلى قاعدا فله نصف أجر القائم ومن صلى نائما فله نصف أجر القاعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                     \"I asked the Prophet (ﷺ) about one who prays sitting down. He said: 'Whoever prays standing up is better, and one who prays sitting down will have half the reward of one who prays standing up. And whoever prays lying down will have half the reward of one who prays sitting down.'\"",
      "chain": [
        "30430",
        "20711",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده، قال كنت عند النبي صلى الله عليه وسلم فقام فتوضأ واستاك وهو يقرأ هذه الآية حتى فرغ منها ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ ثم صلى ركعتين ثم عاد فنام حتى سمعت نفخه ثم قام فتوضأ واستاك ثم صلى ركعتين ثم نام ثم قام فتوضأ واستاك وصلى ركعتين وأوتر بثلاث ‏.‏",
      "text_en": " Husain narrated from Habib bin Abi Thabit, from Muhammad bin 'Ali bin 'Abdullah bin Abbas, from his father, that his grandfather said:                     \"I was with the Prophet (ﷺ) and he got up and performed wudu, cleaned his teeth while reciting this verse until he finished: 'Verily, in the creation of the heavens and the Earth, and in the alternation of night and day, there are indeed signs for men of understanding.' Then he prayed two rak'ahs, then he went back and slept until I heard him breathing deeply. Then he got up and performed wudu and cleaned his teeth. Then he prayed two rak'ahs, then he slept, then he got up and performed wudu and cleaned his teeth and prayed two rak'ahs and prayed witr with three rak'ahs.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "15097",
        "11331",
        "10961",
        "10949"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن سليمان، عن عمارة بن عمير، عن يحيى بن الجزار، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسعا فلما أسن وثقل صلى سبعا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) used to pray nine (rak'ahs) at night, then when he grew older and put on weight he prayed seven.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11378",
        "10839",
        "53"
      ]
    },
    {
      "hadith_no": "1976",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا حميد بن مسعدة، عن عبد الوارث، قال حدثنا حسين، عن ابن بريدة، عن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم على أم كعب ماتت في نفاسها فقام رسول الله صلى الله عليه وسلم في الصلاة في وسطها ‏.‏",
      "text_en": " It was narrated that Samurah said:                     \"I offered the funeral prayer with the Messenger of Allah for Umm kab who had died in childbirth, and the Messenger of Allah stood in line at her mid-section to pray.\"",
      "chain": [
        "30430",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "2113",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال أبصرت الهلال الليلة ‏.‏ قال ‏\"‏ أتشهد أن لا إله إلا الله وأن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس فليصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A Bedouin come to the Prophet and said; 'I have sighted the crescent tonight.' He said: 'Do you bear witness that there is none worthy of worship except Allah, and that Messenger?' He said: 'Yes.' He said: 'O Bilal, announce to the people that they should fast tomorrow. \"'",
      "chain": [
        "11278",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2160",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن الأعمش، عن عمارة، عن أبي عطية، قال دخلت أنا ومسروق، على عائشة فقال لها مسروق رجلان من أصحاب رسول الله صلى الله عليه وسلم كلاهما لا يألو عن الخير أحدهما يؤخر الصلاة والفطر والآخر يعجل الصلاة والفطر ‏.‏ فقالت عائشة أيهما الذي يعجل الصلاة والفطر قال مسروق عبد الله بن مسعود ‏.‏ فقالت عائشة هكذا كان يصنع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu 'Atiyyah said:                     \"Masruq and I came to 'Aishah, and Masruq said to her: 'There are two men from among the Companions of the Messenger of Allah both of whom are good; one of them delays the prayer and Ifar, and the other hastens the prayer and Iftar.' 'Aishah said: 'Which of them is the one who hastens the prayer and Iftar?' Masruq said: 'That is what the Messenger of Allah  used to do.\"'",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11379"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، قال أخبرني مجاهد، أن رسول الله صلى الله عليه وسلم صام في شهر رمضان وأفطر في السفر ‏.‏",
      "text_en": " Mujahid narrated:                     That the Messenger of Allah fasted during Ramadan and broke his fast when traveling.",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049",
        "11028"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين، عن زائدة، عن عاصم، عن المسيب، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم إذا أخذ مضجعه جعل كفه اليمنى تحت خده الأيمن وكان يصوم الاثنين والخميس ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"When the Messenger of Allah would lie down, he would place his right hand under his right cheek, and he used to fast on Mondays and Thursday.\"",
      "chain": [
        "30475",
        "11278",
        "20320",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "2479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، من أهل اليمن أتت رسول الله صلى الله عليه وسلم وبنت لها في يد ابنتها مسكتان غليظتان من ذهب فقال ‏\"‏ أتؤدين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله عز وجل بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى رسول الله صلى الله عليه وسلم فقالت هما لله ولرسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu 'aib, from his father, from his grandfather, that:                     a woman from among the people of Yemen came to the Messenger of Allah with a daughter of hers, and on the daughter's hand were two thick bangles of gold. He said: \"Do you pay Zakah on these? She said: \"No.\" He said: \"Would it please you if Allah were to put two bangles of fire on you on the Day of Resurrection? \" So she took them of and gave them to the Messenger of Allah and said: \"They are for Allah and His Messenger.\"",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2480",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر بن سليمان، قال سمعت حسينا، قال حدثني عمرو بن شعيب، قال جاءت امرأة ومعها بنت لها إلى رسول الله صلى الله عليه وسلم وفي يد ابنتها مسكتان نحوه مرسل ‏.‏ قال أبو عبد الرحمن خالد أثبت من المعتمر ‏.‏",
      "text_en": " 'Amr bin Shu 'aib said:                     \"A woman came to the Messenger of Allah with a daughter of hers, and on her daughter's arm were two bangles\" - a similar report, in Mursal form.",
      "chain": [
        "30449",
        "20288",
        "11278",
        "19934"
      ]
    },
    {
      "hadith_no": "2516",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، قال حدثنا عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال كان الناس يخرجون عن صدقة الفطر، في عهد النبي صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"At the time of the Messenger of Allah, the people used to give as Sadaqatul Fitr a Sa' of barely or dates or rye or raising.\"",
      "chain": [
        "11278",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن الحسين، عن منصور، عن شقيق، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يأمرنا بالصدقة فما يجد أحدنا شيئا يتصدق به حتى ينطلق إلى السوق فيحمل على ظهره فيجيء بالمد فيعطيه رسول الله صلى الله عليه وسلم إني لأعرف اليوم رجلا له مائة ألف ما كان له يومئذ درهم ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah used to tell us to give in charity, and one of us could not find anything to give until he went to the market place and hired himself out to carry loads for people. Then he would bring a Mudd and give it to the Messenger of Allah. I know a man who has a hundred thousand now, but on that day he had (only) one Dirham.\"",
      "chain": [
        "30325",
        "20452",
        "11278",
        "11067",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2540",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he stood up to address the people and said in his Khutbah; 'It is not permissible for a woman to give anything without her husband's permission.\"' (He narrated it) in abridged from.",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3081",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا حسين، قال حدثنا أبو خيثمة، قال حدثنا خصيف، عن مجاهد، وعطاء، وسعيد بن جبير، عن ابن عباس، أن الفضل، أخبره أنه، كان رديف رسول الله صلى الله عليه وسلم وأنه لم يزل يلبي حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     Al-Fadl to him that he roed behind the Messenger of Allah and he continued to recited the Talbiyah until eh stoned the Jamrat.",
      "chain": [
        "38684",
        "11278",
        "20321",
        "19908",
        "11028",
        "11029",
        "11050",
        "17",
        "20452"
      ]
    },
    {
      "hadith_no": "3237",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني عبد الرحمن بن محمد بن سلام، قال حدثنا عبد الصمد بن عبد الوارث، قال سمعت أبي قال، حدثنا حسين المعلم، قال حدثني عبد الله بن بريدة، قال حدثني عامر بن شراحيل الشعبي، أنه سمع فاطمة بنت قيس، - وكانت من المهاجرات الأول - قالت خطبني عبد الرحمن بن عوف في نفر من أصحاب محمد صلى الله عليه وسلم وخطبني رسول الله صلى الله عليه وسلم على مولاه أسامة بن زيد وقد كنت حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحبني فليحب أسامة ‏\"‏ ‏.‏ فلما كلمني رسول الله صلى الله عليه وسلم قلت أمري بيدك فأنكحني من شئت ‏.‏ فقال ‏\"‏ انطلقي إلى أم شريك ‏\"‏ ‏.‏ وأم شريك امرأة غنية من الأنصار عظيمة النفقة في سبيل الله عز وجل ينزل عليها الضيفان فقلت سأفعل ‏.‏ قال ‏\"‏ لا تفعلي فإن أم شريك كثيرة الضيفان فإني أكره أن يسقط عنك خمارك أو ينكشف الثوب عن ساقيك فيرى القوم منك بعض ما تكرهين ولكن انتقلي إلى ابن عمك عبد الله بن عمرو بن أم مكتوم ‏\"‏ ‏.‏ وهو رجل من بني فهر فانتقلت إليه ‏.‏ مختصر ‏.‏",
      "text_en": " Narrated 'Amir bin Shurahbil Ash-Sha'bi:                     'Amir bin Shurahbil Ash-Sha'bi narrated that he heard Fatimah bint Qais--who was one of the first Muhajir women-- say: 'Abdur-Rahman bin 'Awf proposed marriage to me, along with others of the Companions of Muhammad. And the Messenger of Allah proposed that I marry his freed slave, Usamah bin Zaid. I was told that the Messenger of Allah had said: 'Whoever loves me, let him love Usamah.' When the Messenger of Allah spoke to me I said: 'My affairs are in your hands; marry me to whomever you wish.' He said: 'Go to Umm Sharik.' Umm Sharik was a rich Ansari woman who used to spend a great deal in the cause of Allah, and she always had a lot of guests. I said: 'I will do that.' He said: 'Do not do that, for Umm Sharik has a lot of guests, and I would not like your Khimar to fall off, or your shins to become uncovered, and the people to see something of you that you do not want them to see. Rather go to your cousin (son of your paternal uncle) 'Abdullah bin 'Amr bin Umm Maktum, who is a man of Banu Fihr.' So I went to him.\"",
      "chain": [
        "36587",
        "20250",
        "20258",
        "11278",
        "11432",
        "224"
      ]
    },
    {
      "hadith_no": "3453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها اشترت بريرة من أناس من الأنصار فاشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو وضعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو عليها صدقة وهو لنا هدية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that she bought Barirah from some of the Ansar who stipulated that her Wala' should go to them. The Messenger of Allah said:                      \"Al-Wala' is to the one who did the favor (of setting the slave free).\" The Messenger of Allah gave her the choice, as her husband was a slave. And she gave some meat to 'Aishah as a gift, and the Messenger of Allah said: \"Why don't you give me some of this meat?\" 'Aishah said: \"It was given in charity to Barirah.\" He said: \"It is a charity for her, and a gift for us.\"",
      "chain": [
        "30475",
        "11278",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3668",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني فقير ليس لي شىء ولي يتيم‏.‏ قال ‏\"‏ كل من مال يتيمك غير مسرف ولا مباذر ولا متأثل ‏\"‏‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that a man came to the Prophet and said:                      \"I am poor and I do not have anything, and I have an orphan (under my care).\" He said: \"Eat from the property of your orphan without being extravagant, wasteful or keeping it as capital for yourself.\"",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن حسين، عن عمرو بن شعيب، قال حدثني طاوس، عن ابن عمر، وابن، عباس يرفعان الحديث إلى النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل يعطي عطية ثم يرجع فيها إلا الوالد فيما يعطي ولده ومثل الذي يعطي عطية ثم يرجع فيها كمثل الكلب أكل حتى إذا شبع قاء ثم عاد في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar and Ibn 'Abbas, who attributed the Hadith to the Prophet:                      \"It is not permissible for a man to give a gift and then take it back except a father taking back what he gave to his son. The likeness of the one who gives a gift then takes it back is that of the dog which eats until it is full, then it vomits, and goes back to its vomit.\"",
      "chain": [
        "30170",
        "20276",
        "11278",
        "19934",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "3757",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، ح وأخبرنا حميد بن مسعدة، قال حدثنا يزيد بن زريع، قال حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"When the Messenger of Allah conquered Makkah, he stood up to address (the people) and said in his Khutbah: 'It is not permissible for a woman to give (a gift) except with her husband's permission.'\"",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911",
        "29",
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4018",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن عمرو بن غالب، قال قالت عائشة يا عمار أما إنك تعلم أنه لا يحل دم امرئ إلا ثلاثة النفس بالنفس أو رجل زنى بعد ما أحصن وساق الحديث ‏.‏",
      "text_en": " It was narrated that 'Amr bin Ghalib said:                     \"Aishah said: 'O 'Ammar! Do you not know that it is not permissible to shed the blood of a Muslim except in three cases: a life for a life, a man who commits adultery after being married.'\"",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049"
      ]
    },
    {
      "hadith_no": "4629",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن سلف وبيع وشرطين في بيع وربح ما لم يضمن ‏.‏",
      "text_en": " It was narrated from 'Amr bin shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah prohibited lending on the condition of a sale, or to have two conditions in one transaction, or to profit from what you do not posses.",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4703",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عيسى بن يونس، قال حدثنا حسين المعلم، عن عمرو بن شعيب، عن عمرو بن الشريد، عن أبيه، أن رجلا، قال يا رسول الله أرضي ليس لأحد فيها شركة ولا قسمة إلا الجوار ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr Bin Ash-Sharid, from his father, that a man said:                     \"O Messenger of Allah, not one else has any share in my land, but there are neighbors.\" He said: \"The neighbor has more right to property that is near.\"",
      "chain": [
        "30123",
        "20347",
        "11278",
        "19934",
        "10952"
      ]
    },
    {
      "hadith_no": "4841",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن معاوية، قال حدثنا عباد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في الأسنان خمس من الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from'Amr bin Shu'aib, from his father that his grandfather said;the Messenger of Allah said:                      \"For teeth (the Diyah is) five camels.",
      "chain": [
        "20431",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he said in his Khutbah: \"(The Diyah) for fingers is ten each.\"",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4851",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني عبد الله بن الهيثم، قال حدثنا حجاج، قال حدثنا همام، قال حدثنا حسين المعلم، وابن، جريج عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته وهو مسند ظهره إلى الكعبة ‏\"‏ الأصابع سواء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messengerof Allah (ﷺ) said in his khutbah, while he was leaning with his back against the Ka'bah:                      \"The fingers are the same.\"",
      "chain": [
        "34121",
        "20219",
        "20297",
        "11278",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4852",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي المواضح خمس خمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib that his father told him that 'Abdullah bin 'Amr said:                      \"When the Messenger of Allah (ﷺ) conquered Makkah , he said in his Khutbah: 'For any wound that exposes the bone, the diyah is five (camels) each.'\"",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4881",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا عبد الملك، - هو ابن أبي بشير - قال حدثني عكرمة، عن صفوان بن أمية، أنه طاف بالبيت وصلى ثم لف رداء له من برد فوضعه تحت رأسه فنام فأتاه لص فاستله من تحت رأسه فأخذه فأتى به النبي صلى الله عليه وسلم فقال إن هذا سرق ردائي ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أسرقت رداء هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهبا به فاقطعا يده ‏\"‏ ‏.‏ قال صفوان ما كنت أريد أن تقطع يده في ردائي ‏.‏ فقال له ‏\"‏ فلو ما قبل هذا ‏\"‏ ‏.‏ خالفه أشعث بن سوار ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah that:                     he circumambulated theKa'bah and prayed, then he rolled up a Rid' of his and placed it beneath his head, and slept. A thief came and slid it out from beneath his head and took it. He brought him to the Prophet and said: \"This man stole my Rida. The Prophet said to him: Did you steal this man's Rida?\" He said: \"Yes.\" He said: \"Take him away and cut his hand off.\" Safwan said: \"I* did not want to have his hand cut off for my Rida'.\" He said: \"Why (did you not say that) before now?\"",
      "chain": [
        "38684",
        "11278",
        "20321",
        "14253",
        "11023",
        "449"
      ]
    },
    {
      "hadith_no": "4933",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا عبد الوارث، قال حدثنا حسين، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن، ثم ذكر كلمة معناها عن عمرة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقطع اليد إلا في ربع دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'The hand (of the thief) is not to be cut off except for one-quarter of a Dinar.\"'",
      "chain": [
        "30430",
        "20258",
        "11278",
        "11449",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5017",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا موسى بن عبد الرحمن قال حدثنا أبو أسامة عن حسين وهو المعلم عن قتادة عن أنس  أن رسول الله صلى الله عليه وسلم قال والذي نفس محمد بيده لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه من الخير",
      "text_en": " It was narrated from Anas that :                     The Messenger of Allah [SAW] said: \"By the One in Whose hand is the soul of Muhammad, none of you has believed until he loves for his brother what he loves for himself of goodness.\"",
      "chain": [
        "20318",
        "11278",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5482",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن عمرو بن ميمون، قال حدثني أصحاب، محمد صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يتعوذ من الشح والجبن وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"The Companions of Muhammad [SAW] told me that the Messenger of Allah [SAW] used to seek refuge with Allah from stinginess, cowardice, the trials of the heart and the torment of the grave.\"",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "5495",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، عن حميد، عن أنس، قال كان رسول الله صلى الله عليه وسلم يتعوذ بهؤلاء الكلمات كان يقول ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والجبن والبخل وسوء الكبر وفتنة الدجال وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah [SAW] used to seek refuge by saying these words: 'Allahumma inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa suw'il-kibari, wa fitnatid-dajjali wa 'adhabil-qabr (O Allah, I seek refuge with You from laziness, old age, cowardice, miserliness, a bad old age, the tribulation of the Dajjal and the torment of the grave.)'\"",
      "chain": [
        "11278",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5522",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا حسين المعلم، عن عبد الله بن بريدة، عن بشير بن كعب، عن شداد بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن سيد الاستغفار أن يقول العبد اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بذنبي وأبوء لك بنعمتك على فاغفر لي فإنه لا يغفر الذنوب إلا أنت فإن قالها حين يصبح موقنا بها فمات دخل الجنة وإن قالها حين يمسي موقنا بها دخل الجنة ‏\"‏ ‏.‏ خالفه الوليد بن ثعلبة ‏.‏",
      "text_en": " It was narrated from Shaddad bin Aws that :                     The Prophet [SAW] said: \"The best of prayers for forgiveness is for a person to say: 'Allahumma, anta rabbi, la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abuw'u laka bidhanbi, wa abuw'u laka bini'matika 'alayya faghfirli, fa innahu la yaghfirudh-dhunuba illa anta (O Allah, You are my Lord, there is no god but You. You have created me and I am Your slave and I am keeping my promise and covenant to You as much as I can. I seek refuge with You from the evil of what I do. I acknowledge Your blessing and I acknowledge my sin, so forgive me, for there is none who can forgive sin except You.)' If he says this in the morning, believing in it firmly, and dies on that day before evening comes, he will enter Paradise, and if he says it in the evening, believing firmly in it, and dies before morning comes, he will enter Paradise.\" Al-Walid bin Tha'labah contradicted him.",
      "chain": [
        "30153",
        "20304",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "5637",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا قريش بن عبد الرحمن، قال أنبأنا علي بن الحسن، قال أنبأنا الحسين، قال حدثني محمد بن زياد، قال سمعت أبا هريرة، يقول إن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), Al-Hantam, An-Naqir, and Al-Muzaffat.\"",
      "chain": [
        "11278",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "861",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يفتتح القراءة ب ‏{الحمد لله رب العالمين }‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ), AbuBakr, ‘Umar and ‘Uthman used to start their recitation with “Allpraises and thanks are to Allah, the Lord of all that exists.(Al-hamdu Lillahi Rabbil-‘Alamin).’” [1:2]",
      "chain": [
        "30201",
        "20472",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "890",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الوليد بن عمرو بن السكين، حدثنا يوسف بن يعقوب السلعي، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كل صلاة لا يقرأ فيها بفاتحة الكتاب فهي خداج فهي خداج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “Every prayerinwhich Fatihatil-Kitab (the Opening of the Book) is not recited, itisdeficient, it is deficient.”",
      "chain": [
        "34278",
        "20305",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "918",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Messenger of Allah (ﷺ)bowed, he neither raised his head nor lowered it, rather (he didsomething) between that.”",
      "chain": [
        "30201",
        "20472",
        "11278",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "943",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن حسين المعلم، عن بديل، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما فإذا سجد فرفع رأسه لم يسجد حتى يستوي جالسا وكان يفترش رجله اليسرى ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Messenger of Allah (ﷺ)raised his head from bowing, he would not prostrate until he hadstoodup straight. When he prostrated, he would raise his head andnotprostrate again until he had sat up straight. And he used tospreadout his left leg.”",
      "chain": [
        "30201",
        "20472",
        "11278",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت النبي  صلى الله عليه وسلم  ينفتل عن يمينه وعن يساره في الصلاة ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “I saw the Prophet (ﷺ) departing to his rightandto his left when he finished the prayer.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1091",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله  صلى الله عليه وسلم  يصلي حافيا ومنتعلا ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “I saw the Messenger of Allah (ﷺ) performingprayer both barefoot, and while wearing sandals.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1281",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن إبراهيم بن طهمان، عن حسين المعلم، عن ابن بريدة، عن عمران بن حصين، قال كان بي الناصور فسألت النبي  صلى الله عليه وسلم  عن الصلاة فقال ‏\"‏ صل قائما فإن لم تستطع فقاعدا فإن لم تستطع فعلى جنب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Imran bin Husain said:                      “I suffered from Nasur*andI asked the Prophet (ﷺ) about prayer. He said: ‘Perform prayerstanding; if you cannot, then sitting; and if you cannot then whilelying on your side.’”",
      "chain": [
        "38409",
        "20032",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، أنه سأل رسول الله  صلى الله عليه وسلم  عن الرجل يصلي قاعدا قال ‏\"‏ من صلى قائما فهو أفضل ومن صلى قاعدا فله نصف أجر القائم ومن صلى نائما فله نصف أجر القاعد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain that he asked the Messenger ofAllah (ﷺ) about a man who prays sitting down. He said, “Whoeverperforms prayer standing up, that is better. Whoever performs prayersitting down will have half the reward of one who prays standing. Andwhoever performs prayer lying down will have half the reward of onewho prays sitting.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "2320",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن ثعلبة بن سواء، حدثني عمي، محمد بن سواء عن حسين المعلم، عن مطر الوراق، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعان على خصومة بظلم - أو يعين على ظلم - لم يزل في سخط الله حتى ينزع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     “Whoever takes the wrongdoer's side in a dispute or supports wrongdoing, he will remain subject to the wrath of Allah until he gives it up.”",
      "chain": [
        "11278",
        "10719",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2467",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بشار، وأبو بكر بن خلاد الباهلي قالا حدثنا ابن أبي عدي، عن حسين المعلم، عن عمرو بن شعيب، عن طاوس، عن ابن عباس، وابن، عمر يرفعان الحديث إلى النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل للرجل أن يعطي العطية ثم يرجع فيها إلا الوالد فيما يعطي ولده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas and Ibn 'Umar, who attributed the Hadith to the Prophet (ﷺ) that he said:                     “It is not permissible for a man to give a gift then take it back, except what a father gives to his child.”",
      "chain": [
        "30160",
        "30357",
        "20276",
        "11278",
        "19934",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2507",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن ثعلبة بن سواء، حدثنا عمي، محمد بن سواء عن حسين المعلم، عن مطر الوراق، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات وعليه دينار أو درهم قضي من حسناته ليس ثم دينار ولا درهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     “Whoever dies owing a Dinar or a Dirham, it will be paid back from his good deeds, because then there will be no Dinar or Dirham.”",
      "chain": [
        "11278",
        "10719",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن حسين المعلم، عن عمرو بن شعيب، عن عمرو بن الشريد بن سويد، عن أبيه الشريد بن سويد، قال قلت يا رسول الله أرض ليس فيها لأحد قسم ولا شرك إلا الجوار ‏.‏ قال ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sharid bin Suwaid said:                      “I said:'O Messenger of Allah, (what do you think of) land owned by only one person but this land has neighbors?' He said: 'The neighbor has more right to property that is near.' ”",
      "chain": [
        "30201",
        "20318",
        "11278",
        "19934",
        "10952"
      ]
    },
    {
      "hadith_no": "2822",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا روح بن عبادة، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال لا أجد شيئا وليس لي مال ولي يتيم له مال قال ‏\"‏ كل من مال يتيمك غير مسرف ولا متأثل مالا ‏\"‏ ‏.‏ قال وأحسبه قال ‏\"‏ ولا تقي مالك بماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, that his a grandfather said:                     “A man came to the Prophet (ﷺ) and said: 'I do not have anything and I have no wealth, but I have an orphan (under my care) who has wealth.” He said: “Eat from the wealth of your orphan, without being extravagant or use it for trade.” He (narrator) said: “And I think he said: 'Do not preserve your wealth using his instead.'”",
      "chain": [
        "38001",
        "20229",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال تزوج رئاب بن حذيفة بن سعيد بن سهم أم وائل بنت معمر الجمحية فولدت له ثلاثة فتوفيت أمهم فورثها بنوها رباعا وولاء مواليها فخرج بهم عمرو بن العاص معه إلى الشام فماتوا في طاعون عمواس فورثهم عمرو وكان عصبتهم فلما رجع عمرو بن العاص جاء بنو معمر يخاصمونه في ولاء أختهم إلى عمر فقال عمر أقضي بينكم بما سمعت من رسول الله صلى الله عليه وسلم سمعته يقول ‏\"‏ ما أحرز الولد أو الوالد فهو لعصبته من كان ‏\"‏ ‏.‏ قال فقضى لنا به وكتب لنا به كتابا فيه شهادة عبد الرحمن بن عوف وزيد بن ثابت وآخر حتى إذا استخلف عبد الملك بن مروان توفي مولى لها وترك ألفى دينار فبلغني أن ذلك القضاء قد غير فخاصموه إلى هشام بن إسماعيل فرفعنا إلى عبد الملك فأتيناه بكتاب عمر فقال إن كنت لأرى أن هذا من القضاء الذي لا يشك فيه وما كنت أرى أن أمر أهل المدينة بلغ هذا أن يشكوا في هذا القضاء ‏.‏ فقضى لنا به فلم نزل فيه بعد ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “Rabab bin Hudhaifah (bin Sa’eed) bin SahmmarriedUmm Wa’il bint Ma’mar Al-Jumahiyyah, and she bore himthree sons.Their mother died and her sons inherited her houses andthe Wala’ ofher freed slaves. ‘Amr bin ‘As took them out toSham, and they died ofthe plague of ‘Amwas. ‘Amr inherited fromthem, and he was their‘Asabah.* When ‘Amr came back, Banu Ma’marcame to him and theyreferred their dispute with him concerning theWala’ of their sisterto ‘Umar. ‘Umar said: ‘I will judgebetween you according to what Iheard from the Messenger of Allah(ﷺ). I heard him say: “What theson or father acquires goes tohis. ‘Asabah, no matter who they are.’”So he ruled in ourfavour and wrote a document to that effect, inwhich was thetestimony of ‘Abdur-Rahman bin ‘Awf, Zaid bin Thabit andsomeoneelse. Then when ‘Abdul-Malik bin Marwan was appointed caliph,afreed slave of hers (Umm Wa’il’s) died, leaving behind twothousandDinar. I heard that that ruling had been changed, so theyreferred thedispute to Hisham bin Isma’il. We referred the matterto ‘Abdul-Malik,and brought him the document of ‘Umar. He said:‘I thought that thiswas a ruling concerning which there was nodoubt. I never thought thatthe people of Al-Madinah would reach sucha state that they woulddoubt this ruling. So he ruled in our favour,and it remained likethat afterwards.”",
      "chain": [
        "30201",
        "20318",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3205",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن موسى القطان الواسطي، حدثنا يزيد بن موهب، حدثنا مروان بن معاوية الفزاري، حدثنا علي بن عبد العزيز، حدثنا حسين المعلم، عن أبي المهزم، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال في بيض النعام يصيبه المحرم ‏\"‏ ثمنه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said,concerning an ostrich egg taken by a Muhrim:                      “Its cost (must bepaid as a penalty).”",
      "chain": [
        "20201",
        "25197",
        "11278",
        "13"
      ]
    }
  ],
  "total_hadiths": 134
}