{
  "id": "11271",
  "name": "Jabir bin Zayd al-Azdi جابر بن زيد الأزدي",
  "full_name": "Jabir bin Zayd al-Azdi جابر بن زيد الأزدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "93",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Azdi",
      "al-Jufi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3136",
      "name": "al-Hakam bin 'Amr al-Ghafari ( الحكم بن عمرو الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11568",
      "name": "Y'la bin Muslim bin Hrmz يعلى بن مسلم بن هرمز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10708",
      "name": "'Amr bin Hrm al-Azdy عمرو بن هرم الأزدي البصري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "253",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا ابن عيينة، عن عمرو، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم وميمونة كانا يغتسلان من إناء واحد‏.‏ قال أبو عبد الله كان ابن عيينة يقول أخيرا عن ابن عباس عن ميمونة، والصحيح ما روى أبو نعيم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet and Maimuna used to take a bath from a single pot.",
      "chain": [
        "20348",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  هو ابن زيد  عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر، والمغرب والعشاء‏.‏ فقال أيوب لعله في ليلة مطيرة‏.‏ قال عسى‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"The Prophet prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers in Medina.\" Aiyub said, \"Perhaps those were rainy nights.\" Anas said, \"May be.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا عمرو بن دينار، قال سمعت جابر بن زيد، عن ابن عباس، قال صلى النبي صلى الله عليه وسلم سبعا جميعا وثمانيا جميعا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet prayed seven rak`at together and eight rak`at together.",
      "chain": [
        "20404",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1174",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، قال سمعت أبا الشعثاء، جابرا قال سمعت ابن عباس  رضى الله عنه  قال صليت مع رسول الله صلى الله عليه وسلم ثمانيا جميعا وسبعا جميعا‏.‏ قلت يا أبا الشعثاء أظنه أخر الظهر وعجل العصر وعجل العشاء وأخر المغرب‏.‏ قال وأنا أظنه‏.‏",
      "text_en": " Narrated `Amr:                     I heard Abu Ash-sha'tha' Jabir saying, \"I heard Ibn `Abbas saying, 'I offered with Allah's Apostle eight rak`at (of Zuhr and `Asr prayers) together and seven rak`at (the Maghrib and the `Isha' prayers) together.' \" I said, \"O Abu Ash-shatha! I think he must have prayed the Zuhr late and the `Asr early; the `Isha early and the Maghrib late.\" Abu Ash-sha'tha' said, \"I also think so.\" (See Hadith No. 518 Vol. 1).",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1767",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني عمرو، قال سمعت جابر بن زيد، قال سمعت ابن عباس  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يخطب بعرفات‏.‏ تابعه ابن عيينة عن عمرو‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard the Prophet delivering a sermon at `Arafat.",
      "chain": [
        "30329",
        "20020",
        "20377",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، قال أخبرني عمرو بن دينار، سمعت جابر بن زيد، سمعت ابن عباس  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يخطب بعرفات ‏\"‏ من لم يجد النعلين فليلبس الخفين، ومن لم يجد إزارا فليلبس سراويل ‏\"‏‏.‏ للمحرم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard the Prophet delivering a sermon at `Arafat saying, \"If a Muhrim does not find slippers, he could wear Khuffs (socks made from thick fabric or leather, but he has to cut short the Khuffs below the ankles), and if he does not find an Izar (a waist sheet for wrapping the lower half of the body) he could wear trousers.\"",
      "chain": [
        "20296",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1874",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن دينار، عن جابر بن زيد، عن ابن عباس  رضى الله عنهما  قال خطبنا النبي صلى الله عليه وسلم بعرفات فقال ‏\"‏ من لم يجد الإزار فليلبس السراويل، ومن لم يجد النعلين فليلبس الخفين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet delivered a sermon at `Arafat and said, \"Whoever does not get an Izar can wear trousers, and whoever cannot get a pair of shoes can wear Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "20404",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2645",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا همام، حدثنا قتادة، عن جابر بن زيد، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم في بنت حمزة ‏\"‏ لا تحل لي، يحرم من الرضاع ما يحرم من النسب، هي بنت أخي من الرضاعة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said about Hamza's daughter, \"I am not legally permitted to marry her, as foster relations are treated like blood relations (in marital affairs). She is the daughter of my foster brother.\"",
      "chain": [
        "20285",
        "20297",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "5156",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن قتادة، عن جابر بن زيد، عن ابن عباس، قال قيل للنبي صلى الله عليه وسلم ألا تزوج ابنة حمزة قال ‏\"‏ إنها ابنة أخي من الرضاعة ‏\"‏‏.‏ وقال بشر بن عمر حدثنا شعبة سمعت قتادة سمعت جابر بن زيد مثله‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     It was said to the Prophet, \"Won't you marry the daughter of Hamza?\" He said, \"She is my foster niece (brother's daughter). \"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "5170",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، أخبرنا ابن عيينة، أخبرنا عمرو، حدثنا جابر بن زيد، قال أنبأنا ابن عباس  رضى الله عنهما  تزوج النبي صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet got married while he was in the state of Ihram.",
      "chain": [
        "20357",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "5864",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عمرو، عن جابر بن زيد، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يجد إزارا فليلبس سراويل، ومن لم يجد نعلين فليلبس خفين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Whoever cannot get an Izar, can wear trousers, and whoever cannot wear sandals can wear Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "20348",
        "20012",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "5914",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ من لم يكن له إزار فليلبس السراويل، ومن لم يكن له نعلان فليلبس خفين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Whoever has no Izar (waist sheet), can wear trousers; and whoever has no sandals, can wear Khuffs (socks made from thick fabric or leather, but cut them short below the ankles).\"",
      "chain": [
        "30388",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1668",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال صليت مع النبي صلى الله عليه وسلم ثمانيا جميعا وسبعا جميعا ‏.‏ قلت يا أبا الشعثاء أظنه أخر الظهر وعجل العصر وأخر المغرب وعجل العشاء ‏.‏ قال وأنا أظن ذاك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I observed with the Apostle of Allah (may peace be upon him) eight (rak'ahs) in combination, and seven rak'ahs in combination. I (one of the narrators) said: O Abd Sha'tha', I think that he (the Holy Prophet) had delayed the noon prayer and hastened the afternoon prayer, and he delayed the sunset prayer and hastened the 'Isha' prayer. He said: I also think so.",
      "chain": [
        "30201",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1669",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر والمغرب والعشاء ‏.‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) observed in Medina seven (rak'ahs) and eight (rak'ahs), i. e. (be combined) the noon and afternoon prayers (eight rak'ahs) and the sunset and 'Isha' prayers (seven rak'ahs).",
      "chain": [
        "30137",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو الربيع الزهراني، وقتيبة بن سعيد، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن عمرو، عن جابر بن زيد، عن ابن عباس، - رضى الله عنهما - قال سمعت رسول الله صلى الله عليه وسلم وهو يخطب يقول ‏\"‏ السراويل لمن لم يجد الإزار والخفان لمن لم يجد النعلين ‏\"‏ ‏.‏ يعني المحرم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with both of them) reported:                      I heard Allah's Messenger (may peace be upon him) say as he was delivering an address: So far as the trousers are concerned, one who does not find lower garment, he may wear them; as also socks, he may wear them who does not find shoes. It concerns the Muhrim.",
      "chain": [
        "30399",
        "30137",
        "30367",
        "20022",
        "11449",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "3518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا داود بن عبد الرحمن، عن عمرو بن دينار، عن جابر بن زيد أبي الشعثاء، عن ابن عباس، أنه قال تزوج رسول الله صلى الله عليه وسلم ميمونة وهو محرم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      Allah's Messenger. (may peace be upon him) married Maimuna while he was a Muhrim.",
      "chain": [
        "30399",
        "20192",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "3656",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن جابر بن زيد، عن ابن، عباس أن النبي صلى الله عليه وسلم أريد على ابنة حمزة فقال ‏\"‏ إنها لا تحل لي إنها ابنة أخي من الرضاعة ويحرم من الرضاعة ما يحرم من الرحم ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      It was proposed that he (the Holy Prophet) be married to the daughter of Hamza, whereupon he said: She is not lawful for me for she is the daughter of my foster-brother, and that is unlawful by reason of fosterage what is unlawful by reason of genealogy.",
      "chain": [
        "20297",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "703",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثنا قتادة، قال سمعت جابر بن زيد، يحدث عن ابن عباس، - رفعه شعبة - قال ‏\"‏ يقطع الصلاة المرأة الحائض والكلب ‏\"‏ ‏.‏ قال أبو داود وقفه سعيد وهشام عن قتادة عن جابر بن زيد على ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Qatadah said: I heard Jabir ibn Zayd who reported on the authority of Ibn Abbas; and Shu'bah reported the Prophet (ﷺ) as saying: A menstruating woman and a dog cut off the prayer.Abu Dawud said: Sa'id, Hisham and Hammam narrated this tradition from Qatadah on the authority of Jabir b. Zaid as a statement of Ibn 'Abbas.",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11019",
        "11271",
        "11019"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ السراويل لمن لا يجد الإزار والخف لمن لا يجد النعلين ‏\"‏ ‏.‏ قال أبو داود هذا حديث أهل مكة ومرجعه إلى البصرة إلى جابر بن زيد والذي تفرد به منه ذكر السراويل ولم يذكر القطع في الخف ‏.‏",
      "text_en": " Ibn ‘Abbas said I heard the Apostle of Allaah(ﷺ) say When one who is wearing ihram cannot get a lower garment(loin cloth) he may ear trousers and when he cannot get sandals he may wear shoes. Abu Dawud said This is the tradition narrated by the narrators of Makkah. Its narrator from Basrah is Jabir bin Zaid. He mentioned only trousers and omitted the mention of cutting of the shoes.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "3709",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن جابر بن زيد، وعكرمة، أنهما كانا يكرهان البسر وحده ويأخذان ذلك عن ابن عباس ‏.‏ وقال ابن عباس أخشى أن يكون المزاء الذي نهيت عنه عبد القيس ‏.‏ فقلت لقتادة ما المزاء قال النبيذ في الحنتم والمزفت ‏.‏",
      "text_en": " Qatadah said on the authority of Jabir b. Zaid and ‘Ikrimah that they disapprove of drink made exclusively from unripe dates. This they reported on the authority of Ibn ‘Abbas said:                      I am afraid it may not be muzza  from which(the people of) ‘Abd al-Qais were prohibited. I asked Qatadah : What is muzza’?  He replied: Drink of dates made in a green jar and vessels smeared with pitch.",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11271"
      ]
    },
    {
      "hadith_no": "3952",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن سعيد، عن قتادة، عن جابر بن زيد، والحسن، مثله ‏.‏ قال أبو داود سعيد أحفظ من حماد ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Jabir b. Zaid and al-Hasan through a different chain of narrators.Abu Dawud said:                      The narrator sa'id retained te tradition more carefully than Hammad.",
      "chain": [
        "30201",
        "20318",
        "11168",
        "11019",
        "11271"
      ]
    },
    {
      "hadith_no": "834",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا يزيد بن زريع، حدثنا أيوب، حدثنا عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المحرم إذا لم يجد الإزار فليلبس السراويل وإذا لم يجد النعلين فليلبس الخفين ‏\"‏ ‏.‏ حدثنا قتيبة، حدثنا حماد بن زيد، عن عمرو، نحوه ‏.‏ قال وفي الباب عن ابن عمر، وجابر، ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا إذا لم يجد المحرم الإزار لبس السراويل وإذا لم يجد النعلين لبس الخفين ‏.‏ وهو قول أحمد ‏.‏ وقال بعضهم على حديث ابن عمر عن النبي صلى الله عليه وسلم ‏\"‏ إذا لم يجد نعلين فليلبس الخفين وليقطعهما أسفل من الكعبين ‏\"‏ ‏.‏ وهو قول سفيان الثوري والشافعي وبه يقول مالك ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     He heard the Messenger of Allah say: \"If the Muhrim cannot find an Izar, then let him wear pants, and if he cannot find sandals, them let him wear Khuff.\"",
      "chain": [
        "30423",
        "20304",
        "11015",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1103",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا يوسف بن حماد المعني البصري، حدثنا عبد الأعلى، عن سعيد، عن قتادة، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ البغايا اللاتي ينكحن أنفسهن بغير بينة ‏\"‏ ‏.‏ قال يوسف بن حماد رفع عبد الأعلى هذا الحديث في التفسير وأوقفه في كتاب الطلاق ولم يرفعه ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"The adulteresses are the ones who marry themselves without Bayyinah (proof).\"",
      "chain": [
        "30573",
        "20246",
        "11168",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن موسى، عن سفيان، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال أخبرتني خالتي، ميمونة أنها كانت تغتسل ورسول الله صلى الله عليه وسلم من إناء واحد ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"My maternal aunt Maimunah told me that she and the Messenger of Allah (ﷺ) used to perform Ghusl from one vessel.\"",
      "chain": [
        "30221",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "596",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال صليت مع النبي صلى الله عليه وسلم بالمدينة ثمانيا جميعا وسبعا جميعا أخر الظهر وعجل العصر وأخر المغرب وعجل العشاء ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"I prayed with the Prophet (ﷺ) in Al-Madinah, eight  together and seven together. He delayed Zuhr and brought 'Asr forward, and he delayed Maghrib and brought 'Isha' forward.\"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان بن هلال، حدثنا حبيب، - وهو ابن أبي حبيب - عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، أنه صلى بالبصرة الأولى والعصر ليس بينهما شىء والمغرب والعشاء ليس بينهما شىء فعل ذلك من شغل وزعم ابن عباس أنه صلى مع رسول الله صلى الله عليه وسلم بالمدينة الأولى والعصر ثمان سجدات ليس بينهما شىء ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that he prayed Al-Uula (Zuhr) and 'Asr together in Al-Basrah with nothing in between them, and he prayed Maghrib and 'Isha' together with nothing in between them. He did that because he was busy and Ibn 'Abbas said that he had prayed Zuhr and 'Isha' together with the Messenger of Allah (ﷺ) in Al-Madinah, eight Rak'ahs with nothing in between.",
      "chain": [
        "38204",
        "20218",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "632",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، قال حدثنا حبان بن هلال، حدثنا حبيب، عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، قال أدلج رسول الله صلى الله عليه وسلم ثم عرس فلم يستيقظ حتى طلعت الشمس أو بعضها فلم يصل حتى ارتفعت الشمس فصلى وهي صلاة الوسطى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah (ﷺ) set out at nightfall, then stopped to camp at the end of the night, and he did not wake up until the sun had risen or had partly risen. He did not pray until the sun had risen (fully), then he prayed, and that was the 'middle prayer' (Salat Al-Wusta).\"",
      "chain": [
        "20241",
        "20218",
        "11276",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2671",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال سمعت النبي صلى الله عليه وسلم يخطب وهو يقول ‏\"‏ السراويل لمن لا يجد الإزار والخفين لمن لا يجد النعلين ‏\"‏ ‏.‏ للمحرم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said;\"I heard the Prophet delivering a khutbah and he said:                      'Pants (are allowed) for one who cannot find an Izar, and Khuffs for one who cannot find sandals to wear in Ihram.;;",
      "chain": [
        "30367",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أيوب بن محمد الوزان، قال حدثنا إسماعيل، عن أيوب، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لم يجد إزارا فليلبس سراويل ومن لم يجد نعلين فليلبس خفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said;\"I heard the Messenger of Allah say:                      'Whoever cannot find an Izar, let him wear pants, and whoever cannot find sandals, let him wear khuffs.\"",
      "chain": [
        "38120",
        "30103",
        "11015",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2679",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال أنبأنا أيوب، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا لم يجد إزارا فليلبس السراويل وإذا لم يجد النعلين فليلبس الخفين وليقطعهما أسفل من الكعبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I heard the Messenger of Allah say; 'If you cannot find an Izar then wear pants, and if you cannot find sandals then wear khuffs, but cut them so that they come lower than the ankles.",
      "chain": [
        "34033",
        "20304",
        "11015",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "3305",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني إبراهيم بن محمد، قال حدثنا يحيى بن سعيد، عن شعبة، عن قتادة، عن جابر بن زيد، عن ابن عباس، قال ذكر لرسول الله صلى الله عليه وسلم بنت حمزة فقال ‏\"‏ إنها ابنة أخي من الرضاعة ‏\"‏ ‏.‏ قال شعبة هذا سمعه قتادة من جابر بن زيد ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"Mention was made to the Messenger of Allah of the daughter of Hamzah (as a potential wife). He said: 'She is the daughter of my brother through breast-feeding.'\" (One of the narrators) Shu'bah said: \"Qatadah heard this from Jabir bin Zaid.\"",
      "chain": [
        "20031",
        "20020",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "3306",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن الصباح بن عبد الله، قال حدثنا محمد بن سواء، قال حدثنا سعيد، عن قتادة، عن جابر بن زيد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أريد على بنت حمزة فقال ‏\"‏ إنها ابنة أخي من الرضاعة وإنه يحرم من الرضاع ما يحرم من النسب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the daughter of Hamzah was suggested to Messenger of Allah (as a potential wife). He said:                      \"She is the daughter of my brother through breast-feeding, and what becomes unlawful (for marriage) through breast-feeding is the same as that which becomes unlawful through lineage.\"",
      "chain": [
        "20565",
        "11168",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "4166",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا مبشر بن عبد الله، قال حدثنا سفيان بن حسين، عن يعلى بن مسلم، عن جابر بن زيد، قال قال ابن عباس إن رسول الله صلى الله عليه وسلم وأبا بكر وعمر كانوا من المهاجرين لأنهم هجروا المشركين وكان من الأنصار مهاجرون لأن المدينة كانت دار شرك فجاءوا إلى رسول الله صلى الله عليه وسلم ليلة العقبة ‏.‏",
      "text_en": " It was narrated that Jabir bin Zaid said:                      \"Ibn 'Abbas said:'The Messenger of Allah (ﷺ), Abu Bakr and 'Umar were among the Muhajirin (emigrants), because they forsook (hajaru) the idolators, andsome of the Ansar were Muhajirun because Al-Madinah was a land of shirk, and they came to the Messenger of Allah (ﷺ) on the Night of Al-'Aqabah.\"'",
      "chain": [
        "38181",
        "20655",
        "11568",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "5325",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أنه سمع النبي صلى الله عليه وسلم يقول بعرفات فقال ‏\"‏ من لم يجد إزارا فليلبس السراويل ومن لم يجد نعلين فليلبس خفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     He heard the Prophet [SAW] say in 'Arafat: \"Whoever cannot find an Izar (waist wrapper), let him wear trousers, and whoever cannot find sandals, let him wear Khuffs (leather socks).\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "408",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، عن خالته، ميمونة قالت كنت أغتسل أنا ورسول الله،  صلى الله عليه وسلم  من إناء واحد ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that his maternal aunt Maimunah said:                     \"The Messager of Allah and I used to take bath from a single vessel.\"",
      "chain": [
        "30201",
        "20005",
        "11081",
        "11271",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "961",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من نسي الصلاة على خطئ طريق الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: ‘Whoever forgets to send peace and blessings upon me, then hehas missed the road to Paradise.’”",
      "chain": [
        "35021",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "1002",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا يحيى بن سعيد، حدثنا شعبة، حدثنا قتادة، حدثنا جابر بن زيد، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقطع الصلاة الكلب الأسود والمرأة الحائض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “Theprayeris severed by a black dog and a woman who has reached the ageofmenstruation.”",
      "chain": [
        "30357",
        "20031",
        "20020",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2013",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا حميد بن مسعدة، وأبو بكر بن خلاد قالا حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن جابر بن زيد، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  أريد على بنت حمزة بن عبد المطلب فقال ‏\"‏ إنها ابنة أخي من الرضاعة وإنه يحرم من الرضاعة ما يحرم من النسب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     that the Messenger of was offered the daughter of Hamzah bin 'Abdul-Muttalib in marriage, and he said: “She is the daughter of my brother through breastfeeding, and breastfeeding makes unlawful (for marriage) the same things that blood ties make unlawful.”",
      "chain": [
        "30430",
        "30357",
        "20226",
        "11168",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن النبي  صلى الله عليه وسلم  نكح وهو محرم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet got married while he was a Muhrim (in Ihram).",
      "chain": [
        "30357",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "3043",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن جابر بن زيد أبي الشعثاء، عن ابن عباس، قال سمعت النبي  صلى الله عليه وسلم  يخطب - قال هشام على المنبر - فقال ‏\"‏ من لم يجد إزارا فليلبس سراويل ومن لم يجد نعلين فليلبس خفين ‏\"‏ ‏.‏ وقال هشام في حديثه ‏\"‏ فليلبس سراويل إلا أن يفقد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “I heard the Prophet (ﷺ)delivering a sermon – (one of the narrators) Hisham said: ‘On thepulpit’ – and he said: ‘Whoever does not have a waist wrap, lethimwear pants or pajamas, and whoever does not have sandals, let himwearleather socks.’” In his narration, Hisham said: “If hedoes not findany, then let him wear pants or pajamas.”",
      "chain": [
        "30288",
        "30269",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    }
  ],
  "total_hadiths": 40
}