{
  "id": "11274",
  "name": "Hatm bin Abi Sghyrh حاتم بن أبي صغيرة",
  "full_name": "Hatm bin Abi Sghyrh حاتم بن أبي صغيرة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Qushayri",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10972",
      "name": "al-Nu'man bin Salm al-Ta'ify النعمان بن سالم الطائفي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6606",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قيس بن حفص، حدثنا خالد بن الحارث، حدثنا حاتم بن أبي صغيرة، عن عبد الله بن أبي مليكة، قال حدثني القاسم بن محمد بن أبي بكر، أن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ تحشرون حفاة عراة غرلا ‏\"‏ قالت عائشة فقلت يا رسول الله الرجال والنساء ينظر بعضهم إلى بعض‏.‏ فقال ‏\"‏ الأمر أشد من أن يهمهم ذاك ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"The people will be gathered barefooted, naked, and uncircumcised.\" I said, \"O Allah's Apostle! Will the men and the women look at each other?\" He said, \"The situation will be too hard for them to pay attention to that.\"",
      "chain": [
        "30158",
        "20226",
        "11274",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6617",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا روح بن عبادة، حدثنا حاتم بن أبي صغيرة، حدثنا عبد الله بن أبي مليكة، حدثني القاسم بن محمد، حدثتني عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس أحد يحاسب يوم القيامة إلا هلك ‏\"‏‏.‏ فقلت يا رسول الله أليس قد قال الله تعالى ‏{‏فأما من أوتي كتابه بيمينه * فسوف يحاسب حسابا يسيرا‏}‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك العرض، وليس أحد يناقش الحساب يوم القيامة إلا عذب ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle, said, \"None will be called to account on the Day of Resurrection, but will be ruined.\" I said \"O Allah's Apostle! Hasn't Allah said: 'Then as for him who will be given his record in his right hand, he surely will receive an easy reckoning? (84.7-8) -- Allah's Apostle said, \"That (Verse) means only the presentation of the accounts, but anybody whose account (record) is questioned on the Day of Resurrection, will surely be punished.\"",
      "chain": [
        "30313",
        "20229",
        "11274",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3312",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الله بن بكر السهمي، حدثنا حاتم بن أبي، صغيرة عن أبي قزعة، أن عبد الملك بن مروان، بينما هو يطوف بالبيت إذ قال قاتل الله ابن الزبير حيث يكذب على أم المؤمنين يقول سمعتها تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة لولا حدثان قومك بالكفر لنقضت البيت حتى أزيد فيه من الحجر فإن قومك قصروا في البناء ‏\"‏ ‏.‏ فقال الحارث بن عبد الله بن أبي ربيعة لا تقل هذا يا أمير المؤمنين فأنا سمعت أم المؤمنين تحدث هذا ‏.‏ قال لو كنت سمعته قبل أن أهدمه لتركته على ما بنى ابن الزبير ‏.‏",
      "text_en": " Abu Qaza'ah reported that while Abd al-Malik b. Marwan was circumambulating the Ka'ba he said:                      May Allah ruin Ibn Zubair that he lies in attributing to the Mother of the Faithful, as he says: I heard her stating that Allah's Messenger (may'peace be upon him) had said: 'A'isha, if your people had not been new converts to Islam, I would have demolished the House and would have added (in it area) from the Hijr for your people have reduced the area from its foundations. Harith b. 'Abdullah b. Abu Rabi'a (Allah be pleased with him) said: Commander of the Faithful, don't say that, for I heard the Mother of the Faithful saying this, whereupon he said: If I had heard this before demolishing it, I would have left it in the state in which Ibn Zabair had built it.",
      "chain": [
        "38487",
        "20244",
        "11274"
      ]
    },
    {
      "hadith_no": "7377",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يحيى بن سعيد، عن حاتم بن أبي صغيرة، حدثني  ابن أبي مليكة، عن القاسم بن محمد، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يحشر الناس يوم القيامة حفاة عراة غرلا ‏\"‏ ‏.‏ قلت يا رسول الله النساء والرجال جميعا ينظر بعضهم إلى بعض قال صلى الله عليه وسلم ‏\"‏ يا عائشة الأمر أشد من أن ينظر بعضهم إلى بعض ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that she beard Allah's Messenger (may peace be upon him) as saying:                      The people would be assembled on the Day of Resurrection barefooted, naked and uncircumcised. I said: Allah's Messenger, will the male and the female be together on the Day and would they be looking at one another? Upon this Allah's Messenger (may peace be upon him) said: 'A'isha, the matter would be too serious for them to look to one another.",
      "chain": [
        "30022",
        "20031",
        "11274",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا خالد بن الحارث، حدثنا حاتم، - يعني ابن أبي صغيرة - عن سماك، قال سمعت النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يسوي صفوفنا إذا قمنا للصلاة فإذا استوينا كبر ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Messenger of Allah (ﷺ) used to straighten our rows when we stood up to pray, and when we were straight, he said: Allah is most great (takbir).",
      "chain": [
        "30150",
        "20226",
        "11274",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "3493",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، وعبد الله بن بكر السهمي، عن حاتم بن أبي صغيرة، عن سماك بن حرب، عن أبي صالح، عن أم هانئ، عن النبي صلى الله عليه وسلم في قوله تعالى ‏:‏ ‏(‏أتأتون في ناديكم المنكر ‏)‏ قال ‏\"‏ كانوا يخذفون أهل الأرض ويسخرون منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من حديث حاتم بن أبي صغيرة عن سماك ‏.‏",
      "text_en": " Narrated Umm Hani:                     that regarding Allah's saying: '...And you practice evil in your meetings... (29:29) that the Prophet (ﷺ) said: \"They would throw pebbles at people of the land and make a mockery of them.\"",
      "chain": [
        "30277",
        "20318",
        "20244",
        "11274",
        "10770",
        "11161",
        "198"
      ]
    },
    {
      "hadith_no": "3494",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا سليم بن أخضر، عن حاتم بن أبي صغيرة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "20546",
        "11274"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن أبي زياد الكوفي، حدثنا عبد الله بن أبي بكر السهمي، عن حاتم بن أبي صغيرة، عن أبي بلج، عن عمرو بن ميمون، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما على الأرض أحد يقول لا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏.‏ إلا كفرت عنه خطاياه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى شعبة هذا الحديث عن أبي بلج بهذا الإسناد نحوه ولم يرفعه وأبو بلج اسمه يحيى بن أبي سليم ويقال أيضا يحيى بن سليم ‏.‏ حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن حاتم بن أبي صغيرة، عن أبي بلج، عن عمرو بن ميمون، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم نحوه وحاتم يكنى أبا يونس القشيري ‏.‏حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بلج، نحوه ولم يرفعه ‏.‏",
      "text_en": " Abdullah bin Amr narrated that :                     the Messenger of Allah said: “there is not anyone upon the earth who says: ‘None has the right to be worshipped but Allah, and Allah is the Greatest, and there is no might nor power except by Allah, (La Ilaha Illallah, Wa Allahu Akbar, Wa La Hawla Wa La Quwwata Illa Billah) except that his sins shall be pardoned, even if they were like the foam of the sea.”",
      "chain": [
        "11274",
        "11382",
        "29"
      ]
    },
    {
      "hadith_no": "2129",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا إسماعيل بن إبراهيم، قال حدثنا حاتم بن أبي صغيرة، عن سماك بن حرب، عن عكرمة، قال حدثنا ابن عباس، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته فإن حال بينكم وبينه سحاب فأكملوا العدة ولا تستقبلوا الشهر استقبالا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah said:                     \"Fast when you see it, and stop fasting when you see it, and if clouds prevent you from seeing it, then complete the number, and do not fast ahead of Ramadan.\"",
      "chain": [
        "30123",
        "20208",
        "11274",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3983",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عبد الله بن بكر، قال حدثنا حاتم بن أبي صغيرة، عن النعمان بن سالم، أن عمرو بن أوس، أخبره أن أباه أوسا قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ثم تحرم دماؤهم وأموالهم إلا بحقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Salim that:                     'Amr bin Aws told him that his father Aws said: \"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah), then their blood and their wealth become forbidden to me, except for a right that is due.\"",
      "chain": [
        "30524",
        "20244",
        "11274",
        "10972",
        "11437"
      ]
    },
    {
      "hadith_no": "4063",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن بكر السهمي، حدثنا حاتم بن أبي صغيرة، عن النعمان بن سالم، أن عمرو بن أوس، أخبره أن أباه أوسا أخبره قال إنا لقعود عند النبي  صلى الله عليه وسلم  وهو يقص علينا ويذكرنا إذ أتاه رجل فساره فقال النبي  صلى الله عليه وسلم  ‏\"‏ اذهبوا به فاقتلوه ‏\"‏ ‏.‏ فلما ولى الرجل دعاه رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ هل تشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم قال ‏\"‏ اذهبوا فخلوا سبيله فإنما أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا فعلوا ذلك حرم على دماؤهم وأموالهم ‏\"‏ ‏.‏",
      "text_en": " ‘Amr bin Aws narrated that his father, Aws, told him:                      “We weresitting with the Prophet (ﷺ) and he was narrating to us andreminding us, when a man came and spoke privately to him. He said:‘Take him away and kill him.’ When the man turned away, theMessengerof Allah (ﷺ) called him back and said: ‘Do you bearwitness thatnone has the right to be worshiped but Allah?’ Hesaid, ‘Yes.’ Hesaid: ‘Then go and let him go, for I have beencommanded to fight thepeople until they say: La ilaha illallah, thenif they do that, theirblood and wealth are forbidden to me.’”",
      "chain": [
        "30201",
        "20244",
        "11274",
        "10972",
        "11437"
      ]
    }
  ],
  "total_hadiths": 11
}