{
  "id": "11275",
  "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
  "full_name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "24004",
      "name": "Ibrahim bin Habib bin al-Shhyd إبراهيم بن حبيب بن الشهيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24004",
      "name": "Ibrahim bin Habib bin al-Shhyd إبراهيم بن حبيب بن الشهيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20273",
      "name": "Quraysh bin Anas al-Ansari قريش بن أنس الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25051",
      "name": "al-Hasan bin Thabit al-Tha'labi الحسن بن ثابت الثعلبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3082",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا يزيد بن زريع، وحميد بن الأسود، عن حبيب بن الشهيد، عن ابن أبي مليكة، قال ابن الزبير لابن جعفر  رضى الله عنهم أتذكر إذ تلقينا رسول الله صلى الله عليه وسلم أنا وأنت وابن عباس قال نعم، فحملنا وتركك‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     Ibn Az-Zubair said to Ibn Ja`far \"Do you remember when I, you and Ibn `Abbas went out to receive Allah's Apostle?\" Ibn Ja`far replied in the affirmative. Ibn Az-Zubair added, \"And Allah's Apostle made us (i.e. I and Ibn `Abbas) ride along with him and left you.\"",
      "chain": [
        "30145",
        "20304",
        "20225",
        "11275",
        "11090"
      ]
    },
    {
      "hadith_no": "4578",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن أبي الأسود، حدثنا حميد بن الأسود، ويزيد بن زريع، قالا حدثنا حبيب بن الشهيد، عن ابن أبي مليكة، قال قال ابن الزبير قلت لعثمان هذه الآية التي في البقرة ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ إلى قوله ‏{‏غير إخراج‏}‏ قد نسختها الأخرى، فلم تكتبها قال تدعها‏.‏ يا ابن أخي لا أغير شيئا منه من مكانه‏.‏ قال حميد أو نحو هذا‏.‏",
      "text_en": " Narrated Ibn Az-Zubair:                     I said to `Uthman, \"This Verse which is in Surat-al-Baqara: \"Those of you who die and leave widows behind...without turning them out.\" has been abrogated by another Verse. Why then do you write it (in the Qur'an)?\" `Uthman said. \"Leave it (where it is), O the son of my brother, for I will not shift anything of it (i.e. the Qur'an) from its original position.\"",
      "chain": [
        "30145",
        "20225",
        "20304",
        "11275",
        "11090",
        "106"
      ]
    },
    {
      "hadith_no": "5530",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثني عبد الله بن أبي الأسود، حدثنا قريش بن أنس، عن حبيب بن الشهيد، قال أمرني ابن سيرين أن أسأل الحسن، ممن سمع حديث العقيقة، فسألته فقال من سمرة بن جندب‏.‏",
      "text_en": " Narrated Habib bin Ash-Shahid:                     Ibn Seereen told me to ask Al-Hassan from whom he had heard the narration of 'Aqiqa. I asked him and he said, \"From Samura bin Jundab.\"",
      "chain": [
        "30145",
        "20273",
        "11275"
      ]
    },
    {
      "hadith_no": "396",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو أسامة، عن حبيب بن الشهيد، قال سمعت عطاء، يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا صلاة إلا بقراءة ‏\"‏ ‏.‏ قال أبو هريرة فما أعلن رسول الله صلى الله عليه وسلم أعلناه لكم وما أخفاه أخفيناه لكم ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: One is not credited with having observed the prayer without the recitation (of al-Fatiha). So said Abu Huraira: (The prayer in which) the Messenger of Allah (may peace be upon him) recited in a loud voice, we also recited that loudly for you (and the prayer in which) he recited inwardly we also recited inwardly for you (to give you a practical example of the prayer of the Holy Prophet).",
      "chain": [
        "30212",
        "20318",
        "11275",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "2258",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة السامي، حدثنا غندر، حدثنا شعبة، عن حبيب بن الشهيد، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم صلى على قبر ‏.‏",
      "text_en": " Anas reported that the Apostle of Allah (may peace be upon him) observed prayer on the grave.",
      "chain": [
        "20278",
        "20020",
        "11275",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3055",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أمية بن بسطام العيشي، حدثنا يزيد، - يعني ابن زريع - حدثنا حبيب، بن الشهيد عن بكر بن عبد الله، حدثنا أنس، رضى الله عنه أنه رأى النبي صلى الله عليه وسلم جمع بينهما بين الحج والعمرة قال فسألت ابن عمر فقال أهللنا بالحج ‏.‏ فرجعت إلى أنس فأخبرته ما قال ابن عمر فقال كأنما كنا صبيانا ‏.‏",
      "text_en": " Bakr b. 'Abdullah reported:                      Anas (Allah be pleased with him) had narrated to us that he saw Allah's Apostle (may peace be upon him) combining Hajj and 'Umra. He (Bakr) said: I asked (about it) from Ibn 'Umar, whereupon he said: We entered into the state of Ihram for Hajj (only). I came to Anas and told him what Ibn Umar had said, whereupon he remarked: (You are treating us) as if we were children.",
      "chain": [
        "30124",
        "20304",
        "11275",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "6419",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن حبيب بن الشهيد، عن عبد الله بن مليكة، قال عبد الله بن جعفر لابن الزبير أتذكر إذ تلقينا رسول الله صلى الله عليه وسلم أنا وأنت وابن عباس قال نعم فحملنا وتركك ‏.‏",
      "text_en": " Abdullah b. Abu Mulaika reported that Abdullah b. Jafar said to Ibn Zubair:                      Do you remember (the occasion) when we three (i. e. I, you and lbn 'Abbas) met Allah's Messenger (may peace be upon him) and he mounted us (on his camel) but left you? He said: Yes.",
      "chain": [
        "30201",
        "20208",
        "11275"
      ]
    },
    {
      "hadith_no": "1843",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب بن الشهيد، عن ميمون بن مهران، عن يزيد بن الأصم ابن أخي، ميمونة عن ميمونة، قالت تزوجني رسول الله صلى الله عليه وسلم ونحن حلالان بسرف ‏.‏",
      "text_en": " Yazid bin Al Asamm, Maimunah’s nephew said on Maimunah’s authority The Apostle of Allaah(ﷺ) married me when we were not in the sacred state at Sarif.",
      "chain": [
        "20040",
        "20022",
        "11275",
        "11012",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فوضعها معه في القصعة وقال ‏\"‏ كل ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) took a man who was suffering from tubercular leprosy by the hand; he then put it along with his own hand in the dish and said: Eat with confidence in Allah and trust in Him.",
      "chain": [
        "30203",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4975",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن أيوب، وحبيب بن الشهيد، وهشام، عن محمد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم عبدي وأمتي ولا يقولن المملوك ربي وربتي وليقل المالك فتاى وفتاتي وليقل المملوك سيدي وسيدتي فإنكم المملوكون والرب الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: None of you must say: \"My slave\" (abdi) and \"My slave-woman\" (amati), and a slave must not say: \"My lord\" (rabbi or rabbati). The master (of a slave) should say: \"My young man\" (fataya) and \"My young woman\" (fatati), and a slave should say \"My master\" (sayyidi) and \"My mistress\" (sayyidati), for you are all (Allah's slave and the Lord is Allah, Most High.",
      "chain": [
        "20040",
        "20022",
        "11015",
        "11275",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5229",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب بن الشهيد، عن أبي مجلز، قال خرج معاوية على ابن الزبير وابن عامر فقام ابن عامر وجلس ابن الزبير فقال معاوية لابن عامر اجلس فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أحب أن يمثل له الرجال قياما فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     AbuMijlaz said: Mu'awiyah went out to Ibn az-Zubayr and Ibn Amir. Ibn Amir got up and Ibn az-Zubayr remained sitting. Mu'awiyah said to Ibn Amir: Sit down, for I heard the Messenger of Allah (ﷺ) say: Let him who likes people to stand up before him prepare his place in Hell.",
      "chain": [
        "20040",
        "20022",
        "11275",
        "11313"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن عبد الله الأنصاري، عن حبيب بن الشهيد، عن ميمون بن مهران، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وهو صائم ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet was cupped while he was fasting.\"",
      "chain": [
        "20280",
        "11275",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "1817",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، وإبراهيم بن يعقوب، قالا حدثنا يونس بن محمد، حدثنا المفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فأدخله معه في القصعة ثم قال ‏\"‏ كل بسم الله ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يونس بن محمد عن المفضل بن فضالة ‏.‏ والمفضل بن فضالة هذا شيخ بصري والمفضل بن فضالة شيخ آخر مصري أوثق من هذا وأشهر ‏.‏ وقد روى شعبة هذا الحديث عن حبيب بن الشهيد عن ابن بريدة أن ابن عمر أخذ بيد مجذوم وحديث شعبة أثبت عندي وأصح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"The Messenger of Allah (ﷺ) took the hand of a leper and put it in the Qas'ah. Then he said: 'Eat in Allah's Name, trusting in Allah and relying upon Him.'\"[Abu 'Eisa said:] This is a Gharib Hadith, we do not know of it except through the report of Yunus bin Muhammad, from Al-Mufaddal bin Fadalah, a Shaikh from Al-Basrah. There is another Shaikh from Al-Basrah named Al-Mufaddal bin Fadalah, who is more reliable han this one and more popular. Shu'bah reported this Hadith from Habib bin Ash-Shahid, from Ibn Buraidah: \"That Ibn 'Umar took the hand of a leper\" and the narration of Shu'bah is more appropriate to me and more correct.",
      "chain": [
        "30296",
        "38088",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2703",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المثنى، وإبراهيم بن يعقوب، قالا حدثنا روح بن عبادة، عن حبيب بن الشهيد، عن الحسن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسلم الراكب على الماشي والماشي على القاعد والقليل على الكثير ‏\"‏ ‏.‏ وزاد ابن المثنى في حديثه ‏\"‏ ويسلم الصغير على الكبير ‏\"‏ ‏.‏ وفي الباب عن عبد الرحمن بن شبل وفضالة بن عبيد وجابر ‏.‏ قال أبو عيسى هذا حديث قد روي من غير وجه عن أبي هريرة ‏.‏ وقال أيوب السختياني ويونس بن عبيد وعلي بن زيد إن الحسن لم يسمع من أبي هريرة ‏.‏",
      "text_en": " Narrated Al-Hasan:                     from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"Ibn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"",
      "chain": [
        "30170",
        "38088",
        "20229",
        "11275",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "2979",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا قبيصة، حدثنا سفيان، عن حبيب بن الشهيد، عن أبي مجلز، قال خرج معاوية فقام عبد الله بن الزبير وابن صفوان حين رأوه ‏.‏ فقال اجلسا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سره أن يتمثل له الرجال قياما فليتبوأ مقعده من النار ‏\"‏ ‏.‏ وفي الباب عن أبي أمامة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Miljaz:                     that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"",
      "chain": [
        "30277",
        "20351",
        "20012",
        "11275",
        "11313"
      ]
    },
    {
      "hadith_no": "2980",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا أبو أسامة، عن حبيب بن الشهيد، عن أبي مجلز، عن معاوية، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30480",
        "20318",
        "11275",
        "11313",
        "27"
      ]
    },
    {
      "hadith_no": "4221",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا قريش بن أنس، عن حبيب بن الشهيد، قال لي محمد بن سيرين سل الحسن ممن سمع حديثه، في العقيقة ‏.‏ فسألته عن ذلك، فقال سمعته من، سمرة ‏.‏",
      "text_en": " It was narrated from Habib bin Ash-Shahid:                     \"Muhammad bin Sirin said to me: 'Ask Al-Hasan (Al-Basri) from whom he heard this Hadith about the 'Aqiqah.' I asked him about that and he said: 'I heard it from Samurh.\"'",
      "chain": [
        "30524",
        "20273",
        "11275",
        "11035"
      ]
    },
    {
      "hadith_no": "1598",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، ومحمد بن يحيى، قالا حدثنا أحمد بن حنبل، حدثنا غندر، عن شعبة، عن حبيب بن الشهيد، عن ثابت، عن أنس، أن النبي  صلى الله عليه وسلم  صلى على قبر بعد ما قبر ‏.‏",
      "text_en": " It wasnarrated from Anas that the Prophet (ﷺ) offered the funeralprayerat a grave after the burial.",
      "chain": [
        "30437",
        "11222",
        "30007",
        "20278",
        "20020",
        "11275",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3671",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، ومجاهد بن موسى، ومحمد بن خلف العسقلاني، قالوا حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  أخذ بيد رجل مجذوم فأدخلها معه في القصعة ثم قال ‏\"‏ كل ثقة بالله وتوكلا على الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)took the hand of a leper and made him eat with him, and said:                     “Eat,with trust in Allah and reliance upon Allah.”",
      "chain": [
        "20436",
        "30521",
        "38502",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    }
  ],
  "total_hadiths": 19
}