{
  "id": "11276",
  "name": "Habib al-Ma'lm Abu Muhammad حبيب المعلم أبو محمد البصري",
  "full_name": "Habib al-Ma'lm Abu Muhammad حبيب المعلم أبو محمد البصري",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14466",
      "name": "Abu al-Mahzam أبو المهزم - يزيد بن سفيان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20284",
      "name": "Marhum bin 'Abdul 'Aziz bin Mahran مرحوم بن عبد العزيز بن مهران العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1653",
      "hadith_no": "1653",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن عمر البصري، حدثنا يزيد بن زريع، عن حبيب، عن عطاء، عن عروة، عن عائشة  رضى الله عنها  أن ناسا، طافوا بالبيت بعد صلاة الصبح، ثم قعدوا إلى المذكر، حتى إذا طلعت الشمس قاموا يصلون فقالت عائشة  رضى الله عنها  قعدوا حتى إذا كانت الساعة التي تكره فيها الصلاة قاموا يصلون‏.‏",
      "text_en": " Narrated `Urwa from Aisha:                     Some people performed Tawaf (of the Ka`ba) after the morning prayer and then sat to listen to a preacher till sunrise, and then they stood up for the prayer. Then Aisha commented, \"Those people kept on sitting till it was the time in which the prayer is disliked and after that they stood up for the prayer.\"",
      "usc_msa_ref": "694",
      "chain": [
        "30130",
        "20304",
        "11276",
        "11029",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1677",
      "hadith_no": "1677",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب،‏.‏ قال وقال لي خليفة حدثنا عبد الوهاب، حدثنا حبيب المعلم، عن عطاء، عن جابر بن عبد الله  رضى الله عنهما  قال أهل النبي صلى الله عليه وسلم هو وأصحابه بالحج، وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وقدم علي من اليمن، ومعه هدى فقال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ فأمر النبي صلى الله عليه وسلم أصحابه أن يجعلوها عمرة، ويطوفوا، ثم يقصروا ويحلوا، إلا من كان معه الهدى، فقالوا ننطلق إلى منى، وذكر أحدنا يقطر، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وحاضت عائشة  رضى الله عنها  فنسكت المناسك كلها، غير أنها لم تطف بالبيت، فلما طهرت طافت بالبيت‏.‏ قالت يا رسول الله تنطلقون بحجة وعمرة، وأنطلق بحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and his companions assumed Ihram for Hajj and none except the Prophet (p.b.u.h) and Talha had the Hadi (sacrifice) with them. `Ali arrived from Yemen and had a Hadi with him. `Ali said, \"I have assumed Ihram for what the Prophet has done.\" The Prophet ordered his companions to perform the `Umra with the lhram which they had assumed, and after finishing Tawaf (of Ka`ba, Safa and Marwa) to cut short their hair, and to finish their lhram except those who had Hadi with them. They (the people) said, \"How can we proceed to Mina (for Hajj) after having sexual relations with our wives?\" When that news reached the Prophet he said, \"If I had formerly known what I came to know lately, I would not have brought the Hadi with me. Had there been no Hadi with me, I would have finished the state of lhram.\" `Aisha got her menses, so she performed all the ceremonies of Hajj except Tawaf of the Ka`ba, and when she got clean (from her menses), she performed Tawaf of the Ka`ba. She said, \"O Allah's Apostle! (All of you) are returning with the Hajj and `Umra, but I am returning after performing Hajj only.\" So the Prophet ordered `Abdur-Rahman bin Abu Bakr to accompany her to Tan`im and thus she performed the `Umra after the Hajj.",
      "usc_msa_ref": "713",
      "chain": [
        "30170",
        "30132",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1813",
      "hadith_no": "1813",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب بن عبد المجيد، عن حبيب المعلم، عن عطاء، حدثني جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم أهل وأصحابه بالحج وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وكان علي قدم من اليمن، ومعه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم‏.‏ وإن النبي صلى الله عليه وسلم أذن لأصحابه أن يجعلوها عمرة، يطوفوا بالبيت، ثم يقصروا ويحلوا، إلا من معه الهدى، فقالوا ننطلق إلى منى وذكر أحدنا يقطر فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وأن عائشة حاضت فنسكت المناسك كلها، غير أنها لم تطف بالبيت قال فلما طهرت وطافت، قالت يا رسول الله أتنطلقون بعمرة وحجة، وأنطلق بالحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج في ذي الحجة، وأن سراقة بن مالك بن جعشم لقي النبي صلى الله عليه وسلم وهو بالعقبة، وهو يرميها، فقال ألكم هذه خاصة، يا رسول الله قال ‏\"‏ لا، بل للأبد ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and his companions assumed Ihram for Hajj and none except the Prophet and Talha had the Hadi with them. `Ali had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have assumed Ihram with an intention like that of Allah's Apostle has assumed it.\" The Prophet ordered his companions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the Ka`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the exception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private organs of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The Prophet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I did not have the Hadi with me I would have finished my Ihram.\" `Aisha got her menses and performed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her menses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Apostle! You (people) are returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur Rahman bin Abu Bakr to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the month of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet at Al-`Aqaba (Jamrat-ul 'Aqaba) while the latter was stoning it and said, \"O Allah's Apostle! Is this permissible only for you?\" The Prophet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before Hajj.\"",
      "usc_msa_ref": "13",
      "chain": [
        "30170",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1894",
      "hadith_no": "1894",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبدان، أخبرنا يزيد بن زريع، أخبرنا حبيب المعلم، عن عطاء، عن ابن عباس  رضى الله عنهما  قال لما رجع النبي صلى الله عليه وسلم من حجته قال لأم سنان الأنصارية ‏\"‏ ما منعك من الحج ‏\"‏‏.‏ قالت أبو فلان  تعني زوجها  كان له ناضحان، حج على أحدهما، والآخر يسقي أرضا لنا‏.‏ قال ‏\"‏ فإن عمرة في رمضان تقضي حجة معي ‏\"‏‏.‏ رواه ابن جريج عن عطاء سمعت ابن عباس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet returned after performing his Hajj, he asked Um Sinan Al-Ansari, \"What did forbid you to perform Hajj?\" She replied, \"Father of so-and-so (i.e. her husband) had two camels and he performed Hajj on one of them, and the second is used for the irrigation of our land.\" The Prophet said (to her), \"Perform `Umra in the month of Ramadan, (as it is equivalent to Hajj or Hajj with me (in reward).",
      "usc_msa_ref": "86",
      "chain": [
        "30349",
        "20304",
        "11276",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4521",
      "hadith_no": "4521",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، عن حبيب، عن سعيد بن جبير، عن ابن عباس، قال قال عمر  رضى الله عنه  أقرؤنا أبى، وأقضانا علي، وإنا لندع من قول أبى، وذاك أن أبيا يقول لا أدع شيئا سمعته من رسول الله صلى الله عليه وسلم وقد قال الله تعالى ‏{‏ما ننسخ من آية أو ننسأها‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar said, \"Our best Qur'an reciter is Ubai and our best judge is `Ali; and in spite of this, we leave some of the statements of Ubai because Ubai says, 'I do not leave anything that I have heard from Allah's Apostle while Allah: \"Whatever verse (Revelations) do We abrogate or cause to be forgotten but We bring a better one or similar to it.\" (2.106)",
      "usc_msa_ref": "8",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11276",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-4572",
      "hadith_no": "4572",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني أمية بن بسطام، حدثنا يزيد بن زريع، عن حبيب، عن ابن أبي مليكة، قال ابن الزبير قلت لعثمان بن عفان ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال قد نسختها الآية الأخرى فلم تكتبها أو تدعها قال يا ابن أخي، لا أغير شيئا منه من مكانه‏.‏",
      "text_en": " Narrated Ibn Az-Zubair:                     I said to `Uthman bin `Affan (while he was collecting the Qur'an) regarding the Verse:-- \"Those of you who die and leave wives ...\" (2.240) \"This Verse was abrogated by an other Verse. So why should you write it? (Or leave it in the Qur'an)?\" `Uthman said. \"O son of my brother! I will not shift anything of it from its place.\"",
      "usc_msa_ref": "53",
      "chain": [
        "30124",
        "20304",
        "11276",
        "11090",
        "106"
      ]
    },
    {
      "id": "sahih-bukhari-5161",
      "hadith_no": "5161",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لنا أحمد بن حنبل حدثنا يحيى بن سعيد، عن سفيان، حدثني حبيب، عن سعيد، عن ابن عباس، حرم من النسب سبع، ومن الصهر سبع‏.‏ ثم قرأ ‏{‏حرمت عليكم أمهاتكم‏}‏ الآية‏.‏ وجمع عبد الله بن جعفر بين ابنة علي وامرأة علي‏.‏ وقال ابن سيرين لا بأس به‏.‏ وكرهه الحسن مرة ثم قال لا بأس به‏.‏ وجمع الحسن بن الحسن بن علي بين ابنتى عم في ليلة، وكرهه جابر بن زيد للقطيعة، وليس فيه تحريم لقوله تعالى ‏{‏وأحل لكم ما وراء ذلكم‏}‏ وقال عكرمة عن ابن عباس إذا زنى بأخت امرأته لم تحرم عليه امرأته‏.‏ ويروى عن يحيى الكندي عن الشعبي وأبي جعفر، فيمن يلعب بالصبي إن أدخله فيه، فلا يتزوجن أمه، ويحيى هذا غير معروف، لم يتابع عليه‏.‏ وقال عكرمة عن ابن عباس إذا زنى بها لم تحرم عليه امرأته‏.‏ ويذكر عن أبي نصر أن ابن عباس حرمه‏.‏ وأبو نصر هذا لم يعرف بسماعه من ابن عباس‏.‏ ويروى عن عمران بن حصين وجابر بن زيد والحسن وبعض أهل العراق تحرم عليه‏.‏ وقال أبو هريرة لا تحرم حتى يلزق بالأرض يعني يجامع‏.‏ وجوزه ابن المسيب وعروة والزهري‏.‏ وقال الزهري قال علي لا تحرم‏.‏ وهذا مرسل‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20031",
        "20012",
        "11276",
        "11168"
      ]
    },
    {
      "id": "sahih-bukhari-6038",
      "hadith_no": "6038",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، وشعبة، قالا حدثنا حبيب، ح قال وحدثنا محمد بن كثير، أخبرنا سفيان، عن حبيب، عن أبي العباس، عن عبد الله بن عمرو، قال قال رجل للنبي صلى الله عليه وسلم أجاهد‏.‏ قال ‏\"‏ لك أبوان ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ففيهما فجاهد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     A man said to the Prophet, \"Shall I participate in Jihad?\" The Prophet said, \"Are your parents living?\" The man said, \"Yes.\" the Prophet said, \"Do Jihad for their benefit.\"",
      "usc_msa_ref": "3",
      "chain": [
        "30175",
        "20031",
        "20012",
        "20020",
        "11276",
        "28531",
        "20005",
        "11276",
        "11246",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-7315",
      "hadith_no": "7315",
      "source": "Sahih Bukhari",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا الحسن بن عمر، حدثنا يزيد، عن حبيب، عن عطاء، عن جابر بن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم فلبينا بالحج وقدمنا مكة لأربع خلون من ذي الحجة، فأمرنا النبي صلى الله عليه وسلم أن نطوف بالبيت وبالصفا والمروة، وأن نجعلها عمرة ولنحل، إلا من كان معه هدى قال ولم يكن مع أحد منا هدى غير النبي صلى الله عليه وسلم وطلحة، وجاء علي من اليمن معه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم فقالوا ننطلق إلى منى وذكر أحدنا يقطر قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لحللت ‏\"‏‏.‏ قال ولقيه سراقة وهو يرمي جمرة العقبة فقال يا رسول الله ألنا هذه خاصة قال ‏\"‏ لا بل لأبد ‏\"‏‏.‏ قال وكانت عائشة قدمت مكة وهى حائض، فأمرها النبي صلى الله عليه وسلم أن تنسك المناسك كلها، غير أنها لا تطوف ولا تصلي حتى تطهر، فلما نزلوا البطحاء قالت عائشة يا رسول الله أتنطلقون بحجة وعمرة وأنطلق بحجة‏.‏ قال ثم أمر عبد الرحمن بن أبي بكر الصديق أن ينطلق معها إلى التنعيم، فاعتمرت عمرة في ذي الحجة بعد أيام الحج‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     We were in the company of Allah's Apostle and we assumed the state of Ihram of Hajj and arrived at Mecca on the fourth of Dhul-Hijja. The Prophet ordered us to perform the Tawaf around the Ka`ba and (Sa`i) between As-Safa and Al-Marwa and use our lhram just for `Umra, and finish the state of Ihram unless we had our Hadi with us. None of us had the Hadi with him except the Prophet and Talha. `Ali came from Yemen and brought the Hadi with him. `Ali said, 'I had assumed the state of Ihram with the same intention as that with which Allah's Apostle had assumed it. The people said, \"How can we proceed to Mina and our male organs are dribbling?\" Allah's Apostle said, \"If I had formerly known what I came to know latterly, I would not have brought the Hadi, and had there been no Hadi with me, I would have finished my Ihram.\" Suraqa (bin Malik) met the Prophet while he was throwing pebbles at the Jamrat-Al-`Aqaba, and asked, \"O Allah's Apostle! Is this (permitted) for us only?\" The Prophet replied. \"No, it is forever\" `Aisha had arrived at Mecca while she was menstruating, therefore the Prophet ordered her to perform all the ceremonies of Hajj except the Tawaf around the Ka`ba, and not to perform her prayers unless and until she became clean . When they encamped at Al-Batha, `Aisha said, \"O Allah's Apostle! You are proceeding after performing both Hajj and `Umra while I am proceeding with Hajj only?\" So the Prophet ordered `Abdur-Rahman bin Abu Bakr As-Siddiq to go with her to at-Tan`im, and so she performed the `Umra in Dhul-Hijja after the days of the Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30130",
        "20304",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-1",
      "hadith_no": "1",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "‏\"‏ من حدث عني، بحديث يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ حدثنا أبو بكر بن أبي شيبة حدثنا وكيع عن شعبة عن الحكم عن عبد الرحمن بن أبي ليلى عن سمرة بن جندب ‏.‏ ح وحدثنا أبو بكر بن أبي شيبة أيضا حدثنا وكيع عن شعبة وسفيان عن حبيب عن ميمون بن أبي شبيب عن المغيرة بن شعبة قالا قال رسول الله صلى الله عليه وسلم ذلك ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11069",
        "11196",
        "394",
        "20032",
        "11276"
      ]
    },
    {
      "id": "sahih-muslim-396-4",
      "hadith_no": "396",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد، - يعني ابن زريع - عن حبيب المعلم، عن عطاء، قال قال أبو هريرة في كل صلاة قراءة فما أسمعنا النبي صلى الله عليه وسلم أسمعناكم وما أخفى منا أخفيناه منكم ومن قرأ بأم الكتاب فقد أجزأت عنه ومن زاد فهو أفضل ‏.‏",
      "text_en": " 'Ata' reported it on the authority of Abu Huraira who said:                      Recitation (of Surat al-Fatiha) in every (rak'ah) of prayer in essential. (The recitation) that we listened to from the Apostle of Allah (may peace be upon him) we made you listen to it. And that which he recited inwardly to us, we recited it inwardly for you. And he who recites Umm al-Qur'an, it is enough for him (to complete the prayer), and he who adds to it (recites some other verses of the Holy Qur'an along with Surat al-Fatiha), it is preferable for him.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11276",
        "11029"
      ]
    },
    {
      "id": "sahih-muslim-2149",
      "hadith_no": "2149",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سفيان، عن حبيب، عن طاوس، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم حين كسفت الشمس ثمان ركعات في أربع سجدات ‏.‏ وعن علي مثل ذلك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      When there was a solar eclipse the Messenger of Allah (way peace be upon him) observed eight ruku's and four prostrations (in two rak'ahs). This has been narrated by 'Ali also.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "20012",
        "11276",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2150",
      "hadith_no": "2150",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا محمد بن المثنى، وأبو بكر بن خلاد كلاهما عن يحيى القطان، - قال ابن المثنى حدثنا يحيى، - عن سفيان، قال حدثنا حبيب، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه صلى في كسوف قرأ ثم ركع ثم قرأ ثم ركع ثم قرأ ثم ركع ثم قرأ ثم ركع ثم سجد ‏.‏ قال والأخرى مثلها ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Apostle of Allah (may peace be upon him) observed prayer while it was (solar) eclipse. He recited (the Qur'an in qiyam) and then bowed. He again recited and again bowed. He again recited and again bowed and again recited and again bowed, and then prostrated; and the second (rak'ah) was like this.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "11449",
        "20012",
        "11276",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2793",
      "hadith_no": "2793",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثني أبي، حدثنا شعبة، عن حبيب، سمع أبا العباس، سمع عبد الله بن عمرو، - رضى الله عنهما - قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو إنك لتصوم الدهر وتقوم الليل وإنك إذا فعلت ذلك هجمت له العين ونهكت لا صام من صام الأبد صوم ثلاثة أيام من الشهر صوم الشهر كله ‏\"‏ ‏.‏ قلت فإني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ فصم صوم داود كان يصوم يوما ويفطر يوما ولا يفر إذا لاقى ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Amr (Allah be pleased with both of them) reported:                      The Messenger of Allah (may peace be upon him) said to me: 'Abdullah b. Amr, you fast continuously and stand in prayer for the whole of night. If you do like that, your eyes would be highly strained and would sink and lose sight. There is no (reward for) fasting (for him) who fasts perpetually. Fasting for three days during the month is like fasting, the whole of the month. I said: I am capable of doing more than this, whereupon he said: Observe the fast of David. He used to fast one day and break (the other) day. And he did not turn back in the encounter.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-3098",
      "hadith_no": "3098",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، حدثنا يزيد، - يعني ابن زريع - حدثنا حبيب، المعلم عن عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لامرأة من الأنصار يقال لها أم سنان ‏\"‏ ما منعك أن تكوني حججت معنا ‏\"‏ ‏.‏ قالت ناضحان كانا لأبي فلان - زوجها - حج هو وابنه على أحدهما وكان الآخر يسقي عليه غلامنا ‏.‏ قال ‏\"‏ فعمرة في رمضان تقضي حجة ‏.‏ أو حجة معي ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbis reported that Allah's Apostle (may peace be upon him) said to a woman of the Ansar who was called Umm Sinan:                      What has prevented you that you did not perform Hajj with us? She said: The father of so and so (i. e. her husband) had only two camels. One of them had been taken away by him (my busbard) and his son for Hajj, whereas the other one is used by our boy to carry water. Upon this he (the Holy Prophet) said: Umra during the month of Rawadin would suffice for Hajj or Hajj along with me.",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20304",
        "11276",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-4156",
      "hadith_no": "4156",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن حبيب، أنه سمع أبا المنهال، يقول سألت البراء بن عازب عن الصرف، فقال سل زيد بن أرقم فهو أعلم ‏.‏ فسألت زيدا فقال سل البراء فإنه أعلم ثم قالا نهى رسول الله صلى الله عليه وسلم عن بيع الورق بالذهب دينا.",
      "text_en": " Habib reported that he heard Abu Minhal as saying:                      I asked al-Bara' b. Azib about the exchange of (gold for silver or vice versa), whereupon he said: you better ask Zaid b. Arqam for he knows more than I. So I asked Zaid but he said: You better ask al-Bara' for he knows more than I. Then both of them said: Allah's Messenger (may peace be upon him) forbade the sale of silver for gold when payment is to be made in future.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "11290",
        "400"
      ]
    },
    {
      "id": "sahih-muslim-5277",
      "hadith_no": "5277",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن حبيب، عن سعيد بن جبير، عن ابن عباس، قال نهى النبي صلى الله عليه وسلم أن يخلط التمر والزبيب جميعا وأن يخلط البسر والتمر جميعا وكتب إلى أهل جرش ينهاهم عن خليط التمر والزبيب ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Apostle (may peace be upon him) forbade the mixing of dates and grapes together, and mixing of unripe dates and ripe dates together (for preparing Nabidh), and he wrote to the people of Jurash (in Yemen) forbidding them to prepare the mixture of dates and grapes. This hadith has been narrated through another chain of transmitters with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11276",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5294",
      "hadith_no": "5294",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن حبيب، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمزفت والنقير ‏.‏",
      "text_en": " Ibn 'Abbas reported that there came to Allah's Messenger (may peace be upon him) a group of people from the tribe of 'Abd al-Qais. Allah's Messenger (may peace be upon him) said to them:                      I forbid you to prepare Nabidh in gourd, in pitcher besmeared with pitch, in hollow stump and in waterskin (meant for preserving wine). In the hadith transmitted on the authority of Hammad the word.\" gourd\" has been used in place of\" waterskin\".",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11276",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5910",
      "hadith_no": "5910",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن شعبة، عن حبيب، قال كنا بالمدينة فبلغني أن الطاعون قد وقع بالكوفة فقال لي عطاء بن يسار وغيره إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كنت بأرض فوقع بها فلا تخرج منها وإذا بلغك أنه بأرض فلا تدخلها ‏\"‏ ‏.‏ قال قلت عمن قالوا عن عامر بن سعد يحدث به ‏.‏ قال فأتيته فقالوا غائب - قال - فلقيت أخاه إبراهيم بن سعد فسألته فقال شهدت أسامة يحدث سعدا قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن هذا الوجع رجز أو عذاب أو بقية عذاب عذب به أناس من قبلكم فإذا كان بأرض وأنتم بها فلا تخرجوا منها وإذا بلغكم أنه بأرض فلا تدخلوها ‏\"‏ ‏.‏ قال حبيب فقلت لإبراهيم آنت سمعت أسامة يحدث سعدا وهو لا ينكر قال نعم ‏.‏",
      "text_en": " Shu'ba reported from Habib:                      While we were in Medina we heard of plague having broken out in Kufa. 'Ata b. Yasir and others said to me that Allah's Messenger (may peace be upon him) had said. If you are in a land where it (this scourge) has broken out, don't get out of it, and if you were to know that it had broken (in another land, then don't enter it. I said to him: From whom (did you hear it)? They said: 'Amir b. Sa'd has narrated it. So I came to him. They said that he was not present there. So I met his brother Ibrahim b. Sa'd and asked him. He said: I bear testimony to the fact that Usama narrated it to Sa'd saying: I heard Allah's Messenger (may peace be upon him) as saying that it is a God-sent punishment from the calamity or from the remnant of the calamity with which people were afflicted before you. So when it is in a land and you are there, don't get out of it, and if (this news reaches you) that it has broken out in a land, then don't enter therein. Habib said: I said to Ibrahim: Did you hear Usama narrating it to Sa'd and he was not denying it. He said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "20020",
        "11276",
        "11020"
      ]
    },
    {
      "id": "sahih-muslim-5912",
      "hadith_no": "5912",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن حبيب، عن إبراهيم، بن سعد عن سعد بن مالك، وخزيمة بن ثابت، وأسامة بن زيد، قالوا قال رسول الله صلى الله عليه وسلم بمعنى حديث شعبة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sa'd b. Malik, Khuzaima b. Thabit and Usama b. Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11276",
        "20150",
        "410",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-5913",
      "hadith_no": "5913",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، كلاهما عن جرير، عن الأعمش، عن حبيب، عن إبراهيم بن سعد بن أبي وقاص، قال كان أسامة بن زيد وسعد جالسين يتحدثان فقالا قال رسول الله صلى الله عليه وسلم بنحو حديثهم ‏.‏",
      "text_en": " Ibrahim b. Sa'd b. Abu Waqqas reported:                      Usama b. Zaid and Sa'd had been sitting and they had been conversing and they said this: This hadith has been transmitted by Ibrahim b. Sa'd b. Malik on the authority of his father.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30123",
        "20028",
        "11060",
        "11276",
        "10557",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-6668",
      "hadith_no": "6668",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن سفيان، عن  حبيب، ح وحدثنا محمد بن المثنى، حدثنا يحيى، - يعني ابن سعيد القطان - عن سفيان، وشعبة قالا حدثنا حبيب، عن أبي العباس، عن عبد الله بن عمرو، قال جاء رجل إلى النبي صلى الله عليه وسلم يستأذنه في الجهاد فقال ‏\"‏ أحى والداك ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ ففيهما فجاهد ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Amr reported that a person came to Allah's Apostle (may peace be upon him) and sought permission (to participate) in Jihad, whereupon he (the Holy Prophet) said:                      Are your parents living? He said: Yes. Thereupon he (the Holy Prophet) said: You should put in your best efforts (in their) service.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20012",
        "11276",
        "30170",
        "20031",
        "11276",
        "11246",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-6669",
      "hadith_no": "6669",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حبيب، سمعت أبا العباس، سمعت عبد الله بن عمرو بن العاص، يقول جاء رجل إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثله ‏.‏ قال مسلم أبو العباس اسمه السائب بن فروخ المكي ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Habib with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-7697",
      "hadith_no": "7697",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، جميعا عن ابن مهدي، - واللفظ لابن المثنى قالا حدثنا عبد الرحمن، عن سفيان، عن حبيب، عن مجاهد، عن أبي معمر، قال قام رجل يثني على أمير من الأمراء فجعل المقداد يحثي عليه التراب وقال أمرنا رسول الله صلى الله عليه وسلم أن نحثي في وجوه المداحين التراب ‏.‏",
      "text_en": " Abu Ma'mar reported that a person lauded a ruler amongst the rulers and Miqdad began to throw dust upon him and he said:                      Allah's Messenger (may peace be upon him) commanded us that we should throw dust upon the faces of those who shower too much praise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "20033",
        "20005",
        "11276",
        "11028",
        "11360"
      ]
    },
    {
      "id": "sunan-abi-daud-179",
      "hadith_no": "179",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، حدثنا الأعمش، عن حبيب، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قبل امرأة من نسائه ثم خرج إلى الصلاة ولم يتوضأ ‏.‏ قال عروة فقلت لها من هي إلا أنت فضحكت ‏.‏ قال أبو داود هكذا رواه زائدة وعبد الحميد الحماني عن سليمان الأعمش ‏.‏",
      "text_en": " 'Aishah reported:                      The Prophet (ﷺ) kissed one of his wives and went out for saying prayer. He did not perform ablution. 'Urwah said: I said to her: Who is she except you! Thereupon she laughed. Abu Dawud said: The same version has been reported through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "11060",
        "11276",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-797",
      "hadith_no": "797",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن قيس بن سعد، وعمارة بن ميمون، وحبيب، عن عطاء بن أبي رباح، أن أبا هريرة، قال في كل صلاة يقرأ فما أسمعنا رسول الله صلى الله عليه وسلم أسمعناكم وما أخفى علينا أخفينا عليكم ‏.‏",
      "text_en": " Abu Hurairah said:                      In every prayer there is a recitation. We make you listen what the Messenger of Allah(ﷺ) made us listen, and we keep hidden from you what he kept hidden from us.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "172",
        "11276",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1113",
      "hadith_no": "1113",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، وأبو كامل قالا حدثنا يزيد، عن حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ يحضر الجمعة ثلاثة نفر رجل حضرها يلغو وهو حظه منها ورجل حضرها يدعو فهو رجل دعا الله عز وجل إن شاء أعطاه وإن شاء منعه ورجل حضرها بإنصات وسكوت ولم يتخط رقبة مسلم ولم يؤذ أحدا فهي كفارة إلى الجمعة التي تليها وزيادة ثلاثة أيام وذلك بأن الله عز وجل يقول ‏{‏ من جاء بالحسنة فله عشر أمثالها ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Three types of people attend Friday prayer; One is present in a frivolous way and that is all he gets from it; another comes with a supplication, Allah may grant or refuse his request as He wishes; another is present silently and quietly with-out stepping over a Muslim or annoying anyone, and that is an atonement for his sins till the next Friday and three days more, the reason being that Allah, the Exalted, says: \"He who does a good deed will have ten times as much\" (vi.160).",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30559",
        "20304",
        "11276",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-1136",
      "hadith_no": "1136",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن أيوب، ويونس، وحبيب، ويحيى بن عتيق، وهشام، - في آخرين - عن محمد، أن أم عطية، قالت أمرنا رسول الله صلى الله عليه وسلم أن نخرج ذوات الخدور يوم العيد ‏.‏ قيل فالحيض قال ‏\"‏ ليشهدن الخير ودعوة المسلمين ‏\"‏ ‏.‏ قال فقالت امرأة يا رسول الله إن لم يكن لإحداهن ثوب كيف تصنع قال ‏\"‏ تلبسها صاحبتها طائفة من ثوبها ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyyah said:                      The Messenger of Allah (ﷺ) commanded us to bring out the secluded women on the day of 'Id (festival). He was asked: What about the menstruous women ? He said: They should be present at the place of virtue and the supplications of the Muslims. A woman said: Messenger of Allah, what should we do it one of us does not possess an outer garment ? He replied: Let her friend lend a part of her garment.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11015",
        "20475",
        "11276",
        "11315",
        "11035",
        "71"
      ]
    },
    {
      "id": "sunan-abi-daud-1789",
      "hadith_no": "1789",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الوهاب الثقفي، حدثنا حبيب، - يعني المعلم - عن عطاء، حدثني جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أهل هو وأصحابه بالحج وليس مع أحد منهم يومئذ هدى إلا النبي صلى الله عليه وسلم وطلحة وكان علي - رضى الله عنه - قدم من اليمن ومعه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم وأن النبي صلى الله عليه وسلم أمر أصحابه أن يجعلوها عمرة يطوفوا ثم يقصروا ويحلوا إلا من كان معه الهدى فقالوا أننطلق إلى منى وذكورنا تقطر فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لو أني استقبلت من أمري ما استدبرت ما أهديت ولولا أن معي الهدى لأحللت ‏\"‏ ‏.‏",
      "text_en": " Jabir bin Abdullah said The Apostle of Allaah(ﷺ) and his companions raised their voices in talbiyah for Hajj. No one of them had brought the sacrificial animals with them except the Prophet(ﷺ) and Talhah. Ali (may Allaah be pleased with him) had returned from Yemen and had brought sacrificial animals with him. He said I raised my voice in talbiyah for which the Apostle of Allaah (ﷺ) raised his voice. The Prophet (ﷺ) commanded his companions to change it into ‘Umrah and clip their hair after running (between Al Safa’ and Al Marwah), and then take off their ihram except those who brought the sacrificial animals with them. They remarked should we go to Mina with our penises dripping with prostatic fluid? These remarks reached the Apostle of Allaah(ﷺ). Thereupon he said “had I known before hand about my affair what I have come to know later, I would not have brought sacrificial animals. Had I not brought sacrificial animals with me, I would have put off my ihram. “",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-1854",
      "hadith_no": "1854",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن حبيب المعلم، عن أبي المهزم، عن أبي هريرة، قال أصبنا صرما من جراد فكان رجل منا يضربه بسوطه وهو محرم فقيل له إن هذا لا يصلح فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ إنما هو من صيد البحر ‏\"‏ ‏.‏ سمعت أبا داود يقول أبو المهزم ضعيف والحديثان جميعا وهم ‏.‏",
      "text_en": " Abu Hurairah said, We found a swarm of Locusts. A man who was wearing ihram began to strike it with his whip. He was told that his action was not valid. The fact was mentioned to the Prophet (ﷺ); He said “That is counted along with the game of the sea.”I heard Abu Dawud say “The narrator Abu Al Muhzim is weak. Both these traditions are based on misunderstanding.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20258",
        "11276",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2052",
      "hadith_no": "2052",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، وأبو معمر قالا حدثنا عبد الوارث، عن حبيب، حدثني عمرو بن شعيب، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح الزاني المجلود إلا مثله ‏\"‏ ‏.‏ وقال أبو معمر حدثني حبيب المعلم عن عمرو بن شعيب ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The adulterer who has been flogged shall not marry save the one like him. AbuMa'mar said: Habib al-Mu'allim narrated (this tradition) to us on the authority of Amr ibn Shu'ayb.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30315",
        "20258",
        "11276",
        "19934",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2397",
      "hadith_no": "2397",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، عن سفيان، حدثني حبيب، عن عمارة، عن ابن المطوس، - قال فلقيت ابن المطوس فحدثني - عن أبيه، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم مثل حديث ابن كثير وسليمان ‏.‏ قال أبو داود واختلف على سفيان وشعبة عنهما ابن المطوس وأبو المطوس ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Hurairah through a different chain of narrators similar to the tradition narrated by Ibn Kathir and Sulaiman.Abu Dawud said:                      Sufyan and Shu'bah differed among themselves on the name of the narrator Ibn al-Mutawwas and Abu al-Mutawwas.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20031",
        "20012",
        "11276",
        "11379",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2398",
      "hadith_no": "2398",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن أيوب، وحبيب، وهشام، عن محمد بن سيرين، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني أكلت وشربت ناسيا وأنا صائم ‏.‏ فقال ‏\"‏ أطعمك الله وسقاك ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah, I ate and drank in forgetfulness when I was fasting. Hie said: Allah had fed you and given you drink.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11015",
        "11276",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2857",
      "hadith_no": "2857",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المنهال الضرير، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن أعرابيا، يقال له أبو ثعلبة قال يا رسول الله إن لي كلابا مكلبة فأفتني في صيدها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان لك كلاب مكلبة فكل مما أمسكن عليك ‏\"‏ ‏.‏ قال ذكيا أو غير ذكي قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن أكل منه قال ‏\"‏ وإن أكل منه ‏\"‏ ‏.‏ فقال يا رسول الله أفتني في قوسي ‏.‏ قال ‏\"‏ كل ما ردت عليك قوسك ‏\"‏ ‏.‏ قال ‏\"‏ ذكيا أو غير ذكي ‏\"‏ ‏.‏ قال وإن تغيب عني قال ‏\"‏ وإن تغيب عنك ما لم يصل أو تجد فيه أثرا غير سهمك ‏\"‏ ‏.‏ قال أفتني في آنية المجوس إن اضطررنا إليها ‏.‏ قال ‏\"‏ اغسلها وكل فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There was a bedouin called AbuTha'labah. He said: Messenger of Allah, I have trained dogs, so tell me your opinion about (eating) the animal they hunt. The Prophet (ﷺ) said: If you have trained dogs, then eat what they catch for you. He asked: Whether it is slaughtered or not? He replied: Yes. He asked: Does it apply even if it eats any of it? He replied: Even if it eats any of it. He again asked: Messenger of Allah, tell me your opinion about my bow (i.e. the game hunted by arrow). He said: Eat what your bow returns to you, whether it is slaughtered or not. He asked: If it goes out of my sight? He replied: Even if it goes out of your sight, provided it has no stench, or you find a mark on it other than the mark of your arrow. He asked: Tell me about the use of the vessels of the Magians when we are forced to use them. He replied: Wash them and eat in them.",
      "usc_msa_ref": "",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-2911",
      "hadith_no": "2911",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يتوارث أهل ملتين شتى ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: people of two different religions would not inherit from one another.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11276",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-3272",
      "hadith_no": "3272",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن سعيد بن المسيب، ‏:‏ أن أخوين، من الأنصار كان بينهما ميراث فسأل أحدهما صاحبه القسمة فقال ‏:‏ إن عدت تسألني عن القسمة فكل مال لي في رتاج الكعبة ‏.‏ فقال له عمر ‏:‏ إن الكعبة غنية عن مالك، كفر عن يمينك وكلم أخاك سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ لا يمين عليك، ولا نذر في معصية الرب وفي قطيعة الرحم وفيما لا تملك ‏\"‏ ‏.‏",
      "text_en": " Sa'id ibn al-Musayyab said:                      There were two brothers among the Ansar who shared an inheritance. When one of them asked the other for the portion due to him, he replied: If you ask me again for the portion due to you, all my property will be devoted to the decoration of the Ka'bah. Umar said to him: The Ka'bah does not need your property. Make atonement for your oath and speak to your brother. I heard the Messenger of Allah (ﷺ) say: An oath or vow to disobey the Lord, or to break ties of relationship or about something over which one has no control is not binding on you.",
      "usc_msa_ref": "",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "11002"
      ]
    },
    {
      "id": "sunan-abi-daud-3305",
      "hadith_no": "3305",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا حماد، قال أخبرنا حبيب المعلم، عن عطاء بن أبي رباح، عن جابر بن عبد الله، ‏:‏ أن رجلا، قام يوم الفتح فقال ‏:‏ يا رسول الله إني نذرت لله إن فتح الله عليك مكة أن أصلي في بيت المقدس ركعتين ‏.‏ قال ‏:‏ ‏\"‏ صل ها هنا ‏\"‏ ثم أعاد عليه فقال ‏:‏ ‏\"‏ صل ها هنا ‏\"‏ ثم أعاد عليه فقال ‏:‏ ‏\"‏ شأنك إذا ‏\"‏ ‏.‏ قال أبو داود ‏:‏ روي نحوه عن عبد الرحمن بن عوف عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     A man stood on the day of Conquest (of Mecca) and said: Messenger of Allah, I have vowed to Allah that if He grants conquest of Mecca at your hands, I shall pray two rak'ahs in Jerusalem.  He replied: Pray here. He repeated (his statement) to him and he said: Pray here. He again repeated (his statement) to him. He (the Prophet) replied: Pursue your own course, then.Abu Dawud said: A similar tradition has been narrated by 'Abd al-Rahman b. 'Awf from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11276",
        "11029"
      ]
    },
    {
      "id": "sunan-abi-daud-3444",
      "hadith_no": "3444",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن أيوب، وهشام، وحبيب، عن محمد بن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من اشترى شاة مصراة فهو بالخيار ثلاثة أيام إن شاء ردها وصاعا من طعام لا سمراء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) as saying: If anyone buys sheep whose udders have been tied up, he has option for three days: he may return it if he desires with a sa' of any grain, not (necessarily) wheat.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11015",
        "11065",
        "11276",
        "11035",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3530",
      "hadith_no": "3530",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن لي مالا وولدا وإن والدي يجتاح مالي ‏.‏ قال ‏\"‏ أنت ومالك لوالدك إن أولادكم من أطيب كسبكم فكلوا من كسب أولادكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah, I have property and children, and my father finishes my property. He replied; You and your property belong to your father; your children come from the pleasantest of what you earn; so enjoy from the earning of your children.",
      "usc_msa_ref": "",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-3546",
      "hadith_no": "3546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن داود بن أبي هند، وحبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة أمر في مالها إذا ملك زوجها عصمتها ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) as saying: It is not permissible for a woman to present a gift from the property which she has in her possession when her husband owns her chastity.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11585",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4909",
      "hadith_no": "4909",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي، حدثنا سفيان، عن حبيب، عن عطاء، عن عائشة، رضى الله عنها قالت سرق لها شىء فجعلت تدعو عليه فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبخي عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Something of her was stolen, and she began to curse him (i.e. the thief). The Messenger of Allah (ﷺ) said to her: Do not lessen his sin.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20012",
        "11276",
        "11029",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-5189",
      "hadith_no": "5189",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب، وهشام، عن محمد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ رسول الرجل إلى الرجل إذنه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A man's messenger sent to another indicates his permission to enter.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11276",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-923",
      "hadith_no": "923",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن هشام بن عروة، عن أبيه، عن عائشة، قالت إنما نزل رسول الله صلى الله عليه وسلم الأبطح لأنه كان أسمح لخروجه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا ابن أبي عمر، حدثنا سفيان، عن هشام بن عروة، نحوه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah only camped at Al-Abtah because it was easier for his departure.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20304",
        "11276",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2116",
      "hadith_no": "2116",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، وأبو نعيم عن سفيان، عن حبيب، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20348",
        "20012",
        "11276"
      ]
    },
    {
      "id": "sunan-an-nasai-74",
      "hadith_no": "74",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، ثم ذكر كلمة معناها حدثنا شعبة، عن حبيب، قال سمعت عباد بن تميم، يحدث عن جدتي، وهي أم عمارة بنت كعب أن النبي صلى الله عليه وسلم توضأ فأتي بماء في إناء قدر ثلثى المد ‏.‏ قال شعبة فأحفظ أنه غسل ذراعيه وجعل يدلكهما ويمسح أذنيه باطنهما ولا أحفظ أنه مسح ظاهرهما ‏.‏",
      "text_en": " It was narrated from Shu'bah that Habib said:                      \"I heard 'Abbad bin Tamim narrate from my grandmother - who was Umm 'Umarah bint Ka'b - that the Prophet (ﷺ) performed Wudu', and he was brought a vessel in which there were two-thirds of a Mudd.\" Shu'bah said: \"I remember that he washed his forearms and started rubbing them, and he wiped the inside of his ear, but I do not remember whether he wiped the outside of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20020",
        "11276",
        "639"
      ]
    },
    {
      "id": "sunan-an-nasai-632",
      "hadith_no": "632",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، قال حدثنا حبان بن هلال، حدثنا حبيب، عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، قال أدلج رسول الله صلى الله عليه وسلم ثم عرس فلم يستيقظ حتى طلعت الشمس أو بعضها فلم يصل حتى ارتفعت الشمس فصلى وهي صلاة الوسطى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah (ﷺ) set out at nightfall, then stopped to camp at the end of the night, and he did not wake up until the sun had risen or had partly risen. He did not pray until the sun had risen (fully), then he prayed, and that was the 'middle prayer' (Salat Al-Wusta).\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "20218",
        "11276",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1667",
      "hadith_no": "1667",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن منصور، عن حبيب، عن طاوس، قال قال ابن عمر سأل رجل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال ‏\"‏ مثنى مثنى فإذا خشيت الصبح فواحدة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tawus said:                     \"Ibn Umar said: \"A man asked the Messenger of Allah (ﷺ) about prayer at night. He said: \"Two by two, and if you fear that dawn will come, then one.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11067",
        "11276",
        "11053",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2031",
      "hadith_no": "2031",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، عن حبيب، عن أبي وائل، عن أبي الهياج، قال قال علي رضى الله عنه ‏:‏ ألا أبعثك على ما بعثني عليه رسول الله صلى الله عليه وسلم لا تدعن قبرا مشرفا إلا سويته، ولا صورة في بيت إلا طمستها ‏.‏",
      "text_en": " 'Ali said:                     \"Shall I not send you on the same mission as the Messenger of Allah sent me? Do not leave any raised grave without leveling it, or any image in a house without erasing it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11276",
        "11353",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-2398",
      "hadith_no": "2398",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن الحسين، قال حدثنا أمية، عن شعبة، عن حبيب، قال حدثني أبو العباس، - وكان رجلا من أهل الشام وكان شاعرا وكان صدوقا - عن عبد الله بن عمرو قال قال لي رسول الله صلى الله عليه وسلم وساق الحديث ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said to me\" and he quoted the same Hadith. 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "20020",
        "11276",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-2765",
      "hadith_no": "2765",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود، قال حدثنا حبيب، عن عمرو بن هرم، عن سعيد بن جبير، وعكرمة، عن ابن عباس، أن ضباعة، أرادت الحج فأمرها النبي صلى الله عليه وسلم أن تشترط ففعلت عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     That Duba'ah wanted to perform Hajj, so the Prophet Told here to stipulate a condition, and she acted upon the command of the Messenger of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20547",
        "11276",
        "10708",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3056",
      "hadith_no": "3056",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، عن عبد الرحمن، قال حدثنا سفيان، عن حبيب، عن سعيد بن جبير، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لبى حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     the Messenger of Allah recited the Talbiyah unitl he stoned the Jamrat.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11276",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3065",
      "hadith_no": "3065",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا بشر بن السري، قال حدثنا سفيان، عن حبيب، عن عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم قدم أهله وأمرهم أن لا يرموا الجمرة حتى تطلع الشمس ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     the Prophet sent his family ahead, and told them not to stone the Jamrah until the sun had risen. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11276",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4214",
      "hadith_no": "4214",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عفان، قال حدثنا حماد بن سلمة، قال حدثنا أيوب، وحبيب، ويونس، وقتادة، عن محمد بن سيرين، عن سلمان بن عامر الضبي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في الغلام عقيقة فأهريقوا عنه دما وأميطوا عنه الأذى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salman bin 'Amir Ad-Dabbi that the Messenger of Allah said:                     \"For a boy there shoud be an 'Aqiqah, so shed blood for him, and remove the harm from him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30106",
        "20021",
        "11015",
        "11276",
        "20475",
        "11019",
        "11035"
      ]
    },
    {
      "id": "sunan-an-nasai-4577",
      "hadith_no": "4577",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، عن محمد، قال حدثنا شعبة، عن حبيب، قال سمعت أبا المنهال، قال سألت البراء بن عازب عن الصرف، فقال سل زيد بن أرقم فإنه خير مني وأعلم ‏.‏ فسألت زيدا فقال سل البراء فإنه خير مني وأعلم فقالا جميعا نهى رسول الله صلى الله عليه وسلم عن الورق بالذهب دينا ‏.‏",
      "text_en": " Abu Al-Minhal said:                     \"I asked Al-Bara bin 'Azib about money exchange. He said: 'Ask Zaid bin Arqam, for he is better than me and more knowledgeable.' So I asked Zaid and he said: 'Ask Al-Bara for he is better than me and more knowledgeable.' And they both said: 'The Messenger of Allah forbade (selling) silver for gold on credit.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20020",
        "11276",
        "11290",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-5550",
      "hadith_no": "5550",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن حبيب، عن أبي أرطاة، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن الزهو والتمر والزبيب والتمر‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] forbade (mixing) Az-Zahuw and At-Tamr, and raisins and dried dates (At-Tamr).\"",
      "usc_msa_ref": "",
      "chain": [
        "38181",
        "20331",
        "11060",
        "11276",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3714",
      "hadith_no": "3714",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا عبد الوارث، حدثنا حبيب المعلم، عن أبي المهزم، عن أبي هريرة، عن عائشة، أن النبي  صلى الله عليه وسلم  قال في ذيول النساء ‏\"‏ شبرا ‏\"‏ ‏.‏ فقالت عائشة إذا تخرج سوقهن ‏.‏ قال ‏\"‏ فذراع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) said, concerninghowlong a woman’s hem should hang down:                      “A hand span.” ‘Aishahsaid:“This may show her calves.” He said: “Then a forearm’slength.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20258",
        "11276",
        "13",
        "53"
      ]
    }
  ],
  "total_hadiths": 56
}