{
  "id": "11270",
  "name": "Thmamh bin 'Abdullah ثمامة بن عبد الله بن أنس",
  "full_name": "Thmamh bin 'Abdullah ثمامة بن عبد الله بن أنس",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11599",
      "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19055",
      "name": "Musa bin Flan bin Ans موسى بن فلان بن أنس بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "94",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة، قال حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
      "chain": [
        "20337",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا تكلم بكلمة أعادها ثلاثا حتى تفهم عنه، وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting.",
      "chain": [
        "30149",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1010",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن محمد، قال حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي عبد الله بن المثنى، عن ثمامة بن عبد الله بن أنس، عن أنس، أن عمر بن الخطاب  رضى الله عنه  كان إذا قحطوا استسقى بالعباس بن عبد المطلب فقال اللهم إنا كنا نتوسل إليك بنبينا فتسقينا وإنا نتوسل إليك بعم نبينا فاسقنا‏.‏ قال فيسقون‏.‏",
      "text_en": " Narrated Anas:                     Whenever drought threatened them, `Umar bin Al-Khattab, used to ask Al-Abbas bin `Abdul Muttalib to invoke Allah for rain. He used to say, \"O Allah! We used to ask our Prophet to invoke You for rain, and You would bless us with rain, and now we ask his uncle to invoke You for rain. O Allah ! Bless us with rain.\"(1) And so it would rain.",
      "chain": [
        "30245",
        "20280",
        "11270",
        "19",
        "3"
      ]
    },
    {
      "hadith_no": "1471",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له التي أمر الله رسوله صلى الله عليه وسلم ‏\"‏ ومن بلغت صدقته بنت مخاض وليست عنده وعنده بنت لبون فإنها تقبل منه، ويعطيه المصدق عشرين درهما أو شاتين، فإن لم يكن عنده بنت مخاض على وجهها، وعنده ابن لبون فإنه يقبل منه وليس معه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah had instructed His Apostle (p.b.u.h) to do regarding the one who had to pay one Bint Makhad (i.e. one year-old she-camel) as Zakat, and he did not have it but had got Bint Labun (two year old she-camel). (He wrote that) it could be accepted from him as Zakat, and the collector of Zakat would return him 20 Dirhams or two sheep; and if the Zakat payer had not a Bint Makhad, but he had Ibn Labun (a two year old he-camel) then it could be accepted as his Zakat, but he would not be paid anything .",
      "chain": [
        "30561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ ولا يجمع بين متفرق، ولا يفرق بين مجتمع، خشية الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what was made compulsory by Allah's Apostle and that was (regarding the payments of Zakat): Neither the property of different people may be taken together nor the joint property may be split for fear of (paying more, or receiving less) Zakat.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah's Apostle has made compulsory (regarding Zakat) and this was mentioned in it: If a property is equally owned by two partners, they should pay the combined Zakat and it will be considered that both of them have paid their Zakat equally.",
      "chain": [
        "30561",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1476",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له فريضة الصدقة التي أمر الله رسوله صلى الله عليه وسلم ‏\"‏ من بلغت عنده من الإبل صدقة الجذعة، وليست عنده جذعة وعنده حقة، فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما، ومن بلغت عنده صدقة الحقة وليست عنده الحقة وعنده الجذعة، فإنها تقبل منه الجذعة، ويعطيه المصدق عشرين درهما أو شاتين، ومن بلغت عنده صدقة الحقة وليست عنده إلا بنت لبون فإنها تقبل منه بنت لبون، ويعطي شاتين أو عشرين درهما، ومن بلغت صدقته بنت لبون وعنده حقة فإنها تقبل منه الحقة ويعطيه المصدق عشرين درهما أو شاتين، ومن بلغت صدقته بنت لبون وليست عنده وعنده بنت مخاض، فإنها تقبل منه بنت مخاض ويعطي معها عشرين درهما أو شاتين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr , wrote to me about the Zakat which Allah had ordered His Apostle to observe: Whoever had to pay Jahda (Jahda means a four-year-old she-camel) as Zakat from his herd of camels and he had not got one, and he had Hiqqa (three-year-old she-camel), that Hiqqa should be accepted from him along with two sheep if they were available or twenty Dirhams (one Durham equals about 1/4 Saudi Riyal) and whoever had to pay Hiqqa as Zakat and he had no Hiqqa but had a Jadha, the Jadha should be accepted from him, and the Zakat collector should repay him twenty Dirhams or two sheep; and whoever had to pay Hiqqa as Zakat and he had not got one, but had a Bint Labun (two-year-old she-camel), it should be accepted from him along with two sheep or twenty Dirhams; and whoever had to pay Bint Labun and had a Hiqqa, that Hiqqa should be accepted from him and the Zakat collector should repay him twenty Dirhams or two sheep; and whoever had to pay Bint Labun and he had not got one but had a Bint Makhad (one-year-old she camel), that Bint Makhad should be accepted from him along with twenty Dirhams or two sheep.",
      "chain": [
        "30561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن المثنى الأنصاري، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له هذا الكتاب لما وجهه إلى البحرين بسم الله الرحمن الرحيم ‏\"‏ هذه فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين، والتي أمر الله بها رسوله، فمن سئلها من المسلمين على وجهها فليعطها، ومن سئل فوقها فلا يعط في أربع وعشرين من الإبل فما دونها من الغنم من كل خمس شاة، إذا بلغت خمسا وعشرين إلى خمس وثلاثين ففيها بنت مخاض أنثى، فإذا بلغت ستا وثلاثين إلى خمس وأربعين ففيها بنت لبون أنثى، فإذا بلغت ستا وأربعين إلى ستين ففيها حقة طروقة الجمل، فإذا بلغت واحدة وستين إلى خمس وسبعين ففيها جذعة، فإذا بلغت  يعني  ستا وسبعين إلى تسعين ففيها بنتا لبون، فإذا بلغت إحدى وتسعين إلى عشرين ومائة ففيها حقتان طروقتا الجمل، فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون، وفي كل خمسين حقة، ومن لم يكن معه إلا أربع من الإبل فليس فيها صدقة، إلا أن يشاء ربها، فإذا بلغت خمسا من الإبل ففيها شاة، وفي صدقة الغنم في سائمتها إذا كانت أربعين إلى عشرين ومائة شاة، فإذا زادت على عشرين ومائة إلى مائتين شاتان، فإذا زادت على مائتين إلى ثلاثمائة ففيها ثلاث، فإذا زادت على ثلاثمائة ففي كل مائة شاة، فإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها صدقة، إلا أن يشاء ربها، وفي الرقة ربع العشر، فإن لم تكن إلا تسعين ومائة فليس فيها شىء، إلا أن يشاء ربها ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When Abu Bakr; sent me to (collect the Zakat from) Bahrain, he wrote to me the following:-- (In the name of Allah, the Beneficent, the Merciful). These are the orders for compulsory charity (Zakat) which Allah's Apostle had made obligatory for every Muslim, and which Allah had ordered His Apostle to observe: Whoever amongst the Muslims is asked to pay Zakat accordingly, he should pay it (to the Zakat collector) and whoever is asked more than that (what is specified in this script) he should not pay it; for twenty-four camels or less, sheep are to be paid as Zakat; for every five camels one sheep is to be paid, and if there are between twenty-five to thirty-five camels, one Bint Makhad is to be paid; and if they are between thirty-six to forty-five (camels), one Bint Labun is to be paid; and if they are between forty-six to sixty (camels), one Hiqqa is to be paid; and if the number is between sixty-one to seventy-five (camels), one Jadha is to be paid; and if the number is between seventy-six to ninety (camels), two Bint Labuns are to be paid; and if they are from ninety-one to one-hundredand twenty (camels), two Hiqqas are to be paid; and if they are over one-hundred and-twenty (camels), for every forty (over one-hundred-and-twenty) one Bint Labun is to be paid, and for every fifty camels (over one-hundred-and-twenty) one Hiqqa is to be paid; and who ever has got only four camels, has to pay nothing as Zakat, but if the owner of these four camels wants to give something, he can. If the number of camels increases to five, the owner has to pay one sheep as Zakat. As regards the Zakat for the (flock) of sheep; if they are between forty and one-hundred-and-twenty sheep, one sheep is to be paid; and if they are between one-hundred-and-twenty to two hundred (sheep), two sheep are to be paid; and if they are between two-hundred to three-hundred (sheep), three sheep are to be paid; and for over three-hundred sheep, for every extra hundred sheep, one sheep is to be paid as Zakat. And if somebody has got less than forty sheep, no Zakat is required, but if he wants to give, he can. For silver the Zakat is one-fortieth of the lot (i.e. 2.5%), and if its value is less than two-hundred Dirhams, Zakat is not required, but if the owner wants to pay he can.'",
      "chain": [
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1478",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له ‏{‏الصدقة‏}‏ التي أمر الله رسوله صلى الله عليه وسلم ‏\"‏ ولا يخرج في الصدقة هرمة، ولا ذات عوار، ولا تيس، إلا ما شاء المصدق ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah had ordered His Apostle (about Zakat) which goes: Neither an old nor a defected animal, nor a male-goat may be taken as Zakat except if the Zakat collector wishes (to take it).",
      "chain": [
        "30561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1542",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وحدثنا محمد بن أبي بكر، حدثنا يزيد بن زريع، حدثنا عزرة بن ثابت، عن ثمامة بن عبد الله بن أنس، قال حج أنس على رحل، ولم يكن شحيحا، وحدث أن رسول الله صلى الله عليه وسلم حج على رحل وكانت زاملته‏.‏",
      "text_en": " Narrated Thumama bin `Abdullah bin Anas:                     Anas performed the Hajj on a packsaddle and he was not a miser. Anas said, \"Allah's Apostle performed Hajj on a packsaddle and the same Mount was carrying his baggage too.\"",
      "chain": [
        "30161",
        "20304",
        "20561",
        "11270"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الله بن المثنى، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم قال ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's Apostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.",
      "chain": [
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "2582",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عزرة بن ثابت الأنصاري، قال حدثني ثمامة بن عبد الله، قال دخلت عليه فناولني طيبا، قال كان أنس  رضى الله عنه  لا يرد الطيب‏.‏ قال وزعم أنس أن النبي صلى الله عليه وسلم كان لا يرد الطيب‏.‏",
      "text_en": " Narrated 'Azra bin Thabit Al-Ansari:                     When I went to Thumama bin `Abdullah, he gave me some perfume and said that Anas would not reject the gifts of perfume. Anas said: The Prophet used not to reject the gifts of perfume.",
      "chain": [
        "30315",
        "20258",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف بعثه إلى البحرين، وكتب له هذا الكتاب وختمه، وكان نقش الخاتم ثلاثة أسطر محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     That when Abu Bakr became the Caliph, he sent him to Bahrain and wrote this letter for him, and stamped it with the Ring of the Prophet. Three lines were engraved on the Ring, (the word) 'Muhammad' was in a line, 'Apostle' was in another line, and 'Allah' in a third.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "3757",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحسن بن محمد، حدثنا محمد بن عبد الله الأنصاري، حدثني أبي عبد الله بن المثنى، عن ثمامة بن عبد الله بن أنس، عن أنس  رضى الله عنه أن عمر بن الخطاب، كان إذا قحطوا استسقى بالعباس بن عبد المطلب، فقال اللهم إنا كنا نتوسل إليك بنبينا صلى الله عليه وسلم فتسقينا، وإنا نتوسل إليك بعم نبينا فاسقنا‏.‏ قال فيسقون‏.‏",
      "text_en": " Narrated Anas:                     Whenever there was drought, `Umar bin Al-Khattab used to ask Allah for rain through Al-`Abbas bin `Abdul Muttalib, saying, \"O Allah! We used to request our Prophet to ask You for rain, and You would give us. Now we request the uncle of our Prophet to ask You for rain, so give us rain.\" And they would be given rain.\"",
      "chain": [
        "30245",
        "20280",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4142",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني حبان، أخبرنا عبد الله، أخبرنا معمر، قال حدثني ثمامة بن عبد الله بن أنس، أنه سمع أنس بن مالك  رضى الله عنه  يقول لما طعن حرام بن ملحان  وكان خاله  يوم بئر معونة قال بالدم هكذا، فنضحه على وجهه ورأسه، ثم قال فزت ورب الكعبة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That when Haram bin Milhan, his uncle was stabbed on the day of Bir Ma'una he sprinkled his blood over his face and his head this way and then said, \"I have succeeded, by the Lord of the Ka`ba.'",
      "chain": [
        "20218",
        "20025",
        "20115",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس  رضى الله عنه  قال فجعلها لحسان وأبي، وأنا أقرب إليه، ولم يجعل لي منها شيئا‏.‏",
      "text_en": " Narrated Anas:                     Abu Talha distributed the garden between Hassan and Ubai, but he did not give me anything thereof although I was a nearer relative to him.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4830",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس بن مالك  رضى الله عنه  قال نرى هذه الآية نزلت في أنس بن النضر ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏‏.‏",
      "text_en": " Narrated Anas:                     We think that the Verse: 'Among the Believers are men who have been true to their covenant with Allah.' was revealed in favor of Anas bin An-Nadir.",
      "chain": [
        "30160",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5055",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الله بن المثنى، قال حدثني ثابت البناني، وثمامة، عن أنس، قال مات النبي صلى الله عليه وسلم ولم يجمع القرآن غير أربعة أبو الدرداء ومعاذ بن جبل وزيد بن ثابت وأبو زيد‏.‏ قال ونحن ورثناه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the Prophet died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .",
      "chain": [
        "30457",
        "11599",
        "11269",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5490",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عبد الله بن منير، سمع النضر، أخبرنا ابن عون، قال أخبرني ثمامة بن عبد الله بن أنس، عن أنس  رضى الله عنه  قال كنت غلاما أمشي مع رسول الله صلى الله عليه وسلم فدخل رسول الله صلى الله عليه وسلم على غلام له خياط، فأتاه بقصعة فيها طعام وعليه دباء، فجعل رسول الله صلى الله عليه وسلم يتتبع الدباء  قال  فلما رأيت ذلك جعلت أجمعه بين يديه  قال  فأقبل الغلام على عمله‏.‏ قال أنس لا أزال أحب الدباء بعد ما رأيت رسول الله صلى الله عليه وسلم صنع ما صنع‏.‏",
      "text_en": " Narrated Anas:                     I was a young boy when I once was walking with Allah's Apostle . Allah's Apostle entered the house of his slave tailor and the latter brought a dish filled with food covered with pieces of gourd. Allah's Apostle started picking and eating the gourd. When I saw that, I started collecting and placing the gourd before him. Then the slave returned to his work. Anas added: I have kept on loving gourd since I saw Allah's Apostle doing what he was doing.",
      "chain": [
        "30353",
        "20291",
        "11071",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5691",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو عاصم، وأبو نعيم قالا حدثنا عزرة بن ثابت، قال أخبرني ثمامة بن عبد الله، قال كان أنس يتنفس في الإناء مرتين أو ثلاثا، وزعم أن النبي صلى الله عليه وسلم كان يتنفس ثلاثا‏.‏",
      "text_en": " Narrated Thumama bin `Abdullah:                     Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; used to take three breaths while drinking.",
      "chain": [
        "20241",
        "20348",
        "20561",
        "11270"
      ]
    },
    {
      "hadith_no": "5939",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف كتب له، وكان نقش الخاتم ثلاثة أسطر‏.‏ محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line. Anas added: 'the ring of the Prophet was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "5940",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وزادني أحمد حدثنا الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، قال كان خاتم النبي صلى الله عليه وسلم في يده، وفي يد أبي بكر بعده، وفي يد عمر بعد أبي بكر، فلما كان عثمان جلس على بئر أريس  قال  فأخرج الخاتم، فجعل يعبث به فسقط قال فاختلفنا ثلاثة أيام مع عثمان فننزح البئر فلم نجده‏.‏",
      "text_en": "",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5992",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا عزرة بن ثابت الأنصاري، قال حدثني ثمامة بن عبد الله، عن أنس  رضى الله عنه  أنه كان لا يرد الطيب، وزعم أن النبي صلى الله عليه وسلم كان لا يرد الطيب‏.‏",
      "text_en": " Narrated Thumama bin `Abdullah;:                     Anas never used to refuse (a gift of) scent and used to say that the Prophet never used to refuse (a gift of) scent.",
      "chain": [
        "20348",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6316",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله، عن أنس  رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle greeted somebody, he used to greet him three times, and if he spoke a sentence, he used to repeat it thrice.",
      "chain": [
        "30021",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6355",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أم سليم، كانت تبسط للنبي صلى الله عليه وسلم نطعا فيقيل عندها على ذلك النطع  قال  فإذا نام النبي صلى الله عليه وسلم أخذت من عرقه وشعره، فجمعته في قارورة، ثم جمعته في سك  قال  فلما حضر أنس بن مالك الوفاة أوصى أن يجعل في حنوطه من ذلك السك  قال  فجعل في حنوطه‏.‏",
      "text_en": " Narrated Thumama:                     Anas said, \"Um Sulaim used to spread a leather sheet for the Prophet and he used to take a midday nap on that leather sheet at her home.\" Anas added, \"When the Prophet had slept, she would take some of his sweat and hair and collect it (the sweat) in a bottle and then mix it with Suk (a kind of perfume) while he was still sleeping. \"When the death of Anas bin Malik approached, he advised that some of that Suk be mixed with his Hanut (perfume for embalming the dead body), and it was mixed with his Hanut.",
      "chain": [
        "30367",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "7041",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، حدثنا ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     That Abu Bakr wrote for him, Zakat regulations which Allah's Apostle had made compulsory, and wrote that one should neither collect various portions (of the property) nor divide the property into various portions in order to avoid paying Zakat.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "7243",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن خالد الذهلي، حدثنا الأنصاري، محمد حدثنا أبي، عن ثمامة، عن أنس، أن قيس بن سعد، كان يكون بين يدى النبي صلى الله عليه وسلم بمنزلة صاحب الشرط من الأمير‏.‏",
      "text_en": " Narrated Anas:                     Qais bin Sa`d was to the Prophet like a chief police officer to an Amir (chief).",
      "chain": [
        "38496",
        "11270",
        "19",
        "172"
      ]
    },
    {
      "hadith_no": "5405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة قالا حدثنا وكيع، عن عزرة، بن ثابت الأنصاري عن ثمامة بن عبد الله بن أنس، عن أنس، أن رسول الله صلى الله عليه وسلم كان يتنفس في الإناء ثلاثا ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) used to breathe three times in the course of a drink (i. e. he drank in three gulps).",
      "chain": [
        "30367",
        "30201",
        "20032",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، عن ثمامة، عن أنس بن مالك، قال كان نقش خاتم النبي صلى الله عليه وسلم محمد سطر ورسول سطر والله سطر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The inscription on the ring of the Prophet (ﷺ) was in three lines: 'Muhammad' on a line, 'Messenger' on a line, and 'Allah' on a line.\"",
      "chain": [
        "11222",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن يحيى، وغير، واحد، قالوا حدثنا محمد بن عبد الله الأنصاري، حدثني أبي، عن ثمامة، عن أنس بن مالك، قال كان نقش خاتم النبي صلى الله عليه وسلم ثلاثة أسطر محمد سطر ورسول سطر والله سطر ‏.‏ ولم يذكر محمد بن يحيى في حديثه ثلاثة أسطر ‏.‏ وفي الباب عن ابن عمر ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The inscription on the ring of the Prophet (ﷺ) was in three line: 'Muhammad' on a line, 'Messenger' on a line, 'Allah' on a line.\" And Muhammad bin Yahya (one of the two who narrated to him) did not say: \"Three lines\" in his narration.There are narrations on this topic from Ibn 'Umar.[Abu 'Eisa said:] This Hadith of Anas is a Hasan  Sahih Gharib.",
      "chain": [
        "30160",
        "11222",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1884",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا بذلك محمد بن بشار حدثنا عبد الرحمن بن مهدي حدثنا عزرة بن ثابت الأنصاري عن ثمامة عن أنس بن مالك أن النبي صلى الله عليه وسلم كان يتنفس في الإناء ثلاثا ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Azrah bin Thabit:                     From Thumamah, from Anas that: \"The Prophet (ﷺ) would breathe three times in the vessel.\"Another chain from Anas bin Malik: \"The Prophet (ﷺ) would breathe three times in the vessel.\"He said: This Hadith is Hasan Sahih.",
      "chain": [
        "20033",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "3019",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا عزرة بن ثابت، عن ثمامة بن عبد الله، قال كان أنس لا يرد الطيب ‏.‏ وقال أنس إن النبي صلى الله عليه وسلم كان لا يرد الطيب ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Thumamah bin 'Abdullah:                     \"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"",
      "chain": [
        "30160",
        "20033",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4001",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو قتيبة، سلم بن قتيبة عن عبد الله بن المثنى، عن ثمامة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يعيد الكلمة ثلاثا لتعقل عنه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب إنما نعرفه من حديث عبد الله بن المثنى ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) would repeat a statement three times so that it could be understood.",
      "chain": [
        "11222",
        "20233",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4221",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن مرزوق البصري، حدثنا محمد بن عبد الله الأنصاري، حدثني أبي، عن ثمامة، عن أنس، قال كان قيس بن سعد من النبي صلى الله عليه وسلم بمنزلة صاحب الشرط من الأمير ‏.‏ قال الأنصاري يعني مما يلي من أموره ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الأنصاري ‏.‏",
      "text_en": " Narrated Anas:                     \"Qais bin Sa'd used to be, to the Prophet (ﷺ), in the position of the head of police for a ruler.\" (One of the narrators) Al-Ansari said: \"That is: Due to his affairs that he takes charge of.\"",
      "chain": [
        "34240",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5258",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا وكيع، قال حدثنا عزرة بن ثابت، عن ثمامة بن عبد الله بن أنس، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا أتي بطيب لم يرده ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"If perfume was brought to the Prophet [SAW], he would not refuse it.\"",
      "chain": [
        "30021",
        "20032",
        "20561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن يحيى، ومحمد بن مرزوق، قالوا حدثنا محمد بن عبد الله بن المثنى، حدثني أبي، عن ثمامة، حدثني أنس بن مالك، أن أبا بكر الصديق، كتب له بسم الله الرحمن الرحيم ‏.‏ هذه فريضة الصدقة التي فرض رسول الله  صلى الله عليه وسلم  على المسلمين التي أمر الله بها رسول الله  صلى الله عليه وسلم  فإن من أسنان الإبل في فرائض الغنم من بلغت عنده من الإبل صدقة الجذعة وليس عنده جذعة وعنده حقة فإنها تقبل منه الحقة ويجعل مكانها شاتين إن استيسرتا أو عشرين درهما ومن بلغت عنده صدقة الحقة وليست عنده إلا بنت لبون فإنها تقبل منه بنت لبون ويعطي معها شاتين أو عشرين درهما ومن بلغت صدقته بنت لبون وليست عنده وعنده حقة فإنها تقبل منه الحقة ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت صدقته بنت لبون وليست عنده وعنده بنت مخاض فإنها تقبل منه ابنة مخاض ويعطي معها عشرين درهما أو شاتين ‏.‏ ومن بلغت صدقته بنت مخاض وليست عنده وعنده ابنة لبون فإنها تقبل منه بنت لبون ويعطيه المصدق عشرين درهما أو شاتين فمن لم يكن عنده ابنة مخاض على وجهها وعنده ابن لبون ذكر فإنه يقبل منه وليس معه شىء ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     Abu Bakr Siddiq wrote to him: “In the name of Allah, the Most Gracious, the Most Merciful. This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah. The ages of camels to be given (in Zakat) may be made up in sheep. So if a man has camels on which the Sadaqah is a Jadha'ah (a four-year-old she-camel) and he does not have a Jadha'ah but he has a Hiqqah (a three year old she-camel), then the Hiqqah should be accepted from him, and two sheep should be given (in addition), if they are readily available, or twenty Dirham. If a man has camels on which the Sadaqah is a Hiqqah, and he only has a Bin Labun( a two-year-old she-camel), then the Bint Labun should be accepted from him, along with two sheep or twenty Dirhams.If a man has camels on which the sadaqah is a Bint Labun, and he does not have one, but he has a Hiqqah, then it should be accepted from him, and the Zakat collector should give him back twenty Dirham or two sheep. If a man has camels on which Sadaqah is a Bint Labun, and he does not have one, but he has a Bint Makhad(a one-year-old she-camel), then the Bint Makhad should be accepted from him, along with twenty Dirham or two sheep. If a man has camels on which the Sadaqah is a Bint Makhad, and he does not have one, but he has a Bint Labun, then the Bint Labun should be accepted from him, and the Zakat collector should give him back twenty Dirhams or two sheep. Whoever does not have a Bint Makhad, but he has a Bint Labun (a two-year-old male camel), then it should be accepted from him and nothing else should be given along with it.' ”",
      "chain": [
        "30160",
        "11222",
        "34240",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1974",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، حدثنا عوف، عن ثمامة بن عبد الله، عن أنس بن مالك، أن النبي  صلى الله عليه وسلم  مر ببعض المدينة فإذا هو بجوار يضربن بدفهن ويتغنين ويقلن نحن جوار من بني النجار يا حبذا محمد من جار ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ يعلم الله إني لأحبكن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik:                     that the Prophet passed by some part of Al-Madinah and saw some girls beating their Daff And singing, saying: “We are girls from Baniu Najjar what an excellent neighbor is Muhammad.” The Prophet said: “Allah knows that you are dear to me.”",
      "chain": [
        "30288",
        "20347",
        "11298",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "3542",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن مهدي، حدثنا عزرة بن ثابت الأنصاري، عن ثمامة بن عبد الله، عن أنس، أنه كان يتنفس في الإناء ثلاثا وزعم أنس أن رسول الله  صلى الله عليه وسلم  كان يتنفس في الإناء ثلاثا ‏.‏",
      "text_en": " It wasnarrated from Anas that he used to drink from a vessel inthreedraughts, and Anas said that the Messenger of Allah (ﷺ) usedtodrink from a vessel in three draughts.",
      "chain": [
        "30201",
        "20033",
        "20561",
        "11270",
        "19"
      ]
    }
  ],
  "total_hadiths": 38
}