{
  "id": "11277",
  "name": "Hjaj bin Abi 'Uthman حجاج بن أبي عثمان",
  "full_name": "Hjaj bin Abi 'Uthman حجاج بن أبي عثمان",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "143",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Kundi",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11592",
      "name": "Salman Abu Raja' سلمان أبو رجاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11306",
      "name": "Mua'wiya bin Qurrah bin Iyas معاوية بن قرة بن إياس بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا حجاج بن أبي عثمان، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، عن وكيع، عن سفيان، ح وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، عن جدي، عن أيوب، كل هؤلاء عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي خيثمة وفي حديث أيوب من الزيادة قال جعل الأنصار يعمرون المهاجرين فقال رسول الله صلى الله عليه وسلم ‏\"‏ أمسكوا عليكم أموالكم ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated on the authority of Jabir through other chains of transmitters, but (with this addition of words) that thehadith transmitted on the authority of Ayyub (these words are found):                     \" The Helpers (Ansar) conferred the benefit of 'Umra, upon the Emigrants (Muhajirin), whereupon Allah's Messenger (may peace be upon him) said: Keep your property to yourselves.",
      "chain": [
        "30201",
        "20352",
        "11277",
        "30201",
        "30123",
        "20032",
        "20012",
        "20016",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4446",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو جعفر، محمد بن الصباح وأبو بكر بن أبي شيبة - واللفظ لأبي بكر - قال حدثنا ابن علية، عن حجاج بن أبي عثمان، حدثني أبو رجاء، مولى أبي قلابة عن أبي قلابة، حدثني أنس، أن نفرا، من عكل ثمانية قدموا على رسول الله صلى الله عليه وسلم فبايعوه على الإسلام فاستوخموا الأرض وسقمت أجسامهم فشكوا ذلك إلى رسول الله صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ ألا تخرجون مع راعينا في إبله فتصيبون من أبوالها وألبانها ‏\"‏ ‏.‏ فقالوا بلى ‏.‏ فخرجوا فشربوا من أبوالها وألبانها فصحوا فقتلوا الراعي وطردوا الإبل فبلغ ذلك رسول الله صلى الله عليه وسلم فبعث في آثارهم فأدركوا فجيء بهم فأمر بهم فقطعت أيديهم وأرجلهم وسمر أعينهم ثم نبذوا في الشمس حتى ماتوا ‏.‏ وقال ابن الصباح في روايته واطردوا النعم ‏.‏ وقال وسمرت أعينهم ‏.‏",
      "text_en": " Anas reported:                      Eight men of the tribe of 'Ukl came to Allah's Messenger (may peace be upon him) and swore allegiance to him on Islam, but found the climate of that land uncogenial to their health and thus they became sick, and they made complaint of that to Allah's Messenger (may peace be upon him), and he said: Why don't you go to (the fold) of our camels along with our shepherd, and make use of their milk and urine. They said: Yes. They set out and drank their (camels') milk and urine and regained their health. They killed the shepherd and drove away the camels. This (news) reached Allah's Messenger (may peace be upon him) and he sent them on their track and they were caught and brought to him (the Holy Prophet). He commanded about them, and (thus) their hands and feet were cut off and their eyes were gouged and then they were thrown in the sun, until they died. This hadith has been narrated on the authority of Ibn al-Sabbah with a slight variation of words.",
      "chain": [
        "20208",
        "11277",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5270",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، عن حجاج بن أبي، عثمان عن يحيى بن أبي كثير، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Abu Kathir with the same chain of transmitters.",
      "chain": [
        "30201",
        "20352",
        "11277"
      ]
    },
    {
      "hadith_no": "7171",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا عمرو الناقد، حدثنا إسماعيل بن إبراهيم ابن علية، عن حجاج بن أبي، عثمان قال قال يحيى وحدثني أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يغار وإن المؤمن يغار وغيرة الله أن يأتي المؤمن ما حرم عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah is self-respecting and a believer is also self-respecting and the respect of Allah is injured if a believer does what He has forbidden him to do.",
      "chain": [
        "30263",
        "20208",
        "11277",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1506",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عيسى، قال حدثنا ابن علية، عن الحجاج بن أبي عثمان، عن أبي الزبير، قال سمعت عبد الله بن الزبير، على المنبر يقول كان النبي صلى الله عليه وسلم إذا انصرف من الصلاة يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا إله إلا الله مخلصين له الدين ولو كره الكافرون أهل النعمة والفضل والثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair said:                      \"I heard 'Abd Allah b. al-Zubair saying on the pulpit: When the Prophet (ﷺ) finished the prayer, he used to say (at the end of the prayer): 'There is no God but Allah, Alone, Who has no partner, to Him belongs the Kingdom, to Him praise is due, and He is Omnipotent. There is no God but Allah to Whom we are sincere in devotion, even though the infidels should disapprove. To Him belongs wealth, to Him belongs grace and to Him is worthy accorded. There is no got but Allah to Whom we are sincere in devotion, even though infidels should disapprove.",
      "chain": [
        "31167",
        "20208",
        "11277",
        "11263",
        "106"
      ]
    },
    {
      "hadith_no": "790",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا هشيم، عن هشام بن أبي عبد الله، وحجاج بن أبي عثمان، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا نودي للصلاة فلا تقوموا حتى تروني ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abi Qatadah that his father said:                      \"The messenger of Allah (ﷺ) said: 'When the call to prayer is given, do not stand up until you see me.'\"",
      "chain": [
        "20387",
        "20468",
        "11277",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد، وابن، علية عن حجاج بن أبي عثمان، حدثني يحيى بن أبي كثير، حدثني عكرمة، حدثني الحجاج بن عمرو الأنصاري، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ من كسر أو عرج فقد حل وعليه حجة أخرى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ikrimah:                      “Hajjaj bin ‘Amr Ansari narrated tome,he said: ‘I heard the Prophet (ﷺ) say: “Whoever breaks a boneorbecomes lame, has exited Ihram, but he must perform another Hajj.”",
      "chain": [
        "30201",
        "20031",
        "20208",
        "11277",
        "11449",
        "11023"
      ]
    }
  ],
  "total_hadiths": 7
}