{
  "id": "11283",
  "name": "Khalas bin 'Amr al-Hajri خلاس بن عمرو الهجري",
  "full_name": "Khalas bin 'Amr al-Hajri خلاس بن عمرو الهجري",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11226",
      "name": "Abu Rafi' al-Sa'agh نفيع بن رافع أبو رافع الصائغ",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24050",
      "name": "Jabir bin Sbh جابر بن صبح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3404",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن إبراهيم، حدثنا روح بن عبادة، حدثنا عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى كان رجلا حييا ستيرا، لا يرى من جلده شىء، استحياء منه، فآذاه من آذاه من بني إسرائيل، فقالوا ما يستتر هذا التستر إلا من عيب بجلده، إما برص وإما أدرة وإما آفة‏.‏ وإن الله أراد أن يبرئه مما قالوا لموسى فخلا يوما وحده فوضع ثيابه على الحجر ثم اغتسل، فلما فرغ أقبل إلى ثيابه ليأخذها، وإن الحجر عدا بثوبه، فأخذ موسى عصاه وطلب الحجر، فجعل يقول ثوبي حجر، ثوبي حجر، حتى انتهى إلى ملإ من بني إسرائيل، فرأوه عريانا أحسن ما خلق الله، وأبرأه مما يقولون، وقام الحجر فأخذ ثوبه فلبسه، وطفق بالحجر ضربا بعصاه، فوالله إن بالحجر لندبا من أثر ضربه ثلاثا أو أربعا أو خمسا، فذلك قوله ‏{‏يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏‏.‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(The Prophet) Moses was a shy person and used to cover his body completely because of his extensive shyness. One of the children of Israel hurt him by saying, 'He covers his body in this way only because of some defect in his skin, either leprosy or scrotal hernia, or he has some other defect.' Allah wished to clear Moses of what they said about him, so one day while Moses was in seclusion, he took off his clothes and put them on a stone and started taking a bath. When he had finished the bath, he moved towards his clothes so as to take them, but the stone took his clothes and fled; Moses picked up his stick and ran after the stone saying, 'O stone! Give me my garment!' Till he reached a group of Bani Israel who saw him naked then, and found him the best of what Allah had created, and Allah cleared him of what they had accused him of. The stone stopped there and Moses took and put his garment on and started hitting the stone with his stick. By Allah, the stone still has some traces of the hitting, three, four or five marks. This was what Allah refers to in His Saying:-- \"O you who believe! Be you not like those Who annoyed Moses, But Allah proved his innocence of that which they alleged, And he was honorable In Allah's Sight.\" (33.69)",
      "chain": [
        "30123",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "4847",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا روح بن عبادة، حدثنا عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى كان رجلا حييا، وذلك قوله تعالى ‏{‏يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Moses was a shy man, and that is what the Statement of Allah means: 'O you who believe Be not like those who annoyed Moses, but Allah proved his innocence of that which they alleged and he was honorable in Allah's Sight.' (33.69)",
      "chain": [
        "30123",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "6750",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني يوسف بن موسى، حدثنا أبو أسامة، قال حدثني عوف، عن خلاس، ومحمد، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل ناسيا وهو صائم فليتم صومه، فإنما أطعمه الله وسقاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody eats something forgetfully while he is fasting, then he should complete his fast, for Allah has made him eat and drink.\"",
      "chain": [
        "30224",
        "20318",
        "11298",
        "11283",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "439",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن دينار، ومحمد بن حرب الواسطي، قالا حدثنا عمرو بن الهيثم أبو قطن، حدثنا شعبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو تعلمون - أو يعلمون - ما في الصف المقدم لكانت قرعة ‏\"‏ ‏.‏ وقال ابن حرب ‏\"‏ الصف الأول ما كانت إلا قرعة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: If you were to know, or if they were to know, what (excellence) lies in the first rows, there would have been drawing of lots (for filling them) ; and Ibn Harb said: For (occupying) the first row there would have been drawing of lots.",
      "chain": [
        "30496",
        "30373",
        "20020",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، عن قتادة، عن خلاس، وأبي، حسان عن عبد الله بن عتبة بن مسعود، أن عبد الله بن مسعود، أتي في رجل بهذا الخبر قال فاختلفوا إليه شهرا أو قال مرات قال فإني أقول فيها إن لها صداقا كصداق نسائها لا وكس ولا شطط وإن لها الميراث وعليها العدة فإن يك صوابا فمن الله وإن يكن خطأ فمني ومن الشيطان والله ورسوله بريئان ‏.‏ فقام ناس من أشجع فيهم الجراح وأبو سنان فقالوا يا ابن مسعود نحن نشهد أن رسول الله صلى الله عليه وسلم قضاها فينا في بروع بنت واشق وإن زوجها هلال بن مرة الأشجعي كما قضيت ‏.‏ قال ففرح عبد الله بن مسعود فرحا شديدا حين وافق قضاؤه قضاء رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Abdullah ibn Utbah ibn Mas'ud said: Abdullah ibn Mas'ud was informed of this story of a man. The people continued to visit him for a month or visited him many times (the narrator was not sure).  He said: In this matter I hold the opinion that she should receive the type of dower given to women of her class with no diminution or excess, observe the waiting period ('iddah) and have her share of inheritance. If it is erroneous, that is from me and from Satan. Allah and His Apostle are free from its responsibility. Some people from Ashja' got up; among them were al-Jarrah and AbuSinan.  They said: Ibn Mas'ud, we bear witness that the Messenger of Allah (ﷺ) gave a decision for us regarding Birwa', daughter of Washiq, to the same effect as the decision you have given. Her husband was Hilal ibn Murrah al-Ashja'i. Thereupon Abdullah ibn Mas'ud was very pleased when his decision agreed with the decision of the Messenger of Allah (ﷺ).",
      "chain": [
        "11201",
        "20304",
        "11073",
        "11019",
        "11283",
        "4145"
      ]
    },
    {
      "hadith_no": "3616",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا ابن أبي عروبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رجلين، اختصما في متاع إلى النبي صلى الله عليه وسلم ليس لواحد منهما بينة فقال النبي صلى الله عليه وسلم ‏\"‏ استهما على اليمين ما كان أحبا ذلك أو كرها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Two men disputed about some property and brought the case to the Holy Prophet (ﷺ), but neither of them could produce any proof. So the Holy Prophet (ﷺ) said: Cast lots about the oath whatever it may be, whether they like it or dislike it.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو أسامة، عن عوف، عن ابن سيرين، وخلاس، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله أو نحوه ‏.‏ قال وفي الباب عن أبي سعيد وأم إسحاق الغنوية ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال مالك بن أنس إذا أكل في رمضان ناسيا فعليه القضاء ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     (Another chain) with the same or similar (Hadith as no. 721).",
      "chain": [
        "30200",
        "20318",
        "11298",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "914",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن موسى الجرشي البصري، حدثنا أبو داود الطيالسي، حدثنا همام، عن قتادة، عن خلاس بن عمرو، عن علي، قال نهى رسول الله صلى الله عليه وسلم أن تحلق المرأة رأسها ‏.‏",
      "text_en": " Ali narrated:                     \"The Messenger of Allah prohibited that a woman should shave her head.\"",
      "chain": [
        "20547",
        "20297",
        "11019",
        "11283",
        "5"
      ]
    },
    {
      "hadith_no": "915",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، عن همام، عن خلاس، نحوه ‏.‏ ولم يذكر فيه عن علي، ‏.‏ قال أبو عيسى حديث علي فيه اضطراب ‏.‏ وروي هذا الحديث، عن حماد بن سلمة، عن قتادة، عن عائشة، أن النبي صلى الله عليه وسلم نهى أن تحلق المرأة رأسها ‏.‏ والعمل على هذا عند أهل العلم لا يرون على المرأة حلقا ويرون أن عليها التقصير ‏.‏",
      "text_en": " (Another chain) with similar (as no. 914) from Khilas:                     But he did not mention \"from Ali.\"",
      "chain": [
        "30160",
        "30002",
        "20297",
        "11283",
        "20021",
        "11019",
        "53"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة، حدثنا سفيان بن حبيب، حدثنا سعيد، عن قتادة، عن خلاس بن عمرو، عن عمار بن ياسر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنزلت المائدة من السماء خبزا ولحما وأمروا أن لا يخونوا ولا يدخروا لغد فخانوا وادخروا ورفعوا لغد فمسخوا قردة وخنازير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قد رواه أبو عاصم وغير واحد عن سعيد بن أبي عروبة عن قتادة عن خلاس عن عمار بن ياسر موقوفا ولا نعرفه مرفوعا إلا من حديث الحسن بن قزعة ‏.‏",
      "text_en": " Narrated 'Ammar bin Yasir:                     \"The Messenger of Allah (ﷺ) said: 'The Ma'idah was sent down from the Heavens with bread and meat. And they were commanded to not be deceitful with it and hide it for tomorrow. So they were deceitful with it and they hid it, so it was raised up in the morning. Then they were transformed into monkeys and pigs.'\"",
      "chain": [
        "34055",
        "20711",
        "11168",
        "11019",
        "11283",
        "25"
      ]
    },
    {
      "hadith_no": "3527",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا روح بن عبادة، عن عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن موسى عليه السلام كان رجلا حييا ستيرا ما يرى من جلده شيء استحياء منه فآذاه من آذاه من بني إسرائيل فقالوا ما يستتر هذا الستر إلا من عيب بجلده إما برص وإما أدرة وإما آفة وإن الله عز وجل أراد أن يبرئه مما قالوا وإن موسى عليه السلام خلا يوما وحده فوضع ثيابه على حجر ثم اغتسل فلما فرغ أقبل إلى ثيابه ليأخذها وإن الحجر عدا بثوبه فأخذ موسى عصاه فطلب الحجر فجعل يقول ثوبي حجر ثوبي حجر حتى انتهى إلى ملإ من بني إسرائيل فرأوه عريانا أحسن الناس خلقا وأبرأه مما كانوا يقولون قال وقام الحجر فأخذ ثوبه ولبسه وطفق بالحجر ضربا بعصاه فوالله إن بالحجر لندبا من أثر عصاه ثلاثا أو أربعا أو خمسا فذلك قوله تعالى ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم وفيه عن أنس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"Verily Musa, peace be upon him, was a shy and modest man, who would never show anything of his skin out of modesty. Some of the Children of Isra'il annoyed him by saying: 'He only keeps himself covered because of some defect in his skin, either leprosy, a scrotal hernia or some other defect.' Allah [the Mighty and Sublime] wanted to free Musa from what they were saying about him. One day Musa, [peace be upon him], was alone. He took off his garment, and put it on a rock, then he took a bath. When he had finished, he turned back to pick up his garment, but the rock moved away, taking his garment with it. Musa picked up his staff, and chased the rock saying: 'My garment, O you rock! My garment, O you rock!' Until he reached a group of the Children of Isra'il who saw him naked, and discovered that he was the best of those whom Allah had created.\" He said: \"The rock stood still, he took his garment and put it on. He started striking the rock with his staff, and by Allah, the marks of that beating were left on the rock; three, four, or five. This is what is referred to in the Ayah: ' O you who believe! Be not like those who annoyed Musa, but Allah freed him from what they had alleged, and he was honourable before Allah (33:69).'\"",
      "chain": [
        "30553",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن جابر بن صبح، قال سمعت خلاسا، يحدث عن عائشة، قالت كنت أنا ورسول الله، صلى الله عليه وسلم نبيت في الشعار الواحد وأنا طامث أو حائض فإن أصابه مني شىء غسل مكانه ولم يعده وصلى فيه ثم يعود فإن أصابه مني شىء فعل مثل ذلك ولم يعده وصلى فيه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) and I would sleep under a single blanket when I was menstruating. If anything got on him from me, he would wash that spot and no more, and pray in it, then come back. If anything got on it again from me, he would do likewise and no more, and he would pray in it.\"",
      "chain": [
        "30170",
        "20031",
        "24050",
        "11283",
        "53"
      ]
    },
    {
      "hadith_no": "338",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا ولغ الكلب في إناء أحدكم فليغسله سبع مرات أولاهن بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"If a dog licks the vessel of any one of you, let him wash it seven times, the first time with dust.\"",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن جابر بن صبح، قال سمعت خلاسا، يحدث عن عائشة، قالت كنت أنا ورسول الله، صلى الله عليه وسلم نبيت في الشعار الواحد وأنا طامث حائض فإن أصابه مني شىء غسل مكانه لم يعده ثم صلى فيه ثم يعود فإن أصابه مني شىء فعل مثل ذلك غسل مكانه لم يعده وصلى فيه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) and I would sleep under a single blanket when I was menstruating. If anything got on him from me, he would wash that spot and no more, and pray in it, then come back. If anything got on it again from me, he would do likewise and no more, and he would pray in it.\"",
      "chain": [
        "30170",
        "20031",
        "24050",
        "11283",
        "53"
      ]
    },
    {
      "hadith_no": "773",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا هشام بن عبد الملك، قال حدثنا يحيى بن سعيد، قال حدثنا جابر بن صبح، قال سمعت خلاس بن عمرو، يقول سمعت عائشة، تقول كنت أنا ورسول الله، صلى الله عليه وسلم أبو القاسم في الشعار الواحد وأنا حائض، طامث فإن أصابه مني شىء غسل ما أصابه لم يعده إلى غيره وصلى فيه ثم يعود معي فإن أصابه مني شىء فعل مثل ذلك لم يعده إلى غيره ‏.‏",
      "text_en": " Khilas bin 'Amr said:                      \"I heard Aisha (ra) say: 'The Messenger of Allah (ﷺ), Abii Al-Qbim, and I were beneath a single blanket, andI was menstruating. If something got on him from me, he would wash whatever had got on him and he did not wash anywhere else, and he prayed in it then came back to me.And if anything got on him from me,he would do exactly the same and hedid not wash anywhere else.\"'",
      "chain": [
        "38433",
        "20031",
        "24050",
        "11283"
      ]
    },
    {
      "hadith_no": "4811",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن عيسى بن النقاش، قال حدثنا يزيد، - يعني ابن هارون - قال أنبأنا حماد، عن قتادة، عن خلاس، عن علي، وعن أيوب، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ المكاتب يعتق بقدر ما أدى ويقام عليه الحد بقدر ما عتق منه ويرث بقدر ما عتق منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas tht the Prophet said:                     \"The Mukatab is free to the extent that the has paid off (toward buying his freedom); he Hadd punishment should be carried out on him proportionate to the amount he has paid off (toward buying his freedom); and he inherits proportionate to the amount he has paid off (toward buying his freedom).\"",
      "chain": [
        "31167",
        "20472",
        "20022",
        "11019",
        "11283",
        "5",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5049",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن موسى الحرشي، قال حدثنا أبو داود، قال حدثنا همام، عن قتادة، عن خلاس، عن علي، نهى رسول الله صلى الله عليه وسلم أن تحلق المرأة رأسها ‏.‏",
      "text_en": " It was narrated from 'Ali:                     \"The Messenger of Allah [SAW] forbade women to shave their heads.\"",
      "chain": [
        "38603",
        "30002",
        "20297",
        "11019",
        "11283"
      ]
    },
    {
      "hadith_no": "1051",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو ثور، إبراهيم بن خالد حدثنا أبو قطن، حدثنا شعبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لو يعلمون ما في الصف الأول لكانت قرعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘If they knew what (goodness) there is in the first row, theywould cast lots for it.’”",
      "chain": [
        "38072",
        "20563",
        "20020",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عوف، عن خلاس، ومحمد بن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أكل ناسيا وهو صائم فليتم صومه فإنما أطعمه الله وسقاه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     \"Whoever eats out of forgetfulness while fasting, let himcomplete his fast, for it is Allah Who has fed him and given him todrink.\"",
      "chain": [
        "30201",
        "20318",
        "11298",
        "11283",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2329",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي عروبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أنه ذكر أن رجلين، ادعيا دابة ولم يكن بينهما بينة فأمرهما النبي صلى الله عليه وسلم أن يستهما على اليمين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     he said that two men laid claim to an animal, and neither of them had any proof, so the Prophet (ﷺ) commanded them to cast lots as to which of them should swear an oath.",
      "chain": [
        "30201",
        "20226",
        "11073",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2346",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رجلين، تدارءا في بيع ليس لواحد منهما بينة فأمرهما رسول الله صلى الله عليه وسلم أن يستهما على اليمين أحبا ذلك أم كرها ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     two men disputed concerning a transaction, and neither of them had proof. The Messenger of Allah commanded them to draw lots as to which of them should swear an oath, whether they liked it or not.",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2474",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عوف، عن خلاس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن مثل الذي يعود في عطيته كمثل الكلب أكل حتى إذا شبع قاء ثم عاد في قيئه فأكله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “The likeness of one who takes back his gift is that of a dog that eats until it is full and vomits; then it goes back to its vomit and eats it again.”",
      "chain": [
        "30201",
        "20318",
        "11298",
        "11283",
        "13"
      ]
    }
  ],
  "total_hadiths": 22
}