{
  "id": "11285",
  "name": "Ziyad bin Jubayr bin Hiyya زياد بن جبير بن حية",
  "full_name": "Ziyad bin Jubayr bin Hiyya زياد بن جبير بن حية",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "3225",
      "name": "Jubayr bin Hayya al-Thaqafi ( جبير بن حية الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3225",
      "name": "Jubayr bin Hayya al-Thaqafi ( جبير بن حية الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11590",
      "name": "Sa'id bin 'Ubaidullah B. Jubayr B. Hiyya سعيد بن عبيد الله بن جبير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28580",
      "name": "al-Mughira bin 'Ubaidullah bin Jubayr المغيرة بن عبيد الله بن جبير بن حية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1738",
      "hadith_no": "1738",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن يونس، عن زياد بن جبير، قال رأيت ابن عمر  رضى الله عنهما  أتى على رجل، قد أناخ بدنته ينحرها، قال ابعثها قياما مقيدة، سنة محمد صلى الله عليه وسلم‏.‏ وقال شعبة عن يونس أخبرني زياد‏.‏",
      "text_en": " Narrated Ziyad bin Jubair:                     I saw Ibn `Umar passing by a man who had made his Badana sit to slaughter it. Ibn `Umar said, \"Slaughter it while it is standing with one leg tied up as is the tradition of Muhammad.\"",
      "usc_msa_ref": "771",
      "chain": [
        "20164",
        "20304",
        "20475",
        "11285"
      ]
    },
    {
      "id": "sahih-bukhari-1994",
      "hadith_no": "1994",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ، أخبرنا ابن عون، عن زياد بن جبير، قال جاء رجل إلى ابن عمر  رضى الله عنهما  فقال رجل نذر أن يصوم يوما، قال أظنه قال الاثنين، فوافق يوم عيد‏.‏ فقال ابن عمر أمر الله بوفاء النذر، ونهى النبي صلى الله عليه وسلم عن صوم هذا اليوم‏.‏",
      "text_en": " Narrated Ziyad bin Jubair:                     A man went to Ibn `Umar I. and said, \"A man vowed to fast one day (the sub-narrator thinks that he said that the day was Monday), and that day happened to be `Id day.\" Ibn `Umar said, \"Allah orders vows to be fulfilled and the Prophet forbade the fasting on this day (i.e. Id).",
      "usc_msa_ref": "214",
      "chain": [
        "30170",
        "32",
        "11071",
        "11285"
      ]
    },
    {
      "id": "sahih-bukhari-3159",
      "hadith_no": "3159",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير، عن جبير بن حية، قال بعث عمر الناس في أفناء الأمصار يقاتلون المشركين، فأسلم الهرمزان فقال إني مستشيرك في مغازي هذه‏.‏ قال نعم، مثلها ومثل من فيها من الناس من عدو المسلمين مثل طائر له رأس وله جناحان وله رجلان، فإن كسر أحد الجناحين نهضت الرجلان بجناح والرأس، فإن كسر الجناح الآخر نهضت الرجلان والرأس، وإن شدخ الرأس ذهبت الرجلان والجناحان والرأس، فالرأس كسرى، والجناح قيصر، والجناح الآخر فارس، فمر المسلمين فلينفروا إلى كسرى‏.‏ وقال بكر وزياد جميعا عن جبير بن حية قال فندبنا عمر واستعمل علينا النعمان بن مقرن، حتى إذا كنا بأرض العدو، وخرج علينا عامل كسرى في أربعين ألفا، فقام ترجمان فقال ليكلمني رجل منكم‏.‏ فقال المغيرة سل عما شئت‏.‏ قال ما أنتم قال نحن أناس من العرب كنا في شقاء شديد وبلاء شديد، نمص الجلد والنوى من الجوع، ونلبس الوبر والشعر، ونعبد الشجر والحجر، فبينا نحن كذلك، إذ بعث رب السموات ورب الأرضين تعالى ذكره وجلت عظمته إلينا نبيا من أنفسنا، نعرف أباه وأمه، فأمرنا نبينا رسول ربنا صلى الله عليه وسلم أن نقاتلكم حتى تعبدوا الله وحده أو تؤدوا الجزية، وأخبرنا نبينا صلى الله عليه وسلم عن رسالة ربنا أنه من قتل منا صار إلى الجنة في نعيم لم ير مثلها قط، ومن بقي منا ملك رقابكم‏.‏ فقال النعمان ربما أشهدك الله مثلها مع النبي صلى الله عليه وسلم فلم يندمك ولم يخزك، ولكني شهدت القتال مع رسول الله صلى الله عليه وسلم كان إذا لم يقاتل في أول النهار انتظر حتى تهب الأرواح وتحضر الصلوات‏.‏",
      "text_en": " Narrated Jubair bin Haiya:                     `Umar sent the Muslims to the great countries to fight the pagans. When Al-Hurmuzan embraced Islam, `Umar said to him. \"I would like to consult you regarding these countries which I intend to invade.\" Al-Hurmuzan said, \"Yes, the example of these countries and their inhabitants who are the enemies. of the Muslims, is like a bird with a head, two wings and two legs; If one of its wings got broken, it would get up over its two legs, with one wing and the head; and if the other wing got broken, it would get up with two legs and a head, but if its head got destroyed, then the two legs, two wings and the head would become useless. The head stands for Khosrau, and one wing stands for Caesar and the other wing stands for Faris. So, order the Muslims to go towards Khosrau.\" So, `Umar sent us (to Khosrau) appointing An-Nu`man bin Muqrin as our commander. When we reached the land of the enemy, the representative of Khosrau came out with forty-thousand warriors, and an interpreter got up saying, \"Let one of you talk to me!\" Al-Mughira replied, \"Ask whatever you wish.\" The other asked, \"Who are you?\" Al-Mughira replied, \"We are some people from the Arabs; we led a hard, miserable, disastrous life: we used to suck the hides and the date stones from hunger; we used to wear clothes made up of fur of camels and hair of goats, and to worship trees and stones. While we were in this state, the Lord of the Heavens and the Earths, Elevated is His Remembrance and Majestic is His Highness, sent to us from among ourselves a Prophet whose father and mother are known to us. Our Prophet, the Messenger of our Lord, has ordered us to fight you till you worship Allah Alone or give Jizya (i.e. tribute); and our Prophet has informed us that our Lord says:-- \"Whoever amongst us is killed (i.e. martyred), shall go to Paradise to lead such a luxurious life as he has never seen, and whoever amongst us remain alive, shall become your master.\" (Al-Mughira, then blamed An-Nu`man for delaying the attack and) An-Nu' man said to Al-Mughira, \"If you had participated in a similar battle, in the company of Allah's Apostle he would not have blamed you for waiting, nor would he have disgraced you. But I accompanied Allah's Apostle in many battles and it was his custom that if he did not fight early by daytime, he would wait till the wind had started blowing and the time for the prayer was due (i.e. after midday).",
      "usc_msa_ref": "386",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225"
      ]
    },
    {
      "id": "sahih-bukhari-6791",
      "hadith_no": "6791",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن يونس، عن زياد بن جبير، قال كنت مع ابن عمر فسأله رجل فقال نذرت أن أصوم كل يوم ثلاثاء أو أربعاء ما عشت، فوافقت هذا اليوم يوم النحر‏.‏ فقال أمر الله بوفاء النذر، ونهينا أن نصوم يوم النحر‏.‏ فأعاد عليه فقال مثله، لا يزيد عليه‏.‏",
      "text_en": " Narrated Ziyad bin Jubair:                     I was with Ibn `Umar when a man asked him, \"I have vowed to fast every Tuesday or Wednesday throughout my life and if the day of my fasting coincided with the day of Nahr (the first day of `Id-al- Adha), (What shall I do?)\" Ibn `Umar said, \"Allah has ordered the vows to be fulfilled, and we are forbidden to fast on the day of Nahr.\" The man repeated his question and Ibn `Umar repeated his former answer, adding nothing more.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20304",
        "20475",
        "11285"
      ]
    },
    {
      "id": "sahih-bukhari-7624",
      "hadith_no": "7624",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير بن حية، عن جبير بن حية، قال المغيرة أخبرنا نبينا، صلى الله عليه وسلم عن رسالة، ربنا ‏\"‏ أنه من قتل منا صار إلى الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Our Prophet has informed us our Lord's Message that whoever of us is martyred, will go to Paradise.",
      "usc_msa_ref": "621",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-2731",
      "hadith_no": "2731",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن ابن عون، عن زياد بن جبير، قال جاء رجل إلى ابن عمر - رضى الله عنهما - فقال إني نذرت أن أصوم يوما فوافق يوم أضحى أو فطر ‏.‏ فقال ابن عمر رضى الله عنهما أمر الله تعالى بوفاء النذر ونهى رسول الله صلى الله عليه وسلم عن صوم هذا اليوم ‏.‏",
      "text_en": " Ziyad b. Jubair reported that a person came to Ibn 'Umar (Allah be pleased with them) and said:                      I had taken a vow that I would fast on the day (but it accidentally) synchronises with the day of Adha or the day of Fitr. Thereupon Ibn 'Umar (Allah be pleased with him) said: Allah, the Exalted, has commanded fulfilling of the vow, but the Messenger of Allah (may peace be upon him) has forbidden the observance of fast on this day.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11071",
        "11285"
      ]
    },
    {
      "id": "sahih-muslim-3255",
      "hadith_no": "3255",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن يونس، عن زياد بن جبير، أن ابن عمر، أتى على رجل وهو ينحر بدنته باركة فقال ابعثها قياما مقيدة سنة نبيكم صلى الله عليه وسلم ‏.‏",
      "text_en": " Ziyad b. Jubair reported that Ibn 'Umar came upon a person who was slaughtering (sacrificing) his camel and had made him kneel down. So he told him to make it stand up festered (and then sacrifice it) according to the Sunnah of the Holy Prophet (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "20475",
        "11285"
      ]
    },
    {
      "id": "sunan-abi-daud-1686",
      "hadith_no": "1686",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سوار المصري، حدثنا عبد السلام بن حرب، عن يونس بن عبيد، عن زياد بن جبير، عن سعد، قال لما بايع رسول الله صلى الله عليه وسلم النساء قامت امرأة جليلة كأنها من نساء مضر فقالت يا نبي الله إنا كل على آبائنا وأبنائنا - قال أبو داود وأرى فيه وأزواجنا - فما يحل لنا من أموالهم فقال ‏\"‏ الرطب تأكلنه وتهدينه ‏\"‏ ‏.‏ قال أبو داود الرطب الخبز والبقل والرطب ‏.‏ قال أبو داود وكذا رواه الثوري عن يونس ‏.‏",
      "text_en": " Sa’d said When the Messenger of Allah (SWAS) took the oath of allegiance from woman, a woman of high rank, who seemed to be one of the women of Mudar, rose and said Prophet of Allah (SWAS), we are dependant on our parents, our sons.  (Abu Dawud said I think (this version) has the word “ and our husbands”. )  So what part of their property can be spent lawfully?  He said Fresh food which you eat and give as a present.  Abu Dawud said The Arabic word ratb means bread, vegetables and fresh dates.  Abu Dawud said Al-Thawri transmitted from Yunus in a similar manner.",
      "usc_msa_ref": "",
      "chain": [
        "35127",
        "20248",
        "11075",
        "11285",
        "9"
      ]
    },
    {
      "id": "sunan-abi-daud-1768",
      "hadith_no": "1768",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا يونس، أخبرني زياد بن جبير، قال كنت مع ابن عمر بمنى فمر برجل وهو ينحر بدنته وهي باركة فقال ابعثها قياما مقيدة سنة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Ziyad bin Jubair said :                      I was present with Ibn `Umar at Minah.  He passed a man who was sacrificing his camel while it was sitting.  He said make it stand and tie its leg ; thus follow the practice (sunnah) of Muhammad (SWAS).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20468",
        "20475",
        "11285"
      ]
    },
    {
      "id": "sunan-abi-daud-3180",
      "hadith_no": "3180",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن يونس، عن زياد بن جبير، عن أبيه، عن المغيرة بن شعبة، - وأحسب أن أهل، زياد أخبروني أنه، رفعه إلى النبي صلى الله عليه وسلم - قال ‏\"‏ الراكب يسير خلف الجنازة والماشي يمشي خلفها وأمامها وعن يمينها وعن يسارها قريبا منها والسقط يصلى عليه ويدعى لوالديه بالمغفرة والرحمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     (I think that the people of Ziyad informed me that he reported on the authority of the Prophet (ﷺ): A rider should go behind the bier, and those on foot should walk behind it, in front of it, on its right and on its left keeping near it. Prayer should be offered over an abortion and forgiveness and mercy supplicated for its parents.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "20475",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1031",
      "hadith_no": "1031",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا بشر بن آدم ابن بنت أزهر السمان البصري، حدثنا إسماعيل بن سعيد بن عبيد الله، حدثنا أبي، عن زياد بن جبير بن حية، عن أبيه، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح رواه إسرائيل وغير واحد عن سعيد بن عبيد الله ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا يصلى على الطفل وإن لم يستهل بعد أن يعلم أنه خلق ‏.‏ وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated that:                     The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"",
      "usc_msa_ref": "",
      "chain": [
        "30125",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "sunan-an-nasai-1942",
      "hadith_no": "1942",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا عبد الواحد بن واصل، قال حدثنا سعيد بن عبيد الله، وأخوه المغيرة، جميعا عن زياد بن جبير، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu,bah said:                     \"The Messenger of Allah said: The riders should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "11629",
        "11285",
        "166"
      ]
    },
    {
      "id": "sunan-an-nasai-1943",
      "hadith_no": "1943",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني أحمد بن بكار الحراني، قال حدثنا بشر بن السري، عن سعيد الثقفي، عن عمه، زياد بن جبير بن حية عن أبيه، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu'bah said:                     \"The Messenger of Allah said: \"The rider should travel behind the Janazah and the pedestrian may travel wherever he wishes, and the (funeral) prayer should be offered for a child.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38007",
        "20190",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "sunan-an-nasai-1948",
      "hadith_no": "1948",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا سعيد بن عبيد الله، قال سمعت زياد بن جبير، يحدث عن أبيه، عن المغيرة بن شعبة، أنه ذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that:                     the Messenger of Allah said: \"The rider should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11629",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-1548",
      "hadith_no": "1548",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا روح بن عبادة، حدثنا سعيد بن عبيد الله بن جبير بن حية، حدثني زياد بن جبير بن حية، سمع المغيرة بن شعبة، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الراكب خلف الجنازة والماشي منها حيث شاء ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah bin Shu’bah said:                      “I heard the Messenger of Allah(ﷺ)say: ‘The rider should travel behind the funeral (procession)but theone who is walking may walk wherever he wants.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20229",
        "11629",
        "11285",
        "166"
      ]
    }
  ],
  "total_hadiths": 15
}