{
  "id": "11289",
  "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
  "full_name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "143",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19322",
      "name": "Abu 'Uthman أبو عثمان ليس بالنهدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10973",
      "name": "N'ym bin Abi Hnd نعيم بن أبي هند",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10922",
      "name": "Durayb bin Nufayr, Abu al-Salayl al-Qays ضريب بن نقير أبو السليل القيسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11290",
      "name": "Siyar bin Salaama, Abu al-Minhal سيار بن سلامة الرياحي أبو المنهال",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11612",
      "name": "Ma'bd bin Hilal al-Nzy معبد بن هلال العنزي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10710",
      "name": "Ghnym bin Qays al-Mazny غنيم بن قيس المازني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10701",
      "name": "'Abdur Rahman bin Aadm عبد الرحمن بن آدم أم برثن - صاحب السقاية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11318",
      "name": "Yazid bin 'Abdullah bin al-Shakhayr يزيد بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11316",
      "name": "Yahya bin Y'amar يحيى بن يعمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20546",
      "name": "Sulaym bin Aghdar سليم بن أخضر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20329",
      "name": "Abthr bin al-Qasim al-Zbydy Abu عبثر بن القاسم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20305",
      "name": "Yusuf bin Y'aqub al-Sadusi al-Sal'ai يوسف بن يعقوب أبو يعقوب السلعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "129",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، قال ذكر لي أن النبي صلى الله عليه وسلم قال لمعاذ ‏\"‏ من لقي الله لا يشرك به شيئا دخل الجنة ‏\"‏‏.‏ قال ألا أبشر الناس قال ‏\"‏ لا، إني أخاف أن يتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     I was informed that the Prophet had said to Mu`adh, \"Whosoever will meet Allah without associating anything in worship with Him will go to Paradise.\" Mu`adh asked the Prophet, \"Should I not inform the people of this good news?\" The Prophet replied, \"No, I am afraid, lest they should depend upon it (absolutely).",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "526",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد بن زريع، عن سليمان التيمي، عن أبي عثمان النهدي، عن ابن مسعود، أن رجلا، أصاب من امرأة قبلة، فأتى النبي صلى الله عليه وسلم فأخبره، فأنزل الله ‏{‏أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات‏}‏‏.‏ فقال الرجل يا رسول الله ألي هذا قال ‏\"‏ لجميع أمتي كلهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     A man kissed a woman (unlawfully) and then went to the Prophet and informed him. Allah revealed: And offer prayers perfectly At the two ends of the day And in some hours of the night (i.e. the five compulsory prayers). Verily! good deeds remove (annul) the evil deeds (small sins) (11.114). The man asked Allah's Apostle, \"Is it for me?\" He said, \"It is for all my followers.\"",
      "chain": [
        "30367",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "602",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر بن سليمان، قال حدثنا أبي، حدثنا أبو عثمان، عن عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا أناسا فقراء، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، وإن أربع فخامس أو سادس ‏\"‏‏.‏ وأن أبا بكر جاء بثلاثة فانطلق النبي صلى الله عليه وسلم بعشرة، قال فهو أنا وأبي وأمي، فلا أدري قال وامرأتي وخادم بيننا وبين بيت أبي بكر‏.‏ وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حيث صليت العشاء، ثم رجع فلبث حتى تعشى النبي صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته وما حبسك عن أضيافك  أو قالت ضيفك  قال أوما عشيتيهم قالت أبوا حتى تجيء، قد عرضوا فأبوا‏.‏ قال فذهبت أنا فاختبأت فقال يا غنثر، فجدع وسب، وقال كلوا لا هنيئا‏.‏ فقال والله لا أطعمه أبدا، وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها‏.‏ قال يعني حتى شبعوا وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فإذا هي كما هي أو أكثر منها‏.‏ فقال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏.‏ فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عقد، فمضى الأجل، ففرقنا اثنا عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل فأكلوا منها أجمعون، أو كما قال‏.‏",
      "text_en": " Narrated Abu `Uthman:                     `Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet till the Prophet took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "621",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يمنعن أحدكم  أو أحدا منكم  أذان بلال من سحوره، فإنه يؤذن  أو ينادي  بليل، ليرجع قائمكم ولينبه نائمكم، وليس أن يقول الفجر أو الصبح ‏\"‏‏.‏ وقال بأصابعه ورفعها إلى فوق وطأطأ إلى أسفل حتى يقول هكذا‏.‏ وقال زهير بسبابتيه إحداهما فوق الأخرى ثم مدها عن يمينه وشماله‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"The Adhan pronounced by Bilal should not stop you from taking Suhur, for he pronounces the Adhan at night, so that the one offering the late night prayer (Tahajjud) from among you might hurry up and the sleeping from among you might wake up. It does not mean that dawn or morning has started.\" Then he (the Prophet) pointed with his fingers and raised them up (towards the sky) and then lowered them (towards the earth) like this (Ibn Mas`ud imitated the gesture of the Prophet). Az-Zuhri gestured with his two index fingers which he put on each other and then stretched them to the right and left. These gestures illustrate the way real dawn appears. It spreads left and right horizontally. The dawn that appears in the high sky and lowers down is not the real dawn) .",
      "chain": [
        "30184",
        "20321",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "766",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت له قال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. On my inquiring, he said, \"I prostrated behind Abul-Qasim (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "768",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يزيد بن زريع، قال حدثني التيمي، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     Once I prayed the `Isha' prayer with Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. I said, \"What is that?\" He said, \"I prostrated behind Abul-Qasim, (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن يونس، قال حدثنا زائدة، عن التيمي، عن أبي مجلز، عن أنس، قال قنت النبي صلى الله عليه وسلم شهرا يدعو على رعل وذكوان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
      "chain": [
        "30184",
        "20320",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "1078",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، حدثني بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد فيها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited Idhas-Sama' Un-Shaqqat, and prostrated. I said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abul-Qasim and I will do the same till I meet him.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو عثمان، عن عبد الله بن مسعود  رضى الله عنه  قال من اشترى شاة محفلة، فردها فليرد معها صاعا‏.‏ ونهى النبي صلى الله عليه وسلم أن تلقى البيوع‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Whoever buys a sheep which has not been milked for a long time, has the option of returning it along with one Sa of dates; and the Prophet forbade going to meet the seller on the way (as he has no knowledge of the market price and he may sell his goods at a low price).",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، قال حدثني التيمي، عن أبي عثمان، عن عبد الله  رضى الله عنه  قال من اشترى محفلة فليرد معها صاعا‏.‏ قال ونهى النبي صلى الله عليه وسلم عن تلقي البيوع‏.‏",
      "text_en": " Narrated `Abdullah:                     Whoever buys an animal which has been kept unmilked for a long time, could return it, but has to pay a Sa of dates along with it. And the Prophet forbade meeting the owners of goods on the way away from the market.",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2216",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية أو قال أم هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ فاشترى منه شاة‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were with the Prophet when a tall pagan with long matted unkempt hair came driving his sheep. The Prophet asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" The Prophet bought one sheep from him.",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو النعمان، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها، فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية  أو قال  أم هبة ‏\"‏‏.‏ قال لا، بل بيع‏.‏ فاشترى منه شاة، فصنعت وأمر النبي صلى الله عليه وسلم بسواد البطن أن يشوى، وايم الله ما في الثلاثين والمائة إلا قد حز النبي صلى الله عليه وسلم له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأ له، فجعل منها قصعتين، فأكلوا أجمعون، وشبعنا، ففضلت القصعتان، فحملناه على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one-hundred and thirty persons accompanying the Prophet who asked us whether anyone of us had food. There was a man who had about a Sa of wheat which was mixed with water then. A very tall pagan came driving sheep. The Prophet asked him, \"Will you sell us (a sheep) or give it as a present?\" He said, \"I will sell you (a sheep).\" The Prophet bought a sheep and it was slaughtered. The Prophet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet gave every person of the one-hundred-and-thirty a piece of that; he gave all those of them who were present; and kept the shares of those who were absent. The Prophet then put its meat in two huge basins and all of them ate to their fill, and even then more food was left in the two basins which were carried on the camel (or said something like it).",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي أن أنسا  رضى الله عنه  قال قيل للنبي صلى الله عليه وسلم لو أتيت عبد الله بن أبى‏.‏ فانطلق إليه النبي صلى الله عليه وسلم وركب حمارا، فانطلق المسلمون يمشون معه، وهى أرض سبخة، فلما أتاه النبي صلى الله عليه وسلم فقال إليك عني، والله لقد آذاني نتن حمارك‏.‏ فقال رجل من الأنصار منهم والله لحمار رسول الله صلى الله عليه وسلم أطيب ريحا منك‏.‏ فغضب لعبد الله رجل من قومه فشتما، فغضب لكل واحد منهما أصحابه، فكان بينهما ضرب بالجريد والأيدي والنعال، فبلغنا أنها أنزلت ‏{‏وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏‏.‏",
      "text_en": " Narrated Anas:                     It was said to the Prophet \"Would that you see `Abdullah bin Ubai.\" So, the Prophet went to him, riding a donkey, and the Muslims accompanied him, walking on salty barren land. When the Prophet reached `Abdullah bin Ubai, the latter said, \"Keep away from me! By Allah, the bad smell of your donkey has harmed me.\" On that an Ansari man said (to `Abdullah), \"By Allah! The smell of the donkey of Allah's Apostle is better than your smell.\" On that a man from `Abdullah's tribe got angry for `Abdullah's sake, and the two men abused each other which caused the friends of the two men to get angry, and the two groups started fighting with sticks, shoes and hands. We were informed that the following Divine Verse was revealed (in this concern):-- \"And if two groups of Believers fall to fighting then, make peace between them.\" (49.9)",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "2823",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي قال، سمعت أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل والجبن والهرم، وأعوذ بك من فتنة المحيا والممات، وأعوذ بك من عذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to say, \"O Allah! I seek refuge with You from helplessness, laziness, cowardice and feeble old age; I seek refuge with You from afflictions of life and death and seek refuge with You from the punishment in the grave.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3128",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، قال سمعت أنس بن مالك  رضى الله عنه  يقول كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     People used to give some of their datepalms to the Prophet (as a gift), till he conquered Bani Quraiza and Bani An-Nadir, whereupon he started returning their favors.",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3622",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، عن أبيه، حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر  رضى الله عنهما  أن أصحاب، الصفة كانوا أناسا فقراء، وأن النبي  صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، ومن كان عنده طعام أربعة فليذهب بخامس أو سادس ‏\"‏‏.‏ أو كما قال، وأن أبا بكر جاء بثلاثة وانطلق النبي صلى الله عليه وسلم بعشرة، وأبو بكر وثلاثة، قال فهو أنا وأبي وأمي  ولا أدري هل قال امرأتي وخادمي  بين بيتنا وبين بيت أبي بكر، وأن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حتى صلى العشاء، ثم رجع فلبث حتى تعشى رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته ما حبسك عن أضيافك أو ضيفك‏.‏ قال أو عشيتهم قالت أبوا حتى تجيء، قد عرضوا عليهم فغلبوهم، فذهبت فاختبأت، فقال يا غنثر‏.‏ فجدع وسب وقال كلوا وقال لا أطعمه أبدا‏.‏ قال وايم الله ما كنا نأخذ من اللقمة إلا ربا من أسفلها أكثر منها حتى شبعوا، وصارت أكثر مما كانت قبل، فنظر أبو بكر فإذا شىء أو أكثر قال لامرأته يا أخت بني فراس‏.‏ قالت لا وقرة عيني لهى الآن أكثر مما قبل بثلاث مرات‏.‏ فأكل منها أبو بكر، وقال إنما كان الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده‏.‏ وكان بيننا وبين قوم عهد، فمضى الأجل، فتفرقنا اثنا عشر رجلا مع كل رجل منهم أناس‏.‏ الله أعلم كم مع كل رجل، غير أنه بعث معهم، قال أكلوا منها أجمعون‏.‏ أو كما قال‏.‏    وغيره يقول فعرفنا من العرافة",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakr:                     The companions of Suffa were poor people. The Prophet once said, \"Whoever has food enough for two persons, should take a third one (from among them), and whoever has food enough for four persons, should take a fifth or a sixth (or said something similar).\" Abu Bakr brought three persons while the Prophet took ten. And Abu Bakr with his three family member (who were I, my father and my mother) (the sub-narrator is in doubt whether `Abdur-Rahman said, \"My wife and my servant who was common for both my house and Abu Bakr's house.\") Abu Bakr took his supper with the Prophet and stayed there till he offered the `Isha' prayers. He returned and stayed till Allah's Apostle took his supper. After a part of the night had passed, he returned to his house. His wife said to him, \"What has detained you from your guests?\" He said, \"Have you served supper to them?\" She said, \"They refused to take supper until you come. They (i.e. some members of the household) presented the meal to them but they refused (to eat)\" I went to hide myself and he said, \"O Ghunthar!\" He invoked Allah to cause my ears to be cut and he rebuked me. He then said (to them): Please eat!\" and added, I will never eat the meal.\" By Allah, whenever we took a handful of the meal, the meal grew from underneath more than that handful till everybody ate to his satisfaction; yet the remaining food was more than the original meal. Abu Bakr saw that the food was as much or more than the original amount. He called his wife, \"O sister of Bani Firas!\" She said, \"O pleasure of my eyes. The food has been tripled in quantity.\" Abu Bakr then started eating thereof and said, \"It (i.e. my oath not to eat) was because of Sa all.\" He took a handful from it, and carried the rest to the Prophet. So that food was with the Prophet . There was a treaty between us and some people, and when the period of that treaty had elapsed, he divided US into twelve groups, each being headed by a man. Allah knows how many men were under the command of each leader. Anyhow, the Prophet surely sent a leader with each group. Then all of them ate of that meal.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "3677",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عباس بن الوليد النرسي، حدثنا معتمر، قال سمعت أبي، حدثنا أبو عثمان، قال أنبئت أن جبريل  عليه السلام  أتى النبي صلى الله عليه وسلم وعنده أم سلمة، فجعل يحدث ثم قام، فقال النبي صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏‏.‏ أو كما قال‏.‏ قال قالت هذا دحية‏.‏ قالت أم سلمة ايم الله ما حسبته إلا إياه حتى سمعت خطبة نبي الله صلى الله عليه وسلم يخبر جبريل أو كما قال‏.‏ قال فقلت لأبي عثمان ممن سمعت هذا قال من أسامة بن زيد‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I got the news that Gabriel came to the Prophet while Um Salama was present. Gabriel started talking (to the Prophet and then left. The Prophet said to Um Salama, \"(Do you know) who it was?\" (or a similar question). She said, \"It was Dihya (a handsome person amongst the companions of the Prophet ).\" Later on Um Salama said, \"By Allah! I thought he was none but Dihya, till I heard the Prophet talking about Gabriel in his sermon.\" (The Sub-narrator asked Abu `Uthman, \"From where have you heard this narration?\" He replied, \"From Usama bin Zaid.\")",
      "chain": [
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن أبي بكر المقدمي، حدثنا معتمر، عن أبيه، عن أبي عثمان، قال لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Abu `Uthman:                     During one of the Ghazawat in which Allah's Apostle was fighting, none remained with the Prophet but Talha and Sa`d.",
      "chain": [
        "30161",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "3781",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، قال سمعت أبي، حدثنا أبو عثمان، عن أسامة بن زيد  رضى الله عنهما  حدث عن النبي صلى الله عليه وسلم أنه كان يأخذه والحسن فيقول ‏\"‏ اللهم أحبهما فإني أحبهما ‏\"‏‏.‏",
      "text_en": "      Narrated Usama bin Zaid:                          That the Prophet used to take him (i.e. Usama) and Al-Hassan (in his      lap) and say: \"O Allah! Love them, as I love them.\"",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "3792",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي قال، حدثنا أبو عثمان، عن أسامة بن زيد  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه كان يأخذه والحسن ويقول ‏\"‏ اللهم إني أحبهما فأحبهما ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     That the Prophet used to take him and Al-Hasan, and used to say, \"O Allah! I love them, so please love them,\" or said something similar.",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "3994",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني الحسن بن عمر بن شقيق، حدثنا معتمر، قال أبي وحدثنا أبو عثمان، عن سلمان الفارسي، أنه تداوله بضعة عشر من رب إلى رب‏.‏",
      "text_en": " Narrated Salman Al-Farisi:                     That he was sold (as a slave) by one master to another for more than ten times (i.e between 13 and 19).",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "hadith_no": "4010",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سليمان التيمي، أن أنسا، حدثهم قال قال النبي صلى الله عليه وسلم ح وحدثني عمرو بن خالد حدثنا زهير عن سليمان التيمي عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد قال آأنت أبو جهل قال فأخذ بلحيته‏.‏ قال وهل فوق رجل قتلتموه أو رجل قتله قومه قال أحمد بن يونس أنت أبو جهل‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and found that the two sons of 'Afra had struck him fatally (and he was in his last breaths). `Abdullah bin Mas`ud said, \"Are you Abu Jahl?\" And took him by the beard. Abu Jahl said, \"Can there be a man superior to one you have killed or one whom his own folk have killed?\"",
      "chain": [
        "30184",
        "20321",
        "11289"
      ]
    },
    {
      "hadith_no": "4011",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن سليمان التيمي، عن أنس، رضى الله عنه قال قال النبي صلى الله عليه وسلم يوم بدر ‏\"‏ من ينظر ما فعل أبو جهل ‏\"‏‏.‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد، فأخذ بلحيته فقال أنت أبا جهل قال وهل فوق رجل قتله قومه أو قال قتلتموه‏.‏",
      "text_en": " Narrated Anas:                     On the day of Badr, the Prophet said, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and found that the two sons of 'Afra had struck him fatally. `Abdullah bin Mas`ud got hold of his beard and said, \"'Are you Abu Jahl?\" He replied, \"Can there be a man more superior to one whom his own folk have killed (or you have killed)?\"",
      "chain": [
        "30170",
        "20276",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله الرقاشي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  أنه قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ وقال قيس بن عباد وفيهم أنزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين تبارزوا يوم بدر حمزة وعلي وعبيدة أو أبو عبيدة بن الحارث وشيبة بن ربيعة وعتبة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Mijlaz:                     From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), the Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also said, \"The following Verse was revealed in their connection:-- \"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) Qais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu 'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4016",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم الصواف، حدثنا يوسف بن يعقوب  كان ينزل في بني ضبيعة وهو مولى لبني سدوس  حدثنا سليمان التيمي، عن أبي مجلز، عن قيس بن عباد، قال قال علي  رضى الله عنه فينا نزلت هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏",
      "text_en": " Narrated `Ali:                     The following Holy Verse:-- \"These two opponents (believers and disbelievers) dispute with each other about their Lord.\" (22.19) was revealed concerning us.",
      "chain": [
        "30123",
        "20305",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4069",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا سليمان التيمي، حدثنا أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏‏.‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد، فقال آنت أبا جهل قال ابن علية قال سليمان هكذا قالها أنس‏.‏ قال أنت أبا جهل قال وهل فوق رجل قتلتموه قال سليمان أو قال قتله قومه‏.‏ قال وقال أبو مجلز قال أبو جهل فلو غير أكار قتلني‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said on the day of Badr, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and saw him struck by the two sons of 'Afra and was on the point of death . Ibn Mas`ud said, \"Are you Abu Jahl?\" Abu Jahl replied, \"Can there be a man more superior to the one whom you have killed (or as Sulaiman said, or his own folk have killed.)?\" Abu Jahl added, \"Would that I had been killed by other than a mere farmer. \"",
      "chain": [
        "20184",
        "20208",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، سمعت أنس بن مالك  رضى الله عنه قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some people used to allot some date palm trees to the Prophet as gift till he conquered Banu Quraiza and Bani An-Nadir, where upon he started returning their date palms to them.",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4110",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، عن معتمر، عن أبيه، قال زعم أبو عثمان أنه لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي يقاتل فيهن غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Mu'tamir's father:                     `Uthman said that on the day of the battle of Uhud, none remained with the Prophet but Talha and Sa`d.",
      "chain": [
        "20040",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا سليمان التيمي، عن أبي مجلز، عن أنس  رضى الله عنه  قال قنت النبي صلى الله عليه وسلم بعد الركوع شهرا يدعو على رعل وذكوان ويقول ‏\"‏ عصية عصت الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said Al-Qunut after Bowing (i.e. Ar-Ruku') for one month, invoking evil upon (the tribes of) Ril and Dhakwan. He used to say, \"Usaiya disobeyed Allah and His Apostle.\"",
      "chain": [
        "30213",
        "20025",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا معتمر، وحدثني خليفة، حدثنا معتمر، قال سمعت أبي، عن أنس  رضى الله عنه  قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله الذين كانوا أعطوه أو بعضه‏.‏ وكان النبي صلى الله عليه وسلم قد أعطاه أم أيمن، فجاءت أم أيمن فجعلت الثوب في عنقي تقول كلا والذي لا إله إلا هو لا يعطيكهم وقد أعطانيها، أو كما قالت، والنبي صلى الله عليه وسلم يقول ‏\"‏ لك كذا ‏\"‏‏.‏ وتقول كلا والله‏.‏ حتى أعطاها، حسبت أنه قال ‏\"‏ عشرة أمثاله ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Anas:                     Some (of the Ansar) used to present date palm trees to the Prophet till Banu Quraiza and Banu An- Nadir were conquered (then he returned to the people their date palms). My people ordered me to ask the Prophet to return some or all the date palms they had given to him, but the Prophet had given those trees to Um Aiman. On that, Um Aiman came and put the garment around my neck and said, \"No, by Him except Whom none has the right to be worshipped, he will not return those trees to you as he (i.e. the Prophet ) has given them to me.\" The Prophet go said (to her), \"Return those trees and I will give you so much (instead of them).\" But she kept on refusing, saying, \"No, by Allah,\" till he gave her ten times the number of her date palms.",
      "chain": [
        "30145",
        "20288",
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4530",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا معتمر، عن أبيه، عن أنس  رضى الله عنه  قال لم يبق ممن صلى القبلتين غيري‏.‏",
      "text_en": " Narrated Anas:                     None remains of those who prayed facing both Qiblas (that is, Jerusalem and Mecca) except myself.",
      "chain": [
        "30026",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4733",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يزيد  هو ابن زريع  حدثنا سليمان التيمي، عن أبي عثمان، عن ابن مسعود  رضى الله عنه  أن رجلا، أصاب من امرأة قبلة، فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فأنزلت عليه ‏{‏وأقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين‏}‏‏.‏ قال الرجل ألي هذه قال ‏\"‏ لمن عمل بها من أمتي ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Masud:                     A man kissed a woman and then came to Allah's Apostle and told him of that, so this Divine Inspiration was revealed to the Prophet 'And offer Prayers perfectly at the two ends of the day, and in some hours of the night; (i.e. (five) compulsory prayers). Verily, the good deeds remove the evil deeds (small sins) That is a reminder for the mindful.' (11.114) The man said, Is this instruction for me only?' The Prophet said, \"It is for all those of my followers who encounter a similar situation.\"",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4838",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الرقاشي، حدثنا معتمر بن سليمان، قال سمعت أبي يقول، حدثنا أبو مجلز، عن أنس بن مالك  رضى الله عنه  قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا القوم، فطعموا ثم جلسوا يتحدثون وإذا هو كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام، وقعد ثلاثة نفر فجاء النبي صلى الله عليه وسلم ليدخل فإذا القوم جلوس ثم إنهم قاموا، فانطلقت فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه فأنزل الله ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle married Zainab bint Jahsh, he invited the people to a meal. They took the meal and remained sitting and talking. Then the Prophet (showed them) as if he is ready to get up, yet they did not get up. When he noticed that (there was no response to his movement), he got up, and the others too, got up except three persons who kept on sitting. The Prophet came back in order to enter his house, but he went away again. Then they left, whereupon I set out and went to the Prophet to tell him that they had departed, so he came and entered his house. I wanted to enter along with him, but he put a screen between me and him. Then Allah revealed: 'O you who believe! Do not enter the houses of the Prophet...' (33.53)",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "5031",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، قال سمعت أبي، عن أبي عثمان، قال أنبئت أن جبريل، أتى النبي صلى الله عليه وسلم وعنده أم سلمة فجعل يتحدث فقال النبي صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏‏.‏ أو كما قال قالت هذا دحية‏.‏ فلما قام قالت والله ما حسبته إلا إياه حتى سمعت خطبة النبي صلى الله عليه وسلم يخبر خبر جبريل أو كما قال، قال أبي قلت لأبي عثمان ممن سمعت هذا‏.‏ قال من أسامة بن زيد‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I was informed that Gabriel came to the Prophet while Um Salama was with him. Gabriel started talking (to the Prophet). Then the Prophet asked Um Salama, \"Who is this?\" She replied, \"He is Dihya (al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other than him (i.e. Dihya) till I heard the sermon of the Prophet wherein he informed about the news of Gabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: From Usama bin Zaid.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "5152",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن سليمان التيمي، قال سمعت أبا عثمان النهدي، عن أسامة بن زيد  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما تركت بعدي فتنة أضر على الرجال من النساء ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     The Prophet said, \"After me I have not left any affliction more harmful to men than women.\"",
      "chain": [
        "20404",
        "20020",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "5251",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا التيمي، عن أبي عثمان، عن أسامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قمت على باب الجنة فكان عامة من دخلها المساكين، وأصحاب الجد محبوسون، غير أن أصحاب النار قد أمر بهم إلى النار، وقمت على باب النار فإذا عامة من دخلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated Usama:                     The Prophet said, \"I stood at the gate of Paradise and saw that the majority of the people who entered it were the poor, while the wealthy were stopped at the gate (for the accounts). But the companions of the Fire were ordered to be taken to the Fire. Then I stood at the gate of the Fire and saw that the majority of those who entered it were women.\"",
      "chain": [
        "30175",
        "20208",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "5355",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن سليمان التيمي، عن أبي عثمان، عن عبد الله بن مسعود  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يمنعن أحدا منكم نداء بلال  أو قال أذانه  من سحوره، فإنما ينادي أو قال يؤذن ليرجع قائمكم ‏\"‏‏.‏ وليس أن يقول كأنه يعني الصبح أو الفجر، وأظهر يزيد يديه ثم مد إحداهما من الأخرى‏.‏",
      "text_en": "      Narrated 'Abdullah bin Mas'ud:                          The Prophet said, \"The call (or the Adhan) of Bila should not stop you     from taking the Suhur-meals for Bilal calls (or pronounces the Adhan)      so that the one who is offering the night prayer should take a rest,      and he does not indicate the daybreak or dawn.\" The narrator, Yazid,      described (how dawn breaks) by stretching out his hands and then      separating them wide apart.",
      "chain": [
        "20164",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "5436",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا موسى، حدثنا معتمر، عن أبيه، قال وحدث أبو عثمان، أيضا عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة، فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن، ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية أو  قال  هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ قال فاشترى منه شاة فصنعت، فأمر نبي الله صلى الله عليه وسلم بسواد البطن يشوى، وايم الله ما من الثلاثين ومائة إلا قد حز له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأها له، ثم جعل فيها قصعتين فأكلنا أجمعون وشبعنا، وفضل في القصعتين، فحملته على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one hundred and thirty men sitting with the Prophet. The Prophet said, \"Have anyone of you any food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned into dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet asked, 'Will you sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the Prophet bought from him a sheep which was slaughtered, and then the Prophet ordered that the liver, the kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and thirty men but had his share of those things. The Prophet gave to those who were present, and also kept a share for those who were absent He then served that cooked sheep in two big trays and we all ate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "hadith_no": "5642",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن أبيه، قال سمعت أنسا، قال كنت قائما على الحى أسقيهم  عمومتي وأنا أصغرهم  الفضيخ، فقيل حرمت الخمر‏.‏ فقالوا أكفئها‏.‏ فكفأتها‏.‏ قلت لأنس ما شرابهم قال رطب وبسر‏.‏ فقال أبو بكر بن أنس وكانت خمرهم‏.‏ فلم ينكر أنس‏.‏ وحدثني بعض أصحابي أنه سمع أنسا يقول كانت خمرهم يومئذ‏.‏",
      "text_en": " Narrated Anas:                     While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the youngest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \"Throw it away.\" So I threw it away.",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19",
        "19"
      ]
    },
    {
      "hadith_no": "5682",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن أبيه، قال سمعت أنسا  رضى الله عنه  قال كنت قائما على الحى أسقيهم  عمومتي وأنا أصغرهم  الفضيخ، فقيل حرمت الخمر‏.‏ فقال أكفئها‏.‏ فكفأنا‏.‏ قلت لأنس ما شرابهم قال رطب وبسر‏.‏ فقال أبو بكر بن أنس وكانت خمرهم‏.‏ فلم ينكر أنس‏.‏ وحدثني بعض أصحابي أنه سمع أنسا يقول كانت خمرهم يومئذ‏.‏",
      "text_en": " Narrated Anas:                     I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the youngest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to me), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was (made from), He replied, \"(From) ripe dates and unripe dates.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "5862",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال لي مسدد حدثنا معتمر، سمعت أبي قال، رأيت على أنس برنسا أصفر من خز‏.‏",
      "text_en": "",
      "chain": [
        "30175",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "5889",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن التيمي، عن أبي عثمان، قال كنا مع عتبة فكتب إليه عمر  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يلبس الحرير في الدنيا، إلا لم يلبس في الآخرة منه ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman:                     While we were with `Utba. `Umar wrote to us: The Prophet said, \"There is none who wears silk in this world except that he will wear nothing of it in the Hereafter.\" ' Abu `Uthman pointed out with his middle and index fingers.",
      "chain": [
        "30175",
        "20031",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "5890",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحسن بن عمر، حدثنا معتمر، حدثنا أبي، حدثنا أبو عثمان،، وأشار أبو عثمان، بإصبعيه المسبحة والوسطى‏.‏",
      "text_en": " Narrated Abu `Uthman:                     (as above, 719)",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "6069",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عارم، حدثنا المعتمر بن سليمان، يحدث عن أبيه، قال سمعت أبا تميمة، يحدث عن أبي عثمان النهدي، يحدثه أبو عثمان عن أسامة بن زيد  رضى الله عنهما كان رسول الله صلى الله عليه وسلم يأخذني فيقعدني على فخذه، ويقعد الحسن على فخذه الأخرى، ثم يضمهما ثم يقول ‏\"‏ اللهم ارحمهما فإني أرحمهما ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle used to put me on (one of) his thighs and put Al-Hasan bin `Ali on his other thigh, and then embrace us and say, \"O Allah! Please be Merciful to them, as I am merciful to them. \"",
      "chain": [
        "30351",
        "20283",
        "20288",
        "11289",
        "11597",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "6297",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا سليمان التيمي، قال سمعت أنسا  رضى الله عنه  يقول عطس رجلان عند النبي صلى الله عليه وسلم فشمت أحدهما ولم يشمت الآخر‏.‏ فقال الرجل يا رسول الله شمت هذا ولم تشمتني‏.‏ قال ‏\"‏ إن هذا حمد الله، ولم تحمد الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Two men sneezed before the Prophet and he said Tashmit to one of them, while he did not say Tashmit to the other. So that man said, \"O Allah's Apostle! You said Tashmit to that fellow but you did not say Tashmit to me. \"The Prophet said, \"That man praised Allah, but you did not praise Allah.\"",
      "chain": [
        "20404",
        "20020",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "6311",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر، قال أبي حدثنا أبو مجلز، عن أنس  رضى الله عنه  قال لما تزوج النبي صلى الله عليه وسلم زينب دخل القوم فطعموا، ثم جلسوا يتحدثون فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام من القوم وقعد بقية القوم، وإن النبي صلى الله عليه وسلم جاء ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا فأخبرت النبي صلى الله عليه وسلم فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet married Zainab, the people came and were offered a meal, and then they sat down (after finishing their meals) and started chatting. The Prophet showed as if he wanted to get up, but they did not get up. When he noticed that, he got up, and some of the people also got up and went away, while some others kept on sitting. When the Prophet returned to enter, he found the people still sitting, but then they got up and left. So I told the Prophet of their departure and he came and went in. I intended to go in but the Prophet put a screen between me and him, for Allah revealed:-- 'O you who believe! Enter not the Prophet's houses..' (33.53)",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "6362",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر بن سليمان، قال سمعت أبي قال، سمعت أنس بن مالك، أسر إلى النبي صلى الله عليه وسلم سرا فما أخبرت به أحدا بعده، ولقد سألتني أم سليم فما أخبرتها به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet confided to me a secret which I did not disclose to anybody after him. And Um Sulaim asked me (about that secret) but I did not tell her.",
      "chain": [
        "30142",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "6378",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "وقال لي خليفة قال معتمر سمعت أبي، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل نبي سأل سؤلا  أو قال لكل نبي دعوة قد دعا بها  فاستجيب، فجعلت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          that the Prophet said, \"For every prophet there is an invocation that      surely will be responded by Allah,\" (or said), \"For every prophet      there was an invocation with which he appealed to Allah, and his      invocation was accepted (in his lifetime), but I kept my (this      special) invocation to intercede for my followers on the Day of      Resurrection.\"",
      "chain": [
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "6441",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي قال، سمعت أنس بن مالك  رضى الله عنه  يقول كان نبي الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل، والجبن والهرم، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة المحيا والممات ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from cowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I seek refuge with You from the afflictions of life and death.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    }
  ],
  "total_hadiths": 240
}