{
  "id": "11289",
  "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
  "full_name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "143",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19322",
      "name": "Abu 'Uthman أبو عثمان ليس بالنهدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10973",
      "name": "N'ym bin Abi Hnd نعيم بن أبي هند",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10922",
      "name": "Durayb bin Nufayr, Abu al-Salayl al-Qays ضريب بن نقير أبو السليل القيسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11290",
      "name": "Siyar bin Salaama, Abu al-Minhal سيار بن سلامة الرياحي أبو المنهال",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11612",
      "name": "Ma'bd bin Hilal al-Nzy معبد بن هلال العنزي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10710",
      "name": "Ghnym bin Qays al-Mazny غنيم بن قيس المازني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10701",
      "name": "'Abdur Rahman bin Aadm عبد الرحمن بن آدم أم برثن - صاحب السقاية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11318",
      "name": "Yazid bin 'Abdullah bin al-Shakhayr يزيد بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11316",
      "name": "Yahya bin Y'amar يحيى بن يعمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20546",
      "name": "Sulaym bin Aghdar سليم بن أخضر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20329",
      "name": "Abthr bin al-Qasim al-Zbydy Abu عبثر بن القاسم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20305",
      "name": "Yusuf bin Y'aqub al-Sadusi al-Sal'ai يوسف بن يعقوب أبو يعقوب السلعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-129",
      "hadith_no": "129",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، قال ذكر لي أن النبي صلى الله عليه وسلم قال لمعاذ ‏\"‏ من لقي الله لا يشرك به شيئا دخل الجنة ‏\"‏‏.‏ قال ألا أبشر الناس قال ‏\"‏ لا، إني أخاف أن يتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     I was informed that the Prophet had said to Mu`adh, \"Whosoever will meet Allah without associating anything in worship with Him will go to Paradise.\" Mu`adh asked the Prophet, \"Should I not inform the people of this good news?\" The Prophet replied, \"No, I am afraid, lest they should depend upon it (absolutely).",
      "usc_msa_ref": "131",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-526",
      "hadith_no": "526",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد بن زريع، عن سليمان التيمي، عن أبي عثمان النهدي، عن ابن مسعود، أن رجلا، أصاب من امرأة قبلة، فأتى النبي صلى الله عليه وسلم فأخبره، فأنزل الله ‏{‏أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات‏}‏‏.‏ فقال الرجل يا رسول الله ألي هذا قال ‏\"‏ لجميع أمتي كلهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     A man kissed a woman (unlawfully) and then went to the Prophet and informed him. Allah revealed: And offer prayers perfectly At the two ends of the day And in some hours of the night (i.e. the five compulsory prayers). Verily! good deeds remove (annul) the evil deeds (small sins) (11.114). The man asked Allah's Apostle, \"Is it for me?\" He said, \"It is for all my followers.\"",
      "usc_msa_ref": "504",
      "chain": [
        "30367",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-602",
      "hadith_no": "602",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر بن سليمان، قال حدثنا أبي، حدثنا أبو عثمان، عن عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا أناسا فقراء، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، وإن أربع فخامس أو سادس ‏\"‏‏.‏ وأن أبا بكر جاء بثلاثة فانطلق النبي صلى الله عليه وسلم بعشرة، قال فهو أنا وأبي وأمي، فلا أدري قال وامرأتي وخادم بيننا وبين بيت أبي بكر‏.‏ وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حيث صليت العشاء، ثم رجع فلبث حتى تعشى النبي صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته وما حبسك عن أضيافك  أو قالت ضيفك  قال أوما عشيتيهم قالت أبوا حتى تجيء، قد عرضوا فأبوا‏.‏ قال فذهبت أنا فاختبأت فقال يا غنثر، فجدع وسب، وقال كلوا لا هنيئا‏.‏ فقال والله لا أطعمه أبدا، وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها‏.‏ قال يعني حتى شبعوا وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فإذا هي كما هي أو أكثر منها‏.‏ فقال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏.‏ فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عقد، فمضى الأجل، ففرقنا اثنا عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل فأكلوا منها أجمعون، أو كما قال‏.‏",
      "text_en": " Narrated Abu `Uthman:                     `Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet till the Prophet took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"",
      "usc_msa_ref": "576",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "id": "sahih-bukhari-621",
      "hadith_no": "621",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يمنعن أحدكم  أو أحدا منكم  أذان بلال من سحوره، فإنه يؤذن  أو ينادي  بليل، ليرجع قائمكم ولينبه نائمكم، وليس أن يقول الفجر أو الصبح ‏\"‏‏.‏ وقال بأصابعه ورفعها إلى فوق وطأطأ إلى أسفل حتى يقول هكذا‏.‏ وقال زهير بسبابتيه إحداهما فوق الأخرى ثم مدها عن يمينه وشماله‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"The Adhan pronounced by Bilal should not stop you from taking Suhur, for he pronounces the Adhan at night, so that the one offering the late night prayer (Tahajjud) from among you might hurry up and the sleeping from among you might wake up. It does not mean that dawn or morning has started.\" Then he (the Prophet) pointed with his fingers and raised them up (towards the sky) and then lowered them (towards the earth) like this (Ibn Mas`ud imitated the gesture of the Prophet). Az-Zuhri gestured with his two index fingers which he put on each other and then stretched them to the right and left. These gestures illustrate the way real dawn appears. It spreads left and right horizontally. The dawn that appears in the high sky and lowers down is not the real dawn) .",
      "usc_msa_ref": "595",
      "chain": [
        "30184",
        "20321",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-766",
      "hadith_no": "766",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت له قال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. On my inquiring, he said, \"I prostrated behind Abul-Qasim (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-768",
      "hadith_no": "768",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يزيد بن زريع، قال حدثني التيمي، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     Once I prayed the `Isha' prayer with Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. I said, \"What is that?\" He said, \"I prostrated behind Abul-Qasim, (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-1003",
      "hadith_no": "1003",
      "source": "Sahih Bukhari",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن يونس، قال حدثنا زائدة، عن التيمي، عن أبي مجلز، عن أنس، قال قنت النبي صلى الله عليه وسلم شهرا يدعو على رعل وذكوان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
      "usc_msa_ref": "117",
      "chain": [
        "30184",
        "20320",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1078",
      "hadith_no": "1078",
      "source": "Sahih Bukhari",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، حدثني بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد فيها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited Idhas-Sama' Un-Shaqqat, and prostrated. I said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abul-Qasim and I will do the same till I meet him.\"",
      "usc_msa_ref": "184",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-2149",
      "hadith_no": "2149",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو عثمان، عن عبد الله بن مسعود  رضى الله عنه  قال من اشترى شاة محفلة، فردها فليرد معها صاعا‏.‏ ونهى النبي صلى الله عليه وسلم أن تلقى البيوع‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Whoever buys a sheep which has not been milked for a long time, has the option of returning it along with one Sa of dates; and the Prophet forbade going to meet the seller on the way (as he has no knowledge of the market price and he may sell his goods at a low price).",
      "usc_msa_ref": "359",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-2164",
      "hadith_no": "2164",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، قال حدثني التيمي، عن أبي عثمان، عن عبد الله  رضى الله عنه  قال من اشترى محفلة فليرد معها صاعا‏.‏ قال ونهى النبي صلى الله عليه وسلم عن تلقي البيوع‏.‏",
      "text_en": " Narrated `Abdullah:                     Whoever buys an animal which has been kept unmilked for a long time, could return it, but has to pay a Sa of dates along with it. And the Prophet forbade meeting the owners of goods on the way away from the market.",
      "usc_msa_ref": "373",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-2216",
      "hadith_no": "2216",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية أو قال أم هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ فاشترى منه شاة‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were with the Prophet when a tall pagan with long matted unkempt hair came driving his sheep. The Prophet asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" The Prophet bought one sheep from him.",
      "usc_msa_ref": "419",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "id": "sahih-bukhari-2618",
      "hadith_no": "2618",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو النعمان، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها، فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية  أو قال  أم هبة ‏\"‏‏.‏ قال لا، بل بيع‏.‏ فاشترى منه شاة، فصنعت وأمر النبي صلى الله عليه وسلم بسواد البطن أن يشوى، وايم الله ما في الثلاثين والمائة إلا قد حز النبي صلى الله عليه وسلم له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأ له، فجعل منها قصعتين، فأكلوا أجمعون، وشبعنا، ففضلت القصعتان، فحملناه على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one-hundred and thirty persons accompanying the Prophet who asked us whether anyone of us had food. There was a man who had about a Sa of wheat which was mixed with water then. A very tall pagan came driving sheep. The Prophet asked him, \"Will you sell us (a sheep) or give it as a present?\" He said, \"I will sell you (a sheep).\" The Prophet bought a sheep and it was slaughtered. The Prophet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet gave every person of the one-hundred-and-thirty a piece of that; he gave all those of them who were present; and kept the shares of those who were absent. The Prophet then put its meat in two huge basins and all of them ate to their fill, and even then more food was left in the two basins which were carried on the camel (or said something like it).",
      "usc_msa_ref": "",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "id": "sahih-bukhari-2691",
      "hadith_no": "2691",
      "source": "Sahih Bukhari",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي أن أنسا  رضى الله عنه  قال قيل للنبي صلى الله عليه وسلم لو أتيت عبد الله بن أبى‏.‏ فانطلق إليه النبي صلى الله عليه وسلم وركب حمارا، فانطلق المسلمون يمشون معه، وهى أرض سبخة، فلما أتاه النبي صلى الله عليه وسلم فقال إليك عني، والله لقد آذاني نتن حمارك‏.‏ فقال رجل من الأنصار منهم والله لحمار رسول الله صلى الله عليه وسلم أطيب ريحا منك‏.‏ فغضب لعبد الله رجل من قومه فشتما، فغضب لكل واحد منهما أصحابه، فكان بينهما ضرب بالجريد والأيدي والنعال، فبلغنا أنها أنزلت ‏{‏وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏‏.‏",
      "text_en": " Narrated Anas:                     It was said to the Prophet \"Would that you see `Abdullah bin Ubai.\" So, the Prophet went to him, riding a donkey, and the Muslims accompanied him, walking on salty barren land. When the Prophet reached `Abdullah bin Ubai, the latter said, \"Keep away from me! By Allah, the bad smell of your donkey has harmed me.\" On that an Ansari man said (to `Abdullah), \"By Allah! The smell of the donkey of Allah's Apostle is better than your smell.\" On that a man from `Abdullah's tribe got angry for `Abdullah's sake, and the two men abused each other which caused the friends of the two men to get angry, and the two groups started fighting with sticks, shoes and hands. We were informed that the following Divine Verse was revealed (in this concern):-- \"And if two groups of Believers fall to fighting then, make peace between them.\" (49.9)",
      "usc_msa_ref": "856",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-2823",
      "hadith_no": "2823",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي قال، سمعت أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل والجبن والهرم، وأعوذ بك من فتنة المحيا والممات، وأعوذ بك من عذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to say, \"O Allah! I seek refuge with You from helplessness, laziness, cowardice and feeble old age; I seek refuge with You from afflictions of life and death and seek refuge with You from the punishment in the grave.\"",
      "usc_msa_ref": "77",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3128",
      "hadith_no": "3128",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، قال سمعت أنس بن مالك  رضى الله عنه  يقول كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     People used to give some of their datepalms to the Prophet (as a gift), till he conquered Bani Quraiza and Bani An-Nadir, whereupon he started returning their favors.",
      "usc_msa_ref": "357",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3622",
      "hadith_no": "3622",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، عن أبيه، حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر  رضى الله عنهما  أن أصحاب، الصفة كانوا أناسا فقراء، وأن النبي  صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، ومن كان عنده طعام أربعة فليذهب بخامس أو سادس ‏\"‏‏.‏ أو كما قال، وأن أبا بكر جاء بثلاثة وانطلق النبي صلى الله عليه وسلم بعشرة، وأبو بكر وثلاثة، قال فهو أنا وأبي وأمي  ولا أدري هل قال امرأتي وخادمي  بين بيتنا وبين بيت أبي بكر، وأن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حتى صلى العشاء، ثم رجع فلبث حتى تعشى رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته ما حبسك عن أضيافك أو ضيفك‏.‏ قال أو عشيتهم قالت أبوا حتى تجيء، قد عرضوا عليهم فغلبوهم، فذهبت فاختبأت، فقال يا غنثر‏.‏ فجدع وسب وقال كلوا وقال لا أطعمه أبدا‏.‏ قال وايم الله ما كنا نأخذ من اللقمة إلا ربا من أسفلها أكثر منها حتى شبعوا، وصارت أكثر مما كانت قبل، فنظر أبو بكر فإذا شىء أو أكثر قال لامرأته يا أخت بني فراس‏.‏ قالت لا وقرة عيني لهى الآن أكثر مما قبل بثلاث مرات‏.‏ فأكل منها أبو بكر، وقال إنما كان الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده‏.‏ وكان بيننا وبين قوم عهد، فمضى الأجل، فتفرقنا اثنا عشر رجلا مع كل رجل منهم أناس‏.‏ الله أعلم كم مع كل رجل، غير أنه بعث معهم، قال أكلوا منها أجمعون‏.‏ أو كما قال‏.‏    وغيره يقول فعرفنا من العرافة",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakr:                     The companions of Suffa were poor people. The Prophet once said, \"Whoever has food enough for two persons, should take a third one (from among them), and whoever has food enough for four persons, should take a fifth or a sixth (or said something similar).\" Abu Bakr brought three persons while the Prophet took ten. And Abu Bakr with his three family member (who were I, my father and my mother) (the sub-narrator is in doubt whether `Abdur-Rahman said, \"My wife and my servant who was common for both my house and Abu Bakr's house.\") Abu Bakr took his supper with the Prophet and stayed there till he offered the `Isha' prayers. He returned and stayed till Allah's Apostle took his supper. After a part of the night had passed, he returned to his house. His wife said to him, \"What has detained you from your guests?\" He said, \"Have you served supper to them?\" She said, \"They refused to take supper until you come. They (i.e. some members of the household) presented the meal to them but they refused (to eat)\" I went to hide myself and he said, \"O Ghunthar!\" He invoked Allah to cause my ears to be cut and he rebuked me. He then said (to them): Please eat!\" and added, I will never eat the meal.\" By Allah, whenever we took a handful of the meal, the meal grew from underneath more than that handful till everybody ate to his satisfaction; yet the remaining food was more than the original meal. Abu Bakr saw that the food was as much or more than the original amount. He called his wife, \"O sister of Bani Firas!\" She said, \"O pleasure of my eyes. The food has been tripled in quantity.\" Abu Bakr then started eating thereof and said, \"It (i.e. my oath not to eat) was because of Sa all.\" He took a handful from it, and carried the rest to the Prophet. So that food was with the Prophet . There was a treaty between us and some people, and when the period of that treaty had elapsed, he divided US into twelve groups, each being headed by a man. Allah knows how many men were under the command of each leader. Anyhow, the Prophet surely sent a leader with each group. Then all of them ate of that meal.",
      "usc_msa_ref": "781",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "id": "sahih-bukhari-3677",
      "hadith_no": "3677",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عباس بن الوليد النرسي، حدثنا معتمر، قال سمعت أبي، حدثنا أبو عثمان، قال أنبئت أن جبريل  عليه السلام  أتى النبي صلى الله عليه وسلم وعنده أم سلمة، فجعل يحدث ثم قام، فقال النبي صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏‏.‏ أو كما قال‏.‏ قال قالت هذا دحية‏.‏ قالت أم سلمة ايم الله ما حسبته إلا إياه حتى سمعت خطبة نبي الله صلى الله عليه وسلم يخبر جبريل أو كما قال‏.‏ قال فقلت لأبي عثمان ممن سمعت هذا قال من أسامة بن زيد‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I got the news that Gabriel came to the Prophet while Um Salama was present. Gabriel started talking (to the Prophet and then left. The Prophet said to Um Salama, \"(Do you know) who it was?\" (or a similar question). She said, \"It was Dihya (a handsome person amongst the companions of the Prophet ).\" Later on Um Salama said, \"By Allah! I thought he was none but Dihya, till I heard the Prophet talking about Gabriel in his sermon.\" (The Sub-narrator asked Abu `Uthman, \"From where have you heard this narration?\" He replied, \"From Usama bin Zaid.\")",
      "usc_msa_ref": "827",
      "chain": [
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-3769",
      "hadith_no": "3769",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن أبي بكر المقدمي، حدثنا معتمر، عن أبيه، عن أبي عثمان، قال لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Abu `Uthman:                     During one of the Ghazawat in which Allah's Apostle was fighting, none remained with the Prophet but Talha and Sa`d.",
      "usc_msa_ref": "69",
      "chain": [
        "30161",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-3781",
      "hadith_no": "3781",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، قال سمعت أبي، حدثنا أبو عثمان، عن أسامة بن زيد  رضى الله عنهما  حدث عن النبي صلى الله عليه وسلم أنه كان يأخذه والحسن فيقول ‏\"‏ اللهم أحبهما فإني أحبهما ‏\"‏‏.‏",
      "text_en": "      Narrated Usama bin Zaid:                          That the Prophet used to take him (i.e. Usama) and Al-Hassan (in his      lap) and say: \"O Allah! Love them, as I love them.\"",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-3792",
      "hadith_no": "3792",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي قال، حدثنا أبو عثمان، عن أسامة بن زيد  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه كان يأخذه والحسن ويقول ‏\"‏ اللهم إني أحبهما فأحبهما ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     That the Prophet used to take him and Al-Hasan, and used to say, \"O Allah! I love them, so please love them,\" or said something similar.",
      "usc_msa_ref": "90",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-3994",
      "hadith_no": "3994",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني الحسن بن عمر بن شقيق، حدثنا معتمر، قال أبي وحدثنا أبو عثمان، عن سلمان الفارسي، أنه تداوله بضعة عشر من رب إلى رب‏.‏",
      "text_en": " Narrated Salman Al-Farisi:                     That he was sold (as a slave) by one master to another for more than ten times (i.e between 13 and 19).",
      "usc_msa_ref": "282",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sahih-bukhari-4010",
      "hadith_no": "4010",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سليمان التيمي، أن أنسا، حدثهم قال قال النبي صلى الله عليه وسلم ح وحدثني عمرو بن خالد حدثنا زهير عن سليمان التيمي عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد قال آأنت أبو جهل قال فأخذ بلحيته‏.‏ قال وهل فوق رجل قتلتموه أو رجل قتله قومه قال أحمد بن يونس أنت أبو جهل‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and found that the two sons of 'Afra had struck him fatally (and he was in his last breaths). `Abdullah bin Mas`ud said, \"Are you Abu Jahl?\" And took him by the beard. Abu Jahl said, \"Can there be a man superior to one you have killed or one whom his own folk have killed?\"",
      "usc_msa_ref": "300",
      "chain": [
        "30184",
        "20321",
        "11289"
      ]
    },
    {
      "id": "sahih-bukhari-4011",
      "hadith_no": "4011",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن سليمان التيمي، عن أنس، رضى الله عنه قال قال النبي صلى الله عليه وسلم يوم بدر ‏\"‏ من ينظر ما فعل أبو جهل ‏\"‏‏.‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد، فأخذ بلحيته فقال أنت أبا جهل قال وهل فوق رجل قتله قومه أو قال قتلتموه‏.‏",
      "text_en": " Narrated Anas:                     On the day of Badr, the Prophet said, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and found that the two sons of 'Afra had struck him fatally. `Abdullah bin Mas`ud got hold of his beard and said, \"'Are you Abu Jahl?\" He replied, \"Can there be a man more superior to one whom his own folk have killed (or you have killed)?\"",
      "usc_msa_ref": "301",
      "chain": [
        "30170",
        "20276",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4014",
      "hadith_no": "4014",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله الرقاشي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  أنه قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ وقال قيس بن عباد وفيهم أنزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين تبارزوا يوم بدر حمزة وعلي وعبيدة أو أبو عبيدة بن الحارث وشيبة بن ربيعة وعتبة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Mijlaz:                     From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), the Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also said, \"The following Verse was revealed in their connection:-- \"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) Qais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu 'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
      "usc_msa_ref": "304",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-4016",
      "hadith_no": "4016",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم الصواف، حدثنا يوسف بن يعقوب  كان ينزل في بني ضبيعة وهو مولى لبني سدوس  حدثنا سليمان التيمي، عن أبي مجلز، عن قيس بن عباد، قال قال علي  رضى الله عنه فينا نزلت هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏",
      "text_en": " Narrated `Ali:                     The following Holy Verse:-- \"These two opponents (believers and disbelievers) dispute with each other about their Lord.\" (22.19) was revealed concerning us.",
      "usc_msa_ref": "306",
      "chain": [
        "30123",
        "20305",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-4069",
      "hadith_no": "4069",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا سليمان التيمي، حدثنا أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏‏.‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد، فقال آنت أبا جهل قال ابن علية قال سليمان هكذا قالها أنس‏.‏ قال أنت أبا جهل قال وهل فوق رجل قتلتموه قال سليمان أو قال قتله قومه‏.‏ قال وقال أبو مجلز قال أبو جهل فلو غير أكار قتلني‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said on the day of Badr, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and saw him struck by the two sons of 'Afra and was on the point of death . Ibn Mas`ud said, \"Are you Abu Jahl?\" Abu Jahl replied, \"Can there be a man more superior to the one whom you have killed (or as Sulaiman said, or his own folk have killed.)?\" Abu Jahl added, \"Would that I had been killed by other than a mere farmer. \"",
      "usc_msa_ref": "355",
      "chain": [
        "20184",
        "20208",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4080",
      "hadith_no": "4080",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، سمعت أنس بن مالك  رضى الله عنه قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some people used to allot some date palm trees to the Prophet as gift till he conquered Banu Quraiza and Bani An-Nadir, where upon he started returning their date palms to them.",
      "usc_msa_ref": "364",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4110",
      "hadith_no": "4110",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، عن معتمر، عن أبيه، قال زعم أبو عثمان أنه لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي يقاتل فيهن غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Mu'tamir's father:                     `Uthman said that on the day of the battle of Uhud, none remained with the Prophet but Talha and Sa`d.",
      "usc_msa_ref": "390",
      "chain": [
        "20040",
        "20288",
        "11289"
      ]
    },
    {
      "id": "sahih-bukhari-4144",
      "hadith_no": "4144",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا سليمان التيمي، عن أبي مجلز، عن أنس  رضى الله عنه  قال قنت النبي صلى الله عليه وسلم بعد الركوع شهرا يدعو على رعل وذكوان ويقول ‏\"‏ عصية عصت الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said Al-Qunut after Bowing (i.e. Ar-Ruku') for one month, invoking evil upon (the tribes of) Ril and Dhakwan. He used to say, \"Usaiya disobeyed Allah and His Apostle.\"",
      "usc_msa_ref": "420",
      "chain": [
        "30213",
        "20025",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4170",
      "hadith_no": "4170",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا معتمر، وحدثني خليفة، حدثنا معتمر، قال سمعت أبي، عن أنس  رضى الله عنه  قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله الذين كانوا أعطوه أو بعضه‏.‏ وكان النبي صلى الله عليه وسلم قد أعطاه أم أيمن، فجاءت أم أيمن فجعلت الثوب في عنقي تقول كلا والذي لا إله إلا هو لا يعطيكهم وقد أعطانيها، أو كما قالت، والنبي صلى الله عليه وسلم يقول ‏\"‏ لك كذا ‏\"‏‏.‏ وتقول كلا والله‏.‏ حتى أعطاها، حسبت أنه قال ‏\"‏ عشرة أمثاله ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Anas:                     Some (of the Ansar) used to present date palm trees to the Prophet till Banu Quraiza and Banu An- Nadir were conquered (then he returned to the people their date palms). My people ordered me to ask the Prophet to return some or all the date palms they had given to him, but the Prophet had given those trees to Um Aiman. On that, Um Aiman came and put the garment around my neck and said, \"No, by Him except Whom none has the right to be worshipped, he will not return those trees to you as he (i.e. the Prophet ) has given them to me.\" The Prophet go said (to her), \"Return those trees and I will give you so much (instead of them).\" But she kept on refusing, saying, \"No, by Allah,\" till he gave her ten times the number of her date palms.",
      "usc_msa_ref": "",
      "chain": [
        "30145",
        "20288",
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4530",
      "hadith_no": "4530",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا معتمر، عن أبيه، عن أنس  رضى الله عنه  قال لم يبق ممن صلى القبلتين غيري‏.‏",
      "text_en": " Narrated Anas:                     None remains of those who prayed facing both Qiblas (that is, Jerusalem and Mecca) except myself.",
      "usc_msa_ref": "16",
      "chain": [
        "30026",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-4733",
      "hadith_no": "4733",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يزيد  هو ابن زريع  حدثنا سليمان التيمي، عن أبي عثمان، عن ابن مسعود  رضى الله عنه  أن رجلا، أصاب من امرأة قبلة، فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فأنزلت عليه ‏{‏وأقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين‏}‏‏.‏ قال الرجل ألي هذه قال ‏\"‏ لمن عمل بها من أمتي ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Masud:                     A man kissed a woman and then came to Allah's Apostle and told him of that, so this Divine Inspiration was revealed to the Prophet 'And offer Prayers perfectly at the two ends of the day, and in some hours of the night; (i.e. (five) compulsory prayers). Verily, the good deeds remove the evil deeds (small sins) That is a reminder for the mindful.' (11.114) The man said, Is this instruction for me only?' The Prophet said, \"It is for all those of my followers who encounter a similar situation.\"",
      "usc_msa_ref": "209",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4791",
      "hadith_no": "4791",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-4838",
      "hadith_no": "4838",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الرقاشي، حدثنا معتمر بن سليمان، قال سمعت أبي يقول، حدثنا أبو مجلز، عن أنس بن مالك  رضى الله عنه  قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا القوم، فطعموا ثم جلسوا يتحدثون وإذا هو كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام، وقعد ثلاثة نفر فجاء النبي صلى الله عليه وسلم ليدخل فإذا القوم جلوس ثم إنهم قاموا، فانطلقت فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه فأنزل الله ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle married Zainab bint Jahsh, he invited the people to a meal. They took the meal and remained sitting and talking. Then the Prophet (showed them) as if he is ready to get up, yet they did not get up. When he noticed that (there was no response to his movement), he got up, and the others too, got up except three persons who kept on sitting. The Prophet came back in order to enter his house, but he went away again. Then they left, whereupon I set out and went to the Prophet to tell him that they had departed, so he came and entered his house. I wanted to enter along with him, but he put a screen between me and him. Then Allah revealed: 'O you who believe! Do not enter the houses of the Prophet...' (33.53)",
      "usc_msa_ref": "314",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5031",
      "hadith_no": "5031",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، قال سمعت أبي، عن أبي عثمان، قال أنبئت أن جبريل، أتى النبي صلى الله عليه وسلم وعنده أم سلمة فجعل يتحدث فقال النبي صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏‏.‏ أو كما قال قالت هذا دحية‏.‏ فلما قام قالت والله ما حسبته إلا إياه حتى سمعت خطبة النبي صلى الله عليه وسلم يخبر خبر جبريل أو كما قال، قال أبي قلت لأبي عثمان ممن سمعت هذا‏.‏ قال من أسامة بن زيد‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I was informed that Gabriel came to the Prophet while Um Salama was with him. Gabriel started talking (to the Prophet). Then the Prophet asked Um Salama, \"Who is this?\" She replied, \"He is Dihya (al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other than him (i.e. Dihya) till I heard the sermon of the Prophet wherein he informed about the news of Gabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: From Usama bin Zaid.",
      "usc_msa_ref": "503",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-5152",
      "hadith_no": "5152",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن سليمان التيمي، قال سمعت أبا عثمان النهدي، عن أسامة بن زيد  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما تركت بعدي فتنة أضر على الرجال من النساء ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     The Prophet said, \"After me I have not left any affliction more harmful to men than women.\"",
      "usc_msa_ref": "33",
      "chain": [
        "20404",
        "20020",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-5251",
      "hadith_no": "5251",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا التيمي، عن أبي عثمان، عن أسامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قمت على باب الجنة فكان عامة من دخلها المساكين، وأصحاب الجد محبوسون، غير أن أصحاب النار قد أمر بهم إلى النار، وقمت على باب النار فإذا عامة من دخلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated Usama:                     The Prophet said, \"I stood at the gate of Paradise and saw that the majority of the people who entered it were the poor, while the wealthy were stopped at the gate (for the accounts). But the companions of the Fire were ordered to be taken to the Fire. Then I stood at the gate of the Fire and saw that the majority of those who entered it were women.\"",
      "usc_msa_ref": "124",
      "chain": [
        "30175",
        "20208",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-5355",
      "hadith_no": "5355",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن سليمان التيمي، عن أبي عثمان، عن عبد الله بن مسعود  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يمنعن أحدا منكم نداء بلال  أو قال أذانه  من سحوره، فإنما ينادي أو قال يؤذن ليرجع قائمكم ‏\"‏‏.‏ وليس أن يقول كأنه يعني الصبح أو الفجر، وأظهر يزيد يديه ثم مد إحداهما من الأخرى‏.‏",
      "text_en": "      Narrated 'Abdullah bin Mas'ud:                          The Prophet said, \"The call (or the Adhan) of Bila should not stop you     from taking the Suhur-meals for Bilal calls (or pronounces the Adhan)      so that the one who is offering the night prayer should take a rest,      and he does not indicate the daybreak or dawn.\" The narrator, Yazid,      described (how dawn breaks) by stretching out his hands and then      separating them wide apart.",
      "usc_msa_ref": "219",
      "chain": [
        "20164",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-5436",
      "hadith_no": "5436",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا موسى، حدثنا معتمر، عن أبيه، قال وحدث أبو عثمان، أيضا عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة، فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن، ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية أو  قال  هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ قال فاشترى منه شاة فصنعت، فأمر نبي الله صلى الله عليه وسلم بسواد البطن يشوى، وايم الله ما من الثلاثين ومائة إلا قد حز له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأها له، ثم جعل فيها قصعتين فأكلنا أجمعون وشبعنا، وفضل في القصعتين، فحملته على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one hundred and thirty men sitting with the Prophet. The Prophet said, \"Have anyone of you any food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned into dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet asked, 'Will you sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the Prophet bought from him a sheep which was slaughtered, and then the Prophet ordered that the liver, the kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and thirty men but had his share of those things. The Prophet gave to those who were present, and also kept a share for those who were absent He then served that cooked sheep in two big trays and we all ate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
      "usc_msa_ref": "294",
      "chain": [
        "20040",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "id": "sahih-bukhari-5642",
      "hadith_no": "5642",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن أبيه، قال سمعت أنسا، قال كنت قائما على الحى أسقيهم  عمومتي وأنا أصغرهم  الفضيخ، فقيل حرمت الخمر‏.‏ فقالوا أكفئها‏.‏ فكفأتها‏.‏ قلت لأنس ما شرابهم قال رطب وبسر‏.‏ فقال أبو بكر بن أنس وكانت خمرهم‏.‏ فلم ينكر أنس‏.‏ وحدثني بعض أصحابي أنه سمع أنسا يقول كانت خمرهم يومئذ‏.‏",
      "text_en": " Narrated Anas:                     While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the youngest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \"Throw it away.\" So I threw it away.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5682",
      "hadith_no": "5682",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن أبيه، قال سمعت أنسا  رضى الله عنه  قال كنت قائما على الحى أسقيهم  عمومتي وأنا أصغرهم  الفضيخ، فقيل حرمت الخمر‏.‏ فقال أكفئها‏.‏ فكفأنا‏.‏ قلت لأنس ما شرابهم قال رطب وبسر‏.‏ فقال أبو بكر بن أنس وكانت خمرهم‏.‏ فلم ينكر أنس‏.‏ وحدثني بعض أصحابي أنه سمع أنسا يقول كانت خمرهم يومئذ‏.‏",
      "text_en": " Narrated Anas:                     I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the youngest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to me), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was (made from), He replied, \"(From) ripe dates and unripe dates.\"",
      "usc_msa_ref": "526",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-5862",
      "hadith_no": "5862",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال لي مسدد حدثنا معتمر، سمعت أبي قال، رأيت على أنس برنسا أصفر من خز‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "11289"
      ]
    },
    {
      "id": "sahih-bukhari-5889",
      "hadith_no": "5889",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن التيمي، عن أبي عثمان، قال كنا مع عتبة فكتب إليه عمر  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يلبس الحرير في الدنيا، إلا لم يلبس في الآخرة منه ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman:                     While we were with `Utba. `Umar wrote to us: The Prophet said, \"There is none who wears silk in this world except that he will wear nothing of it in the Hereafter.\" ' Abu `Uthman pointed out with his middle and index fingers.",
      "usc_msa_ref": "720",
      "chain": [
        "30175",
        "20031",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-5890",
      "hadith_no": "5890",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحسن بن عمر، حدثنا معتمر، حدثنا أبي، حدثنا أبو عثمان،، وأشار أبو عثمان، بإصبعيه المسبحة والوسطى‏.‏",
      "text_en": " Narrated Abu `Uthman:                     (as above, 719)",
      "usc_msa_ref": "721",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-bukhari-6069",
      "hadith_no": "6069",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عارم، حدثنا المعتمر بن سليمان، يحدث عن أبيه، قال سمعت أبا تميمة، يحدث عن أبي عثمان النهدي، يحدثه أبو عثمان عن أسامة بن زيد  رضى الله عنهما كان رسول الله صلى الله عليه وسلم يأخذني فيقعدني على فخذه، ويقعد الحسن على فخذه الأخرى، ثم يضمهما ثم يقول ‏\"‏ اللهم ارحمهما فإني أرحمهما ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle used to put me on (one of) his thighs and put Al-Hasan bin `Ali on his other thigh, and then embrace us and say, \"O Allah! Please be Merciful to them, as I am merciful to them. \"",
      "usc_msa_ref": "32",
      "chain": [
        "30351",
        "20283",
        "20288",
        "11289",
        "11597",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-6297",
      "hadith_no": "6297",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا سليمان التيمي، قال سمعت أنسا  رضى الله عنه  يقول عطس رجلان عند النبي صلى الله عليه وسلم فشمت أحدهما ولم يشمت الآخر‏.‏ فقال الرجل يا رسول الله شمت هذا ولم تشمتني‏.‏ قال ‏\"‏ إن هذا حمد الله، ولم تحمد الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Two men sneezed before the Prophet and he said Tashmit to one of them, while he did not say Tashmit to the other. So that man said, \"O Allah's Apostle! You said Tashmit to that fellow but you did not say Tashmit to me. \"The Prophet said, \"That man praised Allah, but you did not praise Allah.\"",
      "usc_msa_ref": "244",
      "chain": [
        "20404",
        "20020",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6311",
      "hadith_no": "6311",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر، قال أبي حدثنا أبو مجلز، عن أنس  رضى الله عنه  قال لما تزوج النبي صلى الله عليه وسلم زينب دخل القوم فطعموا، ثم جلسوا يتحدثون فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام من القوم وقعد بقية القوم، وإن النبي صلى الله عليه وسلم جاء ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا فأخبرت النبي صلى الله عليه وسلم فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet married Zainab, the people came and were offered a meal, and then they sat down (after finishing their meals) and started chatting. The Prophet showed as if he wanted to get up, but they did not get up. When he noticed that, he got up, and some of the people also got up and went away, while some others kept on sitting. When the Prophet returned to enter, he found the people still sitting, but then they got up and left. So I told the Prophet of their departure and he came and went in. I intended to go in but the Prophet put a screen between me and him, for Allah revealed:-- 'O you who believe! Enter not the Prophet's houses..' (33.53)",
      "usc_msa_ref": "256",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6362",
      "hadith_no": "6362",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر بن سليمان، قال سمعت أبي قال، سمعت أنس بن مالك، أسر إلى النبي صلى الله عليه وسلم سرا فما أخبرت به أحدا بعده، ولقد سألتني أم سليم فما أخبرتها به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet confided to me a secret which I did not disclose to anybody after him. And Um Sulaim asked me (about that secret) but I did not tell her.",
      "usc_msa_ref": "304",
      "chain": [
        "30142",
        "20288",
        "11289"
      ]
    },
    {
      "id": "sahih-bukhari-6378",
      "hadith_no": "6378",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "وقال لي خليفة قال معتمر سمعت أبي، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل نبي سأل سؤلا  أو قال لكل نبي دعوة قد دعا بها  فاستجيب، فجعلت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          that the Prophet said, \"For every prophet there is an invocation that      surely will be responded by Allah,\" (or said), \"For every prophet      there was an invocation with which he appealed to Allah, and his      invocation was accepted (in his lifetime), but I kept my (this      special) invocation to intercede for my followers on the Day of      Resurrection.\"",
      "usc_msa_ref": "317",
      "chain": [
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6441",
      "hadith_no": "6441",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي قال، سمعت أنس بن مالك  رضى الله عنه  يقول كان نبي الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل، والجبن والهرم، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة المحيا والممات ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from cowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I seek refuge with You from the afflictions of life and death.\"",
      "usc_msa_ref": "378",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6484",
      "hadith_no": "6484",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا سليمان التيمي، عن أبي عثمان، عن أبي موسى الأشعري، قال أخذ النبي صلى الله عليه وسلم في عقبة  أو قال في ثنية، قال  فلما علا عليها رجل نادى فرفع صوته لا إله إلا الله والله أكبر‏.‏ قال ورسول الله صلى الله عليه وسلم على بغلته قال ‏\"‏ فإنكم لا تدعون أصم ولا غائبا ‏\"‏‏.‏ ثم قال ‏\"‏ يا أبا موسى  أو يا عبد الله ألا أدلك على كلمة من كنز الجنة ‏\"‏‏.‏ قلت بلى‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet started ascending a high place or hill. A man (amongst his companions) ascended it and shouted in a loud voice, \"La ilaha illal-lahu wallahu Akbar.\" (At that time) Allah's Apostle was riding his mule. Allah's Apostle said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu Musa (or, O `Abdullah)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He said, \"La haul a wala quwwata illa billah,\"",
      "usc_msa_ref": "418",
      "chain": [
        "30118",
        "20025",
        "11289",
        "11113",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-6559",
      "hadith_no": "6559",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا موسى، حدثنا معتمر، سمعت أبي، حدثنا قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ذكر رجلا فيمن كان سلف أو قبلكم آتاه الله مالا وولدا  يعني أعطاه قال  فلما حضر قال لبنيه أى أب كنت قالوا خير أب‏.‏ قال فإنه لم يبتئر عند الله خيرا  فسرها قتادة لم يدخر  وإن يقدم على الله يعذبه فانظروا، فإذا مت فأحرقوني، حتى إذا صرت فحما فاسحقوني  أو قال فاسهكوني  ثم إذا كان ريح عاصف فأذروني فيها‏.‏ فأخذ مواثيقهم على ذلك وربي ففعلوا فقال الله كن‏.‏ فإذا رجل قائم، ثم قال أى عبدي ما حملك على ما فعلت قال مخافتك  أو فرق منك  فما تلافاه أن رحمه الله ‏\"‏‏.‏ فحدثت أبا عثمان فقال سمعت سلمان غير أنه زاد فأذروني في البحر‏.‏ أو كما حدث‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet mentioned a man from the previous generation or from the people preceding your age whom Allah had given both wealth and children. The Prophet said, \"When the time of his death approached, he asked his children, 'What type of father have I been to you?' They replied: You have been a good father. He said, 'But he (i.e. your father) has not stored any good deeds with Allah (for the Hereafter): if he should face Allah, Allah will punish him. So listen, (O my children), when I die, burn my body till I become mere coal and then grind it into powder, and when there is a stormy wind, throw me (my ashes) in it.' So he took a firm promise from his children (to follow his instructions). And by Allah they (his sons) did accordingly(fulfilled their promise.) Then Allah said, \"Be\"' and behold! That man was standing there! Allah then said. \"O my slave! What made you do what you did?\" That man said, \"Fear of You.\" So Allah forgave him.",
      "usc_msa_ref": "488",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-6627",
      "hadith_no": "6627",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا سليمان التيمي، عن أبي عثمان، عن أسامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قمت على باب الجنة فكان عامة من دخلها المساكين، وأصحاب الجد محبوسون، غير أن أصحاب النار قد أمر بهم إلى النار، وقمت على باب النار فإذا عامة من دخلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated Usama:                     The Prophet said, \"I stood at the gate of Paradise and saw that the majority of the people who had entered it were poor people, while the rich were forbidden (to enter along with the poor, because they were waiting the reckoning of their accounts), but the people of the Fire had been ordered to be driven to the Fire. And I stood at the gate of the Fire and found that the majority of the people entering it were women.\"",
      "usc_msa_ref": "555",
      "chain": [
        "30175",
        "20208",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-7180",
      "hadith_no": "7180",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، ومعتمر، عن أبيه، عن قتادة، أن أنسا، حدثهم عن النبي صلى الله عليه وسلم بهذا وقال عائذا بالله من شر الفتن‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30132",
        "20304",
        "11168",
        "20288",
        "11289",
        "11019"
      ]
    },
    {
      "id": "sahih-bukhari-7334",
      "hadith_no": "7334",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا مسدد، عن يحيى، عن التيمي، عن أبي عثمان، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمنعن أحدكم أذان بلال من سحوره، فإنه يؤذن  أو قال ينادي  ليرجع قائمكم، وينبه نائمكم، وليس الفجر أن يقول هكذا  وجمع يحيى كفيه  حتى يقول هكذا ‏\"‏‏.‏ ومد يحيى إصبعيه السبابتين‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     Allah's Apostle said, \"The (call for prayer) Adhan of Bilal should not stop anyone of you from taking his Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, may return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn (when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).",
      "usc_msa_ref": "353",
      "chain": [
        "30175",
        "20031",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7600",
      "hadith_no": "7600",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، سمعت أبي، حدثنا قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد، عن النبي صلى الله عليه وسلم ‏\"‏ أنه ذكر رجلا فيمن سلف  أو فيمن كان قبلكم قال كلمة يعني  أعطاه الله مالا وولدا  فلما حضرت الوفاة قال لبنيه أى أب كنت لكم قالوا خير أب‏.‏ قال فإنه لم يبتئر  أو لم يبتئز  عند الله خيرا، وإن يقدر الله عليه يعذبه، فانظروا إذا مت فأحرقوني حتى إذا صرت فحما فاسحقوني  أو قال فاسحكوني  فإذا كان يوم ريح عاصف فأذروني فيها ‏\"‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ فأخذ مواثيقهم على ذلك وربي، ففعلوا ثم أذروه في يوم عاصف، فقال الله عز وجل كن‏.‏ فإذا هو رجل قائم‏.‏ قال الله أى عبدي ما حملك على أن فعلت ما فعلت قال مخافتك أو فرق منك قال فما تلافاه أن رحمه عندها  وقال مرة أخرى فما تلافاه غيرها  ‏\"‏‏.‏ فحدثت به أبا عثمان فقال سمعت هذا من سلمان غير أنه زاد فيه أذروني في البحر‏.‏ أو كما حدث‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet mentioned a man from the people of the past or those who preceded you. The Prophet said a sentence meaning: Allah had given him wealth and children. When his death approached, he said to his sons, \"What kind of father have I been to you?\" They replied, \"You have been a good father.\" He told them that he had not presented any good deed before Allah, and if Allah should get hold of him He would punish him.' \"So look!\" he added, \"When I die, burn me, and when I turn into coal, crush me, and when there comes a windy day, scatter my ashes in the wind.\" The Prophet added, \"Then by Allah, he took a firm promise from his children to do so, and they did so. (They burnt him after his death) and threw his ashes on a windy day. Then Allah commanded to his ashes. \"Be,\" and behold! He became a man standing! Allah said, \"O My slave! What made you do what you did?\" He replied, \"For fear of You.\" Nothing saved him then but Allah's Mercy (So Allah forgave him).",
      "usc_msa_ref": "599",
      "chain": [
        "30145",
        "20288",
        "11289",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7631",
      "hadith_no": "7631",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، عن يحيى، عن التيمي، عن أنس بن مالك، عن أبي هريرة، قال  ربما ذكر النبي صلى الله عليه وسلم  قال ‏\"‏ إذا تقرب العبد مني شبرا تقربت منه ذراعا وإذا تقرب مني ذراعا تقربت منه باعا أو بوعا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Perhaps the Prophet mentioned the following (as Allah's Saying): \"If My slave comes nearer to Me for a span, I go nearer to him for a cubit; and if he comes nearer to Me for a cubit; I go nearer to him for the span of outstretched arms. (See Hadith No. 502)",
      "usc_msa_ref": "628",
      "chain": [
        "30175",
        "20031",
        "11289",
        "19",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7632",
      "hadith_no": "7632",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وقال معتمر سمعت أبي، سمعت أنسا، ‏{‏عن أبي هريرة،‏}‏ عن النبي صلى الله عليه وسلم يرويه عن ربه، عز وجل‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289"
      ]
    },
    {
      "id": "sahih-bukhari-7648",
      "hadith_no": "7648",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وقال لي خليفة بن خياط حدثنا معتمر، سمعت أبي، عن قتادة، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لما قضى الله الخلق كتب كتابا عنده غلبت  أو قال سبقت  رحمتي غضبي‏.‏ فهو عنده فوق العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"Before Allah created the creations, He wrote a Book (wherein He has written): My Mercy has preceded my Anger.\" and that (Book) is written with Him over the Throne.\"",
      "usc_msa_ref": "643",
      "chain": [
        "30132",
        "20288",
        "11289",
        "11019",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7649",
      "hadith_no": "7649",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني محمد بن أبي غالب، حدثنا محمد بن إسماعيل، حدثنا معتمر، سمعت أبي يقول، حدثنا قتادة، أن أبا رافع، حدثه أنه، سمع أبا هريرة  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله كتب كتابا قبل أن يخلق الخلق إن رحمتي سبقت غضبي‏.‏ فهو مكتوب عنده فوق العرش ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30274",
        "34188",
        "20288",
        "11289",
        "11019",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-9",
      "hadith_no": "9",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن سليمان التيمي، عن أبي عثمان النهدي، قال قال عمر بن الخطاب رضى الله تعالى عنه بحسب المرء من الكذب أن يحدث بكل ما سمع ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11289",
        "11113",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-105",
      "hadith_no": "105",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا يونس بن محمد، حدثنا المعتمر، عن أبيه، عن يحيى بن يعمر، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم بنحو حديثهم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20393",
        "20288",
        "11289",
        "11316",
        "18",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-289",
      "hadith_no": "289",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا معتمر، قال سمعت أبي يحدث، أن خالدا الأثبج ابن أخي، صفوان بن محرز حدث عن صفوان بن محرز، أنه حدث أن جندب بن عبد الله البجلي بعث إلى عسعس بن سلامة زمن فتنة ابن الزبير فقال اجمع لي نفرا من إخوانك حتى أحدثهم ‏.‏ فبعث رسولا إليهم فلما اجتمعوا جاء جندب وعليه برنس أصفر فقال تحدثوا بما كنتم تحدثون به ‏.‏ حتى دار الحديث فلما دار الحديث إليه حسر البرنس عن رأسه فقال إني أتيتكم ولا أريد أن أخبركم عن نبيكم إن رسول الله صلى الله عليه وسلم بعث بعثا من المسلمين إلى قوم من المشركين وإنهم التقوا فكان رجل من المشركين إذا شاء أن يقصد إلى رجل من المسلمين قصد له فقتله وإن رجلا من المسلمين قصد غفلته قال وكنا نحدث أنه أسامة بن زيد فلما رفع عليه السيف قال لا إله إلا الله ‏.‏ فقتله فجاء البشير إلى النبي صلى الله عليه وسلم فسأله فأخبره حتى أخبره خبر الرجل كيف صنع فدعاه فسأله فقال ‏\"‏ لم قتلته ‏\"‏ ‏.‏ قال يا رسول الله أوجع في المسلمين وقتل فلانا وفلانا - وسمى له نفرا - وإني حملت عليه فلما رأى السيف قال لا إله إلا الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال يا رسول الله استغفر لي ‏.‏ قال ‏\"‏ وكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال فجعل لا يزيده على أن يقول ‏\"‏ كيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated by Safwan b. Muhriz that Jundab b. 'Abdullah al-Bajali during the stormy days of Ibn Zubair sent a message to 'As'as b. Salama:                      Gather some men of your family so that I should talk to them. He ('As'as) sent a messenger to them (to the members of his family). When they had assembled, Jundab came there with a yellow hooded cloak on him, He said: Talk what you were busy in talking. The talk went on by turns, till there came his (Jundab's) turn. He took off the hooded cloak from his head and said: I have come to you with no other intention but to narrate to you a hadith of your Apostle: Verily the Messenger of Allah (may peace be upon him) sent a squad of the Muslims to a tribe of the polytheists. Both the armies confronted one another. There was a man among the army of polytheists who (was so dashing that), whenever he intended to kill a man from among the Muslims, he killed him. Amongst the Muslims too was a man looking forward to (an opportunity of) his (the polytheist's) unmindfulness. He (the narrator) said: We talked that he was Usama b, Zaid. When he raised his sword, he (the soldier of the polytheists) uttered:\" There is no god but Allah,\" but he (Usama b. Zaid) killed him. When the messenger of the glad tidings came to the Apostle (may peace be upon him) he asked him (about the events of the battle) and he informed him about the man (Usama) and what he had done He (the Prophet of Allah) called for him and asked him why he had killed him. He (Usama) said: Messenger of Allah, he struck the Muslims and killed such and such of them. And he even named some of them. (He continued): I attacked him and when he saw the sword he said: There is no god but Allah. The Messenger of Allah (may peace be upon him) said: Did you kill him? He (Usama) replied in the affirmative. He (the Holy Prophet) remarked: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment? He (Usama) said: Messenger of Allah, beg pardon for me (from your Lord). He (the Holy Prophet) said: What would you do with:\" There is no god but Allah\" when he would come (before you) on the Day of Judgment? He (the Holy Prophet) added nothing to it but kept saying: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment?",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20267",
        "20288",
        "11289",
        "11693"
      ]
    },
    {
      "id": "sahih-muslim-388",
      "hadith_no": "388",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن المثنى، وعمرو بن علي، وعقبة بن مكرم العمي، قالوا حدثنا محمد بن أبي عدي، عن سليمان التيمي، عن نعيم بن أبي هند، عن ربعي بن حراش، عن حذيفة، أن عمر، قال من يحدثنا أو قال أيكم يحدثنا - وفيهم حذيفة - ما قال رسول الله صلى الله عليه وسلم في الفتنة قال حذيفة أنا ‏.‏ وساق الحديث كنحو حديث أبي مالك عن ربعي وقال في الحديث قال حذيفة حدثته حديثا ليس بالأغاليط وقال يعني أنه عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is transmitted by Rib'i b. Hirash. who narrated it on the authority of Hudhaifa that verily 'Umar said:                      Who would narrate to us or who amongst you would narrate to us (and Hudhaifa was one amongst them) what the Messenger of Allah (may peace be upon him) had said about the turmoil? Hudhaifa said: I will, and recited the hadith like that transmitted by Abu Malik on the authority of Rib'i and he observed in connection with this hadith that Hudhaifa remarked: I am narrating to you a hadith and it has no mistake, and said: That it is transmitted from he Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30153",
        "30441",
        "20276",
        "11289",
        "10973",
        "11334",
        "145",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-518",
      "hadith_no": "518",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، عن أنس، أن نبي الله صلى الله عليه وسلم قال فذكر نحو حديث قتادة عن أنس ‏.‏",
      "text_en": " Muhammad b. 'Abd al-A'la reported it to me:                      Mu'tamir narrated to us on the authority of his father who transmitted it liom Anas that verity the Apostle of Allah (may peace be upon him) said, and then narrated the hadith like the one transmitted by Qatada on the authority of Anas.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-527",
      "hadith_no": "527",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا يزيد بن زريع، حدثنا التيمي، عن أبي عثمان، عن قبيصة بن المخارق، وزهير بن عمرو، قالا لما نزلت ‏{‏ وأنذر عشيرتك الأقربين‏}‏ قال انطلق نبي الله صلى الله عليه وسلم إلى رضمة من جبل فعلا أعلاها حجرا ثم نادى ‏\"‏ يا بني عبد منافاه إني نذير إنما مثلي ومثلكم كمثل رجل رأى العدو فانطلق يربأ أهله فخشي أن يسبقوه فجعل يهتف يا صباحاه ‏\"‏ ‏.‏",
      "text_en": " Qabisa b. al-Mukhariq and Zuhair b. 'Amr reported:                      When this verse was revealed:\" And warn thy nearest kindred,\" the Apostle of Allah (may peace be upon him) set off towards a rock of the hill and ascended the highest of the rocks and then called: 0 sons of 'Abd Manaf! I am a warner; my similitude and your similitude is like a man who saw the enemy and went to guard his people, but, being afraid they might get there before him, he shouted: Be on your guard!",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20304",
        "11289",
        "11113",
        "5233",
        "5040"
      ]
    },
    {
      "id": "sahih-muslim-528",
      "hadith_no": "528",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، حدثنا أبو عثمان، عن زهير بن عمرو، وقبيصة بن مخارق، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " This hadith is narrated from the Apostle of Allah (may peace be upon him) by another chain of narrators, Muhammad b. Abd al-A'la, Mu'tamir, Abu 'Uthman, Zuhair b. 'Amr, Qabisa b. Mukhariq.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11113",
        "5040"
      ]
    },
    {
      "id": "sahih-muslim-274-10",
      "hadith_no": "274",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أمية بن بسطام، ومحمد بن عبد الأعلى، قالا حدثنا المعتمر، عن أبيه، قال حدثني بكر بن عبد الله، عن ابن المغيرة، عن أبيه، أن النبي صلى الله عليه وسلم مسح على الخفين ومقدم رأسه وعلى عمامته ‏.‏",
      "text_en": " Ibn Mughira narrated it from his father:                      The Apostle of Allah (may peace be upon him) wiped over his socks and over his forehead and over his turban.",
      "usc_msa_ref": "",
      "chain": [
        "30124",
        "30449",
        "20288",
        "11289",
        "11267"
      ]
    },
    {
      "id": "sahih-muslim-274-11",
      "hadith_no": "274",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، عن بكر، عن الحسن، عن ابن المغيرة، عن أبيه، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been transmitted by Ibn Mughira on the authority of his father by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11267",
        "11016",
        "4140"
      ]
    },
    {
      "id": "sahih-muslim-274-12",
      "hadith_no": "274",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن بشار، ومحمد بن حاتم، جميعا عن يحيى القطان، قال ابن حاتم حدثنا يحيى بن سعيد، عن التيمي، عن بكر بن عبد الله، عن الحسن، عن ابن المغيرة بن شعبة، عن أبيه، قال بكر وقد سمعت من ابن المغيرة، أن النبي صلى الله عليه وسلم توضأ فمسح بناصيته وعلى العمامة وعلى الخفين ‏.‏",
      "text_en": " Bakr reported that he had heard from the son of Mughira that verily the Apostle of Allah (may peace be upon him) performed ablution and wiped over his forehead and wiped over his turban and over his socks.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "38487",
        "20031",
        "11289",
        "11267",
        "11016",
        "11373",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-344-2",
      "hadith_no": "344",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا المعتمر، حدثنا أبي، حدثنا أبو العلاء بن الشخير، قال كان رسول الله صلى الله عليه وسلم ينسخ حديثه بعضه بعضا كما ينسخ القرآن بعضه بعضا ‏.‏",
      "text_en": " Abu al. 'Ala' b. al-Shikhkhir said:                      The Messenger of Allah (may peace be upon him) abrogated some of his commands by others, just as the Qur'an abrogates some part with the other.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20288",
        "11289",
        "11318"
      ]
    },
    {
      "id": "sahih-muslim-461-2",
      "hadith_no": "461",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن التيمي، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة من الستين إلى المائة ‏.‏",
      "text_en": " Abu Barza reported:                      The Messenger of Allah (may peace be upon him) used to recite in the morning prayer from sixty to one hundred verses.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-1332",
      "hadith_no": "1332",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى، قالا حدثنا المعتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة صلاة العتمة فقرأ ‏{‏ إذا السماء انشقت‏}‏ فسجد فيها ‏.‏ فقلت له ما هذه السجدة فقال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ‏.‏ وقال ابن عبد الأعلى فلا أزال أسجدها ‏.‏",
      "text_en": " Abu Rafi' reported:                      I said the night prayer along with Abu Huraira and -as he recited:\" When the heaven burst asunder,\" he performed prostration. Isaid to him: What prostration is this? He said: I prostrated myself (on this occasion of recital) behind Abu'I-Qasim (Muhammad. may peace be upon him), and Iwould go on doing this till I meet him (in the next world). Ibn 'Abu al-A'la said: (Abu Huraira uttered this: ) I would not abandon performing prostration.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "30449",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-muslim-1546",
      "hadith_no": "1546",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبثر، عن سليمان التيمي، عن أبي عثمان النهدي، عن أبى بن كعب، قال كان رجل لا أعلم رجلا أبعد من المسجد منه وكان لا تخطئه صلاة - قال - فقيل له أو قلت له لو اشتريت حمارا تركبه في الظلماء وفي الرمضاء ‏.‏ قال ما يسرني أن منزلي إلى جنب المسجد إني أريد أن يكتب لي ممشاى إلى المسجد ورجوعي إذا رجعت إلى أهلي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد جمع الله لك ذلك كله ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported:                      There was a man, and I do not know of any other man, whose house was farther than his from the mosque and he never missed the prayer (in congregation). It was said to him or I said to him: It you were to buy a donkey you could ride upon it In the dark nights and in the burning sand. He said: I do not like my house to be situated by the side of the mosque, for I (eagerly) desire that my steps towards the mosque and back from it, should be recorded when I return to my family. Upon this the Messenger of Allah (may peace be upon him) said: Allah has gathered all (rewards) for you.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11289",
        "11113",
        "39"
      ]
    },
    {
      "id": "sahih-muslim-1579",
      "hadith_no": "1579",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، وأبو كريب وإسحاق بن إبراهيم ومحمد بن عبد الأعلى - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، عن أبيه، عن أبي مجلز، عن أنس بن مالك، قنت رسول الله صلى الله عليه وسلم شهرا بعد الركوع في صلاة الصبح يدعو على رعل وذكوان ويقول ‏\"‏ عصية عصت الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Ri'l, Dhakwan, and said that 'Usayya had disobeyed Allah and His Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20288",
        "11289",
        "11313"
      ]
    },
    {
      "id": "sahih-muslim-1722",
      "hadith_no": "1722",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن حبيب، حدثنا معتمر، قال قال أبي حدثنا قتادة، عن زرارة، عن سعد بن هشام، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال في شأن الركعتين عند طلوع الفجر ‏\"‏ لهما أحب إلى من الدنيا جميعا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Apostle of Allah (may peace be upon him) said about the two (supererogatory) rak'ahs of the dawn:                      They are dearer to me than the whole world.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "11166",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2489",
      "hadith_no": "2489",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ، وحامد بن عمر، ومحمد بن عبد الأعلى، قال ابن معاذ حدثنا المعتمر بن سليمان، عن أبيه، قال حدثني السميط، عن أنس بن مالك، قال افتتحنا مكة ثم إنا غزونا حنينا فجاء المشركون بأحسن صفوف رأيت - قال - فصفت الخيل ثم صفت المقاتلة ثم صفت النساء من وراء ذلك ثم صفت الغنم ثم صفت النعم - قال - ونحن بشر كثير قد بلغنا ستة آلاف وعلى مجنبة خيلنا خالد بن الوليد - قال - فجعلت خيلنا تلوي خلف ظهورنا فلم نلبث أن انكشفت خيلنا وفرت الأعراب ومن نعلم من الناس - قال - فنادى رسول الله صلى الله عليه وسلم ‏\"‏ يا للمهاجرين يا للمهاجرين ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا للأنصار يا للأنصار ‏\"‏ ‏.‏ قال قال أنس هذا حديث عمية ‏.‏ قال قلنا لبيك يا رسول الله - قال - فتقدم رسول الله صلى الله عليه وسلم - قال - فايم الله ما أتيناهم حتى هزمهم الله - قال - فقبضنا ذلك المال ثم انطلقنا إلى الطائف فحاصرناهم أربعين ليلة ثم رجعنا إلى مكة فنزلنا - قال - فجعل رسول الله صلى الله عليه وسلم يعطي الرجل المائة من الإبل ‏.‏ ثم ذكر باقي الحديث كنحو حديث قتادة وأبي التياح وهشام بن زيد ‏.‏",
      "text_en": " Anas b. Malik reported:                      We conquered Mecca and then we went on an expedition to Hunain. The polytheists came, forming themselves into the best rows that I have seen. They first formed the rows of cavalry, then those of infantry, and then those of women behind them. Then there were formed the rows of sheep and goats and then of other animals. We were also people large in number, and our (number) had reached six thousand. And on one side Khalid b. Walid was in charge of the cavalry. And our horses at once turned back from our rear. And we could hardly hold our own when our horses were exposed, and the bedouins and the peoplewhom we knew took to their heels. (Seeing this) the Messenger of Allah (may peace be upon him) called thus: 0 refugees,0 refugees. He then. said: 0 Ansar,0 Ansar. (Anas said: This hadith is transmitted by a group of eminent persons.) We said: At thy beck and call are we, Messenger of Allah. The Messenger of Allah (may peace be upon him) then advanced and he (Anas) said: By Allah, we had not yet reached them when Allah defeated them. and we took possession of the wealth and we then marched towards Ta'if, and we besieged them for forty nights. and then came back to Mecca and encamped (at a place), and the Messenger of Allah (may peace be upon him) began to bestow a hundred camels upon each individual. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "30128",
        "30449",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2593",
      "hadith_no": "2593",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن سليمان التيمي، عن أبي، عثمان عن ابن مسعود، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمنعن أحدا منكم أذان بلال - أو قال نداء بلال - من سحوره فإنه يؤذن - أو قال ينادي - بليل ليرجع قائمكم ويوقظ نائمكم ‏\"‏ ‏.‏ وقال ‏\"‏ ليس أن يقول هكذا وهكذا - وصوب يده ورفعها - حتى يقول هكذا ‏\"‏ ‏.‏ وفرج بين إصبعيه ‏.‏",
      "text_en": " Ibn Mas'ud (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying The Adhan of Bilal should not restrain anyone among you from eating Sahur (last meal before daybreak during the month of Ramadan) for he announces Adhan (or he calls) at (the fag end of) the night to make him turn who stands for prayer among you, and to awaken those who are sleeping among you. And he said:                      The dawn is not like it, as one says (and he lifted his hand) till he (dispersed his fingers) and said: It is like this.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-2672",
      "hadith_no": "2672",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، عن التيمي، ح وحدثناه محمد بن المثنى، حدثنا ابن مهدي، حدثنا شعبة، وقال ابن المثنى، حدثنا أبو عامر، حدثنا هشام، وقال ابن المثنى، حدثنا سالم بن نوح، حدثنا عمر يعني ابن عامر، ح وحدثنا أبو بكر بن أبي شيبة حدثنا محمد بن بشر، عن سعيد، كلهم عن قتادة، بهذا الإسناد ‏.‏ نحو حديث همام غير أن في حديث التيمي وعمر بن عامر وهشام لثمان عشرة خلت وفي حديث سعيد في ثنتى عشرة ‏.‏ وشعبة لسبع عشرة أو تسع عشرة ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Qatada with the same chain of transmitters by different narrators (except this difference) that in the hadith transmitted by Taimi and Umar b. Amir and Hisham (the date of setting out is) 18th, and in the hadith transmitted by Sa'id it is the 12th, and in the one transmitted by Shu'ba it is the 17th or 19th.",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20031",
        "11289",
        "30170",
        "20033",
        "20020",
        "20443",
        "20295",
        "20542",
        "30201",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-3028",
      "hadith_no": "3028",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وابن أبي عمر، جميعا عن الفزاري، - قال سعيد حدثنا مروان بن معاوية، - أخبرنا سليمان التيمي، عن غنيم بن قيس، قال سألت سعد بن أبي وقاص - رضى الله عنه - عن المتعة، فقال فعلناها وهذا يومئذ كافر بالعرش ‏.‏ يعني بيوت مكة ‏.‏",
      "text_en": " Ghunaim b. Qais said:                      I asked Sa'd b. Abu Waqqas (Allah be pleased with him) about Mut'a, whereupon he said: We did that, and it was the day when he was an unbeliever living in (one of the) houses of Mecca.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "30421",
        "20405",
        "11168",
        "20201",
        "11289",
        "10710",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-3578",
      "hadith_no": "3578",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، وعاصم بن النضر التيمي، ومحمد بن عبد الأعلى، كلهم عن معتمر، - واللفظ لابن حبيب - حدثنا معتمر بن سليمان، قال سمعت أبي، حدثنا أبو مجلز، عن أنس بن مالك، قال لما تزوج النبي صلى الله عليه وسلم زينب بنت جحش دعا القوم فطعموا ثم جلسوا يتحدثون - قال - فأخذ كأنه يتهيأ للقيام فلم يقوموا فلما رأى ذلك قام فلما قام قام من قام من القوم ‏.‏ زاد عاصم وابن عبد الأعلى في حديثهما قال فقعد ثلاثة وإن النبي صلى الله عليه وسلم جاء ليدخل فإذا القوم جلوس ثم إنهم قاموا فانطلقوا - قال - فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا - قال - فجاء حتى دخل فذهبت أدخل فألقى الحجاب بيني وبينه - قال - وأنزل الله عز وجل ‏{‏ يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏ إن ذلكم كان عند الله عظيما‏}‏ ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) reported:                      When Allah's Apostle (may peace be upon him) married Zainab bint jahsh, he invited people (to the wedding feast) and they ate food. They then sat there and entered into conversation. He (the Holy Prophet) made a stir as if he was preparing to stand up, but (the persons busy in talking) did not stand up. When he (the Holy Prophet) saw it, he stood up and when he did so, some other persons stood up. 'Asim and Abd al-A'la in their narrations made this addition: Three (persons) sat there, and Allah's Apostle (may peace be upon him) came there to enter (the apartment) but he found the people sitting there. Then they stood up and went away. He said: Then I came and informed Allah's Apostle (may peace be upon him) that they had gone away. He (the Holy Prophet) then came there until he entered (the apartment). I also went and was about to enter, when he hung a curtain between me and him (and it was on this occasion that) Allah, the Exalted and Majestic, revealed this verse:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished to the (words)\" Surely this is serious in the sight of Allah\" (xxxiii. 53).",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-3715",
      "hadith_no": "3715",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، قال سمعت أبي، حدثنا أبو نضرة، عن جابر بن عبد الله، قال كنا في مسير مع رسول الله صلى الله عليه وسلم وأنا على ناضح إنما هو في أخريات الناس - قال - فضربه رسول الله صلى الله عليه وسلم أو قال نخسه - أراه قال - بشىء كان معه قال فجعل بعد ذلك يتقدم الناس ينازعني حتى إني لأكفه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قال قلت هو لك يا نبي الله ‏.‏ قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قال قلت هو لك يا نبي الله ‏.‏ قال وقال لي ‏\"‏ أتزوجت بعد أبيك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ثيبا أم بكرا ‏\"‏ ‏.‏ قال قلت ثيبا ‏.‏ قال ‏\"‏ فهلا تزوجت بكرا تضاحكك وتضاحكها وتلاعبك وتلاعبها ‏\"‏ ‏.‏ قال أبو نضرة فكانت كلمة يقولها المسلمون ‏.‏ افعل كذا وكذا والله يغفر لك ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We were with Allah's Messenger (may peace be upon him) in a journey, and I was riding a camel meant for carrying water and it lagged behind all persons. Allah's Messenger (may peace be upon him) hit it or goaded it (I think) with something he had with him. And after it (it moved so quickly) that it went ahead of all persons and it struggled with me (to move faster than I permitted It) and I had to restrain it. Allah's Messenger (may peace be upon him) said: Do you sell it at such and such (price)? May Allah grant you pardon. I said: Allah's Apostle, it is yours. He (again) said: Do you sell it at such and such (price)? May Allah grant you pardon. ' I said: Allah's Apostle, it is yours. He said to me: Have you married after the death of your father? I said: Yes. He (again) said: With one previously married or a virgin? I said: With one previously married. He said: Why didn't you marry a virgin who might amuse you and you might amuse her, and she might sport with you and you might sport with her? Abu Nadra said: That was the common phrase which the Muslims spoke:\" You do such and such (thing) and Allah may grant you pardon.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3896",
      "hadith_no": "3896",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن مبارك، عن التيمي، عن أبي، عثمان عن عبد الله، عن النبي صلى الله عليه وسلم أنه نهى عن تلقي البيوع ‏.‏",
      "text_en": " Abdullah (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Do not meet the traders (in the way).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4358",
      "hadith_no": "4358",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن سليمان التيمي، عن ضريب بن، نقير القيسي عن زهدم، عن أبي موسى الأشعري، قال أتينا رسول الله صلى الله عليه وسلم نستحمله فقال ‏\"‏ ما عندي ما أحملكم والله ما أحملكم ‏\"‏ ‏.‏ ثم بعث إلينا رسول الله صلى الله عليه وسلم بثلاثة ذود بقع الذرى فقلنا إنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا فأتيناه فأخبرناه فقال ‏\"‏ إني لا أحلف على يمين أرى غيرها خيرا منها إلا أتيت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported:                      We came to Allah's Messenger (may peace be upon him) requesting him to provide us with riding camels. He (the Holy Prophet) said: There is nothing with me with which I should equip you. By Allah, I would not provide you with (riding camels). Then Allah's Messenger (may peace be upon him) sent to us three camels with spotted bumps. We said: We came to Allah's Messenger (may peace be upon him) asking him to equip us with riding animals. He took an oath that he could not equip us. We came to him and informed him. He said: By Allah, I do not take an oath, but when I find the other thing better than that, I do that which is better.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11289",
        "11589",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-4359",
      "hadith_no": "4359",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عبد الأعلى التيمي، حدثنا المعتمر، عن أبيه، حدثنا أبو السليل، عن زهدم، يحدثه عن أبي موسى، قال كنا مشاة فأتينا نبي الله صلى الله عليه وسلم نستحمله ‏.‏ بنحو حديث جرير ‏.‏",
      "text_en": " Abu Musa reported:                      We walked on foot and came to Allah's Apostle (may peace he upon him) asking him to provide us with mounts. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-4372",
      "hadith_no": "4372",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني علي بن حجر السعدي، حدثنا هشيم، عن يونس، ومنصور، وحميد، ح وحدثنا أبو كامل الجحدري، حدثنا حماد بن زيد، عن سماك بن عطية، ويونس بن عبيد، وهشام، بن حسان في آخرين ح وحدثنا عبيد الله بن معاذ، حدثنا المعتمر، عن أبيه، ح وحدثنا عقبة بن مكرم العمي، حدثنا سعيد بن عامر، عن سعيد، عن قتادة، كلهم عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ بهذا الحديث وليس في حديث المعتمر عن أبيه ذكر الإمارة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abd al-Rahman b. Samura through another chain of transmitters but there is no mention of the word\" authority\".",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20468",
        "20475",
        "11067",
        "11279",
        "30559",
        "20022",
        "11075",
        "11311",
        "30150",
        "20288",
        "11289",
        "30441",
        "20232",
        "11168"
      ]
    },
    {
      "id": "sahih-muslim-4453",
      "hadith_no": "4453",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني الفضل بن سهل الأعرج، حدثنا يحيى بن غيلان، حدثنا يزيد بن زريع، عن سليمان التيمي، عن أنس، قال إنما سمل النبي صلى الله عليه وسلم أعين أولئك لأنهم سملوا أعين الرعاء ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) pierced their eyes because they had pierced the eyes of the shepherds.",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "30527",
        "20304",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4703",
      "hadith_no": "4703",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن أبي شيبة - حدثنا معتمر بن سليمان التيمي، عن أبيه، عن أنس، أن رجلا، - وقال حامد وابن عبد الأعلى أن الرجل، - كان يجعل للنبي صلى الله عليه وسلم النخلات من أرضه ‏.‏ حتى فتحت عليه قريظة والنضير فجعل بعد ذلك يرد عليه ما كان أعطاه ‏.‏ قال أنس وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله ما كان أهله أعطوه أو بعضه وكان نبي الله صلى الله عليه وسلم قد أعطاه أم أيمن فأتيت النبي صلى الله عليه وسلم فأعطانيهن فجاءت أم أيمن فجعلت الثوب في عنقي وقالت والله لا نعطيكاهن وقد أعطانيهن ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ يا أم أيمن اتركيه ولك كذا وكذا ‏\"‏ ‏.‏ وتقول كلا والذي لا إله إلا هو ‏.‏ فجعل يقول كذا حتى أعطاها عشرة أمثاله أو قريبا من عشرة أمثاله ‏.‏",
      "text_en": " It has been narrated by Anas that (after his migration to Medina) a person placed at the Prophet's (may peace be upon him) disposal some date-palms growing on his land until the lands of Quraiza and Nadir were conquered. Then he began to return to him whatever he had received. (In this connection) my people told me to approach the Messenger of Allah (may peace be upon him) and ask from him what his people had given him or a portion thereof, but the Messenger of Allah (may peace be upon him) had bestowed those trees upon Umm Aiman. So I came to the Prophet (may peace be upon him) and he gave hem (back) to me. Umm Aiman (also) came (at this time). She put the cloth round my neck and said:                      No, by Allah, we will not give to, you what he has granted to me. The Holy Prophet (may peace be upon him) said: Umm Aiman, let him have them and for you are such and such trees instead. But she said: By Allah, there is no god besides Him. No, never! The Holy Prophet (may peace be upon him) continued saying: (You will get) such and such. until he had granted her ten times or nearly ten times more (than the original gift).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30128",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4738",
      "hadith_no": "4738",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي، حدثنا قتادة، قال سمعت أنس بن مالك، ح وحدثنا ابن المثنى، حدثنا أبو داود، حدثنا همام، ح وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، جميعا عن قتادة، عن أنس، نحو حديث ابن أبي عروبة ‏.‏",
      "text_en": " This tradition has been narrated through a different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19",
        "30002",
        "20297",
        "30553",
        "20393",
        "11019"
      ]
    },
    {
      "id": "sahih-muslim-4762",
      "hadith_no": "4762",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عبد الأعلى القيسي، حدثنا المعتمر، عن أبيه، عن أنس بن مالك، قال قيل للنبي صلى الله عليه وسلم لو أتيت عبد الله بن أبى قال فانطلق إليه وركب حمارا وانطلق المسلمون وهي أرض سبخة فلما أتاه النبي صلى الله عليه وسلم قال إليك عني فوالله لقد آذاني نتن حمارك ‏.‏ قال فقال رجل من الأنصار والله لحمار رسول الله صلى الله عليه وسلم أطيب ريحا منك - قال - فغضب لعبد الله رجل من قومه - قال - فغضب لكل واحد منهما أصحابه - قال - فكان بينهم ضرب بالجريد وبالأيدي وبالنعال - قال - فبلغنا أنها نزلت فيهم ‏{‏ وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that it was said to the Holy Prophet (may peace be upon him):                      Would that you approached Abdullah b. Ubayy (to persuade him to accept Islam). The Holy Prophet (may peace be upon him) (accordingly) went to him, riding a donkey, and (a party of) Muslims also went (with him). On the way they had to walk over a piece of land affected with salinity. When the Holy Prophet (may peace be upon him) approached him, he said: Do not come near me. By Allah, the obnoxious smell of your donkey has offended me. (As a rejoinder to this remark), a man from the Ansar said: By God, the smell of the donkey of the Messenger of Allah (may peace be upon him) is better than your smell. (At this), a man from the tribe of 'Abdullah got furious. Then people from both sides got furious and exchanged blows with sticks, hands and shoes. (The narrator says) that (after this scuffle) we learnt that (the Qur'anic verse):\" It two parties of the Believers have a quarrel, make ye peace between them\" (xlix. 9) was revealed about these fighting parties.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4763",
      "hadith_no": "4763",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر السعدي، أخبرنا إسماعيل، - يعني ابن علية - حدثنا سليمان، التيمي حدثنا أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ينظر لنا ما صنع أبو جهل ‏\"‏ ‏.‏ فانطلق ابن مسعود فوجده قد ضربه ابنا عفراء حتى برك - قال - فأخذ بلحيته فقال آنت أبو جهل فقال وهل فوق رجل قتلتموه - أو قال - قتله قومه قال وقال أبو مجلز قال أبو جهل فلو غير أكار قتلني ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said (after the encounter at Badr):                      Who will ascertain for us what has happened to Abu Jahl? Ibn Mas'ud went (to gather this information). He found that the two sons of 'Afra' had struck him and he lay cold at the point of death. He caught him by his beard and said: Art thou Abu Jahl? He said: is there anybody superior to the person you have killed, or (he said) his people have killed him. Ibn Mas'ud says that, according to Abu Mijlaz, Abu Jahl said: Alas! a person other than a farmer would have killed me.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4764",
      "hadith_no": "4764",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا حامد بن عمر البكراوي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يعلم لي ما فعل أبو جهل ‏\"‏ ‏.‏ بمثل حديث ابن علية وقول أبي مجلز كما ذكره إسماعيل ‏.‏",
      "text_en": " A similar tradition has been transmitted by a different chain of narrators, on the same authority with a slight difference In the wording.",
      "usc_msa_ref": "",
      "chain": [
        "30128",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4898",
      "hadith_no": "4898",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هريم بن عبد الأعلى، حدثنا المعتمر، قال سمعت أبي يحدث، عن أبي، مجلز عن جندب بن عبد الله البجلي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل تحت راية عمية يدعو عصبية أو ينصر عصبية فقتلة جاهلية ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn 'Abdullah al-Bajali that the Messenger of Allah (may peace be upon him) said:                      One who is killed under the banner of a man who is blind (to his just cause), who raises the slogan of family or supports his own tribe, dies the death of one belonging to the days of Jahiliyya.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11313",
        "4053"
      ]
    },
    {
      "id": "sahih-muslim-5249",
      "hadith_no": "5249",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، قال قال أنس كنت قائما على الحى أسقيهم ‏.‏ بمثل حديث ابن علية غير أنه قال فقال أبو بكر بن أنس كان خمرهم يومئذ ‏.‏ وأنس شاهد فلم ينكر أنس ذاك ‏.‏ وقال ابن عبد الأعلى حدثنا المعتمر عن أبيه قال حدثني بعض من كان معي أنه سمع أنسا يقول كان خمرهم يومئذ ‏.‏",
      "text_en": " Anas reported:                      I was standing amongst the members of my (tribe) and serving them liquor. The rest of the hadith is the same, but with this variation that Abu Bakr b. Anas said: It was their liquor in those days (prepared from dates), and Anas was present there and he did not deny this (fact) Mu'tamir reported on the authority of his father: A person who was with me told me that he had heard Anas saying that that was their liquor in those days.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5264",
      "hadith_no": "5264",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن التيمي، عن أبي نضرة، عن  أبي سعيد، أن النبي صلى الله عليه وسلم نهى عن التمر والزبيب أن يخلط بينهما وعن التمر والبسر أن يخلط بينهما ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Apostle (may peace be upon him) prohibited that fresh dates and grapes be mixed together and that fresh dates and unripe dates be mixed together.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5298",
      "hadith_no": "5298",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن التيمي، ح وحدثنا يحيى بن، أيوب حدثنا ابن علية، أخبرنا سليمان التيمي، عن أبي نضرة، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم نهى عن الجر أن ينبذ فيه ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11289",
        "20379",
        "20208",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5307",
      "hadith_no": "5307",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا ابن علية، حدثنا سليمان التيمي، عن طاوس، قال قال رجل لابن عمر أنهى نبي الله صلى الله عليه وسلم عن نبيذ الجر قال نعم ‏.‏ ثم قال طاوس والله إني سمعته منه ‏.‏",
      "text_en": " A person asked Ibn 'Umar if the Apostle of Allah (may peace be upon him) forbade the preparation of Nabidh in a green pitcher (besmeared with pitch). He said:                      Yes. Then Tawus said: By Allah, I heard it from him.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20208",
        "11289",
        "11053"
      ]
    },
    {
      "id": "sahih-muslim-5485",
      "hadith_no": "5485",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد، الأعلى جميعا عن المعتمر بن سليمان، - واللفظ لابن معاذ - حدثنا المعتمر، حدثنا أبي، عن أبي عثمان، - وحدث أيضا، - عن عبد الرحمن بن أبي بكر، قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏ ‏.‏ فإذا مع رجل صاع من طعام أو نحوه فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية - أو قال - أم هبة ‏\"‏ ‏.‏ فقال لا بل بيع ‏.‏ فاشترى منه شاة فصنعت وأمر رسول الله صلى الله عليه وسلم بسواد البطن أن يشوى ‏.‏ قال وايم الله ما من الثلاثين ومائة إلا حز له رسول الله صلى الله عليه وسلم حزة حزة من سواد بطنها إن كان شاهدا أعطاه وإن كان غائبا خبأ له - قال - وجعل قصعتين فأكلنا منهما أجمعون وشبعنا وفضل في القصعتين فحملته على البعير ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abu Bakr reported:                      We were one hundred and thirty (persons) with Allah's Apostle (may peace be upon him). Allah's Apostle (may peace be upon him) said: Does any one of You possess food? There was a person with (us) who had a sa' of flour or something about that, and it was kneaded. Then a tall polytheist with dishevelled hair came driving his flock of sheep. Thereupon Allah's Apostle (may peace be upon him) said: Would you like to sell it (any one of these goats) or offer it as a gift or a present? He said: No, (I am not prepared to offer as a gift), but I would sell it. He (the Holy Prophet) bought a sheep from him, and it was slaughtered and its meat was prepared, and Allah's Messenger (may peace be upon him) commanded that its liver should be roasted. He (the narrator) said: By Allah, none among one hundred and thirty persons was left whom Allah's Messenger (may peace be upon him) had not given a part out of her liver; if anyone was present he gave it to him. but if he was absent it was set aside for him. And he (the Holy Prophet) filled two bowls (one with soup and the other with mutton) and we all ate out of them to our hearts' content, but (still) some part was (left) in (those) two bowls, and I placed it on the camel- (or words to the same effect).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "30128",
        "20288",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "id": "sahih-muslim-5486",
      "hadith_no": "5486",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، القيسي كلهم عن المعتمر، - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا ناسا فقراء وإن رسول الله صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثلاثة ومن كان عنده طعام أربعة فليذهب بخامس بسادس ‏\"‏ ‏.‏ أو كما قال ‏.‏ وإن أبا بكر جاء بثلاثة وانطلق نبي الله صلى الله عليه وسلم بعشرة وأبو بكر بثلاثة - قال - فهو وأنا وأبي وأمي - ولا أدري هل قال وامرأتي وخادم بين بيتنا وبيت أبي بكر - قال وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ‏.‏ ثم لبث حتى صليت العشاء ثم رجع فلبث حتى نعس رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله قالت له امرأته ما حبسك عن أضيافك - أو قالت - ضيفك قال أوما عشيتهم قالت أبوا حتى تجيء قد عرضوا عليهم فغلبوهم - قال - فذهبت أنا فاختبأت وقال يا غنثر ‏.‏ فجدع وسب وقال كلوا لا هنيئا ‏.‏ وقال والله لا أطعمه أبدا - قال - فايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها - قال - حتى شبعنا وصارت أكثر مما كانت قبل ذلك فنظر إليها أبو بكر فإذا هي كما هي أو أكثر ‏.‏ قال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرار - قال - فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان - يعني يمينه - ثم أكل منها لقمة ثم حملها إلى رسول الله صلى الله عليه وسلم فأصبحت عنده - قال - وكان بيننا وبين قوم عقد فمضى الأجل فعرفنا اثنا عشر رجلا مع كل رجل منهم أناس الله أعلم كم مع كل رجل إلا أنه بعث معهم فأكلوا منها أجمعون ‏.‏ أو كما قال ‏.‏",
      "text_en": " 'Abd al-Rabman b. Abu Bakr reported that the people of Suffa were very poor. Once the Messenger of Allah (may peace be upon him) said (to his Companions):                      He who amongst you has food for two persons should take three (guests with him). and he who has with him food for four persons should take five or six (guests with him for entertaining them). It was (in accordance with these instructions of the Holy Prophet) that Abu Bakr brought three persons, and the Apostle of Allah (may peace be upon him) brought ten persons (as guests to their respective houses). Abu Bakr had brought three persons (he himself, and myself), my father and my mother (along with therm). He (the narrator) said: I do not know whether he also said: My wife and one servant who was common between our house and that of Abu Bakr. Abu Bakr had had his evening meal with Allah's Apostle (may peace be upon him). He stayed here until night prayer had been offered. He then came back (to the house of Allah's Apostle) and stayed there until Allah's Messenger (may peace be upon him) felt drowsy and (Abu Bakr) then came (back to his own house) when (a considerable) part of the night had been over, as Allah had desired. His wife said to him: What held you back from your guests? He said: Oh! have you not served them the evening meal (by this time)? She said: It was in fact served to them. but they refused to eat until you came. He ('Abd al-Rahman) said: I slunk away and bid myself. He (Abu Bakr) said: O, you stupid fellow, and he reprimanded me, and said to the guests: Eat, though it may not be pleasant now. He said: By Allah. I will never eat it He ('Abd al-Rahman) said: By Allah. we did not take a morsel when from beneath that (there appeared) more until they had eaten to their fill, and lo! it was more than what it was before. Abu Bakr saw that and found that it was so or more than that. He said to his wife: Sister of Band Firis, what is th-is? She said: By the coolness of my eyes. it is in excess by three times over the previous one. Then Abu Bakr ate saying: That was from the Satan (viz. his vow for not eating the food). He then took a morsel out of that and then took it (the rest) to the Messenger of Allah (may peace be upon him), and it was kept there until morning, and during (those days) there was a covenant between us and some other people, and the period of covenant was over, and we had appointed twelve officials with every person amongst them. It is Allah only Who knows as to how many people were there with each of them. He sent (this food to them) and all of them ate out of it.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "30128",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "id": "sahih-muslim-5534",
      "hadith_no": "5534",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا ابن أبي شيبة، - وهو عثمان - وإسحاق بن إبراهيم الحنظلي كلاهما عن جرير، - واللفظ لإسحاق - أخبرنا جرير، عن سليمان التيمي، عن أبي عثمان، قال كنا مع عتبة بن فرقد فجاءنا كتاب عمر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يلبس الحرير إلا من ليس له منه شىء في الآخرة إلا هكذا ‏\"‏ ‏.‏ وقال أبو عثمان بإصبعيه اللتين تليان الإبهام ‏.‏ فرئيتهما أزرار الطيالسة حين رأيت الطيالسة ‏.‏",
      "text_en": " Abu 'Uthman reported:                      While we were with 'Utba b. Farqad there came a letter of 'Umar (containing the instructions) that Allah's Messenger (may peace be upon him) had said: None should wear silk (with the exception of so much) but he will have nothing of it in the Hereafter. Abu 'Uthman said: To the extent of two fingers which are close to the thumb, and I was shown the (silk) borders of the Tayalisa mantle (which were about two fingers in breadth and I saw them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20028",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-5535",
      "hadith_no": "5535",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، حدثنا أبو عثمان، قال كنا مع عتبة بن فرقد بمثل حديث جرير ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-5722",
      "hadith_no": "5722",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة قال أبو بكر حدثنا معتمر بن، سليمان عن الركين، عن أبيه، عن سمرة، وقال، يحيى أخبرنا المعتمر بن سليمان، قال سمعت  الركين، يحدث عن أبيه، عن سمرة بن جندب، قال نهانا رسول الله صلى الله عليه وسلم أن نسمي رقيقنا بأربعة أسماء أفلح ورباح ويسار ونافع ‏.‏",
      "text_en": " Samura b. Jundub reported:                      Allah's Messenger (may peace be upon him) forbade us to give names to our servants as these four names: Aflah (Successful), Rabdh (Profit), Yasar (Wealth), and Nafi' (Beneficial).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30201",
        "20436",
        "20288",
        "11289",
        "394",
        "20031",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "id": "sahih-muslim-6138",
      "hadith_no": "6138",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، وهريم بن عبد الأعلى، - واللفظ لعاصم - حدثنا  معتمر، سمعت أبي، حدثنا قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما بين ناحيتى حوضي كما بين صنعاء والمدينة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Milik reported Allah's Messenger (may peace be upon him) as saying:                      There would be such a vast distance between the sides of my Cistern as it is between Sana' and Medina.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6183",
      "hadith_no": "6183",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن سليمان التيمي، عن أنس، بن مالك ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11289"
      ]
    },
    {
      "id": "sahih-muslim-6184",
      "hadith_no": "6184",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو كامل، حدثنا يزيد، حدثنا التيمي، عن أنس بن مالك، قال كانت أم سليم مع نساء النبي صلى الله عليه وسلم وهن يسوق بهن سواق فقال نبي الله صلى الله عليه وسلم ‏\"‏ أى أنجشة رويدا سوقك بالقوارير ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Umm Sulaim was with the wives of Allah's Apostle (may peace be upon him) and a camel-driver had been driving (the camels) oil which they were riding. Thereupon Allah's Apostle (may peace be upon him) said:                      Anjasha, drive slowly, for you are carrying (on the camels) vessels of glass.",
      "usc_msa_ref": "",
      "chain": [
        "20472",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6273",
      "hadith_no": "6273",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثنا محمد، بن بشار حدثنا محمد بن أبي عدي، كلاهما عن هشام، ح وحدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي قالا، جميعا حدثنا قتادة، عن أنس، بهذه القصة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Qatada.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "30160",
        "20295",
        "20288",
        "11289",
        "11019"
      ]
    },
    {
      "id": "sahih-muslim-6307",
      "hadith_no": "6307",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا علي بن خشرم، أخبرنا عيسى يعني ابن يونس، ح وحدثنا عثمان بن، أبي شيبة حدثنا جرير، كلاهما عن سليمان التيمي، عن أنس، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20347",
        "30203",
        "11289"
      ]
    },
    {
      "id": "sahih-muslim-6308",
      "hadith_no": "6308",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن سفيان، عن سليمان، التيمي سمعت أنسا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ مررت على موسى وهو يصلي في قبره ‏\"‏ ‏.‏ وزاد في حديث عيسى ‏\"‏ مررت ليلة أسري بي ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      I happened to pass by Moses as he was busy in saying prayer in his grave, and in the hadith transmitted on the authority of 'Isa there is an addition of these words:, I happened to pass on the occasion of the Night journey.\" In the hadith pertaining to Yunus (peace be upon him) the words of the Holy Prophet (may peace be upon him) are:\" It is not meet for a, servant that he should say:\" I am better than Yunus (jonah) son of Matta.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20337",
        "20012",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6314",
      "hadith_no": "6314",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن عبد الأعلى القيسي، حدثنا المعتمر بن سليمان التيمي، عن أبيه، عن رقبة، عن أبي إسحاق، عن سعيد بن جبير، قال قيل لابن عباس إن نوفا يزعم أن موسى الذي ذهب يلتمس العلم ليس بموسى بني إسرائيل ‏.‏ قال أسمعته يا سعيد قلت نعم ‏.‏ قال كذب نوف ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11049",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-6395",
      "hadith_no": "6395",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، وحامد بن عمر البكراوي، ومحمد بن عبد الأعلى، قالوا حدثنا المعتمر، - وهو ابن سليمان - قال سمعت أبي، عن أبي عثمان، قال لم يبق مع رسول الله صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد ‏.‏ عن حديثهما ‏.‏",
      "text_en": " Abu 'Uthman reported on one of the days when Allah's Messenger (may peace be upon him) was fighting and none remained with him save Talha and Sa'd.",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "30128",
        "30449",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-6469",
      "hadith_no": "6469",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عبد الأعلى بن حماد، ومحمد بن عبد الأعلى القيسي، كلاهما عن المعتمر، - قال ابن حماد حدثنا معتمر بن سليمان، - قال سمعت أبي، حدثنا أبو عثمان، عن سلمان، قال لا تكونن إن استطعت أول من يدخل السوق ولا آخر من يخرج منها فإنها معركة الشيطان وبها ينصب رايته ‏.‏ قال وأنبئت أن جبريل عليه السلام أتى نبي الله صلى الله عليه وسلم وعنده أم سلمة - قال - فجعل يتحدث ثم قام فقال نبي الله صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏ ‏.‏ أو كما قال قالت هذا دحية - قال - فقالت أم سلمة ايم الله ما حسبته إلا إياه حتى سمعت خطبة نبي الله صلى الله عليه وسلم يخبر خبرنا أو كما قال قال فقلت لأبي عثمان ممن سمعت هذا قال من أسامة بن زيد ‏.‏",
      "text_en": " Salman reported:                      In case it lies in your power don't be one to enter the bazar first and the last to get out of that because there is a bustle and the standard of Satan is set there. He said: I was informed that Gabriel (Allah be pleased with him) came to Allah's Apostle (may peace be upon him) and there was with him Umin Salama and he began to talk with him. He then stood up, whereupon Allah's Apostle (may peace be upon him) said to Umm Salama: (Do you know) who was he and what did he say? She said: He was Dihya (Kalbi). He reported Umm Salama having said: By Allah, I did not deem him but only he (Dihya) until I heard the address of Allah's Apostle (may peace be upon him) informing him about us. He (the narrator) said: I said to Uthman: From whom did you hear it? He said: From Usima b. Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "30146",
        "20288",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-6534",
      "hadith_no": "6534",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا حجاج بن الشاعر، حدثنا عارم بن الفضل، حدثنا معتمر بن سليمان، قال سمعت أبي يحدث، عن أنس بن مالك، قال أسر إلى نبي الله صلى الله عليه وسلم سرا فما أخبرت به أحدا بعد ‏.‏ ولقد سألتني عنه أم سليم فما أخبرتها به ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) told me something secretly. I informed none about that and Umm Sulaim asked me about it, but I did not tell her even.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20283",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6646",
      "hadith_no": "6646",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني يحيى بن حبيب، ومحمد بن عبد الأعلى، كلاهما عن المعتمر، قال ابن حبيب حدثنا معتمر بن سليمان، قال سمعت أبي، حدثنا أبو نضرة، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم أنه قال ذلك قبل موته بشهر أو نحو ذلك ‏\"‏ ما من نفس منفوسة اليوم تأتي عليها مائة سنة وهى حية يومئذ ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported Allah's Apostle (may peace be upon him) as saying one mouth before his death (or something like it):                      None amongst the created beings who had been living by that time (during the lifetime of Allah's Apostle).... 'Abd al-Rahman has interpreted these words of Allah's Apostle (may peace be upon him) as: The ages (of the people) would be diminished.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6771",
      "hadith_no": "6771",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كامل الجحدري، فضيل بن حسين حدثنا يزيد، - يعني ابن زريع - حدثنا التيمي، عن أبي عثمان، عن أبي برزة الأسلمي، قال بينما جارية على ناقة عليها بعض متاع القوم إذ بصرت بالنبي صلى الله عليه وسلم وتضايق بهم الجبل فقالت حل اللهم العنها ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ لا تصاحبنا ناقة عليها لعنة ‏\"‏ ‏.‏",
      "text_en": " Abu Burza al-Aslami reported that a slave-girl was riding a dromedary and there was also the luggage of people upon it. that she suddenly saw Allah's Apostle (may peace be upon him). The way of the mountain was narrow and she said (to that dromedary):                      Go ahead (but that dromedary did not move). She (that slave-girl), out of anger, said: O Allah, let that (dromedary) be damned. Thereupon Allah's Apostle (may peace be upon him) said: Let the dromedary on which the curse has been invoked not proceed with us.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20304",
        "11289",
        "11113",
        "227"
      ]
    },
    {
      "id": "sahih-muslim-6847",
      "hadith_no": "6847",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سويد بن سعيد، عن معتمر بن سليمان، عن أبيه، حدثنا أبو عمران الجوني، عن جندب، أن رسول الله صلى الله عليه وسلم حدث ‏\"‏ أن رجلا قال والله لا يغفر الله لفلان وإن الله تعالى قال من ذا الذي يتألى على أن لا أغفر لفلان فإني قد غفرت لفلان وأحبطت عملك ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " Jundub reported that Allah's Messenger (may peace be upon him) stated that a person said:                      Allah would not forgive such and such (person). Thereupon Allah the Exalted and Glorious, said: Who is he who adjures about Me that I would not grant pardon to so and so; I have granted pardon to so and so and blotted out his deeds (who took an oath that I would not grant pardon to him).",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20288",
        "11289",
        "11296",
        "4053"
      ]
    },
    {
      "id": "sahih-muslim-6870",
      "hadith_no": "6870",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سويد بن سعيد، ومحمد بن عبد الأعلى، - وتقاربا في اللفظ - قالا حدثنا  المعتمر، عن أبيه، عن أبي السليل، عن أبي حسان، قال قلت لأبي هريرة إنه قد مات لي ابنان فما أنت محدثي عن رسول الله صلى الله عليه وسلم بحديث تطيب به أنفسنا عن موتانا قال قال نعم ‏\"‏ صغارهم دعاميص الجنة يتلقى أحدهم أباه - أو قال أبويه - فيأخذ بثوبه - أو قال بيده - كما آخذ أنا بصنفة ثوبك هذا فلا يتناهى - أو قال فلا ينتهي - حتى يدخله الله وأباه الجنة ‏\"‏ ‏.‏ وفي رواية سويد قال حدثنا أبو السليل وحدثنيه عبيد الله بن سعيد حدثنا يحيى - يعني ابن سعيد - عن التيمي بهذا الإسناد وقال فهل سمعت من رسول الله صلى الله عليه وسلم شيئا تطيب به أنفسنا عن موتانا قال نعم ‏.‏",
      "text_en": " Abu Hassan reported:                      I said to Abu Huraira that my two children had died. Would you narrate to me anything from Allah's Messenger (may peace be upon him) a hadith which would soothe our hearts in our bereavements? He said: Yes. Small children are the fowls of Paradise. If one of them meets his father (or he said his parents) he would take hold of his cloth, or he said with his hand as I take hold of the hem of your cloth (with my hand). And he (the child) would not take off (his hand) from it until Allah causes his father to enter Paradise. This hadith has been narrated on the authority of Tamim with the same chain of transmitters. And he is reported to have said: Did you hear from Allah's Messenger (may peace be upon him) anything which may soothe our heart in our bereavements? He said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20288",
        "11289"
      ]
    },
    {
      "id": "sahih-muslim-6937",
      "hadith_no": "6937",
      "source": "Sahih Muslim",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا معتمر بن سليمان، عن أبيه، عن رقبة، بن مسقلة عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الغلام الذي قتله الخضر طبع كافرا ولو عاش لأرهق أبويه طغيانا وكفرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that AUah's Messenger (may peace be upon him) said:                      The young man whom Khadir killed was a non-believer by his very nature and had he survived he would have involved his parents in defiance and unbelief.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20288",
        "11289",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "id": "sahih-muslim-7006",
      "hadith_no": "7006",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار بن عثمان العبدي، حدثنا يحيى، - يعني ابن سعيد - وابن أبي عدي عن سليمان، - وهو التيمي - عن أنس بن مالك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل إذا تقرب عبدي مني شبرا تقربت منه ذراعا وإذا تقرب مني ذراعا تقربت منه باعا - أو بوعا - وإذا أتاني يمشي أتيته هرولة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying that Allah, the Exalted and Glorious, said:                      When My servant draws close to Me by the span of a palm, I draw close to him by the cubit and when he draws close to Me by the cubit, I draw close to him by the space (covered) by two armspans, and when he comes to me walking, I go in a hurry towards him.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11289",
        "19",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7039",
      "hadith_no": "7039",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين حدثنا يزيد، - يعني ابن زريع - حدثنا التيمي، عن أبي عثمان، عن أبي موسى، أنهم كانوا مع رسول الله صلى الله عليه وسلم وهم يصعدون في ثنية - قال - فجعل رجل كلما علا ثنية نادى لا إله إلا الله والله أكبر - قال - فقال نبي الله صلى الله عليه وسلم ‏\"‏ إنكم لا تنادون أصم ولا غائبا ‏\"‏ ‏.‏ قال فقال ‏\"‏ يا أبا موسى - أو يا عبد الله بن قيس - ألا أدلك على كلمة من كنز الجنة ‏\"‏ ‏.‏ قلت ما هي يا رسول الله قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that he (and his other companions) were climbing upon the hillock along with Allah's Messenger (may peace be upon him) and when any person climbed up, he pronounced (loudly):                     \" There is no god but Allah, Allah is the Greatest.\" Thereupon Allah's Apostle (may peace be upon him) said: Verily, you are not supplicating One Who is deaf or absent. He said: Abu Musa or Abdullah b Qais, should I not direct you to the words (which form) the treasure of Paradise? I said: Allah's Messenger, what are these? He said:\" There is no might and no power but that of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20304",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-7040",
      "hadith_no": "7040",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثناه محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، حدثنا أبو عثمان، عن  أبي موسى، قال بينما رسول الله صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Musa with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11113",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-7049",
      "hadith_no": "7049",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا أبو كامل، حدثنا يزيد بن زريع، ح وحدثنا محمد بن عبد الأعلى، حدثنا  معتمر، كلاهما عن التيمي، عن أنس، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أن يزيد ليس في حديثه قوله ‏\"‏ ومن فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " Anas reported from Allah's Messenger (may peace be upon him) (this suppli- cation) but with this variation that these words are not found in that supplication:                     \" From the trial of life and death.\"",
      "usc_msa_ref": "",
      "chain": [
        "20304",
        "30449",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7050",
      "hadith_no": "7050",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء أخبرنا ابن مبارك، عن سليمان التيمي، عن  أنس بن مالك، عن النبي صلى الله عليه وسلم أنه تعوذ من أشياء ذكرها والبخل ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) used to seek refuge in Allah from such things as mentioned in the above-mentioned hadith and from 'miserliness\" too.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7113",
      "hadith_no": "7113",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا هداب بن خالد، حدثنا حماد بن سلمة، ح وحدثني زهير بن حرب، حدثنا  معاذ بن معاذ العنبري، ح وحدثني محمد بن عبد الأعلى، حدثنا المعتمر، ح وحدثنا إسحاق، بن إبراهيم أخبرنا جرير، كلهم عن سليمان التيمي، ح وحدثنا أبو كامل، فضيل بن حسين - واللفظ له - حدثنا يزيد بن زريع، حدثنا التيمي، عن أبي عثمان، عن أسامة بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قمت على باب الجنة فإذا عامة من دخلها المساكين وإذا أصحاب الجد محبوسون إلا أصحاب النار فقد أمر بهم إلى النار وقمت على باب النار فإذا عامة من دخلها النساء ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid reported that Allah's Messenger (way peace be upon him) said:                      I stood at the door of Paradise and I found that the overwhelming majority of those who entered therein was that of poor persons and the wealthy persons were detained to get into that. The denizens of Hell were commanded to get into Hell, and I stood upon the door of Fire and the majority amongst them who entered there was that of women.",
      "usc_msa_ref": "",
      "chain": [
        "20021",
        "30022",
        "20286",
        "30449",
        "20288",
        "30123",
        "11289",
        "20304",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-7121",
      "hadith_no": "7121",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، ومعتمر بن سليمان، عن سليمان التيمي، عن أبي عثمان النهدي، عن أسامة بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تركت بعدي فتنة هي أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid reported Allah's Messenger (may peace be upon him) as saying:                      I have not left after me any (chance) of turmoil more injurious to men than the harm done to the men because of women.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-7122",
      "hadith_no": "7122",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وسويد بن سعيد، ومحمد بن عبد الأعلى، جميعا عن المعتمر، قال ابن معاذ حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، عن أسامة بن زيد بن حارثة، وسعيد بن زيد بن عمرو بن نفيل، أنهما حدثا عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ ما تركت بعدي في الناس فتنة أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid b. Harith and Sa'id b. Zaid b. 'Amr b. Naufal both reported Allah's Messenger (may peace be upon him) as saying:                      I have not left after me turmoil for the people but the harm done to men by women.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "30547",
        "20288",
        "20288",
        "11289",
        "11113",
        "50",
        "11"
      ]
    },
    {
      "id": "sahih-muslim-7151",
      "hadith_no": "7151",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني الحكم بن موسى، حدثنا معاذ بن معاذ، حدثنا سليمان التيمي، حدثنا أبو عثمان النهدي عن سلمان الفارسي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لله مائة رحمة فمنها رحمة بها يتراحم الخلق بينهم وتسعة وتسعون ليوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Salman Farisi reported Allah's Messenger (may peace be upon him) as saying:                      Verily, there are one hundred (parts of) mercy for Allah, and it is one part of this mercy by virtue of which there is mutual love between the people and ninety-nine reserved for the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20286",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sahih-muslim-7152",
      "hadith_no": "7152",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثناه محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Mu'tamir, reported on the authority of his father.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289"
      ]
    },
    {
      "id": "sahih-muslim-7161",
      "hadith_no": "7161",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا معتمر بن سليمان، قال قال لي أبي حدثنا قتادة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا شيبان، بن عبد الرحمن ح وحدثنا ابن المثنى، حدثنا أبو الوليد، حدثنا أبو عوانة، كلاهما عن قتادة، ذكروا جميعا بإسناد شعبة نحو حديثه وفي حديث شيبان وأبي عوانة ‏\"‏ أن رجلا من الناس رغسه الله مالا وولدا ‏\"‏ ‏.‏ وفي حديث التيمي ‏\"‏ فإنه لم يبتئر عند الله خيرا ‏\"‏ ‏.‏ قال فسرها قتادة لم يدخر عند الله خيرا ‏.‏ وفي حديث شيبان ‏\"‏ فإنه والله ما ابتأر عند الله خيرا ‏\"‏ ‏.‏ وفي حديث أبي عوانة ‏\"‏ ما امتأر ‏\"‏ ‏.‏ بالميم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the chain of transmitters but with a slight variation of wording and Qatada explained the word\" lam yasiru\" as:                     \" I find no good in store for rxie in the eye of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "30201",
        "20383",
        "20240",
        "20296"
      ]
    },
    {
      "id": "sahih-muslim-7177",
      "hadith_no": "7177",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو كامل فضيل بن حسين الجحدري كلاهما عن يزيد، بن زريع - واللفظ لأبي كامل - حدثنا يزيد، حدثنا التيمي، عن أبي عثمان، عن عبد الله، بن مسعود أن رجلا، أصاب من امرأة قبلة فأتى النبي صلى الله عليه وسلم فذكر له ذلك - قال - فنزلت ‏{‏ أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين‏}‏ قال فقال الرجل ألي هذه يا رسول الله قال ‏\"‏ لمن عمل بها من أمتي ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported that a person kissed a woman and he came to Allah's Apostle (may peace be upon him) and made a mention of that to him. It was (on this occasion) that this verse was revealed:                     \" And observe prayer at the (two) ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful\" (xi. 115). That person said: Allah's Messenger, does it concern me only? He (the Holy Prophet) said: It concerns every one of my Unimah, who acts according to it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20304",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7178",
      "hadith_no": "7178",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، حدثنا أبو عثمان، عن ابن، مسعود أن رجلا، أتى النبي صلى الله عليه وسلم فذكر أنه أصاب من امرأة إما قبلة أو مسا بيد أو شيئا كأنه يسأل عن كفارتها - قال - فأنزل الله عز وجل ‏.‏ ثم ذكر بمثل حديث يزيد ‏.‏",
      "text_en": " Ibn Mas'ud reported that a person came to Allah's Messenger (may peace be upon him) and told him that he had kissed a woman or touched her with his hand or did something like this. He inquired of him about its expiation. It was (on this occasion) that Allah, the Exalted and Glorious, revealed this verse (as mentioned above).",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7179",
      "hadith_no": "7179",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن سليمان التيمي، بهذا الإسناد قالأصاب رجل من امرأة شيئا دون الفاحشة فأتى عمر بن الخطاب فعظم عليه ثم أتى أبابكر فعظم عليه ثم أتى النبي صلى الله عليه وسلم فذكر بمثل حديث يزيد والمعتمر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters that a person had taken liberty with a woman less than fomication. He came to 'Umar b. Khattab and he took it to be a serious offence. Then he came to Abu Bakr and he also took it to be a serious offence. Then he came the Allahs Apostle (may peace be upon him) and he made a mention of this to him. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11289"
      ]
    },
    {
      "id": "sahih-muslim-7243",
      "hadith_no": "7243",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى القيسي، قالا حدثنا المعتمر، عن أبيه، حدثني نعيم بن أبي هند، عن أبي حازم، عن أبي هريرة، قال قال أبو جهل هل يعفر محمد وجهه بين أظهركم قال فقيل نعم ‏.‏ فقال واللات والعزى لئن رأيته يفعل ذلك لأطأن على رقبته أو لأعفرن وجهه في التراب - قال - فأتى رسول الله صلى الله عليه وسلم وهو يصلي زعم ليطأ على رقبته - قال - فما فجئهم منه إلا وهو ينكص على عقبيه ويتقي بيديه - قال - فقيل له ما لك فقال إن بيني وبينه لخندقا من نار وهولا وأجنحة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو دنا مني لاختطفته الملائكة عضوا عضوا ‏\"‏ ‏.‏ قال فأنزل الله عز وجل لا ندري في حديث أبي هريرة أو شىء بلغه ‏{‏ كلا إن الإنسان ليطغى * أن رآه استغنى * إن إلى ربك الرجعى * أرأيت الذي ينهى * عبدا إذا صلى * أرأيت إن كان على الهدى * أو أمر بالتقوى * أرأيت إن كذب وتولى‏}‏ - يعني أبا جهل - ‏{‏ ألم يعلم بأن الله يرى * كلا لئن لم ينته لنسفعا بالناصية * ناصية كاذبة خاطئة * فليدع ناديه * سندع الزبانية * كلا لا تطعه‏}‏ زاد عبيد الله في حديثه قال وأمره بما أمره به ‏.‏ وزاد ابن عبد الأعلى فليدع ناديه يعني قومه ‏.‏",
      "text_en": " Abu Huraira reported that Abu Jahl asked (people) whether Mubammad placed his face (on the ground) in their presence. It was said to him:                      Yes. He said: By Lit and Uzza. If I were to see him do that, I would trample his neck, or I would beamear his face with dust. He came to Allah's Messenger (may peace be upon him) as he was engaged in prayer and thought of trampling his neck (and the people say) that he came near him but turned upon his heels and tried to repulse something with his hands. It was said to him: What is the matter with you? He said: There is between me and him a ditch of fire and terror and wings. Thereupon Allah's Messenger (may peace he upon him) said: If he were to come near me the angels would have torn him to pieces. Then Allah, the Exalted and Glorious, revealed this verse- (the narrator) said: We do not whether it is the hadith transmitted te Abu Huraira or something conveyed to him from another source:\" Nay, man is surely inordinate, because he looks upon himself as self-sufficient. Surely to thy Lord is the return. Hast thou seen him who forbids a servant when he prays? Seest thou if he is on the right way, or enjoins observance of piety? Seest thou if he [Abu Jah]] denies and turns away? Knowest he not that Allah sees? Nay. if he desists not, We will seize him by the forelock-a lying, sinful forelock. Then let him summon his council. We will summon the guards of the Hell. Nay! Obey not thou him\" (Icvi. 6-19). (Rather prostrate thyself.) Ubaidullah made this addition: It was after this that (prostration) was enjoined upon and Ibn Abd al-Ala made this addition that by Nadia he meant his people.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20288",
        "11289",
        "10973",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7268",
      "hadith_no": "7268",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي، حدثنا قتادة، عن  أنس بن مالك، أنه حدث عن رسول الله صلى الله عليه وسلم ‏\"‏ إن الكافر إذا عمل حسنة أطعم بها طعمة من الدنيا وأما المؤمن فإن الله يدخر له حسناته في الآخرة ويعقبه رزقا في الدنيا على طاعته ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) thus told him:                      When a non-believer does good he is made to taste Its reward in this world. And so far as the believer is concerned, Allah stores (the reward) of his virtues for the Hereafter and provides him sustenance in accordance with his obedience to Him.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7531",
      "hadith_no": "7531",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن حبيب، ومحمد بن عبد الأعلى، قالا حدثنا معتمر، قال سمعت  أبي قال، حدثنا أبو نضرة، عن جابر بن عبد الله، قال لقي نبي الله صلى الله عليه وسلم ابن صائد ومعه أبو بكر وعمر وابن صائد مع الغلمان ‏.‏ فذكر نحو حديث الجريري ‏.‏",
      "text_en": " Jabir b 'Abdullah reported that Allah's Messenger (may peace be upon him) met Ibn Sa'id (Sayyad) and there were with him Abu Bakr and 'Umar and Ibn Sayyad was in the company of children. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-7533",
      "hadith_no": "7533",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن حبيب، ومحمد بن عبد الأعلى، قالا حدثنا معتمر، قال سمعت  أبي يحدث، عن أبي نضرة، عن أبي سعيد الخدري، قال قال لي ابن صائد وأخذتني منه ذمامة هذا عذرت الناس ما لي ولكم يا أصحاب محمد ألم يقل نبي الله صلى الله عليه وسلم ‏\"‏ إنه يهودي ‏\"‏ ‏.‏ وقد أسلمت ‏.‏ قال ‏\"‏ ولا يولد له ‏\"‏ ‏.‏ وقد ولد لي ‏.‏ وقال ‏\"‏ إن الله قد حرم عليه مكة ‏\"‏ ‏.‏ وقد حججت ‏.‏ قال فما زال حتى كاد أن يأخذ في قوله ‏.‏ قال فقال له أما والله إني لأعلم الآن حيث هو وأعرف أباه وأمه ‏.‏ قال وقيل له أيسرك أنك ذاك الرجل قال فقال لو عرض على ما كرهت ‏.‏",
      "text_en": " Abu Sa'id Khudri reported:                      Ibn Sa'id said to me somethhing for which I felt ashamed. He said: I can excuse others; but what has gone wrong with you, O Companions of Muhammad, that you take me as Dajjal? Has Allah's Apostle (may peace be upon him) not said that he would be a Jew whereas I am a Muslim and he also said that he would not have children, whereas I have children, and he also said: veryly, Allah has prohibited him to enter Mecca whereas I have performed Pilgrimage, atid. he went on saying this that I was about to be impressed by his tallk. He (however) said this also: I know where he (Dajjal) is and I know his father abd I mother, and it was said to him: Won't you feel pleased if you would be the same person? Thereupon he said: If this offer is made to me, I would noT resent that.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-7597",
      "hadith_no": "7597",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو غسان المسمعي، حدثنا معتمر، عن أبيه، عن معبد، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏ ‏.‏ قال وضم السبابة والوسطى ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      I and the Last Hour have been sent like this and (he while doing it) joined the forefinger with the middle finger.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7677",
      "hadith_no": "7677",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، حدثنا حفص، - وهو ابن غياث - عن سليمان، التيمي عن أنس بن مالك، قال عطس عند النبي صلى الله عليه وسلم رجلان فشمت أحدهما ولم يشمت الآخر فقال الذي لم يشمته عطس فلان فشمته وعطست أنا فلم تشمتني ‏.‏ قال ‏\"‏ إن هذا حمد الله وإنك لم تحمد الله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that two persons sneezed in the presence of Allah's Messenger (may peace be upon him). He (the Messenger of Allah) invoked mercy for one, and did not invoke for the other. The one for whom he had not prayed said:                      So and so sneezed and you said: May Allah have mercy upon you. I also sneezed but you did not utter these words for me. Thereupon he (the Holy Prophet) said: That person praised Allah, and you did not praise Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20317",
        "11289",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7678",
      "hadith_no": "7678",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو خالد، - يعني الأحمر - عن سليمان التيمي، عن  أنس، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-150",
      "hadith_no": "150",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى يعني ابن سعيد، ح حدثنا مسدد، حدثنا المعتمر، عن التيمي، حدثنا بكر، عن الحسن، عن ابن المغيرة بن شعبة، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم توضأ ومسح ناصيته ‏.‏ وذكر فوق العمامة - قال عن المعتمر - سمعت أبي يحدث عن بكر بن عبد الله عن الحسن عن ابن المغيرة بن شعبة عن المغيرة أن رسول الله صلى الله عليه وسلم كان يمسح على الخفين وعلى ناصيته وعلى عمامته ‏.‏ قال بكر وقد سمعته من ابن المغيرة ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah said:                      The Messenger of Allah (ﷺ) performed ablution and wiped his forelock and turban. Another version says : The Messenger of Allah (ﷺ) wiped his socks and his forelock and his turban. Bakr said: I heard it from Ibn al-Mughirah.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "30175",
        "20288",
        "11289",
        "11267",
        "11016",
        "11373",
        "166"
      ]
    },
    {
      "id": "sunan-abi-daud-557",
      "hadith_no": "557",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا سليمان التيمي، أن أبا عثمان، حدثه عن أبى بن كعب، قال كان رجل لا أعلم أحدا من الناس ممن يصلي القبلة من أهل المدينة أبعد منزلا من المسجد من ذلك الرجل وكان لا تخطئه صلاة في المسجد فقلت لو اشتريت حمارا تركبه في الرمضاء والظلمة ‏.‏ فقال ما أحب أن منزلي إلى جنب المسجد فنمي الحديث إلى رسول الله صلى الله عليه وسلم فسأله عن قوله ذلك فقال أردت يا رسول الله أن يكتب لي إقبالي إلى المسجد ورجوعي إلى أهلي إذا رجعت ‏.‏ فقال ‏\"‏ أعطاك الله ذلك كله أنطاك الله جل وعز ما احتسبت كله أجمع ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said:                      There was a certain person, out of all people of Medina, who used to pray in the mosque. I do not know that any one of them lived at a farther distance than that man. Still he never missed the prayer in congregation in the mosque. I said: it would be better if you buy a donkey and ride it in heat and darkness. He said: I do not like that my house be by the side of the mosque. The discourse reached the Messenger of Allah (ﷺ). He said him about it. He said: I did it so that my walking to the mosque and return to my home when I return be recorded. He said: Allah has granted all this to you; Allah has granted all that you reckoned.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11289",
        "11113",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-807",
      "hadith_no": "807",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا معتمر بن سليمان، ويزيد بن هارون، وهشيم، عن سليمان التيمي، عن أمية، عن أبي مجلز، عن ابن عمر، أن النبي صلى الله عليه وسلم سجد في صلاة الظهر ثم قام فركع فرأينا أنه قرأ تنزيل السجدة ‏.‏ قال ابن عيسى لم يذكر أمية أحد إلا معتمر ‏.‏",
      "text_en": " Ibn ‘Umr said:                      The prophet (ﷺ) prostrated himself in the noon prayer; then he stood up and bowed, and we knew that he recited Tanzil al-sajdah(surah xxxii).Ibn ‘Isa said: No one narrated this tradition to Umayyah except Mu’tamir.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20288",
        "20472",
        "20468",
        "11289",
        "11313",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-973",
      "hadith_no": "973",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عاصم بن النضر، حدثنا المعتمر، قال سمعت أبي، حدثنا قتادة، عن أبي غلاب، يحدثه عن حطان بن عبد الله الرقاشي، بهذا الحديث زاد ‏\"‏ فإذا قرأ فأنصتوا ‏\"‏ ‏.‏ وقال في التشهد بعد أشهد أن لا إله إلا الله زاد ‏\"‏ وحده لا شريك له ‏\"‏ ‏.‏ قال أبو داود وقوله ‏\"‏ فأنصتوا ‏\"‏ ‏.‏ ليس بمحفوظ لم يجئ به إلا سليمان التيمي في هذا الحديث ‏.‏",
      "text_en": " This tradition has also been transmitted by Hittan b. ‘Abd Allah al-Ruqashi through a different chain of narrators. This version adds:                      When he( the imam) recites the Qur’an, keep silence(and listen attentively). And in the tashahhud this version adds after the words “I testify that there is no god but Allah” the words “He is alone, and there is no associate of Him.”Abu Dawud said: His word \"And keep silence\" is not guarded; it has been narrated by Sulaiman al-Taimi alone in his version.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "10676"
      ]
    },
    {
      "id": "sunan-abi-daud-1408",
      "hadith_no": "1408",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي، حدثنا بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏ إذا السماء انشقت ‏}‏ فسجد فقلت ما هذه السجدة قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ‏.‏",
      "text_en": " Narrated Abu Rafi':                     I offered the night prayer behind Abu Hurairah. He recited Surah Inshiqaq (\"When the sky is rent asunder\") and prostrated himself. I asked him: What is this prostration ? He replied: I prostrated myself on account of this (surah) behind Abu al-Qasim (i.e. the Prophet). I shall continue prostrating on account of this till I meet him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-1527",
      "hadith_no": "1527",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا سليمان التيمي، عن أبي عثمان، عن أبي موسى الأشعري، أنهم كانوا مع النبي صلى الله عليه وسلم وهم يتصعدون في ثنية فجعل رجل كلما علا الثنية نادى لا إله إلا الله والله أكبر ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ إنكم لا تنادون أصم ولا غائبا ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا عبد الله بن قيس ‏\"‏ ‏.‏ فذكر معناه ‏.‏",
      "text_en": " Abu Musa Al-Ash'ari said:                      They (the Companions) accompanied the Prophet (ﷺ) while they were climbing the turning of a hill. A man uttered loudly: \"There is no god but Allah, and Allah is most great\" when he ascended the hill.\tThe Prophet of Allah (ﷺ) said: You are not supplicating one who is deaf or absent. He then said: 'Abd Allah b. Qais. The narrator then transmitted the tradition to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sunan-abi-daud-1540",
      "hadith_no": "1540",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، أخبرنا المعتمر، قال سمعت أبي قال، سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل والجبن والبخل والهرم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      \tThe Messenger of Allah (ﷺ) used to say: \"O Allah, I seek refuge in You from weakness, and laziness, and cowardice, and old age, and I seek refuge in You from the punishment of the grave, and I seek refuge in You from the trails of the life and death.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2347",
      "hadith_no": "2347",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن التيمي، ح وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا سليمان التيمي، عن أبي عثمان، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمنعن أحدكم أذان بلال من سحوره فإنه يؤذن - أو قال ينادي - ليرجع قائمكم وينتبه نائمكم وليس الفجر أن يقول هكذا ‏\"‏ ‏.‏ قال مسدد وجمع يحيى كفيه حتى يقول هكذا ومد يحيى بأصبعيه السبابتين ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Mas'ud:                     The Messenger of Allah (ﷺ) as saying: The summons (adhan) of Bilal should not restrain one of you from taking a meal shortly before dawn, for he utters adhan or calls (for prayer) so that the man at prayer may return, and the man asleep may get up. Dawn is not (the whiteness) which indicates thus (in perpendicular) - the narrator Musaddad said: Yahya joined his palms (indicating the spread of whiteness vertically - until it indicates thus - and Yahya spread out two ring-fingers of his (demonstrating the spread of whiteness horizontally)l",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11289",
        "30184",
        "20321",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-3121",
      "hadith_no": "3121",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن العلاء، ومحمد بن مكي المروزي، - المعنى - قالا حدثنا ابن المبارك، عن سليمان التيمي، عن أبي عثمان، - وليس بالنهدي - عن أبيه، عن معقل بن يسار، قال قال النبي صلى الله عليه وسلم ‏\"‏ اقرءوا ‏{‏ يس ‏}‏ على موتاكم ‏\"‏ ‏.‏ وهذا لفظ ابن العلاء ‏.‏",
      "text_en": " Narrated Ma'qil ibn Yasar:                     The Prophet (ﷺ) said: Recite Surah Ya-Sin over your dying men. This is the version of Ibn al-Ala'",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "11289",
        "3120"
      ]
    },
    {
      "id": "sunan-abi-daud-3813",
      "hadith_no": "3813",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن الفرج البغدادي، حدثنا ابن الزبرقان، حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن سلمان، قال سئل النبي صلى الله عليه وسلم عن الجراد فقال ‏\"‏ أكثر جنود الله لا آكله ولا أحرمه ‏\"‏ ‏.‏ قال أبو داود رواه المعتمر عن أبيه عن أبي عثمان عن النبي صلى الله عليه وسلم لم يذكر سلمان ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     The Messenger of Allah (ﷺ) was asked about (eating) locusts. He replied: They are the most numerous of Allah's hosts. I neither eat them nor declare them unlawful.",
      "usc_msa_ref": "",
      "chain": [
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-3972",
      "hadith_no": "3972",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا معتمر، قال سمعت أبي قال، سمعت أنس بن مالك، يقول قال النبي صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من البخل والهرم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Messenger of Allah (ﷺ) as saying:                      O Allah, I seek refuge in Thee from niggardliness and old age.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4276",
      "hadith_no": "4276",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن سليمان التيمي، عن أبي مجلز، في قوله ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم ‏}‏ قال هي جزاؤه فإن شاء الله أن يتجاوز عنه فعل ‏.‏",
      "text_en": " About the verse \"If a man kills a believer intentionally\" Abu Mijlaz said:                      This is his recompense. If Allah wishes to disregard him, He may do do.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "11289"
      ]
    },
    {
      "id": "sunan-abi-daud-4705",
      "hadith_no": "4705",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا القعنبي، حدثنا المعتمر، عن أبيه، عن رقبة بن مصقلة، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغلام الذي قتله الخضر طبع كافرا ولو عاش لأرهق أبويه طغيانا وكفرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said :                      The boy whom al-Khidr had killed was created an infidel. Had he lived, he would have moved his parents to rebellion and unbelief.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20288",
        "11289",
        "11626",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-4742",
      "hadith_no": "4742",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي قال، حدثنا أسلم، عن بشر بن شغاف، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ الصور قرن ينفخ فيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: The trumpet (sur) which will be blown.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "11289",
        "14036",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-4748",
      "hadith_no": "4748",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عاصم بن النضر، حدثنا المعتمر، قال سمعت أبي قال، حدثنا قتادة، عن أنس بن مالك، قال ‏:‏ لما عرج بنبي الله صلى الله عليه وسلم في الجنة - أو كما قال - عرض له نهر حافتاه الياقوت المجيب أو قال المجوف، فضرب الملك الذي معه يده فاستخرج مسكا فقال محمد صلى الله عليه وسلم للملك الذي معه ‏:‏ ‏\"‏ ما هذا ‏\"‏ ‏.‏ قال ‏:‏ هذا الكوثر الذي أعطاك الله عز وجل ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     When the Prophet of Allah (ﷺ) was lifted to the heavens (for travelling) in Paradise, or as he said, a river whose banks were of transparent or hollowed pearls was presented to him. The angel who was with him struck it with his hand and took out musk. Muhammad (ﷺ) then asked the angel who was with him: What is this? He replied: It is al-Kawthar which Allah has given you.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4959",
      "hadith_no": "4959",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا المعتمر، قال سمعت الركين، يحدث عن أبيه، عن سمرة، قال نهى رسول الله صلى الله عليه وسلم أن نسمي رقيقنا أربعة أسماء أفلح ويسارا ونافعا ورباحا ‏.‏",
      "text_en": " Samurah said:                      The Aposlte of Allah (May peace be upon him) forbade giving four names to our slaves : Aflah (successful), Yasar (wealth), Naf(beneficial) and Rabah (profit).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-5039",
      "hadith_no": "5039",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، ح وحدثنا محمد بن كثير، أخبرنا سفيان، - المعنى - قالا حدثنا سليمان التيمي، عن أنس، قال عطس رجلان عند النبي صلى الله عليه وسلم فشمت أحدهما وترك الآخر قال فقيل يا رسول الله رجلان عطسا فشمت أحدهما - قال أحمد أو فشمت أحدهما - وتركت الآخر ‏.‏ فقال ‏\"‏ إن هذا حمد الله وإن هذا لم يحمد الله ‏\"‏ ‏.‏",
      "text_en": " Anas said:                      Two men sneezed in the presence of the prophet (May peace be upon him). He said : Allah have mercy on you! To one and not to the other. He was asked: Messenger of Allah! Two persons sneezed. Ahmad’s version has: You invoked a blessing on one of them and left the other. He replied : This man praised Allah, and this man did not praise Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "28531",
        "11289",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-63",
      "hadith_no": "63",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن غيلان، قال حدثنا وكيع، عن سفيان، عن سليمان التيمي، عن أبي حاجب، عن رجل، من بني غفار قال نهى رسول الله صلى الله عليه وسلم عن فضل طهور المرأة ‏.‏ قال وفي الباب عن عبد الله بن سرجس ‏.‏ قال أبو عيسى وكره بعض الفقهاء الوضوء بفضل طهور المرأة ‏.‏ وهو قول أحمد وإسحاق كرها فضل طهورها ولم يريا بفضل سؤرها بأسا ‏.‏",
      "text_en": " Abu Hajib narrated from a man from Banu Ghifar who said:                     \"The Prophet prohibited using the leftover (water) of a woman's Purification.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11289"
      ]
    },
    {
      "id": "jami-al-tirmidhi-73",
      "hadith_no": "73",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الفضل بن سهل الأعرج البغدادي، حدثنا يحيى بن غيلان، قال حدثنا يزيد بن زريع، حدثنا سليمان التيمي، عن أنس بن مالك، قال إنما سمل النبي صلى الله عليه وسلم أعينهم لأنهم سملوا أعين الرعاة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعلم أحدا ذكره غير هذا الشيخ عن يزيد بن زريع ‏.‏ وهو معنى قوله ‏:‏ ‏(‏ والجروح قصاص ‏)‏ ‏.‏ وقد روي عن محمد بن سيرين قال إنما فعل بهم النبي صلى الله عليه وسلم هذا قبل أن تنزل الحدود ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"Allah's Messenger only poked out their eyes because they had poked out the eyes of the camel driver.\" Abu 'Eisa said: This Hadfth is Gharib. We do not know anyone who mentioned it other than this shaikh, from Yazid bin Zurai. And it is in accordance with the meaning of Allah's saying: \"And wounds equal for equal\"It has been reported that Muhammad bin Sirin said: \"The Prophet only did this to them before the legislated punishments were revealed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "30527",
        "20304",
        "11289",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-100",
      "hadith_no": "100",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، عن سليمان التيمي، عن بكر بن عبد الله المزني، عن الحسن، عن ابن المغيرة بن شعبة، عن أبيه، قال توضأ النبي صلى الله عليه وسلم ومسح على الخفين والعمامة ‏.‏ قال بكر وقد سمعت من ابن المغيرة ‏.‏ قال وذكر محمد بن بشار في هذا الحديث في موضع آخر أنه مسح على ناصيته وعمامته ‏.‏ وقد روي هذا الحديث من غير وجه عن المغيرة بن شعبة ذكر بعضهم المسح على الناصية والعمامة ولم يذكر بعضهم الناصية ‏.‏ وسمعت أحمد بن الحسن يقول سمعت أحمد بن حنبل يقول ما رأيت بعيني مثل يحيى بن سعيد القطان ‏.‏ قال وفي الباب عن عمرو بن أمية وسلمان وثوبان وأبي أمامة ‏.‏ قال أبو عيسى حديث المغيرة بن شعبة حديث حسن صحيح ‏.‏ وهو قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وأنس ‏.‏ وبه يقول الأوزاعي وأحمد وإسحاق قالوا يمسح على العمامة ‏.‏ وقال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين لا يمسح على العمامة إلا أن يمسح برأسه مع العمامة ‏.‏ وهو قول سفيان الثوري ومالك بن أنس وابن المبارك والشافعي ‏.‏ قال أبو عيسى وسمعت الجارود بن معاذ يقول سمعت وكيع بن الجراح يقول إن مسح على العمامة يجزئه للأثر ‏.‏",
      "text_en": " Ibn Al-Mughirah bin Shu'bah narrated from his father:                     \"The Prophet performed Wudu and wiped over the Khuff and 'Imamah.\" Abu Bakr (one of the narrators) said: \"And indeed I heard it from Ibn Al Mughirah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11289",
        "11267",
        "11016",
        "4140"
      ]
    },
    {
      "id": "jami-al-tirmidhi-188",
      "hadith_no": "188",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من جمع بين الصلاتين من غير عذر فقد أتى بابا من أبواب الكبائر ‏\"‏ ‏.‏ قال أبو عيسى وحنش هذا هو أبو علي الرحبي وهو حسين بن قيس وهو ضعيف عند أهل الحديث ضعفه أحمد وغيره ‏.‏ والعمل على هذا عند أهل العلم أن لا يجمع بين الصلاتين إلا في السفر أو بعرفة ‏.‏ ورخص بعض أهل العلم من التابعين في الجمع بين الصلاتين للمريض وبه يقول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم يجمع بين الصلاتين في المطر وبه يقول الشافعي وأحمد وإسحاق ‏.‏ ولم ير الشافعي للمريض أن يجمع بين الصلاتين ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"Whoever combines two prayers without any excuse then he has committed something from the major sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1066",
      "hadith_no": "1066",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن مقدام أبو الأشعث العجلي، حدثنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن قتادة، عن أنس، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ وفي الباب عن أبي موسى وأبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث عبادة بن الصامت حديث حسن صحيح ‏.‏",
      "text_en": " Ubadah bin As-Samit narrated that:                     The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1220-2",
      "hadith_no": "1220",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، حدثنا ابن المبارك، أخبرنا سليمان التيمي، عن أبي عثمان، عن ابن مسعود، عن النبي صلى الله عليه وسلم أنه نهى عن تلقي البيوع ‏.‏ قال وفي الباب عن علي وابن عباس وأبي هريرة وأبي سعيد وابن عمر ورجل من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     From the Prophet (ﷺ): \"He prohibited meeting the owners of the goods.\"[He said:] There are narrations on this topic from 'Ali, Ibn 'Abbas, Abu Hurairah, Abu Sa'eed, Ibn 'Umar, and a man from the Companions of the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1553",
      "hadith_no": "1553",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبيد المحاربي الكوفي، حدثنا أسباط بن محمد، عن سليمان التيمي، عن سيار، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله فضلني على الأنبياء أو قال أمتي على الأمم وأحل لنا الغنائم ‏\"‏ ‏.‏ وفي الباب عن علي وأبي ذر وعبد الله بن عمرو وأبي موسى وابن عباس ‏.‏ قال أبو عيسى حديث أبي أمامة حديث حسن صحيح ‏.‏ وسيار هذا يقال له سيار مولى بني معاوية ‏.‏ وروى عنه سليمان التيمي وعبد الله بن بحير وغير واحد ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20408",
        "11289",
        "11429",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1670",
      "hadith_no": "1670",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي إسحاق، عن البراء بن عازب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ائتوني بالكتف أو اللوح ‏\"‏ ‏.‏ فكتب ‏:‏ ‏(‏ لا يستوي القاعدون من المؤمنين ‏)‏ وعمرو بن أم مكتوم خلف ظهره فقال هل لي من رخصة فنزلت ‏:‏ ‏(‏ غير أولي الضرر ‏)‏ ‏.‏ وفي الباب عن ابن عباس وجابر وزيد بن ثابت ‏.‏ وهذا حديث حسن صحيح وهو حديث غريب من حديث سليمان التيمي عن أبي إسحاق ‏.‏ وقد روى شعبة والثوري عن أبي إسحاق هذا الحديث ‏.",
      "text_en": " Narrated Al-Bara' bin 'Azib:                     That the Messenger of Allah (ﷺ) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith is Hasan Sahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20288",
        "11289",
        "11049",
        "400"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1726",
      "hadith_no": "1726",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا سيف بن هارون البرجمي، عن سليمان التيمي، عن أبي عثمان، عن سلمان، قال سئل رسول الله صلى الله عليه وسلم عن السمن والجبن والفراء ‏.‏ فقال ‏\"‏ الحلال ما أحل الله في كتابه والحرام ما حرم الله في كتابه وما سكت عنه فهو مما عفا عنه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن المغيرة ‏.‏ وهذا حديث غريب لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ وروى سفيان وغيره عن سليمان التيمي عن أبي عثمان عن سلمان قوله وكأن الحديث الموقوف أصح ‏.‏ وسألت البخاري عن هذا الحديث فقال ما أراه محفوظا روى سفيان عن سليمان التيمي عن أبي عثمان عن سلمان موقوفا ‏.‏ قال البخاري وسيف بن هارون مقارب الحديث وسيف بن محمد عن عاصم ذاهب الحديث ‏.‏",
      "text_en": " Narrated Salman:                     \"The Messenger of Allah (ﷺ) was asked about fat, cheese, and furs, so he said: 'The lawful is what Allah made lawful in His Book, the unlawful is what Allah made unlawful in his Book, and what He was silent about; then it is among that for which He has pardoned.'\"[Abu 'Eisa said:] There is something on this topic from Al-Mughirah, and this Hadith is Gharib, we do not know of it being Marfu' except from this route. Sufyan and others reported it from Sulaiman At-Taimi, from Abu 'Uthman, from Salman as his own saying. It is as if the Mawquf narration is more correct. I asked Al-Bukhari about this Hadith and he said: 'I do not think it is preserved. Sufyan reported it from Sulaiman At-Taimi from Abu 'Uthman, from Salman in Mawquf form.' Al-Bukhari said: \"Saif bin Harun is Muqarib (Average) in Hadith, and as for Saif bin Muhammad from 'Asim, his narrations are left.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1867",
      "hadith_no": "1867",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا ابن علية، ويزيد بن هارون، قالا أخبرنا سليمان التيمي، عن طاوس، أن رجلا، أتى ابن عمر فقال نهى رسول الله صلى الله عليه وسلم عن نبيذ الجر فقال نعم ‏.‏ فقال طاوس والله إني سمعته منه ‏.‏ قال وفي الباب عن ابن أبي أوفى وأبي سعيد وسويد وعائشة وابن الزبير وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sulaiman At-Taimi:                     From Tawus, that a man came to Ibn 'Umar and said: \"Did the Messenger of Allah (ﷺ) prohibit Nabidh prepared in eartherware vessels?\" He said: \"Yes\" So Tawus said: \"I heard that from him, by Allah.\"He said: There are narrations on this topic from Ibn Abu Awfa, Abu Sa'eed, Suwaid, 'Aishah, Ibn Az-Zubair, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20208",
        "20472",
        "11289",
        "11053"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1877",
      "hadith_no": "1877",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا جرير، عن سليمان التيمي، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم نهى عن البسر والتمر أن يخلط بينهما ونهى عن الزبيب والتمر أن يخلط بينهما ونهى عن الجرار أن ينبذ فيها ‏.‏ قال وفي الباب عن جابر وأنس وأبي قتادة وابن عباس وأم سلمة ومعبد بن كعب عن أمه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     \"The Prophet (ﷺ) prohibited mixing of unripe dates and dates, and mixing of raisins and dates (for making Nabidh), and he prohibited the jars that Nabidh is made in.\"He said: There are narrations on this topic from Anas, Jabir, Abu Qatadah, Ibn 'Abbas, Umm Salamah, and Ma'bad bin Ka'b from his mother.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20028",
        "11289",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2041",
      "hadith_no": "2041",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن حنش، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ من قبض يتيما بين المسلمين إلى طعامه وشرابه أدخله الله الجنة البتة إلا أن يعمل ذنبا لا يغفر له ‏\"‏ ‏.‏ قال وفي الباب عن مرة الفهري وأبي هريرة وأبي أمامة وسهل بن سعد ‏.‏ قال أبو عيسى وحنش هو حسين بن قيس وهو أبو علي الرحبي وسليمان التيمي يقول حنش وهو ضعيف عند أهل الحديث ‏.‏",
      "text_en": " Ibn 'Abbas narrated that:                     the Prophet said: Whoever takes in an orphan among the Muslims to raise, to feed him and give him drink, Allah admits him into Paradise without a doubt, unless he has done a sin for which he is not forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "38240",
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2167",
      "hadith_no": "2167",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا الحسين بن الحسن المروزي، بمكة وإبراهيم بن سعيد الجوهري قالا حدثنا الأحوص بن جواب، عن سعير بن الخمس، عن سليمان التيمي، عن أبي عثمان النهدي، عن أسامة بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صنع إليه معروف فقال لفاعله جزاك الله خيرا فقد أبلغ في الثناء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن جيد غريب لا نعرفه من حديث أسامة بن زيد إلا من هذا الوجه ‏.‏ وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم بمثله وسألت محمدا فلم يعرفه ‏.‏ حدثني عبد الرحيم بن حازم البلخي قال سمعت المكي بن إبراهيم يقول كنا عند ابن جريج المكي فجاء سائل فسأله فقال ابن جريج لخازنه أعطه دينارا ‏.‏ فقال ما عندي إلا دينار إن أعطيته لجعت وعيالك ‏.‏ قال فغضب وقال أعطه ‏.‏ قال المكي فنحن عند ابن جريج إذ جاءه رجل بكتاب وصرة وقد بعث إليه بعض إخوانه وفي الكتاب إني قد بعثت خمسين دينارا ‏.‏ قال فحل ابن جريج الصرة فعدها فإذا هي أحد وخمسون دينارا ‏.‏ قال فقال ابن جريج لخازنه قد أعطيت واحدا فرده الله عليك وزادك خمسين دينارا ‏.‏ تم كتاب البر والصلة ويليه كتاب الطب",
      "text_en": " Usamah bin Zaid narrated that the Messenger of Allah (s.a.w) said:                     \"Whoever some good was done to him, and he says: 'May Allah reward you in goodness' then he has done the most that he can of praise.\"",
      "usc_msa_ref": "",
      "chain": [
        "20654",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2281",
      "hadith_no": "2281",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا المعتمر بن سليمان، حدثنا أبي، عن سليمان الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ احتج آدم وموسى فقال موسى يا آدم أنت الذي خلقك الله بيده ونفخ فيك من روحه أغويت الناس وأخرجتهم من الجنة ‏.‏ قال فقال آدم وأنت موسى الذي اصطفاك الله بكلامه أتلومني على عمل عملته كتبه الله على قبل أن يخلق السموات والأرض قال فحج آدم موسى ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وجندب ‏.‏ وهذا حديث حسن صحيح غريب من هذا الوجه من حديث سليمان التيمي عن الأعمش ‏.‏ وقد روى بعض أصحاب الأعمش عن الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقال بعضهم عن الأعمش عن أبي صالح عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(S.A.W) said:                     \"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20288",
        "11289",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2289",
      "hadith_no": "2289",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن حميد الرازي، وسعيد بن يعقوب، قالا حدثنا يحيى بن الضريس، عن أبي مودود، عن سليمان التيمي، عن أبي عثمان النهدي، عن سلمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرد القضاء إلا الدعاء ولا يزيد في العمر إلا البر ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي أسيد ‏.‏ وهذا حديث حسن غريب من حديث سلمان لا نعرفه إلا من حديث يحيى بن الضريس ‏.‏ وأبو مودود اثنان أحدهما يقال له فضة وهو الذي روى هذا الحديث اسمه فضة بصري والآخر عبد العزيز بن أبي سليمان أحدهما بصري والآخر مدني وكانا في عصر واحد ‏.‏",
      "text_en": " 'Salman narrated that the Messenger of Allah (s.a.w) said:                     \"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20678",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2617",
      "hadith_no": "2617",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا سليمان التيمي، عن أسلم العجلي، عن بشر بن شغاف، عن عبد الله بن عمرو بن العاصي، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال ما الصور قال ‏\"‏ قرن ينفخ فيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى غير واحد عن سليمان التيمي ولا نعرفه إلا من حديثه ‏.‏",
      "text_en": " \"'Abdullah bin 'Amr bin Al-'As said:                      \"A Bedouin came to the Prophet (S.a.w) and said:'What is the Sur?' He said: 'A horn that will be blown into'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11289",
        "14008",
        "14036"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2963",
      "hadith_no": "2963",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن سليمان التيمي، عن أنس بن مالك، أن رجلين، عطسا عند النبي صلى الله عليه وسلم فشمت أحدهما ولم يشمت الآخر فقال الذي لم يشمته يا رسول الله شمت هذا ولم تشمتني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنه حمد الله وإنك لم تحمد الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11289",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2993",
      "hadith_no": "2993",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي، حدثنا أبي، حدثنا سليمان التيمي، عن خداش، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استلقى أحدكم على ظهره فلا يضع إحدى رجليه على الأخرى ‏\"‏ ‏.‏ هذا حديث رواه غير واحد عن سليمان التيمي ‏.‏ ولا يعرف خداش هذا من هو وقد روى له سليمان التيمي غير حديث ‏.‏",
      "text_en": " Narrated Jabir:                     \"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"",
      "usc_msa_ref": "",
      "chain": [
        "11289",
        "11263",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3007",
      "hadith_no": "3007",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن أسامة بن زيد، وسعيد بن زيد بن عمرو بن نفيل، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما تركت بعدي في الناس فتنة أضر على الرجال من النساء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى هذا الحديث غير واحد من الثقات عن سليمان التيمي عن أبي عثمان عن أسامة بن زيد عن النبي صلى الله عليه وسلم ولم يذكروا فيه عن سعيد بن زيد بن عمرو بن نفيل ولا نعلم أحدا قال عن أسامة بن زيد وسعيد بن زيد غير المعتمر ‏.‏ وفي الباب عن أبي سعيد ‏.‏",
      "text_en": " Narrated Usamah bin Zaid, and Sa'eed bin Zaid bin 'Amr bin Nufail:                     that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11113",
        "50",
        "11"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3008",
      "hadith_no": "3008",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن سليمان التيمي، عن أبي عثمان، عن أسامة بن زيد، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3186",
      "hadith_no": "3186",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا المعتمر بن سليمان، عن أبيه، عن سليمان الأعمش، عن عطية، عن أبي سعيد، قال لما كان يوم بدر ظهرت الروم على فارس فأعجب ذلك المؤمنين فنزلت ‏(‏ الم * غلبت الروم ‏)‏ إلى قوله ‏(‏يفرح المؤمنون ‏)‏ قال يفرح المؤمنون بظهور الروم على فارس ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ ويقرأ غلبت وغلبت يقول كانت غلبت ثم غلبت هكذا قرأ نصر بن علي غلبت ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     \"On the Day of (the battle of) Badr, the Romans had a victory over the Persians. So the believers were pleased with that, then the following was revealed: Alif Lam Mim. The Romans have been defeated...\" up to His saying: '...the believers will rejoice. (30:1-4)\" He said: \"So the believers were happy with the victory of the Romans over the Persians.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20288",
        "11289",
        "11060",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3402",
      "hadith_no": "3402",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سليمان التيمي، عن أبي عثمان، عن ابن مسعود، أن رجلا، أصاب من امرأة قبلة حرام فأتى النبي صلى الله عليه وسلم فسأله عن كفارتها فنزلت ‏:‏ ‏(‏ أقم الصلاة طرفي النهار وزلفا من الليل إن الحسنات يذهبن السيئات ‏)‏ فقال الرجل ألي هذه يا رسول الله فقال ‏\"‏ لك ولمن عمل بها من أمتي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that a man unlawfully kissed a woman. So he came to the Prophet (ﷺ) to ask him about its atonement. So (the following) Ayah was revealed: And perform the Salat, at the two ends of the day and in some hours of the night (11:114). The man said: \"Is this for me O Messenger of Allah?\" He said: \"For you and for whoever does that among my Ummah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3496",
      "hadith_no": "3496",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا المعتمر بن سليمان، عن أبيه، عن سليمان الأعمش، عن عطية، عن أبي سعيد، قال لما كان يوم بدر ظهرت الروم على فارس فأعجب ذلك المؤمنين فنزلت ‏:‏ ‏(‏ الم *غلبت الروم ‏)‏ إلى قوله ‏:‏ ‏(‏يفرح المؤمنون بنصر الله ‏)‏ قال ففرح المؤمنون بظهور الروم على فارس ‏.‏ قال هذا حديث حسن غريب من هذا الوجه كذا قرأ نصر بن علي  ‏:‏ ‏(‏غلبت الروم ‏)‏ ‏.‏",
      "text_en": " Narrated 'Atiyyah:                     Abu Sa'eed narrated: \"On the Day of Badr, the Romans had a victory over the Persians. So the believers were pleased with that, then the following was revealed: 'Alif Lam Mim. The Romans have been defeated, up to His saying: 'the believers will rejoice - with the help of Allah... (30:1-5)'\" He said: \"So the believers were happy with the victory of the Romans over the Persians.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20288",
        "11289",
        "11060",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3552",
      "hadith_no": "3552",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، أخبرنا سليمان التيمي، عن أسلم العجلي، عن بشر بن شغاف، عن عبد الله بن عمرو، رضي الله عنهما قال قال أعرابي يا رسول الله ما الصور قال ‏\"‏ قرن ينفخ فيه ‏\"‏ ‏.‏ قال هذا حديث حسن إنما نعرفه من حديث سليمان التيمي ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr [may Allah be pleased with him]:                     \"A Bedouin said: 'O Messenger of Allah! What is As-Sur?' He said: 'A horn which is blown into.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20208",
        "11289",
        "14008",
        "14036"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3985",
      "hadith_no": "3985",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يزيد بن هارون، حدثنا سليمان التيمي، عن أبي العلاء، عن سمرة بن جندب، قال كنا مع رسول الله صلى الله عليه وسلم نتداول من قصعة من غدوة حتى الليل يقوم عشرة ويقعد عشرة ‏.‏ قلنا فما كانت تمد قال من أى شيء تعجب ما كانت تمد إلا من ها هنا وأشار بيده إلى السماء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو العلاء اسمه يزيد بن عبد الله بن الشخير ‏.‏",
      "text_en": " Narrated Abu Al-'Ala:                     from Samurah bin Jundab that he said: \"We were with the Prophet (ﷺ) and we would take turns (eating) from a bowl from the morning till the evening. Ten would stand and ten would sit.\" We said: \"So what was filling it up?' He said: \"What are you amazed at? It wasn't filled up from anywhere but here, and he pointed with his hand towards the sky.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20472",
        "11289",
        "394"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4237",
      "hadith_no": "4237",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أزهر السمان، عن سليمان التيمي، عن خداش، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليدخلن الجنة من بايع تحت الشجرة إلا صاحب الجمل الأحمر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Az-Zubair:                     from Jabir, that the Prophet (ﷺ) under the tree shall enter Paradise, except for the owner of the red camel.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20206",
        "11289",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-107",
      "hadith_no": "107",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثني يحيى بن سعيد، قال حدثنا سليمان التيمي، قال حدثنا بكر بن عبد الله المزني، عن الحسن، عن ابن المغيرة بن شعبة، عن المغيرة، أن رسول الله صلى الله عليه وسلم توضأ فمسح ناصيته وعمامته وعلى الخفين ‏.‏ قال بكر وقد سمعته من ابن المغيرة بن شعبة عن أبيه ‏.‏",
      "text_en": " It was narrated from Al-Mughirah that the Prophet (ﷺ) performed Wudu', and he wiped the forehead, the 'Imamah, and over the Khuff.(Another chain)",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11289",
        "11267",
        "11016",
        "166"
      ]
    },
    {
      "id": "sunan-an-nasai-648",
      "hadith_no": "648",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن ابن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن بلالا يؤذن بليل ليوقظ نائمكم وليرجع قائمكم وليس أن يقول هكذا ‏\"‏ ‏.‏ يعني في الصبح ‏.‏",
      "text_en": " It was narrated from Ibn Mas'ud that the Prophet (ﷺ) said:                      \"Bilal calls the Adhan during the night to wake those who are sleeping and so that those who are praying Qiyam can return.[1] Not to say it is like this.\" The break of dawn is not like this. [2][1] Meaning to finish. Ash-Shawkani said: \"To return to sleeping or return to sitting from praying\" Nail Al-Awtar.[2] Indicating with an up and down motion. The true dawn is from right to left.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-808",
      "hadith_no": "808",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عمر بن علي بن مقدم، قال حدثنا يوسف بن يعقوب، قال أخبرني التيمي، عن أبي مجلز، عن قيس بن عباد، قال بينا أنا في المسجد، في الصف المقدم فجبذني رجل من خلفي جبذة فنحاني وقام مقامي فوالله ما عقلت صلاتي فلما انصرف فإذا هو أبى بن كعب فقال يا فتى لا يسؤك الله إن هذا عهد من النبي صلى الله عليه وسلم إلينا أن نليه ثم استقبل القبلة فقال هلك أهل العقد ورب الكعبة ثلاثا ثم قال والله ما عليهم آسى ولكن آسى على من أضلوا ‏.‏ قلت يا أبا يعقوب ما يعني بأهل العقد قال الأمراء ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                      \"While I was in the Masjid in the first row, a man pulled me from behind and moved me aside, and took my place. By Allah, I could not focus on my prayer, then when he left I saw that it was Ubayy bin Ka'b. He said: '0 boy, may Allah protect you from harm. This is what the Prophet instructed us to do, to stand directly behind him.' Then he (Ubayy) turned to face the Qiblah and said: 'Doomed are Ah1 Al-'Uqd, by the Lord of the Ka'bah! - three times.'Then he said: 'By Allah, I am not sad for them, but I am sad for the people whom they have misled.' I said: '0 Abu Ya'qub, what do you mean by Ah1 Al-'Uqd?' He said: 'The rulers.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30582",
        "20305",
        "11289",
        "11313",
        "11609"
      ]
    },
    {
      "id": "sunan-an-nasai-948",
      "hadith_no": "948",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا سليمان التيمي، عن سيار، - يعني ابن سلامة - عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة بالستين إلى المائة ‏.‏",
      "text_en": " It was narrated from Abu Barzah that:                     The Messenger of Allah (ﷺ) used to recite between sixty and one hundred verses in Al-Ghadah (Subh) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-968",
      "hadith_no": "968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سليم، - وهو ابن أخضر - عن التيمي، قال حدثني بكر بن عبد الله المزني، عن أبي رافع، قال صليت خلف أبي هريرة صلاة العشاء - يعني العتمة - فقرأ سورة ‏{‏ إذا السماء انشقت ‏}‏ فسجد فيها فلما فرغ قلت يا أبا هريرة هذه - يعني سجدة - ما كنا نسجدها ‏.‏ قال سجد بها أبو القاسم صلى الله عليه وسلم وأنا خلفه فلا أزال أسجد بها حتى ألقى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Rafi' said:                     \"I prayed Isha' prayer- meaning Al-'Atamah behind Abu Hurairah and he recited: 'When the heaven is split asunder' and prostrated during it. When he had finished praying, I said: 'O Abu Hurairah, (this is) a prostration that we are not used to.' He said: 'Abu Al-Qasim (ﷺ) did this prostration and I was (praying) behind him, and I will continue to do this prostration until I meet Abu Al-Qasim.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20546",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-1070",
      "hadith_no": "1070",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن سليمان التيمي، عن أبي مجلز، عن أنس بن مالك، قال قنت رسول الله صلى الله عليه وسلم شهرا بعد الركوع يدعو على رعل وذكوان وعصية عصت الله ورسوله ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) prayed (saying the) Qunut after bowing for a month, supplicating against Ri'l, Dhakwan and 'Usayyah who had disobeyed Allah and His Messenger.\" (Sahih).",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1173",
      "hadith_no": "1173",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أبو الأشعث، أحمد بن المقدام العجلي البصري قال حدثنا المعتمر، قال سمعت أبي يحدث، عن قتادة، عن أبي غلاب، - وهو يونس بن جبير - عن حطان بن عبد الله، أنهم صلوا مع أبي موسى فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان عند القعدة فليكن من أول قول أحدكم التحيات لله الطيبات الصلوات لله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hittan bin Abdullah that:                     They prayed with Abu Musa and he said: \"The Messenger of Allah (ﷺ) said: 'When you are sitting then let the first words that any of you says be: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\"",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "11019"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-31",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، عن الزهري، عن السائب بن يزيد، قال كان بلال يؤذن إذا جلس رسول الله صلى الله عليه وسلم على المنبر يوم الجمعة فإذا نزل أقام ثم كان كذلك في زمن أبي بكر وعمر رضى الله عنهما ‏.‏",
      "text_en": " It was narrated that As-Sa'ib bin Yazid said:                     \"Bilal used to call the adhan when the Messenger of Allah (ﷺ) sat on the minbar on Friday, and when he came down he would say the Iqamah. It continued like that during the time of Abu Bakr and 'Umar, may Allah (SWT) be pleased with them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11013",
        "3048"
      ]
    },
    {
      "id": "sunan-an-nasai-1631",
      "hadith_no": "1631",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن علي بن حرب، قال حدثنا معاذ بن خالد، قال أنبأنا حماد بن سلمة، عن سليمان التيمي، عن ثابت، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال أتيت ليلة أسري بي على موسى عليه السلام عند الكثيب الأحمر وهو قائم يصلي في قبره ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     The Messenger of Allah (ﷺ) said: \"On the night on which I was taken on the Night Journey (Al-Isra') I came to Musa, peace be upon him, at the red dune, and he was standing, praying in his grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "38553",
        "20021",
        "11289",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1632",
      "hadith_no": "1632",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا العباس بن محمد، قال حدثنا يونس بن محمد، قال حدثنا حماد بن سلمة، عن سليمان التيمي، وثابت، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتيت على موسى عليه السلام عند الكثيب الأحمر وهو قائم يصلي ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا أولى بالصواب عندنا من حديث معاذ بن خالد والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from Anas that :                     The Messenger of Allah (ﷺ) said: \"I came to Musa at the red dune and he was standing and praying.\"",
      "usc_msa_ref": "",
      "chain": [
        "20393",
        "20021",
        "11289",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1633",
      "hadith_no": "1633",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا حبان، قال حدثنا حماد بن سلمة، قال أنبأنا ثابت، وسليمان التيمي، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ مررت على قبر موسى عليه السلام وهو يصلي في قبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet (ﷺ) said: \"I passed by the grave of Musa, peace be upon him, and he was praying in his grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20218",
        "20021",
        "11269",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1634",
      "hadith_no": "1634",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا علي بن خشرم، قال حدثنا عيسى، عن سليمان التيمي، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مررت ليلة أسري بي على موسى عليه السلام وهو يصلي في قبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) said: 'On the night on which I was taken on the Night Journey, I passed by Musa, peace be upon him, and he was praying in his grave.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20347",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1635",
      "hadith_no": "1635",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، عن أبيه، عن أنس، أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى عليه السلام وهو يصلي في قبره ‏.‏",
      "text_en": " It was narrated from Anas that:                     On the night on which he was taken on the Night Journey, the Prophet (ﷺ) passed by Musa, peace be upon him, and he was praying in his grave.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1636",
      "hadith_no": "1636",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، وإسماعيل بن مسعود، قالا حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، يقول أخبرني بعض، أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى عليه السلام وهو يصلي في قبره ‏.‏",
      "text_en": " Mu'tamir said:                     \"I heard my father say: I heard Anas say: 'One of the companions of the Prophet (ﷺ) told me that on the Night Journey, the Prophet (ﷺ) passed by Musa, peace be upon him, and he was praying in his grave.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "34033",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1837",
      "hadith_no": "1837",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا المعتمر، قال سمعت أبي يحدث، عن قتادة، عن أنس بن مالك، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The Messenger of Allah said: 'whoever loves to meet Allah, Allah loves to meet him, and whoever hates to meet Allah, Allah, hates to meet him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20288",
        "11289",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-1926",
      "hadith_no": "1926",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن ابن علية، عن سليمان التيمي، عن أبي مجلز، عن ابن عباس، والحسن بن علي، مرت بهما جنازة فقام أحدهما وقعد الآخر فقال الذي قام أما والله لقد علمت أن رسول الله صلى الله عليه وسلم قد قام قال له الذي جلس لقد علمت أن رسول الله صلى الله عليه وسلم قد جلس ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas and Al-Hasan bin 'Ali that:                     a funeral passed by them and one of them stood and the other sat. The one who stood up said: \"By Allah, I know that the Messnger of Allah stood up.\" The one who was sitting said: \"I know that the Messenger of Allah sat.\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20208",
        "11289",
        "11313",
        "17",
        "30"
      ]
    },
    {
      "id": "sunan-an-nasai-2054",
      "hadith_no": "2054",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن التيمي، عن أبي عثمان، عن عامر بن مالك، عن صفوان بن أمية، قال الطاعون والمبطون والغريق والنفساء شهادة ‏.‏ قال وحدثنا أبو عثمان مرارا ورفعه مرة إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Safwan bin Umayyah said:                     \"The plague, abdominal illness, drowning and dying in childbirth are martyrdom.\" (One of the narrators) said: Abu 'Uthman narrated this to us several times, and on one occasion he attributed it to the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11289",
        "11113",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-2170",
      "hadith_no": "2170",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا التيمي، عن أبي عثمان، عن ابن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن بلالا يؤذن بليل لينبه نائمكم ويرجع قائمكم وليس الفجر أن يقول هكذا ‏\"‏ ‏.‏ وأشار بكفه ‏\"‏ ولكن الفجر أن يقول هكذا ‏\"‏ ‏.‏ وأشار بالسبابتين ‏.‏",
      "text_en": " It was narrated from Ibn Mas'ud that the Prophet said:                     \"Bilal calls the Adhan at night to awaken those of you who are asleep, and so that those who are praying Qiyam cam return. Dawn is not when the light appears like this\" - and he gestured with his hand - \"rather dawn is when it appears like this: - and he gestured with his two forefingers. '",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-2395",
      "hadith_no": "2395",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، قال حدثنا أبو العلاء، عن مطرف، عن ابن أبي ربيعة، عن عبد الله بن عمرو، قال ذكرت للنبي صلى الله عليه وسلم الصوم فقال ‏\"‏ صم من كل عشرة أيام يوما ولك أجر تلك التسعة ‏\"‏ ‏.‏ فقلت إني أقوى من ذلك ‏.‏ قال ‏\"‏ صم من كل تسعة أيام يوما ولك أجر تلك الثمانية ‏\"‏ ‏.‏ قلت إني أقوى من ذلك ‏.‏ قال ‏\"‏ فصم من كل ثمانية أيام يوما ولك أجر تلك السبعة ‏\"‏ ‏.‏ قلت إني أقوى من ذلك قال فلم يزل حتى قال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     'Amr said: \"I spoke to the Prophet and he said: 'Fast one day out of ten and you will have the reward of the other nine.' I said: 'I am able to do more than that.' He said: 'Fast one day out of eight and you will have the reward of the other eight.' I said: 'I am able to do more than that.' He said: 'Fast one day out of eight and you will have the reward of the other seven.' I said: 'I am able to do more than that.' 'Fast one day and not the next.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11395",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-3101",
      "hadith_no": "3101",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا نصر بن علي، قال حدثنا معتمر، عن أبيه، عن أبي إسحاق، عن البراء، أن النبي صلى الله عليه وسلم ثم ذكر كلمة معناها قال ‏\"‏ ائتوني بالكتف واللوح ‏\"‏ ‏.‏ فكتب ‏{‏ لا يستوي القاعدون من المؤمنين ‏}‏ وعمرو بن أم مكتوم خلفه فقال هل لي رخصة فنزلت ‏{‏ غير أولي الضرر ‏}‏ ‏.‏",
      "text_en": " It was narrated from Al-Bara' that the Prophet (ﷺ) said:                      \"bring me a shoulder blade of a camel, or a tablet, and write: Not equal are those of the believers who sit (at home).\" [1] 'Amr bin Umm Maktum was behind him and he said: \"Is there a concession for me?\" Then the following was revealed: \"Except those who are disabled (by injury or are blind or lame).\" [2][1] An-Nisa' 4:95.[2] An-Nisa' 4:95.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20288",
        "11289",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-3606",
      "hadith_no": "3606",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن حصين بن عبد الرحمن، عن عمرو بن جاوان، - رجل من بني تميم - وذاك أني قلت له أرأيت اعتزال الأحنف بن قيس ما كان قال سمعت الأحنف يقول أتيت المدينة وأنا حاج فبينا نحن في منازلنا نضع رحالنا إذ أتى آت فقال قد اجتمع الناس في المسجد فاطلعت فإذا يعني الناس مجتمعون وإذا بين أظهرهم نفر قعود فإذا هو علي بن أبي طالب والزبير وطلحة وسعد بن أبي وقاص رحمة الله عليهم فلما قمت عليهم قيل هذا عثمان بن عفان قد جاء - قال - فجاء وعليه ملية صفراء فقلت لصاحبي كما أنت حتى أنظر ما جاء به ‏.‏ فقال عثمان أها هنا علي أها هنا الزبير أها هنا طلحة أها هنا سعد قالوا نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبتاع مربد بني فلان غفر الله له ‏\"‏ ‏.‏ فابتعته فأتيت رسول الله صلى الله عليه وسلم فقلت إني ابتعت مربد بني فلان ‏.‏ قال ‏\"‏ فاجعله في مسجدنا وأجره لك ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبتاع بئر رومة غفر الله له ‏\"‏ ‏.‏ فأتيت رسول الله صلى الله عليه وسلم فقلت قد ابتعت بئر رومة ‏.‏ قال ‏\"‏ فاجعلها سقاية للمسلمين وأجرها لك ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يجهز جيش العسرة غفر الله له ‏\"‏ ‏.‏ فجهزتهم حتى ما يفقدون عقالا ولا خطاما ‏.‏ قالوا نعم ‏.‏ قال اللهم اشهد اللهم اشهد اللهم اشهد ‏.‏",
      "text_en": " Al-Ahnaf said:                      \"I came to Al-Madinah, and I was performing Hajj, and while we were in our camping place unloading our mounts, someone came to us and said: 'The people have gathered in the Masjid.' I looked and found the people gathered, and in the midst of them was a group; there I saw 'Ali bin Abi Talib, Az-Zubair, Talhah and Sa'd bin Abi Waqqas, may Allah have mercy on them. When I got there, it was said that 'Uthman bin 'Affan had come. He came, wearing a yellowish cloak. I said to my companion: Stay where you are until I find out what is happening. 'Uthman said: Is 'Ali here? Is Az-Zubair here? Is Talhah here? Is Sa'd here? They said: Yes. He said: I adjure you by Allah, beside Whom there is none worthy of worship, are you aware that the Messenger of Allah said: Whoever buys the Mirbad of Banu so and so, Allah will forgive him, and I bought it, then I came to the Messenger of Allah and told him, and he said: Add it to our Masjid and the reward for it will be yours? They said: Yes. He said: I adjure you by Allah, beside Whom there is none worthy of worship, are you aware that the Messenger of Allah said: Whoever buys the well of Rumah, Allah will forgive him, so I came to the Messenger of Allah and said: I have bought the well of Rumah. He said: Give it to provide water for the Muslims, and the reward for it will be yours? They said: Yes. He said: 'I adjure you by Allah, beside Whom there is none worthy of worship, are you aware that the Messenger of Allah said: Whoever equips the army of Al-'Usrah (i.e. Tabuk), Allah will forgive him, so I equipped them until they were not lacking even a rope or a bridle?' They said: Yes. He said: O Allah, bear witness, O Allah, bear witness, O Allah, bear witness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20288",
        "11289",
        "15097",
        "11112"
      ]
    },
    {
      "id": "sunan-an-nasai-3782",
      "hadith_no": "3782",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، عن الحسن، عن عبد الرحمن بن سمرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا حلف أحدكم على يمين فرأى غيرها خيرا منها فليكفر عن يمينه ولينظر الذي هو خير فليأته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Samurah that the Messenger of Allah said:                      \"If any one of you swears an oath, then he sees something better than it, let him offer expiation for his oath, and look at what is better and do it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11016",
        "955"
      ]
    },
    {
      "id": "sunan-an-nasai-3997",
      "hadith_no": "3997",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إبراهيم بن المستمر، قال حدثنا عمرو بن عاصم، قال حدثنا معتمر، عن أبيه، عن الأعمش، عن شقيق بن سلمة، عن عمرو بن شرحبيل، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ يجيء الرجل آخذا بيد الرجل فيقول يا رب هذا قتلني ‏.‏ فيقول الله له لم قتلته فيقول قتلته لتكون العزة لك ‏.‏ فيقول فإنها لي ‏.‏ ويجيء الرجل آخذا بيد الرجل فيقول إن هذا قتلني ‏.‏ فيقول الله له لم قتلته فيقول لتكون العزة لفلان فيقول إنها ليست لفلان فيبوء بإثمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mas'ud that:                     The Prophet [SAW] said: \"A man will come, holding another man's hand, and will say: 'O Lord, this man killed me.' Allah will say to him: 'Why did you kill him?' He will say: 'I killed him so that the glory would be to you.' He will say: 'It is to Me.' Then (another) man will come holding another man's hand, and will say: 'This man killed me.' Allah will say to him: 'Why did you kill him?' He will say: 'So that the glory would be to so and so.' He will say: 'It is not to so and so,' and the burden of sin will be upon him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34023",
        "20267",
        "20288",
        "11289",
        "11060",
        "11353",
        "11644",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-4043",
      "hadith_no": "4043",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا الفضل بن سهل الأعرج، قال حدثنا يحيى بن غيلان، - ثقة مأمون - قال حدثنا يزيد بن زريع، عن سليمان التيمي، عن أنس، قال إنما سمل النبي صلى الله عليه وسلم أعين أولئك لأنهم سملوا أعين الرعاة ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Prophet [SAW] only had the eyes of those people gouged out, because they had gouged out the eyes of the herdsmen.\"",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "30527",
        "20304",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4118",
      "hadith_no": "4118",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، عن يزيد، عن سليمان التيمي، عن الحسن، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تواجه المسلمان بسيفيهما فقتل أحدهما صاحبه فهما في النار ‏\"‏ ‏.‏ قيل يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ أراد قتل صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that:                     The Prophet [SAW] said: \"If two Muslims confront each other with swords, and one kills the other, they will both be in Hell.\" It was said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20472",
        "11289",
        "11016",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-4641",
      "hadith_no": "4641",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت أبي قال، حدثنا أبو نضرة، عن جابر بن عبد الله، قال كنا نسير مع رسول الله صلى الله عليه وسلم وأنا على ناضح فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قلت نعم هو لك يا نبي الله قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قلت نعم هو لك يا نبي الله ‏.‏ قال ‏\"‏ أتبيعنيه بكذا وكذا والله يغفر لك ‏\"‏ ‏.‏ قلت نعم هو لك ‏.‏ قال أبو نضرة وكانت كلمة يقولها المسلمون افعل كذا وكذا والله يغفر لك ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"We were traveling with the Messenger of Allah and I was riding a camel. The Messenger of Allah said to me: 'Will you sell it to me for such and such, may Allah forgive you?', I said, I said, 'Yes, it is yours, O Prophet of Allah.' He said: 'Will you sell it to me for such and such, may Allah forgive your?' I said: 'Yes, it is yours, O Prophet of \"Allah.' He said: 'Will you sell it to me for such and such, may Allah forgives you?' I said: 'Yes, it is yours. '''(One of the narrators) Abu Nadrah said: \"This became a phrase that was used by the Muslims: 'Do such and such, may Allah forgive you.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-5041",
      "hadith_no": "5041",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، قال سمعت طلقا، يذكر عشرة من الفطرة السواك وقص الشارب وتقليم الأظفار وغسل البراجم وحلق العانة والاستنشاق ‏.‏ وأنا شككت في المضمضة ‏.‏",
      "text_en": " Al-Mu'tamir narrated that his father said:                     \"I heard Talq mentioning ten things that have to do with the Fitrah: Using the Siwak, trimming the mustache, clipping the nails, washing the joints, shaving the pubes, rinsing the nose, and I am not sure about rinsing the mouth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289"
      ]
    },
    {
      "id": "sunan-an-nasai-5312",
      "hadith_no": "5312",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن سليمان التيمي، عن أبي عثمان النهدي، قال كنا مع عتبة بن فرقد فجاء كتاب عمر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يلبس الحرير إلا من ليس له منه شىء في الآخرة إلا هكذا ‏\"‏ ‏.‏ وقال أبو عثمان بأصبعيه اللتين تليان الإبهام فرأيتهما أزرار الطيالسة حتى رأيت الطيالسة ‏.‏",
      "text_en": " It was narrated from Jarir from Sulaiman At-Taimi, from Abu 'Uthman A-Nahdi, who said:                     \"We were with 'Utbah bin Farqad when the letter of 'Umar came, saying that the Messenger of Allah [SAW] said: 'No one wears silk except one who has no share of it in the Hereafter, except this much.'\" And Abu 'Uthman gestured with the two fingers that are next to the thumb. And I saw the two of them pointing to the borders of the Tayalisah, so that I could see the Tayalisah.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sunan-an-nasai-5452",
      "hadith_no": "5452",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، قال حدثنا المعتمر، عن أبيه، عن أنس، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل والهرم والبخل والجبن وأعوذ بك من عذاب القبر ومن فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet [SAW] used to say: \"Allahumma inni a'udhu bika minal-'ajzi, wal-kasali, wal-harami, wal-bukhli, wal-jubni, wa 'audhu bika min 'adhabil-qabri, wa min fitnatil-mahya wal-mamati (O Allah, I seek refuge in You from incapacity, laziness, old age, miserliness and cowardice, and I seek refuge in You from the torment of the grave, and from the trials of life and death.)\"",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5527",
      "hadith_no": "5527",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، عن حصين، عن هلال بن يساف، عن فروة بن نوفل، قال سألت عائشة فقلت حدثيني بشىء، كان رسول الله صلى الله عليه وسلم يدعو به قالت كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Farwah bin Nawfal said:                     \"I asked 'Aishah: 'Tell me of something that the Messenger of Allah [SAW] used to say in his supplication.' She said: 'The Messenger of Allah [SAW] used to say:  Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done and from the evil of what I have not done.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "15097",
        "10835"
      ]
    },
    {
      "id": "sunan-an-nasai-5541",
      "hadith_no": "5541",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، - يعني ابن المبارك - عن سليمان التيمي، أن أنس بن مالك، أخبرهم قال بينا أنا قائم، على الحى وأنا أصغرهم، سنا على عمومتي إذ جاء رجل فقال إنها قد حرمت الخمر‏.‏ وأنا قائم عليهم أسقيهم من فضيخ لهم فقالوا اكفأها‏.‏ فكفأتها فقلت لأنس ما هو قال البسر والتمر‏.‏ قال أبو بكر بن أنس كانت خمرهم يومئذ فلم ينكر أنس‏.‏",
      "text_en": " Anas bin Malik said:                     \"While I was taking care of a group of people, including my paternal uncles, and I was the youngest of them, a man came and said: 'Khamr has been forbidden.' I was taking care of them, and was pouring Fadikh (date-wine) for them. They said: 'Pour it away.' So I poured it away.\" I (the narrator) said to Anas: \"What is that?\" He said: \"Unripe dates and dried dates.\" Abu Bakr bin Anas said: \"That was their wine in those days.\" And Anas did not deny that.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5614",
      "hadith_no": "5614",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن سليمان التيمي، عن طاوس، قال قال رجل لابن عمر أنهى رسول الله صلى الله عليه وسلم عن نبيذ الجر قال نعم ‏.‏ قال طاوس والله إني سمعته منه ‏.‏",
      "text_en": " It was narrated that Tawus said:                     \"A man said to Ibn 'Umar: 'Did the Messenger of Allah [SAW] forbid soaking (fruits) in earthenware jars?' He said: 'Yes.' Tawus said: 'By Allah, I heard that from him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11289",
        "11053"
      ]
    },
    {
      "id": "sunan-an-nasai-5615",
      "hadith_no": "5615",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا هارون بن زيد بن يزيد بن أبي الزرقاء، قال حدثني أبي قال، حدثنا شعبة، عن سليمان التيمي، وإبراهيم بن ميسرة، قالا سمعنا طاوسا، يقول جاء رجل إلى ابن عمر قال أنهى رسول الله صلى الله عليه وسلم عن نبيذ الجر قال نعم ‏.‏ زاد إبراهيم في حديثه والدباء ‏.‏",
      "text_en": " It was narrated that Sulaiman At-Taimi and Ibrahim bin Maisarah said:                     \"We heard Tawus say: 'A man came to Ibn 'Umar and said: Did the Messenger of Allah [SAW] forbid soaking (fruits) in earthenware jars? He said: 'Yes.' Ibrahim added in his Hadith: \"And Ad-Dubba' (gourds).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20020",
        "11289",
        "11240"
      ]
    },
    {
      "id": "sunan-an-nasai-5644",
      "hadith_no": "5644",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن أسماء بنت يزيد، عن ابن عم، لها يقال له أنس قال قال ابن عباس ألم يقل الله عز وجل ‏{‏ ما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ‏}‏ قلت بلى ‏.‏ قال ألم يقل الله ‏{‏ وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرا أن يكون لهم الخيرة من أمرهم ‏}‏ قلت بلى ‏.‏ قال فإني أشهد أن نبي الله صلى الله عليه وسلم نهى عن النقير والمقير والدباء والحنتم ‏.‏",
      "text_en": " It was narrated from Asma' bint Yazid that:                     A paternal uncle of hers whose name was Anas said: \"Ibn 'Abbas said: Does not Allah say: \"And whatsoever the Messenger (Muhammad) gives you, take it; and whatsoever he forbids you, abstain (from it).'? He said: 'Yes.' He said: 'Does not Allah say: 'It is not for a believer, man or woman, when Allah and His Messenger have decreed a matter that they should have any option in their decision?' I said: 'Yes.' He said: 'I bear witness that the Prophet of Allah [SAW] forbade An-Naqir, Al-Muqayyar, Ad-Dubba', and Al-Hantam.'\"",
      "usc_msa_ref": "",
      "chain": [
        "16",
        "11289",
        "84"
      ]
    },
    {
      "id": "sunan-an-nasai-5693",
      "hadith_no": "5693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن قيس بن هنان، قال سألت ابن عباس قلت إن لي جريرة أنتبذ فيها حتى إذا غلى وسكن شربته ‏.‏ قال مذ كم هذا شرابك قلت مذ عشرون سنة أو قال مذ أربعون سنة ‏.‏ قال طالما تروت عروقك من الخبث ‏.‏ ومما اعتلوا به حديث عبد الملك بن نافع عن عبد الله بن عمر ‏.‏",
      "text_en": " It was narrated that Qais bin Wahban said:                     \"I asked Ibn 'Abbas: 'I have a small jar in which I make Nabidh and when it has bubbled and settled down again, I drink it.' He said: 'For how long you have been drinking that?' He said: 'For twenty years'\" - or he said: 'for forty years.' He said: 'For a long time you have been quenching your thirst with something forbidden.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "11289",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5698",
      "hadith_no": "5698",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن محمد بن سيرين، عن ابن عمر، قال المسكر قليله وكثيره حرام ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Intoxicants are unlawful in small or large amounts.\"",
      "usc_msa_ref": "",
      "chain": [
        "16",
        "11289",
        "11035",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5716",
      "hadith_no": "5716",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن أبي مجلز، عن عامر بن عبد الله، أنه قال قرأت كتاب عمر بن الخطاب إلى أبي موسى أما بعد فإنها قدمت على عير من الشام تحمل شرابا غليظا أسود كطلاء الإبل وإني سألتهم على كم يطبخونه فأخبروني أنهم يطبخونه على الثلثين ذهب ثلثاه الأخبثان ثلث ببغيه وثلث بريحه فمر من قبلك يشربونه ‏.‏",
      "text_en": " It was narrated that 'Amir bin 'Abdullah said:                     \"I saw the letter of 'Umar bin Al-Khattab to Abu Musa (in which he said): 'A caravan came to me from Ash-Sham carrying a thick black paint like the pitch that is daubed on camels. I asked them how long they cooked it, and they told me that they cooked it until it was reduced by two-third. So the bad two-third had gone, one-third to take away evil and one-third to take away the bad smell. So let those who are with you drink it.\"",
      "usc_msa_ref": "",
      "chain": [
        "16",
        "11289",
        "11313"
      ]
    },
    {
      "id": "sunan-an-nasai-5743",
      "hadith_no": "5743",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن أبي عثمان، وليس، بالنهدي أن أم الفضل، أرسلت إلى أنس بن مالك تسأله عن نبيذ الجر فحدثها عن النضر ابنه أنه كان ينبذ في جر ينبذ غدوة ويشربه عشية ‏.‏",
      "text_en": " It was narrated from Abu 'Uthman, who was not Al-Hindi, that:                     Umm Al-Fadl sent word to Anas bin Malik, asking him about Nabidh made in an earthenware jar. He told her about his son An-Nadr, who used to make Nabidh in an earthenware jar in the morning and drink it in the evening.",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "11289",
        "11113"
      ]
    },
    {
      "id": "sunan-an-nasai-5755",
      "hadith_no": "5755",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن علي بن سعيد بن إبراهيم، قال حدثنا القواريري، قال حدثنا معتمر بن سليمان، عن أبيه، عن محمد، عن عبيدة، عن ابن مسعود، قال أحدث الناس أشربة ما أدري ما هي فما لي شراب منذ عشرين سنة أو قال أربعين سنة إلا الماء والسويق غير أنه لم يذكر النبيذ ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"The people have invented new drinks and I do not know what they are. I have not drunk anything for 20 years (or he said: 40 years) except water and Sawiq (barley gruel), and he did not mention Nabidh.\"",
      "usc_msa_ref": "",
      "chain": [
        "28001",
        "30024",
        "20288",
        "11289",
        "11035",
        "11370",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-867",
      "hadith_no": "867",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عباد بن العوام، عن عوف، عن أبي المنهال، عن أبي برزة، ح وحدثنا سويد، حدثنا معتمر بن سليمان، عن أبيه، حدثه أبو المنهال، عن أبي برزة، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في الفجر ما بين الستين إلى المائة ‏.‏",
      "text_en": " It wasnarrated from Abu Barzah that the Messenger of Allah (ﷺ)used torecite between sixty and one hundred (Verses) in Fajr prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20431",
        "11298",
        "11290",
        "227",
        "20288",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "id": "sunan-ibn-majah-896",
      "hadith_no": "896",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يوسف بن موسى القطان، حدثنا جرير، عن سليمان التيمي، عن قتادة، عن أبي غلاب، عن حطان بن عبد الله الرقاشي، عن أبي موسى الأشعري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قرأ الإمام فأنصتوا فإذا كان عند القعدة فليكن أول ذكر أحدكم التشهد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Musa Al-Ash’ari said:                      “The Messenger ofAllah(ﷺ) said: ‘When the Imam recites, then listen attentively, andifhe is sitting (in the prayer) then the first remembrance thatanyoneof you recites should be the Tashahhud.’”",
      "usc_msa_ref": "",
      "chain": [
        "30224",
        "20028",
        "11289",
        "11019",
        "10676",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-1330",
      "hadith_no": "1330",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا معتمر، عن أبيه، عن بركة، عن بشير بن نهيك، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  استسقى حتى رأيت - أو رؤي - بياض إبطيه ‏.‏ قال معتمر أراه في الاستسقاء ‏.‏",
      "text_en": " Mu’tamirnarrated from his father, from Barakah, from Bashir binNahik, fromAbu Hurairah:                      “The Prophet (ﷺ) supplicated for rain(raising hishands) until I saw or one could see the whiteness of hisarmpits.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20288",
        "11289",
        "11266",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1462",
      "hadith_no": "1462",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا إسماعيل ابن علية، عن سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن مسعود، أن رجلا، أصاب من امرأة يعني ما دون الفاحشة فلا أدري ما بلغ غير أنه دون الزنا فأتى النبي  صلى الله عليه وسلم  فذكر ذلك له فأنزل الله سبحانه ‏{أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين}‏ فقال يا رسول الله ألي هذه قال ‏\"‏ لمن أخذ بها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that a man did somethingwitha woman that was less than adultery; I do not know how far itwent,but it was less than adultery. He went to the Prophet (ﷺ) andtoldhim about that. Then Allah revealed the words:                      “And perform theprayer, at the two ends of the day and in some hours of the night.Verily, the good deeds remove the evil deeds. That is a reminder forthe mindful.” [11:114] He said: “O Messenger of Allah, is thisonlyfor me?” He said: “It is for everyone who acts upon it.”",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20208",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1482",
      "hadith_no": "1482",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن سليمان التيمي، عن أبي نضرة، عن جابر بن عبد الله، قال كان رسول الله  صلى الله عليه وسلم  يقوم في أصل شجرة - أو قال إلى جذع - ثم اتخذ منبرا ‏.‏ قال فحن الجذع - قال جابر - حتى سمعه أهل المسجد حتى أتاه رسول الله  صلى الله عليه وسلم  فمسحه فسكن ‏.‏ فقال بعضهم لو لم يأته لحن إلى يوم القيامة ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) used to stand by the root of a tree, or by a tree trunk,thenhe started to use a pulpit. The tree trunk made a grievingsound.”Jabir said: “So that the people in the mosque could hear it.Untilthe Messenger of Allah (ﷺ) came to it and rubbed it, and itcalmeddown. Some of them said: ‘If he had not come to it, it wouldhavegrieved until the Day of Resurrection.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1515",
      "hadith_no": "1515",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن الحسن بن شقيق، عن ابن المبارك، عن سليمان التيمي، عن أبي عثمان، - وليس بالنهدي - عن أبيه، عن معقل بن يسار، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اقرءوها عند موتاكم ‏\"‏ ‏.‏ يعني ‏{يس}‏ ‏.‏",
      "text_en": " It wasnarrated from Ma’qil bin Yasar that the Messenger of Allah(ﷺ)said:                      “Recite Qur’an near your dying ones,” meaning Ya-Sin.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30362",
        "20025",
        "11289",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-1766",
      "hadith_no": "1766",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا يحيى بن سعيد، وابن أبي عدي، عن سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يمنعن أحدكم أذان بلال من سحوره فإنه يؤذن لينتبه نائمكم وليرجع قائمكم وليس الفجر أن يقول هكذا ولكن هكذا يعترض في أسفل السماء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Messenger of Allah(ﷺ) said:                      “The Adhan of Bilal should not prevent anyone of youfromeating Suhur, for he gives the Adhan to alert those among youwho areasleep, and so that anyone who is praying can prepare himselfforfasting. The Fajr does not come in this manner, rather it comesinthis manner, and it appears along the horizon.”",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20031",
        "20276",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2264",
      "hadith_no": "2264",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا يحيى بن سعيد، وحماد بن مسعدة، عن سليمان التيمي، ح وحدثنا إسحاق بن إبراهيم بن حبيب بن الشهيد، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو عثمان النهدي، عن عبد الله بن مسعود، قال نهى رسول الله  صلى الله عليه وسلم  عن تلقي البيوع ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The Messenger of Allah (ﷺ) forbade. meeting the owners of goods (away from the market).\"",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20031",
        "20224",
        "11289",
        "34027",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2483",
      "hadith_no": "2483",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا يزيد بن هارون، حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن عامر، عن الزبير بن العوام، أنه حمل على فرس يقال له غمر أو غمرة فرأى مهرا أو مهرة من أفلائها يباع ينسب إلى فرسه فنهى عنها ‏.‏",
      "text_en": " It was narrated from Zubair bin 'Awwam that :                     he gave a horse called Ghamr or Ghamrah to someone, then he saw one of its colts or fillies  attributed to his horse being sold, but he refrained from (buging) it.",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20472",
        "11289",
        "11113",
        "18572",
        "7"
      ]
    },
    {
      "id": "sunan-ibn-majah-2519",
      "hadith_no": "2519",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا معتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، قال جاء رجل يطلب نبي الله صلى الله عليه وسلم بدين أو بحق فتكلم ببعض الكلام فهم صحابة رسول الله صلى الله عليه وسلم به فقال رسول الله صلى الله عليه وسلم ‏\"‏ مه إن صاحب الدين له سلطان على صاحبه حتى يقضيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “A man came to ask the Prophet of Allah (ﷺ) for some debt or some right, and he spoke harshly to him, and the Companions of the Messenger of Allah (ﷺ) wanted to rebuke him. But the Messenger of Allah (ﷺ) said: 'Let him be, for the one who is owed something has authority over the debtor, until it is paid off.' ”",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2540",
      "hadith_no": "2540",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، قال أصاب نبي الله صلى الله عليه وسلم خصاصة فبلغ ذلك عليا فخرج يلتمس عملا يصيب فيه شيئا ليغيث به رسول الله صلى الله عليه وسلم فأتى بستانا لرجل من اليهود فاستقى له سبعة عشر دلوا كل دلو بتمرة فخيره اليهودي من تمره سبع عشرة عجوة فجاء بها إلى نبي الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “The Prophet (ﷺ) was in need of food, and news of that reached 'Ali. He went out seeking work so that he could earn something to give to the Messenger of Allah (ﷺ). He came to a garden belonging to a Jewish man, and he drew seventeen buckets of water for him, each bucket for a date. The Jew gave him the option to take seventeen of his 'Ajwah dates (a high quality of dates) and he brought them to the Prophet of Allah (ﷺ).”",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2762",
      "hadith_no": "2762",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا معتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقتل مؤمن بكافر ولا ذو عهد في عهده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     ”A believer should not be killed in retaliation for the murder of a disbeliever, and a person who has a treaty should not be killed during the time of the treaty.”",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2785",
      "hadith_no": "2785",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ المسلمون تتكافأ دماؤهم وهم يد على من سواهم يسعى بذمتهم أدناهم ويرد على أقصاهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     “The blood of every Muslims is equal, they are one hand against others. The asylum offered by the lowest of them in status applies to them (all), and the return is granted to the farthest of them.”",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2801",
      "hadith_no": "2801",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن المقدام، حدثنا المعتمر بن سليمان، سمعت أبي يحدث، عن قتادة، عن أنس بن مالك، قال كانت عامة وصية رسول الله صلى الله عليه وسلم حين حضرته الوفاة وهو يغرغر بنفسه ‏\"‏ الصلاة وما ملكت أيمانكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “What the Messenger of Allah (ﷺ) most enjoined when he was dying and breathing his last was: The prayer; and those whom your right hands possess.”",
      "usc_msa_ref": "",
      "chain": [
        "30121",
        "20288",
        "11289",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3492",
      "hadith_no": "3492",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن موسى السدي، حدثنا سيف بن هارون، عن سليمان التيمي، عن أبي عثمان النهدي، عن سلمان الفارسي، قال سئل رسول الله  صلى الله عليه وسلم  عن السمن والجبن والفراء قال ‏\"‏ الحلال ما أحل الله في كتابه والحرام ما حرم الله في كتابه وما سكت عنه فهو مما عفا عنه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salman Al-Farisi said:                      “The Messenger of Allah(ﷺ)was asked about ghee, cheese and wild donkeys. He said: ‘What islawful is that which Allah has permitted, in His Book and what isunlawful is that which Allah has forbidden in His Book. What Heremained silent about is what is pardoned.’”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3533",
      "hadith_no": "3533",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا المعتمر بن سليمان، عن أبيه، حدثتني رميثة، عن عائشة، أنها قالت أتعجز إحداكن أن تتخذ كل عام من جلد أضحيتها سقاء ثم قالت نهى رسول الله  صلى الله عليه وسلم  أن ينبذ في الجر وفي كذا وفي كذا إلا الخل ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “Is anyone of you incapable oftakinga water skin from the skin of her sacrifice each year?” Thenshesaid: “The Messenger of Allah (ﷺ) forbade making Nabidh in(earthenware) jars, and in such and such, and such and such, exceptfor vinegar.”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20288",
        "11289",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3713-2",
      "hadith_no": "3713",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن سليمان التيمي، عن أنس بن مالك، قال عطس رجلان عند النبي  صلى الله عليه وسلم  فشمت أحدهما - أو سمت - ولم يشمت الآخر فقيل يا رسول الله عطس عندك رجلان فشمت أحدهما ولم تشمت الآخر فقال ‏\"‏ إن هذا حمد الله وإن هذا لم يحمد الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"Two men sneezed in he presence of the Prophet(ﷺ) and he replied (said: YarhamukAllah; may Allah have mercy on you') to one and not to the other. It was said: 'O Messenger of Allah(ﷺ), two men sneezed in your presence and you replied to one and not to the other?' He said: \"'This one praised Allah(said Al-Hamdulillah fter sneezing) but that one did not.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3730-2",
      "hadith_no": "3730",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا المعتمر بن سليمان، عن الركين، عن أبيه، عن سمرة، قال نهى رسول الله  صلى الله عليه وسلم  أن نسمي رقيقنا أربعة أسماء أفلح ونافع ورباح ويسار ‏.‏",
      "text_en": " It was narrated that Samurah said:                     \"The Messenger of Allah(ﷺ) forbade giving our slaves four names: Aflah (successful), Nafi' (beneficial), Rabah (profit) and Yasar(prosperity).\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "id": "sunan-ibn-majah-4099",
      "hadith_no": "4099",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، عن سليمان التيمي، وسعيد بن أبي عروبة، عن قتادة، عن الحسن، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار ‏\"‏ ‏.‏ قالوا يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ إنه أراد قتل صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Messenger of Allah (ﷺ) said:                     “When two Muslims confront one another with their swords, both thekiller and the slain will be in Hell.” They said: “O Messenger ofAllah, (we understand about) this killer, but what is wrong with theone who is slain?” He said: “He wanted to kill his companion.’”",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "20472",
        "11289",
        "11073",
        "11019",
        "11016",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-4133",
      "hadith_no": "4133",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، عن سليمان التيمي، ح وحدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، عن سليمان التيمي، عن أبي عثمان النهدي، عن أسامة بن زيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما أدع بعدي فتنة أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid that the Messenger of Allah(ﷺ) said:                      “I am not leaving behind me any tribulation that ismoreharmful to men than women.”",
      "usc_msa_ref": "",
      "chain": [
        "30537",
        "20258",
        "11289",
        "18792",
        "20025",
        "11289",
        "11113",
        "50"
      ]
    }
  ],
  "total_hadiths": 240
}