{
  "id": "11280",
  "name": "Hameed bin 'Abdur Rahman حميد بن عبد الرحمن الحميري",
  "full_name": "Hameed bin 'Abdur Rahman حميد بن عبد الرحمن الحميري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Humayri",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "14256",
      "name": "'Ubaidullah bin Hameed عبيد الله بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "3229",
      "name": "Abu Bakra al-Thaqafi ( أبو بكرة الثقفي الطائفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10553",
      "name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "14256",
      "name": "'Ubaidullah bin Hameed عبيد الله بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11388",
      "name": "Muhammad bin al-Muntashir bin al-Ajda' محمد بن المنتشر بن الأجدع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10799",
      "name": "Azrh bin 'Abdur Rahman عزرة بن عبد الرحمن بن زرارة الخزاعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6175",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني إسحاق، أخبرنا أبو المغيرة، حدثنا الأوزاعي، حدثنا الزهري، عن حميد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف منكم فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك، فليتصدق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said: \"Whoever amongst you swears, (saying by error) in his oath 'By Al-Lat and Al- Uzza', then he should say, 'None has the right to be worshipped but Allah.' And whoever says to his companions, 'Come let me gamble' with you, then he must give something in charity (as an expiation for such a sin).\" (See Hadith No. 645)",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11013",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "2812",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني قتيبة بن سعيد، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن، الحميري عن أبي هريرة، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد رمضان شهر الله المحرم وأفضل الصلاة بعد الفريضة صلاة الليل ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent fast after Ramadan is God's month. al-Muharram, and the most excellent prayer after what is prescribed is prayer during the night.",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "4302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا الثقفي، عن أيوب السختياني، عن عمرو، بن سعيد عن حميد بن عبد الرحمن الحميري، عن ثلاثة، من ولد سعد كلهم يحدثه عن أبيه، أن النبي صلى الله عليه وسلم دخل على سعد يعوده بمكة فبكى قال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقال قد خشيت أن أموت بالأرض التي هاجرت منها كما مات سعد ابن خولة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم اشف سعدا اللهم اشف سعدا ‏\"‏ ‏.‏ ثلاث مرار ‏.‏ قال يا رسول الله إن لي مالا كثيرا وإنما يرثني ابنتي أفأوصي بمالي كله قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فبالثلثين قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فالنصف قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فالثلث قال ‏\"‏ الثلث والثلث كثير إن صدقتك من مالك صدقة وإن نفقتك على عيالك صدقة وإن ما تأكل امرأتك من مالك صدقة وإنك أن تدع أهلك بخير - أو قال بعيش - خير من أن تدعهم يتكففون الناس ‏\"‏ ‏.‏ وقال بيده ‏.‏",
      "text_en": " Humaid b. 'Abd al-Rahman al-Himyari reported from three of the sons of Sa'd all of whom reported from their father that Allah's Apostle (may peace be upon him) visited Sa'd as he was ill in Mecca. He (Sa'd) wept. He (the Holy Prophet) said:                      What makes you weep? He said: I am afraid I may die in the land from where I migrated as Sa'd b. Khaula had died. Thereupon Allah's Apostle (may peace be upon him) said: O Allah, grant health to Sa'd. O Allah, grant health to Sad. He repeated it three times. He (Sa'd) said: Allah's Messenger, I own a large property and I have only one daughter as my inheritor. Should I not will away the whole of my property? He (the Holy Prophet) said: No. He said: (Should I not will away, ) two-thirds of the property? he (the Holy Prophet) said: No. He (Sa'd) (again) said: (Should I not will away) half (of my property)? He said: No. He (Sa'd) said: Then one-third? Thereupon he (the Holy Prophet) said: (Yes), one-third, and one-third is quite substanial. And what you spend as charity from your property is Sadaqa and flour spending on your family is also Sadaqa, and what your wife eats from your property is also Sadaqa, and that you leave your heirs well off (or he said: prospreous) is better than to leave them (poor and) begging from people. He (the Holy Prophet) pointed this with his hands.",
      "chain": [
        "11015",
        "10602",
        "11280"
      ]
    },
    {
      "hadith_no": "4303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني أبو الربيع العتكي، حدثنا حماد، حدثنا أيوب، عن عمرو بن سعيد، عن حميد بن عبد الرحمن الحميري، عن ثلاثة، من ولد سعد قالوا مرض سعد بمكة فأتاه رسول الله صلى الله عليه وسلم يعوده ‏.‏ بنحو حديث الثقفي ‏.‏",
      "text_en": " Humaid b. Abd al-Rahmin al-Himayri reported on the authority of the three of the sons of Sa'd:                      They said: Sa'd fell ill in Mecca. Allah's Messenger (may peace be upon him) visited him to inquire after his health. The rest of the hadith is the same.",
      "chain": [
        "20022",
        "11015",
        "10602",
        "11280"
      ]
    },
    {
      "hadith_no": "81",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، عن داود بن عبد الله، ح وحدثنا مسدد، حدثنا أبو عوانة، عن داود بن عبد الله، عن حميد الحميري، قال لقيت رجلا صحب النبي صلى الله عليه وسلم أربع سنين كما صحبه أبو هريرة قال نهى رسول الله صلى الله عليه وسلم أن تغتسل المرأة بفضل الرجل أو يغتسل الرجل بفضل المرأة - زاد مسدد - وليغترفا جميعا ‏.‏",
      "text_en": " Narrated Humayd al-Himyari:                     Humayd al-Himyari reported: I met a person (among the Companion of Prophet) who remained in the company of the Prophet (ﷺ)for four years as AbuHurayrah remained in his company. He reported: The Messenger of Allah (ﷺ) forbade that the female should wash with the water left over by the male, and that the male should wash with the left-over of the female. The version of Musaddad adds: \"That they both take the handful of water together.\"",
      "chain": [
        "30184",
        "20321",
        "11333",
        "30175",
        "20469",
        "11333",
        "11280"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد بن السري، عن عبد السلام بن حرب، عن أبي خالد الدالاني، عن أبي العلاء الأودي، عن حميد بن عبد الرحمن الحميري، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا اجتمع الداعيان فأجب أقربهما بابا فإن أقربهما بابا أقربهما جوارا وإن سبق أحدهما فأجب الذي سبق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman al-Himyari:                     A companion of the Prophet (ﷺ) reported him as saying: When two people come together to issue an invitation, accept that of the one whose door is nearer in neighbourhood, but if one of them comes before the other accept the invitation of the one who comes first.",
      "chain": [
        "30480",
        "20248",
        "20728",
        "11280"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد شهر رمضان شهر الله المحرم وأفضل الصلاة بعد الفريضة صلاة الليل ‏\"‏ ‏.‏ قال وفي الباب عن جابر وبلال وأبي أمامة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ قال أبو عيسى وأبو بشر اسمه جعفر بن أبي وحشية واسم أبي وحشية إياس ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"The most virtuous fasting after the month of Ramadan is that of Allah's month of Al-Muharram. And the most virtuous Salat after the obligatory is the night prayer.\"",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "740",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد صيام شهر رمضان شهر الله المحرم ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "2656",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن داود بن أبي هند، عن عزرة، عن حميد بن عبد الرحمن الحميري، عن سعد بن هشام، عن عائشة، قالت كان لنا قرام ستر فيه تماثيل على بابي فرآه رسول الله صلى الله عليه وسلم فقال ‏\"‏ انزعيه فإنه يذكرني الدنيا ‏\"‏ ‏.‏ قالت وكان لنا سمل قطيفة علمها من حرير كنا نلبسها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " 'Aishah narrated:                      \"We had a cloth which had some pictures on it as a curtain on my door. The Messenger of Allah(s.a.w) saw it and said:'Remove it, for it reminds me of the world.'\" She said: \"We had a piece of velvet that had patches of silk on it which we used to wear.\"",
      "chain": [
        "30480",
        "20354",
        "11585",
        "10799",
        "11280",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "5054",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن داود الأودي، عن حميد بن عبد الرحمن الحميري، قال لقيت رجلا صحب النبي صلى الله عليه وسلم كما صحبه أبو هريرة أربع سنين قال نهانا رسول الله صلى الله عليه وسلم أن يمتشط أحدنا كل يوم ‏.‏",
      "text_en": " It was narrated that Humaid bin 'Abdur-Rahman Al-Himyari said:                     \"I met a man who accompanied the Prophet [SAW] as Abu Hurairah accompanied him for four years, who said: 'The Messenger of Allah [SAW] forbade us from combing our hair everyday.'\"",
      "chain": [
        "30367",
        "20469",
        "11280"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن محمد بن المنتشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال أى الصيام أفضل بعد شهر رمضان قال ‏\"‏ شهر الله الذي تدعونه المحرم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A man came to the Prophet(ﷺ)and said: ‘Which fasting is better after the month of Ramadan?’He said: ‘The month of Allah which is called Muharram.’”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11388",
        "11280",
        "13"
      ]
    }
  ],
  "total_hadiths": 11
}