{
  "id": "11298",
  "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
  "full_name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "58",
      "date_gregorian": "NA",
      "date_display": [
        "58 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "147",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11290",
      "name": "Siyar bin Salaama, Abu al-Minhal سيار بن سلامة الرياحي أبو المنهال",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11283",
      "name": "Khalas bin 'Amr al-Hajri خلاس بن عمرو الهجري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11287",
      "name": "Sa'id bin Abi al-Hasan سعيد بن أبي الحسن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11284",
      "name": "Zararah bin Awfa al-'Amiri al-Harshi زرارة بن أوفى العامري الحرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10801",
      "name": "'Alqama bin Wa'il bin Hjr علقمة بن وائل بن حجر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14326",
      "name": "Qsamh bin Zuhyr al-Mazny قسامة بن زهير المازني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14432",
      "name": "Yazid al-Farsy al-Bsry يزيد الفارسي البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14134",
      "name": "Ziyad bin Mkhraq زياد بن مخراق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15294",
      "name": "'Abdullah bin 'Amr عبد الله بن عمرو بن هند المرادي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20396",
      "name": "Muhammad bin al-Hasan bin 'Imran محمد بن الحسن بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20425",
      "name": "Sa'id bin Yahya, Abu Sufyan al-Humayri سعيد بن يحيى أبو سفيان الحميري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30151",
      "name": "'Uthman bin al-Haythm bin Jahm عثمان بن الهيثم بن جهم بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "24156",
      "name": "Sa'id bin Aws bin Thabit سعيد بن أوس بن ثابت",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24473",
      "name": "Haudha bin Khalifa هوذة بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "47",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبد الله بن علي المنجوفي، قال حدثنا روح، قال حدثنا عوف، عن الحسن، ومحمد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اتبع جنازة مسلم إيمانا واحتسابا، وكان معه حتى يصلى عليها، ويفرغ من دفنها، فإنه يرجع من الأجر بقيراطين، كل قيراط مثل أحد، ومن صلى عليها ثم رجع قبل أن تدفن فإنه يرجع بقيراط ‏\"‏‏.‏ تابعه عثمان المؤذن قال حدثنا عوف عن محمد عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"(A believer) who accompanies the funeral      procession of a Muslim out of sincere faith and hoping to attain      Allah's reward and remains with it till the funeral prayer is offered      and the burial ceremonies are over, he will return with a reward of      two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who      offers the funeral prayer only and returns before the burial, will      return with the reward of one Qirat only.\"",
      "chain": [
        "30302",
        "20229",
        "11298",
        "11016",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "344",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسدد، قال حدثني يحيى بن سعيد، قال حدثنا عوف، قال حدثنا أبو رجاء، عن عمران، قال كنا في سفر مع النبي صلى الله عليه وسلم وإنا أسرينا، حتى كنا في آخر الليل، وقعنا وقعة ولا وقعة أحلى عند المسافر منها، فما أيقظنا إلا حر الشمس، وكان أول من استيقظ فلان ثم فلان ثم فلان  يسميهم أبو رجاء فنسي عوف  ثم عمر بن الخطاب الرابع، وكان النبي صلى الله عليه وسلم إذا نام لم يوقظ حتى يكون هو يستيقظ، لأنا لا ندري ما يحدث له في نومه، فلما استيقظ عمر، ورأى ما أصاب الناس، وكان رجلا جليدا، فكبر ورفع صوته بالتكبير، فما زال يكبر ويرفع صوته بالتكبير حتى استيقظ لصوته النبي صلى الله عليه وسلم فلما استيقظ شكوا إليه الذي أصابهم قال ‏\"‏ لا ضير  أو لا يضير  ارتحلوا ‏\"‏‏.‏ فارتحل فسار غير بعيد ثم نزل، فدعا بالوضوء، فتوضأ ونودي بالصلاة فصلى بالناس، فلما انفتل من صلاته إذا هو برجل معتزل لم يصل مع القوم قال ‏\"‏ ما منعك يا فلان أن تصلي مع القوم ‏\"‏‏.‏ قال أصابتني جنابة ولا ماء‏.‏ قال ‏\"‏ عليك بالصعيد، فإنه يكفيك ‏\"‏‏.‏ ثم سار النبي صلى الله عليه وسلم فاشتكى إليه الناس من العطش فنزل، فدعا فلانا  كان يسميه أبو رجاء نسيه عوف  ودعا عليا فقال ‏\"‏ اذهبا فابتغيا الماء ‏\"‏‏.‏ فانطلقا فتلقيا امرأة بين مزادتين  أو سطيحتين  من ماء على بعير لها، فقالا لها أين الماء قالت عهدي بالماء أمس هذه الساعة، ونفرنا خلوفا‏.‏ قالا لها انطلقي إذا‏.‏ قالت إلى أين قالا إلى رسول الله صلى الله عليه وسلم‏.‏ قالت الذي يقال له الصابئ قالا هو الذي تعنين فانطلقي‏.‏ فجاءا بها إلى النبي صلى الله عليه وسلم وحدثاه الحديث قال فاستنزلوها عن بعيرها ودعا النبي صلى الله عليه وسلم بإناء، ففرغ فيه من أفواه المزادتين  أو السطيحتين  وأوكأ أفواههما، وأطلق العزالي، ونودي في الناس اسقوا واستقوا‏.‏ فسقى من شاء، واستقى من شاء، وكان آخر ذاك أن أعطى الذي أصابته الجنابة إناء من ماء قال ‏\"‏ اذهب، فأفرغه عليك ‏\"‏‏.‏ وهى قائمة تنظر إلى ما يفعل بمائها، وايم الله لقد أقلع عنها، وإنه ليخيل إلينا أنها أشد ملأة منها حين ابتدأ فيها، فقال النبي صلى الله عليه وسلم ‏\"‏ اجمعوا لها ‏\"‏‏.‏ فجمعوا لها من بين عجوة ودقيقة وسويقة، حتى جمعوا لها طعاما، فجعلوها في ثوب، وحملوها على بعيرها، ووضعوا الثوب بين يديها قال لها ‏\"‏ تعلمين ما رزئنا من مائك شيئا، ولكن الله هو الذي أسقانا ‏\"‏‏.‏ فأتت أهلها، وقد احتبست عنهم قالوا ما حبسك يا فلانة قالت العجب، لقيني رجلان فذهبا بي إلى هذا الذي يقال له الصابئ، ففعل كذا وكذا، فوالله إنه لأسحر الناس من بين هذه وهذه‏.‏ وقالت بإصبعيها الوسطى والسبابة، فرفعتهما إلى السماء  تعني السماء والأرض  أو إنه لرسول الله حقا، فكان المسلمون بعد ذلك يغيرون على من حولها من المشركين، ولا يصيبون الصرم الذي هي منه، فقالت يوما لقومها ما أرى أن هؤلاء القوم يدعونكم عمدا، فهل لكم في الإسلام فأطاعوها فدخلوا في الإسلام‏.‏",
      "text_en": " Narrated `Imran:                     Once we were traveling with the Prophet and we carried on traveling till the last part of the night and then we (halted at a place) and slept (deeply). There is nothing sweeter than sleep for a traveler in the last part of the night. So it was only the heat of the sun that made us to wake up and the first to wake up was so and so, then so and so and then so and so (the narrator `Auf said that Abu Raja' had told him their names but he had forgotten them) and the fourth person to wake up was `Umar bin Al- Khattab. And whenever the Prophet used to sleep, nobody would wake up him till he himself used to get up as we did not know what was happening (being revealed) to him in his sleep. So, `Umar got up and saw the condition of the people, and he was a strict man, so he said, \"Allahu Akbar\" and raised his voice with Takbir, and kept on saying loudly till the Prophet got up because of it. When he got up, the people informed him about what had happened to them. He said, \"There is no harm (or it will not be harmful). Depart!\" So they departed from that place, and after covering some distance the Prophet stopped and asked for some water to perform the ablution. So he performed the ablution and the call for the prayer was pronounced and he led the people in prayer. After he finished from the prayer, he saw a man sitting aloof who had not prayed with the people. He asked, \"O so and so! What has prevented you from praying with us?\" He replied, \"I am Junub and there is no water. \" The Prophet said, \"Perform Tayammum with (clean) earth and that is sufficient for you.\" Then the Prophet proceeded on and the people complained to him of thirst. Thereupon he got down and called a person (the narrator `Auf added that Abu Raja' had named him but he had forgotten) and `Ali, and ordered them to go and bring water. So they went in search of water and met a woman who was sitting on her camel between two bags of water. They asked, \"Where can we find water?\" She replied, \"I was there (at the place of water) this hour yesterday and my people are behind me.\" They requested her to accompany them. She asked, \"Where?\" They said, \"To Allah's Apostle .\" She said, \"Do you mean the man who is called the Sabi, (with a new religion)?\" They replied, \"Yes, the same person. So come along.\" They brought her to the Prophet and narrated the whole story. He said, \"Help her to dismount.\" The Prophet asked for a pot, then he opened the mouths of the bags and poured some water into the pot. Then he closed the big openings of the bags and opened the small ones and the people were called upon to drink and water their animals. So they all watered their animals and they (too) all quenched their thirst and also gave water to others and last of all the Prophet gave a pot full of water to the person who was Junub and told him to pour it over his body. The woman was standing and watching all that which they were doing with her water. By Allah, when her water bags were returned the looked like as if they were more full (of water) than they had been before (Miracle of Allah's Apostle) Then the Prophet ordered us to collect something for her; so dates, flour and Sawiq were collected which amounted to a good meal that was put in a piece of cloth. She was helped to ride on her camel and that cloth full of foodstuff was also placed in front of her and then the Prophet said to her, \"We have not taken your water but Allah has given water to us.\" She returned home late. Her relatives asked her: \"O so and so what has delayed you?\" She said, \"A strange thing! Two men met me and took me to the man who is called the Sabi' and he did such and such a thing. By Allah, he is either the greatest magician between this and this (gesturing with her index and middle fingers raising them towards the sky indicating the heaven and the earth) or he is Allah's true Apostle.\" Afterwards the Muslims used to attack the pagans around her abode but never touched her village. One day she said to her people, \"I think that these people leave you purposely. Have you got any inclination to Islam?\" They obeyed her and all of them embraced Islam. Abu `Abdullah said: The word Saba'a means \"The one who has deserted his old religion and embraced a new religion.\" Abul 'Ailya [??] said, \"The S`Abis are a sect of people of the Scripture who recite the Book of Psalms.\"",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا عوف، عن أبي رجاء، قال حدثنا عمران بن حصين الخزاعي، أن رسول الله صلى الله عليه وسلم رأى رجلا معتزلا لم يصل في القوم فقال ‏\"‏ يا فلان ما منعك أن تصلي في القوم ‏\"‏‏.‏ فقال يا رسول الله، أصابتني جنابة ولا ماء‏.‏ قال ‏\"‏ عليك بالصعيد فإنه يكفيك ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain Al-Khuza`i:                     Allah's Apostle saw a person sitting aloof and not praying with the people. He asked him, \"O so and so! What prevented you from offering the prayer with the people?\" He replied, \"O Allah's Apostle! I am Junub and there is no water.\" The Prophet said, \"Perform Tayammum with clean earth and that will be sufficient for you.\"",
      "chain": [
        "30349",
        "20025",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا عوف، عن سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي، فقال له أبي كيف كان رسول الله صلى الله عليه وسلم يصلي المكتوبة فقال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية  ونسيت ما قال في المغرب  وكان يستحب أن يؤخر العشاء التي تدعونها العتمة، وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه، ويقرأ بالستين إلى المائة‏.‏",
      "text_en": " Narrated Saiyar bin Salama:                     I along with my father went to Abu- Barza Al-Aslami and my father asked him, \"How Allah's Apostle used to offer the five compulsory congregational prayers?\" Abu- Barza said, \"The Prophet used to pray the Zuhr prayer which you (people) call the first one at midday when the sun had just declined The `Asr prayer at a time when after the prayer, a man could go to the house at the farthest place in Medina (and arrive) while the sun was still hot. (I forgot about the Maghrib prayer). The Prophet Loved to delay the `Isha which you call Al- `Atama [??] and he disliked sleeping before it and speaking after it. After the Fajr prayer he used to leave when a man could recognize the one sitting beside him and he used to recite between 60 to 100 Ayat (in the Fajr prayer) .",
      "chain": [
        "30118",
        "20025",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "599",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، قال حدثنا عوف، قال حدثنا أبو المنهال، قال انطلقت مع أبي إلى أبي برزة الأسلمي فقال له أبي حدثنا كيف، كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير وهى التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى أهله في أقصى المدينة والشمس حية، ونسيت ما قال في المغرب‏.‏ قال وكان يستحب أن يؤخر العشاء‏.‏ قال وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف أحدنا جليسه، ويقرأ من الستين إلى المائة‏.‏",
      "text_en": " Narrated Abu-l-Minhal:                     My father and I went to Abi Barza Al-Aslami and my father said to him, \"Tell us how Allah's Apostle used to offer the compulsory congregational prayers.\" He said, \"He used to pray the Zuhr prayer, which you call the first prayer, as the sun declined at noon, the `Asr at a time when one of US could go to his family at the farthest place in Medina while the sun was still hot. (The narrator forgot what Abu Barza had said about the Maghrib prayer), and the Prophet preferred to pray the `Isha' late and disliked to sleep before it or talk after it. And he used to return after finishing the morning prayer at such a time when it was possible for one to recognize the person sitting by his side and he (the Prophet) used to recite 60 to 100 'Ayat' (verses) of the Qur'an in it.\"",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "1143",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مؤمل بن هشام، قال حدثنا إسماعيل، قال حدثنا عوف، قال حدثنا أبو رجاء، قال حدثنا سمرة بن جندب  رضى الله عنه  عن النبي صلى الله عليه وسلم في الرؤيا قال ‏\"‏ أما الذي يثلغ رأسه بالحجر فإنه يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     The Prophet said in his narration of a dream that he saw, \"He whose head was being crushed with a stone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا يزيد بن زريع، أخبرنا عوف، عن سعيد بن أبي الحسن، قال كنت عند ابن عباس  رضى الله عنهما  إذ أتاه رجل فقال يا أبا عباس إني إنسان، إنما معيشتي من صنعة يدي، وإني أصنع هذه التصاوير‏.‏ فقال ابن عباس لا أحدثك إلا ما سمعت رسول الله صلى الله عليه وسلم يقول سمعته يقول ‏\"‏ من صور صورة فإن الله معذبه، حتى ينفخ فيها الروح، وليس بنافخ فيها أبدا ‏\"‏‏.‏ فربا الرجل ربوة شديدة واصفر وجهه‏.‏ فقال ويحك إن أبيت إلا أن تصنع، فعليك بهذا الشجر، كل شىء ليس فيه روح‏.‏ قال أبو عبد الله سمع سعيد بن أبي عروبة من النضر بن أنس هذا الواحد‏.‏",
      "text_en": " Narrated Sa`id bin Abu Al-Hasan:                     While I was with Ibn `Abbas a man came and said, \"O father of `Abbas! My sustenance is from my manual profession and I make these pictures.\" Ibn `Abbas said, \"I will tell you only what I heard from Allah's Apostle . I heard him saying, 'Whoever makes a picture will be punished by Allah till he puts life in it, and he will never be able to put life in it.' \" Hearing this, that man heaved a sigh and his face turned pale. Ibn `Abbas said to him, \"What a pity! If you insist on making pictures I advise you to make pictures of trees and any other unanimated objects.\"",
      "chain": [
        "30143",
        "20304",
        "11298",
        "11287"
      ]
    },
    {
      "hadith_no": "2311",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "وقال عثمان بن الهيثم أبو عمرو حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت فجعل يحثو من الطعام، فأخذته، وقلت والله لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال إني محتاج، وعلى عيال، ولي حاجة شديدة‏.‏ قال فخليت عنه فأصبحت فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة ما فعل أسيرك البارحة ‏\"‏‏.‏ قال قلت يا رسول الله شكا حاجة شديدة وعيالا فرحمته، فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فعرفت أنه سيعود لقول رسول الله صلى الله عليه وسلم إنه سيعود‏.‏ فرصدته فجاء يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ قال دعني فإني محتاج، وعلى عيال لا أعود، فرحمته، فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، ما فعل أسيرك ‏\"‏‏.‏ قلت يا رسول الله شكا حاجة شديدة وعيالا، فرحمته فخليت سبيله‏.‏ قال ‏\"‏ أما إنه قد كذبك وسيعود ‏\"‏‏.‏ فرصدته الثالثة فجاء يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم، وهذا آخر ثلاث مرات أنك تزعم لا تعود ثم تعود‏.‏ قال دعني أعلمك كلمات ينفعك الله بها‏.‏ قلت ما هو قال إذا أويت إلى فراشك فاقرأ آية الكرسي ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ حتى تختم الآية، فإنك لن يزال عليك من الله حافظ ولا يقربنك شيطان حتى تصبح‏.‏ فخليت سبيله فأصبحت، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما فعل أسيرك البارحة ‏\"‏‏.‏ قلت يا رسول الله زعم أنه يعلمني كلمات، ينفعني الله بها، فخليت سبيله‏.‏ قال ‏\"‏ ما هي ‏\"‏‏.‏ قلت قال لي إذا أويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم ‏{‏الله لا إله إلا هو الحى القيوم‏}‏ وقال لي لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح، وكانوا أحرص شىء على الخير‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنه قد صدقك وهو كذوب، تعلم من تخاطب منذ ثلاث ليال يا أبا هريرة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ ذاك شيطان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle deputed me to keep Sadaqat (al-Fitr) of Ramadan. A      comer came and started taking handfuls of the foodstuff (of the      Sadaqa) (stealthily). I took hold of him and said, \"By Allah, I will      take you to Allah's Apostle .\" He said, \"I am needy and have many      dependents, and I am in great need.\" I released him, and in the      morning Allah's Apostle asked me, \"What did your prisoner do      yesterday?\" I said, \"O Allah's Apostle! The person complained of being     needy and of having many dependents, so, I pitied him and let him go.\"     Allah's Apostle said, \"Indeed, he told you a lie and he will be coming     again.\" I believed that he would show up again as Allah's Apostle had      told me that he would return. So, I waited for him watchfully. When he     (showed up and) started stealing handfuls of foodstuff, I caught hold      of him again and said, \"I will definitely take you to Allah's Apostle.     He said, \"Leave me, for I am very needy and have many dependents. I      promise I will not come back again.\" I pitied him and let him go.      In the morning Allah's Apostle asked me, \"What did your prisoner do.\"      I replied, \"O Allah's Apostle! He complained of his great need and of      too many dependents, so I took pity on him and set him free.\" Allah's      Apostle said, \"Verily, he told you a lie and he will return.\" I waited     for him attentively for the third time, and when he (came and) started     stealing handfuls of the foodstuff, I caught hold of him and said, \"I      will surely take you to Allah's Apostle as it is the third time you      promise not to return, yet you break your promise and come.\" He said,      \"(Forgive me and) I will teach you some words with which Allah will      benefit you.\" I asked, \"What are they?\" He replied, \"Whenever you go      to bed, recite \"Ayat-al-Kursi\"-- 'Allahu la ilaha illa huwa-l-Haiy-ul      Qaiyum' till you finish the whole verse. (If you do so), Allah will      appoint a guard for you who will stay with you and no satan will come      near you till morning. \" So, I released him. In the morning, Allah's      Apostle asked, \"What did your prisoner do yesterday?\" I replied, \"He      claimed that he would teach me some words by which Allah will benefit      me, so I let him go.\" Allah's Apostle asked, \"What are they?\" I      replied, \"He said to me, 'Whenever you go to bed, recite Ayat-al-Kursi     from the beginning to the end ---- Allahu la ilaha illa      huwa-lHaiy-ul-Qaiyum----.' He further said to me, '(If you do so),      Allah will appoint a guard for you who will stay with you, and no      satan will come near you till morning.' (Abu Huraira or another      sub-narrator) added that they (the companions) were very keen to do      good deeds. The Prophet said, \"He really spoke the truth, although he      is an absolute liar. Do you know whom you were talking to, these three     nights, O Abu Huraira?\" Abu Huraira said, \"No.\" He said, \"It was      Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3275",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وقال عثمان بن الهيثم حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت، فجعل يحثو من الطعام، فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم‏.‏ فذكر الحديث فقال إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال عليك من الله حافظ، ولا يقربك شيطان حتى تصبح‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدقك وهو كذوب، ذاك شيطان ‏\"‏‏.‏",
      "text_en": "    Narrated Muhammad bin Sirin:                      Abu Huraira said, \"Allah's Apostle put me in charge of the Zakat of Ramadan (i.e. Zakat-ul-Fitr). Someone came to me and started scooping some of the foodstuff of (Zakat) with both hands. I caught him and told him that I would take him to Allah's Apostle.\" Then Abu Huraira told the whole narration and added \"He (i.e. the thief) said, 'Whenever you go to your bed, recite the Verse of \"Al-Kursi\" (2.255) for then a guardian from Allah will be guarding you, and Satan will not approach you till dawn.' \" On that the Prophet said, \"He told you the truth, though he is a liar, and he (the thief) himself was the Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الصباح، حدثنا إسحاق الأزرق، حدثنا عوف، عن الحسن، وابن، سيرين عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ غفر لامرأة مومسة مرت بكلب على رأس ركي يلهث، قال كاد يقتله العطش، فنزعت خفها، فأوثقته بخمارها، فنزعت له من الماء، فغفر لها بذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A prostitute was forgiven by Allah, because, passing by a panting dog near a well and seeing that the dog was about to die of thirst, she took off her shoe, and tying it with her head-cover she drew out some water for it. So, Allah forgave her because of that.\"",
      "chain": [
        "30244",
        "20411",
        "11298",
        "11016",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني الليلة آتيان، فأتينا على رجل طويل، لا أكاد أرى رأسه طولا، وإنه إبراهيم صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     Allah's Apostle said, \"Two persons came to me at night (in dream) (and took me along with them). We passed by a tall man who was so tall that I was not able to see his head and that person was Abraham.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن إبراهيم، حدثنا روح بن عبادة، حدثنا عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى كان رجلا حييا ستيرا، لا يرى من جلده شىء، استحياء منه، فآذاه من آذاه من بني إسرائيل، فقالوا ما يستتر هذا التستر إلا من عيب بجلده، إما برص وإما أدرة وإما آفة‏.‏ وإن الله أراد أن يبرئه مما قالوا لموسى فخلا يوما وحده فوضع ثيابه على الحجر ثم اغتسل، فلما فرغ أقبل إلى ثيابه ليأخذها، وإن الحجر عدا بثوبه، فأخذ موسى عصاه وطلب الحجر، فجعل يقول ثوبي حجر، ثوبي حجر، حتى انتهى إلى ملإ من بني إسرائيل، فرأوه عريانا أحسن ما خلق الله، وأبرأه مما يقولون، وقام الحجر فأخذ ثوبه فلبسه، وطفق بالحجر ضربا بعصاه، فوالله إن بالحجر لندبا من أثر ضربه ثلاثا أو أربعا أو خمسا، فذلك قوله ‏{‏يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏‏.‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(The Prophet) Moses was a shy person and used to cover his body completely because of his extensive shyness. One of the children of Israel hurt him by saying, 'He covers his body in this way only because of some defect in his skin, either leprosy or scrotal hernia, or he has some other defect.' Allah wished to clear Moses of what they said about him, so one day while Moses was in seclusion, he took off his clothes and put them on a stone and started taking a bath. When he had finished the bath, he moved towards his clothes so as to take them, but the stone took his clothes and fled; Moses picked up his stick and ran after the stone saying, 'O stone! Give me my garment!' Till he reached a group of Bani Israel who saw him naked then, and found him the best of what Allah had created, and Allah cleared him of what they had accused him of. The stone stopped there and Moses took and put his garment on and started hitting the stone with his stick. By Allah, the stone still has some traces of the hitting, three, four or five marks. This was what Allah refers to in His Saying:-- \"O you who believe! Be you not like those Who annoyed Moses, But Allah proved his innocence of that which they alleged, And he was honorable In Allah's Sight.\" (33.69)",
      "chain": [
        "30123",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "3963",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن بشر، حدثنا روح، حدثنا عوف، عن معاوية بن قرة، قال حدثني أبو بردة بن أبي موسى الأشعري، قال قال لي عبد الله بن عمر هل تدري ما قال أبي لأبيك قال قلت لا‏.‏ قال فإن أبي قال لأبيك يا أبا موسى، هل يسرك إسلامنا مع رسول الله صلى الله عليه وسلم وهجرتنا معه، وجهادنا معه، وعملنا كله معه، برد لنا، وأن كل عمل عملناه بعده نجونا منه كفافا رأسا برأس فقال أبي لا والله، قد جاهدنا بعد رسول الله صلى الله عليه وسلم وصلينا، وصمنا، وعملنا خيرا كثيرا، وأسلم على أيدينا بشر كثير، وإنا لنرجو ذلك‏.‏ فقال أبي لكني أنا والذي نفس عمر بيده لوددت أن ذلك برد لنا، وأن كل شىء عملناه بعد نجونا منه كفافا رأسا برأس‏.‏ فقلت إن أباك والله خير من أبي‏.‏",
      "text_en": " Narrated Abu Burda Bin Abi Musa Al-Ash`ari:                     `Abdullah bin `Umar said to me, \"Do you know what my father said to your father once?\" I said, \"No.\" He said, \"My father said to your father, 'O Abu Musa, will it please you that we will be rewarded for our conversion to Islam with Allah's Apostle and our migration with him, and our Jihad with him and all our good deeds which we did, with him, and that all the deeds we did after his death will be disregarded whether good or bad?' Your father (i.e. Abu Musa) said, 'No, by Allah, we took part in Jihad after Allah's Apostle , prayed and did plenty of good deeds, and many people have embraced Islam at our hands, and no doubt, we expect rewards from Allah for these good deeds.' On that my father (i.e. `Umar) said, 'As for myself, By Him in Whose Hand `Umar's soul is, I wish that the deeds done by us at the time of the Prophet remain rewardable while whatsoever we did after the death of the Prophet be enough to save us from Punishment in that the good deeds compensate for the bad ones.' \" On that I said (to Ibn `Umar), \"By Allah, your father was better than my father!\"",
      "chain": [
        "30483",
        "20229",
        "11298",
        "11306",
        "11901"
      ]
    },
    {
      "hadith_no": "3995",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عوف، عن أبي عثمان، قال سمعت سلمان  رضى الله عنه  يقول أنا من، رام هرمز‏.‏",
      "text_en": " Narrated Salman:                     I am from Ram-Hurmuz (i.e. a Persian town).",
      "chain": [
        "30388",
        "20005",
        "11298",
        "11113"
      ]
    },
    {
      "hadith_no": "4469",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن الحسن، عن أبي بكرة، قال لقد نفعني الله بكلمة سمعتها من، رسول الله صلى الله عليه وسلم أيام الجمل، بعد ما كدت أن ألحق بأصحاب الجمل فأقاتل معهم قال لما بلغ رسول الله صلى الله عليه وسلم أن أهل فارس قد ملكوا عليهم بنت كسرى قال ‏\"‏ لن يفلح قوم ولوا أمرهم امرأة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     During the days (of the battle) of Al-Jamal, Allah benefited me with a word I had heard from Allah's Apostle after I had been about to join the Companions of Al-Jamal (i.e. the camel) and fight along with them. When Allah's Apostle was informed that the Persians had crowned the daughter of Khosrau as their ruler, he said, \"Such people as ruled by a lady will never be successful.\"",
      "chain": [
        "30151",
        "11298",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "4720",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مؤمل  هو ابن هشام  حدثنا إسماعيل بن إبراهيم، وحدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم لنا ‏\"‏ أتاني الليلة آتيان فابتعثاني، فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ فوقعوا فيه ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة قالا لي هذه جنة عدن، وهذاك منزلك قالا أما القوم الذين كانوا شطر منهم حسن وشطر منهم قبيح فإنهم خلطوا عملا صالحا وآخر سيئا تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     Allah's Apostle said, \"Tonight two (visitors) came to me (in my dream) and took me to a town built with gold bricks and silver bricks. There we met men who, half of their bodies, look like the mosthandsome human beings you have ever seen, and the other half, the ugliest human beings you have ever seen. Those two visitors said to those men, 'Go and dip yourselves in that river. So they dipped themselves therein and then came to us, their ugliness having disappeared and they were in the mosthandsome shape. The visitors said, 'The first is the Garden of Eden and that is your dwelling place.' Then they added, 'As for those people who were half ugly and half handsome, they were those who mixed good deeds and bad deeds, but Allah forgave them.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "4847",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا روح بن عبادة، حدثنا عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى كان رجلا حييا، وذلك قوله تعالى ‏{‏يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Moses was a shy man, and that is what the Statement of Allah means: 'O you who believe Be not like those who annoyed Moses, but Allah proved his innocence of that which they alleged and he was honorable in Allah's Sight.' (33.69)",
      "chain": [
        "30123",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "4898",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن موسى القطان، حدثنا أبو سفيان الحميري، سعيد بن يحيى بن مهدي حدثنا عوف، عن محمد، عن أبي هريرة، رفعه وأكثر ما كان يوقفه أبو سفيان ‏\"‏ يقال لجهنم هل امتلأت وتقول هل من مزيد فيضع الرب تبارك وتعالى قدمه عليها فتقول قط قط ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     (that the Prophet said) \"It will be said to the Hell, 'Are you filled?' It will say, 'Are there any more (to come)?' On that Allah will put His Foot on it, and it will say 'Qati! Qati! (Enough! Enough!).",
      "chain": [
        "30385",
        "20425",
        "11298",
        "11035"
      ]
    },
    {
      "hadith_no": "5062",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال عثمان بن الهيثم حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان فأتاني آت فجعل يحثو من الطعام فأخذته فقلت لأرفعنك إلى رسول الله صلى الله عليه وسلم فقص الحديث فقال إذا أويت إلى فراشك فاقرأ آية الكرسي لن يزال معك من الله حافظ ولا يقربك شيطان حتى تصبح‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ صدقك وهو كذوب ذاك شيطان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                      Allah 's Apostle ordered me to guard the Zakat revenue of Ramadan. Then somebody came to me and started stealing of the foodstuff. I caught him and said, \"I will take you to Allah's Apostle!\" Then Abu Huraira described the whole narration and said:) That person said (to me), \"(Please don't take me to Allah's Apostle and I will tell you a few words by which Allah will benefit you.) When you go to your bed, recite Ayat-al-Kursi, (2.255) for then there will be a guard from Allah who will protect you all night long, and Satan will not be able to come near you till dawn.\" (When the Prophet heard the story) he said (to me), \"He (who came to you at night) told you the truth although he is a liar; and it was Satan.\"",
      "chain": [
        "30151",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5253",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن أبي رجاء، عن عمران، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار، فرأيت أكثر أهلها النساء ‏\"‏‏.‏ تابعه أيوب وسلم بن زرير‏.‏",
      "text_en": " Narrated `Imran:                     The Prophet said, \"I looked at Paradise and saw that the majority of its residents were the poor; and I looked at the (Hell) Fire and saw that the majority of its residents were women.\"",
      "chain": [
        "30151",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "6626",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن أبي رجاء، عن عمران، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated `Imran:                     The Prophet said, \"I looked into paradise and saw that the majority of its people were the poor, and I looked into the Fire and found that the majority of its people were women.\"",
      "chain": [
        "30151",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "6750",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني يوسف بن موسى، حدثنا أبو أسامة، قال حدثني عوف، عن خلاس، ومحمد، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل ناسيا وهو صائم فليتم صومه، فإنما أطعمه الله وسقاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody eats something forgetfully while he is fasting, then he should complete his fast, for Allah has made him eat and drink.\"",
      "chain": [
        "30224",
        "20318",
        "11298",
        "11283",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "7103",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر، سمعت عوفا، حدثنا محمد بن سيرين، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا اقترب الزمان لم تكد تكذب رؤيا المؤمن، ورؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة‏.‏ ‏\"‏ قال محمد وأنا أقول هذه قال وكان يقال الرؤيا ثلاث حديث النفس، وتخويف الشيطان، وبشرى من الله، فمن رأى شيئا يكرهه فلا يقصه على أحد، وليقم فليصل‏.‏ قال وكان يكره الغل في النوم، وكان يعجبهم القيد، ويقال القيد ثبات في الدين‏.‏ وروى قتادة ويونس وهشام وأبو هلال عن ابن سيرين عن أبي هريرة عن النبي صلى الله عليه وسلم وأدرجه بعضهم كله في الحديث، وحديث عوف أبين‏.‏ وقال يونس لا أحسبه إلا عن النبي صلى الله عليه وسلم في القيد‏.‏ قال أبو عبد الله لا تكون الأغلال إلا في الأعناق‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Day of Resurrection approaches, the dreams of a believer will hardly fail to come true, and a dream of a believer is one of forty-six parts of prophetism, and whatever belongs to prothetism can never be false.\" Muhammad bin Seereen said, \"But I say this.\" He said, \"It used to be said, 'There are three types of dreams: The reflection of one's thoughts and experiences one has during wakefulness, what is suggested by Satan to frighten the dreamer, or glad tidings from Allah. So, if someone has a dream which he dislikes, he should not tell it to others, but get up and offer a prayer.\" He added, \"He (Abu Huraira) hated to see a Ghul (i.e., iron collar around his neck in a dream) and people liked to see fetters (on their feet in a dream). The fetters on the feet symbolizes one's constant and firm adherence to religion.\" And Abu `Abdullah said, \"Ghuls (iron collars) are used only for necks.\"",
      "chain": [
        "30142",
        "20288",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "7134",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني مؤمل بن هشام أبو هشام، حدثنا إسماعيل بن إبراهيم، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم مما يكثر أن يقول لأصحابه ‏\"‏ هل رأى أحد منكم من رؤيا ‏\"‏‏.‏ قال فيقص عليه من شاء الله أن يقص، وإنه قال ذات غداة ‏\"‏ إنه أتاني الليلة آتيان، وإنهما ابتعثاني، وإنهما قالا لي انطلق‏.‏ وإني انطلقت معهما، وإنا أتينا على رجل مضطجع، وإذا آخر قائم عليه بصخرة، وإذا هو يهوي بالصخرة لرأسه، فيثلغ رأسه فيتهدهد الحجر ها هنا، فيتبع الحجر فيأخذه، فلا يرجع إليه حتى يصح رأسه كما كان، ثم يعود عليه، فيفعل به مثل ما فعل المرة الأولى‏.‏ قال قلت لهما سبحان الله ما هذان قال قالا لي انطلق  قال  فانطلقنا فأتينا على رجل مستلق لقفاه، وإذا آخر قائم عليه بكلوب من حديد، وإذا هو يأتي أحد شقى وجهه فيشرشر شدقه إلى قفاه، ومنخره إلى قفاه وعينه إلى قفاه  قال وربما قال أبو رجاء فيشق  قال ثم يتحول إلى الجانب الآخر، فيفعل به مثل ما فعل بالجانب الأول، فما يفرغ من ذلك الجانب حتى يصح ذلك الجانب كما كان، ثم يعود عليه فيفعل مثل ما فعل المرة الأولى‏.‏ قال قلت سبحان الله ما هذان قال قالا لي انطلق‏.‏ فانطلقنا فأتينا على مثل التنور  قال فأحسب أنه كان يقول  فإذا فيه لغط وأصوات  قال  فاطلعنا فيه، فإذا فيه رجال ونساء عراة، وإذا هم يأتيهم لهب من أسفل منهم، فإذا أتاهم ذلك اللهب ضوضوا  قال  قلت لهما ما هؤلاء قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على نهر  حسبت أنه كان يقول  أحمر مثل الدم، وإذا في النهر رجل سابح يسبح، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة، وإذا ذلك السابح يسبح ما يسبح، ثم يأتي ذلك الذي قد جمع عنده الحجارة فيفغر له فاه فيلقمه حجرا فينطلق يسبح، ثم يرجع إليه، كلما رجع إليه فغر له فاه فألقمه حجرا  قال  قلت لهما ما هذان قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على رجل كريه المرآة كأكره ما أنت راء رجلا مرآة، وإذا عنده نار يحشها ويسعى حولها  قال  قلت لهما ما هذا قال قالا لي انطلق انطلق‏.‏ فانطلقنا فأتينا على روضة معتمة فيها من كل نور الربيع، وإذا بين ظهرى الروضة رجل طويل لا أكاد أرى رأسه طولا في السماء، وإذا حول الرجل من أكثر ولدان رأيتهم قط  قال  قلت لهما ما هذا ما هؤلاء قال قالا لي انطلق انطلق‏.‏  قال  فانطلقنا فانتهينا إلى روضة عظيمة لم أر روضة قط أعظم منها ولا أحسن‏.‏  قال  قالا لي ارق فيها‏.‏ قال فارتقينا فيها فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فأتينا باب المدينة فاستفتحنا ففتح لنا، فدخلناها فتلقانا فيها رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء  قال  قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ قال وإذا نهر معترض يجري كأن ماءه المحض في البياض، فذهبوا فوقعوا فيه، ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة  قال  قالا لي هذه جنة عدن، وهذاك منزلك‏.‏ قال فسما بصري صعدا، فإذا قصر مثل الربابة البيضاء  قال  قالا هذاك منزلك‏.‏ قال قلت لهما بارك الله فيكما، ذراني فأدخله‏.‏ قالا أما الآن فلا وأنت داخله‏.‏ قال قلت لهما فإني قد رأيت منذ الليلة عجبا، فما هذا الذي رأيت قال قالا لي أما إنا سنخبرك، أما الرجل الأول الذي أتيت عليه يثلغ رأسه بالحجر، فإنه الرجل يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة، وأما الرجل الذي أتيت عليه يشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، فإنه الرجل يغدو من بيته فيكذب الكذبة تبلغ الآفاق، وأما الرجال والنساء العراة الذين في مثل بناء التنور فإنهم الزناة والزواني‏.‏ وأما الرجل الذي أتيت عليه يسبح في النهر ويلقم الحجر، فإنه آكل الربا، وأما الرجل الكريه المرآة الذي عند النار يحشها ويسعى حولها، فإنه مالك خازن جهنم، وأما الرجل الطويل الذي في الروضة فإنه إبراهيم صلى الله عليه وسلم وأما الولدان الذين حوله فكل مولود مات على الفطرة ‏\"‏‏.‏ قال فقال بعض المسلمين يا رسول الله وأولاد المشركين فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأولاد المشركين‏.‏ وأما القوم الذين كانوا شطر منهم حسنا وشطر منهم قبيحا، فإنهم قوم خلطوا عملا صالحا وآخر سيئا، تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     Allah's Apostle very often used to ask his companions, \"Did anyone of you see a dream?\" So dreams would be narrated to him by those whom Allah wished to tell. One morning the Prophet said, \"Last night two persons came to me (in a dream) and woke me up and said to me, 'Proceed!' I set out with them and we came across a man Lying down, and behold, another man was standing over his head, holding a big rock. Behold, he was throwing the rock at the man's head, injuring it. The rock rolled away and the thrower followed it and took it back. By the time he reached the man, his head returned to the normal state. The thrower then did the same as he had done before. I said to my two companions, 'Subhan Allah! Who are these two persons?' They said, 'Proceed!' So we proceeded and came to a man Lying flat on his back and another man standing over his head with an iron hook, and behold, he would put the hook in one side of the man's mouth and tear off that side of his face to the back (of the neck) and similarly tear his nose from front to back and his eye from front to back. Then he turned to the other side of the man's face and did just as he had done with the other side. He hardly completed this side when the other side returned to its normal state. Then he returned to it to repeat what he had done before. I said to my two companions, 'Subhan Allah! Who are these two persons?' They said to me, 'Proceed!' So we proceeded and came across something like a Tannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I think the Prophet said, \"In that oven t here was much noise and voices.\" The Prophet added, \"We looked into it and found naked men and women, and behold, a flame of fire was reaching to them from underneath, and when it reached them, they cried loudly. I asked them, 'Who are these?' They said to me, 'Proceed!' And so we proceeded and came across a river.\" I think he said, \".... red like blood.\" The Prophet added, \"And behold, in the river there was a man swimming, and on the bank there was a man who had collected many stones. Behold. while the other man was swimming, he went near him. The former opened his mouth and the latter (on the bank) threw a stone into his mouth whereupon he went swimming again. He returned and every time the performance was repeated. I asked my two companions, 'Who are these (two) persons?' They replied, 'Proceed! Proceed!' And we proceeded till we came to a man with a repulsive appearance, the most repulsive appearance, you ever saw a man having! Beside him there was a fire and he was kindling it and running around it. I asked my companions, 'Who is this (man)?' They said to me, 'Proceed! Proceed!' So we proceeded till we reached a garden of deep green dense vegetation, having all sorts of spring colors. In the midst of the garden there was a very tall man and I could hardly see his head because of his great height, and around him there were children in such a large number as I have never seen. I said to my companions, 'Who is this?' They replied, 'Proceed! Proceed!' So we proceeded till we came to a majestic huge garden, greater and better than I have ever seen! My two companions said to me, 'Go up and I went up' The Prophet added, \"So we ascended till we reached a city built of gold and silver bricks and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened and we entered the city and found in it, men with one side of their bodies as handsome as the handsomest person you have ever seen, and the other side as ugly as the ugliest person you have ever seen. My two companions ordered those men to throw themselves into the river. Behold, there was a river flowing across (the city), and its water was like milk in whiteness. Those men went and threw themselves in it and then returned to us after the ugliness (of their bodies) had disappeared and they became in the best shape.\" The Prophet further added, \"My two companions (angels) said to me, 'This place is the Eden Paradise, and that is your place.' I raised up my sight, and behold, there I saw a palace like a white cloud! My two companions said to me, 'That (palace) is your place.' I said to them, 'May Allah bless you both! Let me enter it.' They replied, 'As for now, you will not enter it, but you shall enter it (one day) I said to them, 'I have seen many wonders tonight. What does all that mean which I have seen?' They replied, 'We will inform you: As for the first man you came upon whose head was being injured with the rock, he is the symbol of the one who studies the Qur'an and then neither recites it nor acts on its orders, and sleeps, neglecting the enjoined prayers. As for the man you came upon whose sides of mouth, nostrils and eyes were torn off from front to back, he is the symbol of the man who goes out of his house in the morning and tells so many lies that it spreads all over the world. And those naked men and women whom you saw in a construction resembling an oven, they are the adulterers and the adulteresses. And the man whom you saw swimming in the river and given a stone to swallow, is the eater of usury (Riba). aand the bad looking man whom you saw near the fire kindling it and going round it, is Malik, the gatekeeper of Hell. And the tall man whom you saw in the garden, is Abraham and the children around him are those children who die with Al-Fitra (the Islamic Faith). The narrator added: Some Muslims asked the Prophet, \"O Allah's Apostle! What about the children of pagans?\" The Prophet replied, \"And also the children of pagans.\" The Prophet added, \"My two companions added, 'The men you saw half handsome and half ugly were those persons who had mixed an act that was good with another that was bad, but Allah forgave them.'\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "7188",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن الحسن، عن أبي بكرة، قال لقد نفعني الله بكلمة أيام الجمل لما بلغ النبي صلى الله عليه وسلم أن فارسا ملكوا ابنة كسرى قال ‏\"‏ لن يفلح قوم ولوا أمرهم امرأة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     During the battle of Al-Jamal, Allah benefited me with a Word (I heard from the Prophet). When the Prophet heard the news that the people of the Persia had made the daughter of Khosrau their Queen (ruler), he said, \"Never will succeed such a nation as makes a woman their ruler.\"",
      "chain": [
        "30151",
        "11298",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "7197",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن عوف، عن أبي المنهال، قال لما كان ابن زياد ومروان بالشأم، ووثب ابن الزبير بمكة، ووثب القراء بالبصرة، فانطلقت مع أبي إلى أبي برزة الأسلمي حتى دخلنا عليه في داره وهو جالس في ظل علية له من قصب، فجلسنا إليه فأنشأ أبي يستطعمه الحديث فقال يا أبا برزة ألا ترى ما وقع فيه الناس فأول شىء سمعته تكلم به إني احتسبت عند الله أني أصبحت ساخطا على أحياء قريش، إنكم يا معشر العرب كنتم على الحال الذي علمتم من الذلة والقلة والضلالة، وإن الله أنقذكم بالإسلام وبمحمد صلى الله عليه وسلم حتى بلغ بكم ما ترون، وهذه الدنيا التي أفسدت بينكم، إن ذاك الذي بالشأم والله إن يقاتل إلا على الدنيا‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and Qurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we entered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with him and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the people has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of being angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in misery and were few in number and misguided, and that Allah has brought you out of all that with Islam and with Muhammad till He brought you to this state (of prosperity and happiness) which you see now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. The one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: and those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that one who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly gain.\"",
      "chain": [
        "30184",
        "11613",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "7357",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر، قال سمعت عوفا، أن أبا المنهال، حدثه أنه، سمع أبا برزة، قال إن الله يغنيكم أو نغشكم بالإسلام وبمحمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abal Minhal:                     Abu Barza said, \"(O people!) Allah makes you self-sufficient or has raised you high with Islam and with Muhammad",
      "chain": [
        "30142",
        "20288",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "786",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "أخبرنا عمرو بن عون، أخبرنا هشيم، عن عوف، عن يزيد الفارسي، قال سمعت ابن عباس، قال قلت لعثمان بن عفان ما حملكم أن عمدتم، إلى براءة وهي من المئين وإلى الأنفال وهي من المثاني فجعلتموهما في السبع الطول ولم تكتبوا بينهما سطر ‏{‏ بسم الله الرحمن الرحيم ‏}‏ قال عثمان كان النبي صلى الله عليه وسلم مما ينزل عليه الآيات فيدعو بعض من كان يكتب له ويقول له ‏\"‏ ضع هذه الآية في السورة التي يذكر فيها كذا وكذا ‏\"‏ ‏.‏ وتنزل عليه الآية والآيتان فيقول مثل ذلك وكانت الأنفال من أول ما أنزل عليه بالمدينة وكانت براءة من آخر ما نزل من القرآن وكانت قصتها شبيهة بقصتها فظننت أنها منها فمن هناك وضعتهما في السبع الطول ولم أكتب بينهما سطر ‏{‏ بسم الله الرحمن الرحيم ‏}‏ ‏.‏",
      "text_en": " Narrated Uthman ibn Affan:                     :Yazid al-Farisi said: I heard Ibn Abbas say: I asked Uthman ibn Affan: What moved you to put the (Surah) al-Bara'ah which belongs to the mi'in (surahs) (containing one hundred verses) and the (Surah) al-Anfal which belongs to the mathani (Surahs) in the category of as-sab'u at-tiwal (the first long surah or chapters of the Qur'an), and you did not write \"In the name of Allah, the Compassionate, the Merciful\" between them?  Uthman replied: When the verses of the Qur'an were revealed to the Prophet (ﷺ), he called someone to write them down for him and said to him: Put this verse in the surah in which such and such has been mentioned; and when one or two verses were revealed, he used to say similarly (regarding them). (Surah) al-Anfal is the first surah that was revealed at Medina, and (Surah) al-Bara'ah was revealed last in the Qur'an, and its contents were similar to those of al-Anfal. I, therefore, thought that it was a part of al-Anfal. Hence I put them in the category of as-sab'u at-tiwal (the seven lengthy surahs), and I did not write \"In the name of Allah, the Compassionate, the Merciful\" between them.",
      "chain": [
        "30154",
        "20468",
        "11298",
        "14432",
        "17",
        "4"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا مروان، - يعني ابن معاوية - أخبرنا عوف الأعرابي، عن يزيد الفارسي، حدثنا ابن عباس، بمعناه قال فيه فقبض رسول الله صلى الله عليه وسلم ولم يبين لنا أنها منها ‏.‏ قال أبو داود قال الشعبي وأبو مالك وقتادة وثابت بن عمارة إن النبي صلى الله عليه وسلم لم يكتب ‏{‏ بسم الله الرحمن الرحيم ‏}‏ حتى نزلت سورة النمل هذا معناه ‏.‏",
      "text_en": " The above mentioned tradition has been reported by ibn abbas through a different chain of narrators to the same effect. This version adds:                      The apostle of Allah (ﷺ) died, but he did not mention to us that surah al baraah ins a part of al-anfal.Abu Dawood said: Al-sha’bl, Abu Malik, Qatadah, and Thabit b. ‘Umarah said: The prophet( may peace be upon him) did not write”In the name of Allah, the compassionate, the merciful” until Surah al-naml was revealed. This is the meaning of what they said. Further, this is a mursal traditional(omitting the name of the companion)",
      "chain": [
        "30249",
        "20201",
        "11298",
        "14432"
      ]
    },
    {
      "hadith_no": "2521",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا عوف، حدثتنا حسناء بنت معاوية الصريمية، قالت حدثنا عمي، قال قلت للنبي صلى الله عليه وسلم ‏:‏ من في الجنة قال ‏:‏ ‏\"‏ النبي في الجنة، والشهيد في الجنة، والمولود في الجنة، والوئيد في الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Hasana' daughter of Mu'awiyah:                     She reported on the authority of her paternal uncle: I asked the Prophet (ﷺ): Who are in Paradise? He replied: Prophets are in Paradise, martyrs are in Paradise, infants are in Paradise and children buried alive are in Paradise.",
      "chain": [
        "30175",
        "20304",
        "11298"
      ]
    },
    {
      "hadith_no": "2820",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن عوف، عن أبي ريحانة، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن أكل معاقرة الأعراب ‏.‏ قال أبو داود اسم أبي ريحانة عبد الله بن مطر وغندر أوقفه على ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) forbade to eat (the meat of animals) slaughtered by the bedouins for vainglory and pride.Abu Dawud said: The narrator Ghundar narrated this tradition as a saying of Ibn 'Abbas (and not of the Prophet).",
      "chain": [
        "30524",
        "20224",
        "11298",
        "10696",
        "17"
      ]
    },
    {
      "hadith_no": "3248",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحلفوا بآبائكم ولا بأمهاتكم ولا بالأنداد ولا تحلفوا إلا بالله ولا تحلفوا بالله إلا وأنتم صادقون ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Do not swear by your fathers, or by your mothers, or by rivals to Allah; and swear by Allah only, and swear by Allah only when you are speaking the truth.",
      "chain": [
        "30150",
        "20286",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن عوف، عن أبي القموص، زيد بن علي حدثني رجل، كان من الوفد الذين وفدوا إلى النبي صلى الله عليه وسلم من عبد القيس يحسب عوف أن اسمه قيس بن النعمان فقال ‏\"‏ لا تشربوا في نقير ولا مزفت ولا دباء ولا حنتم واشربوا في الجلد الموكإ عليه فإن اشتد فاكسروه بالماء فإن أعياكم فأهريقوه ‏\"‏ ‏.‏",
      "text_en": " A man of the deputation of 'Abd al-Qais who came to the Prophet (ﷺ) said - the narrator 'Awf thinks that his name was Qais bin al-Nu'man:                      The Prophet (ﷺ) said: Do not drink from hollowed stumps, vessel smeared with pitch, pumpkins, and green jars, but drink from a skin which is tied with string. If the drink ferments, lighten it by infusing water. If you are helpless, then pour it away.",
      "chain": [
        "30569",
        "20423",
        "11298"
      ]
    },
    {
      "hadith_no": "3907",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا عوف، حدثنا حيان، - قال غير مسدد حيان بن العلاء - حدثنا قطن بن قبيصة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العيافة والطيرة والطرق من الجبت ‏\"‏ ‏.‏ الطرق الزجر والعيافة الخط ‏.‏",
      "text_en": " Narrated Qabisah:                     I heard the Messenger of Allah (ﷺ) say: Augury from the flight of birds, taking evil omens and the practice of pressomancy pertain to divination. Tarq: It is used in the sense of divination in which women threw stones. 'Iyafah: It means geomancy by drawing lines.",
      "chain": [
        "30175",
        "20031",
        "11298"
      ]
    },
    {
      "hadith_no": "4499",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة الجشمي، حدثنا يحيى بن سعيد، عن عوف، حدثنا حمزة أبو عمر العائذي، حدثني علقمة بن وائل، حدثني وائل بن حجر، قال كنت عند النبي صلى الله عليه وسلم إذ جيء برجل قاتل في عنقه النسعة قال فدعا ولي المقتول فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ولى قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما كان في الرابعة قال ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبه ‏\"‏ ‏.‏ قال فعفا عنه ‏.‏ قال فأنا رأيته يجر النسعة ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I was with the Prophet (ﷺ) when a man who was a murderer and had a strap round his neck was brought to him.  He then called the legal guardian of the victim and asked him: Do you forgive him?  He said: No.  He asked: Will you accept the blood-money?  He said: No.  He asked: Will you kill him?  He said: Yes.  He said: Take him. When he turned his back, he said: Do you forgive him?  He said: No.  He said: Will you accept the blood-money?  He said: No.  He said: Will you kill him?  He said: Yes.  He said: Take him. After repeating all this a fourth time, he said: If you forgive him, he will bear the burden of his own sin and the sin of the victim. He then forgave him.  He (the narrator) said: I saw him pulling the strap.",
      "chain": [
        "20031",
        "11298",
        "10801",
        "3045"
      ]
    },
    {
      "hadith_no": "4641",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أبو ظفر عبد السلام، حدثنا جعفر، عن عوف، قال سمعت الحجاج، يخطب وهو يقول إن مثل عثمان عند الله كمثل عيسى ابن مريم ثم قرأ هذه الآية يقرؤها ويفسرها ‏{‏ إذ قال الله يا عيسى إني متوفيك ورافعك إلى ومطهرك من الذين كفروا ‏}‏ يشير إلينا بيده وإلى أهل الشام ‏.‏",
      "text_en": " ‘Awf said:                      I heard al-Hajjaj addressing the people say: The similitude of ‘Uthman with Allah is like the similitude of Jesus son of Mary. He then recited the following verse and explained it: “Behold! Allah said: O Jesus! I will take thee and raise thee to Myself and clear thee (of the falsehood) of those who blaspheme.” He was making a sign with his hand to us and to the people of Syria.",
      "chain": [
        "11407",
        "11298"
      ]
    },
    {
      "hadith_no": "4693",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، أن يزيد بن زريع، ويحيى بن سعيد، حدثاهم قالا، حدثنا عوف، قال حدثنا قسامة بن زهير، قال حدثنا أبو موسى الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله خلق آدم من قبضة قبضها من جميع الأرض فجاء بنو آدم على قدر الأرض جاء منهم الأحمر والأبيض والأسود وبين ذلك والسهل والحزن والخبيث والطيب ‏\"‏ ‏.‏ زاد في حديث يحيى ‏\"‏ وبين ذلك ‏\"‏ ‏.‏ والإخبار في حديث يزيد ‏.‏",
      "text_en": " Abu Musa al-Ash’ari reported the Messenger of Allah (May peace be upon him) as saying :                      Allah created Adam from a handful which he took from the whole of the earth ; so the children of Adam are in accordance with the earth : some red, some white, some black, some a mixture, also smooth and rough, bad and good.",
      "chain": [
        "30175",
        "20304",
        "20031",
        "11298",
        "14326",
        "41"
      ]
    },
    {
      "hadith_no": "4843",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن إبراهيم الصواف، حدثنا عبد الله بن حمران، أخبرنا عوف بن أبي جميلة، عن زياد بن مخراق، عن أبي كنانة، عن أبي موسى الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من إجلال الله إكرام ذي الشيبة المسلم وحامل القرآن غير الغالي فيه والجافي عنه وإكرام ذي السلطان المقسط ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     The Prophet (ﷺ) said: Glorifying Allah involves showing honour to a grey-haired Muslim and to one who can expound the Qur'an, but not to one who acts extravagantly regarding it, or turns away from it, and showing honour to a just ruler.",
      "chain": [
        "30123",
        "20554",
        "11298",
        "14134",
        "19357",
        "41"
      ]
    },
    {
      "hadith_no": "4849",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عوف، قال حدثني أبو المنهال، عن أبي برزة، قال كان رسول الله صلى الله عليه وسلم ينهى عن النوم قبلها والحديث بعدها ‏.‏",
      "text_en": " ABU BARZAH SAID:                      THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) FORBADE SLEEPING BEFORE THE NIGHT PRAYER AND TALKING AFTER IT.",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "5122",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عوف، عن زياد بن مخراق، عن أبي كنانة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ابن أخت القوم منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported the Messenger of Allah (May peace be upon him) as saying:                      the son of a sister of a people belongs to them.",
      "chain": [
        "30201",
        "20318",
        "11298",
        "14134",
        "41"
      ]
    },
    {
      "hadith_no": "5195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا جعفر بن سليمان، عن عوف، عن أبي رجاء، عن عمران بن حصين، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال السلام عليكم ‏.‏ فرد عليه السلام ثم جلس فقال النبي صلى الله عليه وسلم ‏\"‏ عشر ‏\"‏ ‏.‏ ثم جاء آخر فقال السلام عليكم ورحمة الله ‏.‏ فرد عليه فجلس فقال ‏\"‏ عشرون ‏\"‏ ‏.‏ ثم جاء آخر فقال السلام عليكم ورحمة الله وبركاته ‏.‏ فرد عليه فجلس فقال ‏\"‏ ثلاثون ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     A man came to the Prophet (ﷺ) and said: Peace be upon you! He responded to his salutation. He then sat down. The Prophet (ﷺ) said: Ten. Another man came and said: Peace and Allah's mercy be upon you! He responded to his salutation when he sat down. He said: Twenty. Another man came and said: Peace and Allah's mercy and blessings be upon you! He responded to him and said when he sat down: and blessings be upon you! He responded to him and said when he sat down: Thirty.",
      "chain": [
        "28531",
        "20532",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا عوف، قال أحمد وحدثنا عباد بن عباد، هو المهلبي وإسماعيل ابن علية جميعا عن عوف، عن سيار بن سلامة، هو أبو المنهال الرياحي عن أبي برزة، قال كان النبي صلى الله عليه وسلم يكره النوم قبل العشاء والحديث بعدها ‏.‏ قال وفي الباب عن عائشة وعبد الله بن مسعود وأنس ‏.‏ قال أبو عيسى حديث أبي برزة حديث حسن صحيح ‏.‏ وقد كره أكثر أهل العلم النوم قبل صلاة العشاء والحديث بعدها ورخص في ذلك بعضهم ‏.‏ وقال عبد الله بن المبارك أكثر الأحاديث على الكراهية ‏.‏ ورخص بعضهم في النوم قبل صلاة العشاء في رمضان ‏.‏ وسيار بن سلامة هو أبو المنهال الرياحي ‏.‏",
      "text_en": " Abu Barzah narrated:                     \"The Prophet would dislike to sleep before Isha and to talk after it.\"",
      "chain": [
        "30242",
        "20468",
        "11298",
        "30007",
        "20243",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو أسامة، عن عوف، عن ابن سيرين، وخلاس، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله أو نحوه ‏.‏ قال وفي الباب عن أبي سعيد وأم إسحاق الغنوية ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال مالك بن أنس إذا أكل في رمضان ناسيا فعليه القضاء ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     (Another chain) with the same or similar (Hadith as no. 721).",
      "chain": [
        "30200",
        "20318",
        "11298",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الأعلى بن واصل، حدثنا محمد بن القاسم الأسدي، حدثنا الفضل بن دلهم، حدثنا عوف، عن شهر بن حوشب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعلموا القرآن والفرائض وعلموا الناس فإني مقبوض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث فيه اضطراب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(S.A.W) said:                     \"Learn the laws of inheritance and the Quran, and teach the people, for I am a mortal.\"",
      "chain": [
        "25275",
        "24365",
        "11298",
        "11044",
        "13"
      ]
    },
    {
      "hadith_no": "2235",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "وروى أبو أسامة، هذا الحديث عن عوف، عن رجل، عن سليمان بن جابر، عن ابن مسعود، عن النبي صلى الله عليه وسلم ‏.‏ حدثنا بذلك الحسين بن حريث، أخبرنا أبو أسامة، عن عوف، بهذا بمعناه ‏.‏ ومحمد بن القاسم الأسدي قد ضعفه أحمد بن حنبل وغيره ‏.‏",
      "text_en": "",
      "chain": [
        "11298",
        "16"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، ومحمد بن جعفر، وعبد الوهاب الثقفي، قالوا حدثنا عوف، هو ابن أبي جميلة عن أبي رجاء العطاردي، عن عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اطلعت في النار فرأيت أكثر أهلها النساء واطلعت في الجنة فرأيت أكثر أهلها الفقراء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهكذا يقول عوف عن أبي رجاء عن عمران بن حصين ويقول أيوب عن أبي رجاء عن ابن عباس وكلا الإسنادين ليس فيهما مقال ويحتمل أن يكون أبو رجاء سمع منهما جميعا وقد روى غير عوف أيضا هذا الحديث عن أبي رجاء عن عمران بن حصين ‏.‏",
      "text_en": " 'Imran bin Husain narrated that the Messenger Of Allah (s.a.w) said:                     \" I looked into the Fire and I saw that most of its people are women, and I looked into Paradise and I saw that most of its people were the poor.\"",
      "chain": [
        "30160",
        "20276",
        "20173",
        "20259",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "2684",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو كريب، حدثنا خلف بن أيوب العامري، عن عوف، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خصلتان لا تجتمعان في منافق حسن سمت ولا فقه في الدين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ ولا نعرف هذا الحديث من حديث عوف إلا من حديث هذا الشيخ خلف بن أيوب العامري ولم أر أحدا يروي عنه غير أبي كريب محمد بن العلاء ولا أدري كيف هو",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Two things will not be together in a hypocrite: Good manners, and Fiqh in the religion.\"",
      "chain": [
        "30216",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2689",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، والحسين بن محمد الحريري، بلخي قالا حدثنا محمد بن كثير، عن جعفر بن سليمان الضبعي، عن عوف، عن أبي رجاء، عن عمران بن حصين، أن رجلا، جاء إلى النبي صلى الله عليه وسلم فقال السلام عليكم ‏.‏ قال قال النبي صلى الله عليه وسلم ‏\"‏ عشر ‏\"‏ ‏.‏ ثم جاء آخر فقال السلام عليكم ورحمة الله فقال النبي صلى الله عليه وسلم ‏\"‏ عشرون ‏\"‏ ‏.‏ ثم جاء آخر فقال السلام عليكم ورحمة الله وبركاته فقال النبي صلى الله عليه وسلم ‏\"‏ ثلاثون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وفي الباب عن علي وأبي سعيد وسهل بن حنيف ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     \"A man came to the Prophet (ﷺ) and said: 'As-Salamu 'Alaykum (Peace be upon you).'\" [He said:] \"So the Prophet (ﷺ) said: 'Ten.' Then another came and he said: 'As-Salamu 'Alaykum Wa Rahmatullah (Peace be upon you, and the mercy of Allah).' So the Prophet (ﷺ) said: 'Twenty.' Then another came and said: 'As-Salamu 'Alaykum Wa Rahmatullahi Wa Barakatuh (Peace be upon you, and the mercy of Allah, and His Blessings).' So the Prophet (ﷺ) said: 'Thirty.'\"",
      "chain": [
        "30025",
        "28531",
        "20532",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "3366",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وابن أبي عدي، وسهل بن يوسف، قالوا حدثنا عوف بن أبي جميلة، حدثنا يزيد الفارسي، حدثنا ابن عباس، قال قلت لعثمان بن عفان ما حملكم أن عمدتم، إلى الأنفال وهي من المثاني وإلى براءة وهي من المئين فقرنتم بينهما ولم تكتبوا بينهما سطر بسم الله الرحمن الرحيم ووضعتموهما في السبع الطول ما حملكم على ذلك فقال عثمان كان رسول الله صلى الله عليه وسلم مما يأتي عليه الزمان وهو تنزل عليه السور ذوات العدد فكان إذا نزل عليه الشىء دعا بعض من كان يكتب فيقول ضعوا هؤلاء الآيات في السورة التي يذكر فيها كذا وكذا وإذا نزلت عليه الآية فيقول ضعوا هذه الآية في السورة التي يذكر فيها كذا وكذا وكانت الأنفال من أوائل ما أنزلت بالمدينة وكانت براءة من آخر القرآن وكانت قصتها شبيهة بقصتها فظننت أنها منها فقبض رسول الله صلى الله عليه وسلم ولم يبين لنا أنها منها فمن أجل ذلك قرنت بينهما ولم أكتب بينهما سطر بسم الله الرحمن الرحيم فوضعتها في السبع الطول ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من حديث عوف عن يزيد الفارسي عن ابن عباس ‏.‏ ويزيد الفارسي قد روى عن ابن عباس غير حديث ويقال هو يزيد بن هرمز ويزيد الرقاشي هو يزيد بن أبان الرقاشي ولم يدرك ابن عباس إنما روى عن أنس بن مالك وكلاهما من التابعين من أهل البصرة ويزيد الفارسي أقدم من يزيد الرقاشي ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"I said to 'Uthman bin 'Affan: 'What was your reasoning with Al-Anfal - while it is from the Muthani (Surah with less than one-hundred Ayat), and Bara'ah while it is from the Mi'in (Surah with about one-hundred Ayat), then you put them together, without writing the line Bismillahir-Rahmanir-Rahim between them, and you placed them with the seven long (Surah) - why did you do that?' So 'Uthman said: 'A long time might pass upon the Messenger of Allah (ﷺ) without anything being revealed to him, and then sometimes a Surah with numerous (Ayat) might be revealed. So when something was revealed, he would call for someone who could write, and say: \"Put these Ayat in the Surah which mentions this and that in it.\" When an Ayah was revealed, he would say: \"Put this Ayah in the Surah which mentions this and that in it.\" Now Al-Anfal was among the first of those revealed in Al-Madinah, and Bara'ah among the last of those revealed of the Qur'an, and its narrations (those of Bara'ah) resembled its narrations (those of Al-Anfal), so we thought that it was part of it. Then the Messenger of Allah (ﷺ) died, and it was not made clear to us whether it was part of it. So it is for this reason that we put them together without writing Bismillahir-Rahmanir-Rahim between them, and we put that with the seven long (Surahs).'\"",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20276",
        "20712",
        "11298",
        "14432",
        "17"
      ]
    },
    {
      "hadith_no": "3489",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا أبو زيد، عن عوف، عن قسامة بن زهير، حدثنا الأشعري، قال لما نزل ‏:‏ ‏(‏وأنذر عشيرتك الأقربين ‏)‏ وضع رسول الله صلى الله عليه وسلم أصبعيه في أذنيه فرفع من صوته فقال ‏\"‏ يا بني عبد مناف يا صباحاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه من حديث أبي موسى ‏.‏ وقد رواه بعضهم عن عوف عن قسامة بن زهير عن النبي صلى الله عليه وسلم مرسلا ولم يذكروا فيه عن أبي موسى وهو أصح ذاكرت به محمد بن إسماعيل فلم يعرفه من حديث أبي موسى ‏.‏",
      "text_en": " Narrated Qasamah bin Zuhair:                     \"Al-Ash'ari  said: 'When (the following) was revealed: 'And warn your tribe of near kindred (26:214)' the Messenger of Allah (ﷺ) placed his fingers in his ears, raised his voice and said: 'O Banu 'Abd Manaf! Hearken!'\"",
      "chain": [
        "11298",
        "14326"
      ]
    },
    {
      "hadith_no": "3527",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا روح بن عبادة، عن عوف، عن الحسن، ومحمد، وخلاس، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن موسى عليه السلام كان رجلا حييا ستيرا ما يرى من جلده شيء استحياء منه فآذاه من آذاه من بني إسرائيل فقالوا ما يستتر هذا الستر إلا من عيب بجلده إما برص وإما أدرة وإما آفة وإن الله عز وجل أراد أن يبرئه مما قالوا وإن موسى عليه السلام خلا يوما وحده فوضع ثيابه على حجر ثم اغتسل فلما فرغ أقبل إلى ثيابه ليأخذها وإن الحجر عدا بثوبه فأخذ موسى عصاه فطلب الحجر فجعل يقول ثوبي حجر ثوبي حجر حتى انتهى إلى ملإ من بني إسرائيل فرأوه عريانا أحسن الناس خلقا وأبرأه مما كانوا يقولون قال وقام الحجر فأخذ ثوبه ولبسه وطفق بالحجر ضربا بعصاه فوالله إن بالحجر لندبا من أثر عصاه ثلاثا أو أربعا أو خمسا فذلك قوله تعالى ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم وفيه عن أنس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"Verily Musa, peace be upon him, was a shy and modest man, who would never show anything of his skin out of modesty. Some of the Children of Isra'il annoyed him by saying: 'He only keeps himself covered because of some defect in his skin, either leprosy, a scrotal hernia or some other defect.' Allah [the Mighty and Sublime] wanted to free Musa from what they were saying about him. One day Musa, [peace be upon him], was alone. He took off his garment, and put it on a rock, then he took a bath. When he had finished, he turned back to pick up his garment, but the rock moved away, taking his garment with it. Musa picked up his staff, and chased the rock saying: 'My garment, O you rock! My garment, O you rock!' Until he reached a group of the Children of Isra'il who saw him naked, and discovered that he was the best of those whom Allah had created.\" He said: \"The rock stood still, he took his garment and put it on. He started striking the rock with his staff, and by Allah, the marks of that beating were left on the rock; three, four, or five. This is what is referred to in the Ayah: ' O you who believe! Be not like those who annoyed Musa, but Allah freed him from what they had alleged, and he was honourable before Allah (33:69).'\"",
      "chain": [
        "30553",
        "20229",
        "11298",
        "11016",
        "11035",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "4088",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا خلاد بن أسلم البغدادي، حدثنا النضر بن شميل، أخبرنا عوف، عن عبد الله بن عمرو بن هند الجملي، قال قال علي كنت إذا سألت رسول الله صلى الله عليه وسلم أعطاني وإذا سكت ابتدأني ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Ali:                     \"When I would ask the Messenger of Allah (ﷺ), he would give me, and when I would be silent, he would initiate (speech or giving) with me.\"",
      "chain": [
        "36553",
        "20291",
        "11298"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، قال حدثنا عوف، عن محمد، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يبولن أحدكم في الماء الدائم ثم يتوضأ منه ‏\"‏ ‏.‏ قال عوف وقال خلاس عن أبي هريرة عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"None of you should urinate into still water and then perform Wudu' with it.\"",
      "chain": [
        "30123",
        "20347",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن عوف، عن أبي رجاء، قال سمعت عمران بن حصين، أن رسول الله صلى الله عليه وسلم رأى رجلا معتزلا لم يصل مع القوم فقال ‏\"‏ يا فلان ما منعك أن تصلي مع القوم ‏\"‏ ‏.‏ فقال يا رسول الله أصابتني جنابة ولا ماء ‏.‏ قال ‏\"‏ عليك بالصعيد فإنه يكفيك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Raja' said:                      \"I heard 'Imran bin Husain (say) that the Prophet (ﷺ) saw a man who was by himself and did not pray with the people. He said: 'O So and so, what kept you from praying with the people?' He said: 'O Messenger of Allah, I have become Junub and there is no water.' He said: 'You should use earth for that will suffice you.'\"",
      "chain": [
        "38265",
        "20025",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "530",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا عوف، قال حدثني سيار بن سلامة، قال دخلت على أبي برزة فسأله أبي كيف كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس وكان يصلي العصر حين يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية ونسيت ما قال في المغرب وكان يستحب أن يؤخر العشاء التي تدعونها العتمة وكان يكره النوم قبلها والحديث بعدها وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه وكان يقرأ بالستين إلى المائة ‏.‏",
      "text_en": " Sayyar bin Salamah said:                      \"I entered upon Abu Barzah, and my fatehr asked him: 'How did the Messenger of Allah (ﷺ) pray the prescribed prayers?' He said: 'He used to pray Zuhr, which you call Al-Uula (the first) when the sun passed its zenith; he used to pray 'Asr when one of us could go back to his hoome in the farthest part of Al-Madinah while the sun was still bright.' I forgot what he said about Maghrib. 'And he used to like to delay 'Isha', which you call Al-'Atamah, and he did not like to sleep before it nor talk after it. And he used to finish the Al-Ghadah (Fajr) prayer when a man could recognize his neighbor, and he used to recite (in it) between sixty and one hundred verses.'\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "535",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عوف، عن سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي فقال له أبي أخبرنا كيف، كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس وكان يصلي العصر ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية قال ونسيت ما قال في المغرب قال وكان يستحب أن تؤخر صلاة العشاء التي تدعونها العتمة قال وكان يكره النوم قبلها والحديث بعدها وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه وكان يقرأ بالستين إلى المائة ‏.‏",
      "text_en": " Sayyar bin Salamah said:                      \"My father and I entered upon Abu Barzah, and my father said to him: 'How did the Messenger of Allah (ﷺ) pray the prescribed prayers?' He said: He used to pray Zuhr, which you call Al-Uala (the first) when the sun passed its zenith; he used to pray 'Asr then one of us could go back to his home in the farthest part of Al-Madinah when the sun was still bright.'\" - He said: \"I forgot what he said to me about Maghrib.\" - \"And he used to like to delay 'Isha', which you call Al-'Atamah, and he did not like to sleep before it nor speak after it. And he used to finish the Al-Ghadah (Fajr) prayer when a man could recognize his neighbor, and he used to recite between sixty and one hundred verses.'\"",
      "chain": [
        "38265",
        "20025",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعيد، حدثنا يحيى بن سعيد، عن عوف، قال حدثني محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ التسبيح للرجال والتصفيق للنساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet (ﷺ) said: \"The tasbih is for men and clapping is for women.\"",
      "chain": [
        "30359",
        "20031",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا سليمان بن حرب، قال حدثنا شعبة، عن عوف، عن خالد الأحدب، عن صفوان بن محرز، قال أغمي على أبي موسى فبكوا عليه فقال أبرأ إليكم كما برئ إلينا رسول الله صلى الله عليه وسلم ليس منا من حلق ولا خرق ولا سلق ‏.‏",
      "text_en": " It was narrated that Safwan bin Muhriz said:                     \"Abu Musa fell unconscious and they wept for him. He said: 'I say to you the words of disavowal that the messenger of Allah said: He is not one of us who shaves his head (as a sign of mourning), rends his garments, or raises his voice in Lamentation.\"'",
      "chain": [
        "30153",
        "20193",
        "20020",
        "11298",
        "11693"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم ابن علية، وعبد الرحمن بن محمد، قالا حدثنا إسحاق، - وهو الأزرق - عن عوف، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مسلمين يموت بينهما ثلاثة أولاد لم يبلغوا الحنث إلا أدخلهما الله بفضل رحمته إياهم الجنة ‏\"‏ ‏.‏ قال ‏\"‏ يقال لهم ادخلوا الجنة فيقولون حتى يدخل آباؤنا فيقال ادخلوا الجنة أنتم وآباؤكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"There are no two Muslims, three of whose children die before reaching puberty, but Allah will admit them to Paradise by virtue of His mercy toward them. It will be said to them: 'Enter Paradise.' They will say: 'Not until our parents enter.' So it will be said: 'Enter Paradise, you and your parents.\"'",
      "chain": [
        "34188",
        "20411",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1996",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد بن جعفر، عن عوف، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من تبع جنازة رجل مسلم احتسابا فصلى عليها ودفنها فله قيراطان ومن صلى عليها ثم رجع قبل أن تدفن فإنه يرجع بقيراط من الأجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever follows the funeral of a Muslim man, seeking reward, and offers the prayer and buries him, will have two Qirats. And whoever offers the funeral prayer then goes back before the burial, then he returns with one Qirat of reward.\"",
      "chain": [
        "30160",
        "20173",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3057",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، قال حدثنا ابن علية، قال حدثنا عوف، قال حدثنا زياد بن حصين، عن أبي العالية، قال قال ابن عباس قال لي رسول الله صلى الله عليه وسلم غداة العقبة وهو على راحلته ‏\"‏ هات القط لي ‏\"‏ ‏.‏ فلقطت له حصيات هن حصى الخذف فلما وضعتهن في يده قال بأمثال هؤلاء ‏\"‏ وإياكم والغلو في الدين فإنما أهلك من كان قبلكم الغلو في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Aliyah said:                     \"Ibn Abbas said: \"On the morning of Al-Aqabah, while he was on his mount, the Messenger of Allah said to me: \"Pick up (some pebbles) for me.\" So I picked up some pebbles for him that were the size of date stones or fingertips, and when I placed them in his hand he said: \"Like these. And beware of going to extremes in religious matters, for those who came before you were destroyed because of going to extremes in religious matters.\"",
      "chain": [
        "30400",
        "20208",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "3059",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، قال حدثنا عوف، قال حدثنا زياد بن حصين، عن أبي العالية، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم غداة العقبة وهو واقف على راحلته ‏\"‏ هات القط لي ‏\"‏ ‏.‏ فلقطت له حصيات هن حصى الخذف فوضعتهن في يده وجعل يقول بهن في يده ووصف يحيى تحريكهن في يده بأمثال هؤلاء ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"On the morning of Al-Aqabah, while he was on his mount, the Messenger of Allh said: 'Pick up (some pebbles) for me.' So P picked up some pebbles for him that were the size of date stones of fingertips, and placed them in his hand. He started to do this with his hand.\" Yahya described him shaking them in his hand like this.",
      "chain": [
        "30359",
        "20031",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا عبيد الله بن معاذ، قال حدثنا أبي قال، حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحلفوا بآبائكم ولا بأمهاتكم ولا بالأنداد ولا تحلفوا إلا بالله ولا تحلفوا إلا وأنتم صادقون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'Do not swear by your fathers, nor by your mothers nor by the idols. Swear only by Allah, and do not swear unless you are sincere.'\"",
      "chain": [
        "30150",
        "20286",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4288",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، وابن أبي عدي، ومحمد بن جعفر، عن عوف، عن الحسن، عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم قال ‏\"‏ من اتخذ كلبا إلا كلب صيد أو ماشية أو زرع نقص من أجره كل يوم قيراط ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Prophet said:                     \"Whoever keeps a dog, except a dog for hunting, herding livestock or farming, one Qurat will be deducted from his reward each day.\"",
      "chain": [
        "30160",
        "20031",
        "20276",
        "20173",
        "11298",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق، عن عوف الأعرابي، عن علقمة بن وائل الحضرمي، عن أبيه، قال جيء بالقاتل الذي قتل إلى رسول الله صلى الله عليه وسلم جاء به ولي المقتول فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب دعاه قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب قال ‏\"‏ أما إنك إن عفوت عنه فإنه يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه فأرسله - قال - فرأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated from 'Alqamah binWa'il Al-Hadrami that his farther said:                     A man who had killed someone was brought to the Messenger of Allah, and he was brought by the heir of the victim. The Messenger of Allah said to him. 'Will you forgive him? He said: No.' He said: 'Will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he went away, he called him back and said: will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah? He said: 'No.' He said: 'will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he had gone he said: If you forgive him, he will carry your sin and the sin of your companion (the victim).\" So he forgave him and let him go.\" He said: \"And I saw him dragging his string.\"",
      "chain": [
        "34188",
        "30021",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "4724",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن عوف بن أبي جميلة، قال حدثني حمزة أبو عمرو العائذي، قال حدثنا علقمة بن وائل، عن وائل، قال شهدت رسول الله صلى الله عليه وسلم حين جيء بالقاتل يقوده ولي المقتول في نسعة فقال رسول الله صلى الله عليه وسلم لولي المقتول ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ذهب به فولى من عنده دعاه فقال له ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه وتركه فأنا رأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated that Wa'il said:                     \"I saw the Messenger of Allah when the heir of a victim brought the killer, leading him by a string. The Messenger of Allah said to the heir of the victim: Will you forgive him?' He said: 'No., He said: 'Will you accept Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said\" 'Take him away (to kill him).' When he took him and turned away, he turned to those who were with him, and called him back, and said to him: 'Will you forgive him?' He said: No.' He said: 'Will you accept Diyah?' He said: No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' Then the Messenger of Allah said: 'If you forgive him, he will carry your sin and the sin of your companion (the victim).' So he forgave him and left him, and I was him dragging his string.\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "5032",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام قال حدثنا إسحق يعني ابن يوسف بن الأزرق عن عوف عن محمد بن سيرين عن أبي هريرة  عن النبي صلى الله عليه وسلم قال من اتبع جنازة مسلم إيمانا واحتسابا فصلى عليه ثم انتظر حتى يوضع في قبره كان له قيراطان أحدهما مثل أحد ومن صلى عليه ثم رجع كان له قيراط",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Whoever follows the funeral procession of a Muslim out of faith and in the hope of reward, then offers the funeral prayer for him and waits until he is placed in his grave, then he will have two Qirats, each of which is like Mount Uhud. Whoever offers the funeral prayer for him then returns, he will have one Qirat.\"",
      "chain": [
        "36587",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5415",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن عوف، قال حدثني حمزة أبو عمر العائذي، قال حدثنا علقمة بن وائل، عن وائل، قال شهدت رسول الله صلى الله عليه وسلم حين جاء بالقاتل يقوده ولي المقتول في نسعة فقال رسول الله صلى الله عليه وسلم لولي المقتول ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ذهب فولى من عنده دعاه فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا قال ‏\"‏ فتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ذهب فولى من عنده دعاه فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فتقتله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه وتركه فأنا رأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated that Wa'il said:                     \"I saw the Messenger of Allah [SAW] when a killer was brought by the heir of the victim by a string. The Messenger of Allah [SAW] said to the heir of the victim: 'Will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' When he went and turned away from him, he called him back and said: 'Will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' When he went and turned away from him, he called him back and said: 'Will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah?' He said: 'No.' He said: 'Will you kill him?' He said: 'Yes.' He said: 'Take him away.' At that point the Messenger of Allah [SAW] said: 'But if you forgive him, he will carry his own sin and the sin of your companion.' So he forgave him, and I saw him dragging his string.\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن عوف بن أبي جميلة، عن سيار بن سلامة، عن أبي برزة الأسلمي، قال كان النبي  صلى الله عليه وسلم  يصلي صلاة الهجير التي تدعونها الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"The Prophet used to pray the Hajir prayer, which you call 'Zuhr', when the sun had passed its zenith.\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وعبد الوهاب، قالوا حدثنا عوف، عن أبي المنهال، سيار بن سلامة عن أبي برزة الأسلمي، قال كان رسول الله  صلى الله عليه وسلم  يستحب أن يؤخر العشاء وكان يكره النوم قبلها والحديث بعدها ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"The Messenger of Allah used to like to delay the 'Isha', and he disliked sleeping before it, and engaging in conversation after it.\"",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20259",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "867",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عباد بن العوام، عن عوف، عن أبي المنهال، عن أبي برزة، ح وحدثنا سويد، حدثنا معتمر بن سليمان، عن أبيه، حدثه أبو المنهال، عن أبي برزة، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في الفجر ما بين الستين إلى المائة ‏.‏",
      "text_en": " It wasnarrated from Abu Barzah that the Messenger of Allah (ﷺ)used torecite between sixty and one hundred (Verses) in Fajr prayer.",
      "chain": [
        "30269",
        "20431",
        "11298",
        "11290",
        "227",
        "20288",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "1395",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وابن أبي عدي، وعبد الوهاب، ومحمد بن جعفر، عن عوف بن أبي جميلة، عن زرارة بن أوفى، عن عبد الله بن سلام، قال لما قدم رسول الله  صلى الله عليه وسلم  المدينة انجفل الناس إليه ‏.‏ وقيل قدم رسول الله  صلى الله عليه وسلم  ‏.‏ فجئت في الناس لأنظر إليه فلما استبنت وجه رسول الله  صلى الله عليه وسلم  عرفت أن وجهه ليس بوجه كذاب فكان أول شىء تكلم به أن قال ‏\"‏ يا أيها الناس أفشوا السلام وأطعموا الطعام وصلوا بالليل والناس نيام تدخلوا الجنة بسلام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Salam said:                      “When the Messenger ofAllah (ﷺ) came to Al-Madinah, the people rushed towards him and itwas said: ‘The Messenger of Allah (ﷺ) has come!’ I came alongwith the people to see him, and when I looked at the face of theMessenger of Allah (ﷺ), I realized that his face was not the faceof a liar. The first thing he said was: “O people, spread (thegreeting of) Salam, offer food to people and pray at night whenpeople are sleeping, you will enter Paradise in peace.”",
      "chain": [
        "30160",
        "20031",
        "20276",
        "20259",
        "20173",
        "11298",
        "11284",
        "103"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عوف، عن خلاس، ومحمد بن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أكل ناسيا وهو صائم فليتم صومه فإنما أطعمه الله وسقاه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     \"Whoever eats out of forgetfulness while fasting, let himcomplete his fast, for it is Allah Who has fed him and given him todrink.\"",
      "chain": [
        "30201",
        "20318",
        "11298",
        "11283",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1974",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، حدثنا عوف، عن ثمامة بن عبد الله، عن أنس بن مالك، أن النبي  صلى الله عليه وسلم  مر ببعض المدينة فإذا هو بجوار يضربن بدفهن ويتغنين ويقلن نحن جوار من بني النجار يا حبذا محمد من جار ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ يعلم الله إني لأحبكن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik:                     that the Prophet passed by some part of Al-Madinah and saw some girls beating their Daff And singing, saying: “We are girls from Baniu Najjar what an excellent neighbor is Muhammad.” The Prophet said: “Allah knows that you are dear to me.”",
      "chain": [
        "30288",
        "20347",
        "11298",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "2474",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عوف، عن خلاس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن مثل الذي يعود في عطيته كمثل الكلب أكل حتى إذا شبع قاء ثم عاد في قيئه فأكله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “The likeness of one who takes back his gift is that of a dog that eats until it is full and vomits; then it goes back to its vomit and eats it again.”",
      "chain": [
        "30201",
        "20318",
        "11298",
        "11283",
        "13"
      ]
    },
    {
      "hadith_no": "3144",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن عوف، عن زياد بن الحصين، عن أبي العالية، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  غداة العقبة وهو على ناقته ‏\"‏ القط لي حصى ‏\"‏ ‏.‏ فلقطت له سبع حصيات هن حصى الخذف فجعل ينفضهن في كفه ويقول ‏\"‏ أمثال هؤلاء فارموا ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا أيها الناس إياكم والغلو في الدين فإنما أهلك من كان قبلكم الغلو في الدين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “On the morning of ‘Aqabah,whenhe was atop his she-camel, the Messenger of Allah (ﷺ) said:‘Pickup some pebbles for me.’ So I picked up seven pebbles for him,suitable for Khadhf.* He began to toss them in his hand, saying:‘Throw something like these.’ Then he said: ‘O people, bewareofexaggeration in religious matters for those who came before youweredoomed because of exaggeration in religious matters.’”",
      "chain": [
        "38409",
        "20318",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "3374",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عوف، عن زرارة بن أوفى، حدثني عبد الله بن سلام، قال لما قدم النبي  صلى الله عليه وسلم  المدينة انجفل الناس قبله وقيل قد قدم رسول الله  صلى الله عليه وسلم  قد قدم رسول الله قد قدم رسول الله ‏.‏ ثلاثا فجئت في الناس لأنظر فلما تبينت وجهه عرفت أن وجهه ليس بوجه كذاب فكان أول شىء سمعته تكلم به أن قال ‏\"‏ يا أيها الناس أفشوا السلام وأطعموا الطعام وصلوا الأرحام وصلوا بالليل والناس نيام تدخلوا الجنة بسلام ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Salam said:                      “When the Prophet (ﷺ) came toAl-Madinah,the people rushed to meet him, and it was said: ‘TheMessenger ofAllah (ﷺ) has come! The Messenger of Allah (ﷺ) hascome! TheMessenger of Allah (ﷺ) has come!’ Three times. I camewith thepeople to see him, and when I saw his face clearly, I knewthat hisface was not the face of a liar. The first thing I heard himsay waswhen he said: ‘O people! Spread (the greeting of) Salam,feed others,uphold the ties of kinship, and pray during the nightwhen people aresleeping, and you will enter Paradise with Salam.”*",
      "chain": [
        "30201",
        "20318",
        "11298",
        "11284",
        "103"
      ]
    },
    {
      "hadith_no": "3906",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هوذة بن خليفة، حدثنا عوف، عن محمد بن سيرين، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الرؤيا ثلاث فبشرى من الله وحديث النفس وتخويف من الشيطان فإذا رأى أحدكم رؤيا تعجبه فليقصها إن شاء وإن رأى شيئا يكرهه فلا يقصه على أحد وليقم يصلي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Dreams areof three types: Glad tidings from Allah, what is on aperson’smind, and frightening dreams from Satan. If any of you sees adreamthat he likes, let him tell others of it if he wishes, but if heseessomething that he dislikes, he should not tell anyone about it,andhe should get up and perform prayer.”",
      "chain": [
        "30201",
        "24473",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4094",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا عوف، عن الحسن، حدثنا أسيد بن المتشمس، قال حدثنا أبو موسى، حدثنا رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بين يدى الساعة لهرجا ‏\"‏ ‏.‏ قال قلت يا رسول الله ما الهرج قال ‏\"‏ القتل ‏\"‏ ‏.‏ فقال بعض المسلمين يا رسول الله إنا نقتل الآن في العام الواحد من المشركين كذا وكذا ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس بقتل المشركين ولكن يقتل بعضكم بعضا حتى يقتل الرجل جاره وابن عمه وذا قرابته ‏\"‏ ‏.‏ فقال بعض القوم يا رسول الله ومعنا عقولنا ذلك اليوم فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تنزع عقول أكثر ذلك الزمان ويخلف له هباء من الناس لا عقول لهم ‏\"‏ ‏.‏ ثم قال الأشعري وايم الله إني لأظنها مدركتي وإياكم وايم الله ما لي ولكم منها مخرج إن أدركتنا فيما عهد إلينا نبينا  صلى الله عليه وسلم  إلا أن نخرج كما دخلنا فيها ‏.‏",
      "text_en": " Abu Musa narrated that the Messenger of Allah (ﷺ) said:                      “BeforetheHour comes there will be Harj.” I said: “O Messenger ofAllah, what isHarj?” He said: “Killing.” Some of the Muslimssaid: “O Messenger ofAllah, now we kill such and such a number ofidolaters in one year.”The Messenger of Allah (ﷺ) said: “Thatwill not be like killing theidolaters, rather you will kill oneanother, until a man will kill hisneighbor and son of the cousin anda relative.” Some of the peoplesaid: “O Messenger of Allah, willwe be in our right minds that day?”The Messenger of Allah (ﷺ)said: “No, reason will be taken away frommost of the people atthat time, and there will be left theinsignificant people who haveno reason.”",
      "chain": [
        "30160",
        "20173",
        "11298",
        "11016",
        "30170"
      ]
    }
  ],
  "total_hadiths": 79
}