{
  "id": "11294",
  "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
  "full_name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "14",
      "date_gregorian": "NA",
      "date_display": [
        "14 AH"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "96",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "3229",
      "name": "Abu Bakra al-Thaqafi ( أبو بكرة الثقفي الطائفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "14500",
      "name": "'Ubaidullah bin Abi Bakra عبيد الله بن أبي بكرة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "14245",
      "name": "'Abdul 'Aziz bin Abi Bakra عبد العزيز بن أبي بكرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10717",
      "name": "Muslim bin Abi Bakra مسلم بن أبي بكرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19518",
      "name": "Kaysa bint Abi Bakra كيسة بنت أبي بكرة الثقفية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14501",
      "name": "Ruwad bin Abi Bakra رواد بن أبي بكرة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "14502",
      "name": "Yazid bin Abi Bakra يزيد بن أبي بكرة",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "3229",
      "name": "Abu Bakra al-Thaqafi ( أبو بكرة الثقفي الطائفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "422",
      "name": "'Abdullah bin Abi Talha ( عبد الله بن أبي طلحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5305",
      "name": "al-Mndhr bin Aa'idh bin al-Mndhr ( المنذر بن عائذ بن المنذر بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "21686",
      "name": "Thabit bin 'Ubaidullah bin Aba ثابت بن عبيد الله بن أبي",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "14027",
      "name": "Bhr bin Mrar بحر بن مرار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11314",
      "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18132",
      "name": "Ja'far bin Maymun al-Tamimi جعفر بن ميمون التميمي بياع الأنماط",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11575",
      "name": "Ishaq bin Suwayd bin Hubayra إسحاق بن سويد بن هبيرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-67",
      "hadith_no": "67",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر، قال حدثنا ابن عون، عن ابن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، ذكر النبي صلى الله عليه وسلم قعد على بعيره، وأمسك إنسان بخطامه  أو بزمامه  قال ‏\"‏ أى يوم هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه سوى اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس بذي الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا‏.‏ ليبلغ الشاهد الغائب، فإن الشاهد عسى أن يبلغ من هو أوعى له منه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakra's father:                     Once the Prophet was riding his camel and a man was holding its rein. The Prophet asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
      "usc_msa_ref": "67",
      "chain": [
        "30175",
        "20212",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-105",
      "hadith_no": "105",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، ذكر النبي صلى الله عليه وسلم قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام كحرمة يومكم هذا في شهركم هذا، ألا ليبلغ الشاهد منكم الغائب ‏\"‏‏.‏ وكان محمد يقول صدق رسول الله صلى الله عليه وسلم كان ذلك ‏\"‏ ألا هل بلغت ‏\"‏ مرتين‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu Bakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this day of yours in this month of yours. It is incumbent on those who are present to inform those who are absent.\" (Muhammad the Sub-narrator used to say, \"Allah's Apostle told the truth.\") The Prophet repeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
      "usc_msa_ref": "105",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-1768",
      "hadith_no": "1768",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا قرة، عن محمد بن سيرين، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبي بكرة،، ورجل، أفضل في نفسي من عبد الرحمن حميد بن عبد الرحمن عن أبي بكرة  رضى الله عنه  قال خطبنا النبي صلى الله عليه وسلم يوم النحر، قال ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليست بالبلدة الحرام ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم عليكم حرام، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، إلى يوم تلقون ربكم‏.‏ ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، فليبلغ الشاهد الغائب، فرب مبلغ أوعى من سامع، فلا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day today?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We replied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message to you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"",
      "usc_msa_ref": "797",
      "chain": [
        "30351",
        "20443",
        "11301",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-1912-2",
      "hadith_no": "1912",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت إسحاق، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم‏.‏ وحدثني مسدد، حدثنا معتمر، عن خالد الحذاء، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ شهران لا ينقصان شهرا عيد رمضان وذو الحجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The two months of `Id i.e. Ramadan and Dhul-Hijja, do not decrease (in superiority).",
      "usc_msa_ref": "136",
      "chain": [
        "30175",
        "20288",
        "11151",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-2175",
      "hadith_no": "2175",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا إسماعيل ابن علية، قال حدثني يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، قال قال أبو بكرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا سواء بسواء، والفضة بالفضة إلا سواء بسواء، وبيعوا الذهب بالفضة والفضة بالذهب كيف شئتم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said, \"Don't sell gold for gold unless equal in weight, nor silver for silver unless equal in weight, but you could sell gold for silver or silver for gold as you like.\"",
      "usc_msa_ref": "383",
      "chain": [
        "30343",
        "20208",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-2182",
      "hadith_no": "2182",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عباد بن العوام، أخبرنا يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن الفضة بالفضة والذهب بالذهب، إلا سواء بسواء، وأمرنا أن نبتاع الذهب بالفضة كيف شئنا، والفضة بالذهب كيف شئنا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakra:                     that his father said, \"The Prophet forbade the selling of gold for gold and silver for silver except if they are equivalent in weight, and allowed us to sell gold for silver and vice versa as we wished.\"",
      "usc_msa_ref": "388",
      "chain": [
        "30156",
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-2654",
      "hadith_no": "2654",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏‏.‏ ثلاثا‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ وجلس وكان متكئا فقال ‏\"‏ ألا وقول الزور ‏\"‏‏.‏ قال فما زال يكررها حتى قلنا ليته سكت‏.‏ وقال إسماعيل بن إبراهيم حدثنا الجريري حدثنا عبد الرحمن‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said thrice, \"Should I inform you out the greatest of the great sins?\" They said, \"Yes, O Allah's Apostle!\" He said, \"To join others in worship with Allah and to be undutiful to one's parents.\" The Prophet then sat up after he had been reclining (on a pillow) and said, \"And I warn you against giving a false witness, and he kept on saying that warning till we thought he would not stop. (See Hadith No. 7, Vol. 8)",
      "usc_msa_ref": "822",
      "chain": [
        "30175",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-2662",
      "hadith_no": "2662",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن سلام أخبرنا عبد الوهاب حدثنا خالد الحذاء عن عبد الرحمن بن أبي بكرة عن أبيه قال  أثنى رجل على رجل عند النبي صلى الله عليه وسلم فقال ويلك قطعت عنق صاحبك قطعت عنق صاحبك مرارا ثم قال من كان منكم مادحا أخاه لا محالة فليقل أحسب فلانا والله حسيبه ولا أزكي على الله أحدا أحسبه كذا وكذا إن كان يعلم ذلك منه",
      "text_en": " Narrated Abu Bakra:                     A man praised another man in front of the Prophet . The Prophet said to him, \"Woe to you, you have cut off your companion's neck, you have cut off your companion's neck,\" repeating it several times and then added, \"Whoever amongst you has to praise his brother should say, 'I think that he is so and so, and Allah knows exactly the truth, and I do not confirm anybody's good conduct before Allah, but I think him so and so,' if he really knows what he says about him.\"",
      "usc_msa_ref": "830",
      "chain": [
        "30376",
        "20259",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-3197",
      "hadith_no": "3197",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد بن سيرين، عن ابن أبي بكرة، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئته يوم خلق السموات والأرض، السنة اثنا عشر شهرا، منها أربعة حرم، ثلاثة متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. \"(The division of time has turned to its original form which was current when Allah created the Heavens and the Earths. The year is of twelve months, out of which four months are sacred: Three are in succession Dhul-Qa' da, Dhul-Hijja and Muharram, and (the fourth is) Rajab of (the tribe of) Mudar which comes between Jumadi-ath-Thaniyah and Sha ban.\"",
      "usc_msa_ref": "419",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-3555",
      "hadith_no": "3555",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان،‏.‏ حدثني محمد بن بشار، حدثنا ابن مهدي، عن سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال النبي صلى الله عليه وسلم ‏\"‏ أرأيتم إن كان جهينة ومزينة وأسلم وغفار خيرا من بني تميم وبني أسد، ومن بني عبد الله بن غطفان ومن بني عامر بن صعصعة ‏\"‏‏.‏ فقال رجل خابوا وخسروا‏.‏ فقال ‏\"‏ هم خير من بني تميم ومن بني أسد، ومن بني عبد الله بن غطفان، ومن بني عامر بن صعصعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Do you think that the tribes of Juhaina, Muzaina, Aslam and Ghifar are better than the tribes of Bani Tamim, Bani Asad, Bam `Abdullah bin Ghatafan and Bani Amir bin Sasaa?\" A man said, \"They were unsuccessful and losers.\" The Prophet added,\" (Yes), they are better than the tribes of Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa.\"",
      "usc_msa_ref": "718",
      "chain": [
        "20351",
        "30160",
        "20033",
        "20005",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-3556",
      "hadith_no": "3556",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن أبي يعقوب، قال سمعت عبد الرحمن بن أبي بكرة، عن أبيه، أن الأقرع بن حابس، قال للنبي صلى الله عليه وسلم إنما بايعك سراق الحجيج من أسلم وغفار ومزينة  وأحسبه وجهينة ابن أبي يعقوب شك  قال النبي صلى الله عليه وسلم ‏\"‏ أرأيت إن كان أسلم وغفار ومزينة  وأحسبه  وجهينة خيرا من بني تميم وبني عامر وأسد وغطفان، خابوا وخسروا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ والذي نفسي بيده، إنهم لخير منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Al-Aqra' bin Habis said to the Prophet \"Nobody gave you the pledge of allegiance but the robbers of the pilgrims (i.e. those who used to rob the pilgrims) from the tribes of Aslam, Ghifar, Muzaina.\" (Ibn Abi Ya'qub is in doubt whether Al-Aqra' added. 'And Juhaina.') The Prophet said, \"Don't you think that the tribes of Aslam, Ghifar, Muzaina (and also perhaps) Juhaina are better than the tribes of Bani Tamim, Bani Amir, Asad, and Ghatafan?\" Somebody said, \"They were unsuccessful and losers!\" The Prophet said, \"Yes, by Him in Whose Hands my life is, they (i.e. the former) are better than they (i.e. the latter).",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-4450",
      "hadith_no": "4450",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئة يوم خلق السموات والأرض، السنة اثنا عشر شهرا منها أربعة حرم ثلاثة متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان، أى شهر هذا ‏\"‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس البلدة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى يوم هذا ‏\"‏ قلنا الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا وستلقون ربكم، فسيسألكم عن أعمالكم، ألا فلا ترجعوا بعدي ضلالا، يضرب بعضكم رقاب بعض، ألا ليبلغ الشاهد الغائب، فلعل بعض من يبلغه أن يكون أوعى له من بعض من سمعه  فكان محمد إذا ذكره يقول صدق محمد صلى الله عليه وسلم ثم قال  ألا هل بلغت‏.‏ مرتين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Time has taken its original shape which it had when Allah created the Heavens and the Earth. The year is of twelve months, four of which are sacred, and out of these (four) three are in succession, i.e. Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and the fourth is Rajab which is named after the Mudar tribe, between (the month of) Jumaida (ath-thania) and Sha'ban.\" Then the Prophet asked, \"Which is this month?\" We said, \"Allah and His Apostle know better.\" On that the Prophet kept quiet so long that we thought that he might name it with another name. Then the Prophet said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" Then he said, \"Which town is this?\" \"We replied, \"Allah and His Apostle know better.\" On that he kept quiet so long that we thought that he might name it with another name. Then he said, \"Isn't it the town of Mecca?\" We replied, \"Yes, \" Then he said, \"Which day is today?\" We replied, \"Allah and His Apostle know better.\" He kept quiet so long that we thought that he might name it with another name. Then he said, \"Isn't it the day of An- Nahr (i.e. sacrifice)?\" We replied, \"Yes.\" He said, \"So your blood, your properties, (The sub-narrator Muhammad said, 'I think the Prophet also said: And your honor..) are sacred to one another like the sanctity of this day of yours, in this city of yours, in this month of yours; and surely, you will meet your Lord, and He will ask you about your deeds. Beware! Do not become infidels after me, cutting the throats of one another. It is incumbent on those who are present to convey this message (of mine) to those who are absent. May be that some of those to whom it will be conveyed will understand it better than those who have actually heard it.\" (The sub-narrator, Muhammad, on remembering that narration, used to say, \"Muhammad spoke the truth!\") He (i.e. Prophet) then added twice, \"No doubt! Haven't I conveyed (Allah's Message) to you?\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20259",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-4708",
      "hadith_no": "4708",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض، السنة اثنا عشر شهرا منها، أربعة حرم، ثلاث متواليات، ذو القعدة وذو الحجة والمحرم ورجب مضر الذي بين جمادى وشعبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     The Prophet said, \"Time has come back to its original state which it had when Allah created the Heavens and the Earth; the year is twelve months, four of which are sacred. Three of them are in succession; Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and (the fourth being) Rajab Mudar (named after the tribe of Mudar as they used to respect this month) which stands between Jumad (ath-thani) and Sha'ban.\"",
      "usc_msa_ref": "184",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-5608",
      "hadith_no": "5608",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا محمد بن سلام، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئته يوم خلق الله السموات والأرض، السنة اثنا عشر شهرا، منها أربعة حرم، ثلاث متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان، أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه، قال ‏\"‏ أليس ذا الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه، قال ‏\"‏ أليس البلدة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال  وأعراضكم عليكم حرام كحرمة يومكم هذا، في بلدكم هذا في شهركم، وستلقون ربكم فيسألكم عن أعمالكم، ألا فلا ترجعوا بعدي ضلالا، يضرب بعضكم رقاب بعض، ألا ليبلغ الشاهد الغائب، فلعل بعض من يبلغه أن يكون أوعى له من بعض من سمعه  وكان محمد إذا ذكره قال صدق النبي صلى الله عليه وسلم ثم قال  ألا هل بلغت ألا هل بلغت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Time has come back to its original state which it had on the day Allah created the Heavens and the Earth. The year is twelve months, four of which are sacred, three of them are in succession, namely Dhul-Qa'da, Dhul Hijja and Muharram, (the fourth being) Rajab Mudar which is between Juma'da (ath-thamj and Sha'ban. The Prophet then asked, \"Which month is this?\" We said, \"Allah and his Apostle know better.\" He kept silent so long that we thought that he would call it by a name other than its real name. He said, \"Isn't it the month of Dhul-Hijja?\" We said, \"Yes.\" He said, \"Which town is this?\" We said, \"Allah and His Apostle know better.\" He kept silent so long that we thought that he would call it t,y a name other than its real name. He said, \"isn't it the town (of Mecca)?\" We replied, \"Yes.\" He said, \"What day is today?\" We replied, \"Allah and His Apostle know better.\" He kept silent so long that we thought that he would call it by a name other than its real name. He said, \"Isn't it the day of Nahr?\" We replied, \"Yes.\" He then said, \"Your blood, properties and honor are as sacred to one another as this day of yours in this town of yours in this month of yours. You will meet your Lord, and He will ask you about your deeds. Beware! Do not go astray after me by cutting the necks of each other. It is incumbent upon those who are present to convey this message to those who are absent, for some of those to whom it is conveyed may comprehend it better than some of those who have heard it directly.\" (Muhammad, the sub-narrator, on mentioning this used to say: The Prophet then said, \"No doubt! Haven't I delivered (Allah's) Message (to you)? Haven't I delivered Allah's message (to you)?\"",
      "usc_msa_ref": "458",
      "chain": [
        "30376",
        "20259",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-6042",
      "hadith_no": "6042",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني إسحاق، حدثنا خالد الواسطي، عن الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏‏.‏ قلنا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ وكان متكئا فجلس فقال ‏\"‏ ألا وقول الزور وشهادة الزور، ألا وقول الزور وشهادة الزور ‏\"‏‏.‏ فما زال يقولها حتى قلت لا يسكت‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said thrice, \"Shall I not inform you of the biggest of the great sins?\" We said, \"Yes, O Allah's Apostle\" He said, \"To join partners in worship with Allah: to be undutiful to one's parents.\" The Prophet sat up after he had been reclining and added, \"And I warn you against giving forged statement and a false witness; I warn you against giving a forged statement and a false witness.\" The Prophet kept on saying that warning till we thought that he would not stop.",
      "usc_msa_ref": "7",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-6130",
      "hadith_no": "6130",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن خالد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، ذكر عند النبي صلى الله عليه وسلم فأثنى عليه رجل خيرا، فقال النبي صلى الله عليه وسلم ‏\"‏ ويحك قطعت عنق صاحبك  يقوله مرارا  إن كان أحدكم مادحا لا محالة فليقل أحسب كذا وكذا‏.‏ إن كان يرى أنه كذلك، وحسيبه الله، ولا يزكي على الله أحدا ‏\"‏‏.‏ قال وهيب عن خالد ‏\"‏ ويلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     A man was mentioned before the Prophet and another man praised him greatly The Prophet said, \"May Allah's Mercy be on you ! You have cut the neck of your friend.\" The Prophet repeated this sentence many times and said, \"If it is indispensable for anyone of you to praise someone, then he should say, 'I think that he is so-and-so,\" if he really thinks that he is such. Allah is the One Who will take his accounts (as He knows his reality) and no-one can sanctify anybody before Allah.\" (Khalid said, \"Woe to you,\" instead of \"Allah's Mercy be on you.\")",
      "usc_msa_ref": "87",
      "chain": [
        "20404",
        "20020",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-6232",
      "hadith_no": "6232",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال أثنى رجل على رجل عند النبي صلى الله عليه وسلم فقال ‏\"‏ ويلك قطعت عنق أخيك  ثلاثا  من كان منكم مادحا لا محالة فليقل أحسب فلانا  والله حسيبه  ولا أزكي على الله أحدا‏.‏ إن كان يعلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     A man praised another man in front of the Prophet. The Prophet said thrice, \"Wailaka (Woe on you) ! You have cut the neck of your brother!\" The Prophet added, \"If it is indispensable for anyone of you to praise a person, then he should say, \"I think that such-and-such person (is so-and-so), and Allah is the one who will take his accounts (as he knows his reality) and none can sanctify anybody before Allah (and that only if he knows well about that person.)\".",
      "usc_msa_ref": "183",
      "chain": [
        "20040",
        "20299",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-6347",
      "hadith_no": "6347",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأكبر الكبائر ‏\"‏‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said, \"Shall I inform you of the biggest of the great sins?\" They said, \"Yes, O Allah's Apostle!\" He said, \"To join partners in worship with Allah, and to be undutiful to one's parents. \"",
      "usc_msa_ref": "290",
      "chain": [
        "30026",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-6716",
      "hadith_no": "6716",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا وهب، حدثنا شعبة، عن محمد بن أبي يعقوب، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أرأيتم إن كان أسلم وغفار ومزينة وجهينة خيرا من تميم وعامر بن صعصعة وغطفان وأسد، خابوا وخسروا ‏\"‏‏.‏ قالوا نعم‏.‏ فقال ‏\"‏ والذي نفسي بيده إنهم خير منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Do you think if the tribes of Aslam, Ghifar, Muzaina and Juhaina are better than the tribes of Tamim, 'Amir bin Sa'sa'a, Ghatfan and Asad, they (the second group) are despairing and losing?\" They (the Prophet's companions) said, \"Yes, (they are).\" He said, \"By Him in Whose Hand my soul is, they (the first group) are better than them (the second group).",
      "usc_msa_ref": "630",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-7005",
      "hadith_no": "7005",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، وحدثني قيس بن حفص، حدثنا إسماعيل بن إبراهيم، أخبرنا سعيد الجريري، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أكبر الكبائر الإشراك بالله، وعقوق الوالدين، وشهادة الزور، وشهادة الزور  ثلاثا  أو قول الزور ‏\"‏‏.‏ فما زال يكررها حتى قلنا ليته سكت‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet. said, \"The biggest of the great sins are: To join others in worship with Allah, to be undutiful to one's parents, and to give a false witness.\" He repeated it thrice, or said, \"....a false statement,\" and kept on repeating that warning till we wished he would stop saying it. (See Hadith No.7, Vol. 8)",
      "usc_msa_ref": "54",
      "chain": [
        "30175",
        "20212",
        "11286",
        "30158",
        "20208",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-7165",
      "hadith_no": "7165",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا قرة بن خالد، حدثنا ابن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبي بكرة، وعن رجل، آخر هو أفضل في نفسي من عبد الرحمن بن أبي بكرة عن أبي بكرة أن رسول الله صلى الله عليه وسلم خطب الناس فقال ‏\"‏ ألا تدرون أى يوم هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس بيوم النحر ‏\"‏‏.‏ قلنا بلى يا رسول الله‏.‏ قال ‏\"‏ أى بلد، هذا أليست بالبلدة ‏\"‏‏.‏ قلنا بلى يا رسول الله‏.‏ قال ‏\"‏ فإن دماءكم، وأموالكم، وأعراضكم، وأبشاركم عليكم حرام، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، ألا هل بلغت ‏\"‏‏.‏ قلنا نعم‏.‏ قال ‏\"‏ اللهم اشهد، فليبلغ الشاهد الغائب، فإنه رب مبلغ يبلغه من هو أوعى له فكان كذلك  قال  لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏ فلما كان يوم حرق ابن الحضرمي، حين حرقه جارية بن قدامة‏.‏ قال أشرفوا على أبي بكرة‏.‏ فقالوا هذا أبو بكرة يراك‏.‏ قال عبد الرحمن فحدثتني أمي عن أبي بكرة أنه قال لو دخلوا على ما بهشت بقصبة‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle addressed the people saying, \"Don't you know what is the day today?\" They replied, \"Allah and His Apostle know better.\" We thought that he might give that day another name. The Prophet said, \"Isn't it the day of An-Nahr?\" We replied, \"Yes. O Allah's Apostle.\" He then said, \"What town is this? Isn't it the forbidden (Sacred) Town (Mecca)?\" We replied, \"Yes, O Allah's Apostle.\" He then said, \"Your blood, your properties, your honors and your skins (i.e., bodies) are as sacred to one another like the sanctity of this day of yours in this month of yours in this town of yours. (Listen) Haven't I conveyed Allah's message to you?\" We replied, \"Yes\" He said, \"O Allah! Be witness (for it). So it is incumbent upon those who are present to convey it (this message of mine) to those who are absent because the informed one might comprehend what I have said better than the present audience who will convey it to him.)\" The narrator added: In fact, it was like that. The Prophet added, \"Beware! Do not renegade as disbelievers after me by striking (cutting) the necks of one another.\"",
      "usc_msa_ref": "199",
      "chain": [
        "30175",
        "20031",
        "11301",
        "11035",
        "11294",
        "3229",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-7246",
      "hadith_no": "7246",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الملك بن عمير، سمعت عبد الرحمن بن أبي بكرة، قال كتب أبو بكرة إلى ابنه وكان بسجستان بأن لا تقضي بين اثنين وأنت غضبان، فإني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يقضين حكم بين اثنين وهو غضبان ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Bakra:                     Abu Bakra wrote to his son who was in Sijistan: 'Do not judge between two persons when you are angry, for I heard the Prophet saying, \"A judge should not judge between two persons while he is in an angry mood.\"",
      "usc_msa_ref": "272",
      "chain": [
        "20404",
        "20020",
        "11368",
        "11294"
      ]
    },
    {
      "id": "sahih-bukhari-7537",
      "hadith_no": "7537",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئته يوم خلق الله السموات والأرض، السنة اثنا عشر شهرا، منها أربعة حرم ثلاث متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان، أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم فسكت حتى ظننا أنه يسميه بغير اسمه قال ‏\"‏ أليس ذا الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه قال ‏\"‏ أليس البلدة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم فسكت حتى ظننا أنه سيسميه بغير اسمه قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام، كحرمة يومكم هذا في بلدكم هذا في شهركم هذا، وستلقون ربكم فيسألكم عن أعمالكم، ألا فلا ترجعوا بعدي ضلالا، يضرب بعضكم رقاب بعض، ألا ليبلغ الشاهد الغائب، فلعل بعض من يبلغه أن يكون أوعى من بعض من سمعه ‏\"‏‏.‏ فكان محمد إذا ذكره قال صدق النبي صلى الله عليه وسلم ثم قال ‏\"‏ ألا هل بلغت ألا هل بلغت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Time has come back to its original state which it had when Allah created the Heavens and the Earth, the year is twelve months, of which four are sacred; (and out of these four) three are in succession, namely, Dhul-Qa'da, Dhul-Hijja and Muharram, and (the fourth one) Rajab Mudar which is between Jumad (Ath-Tham) and Sha'ban.\" The Prophet then asked us, \"Which month is this?\" We said, \"Allah and His Apostle know (it) better.\" He kept quiet so long that we thought he might call it by another name. Then he said, \"Isn't it Dhul-Hijja?\" We said, \"Yes.\" He asked \"What town is this?\" We said, \"Allah and His Apostle know (it) better.' Then he kept quiet so long that we thought he might call it by another name. He then said, \"Isn't it the (forbidden) town (Mecca)?\" We said, \"Yes.\" He asked, \"What is the day today?\" We said, \"Allah and His Apostle know (it) better. Then he kept quiet so long that we thought that he might call it by another name. Then he said, \"Isn't it the Day of An-Nahr (slaughtering of sacrifices)?\" We said, \"Yes.\" Then he said, \"Your blood (lives), your properties,\" (the sub narrator Muhammad, said: I think he also said): \"..and your honor) are as sacred to one another like the sanctity of this Day of yours, in this town of yours, in this month of yours. You shall meet your Lord and He will ask you about your deeds. Beware! Don't go astray after me by striking the necks of one another. Lo! It is incumbent upon those who are present to inform it to those who are absent for perhaps the informed one might comprehend it (understand it) better than some of the present audience.\" Whenever the sub-narrator Muhammad mentioned that statement, he would say, \"The Prophet said the truth.\") And then the Prophet added, \"No doubt! Haven't I conveyed Allah's Message to you! No doubt! Haven't I conveyed Allah's Message to you?\"",
      "usc_msa_ref": "539",
      "chain": [
        "30170",
        "20259",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-269",
      "hadith_no": "269",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عمرو بن محمد بن بكير بن محمد الناقد، حدثنا إسماعيل ابن علية، عن سعيد الجريري، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا أنبئكم بأكبر الكبائر - ثلاثا - الإشراك بالله وعقوق الوالدين وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ وكان رسول الله صلى الله عليه وسلم متكئا فجلس فمازال يكررها حتى قلنا ليته سكت ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdur-Rahman b. Abu Bakra that his father said:                      We were in the company of the Messenger of Allah (may peace be upon him) that he observed: Should I not inform you about the most grievous of the grave sins? (The Holy Prophet) repeated it three times, and then said: Associating anyone with Allah, disobedience to parents, false testimony or false utterance. The Holy Prophet was reclining, then he sat up, and he repeated it so many times that we wished that he should become silent.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20208",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-2583",
      "hadith_no": "2583",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، قال أخبرنا يزيد بن زريع، عن خالد، عن عبد الرحمن، بن أبي بكرة عن أبيه، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏",
      "text_en": " The son of Abu Bakra reported it on the authority of his father that the Apostle of Allah (may peace be upon him) had said:                      The two months of 'Id, Ramadan and Dhu'l-Hijja (are not incomplete).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-2584",
      "hadith_no": "2584",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا معتمر بن سليمان، عن إسحاق بن سويد، وخالد عن عبد الرحمن بن أبي بكرة، عن أبي بكرة، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ شهرا عيد لا ينقصان ‏\"‏ ‏.‏ في حديث خالد ‏\"‏ شهرا عيد رمضان وذو الحجة ‏\"‏ ‏.‏",
      "text_en": " 'Abd ar-Rahman b. Abu Bakra reported on the authority of Abu Bakra that the Apostle of Allah (may peace be upon him) had said:                      The months of 'Id are not incomplete. And in the hadith narrated by Khalid (the words are):\" The months, of 'Id are Ramadan and Dhu'l-Hijja.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20288",
        "11575",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4157",
      "hadith_no": "4157",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا عباد بن العوام، أخبرنا يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن الفضة بالفضة والذهب بالذهب إلا سواء بسواء وأمرنا أن نشتري الفضة بالذهب كيف شئنا ونشتري الذهب بالفضة كيف شئنا ‏.‏ قال فسأله رجل فقال يدا بيد فقال هكذا سمعت ‏.‏",
      "text_en": " Abd al-Rabman b. Abia Bakra reported on the authority of his father that Allah's Messenger (may peace be upon him) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said:                      It is to be made on the spot. This is what I heard (from Allah's Messenger (may peace be upon him ).",
      "usc_msa_ref": "",
      "chain": [
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4158",
      "hadith_no": "4158",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يحيى بن صالح، حدثنا معاوية، عن يحيى، - وهو ابن أبي كثير - عن يحيى بن أبي إسحاق، أن عبد الرحمن بن أبي بكرة، أخبره أن أبا بكرة قال نهانا رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abd al-Rabman b. Abu Bakra said:                      Allah's Messenger (may peace be upon him) prohibited us. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20470",
        "27",
        "11449",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4477",
      "hadith_no": "4477",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ويحيى بن حبيب الحارثي، - وتقاربا في اللفظ - قالا حدثنا عبد الوهاب الثقفي، عن أيوب، عن ابن سيرين، عن ابن أبي بكرة، عن أبي، بكرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض السنة اثنا عشر شهرا منها أربعة حرم ثلاثة متواليات ذو القعدة وذو الحجة والمحرم ورجب شهر مضر الذي بين جمادى وشعبان - ثم قال - أى شهر هذا ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم - قال - فسكت حتى ظننا أنه سيسميه بغير اسمه ‏.‏ قال ‏\"‏ أليس ذا الحجة ‏\"‏ ‏.‏ قلنا بلى ‏.‏ قال ‏\"‏ فأى بلد هذا ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم - قال - فسكت حتى ظننا أنه سيسميه بغير اسمه ‏.‏ قال ‏\"‏ أليس البلدة ‏\"‏ ‏.‏ قلنا بلى ‏.‏ قال ‏\"‏ فأى يوم هذا ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم - قال - فسكت حتى ظننا أنه سيسميه بغير اسمه ‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏ ‏.‏ قلنا بلى يا رسول الله ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم - قال محمد وأحسبه قال - وأعراضكم حرام عليكم كحرمة يومكم هذا في بلدكم هذا في شهركم هذا وستلقون ربكم فيسألكم عن أعمالكم فلا ترجعن بعدي كفارا - أو ضلالا - يضرب بعضكم رقاب بعض ألا ليبلغ الشاهد الغائب فلعل بعض من يبلغه يكون أوعى له من بعض من سمعه ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا هل بلغت ‏\"‏ ‏.‏ قال ابن حبيب في روايته ‏\"‏ ورجب مضر ‏\"‏ ‏.‏ وفي رواية أبي بكر ‏\"‏ فلا ترجعوا بعدي ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported that (in the Farewell Address) Allah's Apostle (may peace be upon him) said:                      Time has completed a cycle and come to the state of the day when Allah created the heavens and the earth. The year is constituted of twelve months, of which four are sacred; three of them consecutive, viz. Dhu'l-Qa'da, Dhu'l- Hijja and Muharram, and also Rajab the month of Mudar which comes between Jumada and Sha'ban. He (the Holy Prophet) then said: which month is this? We said Allah and His Messenger know best. He (the narrator) said: He (the Holy Prophet) remained silent for some time until we thought that he would give it a name other than that (by which it was known). He said: Is it not Dha'l-Hijja? We said: Yes. He (the Holy Prophet) said: Which city is this? We said: Allah and His Messenger know best. He (the Holy Prophety remained silent until we thought that he would give it another name. He (the Holy Prophet) said: Is it not the Balda (the city of Mecca)? We said: Yes. He said: What day is this? We said: Allah and His Messenger know best. He (the Holy Prophet) remained silent until we thought that he would give it another name. He said: Is it not the Day of Sacrifice? We said: Allah's Messenger. yes. Thereupon he said: Your blood, your property (Muhammad, one of the narrators, said: I think, he also said this) and your honour are sacred to you like the sacredness of this day of yours, in this city of yours, and in this month of yours. You will soon meet your Lord and He will ask you about your deeds. So do not turn after me unbelievers (or misguided), some of you striking the necks of the others. Behold I let him who is present convey to him who is absent, for many a one whom a message is conveyed has a more retentive memory than one who hears. He again said: Behold! have I not delivered (the message) to you? This hadith has been narrated through another chain of transmitters, but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20259",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4478",
      "hadith_no": "4478",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا يزيد بن زريع، حدثنا عبد الله بن عون، عن محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال لما كان ذلك اليوم قعد على بعيره وأخذ إنسان بخطامه فقال ‏\"‏ أتدرون أى يوم هذا ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ حتى ظننا أنه سيسميه سوى اسمه ‏.‏ فقال ‏\"‏ أليس بيوم النحر ‏\"‏ ‏.‏ قلنا بلى يا رسول الله ‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ أليس بذي الحجة ‏\"‏ ‏.‏ قلنا بلى يا رسول الله ‏.‏ قال ‏\"‏ فأى بلد هذا ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم - قال - حتى ظننا أنه سيسميه سوى اسمه ‏.‏ قال ‏\"‏ أليس بالبلدة ‏\"‏ ‏.‏ قلنا بلى يا رسول الله ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا فليبلغ الشاهد الغائب ‏\"‏ ‏.‏ قال ثم انكفأ إلى كبشين أملحين فذبحهما وإلى جزيعة من الغنم فقسمها بيننا ‏.‏",
      "text_en": " Abu Bakra reported that when it was that day (the 10th of Dhu'l-Hijja) he mounted his camel and a person caught its nosestring, whereupon he said:                      Do you know which day is this? They said: Allah and His Messenger know best. (The Holy Prophet [may peace be upon him] kept silent) until we thought that he would give that another name. He said: Is it not the day of Nahr (Sacrifice) (10th of Dhu'l- Hijja)? We said: Allah's Messenger, yes. He (again) said: Which month is it? We said: Allah and His Messenger knows best. He said: Is it not Dhu'l-Hijja? We said: Allah's Messenger, yes. He said: Which city is this? We said: Allah and His Messenger know best. He (the narrator) said (that the Holy Prophet kept silent until we thought that he would give it another name besides its (original) name. He said: Is it not Balda (the city of Mecca)? We said: Yes, Allah's Messenger. He (then) said: Verily your blood (lives) and your property and your honour are as sacred unto you as sacred is this day of yours, in this month of yours, in this city of yours. Let him who is present convey it to one who is absent. He then turned his attention towards two multicoloured (black and white) rams and slaughtered them, and two goats, and distributed them amongst us.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20304",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4479",
      "hadith_no": "4479",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا حماد بن مسعدة، عن ابن عون، قال قال محمد قال عبد الرحمن بن أبي بكرة عن أبيه قال لما كان ذلك اليوم جلس النبي صلى الله عليه وسلم على بعير - قال - ورجل آخذ بزمامه - أو قال بخطامه - فذكر نحو حديث يزيد بن زريع ‏.‏",
      "text_en": " Abu Bakra reported that when it was the day of (Dhu'l-Hijja) Allah's Apostle (may peace be upon him) mounted the camel and addressed and a person had been holding its nosestring. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20224",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-4480",
      "hadith_no": "4480",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، وعن رجل، آخر هو في نفسي أفضل من عبد الرحمن بن أبي بكرة ح وحدثنا محمد بن عمرو بن جبلة وأحمد بن خراش قالا حدثنا أبو عامر عبد الملك بن عمرو حدثنا قرة بإسناد يحيى بن سعيد - وسمى الرجل حميد بن عبد الرحمن - عن أبي بكرة قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر فقال ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ وساقوا الحديث بمثل حديث ابن عون غير أنه لا يذكر ‏\"‏ وأعراضكم ‏\"‏ ‏.‏ ولا يذكر ثم انكفأ إلى كبشين وما بعده وقال في الحديث ‏\"‏ كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم ألا هل بلغت ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20031",
        "11301",
        "11035",
        "11294",
        "11220",
        "20443"
      ]
    },
    {
      "id": "sahih-muslim-6605",
      "hadith_no": "6605",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن محمد بن أبي يعقوب، سمعت عبد، الرحمن بن أبي بكرة يحدث عن أبيه، أن الأقرع بن حابس، جاء إلى رسول الله صلى الله عليه وسلم فقال إنما بايعك سراق الحجيج من أسلم وغفار ومزينة - وأحسب جهينة - محمد الذي شك - فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت إن كان أسلم وغفار ومزينة - وأحسب جهينة - خيرا من بني تميم وبني عامر وأسد وغطفان أخابوا وخسروا ‏\"‏ ‏.‏ فقال نعم ‏.‏ قال ‏\"‏ فوالذي نفسي بيده إنهم لأخير منهم ‏\"‏ ‏.‏ وليس في حديث ابن أبي شيبة محمد الذي شك ‏.‏",
      "text_en": " Abu Bakra reported from his father that al-Aqra' b. Habis reported that he came to Allah's Messenger (may peace be upon him) and said to him:                      How did the tribes of Aslam, Ghifar, Muzaina (and I think he also said Juhaina and the narrator is in doubt about it) owe allegiance to you, whereas they plundered the pilgrims? Thereupon Allah's Messenger (may peace be upon him) said:\" you were to say that Aslam, Ghifar, Muzaina and I think Juhaina are better than Banu Tamim, Banu 'Amir and Asad, Ghatfan, then would these people (of latter group of tribes) be in loss? He said: Yes. Thereupon he (the Holy Prophet) said: By Him in Whose Hand is my life, these people are better than Banu Tamim, Banu Amir, Asad and Ghatfan, and in this hadith of Abu Shaiba (these words are not found) that Muhammad (the narrator) had a doubt about.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "20173",
        "20020",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-6607",
      "hadith_no": "6607",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبي، حدثنا شعبة، عن أبي بشر، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة وجهينة خير من بني تميم ومن بني عامر والحليفين بني أسد وغطفان ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported from the Messenger of Allah (may peace be upon him) that Aslam, Ghifar, Muzaina and Juhaina are better than Banu Tamim, Banu Amir and their allies Banu Asad and Ghatfan.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11419",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-6609",
      "hadith_no": "6609",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيتم إن كان جهينة وأسلم وغفار خيرا من بني تميم وبني عبد الله بن غطفان وعامر بن صعصعة ‏\"‏ ‏.‏ ومد بها صوته فقالوا يا رسول الله فقد خابوا وخسروا ‏.‏ قال ‏\"‏ فإنهم خير ‏\"‏ ‏.‏ وفي رواية أبي كريب ‏\"‏ أرأيتم إن كان جهينة ومزينة وأسلم وغفار ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      What is your view if Juhaina, Aslam, Ghifar were better than Banu Tamim, Banu 'Abdullah b. Ghatfan and 'Amir b. Sa'sa'a' respectively (then what would be status of the latter one)? He said this in a loud voice. They said: Allah's Messenger, they would be definitely at a loss and disadvantage. Thereupon he said: They (the first group) are decidedly better than the others; and in the hadith transmitted on the authority of Abu Kuraib the words are: It you were to find that Juhaina, Muzaina and Aslam and Ghifar (are better than...).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-7693",
      "hadith_no": "7693",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يحيى، حدثنا يزيد بن زريع، عن خالد الحذاء، عن عبد الرحمن، بن أبي بكرة عن أبيه، قال مدح رجل رجلا عند النبي صلى الله عليه وسلم - قال - فقال ‏\"‏ ويحك قطعت عنق صاحبك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا ‏\"‏ إذا كان أحدكم مادحا صاحبه لا محالة فليقل أحسب فلانا والله حسيبه ولا أزكي على الله أحدا أحسبه إن كان يعلم ذاك كذا وكذا ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abu Bakra reported on the authority of his father that a person praised another person in the presence of Allah's Apostle (may peace be upon him), whereupon he said:                      Woe be to thee, you have broken the neck of your friend, you have broken the neck of your friend-he said this twice. If one of you has to praise his friend at all, he should say: I think (him to be) so and Allah knows it well and I do not know the secret of the heart and Allah knows the destined end, and I cannot testify his purity against Allah but (he appears) to be so and so.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-7694",
      "hadith_no": "7694",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثني محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، ح وحدثني أبو بكر بن نافع، أخبرنا غندر، قال شعبة حدثنا عن خالد الحذاء، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن النبي صلى الله عليه وسلم أنه ذكر عنده رجل فقال رجل يا رسول الله ما من رجل بعد رسول الله صلى الله عليه وسلم أفضل منه في كذا وكذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ويحك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا يقول ذلك ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان أحدكم مادحا أخاه لا محالة فليقل أحسب فلانا إن كان يرى أنه كذلك ولا أزكي على الله أحدا ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman b. Abu Bakra reported on the authority of his father that a person was mentioned in the presence of Allah's Apostle (may peace be upon him), and a person said:                      Allah's Messenger, no person is more excellent than he after Allah's Messenger (may peace be upon him). Thereupon Allah's Apostle (may peace be upon him) said: Woe be to thee, you have broken the neck of your friend, and he said this twice. Then Allah's Messenger (may peace be upon him) said: If anyone has to praise his brother at all, he should say: I think him to be so and so, and even on this he should say: I do not consider anyone purer than Allah (considers). This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20173",
        "20523",
        "20278",
        "20020",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-1947",
      "hadith_no": "1947",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، حدثنا أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، أن النبي صلى الله عليه وسلم خطب في حجته فقال ‏\"‏ إن الزمان قد استدار كهيئته يوم خلق الله السموات والأرض السنة اثنا عشر شهرا منها أربعة حرم ثلاث متواليات ذو القعدة و ذو الحجة والمحرم ورجب مضر الذي بين جمادى وشعبان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakrah:                     The Prophet (ﷺ) gave a sermon during his hajj and said: Time has completed a cycle and assumed the form of the day when Allah created the heavens and the earth. The year contains twelve months of which four are sacred, three of them consecutive, viz. Dhul-Qa'dah, Dhul-Hijjah and Muharram and also Rajab of Mudar which comes between Jumadah and Sha'ban.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20208",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-1948",
      "hadith_no": "1948",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى بن فياض، حدثنا عبد الوهاب، حدثنا أيوب السختياني، عن محمد بن سيرين، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود سماه ابن عون فقال عن عبد الرحمن بن أبي بكرة عن أبي بكرة في هذا الحديث ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Abu Bakrah  through a different chain of narrators.Abu Dawud said:                      Ibn 'Awn has mentioned his ('Abu Bakrah's) name and narrated this tradition: From 'Abd al-Rahman b. Abi Bakrah on the authority of Abu Bakrah.",
      "usc_msa_ref": "",
      "chain": [
        "34252",
        "20259",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-2323",
      "hadith_no": "2323",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، أن يزيد بن زريع، حدثهم حدثنا خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم قال شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Bakrah:                     The Prophet (ﷺ) as saying: The two months of 'Id (festival), Ramadan and Dhu al-Hijjah, are not defective.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-3589",
      "hadith_no": "3589",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عبد الملك بن عمير، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، أنه كتب إلى ابنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقضي الحكم بين اثنين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman bin Abi Bakrah reported on the authority of his father that he wrote to his son:                      The Messenger of Allah (ﷺ) said: A judge should not decide between the two while he is in anger.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-4443",
      "hadith_no": "4443",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع بن الجراح، عن زكريا أبي عمران، قال سمعت شيخا، يحدث عن ابن أبي بكرة، عن أبيه، أن النبي صلى الله عليه وسلم رجم امرأة فحفر لها إلى الثندوة ‏.‏ قال أبو داود أفهمني رجل عن عثمان ‏.‏ قال أبو داود قال الغساني جهينة وغامد وبارق واحد ‏.‏",
      "text_en": " Narrated Zakariya Abi 'Imran:                     I heard an old man who transmitted from Abu Bakrah on this father's authority that the Prophet (ﷺ) had a woman stoned and a pit was dug up to her breasts.Abu Dawud said: A man made me understand it from  'Uthman (b. Abi Shaibah)Abu Dawud said: Al-Ghassani said: Juhainah, Ghamid and Bariq as the same.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-4635",
      "hadith_no": "4635",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن النبي صلى الله عليه وسلم قال ذات يوم ‏\"‏ أيكم رأى رؤيا ‏\"‏ ‏.‏ فذكر معناه ولم يذكر الكراهية ‏.‏ قال فاستاء لها رسول الله صلى الله عليه وسلم يعني فساءه ذلك فقال ‏\"‏ خلافة نبوة ثم يؤتي الله الملك من يشاء ‏\"‏ ‏.‏",
      "text_en": " Abu Bakrah said:                      One day the Prophet (ﷺ) asked: Which of you had a dream? He then mentioned the rest of the tradition to the same effect, but he did not mention the word “disliked”. Instead, he said: The Messenger of Allah (ﷺ) was grieved about that. He then said: There will be a caliphate on the model of prophecy, then Allah will give the kingdom to whom he wills.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-4805",
      "hadith_no": "4805",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، أثنى على رجل عند النبي صلى الله عليه وسلم فقال له ‏\"‏ قطعت عنق صاحبك ‏\"‏ ‏.‏ ثلاث مرات ثم قال ‏\"‏ إذا مدح أحدكم صاحبه لا محالة فليقل إني أحسبه كما يريد أن يقول ولا أزكيه على الله ‏\"‏ ‏.‏",
      "text_en": " ABU BAKRAH SAID THAT WHEN A MAN PRAISED ANOTHER MAN IN HIS FACE IN THE PRESENCE OF THE PROPHET (MAY PEACE BE UPON HIM) SAID :                      YOU HAVE BEHEADED YOUR FRIEND (SAYING IT THREE TIMES). HE THEN SAID : ONE WHO CANNOT HELP EXPRESSING PRAISE OF HIS COMPANION, SHOULD SAY : I CONSIDER HIM SUCH AND SUCH (AS HE INTENDS TO SAY), BUT I DO NOT DECLARE HIM PURE WITH ALLAH.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-5090",
      "hadith_no": "5090",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا العباس بن عبد العظيم، ومحمد بن المثنى، قالا حدثنا عبد الملك بن عمرو، عن عبد الجليل بن عطية، عن جعفر بن ميمون، قال حدثني عبد الرحمن بن أبي بكرة، أنه قال لأبيه يا أبة إني أسمعك تدعو كل غداة اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا إله إلا أنت تعيدها ثلاثا حين تصبح وثلاثا حين تمسي ‏.‏ فقال إني سمعت رسول الله صلى الله عليه وسلم يدعو بهن فأنا أحب أن أستن بسنته ‏.‏ قال عباس فيه وتقول اللهم إني أعوذ بك من الكفر والفقر اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت تعيدها ثلاثا حين تصبح وثلاثا حين تمسي فتدعو بهن فأحب أن أستن بسنته قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوات المكروب اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله لا إله إلا أنت ‏\"‏ ‏.‏ وبعضهم يزيد على صاحبه ‏.‏",
      "text_en": " Narrated AbuBakrah:                     AbdurRahman ibn AbuBakrah said that he told his father: O my father! I hear you supplicating every morning: \"O Allah! Grant me health in my body. O Allah! Grant me good hearing. O Allah! Grant me good eyesight. There is no god but Thou.\" You repeat them three times in the morning and three times in the evening.  He said: I heard the Messenger of Allah (ﷺ) using these words as a supplication and I like to follow his practice.  The transmitter, Abbas, said in this version: And you say: \"O Allah! I seek refuge in Thee from infidelity and poverty. O Allah! I seek refuge in Thee from punishment in the grave. There is no god but Thee\". You repeat them three times in the morning and three times in the evening, and use them as a supplication. I like to follow his practice.  He said: The Messenger of Allah (ﷺ) said: The supplications to be used by one who is distressed are: \"O Allah! Thy mercy is what I hope for. Do not abandon me to myself for an instant, but put all my affairs in good order for me. There is no god but Thou.\" Some transmitters added more than others.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30170",
        "20443",
        "24251",
        "18132",
        "11294"
      ]
    },
    {
      "id": "jami-al-tirmidhi-692",
      "hadith_no": "692",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي بكرة حديث حسن ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن أبي بكرة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال أحمد معنى هذا الحديث ‏\"‏ شهرا عيد لا ينقصان ‏\"‏ ‏.‏ يقول لا ينقصان معا في سنة واحدة شهر رمضان وذو الحجة إن نقص أحدهما تم الآخر ‏.‏ وقال إسحاق معناه ‏\"‏ لا ينقصان ‏\"‏ يقول وإن كان تسعا وعشرين فهو تمام غير نقصان ‏.‏ وعلى مذهب إسحاق يكون ينقص الشهران معا في سنة واحدة ‏.‏",
      "text_en": " Abdur-Rahman bin Abi Bakrah narrated from his father that :                     the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20212",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1334",
      "hadith_no": "1334",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، قال كتب أبي إلى عبيد الله بن أبي بكرة وهو قاض أن لا، تحكم بين اثنين وأنت غضبان ‏.‏ فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحكم الحاكم بين اثنين وهو غضبان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو بكرة اسمه نفيع ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated:                      \"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11368",
        "11294"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1520",
      "hadith_no": "1520",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أزهر بن سعد السمان، عن ابن عون، عن محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن النبي صلى الله عليه وسلم خطب ثم نزل فدعا بكبشين فذبحهما ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi Bakrah:                     From his father, that the Prophet (ﷺ) gave a Khutbah, then he descended and called for two rams and slaughtered them.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20206",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2023",
      "hadith_no": "2023",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أحدثكم بأكبر الكبائر ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ الإشراك بالله وعقوق الوالدين ‏\"‏ ‏.‏ قال وجلس وكان متكئا فقال ‏\"‏ وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ فما زال رسول الله صلى الله عليه وسلم يقولها حتى قلنا ليته سكت ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو بكرة اسمه نفيع بن الحارث ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated from his father who said:                     \" The messenger of Allah said: 'Shall I not tell you of the biggest of the major sins?' they said : 'Of course! O Messenger of Allah!' He said: 'To join partners with Allah, and disobeying one's parents.'\"He said : \" He sat up, and he had been reclining. He said: 'And false testimony, or false speech.' And the Messenger of Allah would not stop saying it until we said (to ourselves): 'I wish that he would stop.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2248-2",
      "hadith_no": "2248",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يمكث أبو الدجال وأمه ثلاثين عاما لا يولد لهما ولد ثم يولد لهما غلام أعور أضر شيء وأقله منفعة تنام عيناه ولا ينام قلبه ‏\"‏ ‏.‏ ثم نعت لنا رسول الله صلى الله عليه وسلم أبويه فقال ‏\"‏ أبوه طوال ضرب اللحم كأن أنفه منقار وأمه امرأة فرضاخية طويلة اليدين ‏\"‏ ‏.‏ فقال أبو بكرة فسمعنا بمولود في اليهود بالمدينة فذهبت أنا والزبير بن العوام حتى دخلنا على أبويه فإذا نعت رسول الله صلى الله عليه وسلم فيهما فقلنا هل لكما ولد فقالا مكثنا ثلاثين عاما لا يولد لنا ولد ثم ولد لنا غلام أعور أضر شيء وأقله منفعة تنام عيناه ولا ينام قلبه ‏.‏ قال فخرجنا من عندهما فإذا هو منجدل في الشمس في قطيفة له وله همهمة فكشف عن رأسه فقال ما قلتما قلنا وهل سمعت ما قلنا قال نعم تنام عيناى ولا ينام قلبي ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث حماد بن سلمة ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Bakrah from his father who said:                     \"The Messenger of Allah(s.a.w) said: 'The father of the Dajjal and hid mother, will abide for thirty years without bearing a son. Then a boy shall be born to them, having one eye in which there is some defect, providing little use. His eyes sleep but his heart does not sleep.' Then the Messenger of Allah(s.a.w) described his parents for us: 'His father is tall, with little fat, with a nose  as if it were a beak. His mother is a bulky woman with long breasts.'\" So Abu Bakrah said: \"I heard about a child being born to some Jews in Al-Madinah. So Az-Zubair bin Al-'Awwam and I went until we entered upon his parents. They appeared as the Messenger of Allah(s.a.w) had described them. We said: 'Do you have any children?' They said: 'We remained for thirty years without any children being born to us, then we bore a boy, having one eye in which there is some defect, providing little use. His eyes sleep but his heart does not sleep.'\" He said: \"So we were leaving them, when he appeared, glittering in the sunlight in a velvet garment, murmuring something. He uncovered his head and said: 'What were you saying?' We said: 'Did you hear what we were saying?' He said: 'Yes, that my eyes sleep but my heart does not sleep.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2470",
      "hadith_no": "2470",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، عن الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأكبر الكبائر ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ الإشراك بالله وعقوق الوالدين وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ قال فما زال رسول الله صلى الله عليه وسلم يقولها حتى قلنا ليته سكت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated from his father that the Messenger of Allah (s.a.w) said:                     \"Shall I not inform you of the greatest of the major sins?\" They said: \"Of course O Messenger of Allah(s.a.w)!\" He said: \"Shirk with Allah disobeying parents, and false testimony.\" Or: \"False speech\" He said: \"So the Messenger of Allah(s.a.w) would not stop saying it until we said ( to ourselves): 'I wish he would  be quiet. \"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2330",
      "hadith_no": "2330",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا خالد بن الحارث، حدثنا شعبة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، قال يا رسول الله أى الناس خير قال ‏\"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ قال فأى الناس شر قال ‏\"‏ من طال عمره وساء عمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi-Bakrah narrated from his father that a man  said:                     \"O Messenger of Allah! Which of the people is the best?\" He said: \"He whose life is long and his deeds are good.\" He said: \"Then which of the people is the worst?\" He said: \"He whose life is long and his deeds are bad.\"",
      "usc_msa_ref": "",
      "chain": [
        "30286",
        "20226",
        "20020",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3292",
      "hadith_no": "3292",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا حميد بن مسعدة، - بصري - حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أحدثكم بأكبر الكبائر ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ الإشراك بالله وعقوق الوالدين ‏\"‏ ‏.‏ قال وجلس وكان متكئا قال ‏\"‏ وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ قال فما زال رسول الله صلى الله عليه وسلم يقولها حتى قلنا ليته سكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi Bakrah:                     from his father that the Messenger of Allah (ﷺ) said: \"Shall I not narrate to you about the worst of the major sins?\" They said: \"Of course O Messenger of Allah!\" He said: \"Associating others with Allah and disobeying the parents.\" He said: \"And he sat reclining and said: 'The false testimony.' Or he said: 'The false statement.'\" He said: \"So the Messenger of Allah (ﷺ) would not stop saying it until we said (to ourselves): 'If he would only stop.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4333",
      "hadith_no": "4333",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة خير من تميم وأسد وغطفان وبني عامر بن صعصعة ‏\"‏ ‏.‏ يمد بها صوته فقال القوم قد خابوا وخسروا ‏.‏ قال ‏\"‏ فهم خير منهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Bakrah:                     that the Messenger of Allah (ﷺ) said: \"Aslam, Ghifar, and Muzainah are better than Tamim, Asad, Ghatafan, and Banu 'Amir bin Sa'sa'ah,\" prolonging his voice when saying it. So the people said: \"They have been treacherous and have lost.\" He said: \"So these are better than them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-4389",
      "hadith_no": "4389",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا حميد بن مسعدة، في حديثه عن يزيد بن زريع، عن ابن عون، عن محمد، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال ثم انصرف - كأنه يعني النبي صلى الله عليه وسلم - يوم النحر إلى كبشين أملحين فذبحهما وإلى جذيعة من الغنم فقسمها بيننا ‏.‏",
      "text_en": " It was narrated from 'Adbur-Rahman bin Abi Bakrah that his father said:                     \"Then he\" meaning the Prophet on the Day of Sacrifice - \"Went toward two Amlah rams and sacrificed them, then (he went toward) a small flock of sheep and distributed them among us.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20304",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-4578",
      "hadith_no": "4578",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "وفيما قرأ علينا أحمد بن منيع قال حدثنا عباد بن العوام، قال حدثنا يحيى بن أبي إسحاق، قال حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن بيع الفضة بالفضة والذهب بالذهب إلا سواء بسواء وأمرنا أن نبتاع الذهب بالفضة كيف شئنا والفضة بالذهب كيف شئنا ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated that his father said:                     \"The Messenger of Allah forbade selling silver for silver and gold for god, unless it was of equal amounts. And he told us to sell gold fro silver however we wanted, and silver for gold however we wanted.",
      "usc_msa_ref": "",
      "chain": [
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-4579",
      "hadith_no": "4579",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد بن كثير الحراني، قال حدثنا أبو توبة، قال حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال نهانا رسول الله صلى الله عليه وسلم أن نبيع الفضة بالفضة إلا عينا بعين سواء بسواء ولا نبيع الذهب بالذهب إلا عينا بعين سواء بسواء قال رسول الله صلى الله عليه وسلم ‏\"‏ تبايعوا الذهب بالفضة كيف شئتم والفضة بالذهب كيف شئتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Bakrah that his father said:                     \"The Messenger of Allah forbade us from selling silver for silver unless it was of equal amounts, or selling gold for gold unless it was of equal amounts. The messenger of Allah said: 'Sell gold for silver however you want, and silver for gold however you want.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38620",
        "30335",
        "20401",
        "11449",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-5406",
      "hadith_no": "5406",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، قال كتب أبي وكتبت له إلى عبيد الله بن أبي بكرة وهو قاضي سجستان أن لا، تحكم بين اثنين وأنت غضبان فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحكم أحد بين اثنين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abi Bakrah said:                     \"My father wrote to 'Ubaidullah bin Abi Bakrah - who was the judge of Sijistan - saying: 'Do not pass judgment between two people when you are angry, for I heard the Messenger of Allah [SAW] say: No one should pass judgment between two people when he is angry.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11368",
        "11294"
      ]
    },
    {
      "id": "sunan-an-nasai-5421",
      "hadith_no": "5421",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا مبشر بن عبد الله، قال حدثنا سفيان بن حسين، عن جعفر بن إياس، عن عبد الرحمن بن أبي بكرة، - وكان عاملا على سجستان - قال كتب إلى أبو بكرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقضين أحد في قضاء بقضاءين ولا يقضي أحد بين خصمين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Bakrah, who was a governor in Sijistan, said:                     \"Abu Bakrah wrote to me, saying: 'I heard the Messenger of Allah [SAW] say: No one should pass two judgments on one issue, and no one should pass judgment between two disputing parties while he is angry.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38181",
        "20655",
        "11419",
        "11294"
      ]
    },
    {
      "id": "sunan-ibn-majah-239",
      "hadith_no": "239",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، - أملاه علينا - حدثنا قرة بن خالد، حدثنا محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، وعن رجل، آخر هو أفضل في نفسي من عبد الرحمن عن أبي بكرة قال خطب رسول الله  صلى الله عليه وسلم  يوم النحر فقال ‏\"‏ ليبلغ الشاهد الغائب فإنه رب مبلغ يبلغه أوعى له من سامع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"The Messenger of Allah delivered a religious speech on the Day of Sacrifice and said: 'Let those who are present convey to those who are absent. For perhaps the one to whom it is conveyed will understand it better than the one who (first) hears it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11301",
        "11035",
        "11294",
        "3229",
        "3229"
      ]
    },
    {
      "id": "sunan-ibn-majah-599",
      "hadith_no": "599",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، وبشر بن هلال الصواف، قالا حدثنا عبد الوهاب بن عبد المجيد، قال حدثنا المهاجر أبو مخلد، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي  صلى الله عليه وسلم  أنه رخص للمسافر إذا توضأ ولبس خفيه ثم أحدث وضوءا أن يمسح ثلاثة أيام ولياليهن وللمقيم يوما وليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abu Bakrah, from his father, that:                     The Prophet granted a concession to travelers: \"If a traveler performed ablution and put on leather socks, then he performed a fresh ablution, he could wipe over the leather socks for three days and nights; the resident could do so for one day and one night.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30537",
        "20259",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-ibn-majah-1728",
      "hadith_no": "1728",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that from ‘Abdur-Rahman bin Abu Bakrah, from hisfather,that the Prophet (ﷺ) said:                      “Two months of ‘Eid whose rewardcannot be reduced (even if they are twenty-nine days): ‘RamaadanandDhul-Hijjah.”",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20304",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-ibn-majah-2316-2",
      "hadith_no": "2316",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن عبد الله بن يزيد، وأحمد بن ثابت الجحدري، قالوا حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، أنه سمع عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقضي القاضي بين اثنين وهو غضبان ‏\"‏ ‏.‏ قال هشام لا ينبغي للحاكم أن يقضي بين اثنين وهو غضبان ‏.‏",
      "text_en": " It was narrated from 'Abdul-Malik bin 'Umair that he heard 'Abdur-Rahman bin Abu Bakrah (narrate) from his father that the Messenger of Allah (ﷺ) said:                     “Let the judge (Qadi) not pass a judgment when he is angry.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "34002",
        "20005",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-ibn-majah-3744-2",
      "hadith_no": "3744",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا شبابة، حدثنا شعبة، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال مدح رجل رجلا عند رسول الله  صلى الله عليه وسلم  فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ويحك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا ثم قال ‏\"‏ إن كان أحدكم مادحا أخاه فليقل أحسبه ولا أزكي على الله أحدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdur-Rahman bin Abu Bakrah that his father said:                     \"A man praised another man in the presence of Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) said: 'Woe to you,you have cut the neck of your companion,'several times. Then he said: 'If anyone of you praises his brother, let him say: \"I think he is lie this, but I do not sanctify anyone before Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20426",
        "20020",
        "11282",
        "11294",
        "3229"
      ]
    }
  ],
  "total_hadiths": 64
}