{
  "id": "11295",
  "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
  "full_name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Banani",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11216",
      "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20543",
      "name": "Sa'id bin Zayd bin Darham سعيد بن زيد بن درهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24147",
      "name": "Zakaria bin Yahya bin Amarh زكريا بن يحيى بن عمارة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20449",
      "name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24417",
      "name": "Mubarak bin Sahym مبارك بن سحيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "15",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن عبد العزيز بن صهيب، عن أنس، عن النبي صلى الله عليه وسلم ح وحدثنا آدم، قال حدثنا شعبة، عن قتادة، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said \"None of you will have faith till he loves me more      than his father, his children and all mankind.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "108",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، عن عبد العزيز، قال أنس إنه ليمنعني أن أحدثكم حديثا كثيرا أن النبي صلى الله عليه وسلم قال ‏\"‏ من تعمد على كذبا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The fact which stops me from narrating a great number of Hadiths to you is that the Prophet said: \"Whoever tells a lie against me intentionally, then (surely) let him occupy his seat in Hell-fire.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "142",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن عبد العزيز بن صهيب، قال سمعت أنسا، يقول كان النبي صلى الله عليه وسلم إذا دخل الخلاء قال ‏\"‏ اللهم إني أعوذ بك من الخبث والخبائث ‏\"‏‏.‏ تابعه ابن عرعرة عن شعبة‏.‏ وقال غندر عن شعبة إذا أتى الخلاء‏.‏ وقال موسى عن حماد إذا دخل‏.‏ وقال سعيد بن زيد حدثنا عبد العزيز إذا أراد أن يدخل‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu bika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked things (evil deeds and evil spirits).",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل ابن علية، قال حدثنا عبد العزيز بن صهيب، عن أنس، أن رسول الله صلى الله عليه وسلم غزا خيبر، فصلينا عندها صلاة الغداة بغلس، فركب نبي الله صلى الله عليه وسلم وركب أبو طلحة، وأنا رديف أبي طلحة، فأجرى نبي الله صلى الله عليه وسلم في زقاق خيبر، وإن ركبتي لتمس فخذ نبي الله صلى الله عليه وسلم، ثم حسر الإزار عن فخذه حتى إني أنظر إلى بياض فخذ نبي الله صلى الله عليه وسلم، فلما دخل القرية قال ‏\"‏ الله أكبر، خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ قالها ثلاثا‏.‏ قال وخرج القوم إلى أعمالهم فقالوا محمد  قال عبد العزيز وقال بعض أصحابنا  والخميس‏.‏ يعني الجيش، قال فأصبناها عنوة، فجمع السبى، فجاء دحية فقال يا نبي الله، أعطني جارية من السبى‏.‏ قال ‏\"‏ اذهب فخذ جارية ‏\"‏‏.‏ فأخذ صفية بنت حيى، فجاء رجل إلى النبي صلى الله عليه وسلم فقال يا نبي الله، أعطيت دحية صفية بنت حيى سيدة قريظة والنضير، لا تصلح إلا لك‏.‏ قال ‏\"‏ ادعوه بها ‏\"‏‏.‏ فجاء بها، فلما نظر إليها النبي صلى الله عليه وسلم قال ‏\"‏ خذ جارية من السبى غيرها ‏\"‏‏.‏ قال فأعتقها النبي صلى الله عليه وسلم وتزوجها‏.‏ فقال له ثابت يا أبا حمزة، ما أصدقها قال نفسها، أعتقها وتزوجها، حتى إذا كان بالطريق جهزتها له أم سليم فأهدتها له من الليل، فأصبح النبي صلى الله عليه وسلم عروسا فقال ‏\"‏ من كان عنده شىء فليجئ به ‏\"‏‏.‏ وبسط نطعا، فجعل الرجل يجيء بالتمر، وجعل الرجل يجيء بالسمن  قال وأحسبه قد ذكر السويق  قال فحاسوا حيسا، فكانت وليمة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     Anas said, 'When Allah's Apostle invaded Khaibar, we offered the Fajr prayer there yearly in the morning) when it was still dark. The Prophet rode and Abu Talha rode too and I was riding behind Abu Talha. The Prophet passed through the lane of Khaibar quickly and my knee was touching the thigh of the Prophet . He uncovered his thigh and I saw the whiteness of the thigh of the Prophet. When he entered the town, he said, 'Allahu Akbar! Khaibar is ruined. Whenever we approach near a (hostile) nation (to fight) then evil will be the morning of those who have been warned.' He repeated this thrice. The people came out for their jobs and some of them said, 'Muhammad (has come).' (Some of our companions added, \"With his army.\") We conquered Khaibar, took the captives, and the booty was collected. Dihya came and said, 'O Allah's Prophet! Give me a slave girl from the captives.' The Prophet said, 'Go and take any slave girl.' He took Safiya bint Huyai. A man came to the Prophet and said, 'O Allah's Apostles! You gave Safiya bint Huyai to Dihya and she is the chief mistress of the tribes of Quraidha and An-Nadir and she befits none but you.' So the Prophet said, 'Bring him along with her.' So Dihya came with her and when the Prophet saw her, he said to Dihya, 'Take any slave girl other than her from the captives.' Anas added: The Prophet then manumitted her and married her.\" Thabit asked Anas, \"O Abu Hamza! What did the Prophet pay her (as Mahr)?\" He said, \"Her self was her Mahr for he manumitted her and then married her.\" Anas added, \"While on the way, Um Sulaim dressed her for marriage (ceremony) and at night she sent her as a bride to the Prophet . So the Prophet was a bridegroom and he said, 'Whoever has anything (food) should bring it.' He spread out a leather sheet (for the food) and some brought dates and others cooking butter. (I think he (Anas) mentioned As-Sawaq). So they prepared a dish of Hais (a kind of meal). And that was Walima (the marriage banquet) of Allah's Apostle .\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو، قال حدثنا عبد الوارث، قال حدثنا عبد العزيز بن صهيب، عن أنس، كان قرام لعائشة سترت به جانب بيتها فقال النبي صلى الله عليه وسلم ‏\"‏ أميطي عنا قرامك هذا، فإنه لا تزال تصاويره تعرض في صلاتي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     `Aisha had a Qiram (a thin marked woolen curtain) with which he had screened one side of her home. The Prophet said, \"Take away this Qiram of yours, as its pictures are still displayed in front of me during my prayer (i.e. they divert my attention from the prayer).",
      "chain": [
        "30350",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وقال إبراهيم عن عبد العزيز بن صهيب، عن أنس  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم بمال من البحرين فقال ‏\"‏ انثروه في المسجد ‏\"‏‏.‏ وكان أكثر مال أتي به رسول الله صلى الله عليه وسلم، فخرج رسول الله صلى الله عليه وسلم إلى الصلاة، ولم يلتفت إليه، فلما قضى الصلاة جاء فجلس إليه، فما كان يرى أحدا إلا أعطاه، إذ جاءه العباس فقال يا رسول الله، أعطني فإني فاديت نفسي وفاديت عقيلا، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ خذ ‏\"‏‏.‏ فحثا في ثوبه، ثم ذهب يقله فلم يستطع فقال يا رسول الله، أؤمر بعضهم يرفعه إلى‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر منه، ثم ذهب يقله، فقال يا رسول الله، أؤمر بعضهم يرفعه على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر منه، ثم احتمله فألقاه على كاهله ثم انطلق، فما زال رسول الله صلى الله عليه وسلم يتبعه بصره حتى خفي علينا، عجبا من حرصه، فما قام رسول الله صلى الله عليه وسلم وثم منها درهم‏.‏",
      "text_en": " Narrated Anas:                     Some goods came to Allah's Apostle from Bahrain. The Prophet ordered the people to spread them in the mosque --it was the biggest amount of goods Allah's Apostle had ever received. He left for prayer and did not even look at it. After finishing the prayer, he sat by those goods and gave from those to everybody he saw. Al-`Abbas came to him and said, \"O Allah's Apostle! give me (something) too, because I gave ransom for myself and `Aqil\". Allah's Apostle told him to take. So he stuffed his garment with it and tried to carry it away but he failed to do so. He said, \"O Allah's Apostle! Order someone to help me in lifting it.\" The Prophet refused. He then said to the Prophet: Will you please help me to lift it?\" Allah's Apostle refused. Then Al-`Abbas threw some of it and tried to lift it (but failed). He again said, \"O Allah's Apostle Order someone to help me to lift it.\" He refused. Al-`Abbas then said to the Prophet: \"Will you please help me to lift it?\" He again refused. Then Al-`Abbas threw some of it, and lifted it on his shoulders and went away. Allah's Apostle kept on watching him till he disappeared from his sight and was astonished at his greediness. Allah's Apostle did not get up till the last coin was distributed.",
      "chain": [
        "20150",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "642",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو، قال حدثنا عبد الوارث، قال حدثنا عبد العزيز بن صهيب، عن أنس، قال أقيمت الصلاة والنبي صلى الله عليه وسلم يناجي رجلا في جانب المسجد، فما قام إلى الصلاة حتى نام القوم‏.‏",
      "text_en": " Narrated Anas:                     Once the Iqama was pronounced and the Prophet was talking to a man (in a low voice) in a corner of the mosque and he did not lead the prayer till (some of) the people had slept (dozed in a sitting posture) .",
      "chain": [
        "30350",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "681",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا عبد العزيز، عن أنس، قال لم يخرج النبي صلى الله عليه وسلم ثلاثا، فأقيمت الصلاة، فذهب أبو بكر يتقدم فقال نبي الله صلى الله عليه وسلم بالحجاب فرفعه، فلما وضح وجه النبي صلى الله عليه وسلم ما نظرنا منظرا كان أعجب إلينا من وجه النبي صلى الله عليه وسلم حين وضح لنا، فأومأ النبي صلى الله عليه وسلم بيده إلى أبي بكر أن يتقدم، وأرخى النبي صلى الله عليه وسلم الحجاب، فلم يقدر عليه حتى مات‏.‏",
      "text_en": " Narrated Anas:                     The Prophet did not come out for three days. The people stood for the prayer and Abu Bakr went ahead to lead the prayer. (In the meantime) the Prophet caught hold of the curtain and lifted it. When the face of the Prophet appeared we had never seen a scene more pleasing than the face of the Prophet as it appeared then. The Prophet beckoned to Abu Bakr to lead the people in the prayer and then let the curtain fall. We did not see him (again) till he died.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "706",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا عبد العزيز، عن أنس، قال كان النبي صلى الله عليه وسلم يوجز الصلاة ويكملها‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used to pray a short prayer (in congregation) but used to offer it in a perfect manner.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "718",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، عن عبد العزيز، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ أقيموا الصفوف فإني أراكم خلف ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Straighten your rows, for I see you from behind my back.'",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "856",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، عن عبد العزيز، قال سأل رجل أنسا ما سمعت نبي الله صلى الله عليه وسلم في الثوم فقال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة فلا يقربنا، أو لا يصلين معنا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     A man asked Anas, \"What did you hear from the Prophet about garlic?\" He said, \"The Prophet said, 'Whoever has eaten this plant should neither come near us nor pray with us.\"",
      "chain": [
        "30315",
        "20258",
        "11295"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد بن زيد، عن عبد العزيز، عن أنس،‏.‏ وعن يونس، عن ثابت، عن أنس، قال بينما النبي صلى الله عليه وسلم يخطب يوم الجمعة إذ قام رجل فقال يا رسول الله، هلك الكراع، وهلك الشاء، فادع الله أن يسقينا‏.‏ فمد يديه ودعا‏.‏",
      "text_en": " Narrated Anas:                     While the Prophet was delivering the Khutba on a Friday, a man stood up and said, \"O, Allah's Apostle! The livestock and the sheep are dying, so pray to Allah for rain.\" So he (the Prophet) raised both his hands and invoked Allah (for it).",
      "chain": [
        "30175",
        "20022",
        "11295",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن عبد العزيز بن صهيب، وثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم صلى الصبح بغلس ثم ركب فقال ‏\"‏ الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ فخرجوا يسعون في السكك ويقولون محمد والخميس  قال والخميس الجيش  فظهر عليهم رسول الله صلى الله عليه وسلم فقتل المقاتلة وسبى الذراري، فصارت صفية لدحية الكلبي، وصارت لرسول الله صلى الله عليه وسلم ثم تزوجها وجعل صداقها عتقها‏.‏ فقال عبد العزيز لثابت يا أبا محمد، أنت سألت أنسا ما أمهرها قال أمهرها نفسها‏.‏ فتبسم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle (p.b.u.h) offered the Fajr prayer when it was still dark, then he rode and said, 'Allah Akbar! Khaibar is ruined. When we approach near to a nation, the most unfortunate is the morning of those who have been warned.\" The people came out into the streets saying, \"Muhammad and his army.\" Allah's Apostle vanquished them by force and their warriors were killed; the children and women were taken as captives. Safiya was taken by Dihya Al-Kalbi and later she belonged to Allah's Apostle go who married her and her Mahr was her manumission.",
      "chain": [
        "30175",
        "20022",
        "11295",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1150",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم فإذا حبل ممدود بين الساريتين فقال ‏\"‏ ما هذا الحبل ‏\"‏‏.‏ قالوا هذا حبل لزينب فإذا فترت تعلقت‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا، حلوه، ليصل أحدكم نشاطه، فإذا فتر فليقعد ‏\"‏‏.‏",
      "text_en": "      Narrated Anas bin Malik     Once the Prophet (p.b.u.h) entered the Mosque and saw a rope hanging      in between its two pillars. He said, \"What is this rope?\" The people      said, \"This rope is for Zainab who, when she feels tired, holds it (to     keep standing for the prayer.)\" The Prophet said, \"Don't use it.      Remove the rope. You should pray as long as you feel active, and when      you get tired, sit down.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1248",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ما من الناس من مسلم يتوفى له ثلاث لم يبلغوا الحنث، إلا أدخله الله الجنة بفضل رحمته إياهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"A Muslim whose three children die before the age of puberty will be granted Paradise by Allah due to his mercy for them.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1367",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك  رضى الله عنه  يقول مروا بجنازة فأثنوا عليها خيرا، فقال النبي صلى الله عليه وسلم ‏\"‏ وجبت ‏\"‏‏.‏ ثم مروا بأخرى فأثنوا عليها شرا فقال ‏\"‏ وجبت ‏\"‏‏.‏ فقال عمر بن الخطاب  رضى الله عنه  ما وجبت قال ‏\"‏ هذا أثنيتم عليه خيرا فوجبت له الجنة، وهذا أثنيتم عليه شرا فوجبت له النار، أنتم شهداء الله في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A funeral procession passed and the people praised the deceased. The Prophet said, \"It has been affirmed to him.\" Then another funeral procession passed and the people spoke badly of the deceased. The Prophet said, \"It has been affirmed to him\". `Umar bin Al-Khattab asked (Allah's Apostle (p.b.u.h) ), \"What has been affirmed?\" He replied, \"You praised this, so Paradise has been affirmed to him; and you spoke badly of this, so Hell has been affirmed to him. You people are Allah's witnesses on earth.\"",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1381",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من الناس مسلم يموت له ثلاثة من الولد لم يبلغوا الحنث إلا أدخله الله الجنة بفضل رحمته إياهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle (p.b.u.h) said, \"Any Muslim whose three children died before the age of puberty will be granted Paradise by Allah because of His mercy to them.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1680",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي، سمع أبا بكر بن عياش، حدثنا عبد العزيز، لقيت أنسا‏.‏ وحدثني إسماعيل بن أبان، حدثنا أبو بكر، عن عبد العزيز، قال خرجت إلى منى يوم التروية فلقيت أنسا  رضى الله عنه  ذاهبا على حمار فقلت أين صلى النبي صلى الله عليه وسلم هذا اليوم الظهر فقال انظر حيث يصلي أمراؤك فصل‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     I went out to Mina on the day of Tarwiya and met Anas going on a donkey. I asked him, \"Where did the Prophet offer the Zuhr prayer on this day?\" Anas replied, \"See where your chiefs pray and pray similarly.\"",
      "chain": [
        "30026",
        "20373",
        "20312",
        "20436",
        "11295"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ تسحروا فإن في السحور بركة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Take Suhur as there is a blessing in it.\"",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2768",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا ابن علية، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال قدم رسول الله صلى الله عليه وسلم المدينة ليس له خادم، فأخذ أبو طلحة بيدي، فانطلق بي إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أنسا غلام كيس، فليخدمك‏.‏ قال فخدمته في السفر والحضر، ما قال لي لشىء صنعته لم صنعت هذا هكذا ولا لشىء لم أصنعه لم لم تصنع هذا هكذا",
      "text_en": " Narrated Anas:                     When Allah's Apostle came to Medina; he did not have any servant. Abu Talha (Anas' step-father) took me to Allah's Apostle and said, \"O Allah's Apostle! Anas is a wise boy, so let him serve you.\" So, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I refrained from doing anything, he never asked me why I refrained from doing it.",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2835",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال جعل المهاجرون والأنصار يحفرون الخندق حول المدينة، وينقلون التراب على متونهم ويقولون نحن الذين بايعوا محمدا على الإسلام ما بقينا أبدا والنبي صلى الله عليه وسلم يجيبهم ويقول اللهم إنه لا خير إلا خير الآخره فبارك في الأنصار والمهاجره‏.‏",
      "text_en": " Narrated Anas:                     The Emigrants and the Ansar started digging the trench around Medina carrying the earth on their backs and saying, \"We are those who have given a pledge of allegiance to Muhammad that we will I carry on Jihad as long as we live.\" The Prophet kept on replying, \"O Allah, there is no good except the good of the Hereafter; so confer Your Blessings on the Ansar and the Emigrants.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2880",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال لما كان يوم أحد انهزم الناس عن النبي صلى الله عليه وسلم قال ولقد رأيت عائشة بنت أبي بكر وأم سليم وإنهما لمشمرتان أرى خدم سوقهما، تنقزان القرب  وقال غيره تنقلان القرب  على متونهما، ثم تفرغانه في أفواه القوم، ثم ترجعان فتملآنها، ثم تجيئان فتفرغانها في أفواه القوم‏.‏",
      "text_en": " Narrated Anas:                     On the day (of the battle) of Uhad when (some) people retreated and left the Prophet, I saw `Aisha bint Abu Bakr and Um Sulaim, with their robes tucked up so that the bangles around their ankles were visible hurrying with their water skins (in another narration it is said, \"carrying the water skins on their backs\"). Then they would pour the water in the mouths of the people, and return to fill the water skins again and came back again to pour water in the mouths of the people.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3049",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وقال إبراهيم عن عبد العزيز بن صهيب، عن أنس، قال أتي النبي صلى الله عليه وسلم بمال من البحرين، فجاءه العباس فقال يا رسول الله، أعطني فإني فاديت نفسي، وفاديت عقيلا‏.‏ فقال ‏\"‏ خذ ‏\"‏‏.‏ فأعطاه في ثوبه‏.‏",
      "text_en": " (In another narration) Anas said:                      \"Some wealth was brought to the Prophet from Bahrain. Al `Abbas came to him and said, 'O Allah's Apostle! Give me (some of it), as I have paid my and `Aqil's ransom.' The Prophet said, 'Take,' and gave him in his garment.\"",
      "chain": [
        "20187",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3623",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن عبد العزيز، عن أنس، وعن يونس، عن ثابت، عن أنس  رضى الله عنه  قال أصاب أهل المدينة قحط على عهد رسول الله صلى الله عليه وسلم، فبينا هو يخطب يوم جمعة إذ قام رجل فقال يا رسول الله هلكت الكراع، هلكت الشاء، فادع الله يسقينا، فمد يديه ودعا‏.‏ قال أنس وإن السماء لمثل الزجاجة فهاجت ريح أنشأت سحابا ثم اجتمع، ثم أرسلت السماء عزاليها، فخرجنا نخوض الماء حتى أتينا منازلنا، فلم نزل نمطر إلى الجمعة الأخرى، فقام إليه ذلك الرجل  أو غيره  فقال يا رسول الله، تهدمت البيوت، فادع الله يحبسه‏.‏ فتبسم ثم قال ‏\"‏ حوالينا ولا علينا ‏\"‏‏.‏ فنظرت إلى السحاب تصدع حول المدينة كأنه إكليل‏.‏",
      "text_en": " Narrated Anas:                     Once during the lifetime of Allah's Apostle, the people of Medina suffered from drought. So while the Prophet was delivering a sermon on a Friday a man got up saying, \"O Allah's Apostle! The horses and sheep have perished. Will you invoke Allah to bless us with rain?\" The Prophet lifted both his hands and invoked. The sky at that time was as clear as glass. Suddenly a wind blew, raising clouds that gathered together, and it started raining heavily. We came out (of the Mosque) wading through the flowing water till we reached our homes. It went on raining till the next Friday, when the same man or some other man stood up and said, \"O Allah's Apostle! The houses have collapsed; please invoke Allah to withhold the rain.\" On that the Prophet smiled and said, \"O Allah, (let it rain) around us and not on us.\" I then looked at the clouds to see them separating forming a sort of a crown round Medina.",
      "chain": [
        "30175",
        "20022",
        "11295",
        "19",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3660",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال كان رجل نصرانيا فأسلم وقرأ البقرة وآل عمران، فكان يكتب للنبي صلى الله عليه وسلم، فعاد نصرانيا فكان يقول ما يدري محمد إلا ما كتبت له، فأماته الله فدفنوه، فأصبح وقد لفظته الأرض فقالوا هذا فعل محمد وأصحابه، لما هرب منهم نبشوا عن صاحبنا‏.‏ فألقوه فحفروا له فأعمقوا، فأصبح وقد لفظته الأرض، فقالوا هذا فعل محمد وأصحابه نبشوا عن صاحبنا لما هرب منهم‏.‏ فألقوه فحفروا له، وأعمقوا له في الأرض ما استطاعوا، فأصبح قد لفظته الأرض، فعلموا أنه ليس من الناس فألقوه‏.‏",
      "text_en": " Narrated Anas:                     There was a Christian who embraced Islam and read Surat-al-Baqara and Al-`Imran, and he used to write (the revelations) for the Prophet. Later on he returned to Christianity again and he used to say: \"Muhammad knows nothing but what I have written for him.\" Then Allah caused him to die, and the people buried him, but in the morning they saw that the earth had thrown his body out. They said, \"This is the act of Muhammad and his companions. They dug the grave of our companion and took his body out of it because he had run away from them.\" They again dug the grave deeply for him, but in the morning they again saw that the earth had thrown his body out. They said, \"This is an act of Muhammad and his companions. They dug the grave of our companion and threw his body outside it, for he had run away from them.\" They dug the grave for him as deep as they could, but in the morning they again saw that the earth had thrown his body out. So they believed that what had befallen him was not done by human beings and had to leave him thrown (on the ground).",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3831",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال رأى النبي صلى الله عليه وسلم النساء والصبيان مقبلين  قال حسبت أنه قال من عرس  فقام النبي صلى الله عليه وسلم ممثلا، فقال ‏\"‏ اللهم أنتم من أحب الناس إلى ‏\"‏‏.‏ قالها ثلاث مرار‏.‏",
      "text_en": " Narrated Anas:                     The Prophet saw the women and children (of the Ansar) coming forward. (The sub-narrator said, \"I think that Anas said, 'They were returning from a wedding party.\") The Prophet stood up and said thrice, \"By Allah! You are from the most beloved people to me.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3858",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال لما كان يوم أحد انهزم الناس عن النبي صلى الله عليه وسلم وأبو طلحة بين يدى النبي صلى الله عليه وسلم مجوب به عليه بحجفة له، وكان أبو طلحة رجلا راميا شديد القد، يكسر يومئذ قوسين أو ثلاثا، وكان الرجل يمر معه الجعبة من النبل فيقول انشرها لأبي طلحة‏.‏ فأشرف النبي صلى الله عليه وسلم ينظر إلى القوم، فيقول أبو طلحة يا نبي الله بأبي أنت وأمي، لا تشرف يصيبك سهم من سهام القوم، نحري دون نحرك‏.‏ ولقد رأيت عائشة بنت أبي بكر وأم سليم وإنهما لمشمرتان، أرى خدم سوقهما، تنقزان القرب على متونهما، تفرغانه في أفواه القوم، ثم ترجعان فتملآنها، ثم تجيآن فتفرغانه في أفواه القوم، ولقد وقع السيف من يدى أبي طلحة إما مرتين، وإما ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     On the day of the battle of Uhud, the people ran away, leaving the Prophet , but Abu- Talha was shielding the Prophet with his shield in front of him. Abu Talha was a strong, experienced archer who used to keep his arrow bow strong and well stretched. On that day he broke two or three arrow bows. If any man passed by carrying a quiver full of arrows, the Prophet would say to him, \"Empty it in front of Abu Talha.\" When the Prophet stated looking at the enemy by raising his head, Abu Talha said, \"O Allah's Prophet! Let my parents be sacrificed for your sake! Please don't raise your head and make it visible, lest an arrow of the enemy should hit you. Let my neck and chest be wounded instead of yours.\" (On that day) I saw `Aisha, the daughter of Abu Bakr and Um Sulaim both lifting their dresses up so that I was able to see the ornaments of their legs, and they were carrying the water skins of their arms to pour the water into the mouths of the thirsty people and then go back and fill them and come to pour the water into the mouths of the people again. (On that day) Abu Talha's sword fell from his hand twice or thrice.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3959",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد، حدثنا عبد الصمد، حدثنا أبي، حدثنا عبد العزيز بن صهيب، حدثنا أنس بن مالك  رضى الله عنه  قال أقبل نبي الله صلى الله عليه وسلم إلى المدينة وهو مردف أبا بكر، وأبو بكر شيخ يعرف، ونبي الله صلى الله عليه وسلم شاب لا يعرف، قال فيلقى الرجل أبا بكر فيقول يا أبا بكر، من هذا الرجل الذي بين يديك فيقول هذا الرجل يهديني السبيل‏.‏ قال فيحسب الحاسب أنه إنما يعني الطريق، وإنما يعني سبيل الخير، فالتفت أبو بكر، فإذا هو بفارس قد لحقهم، فقال يا رسول الله، هذا فارس قد لحق بنا‏.‏ فالتفت نبي الله صلى الله عليه وسلم فقال ‏\"‏ اللهم اصرعه ‏\"‏‏.‏ فصرعه الفرس، ثم قامت تحمحم فقال يا نبي الله مرني بما شئت‏.‏ قال ‏\"‏ فقف مكانك، لا تتركن أحدا يلحق بنا ‏\"‏‏.‏ قال فكان أول النهار جاهدا على نبي الله صلى الله عليه وسلم، وكان آخر النهار مسلحة له، فنزل رسول الله صلى الله عليه وسلم جانب الحرة، ثم بعث إلى الأنصار، فجاءوا إلى نبي الله صلى الله عليه وسلم فسلموا عليهما، وقالوا اركبا آمنين مطاعين‏.‏ فركب نبي الله صلى الله عليه وسلم وأبو بكر، وحفوا دونهما بالسلاح، فقيل في المدينة جاء نبي الله، جاء نبي الله صلى الله عليه وسلم‏.‏ فأشرفوا ينظرون ويقولون جاء نبي الله، جاء نبي الله‏.‏ فأقبل يسير حتى نزل جانب دار أبي أيوب، فإنه ليحدث أهله، إذ سمع به عبد الله بن سلام وهو في نخل لأهله يخترف لهم، فعجل أن يضع الذي يخترف لهم فيها، فجاء وهى معه، فسمع من نبي الله صلى الله عليه وسلم ثم رجع إلى أهله، فقال نبي الله صلى الله عليه وسلم ‏\"‏ أى بيوت أهلنا أقرب ‏\"‏‏.‏ فقال أبو أيوب أنا يا نبي الله، هذه داري، وهذا بابي‏.‏ قال ‏\"‏ فانطلق فهيئ لنا مقيلا ‏\"‏‏.‏ قال قوما على بركة الله‏.‏ فلما جاء نبي الله صلى الله عليه وسلم جاء عبد الله بن سلام فقال أشهد أنك رسول الله، وأنك جئت بحق، وقد علمت يهود أني سيدهم وابن سيدهم، وأعلمهم وابن أعلمهم، فادعهم فاسألهم عني قبل أن يعلموا أني قد أسلمت، فإنهم إن يعلموا أني قد أسلمت قالوا في ما ليس في‏.‏ فأرسل نبي الله صلى الله عليه وسلم فأقبلوا فدخلوا عليه‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر اليهود، ويلكم اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أني رسول الله حقا، وأني جئتكم بحق فأسلموا ‏\"‏‏.‏ قالوا ما نعلمه‏.‏ قالوا للنبي صلى الله عليه وسلم قالها ثلاث مرار‏.‏ قال ‏\"‏ فأى رجل فيكم عبد الله بن سلام ‏\"‏‏.‏ قالوا ذاك سيدنا وابن سيدنا، وأعلمنا وابن أعلمنا‏.‏ قال ‏\"‏ أفرأيتم إن أسلم ‏\"‏‏.‏ قالوا حاشا لله، ما كان ليسلم‏.‏ قال ‏\"‏ أفرأيتم إن أسلم ‏\"‏‏.‏ قالوا حاشا لله، ما كان ليسلم‏.‏ قال ‏\"‏ يا ابن سلام، اخرج عليهم ‏\"‏‏.‏ فخرج فقال يا معشر اليهود، اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أنه رسول الله، وأنه جاء بحق‏.‏ فقالوا كذبت‏.‏ فأخرجهم رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle arrived at Medina with Abu Bakr, riding behind him on the same camel. Abu Bakr was an elderly man known to the people, while Allah's Apostle was a youth that was unknown. Thus, if a man met Abu Bakr, he would day, \"O Abu Bakr! Who is this man in front of you?\" Abu Bakr would say, \"This man shows me the Way,\" One would think that Abu Bakr meant the road, while in fact, Abu Bakr meant the way of virtue and good. Then Abu Bakr looked behind and saw a horse-rider persuing them. He said, \"O Allah's Apostle! This is a horse-rider persuing us.\" The Prophet looked behind and said, \"O Allah! Cause him to fall down.\" So the horse threw him down and got up neighing. After that the rider, Suraqa said, \"O Allah's Prophet! Order me whatever you want.\" The Prophet said, \"Stay where you are and do not allow anybody to reach us.\" So, in the first part of the day Suraqa was an enemy of Allah's Prophet and in the last part of it, he was a protector. Then Allah's Apostle alighted by the side of the Al-Harra and sent a message to the Ansar, and they came to Allah's Prophet and Abu Bakr, and having greeted them, they said, \"Ride (your she-camels) safe and obeyed.\" Allah's Apostle and Abu Bakr rode and the Ansar, carrying their arms, surrounded them. The news that Allah's Prophet had come circulated in Medina. The people came out and were eagerly looking and saying \"Allah's Prophet has come! Allah's Prophet has come! So the Prophet went on till he alighted near the house of Abu Aiyub. While the Prophet was speaking with the family members of Abu Aiyub, `Abdullah bin Salam heard the news of his arrival while he himself was picking the dates for his family from his family garden. He hurried to the Prophet carrying the dates which he had collected for his family from the garden. He listened to Allah's Prophet and then went home. Then Allah's Prophet said, \"Which is the nearest of the houses of our Kith and kin?\" Abu Aiyub replied, \"Mine, O Allah's Prophet! This is my house and this is my gate.\" The Prophet said, \"Go and prepare a place for our midday rest.\" Abu Aiyub said, \"Get up (both of you) with Allah's Blessings.\" So when Allah's Prophet went into the house, `Abdullah bin Salaim came and said \"I testify that you (i.e. Muhammad) are Apostle of Allah and that you have come with the Truth. The Jews know well that I am their chief and the son of their chief and the most learned amongst them and the son of the most learned amongst them. So send for them (i.e. Jews) and ask them about me before they know that I have embraced Islam, for if they know that they will say about me things which are not correct.\" So Allah's Apostle sent for them, and they came and entered. Allah's Apostle said to them, \"O (the group of) Jews! Woe to you: be afraid of Allah. By Allah except Whom none has the right to be worshipped, you people know for certain, that I am Apostle of Allah and that I have come to you with the Truth, so embrace Islam.\" The Jews replied, \"We do not know this.\" So they said this to the Prophet and he repeated it thrice. Then he said, \"What sort of a man is `Abdullah bin Salam amongst you?\" They said, \"He is our chief and the son of our chief and the most learned man, and the son of the most learned amongst us.\" He said, \"What would you think if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \" What would you think if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \"What would you think if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \"O Ibn Salaim! Come out to them.\" He came out and said, \"O (the group of) Jews! Be afraid of Allah except Whom none has the right to be worshipped. You know for certain that he is Apostle of Allah and that he has brought a True Religion!' They said, \"You tell a lie.\" On that Allah's Apostle turned them out.",
      "chain": [
        "30213",
        "20250",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4113",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال لما كان يوم أحد انهزم الناس عن النبي صلى الله عليه وسلم وأبو طلحة بين يدى النبي صلى الله عليه وسلم مجوب عليه بحجفة له، وكان أبو طلحة رجلا راميا شديد النزع، كسر يومئذ قوسين أو ثلاثا، وكان الرجل يمر معه بجعبة من النبل فيقول انثرها لأبي طلحة‏.‏ قال ويشرف النبي صلى الله عليه وسلم ينظر إلى القوم، فيقول أبو طلحة بأبي أنت وأمي، لا تشرف يصيبك سهم من سهام القوم، نحري دون نحرك‏.‏ ولقد رأيت عائشة بنت أبي بكر وأم سليم، وإنهما لمشمرتان أرى خدم سوقهما تنقزان القرب على متونهما، تفرغانه في أفواه القوم ثم ترجعان فتملآنها، ثم تجيئان فتفرغانه في أفواه القوم، ولقد وقع السيف من يدى أبي طلحة إما مرتين وإما ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     When it was the day of Uhud, the people left the Prophet while Abu Talha was in front of the Prophet shielding him with his leather shield. Abu Talha was a skillful archer who used to shoot violently. He broke two or three arrow bows on that day. If a man carrying a quiver full of arrows passed by, the Prophet would say (to him), put (scatter) its contents for Abu Talha.\" The Prophet would raise his head to look at the enemy, whereupon Abu Talha would say, \"Let my father and mother be sacrificed for you ! Do not raise your head, lest an arrow of the enemy should hit you. (Let) my neck (be struck) rather than your neck.\" I saw `Aisha, the daughter of Abu Bakr, and Um Sulaim rolling up their dresses so that I saw their leg-bangles while they were carrying water skins on their backs and emptying them in the mouths of the (wounded) people. They would return to refill them and again empty them in the mouths of the (wounded) people. The sword fell from Abu Talha's hand twice or thrice (on that day).",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4137",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سبعين رجلا لحاجة يقال لهم القراء، فعرض لهم حيان من بني سليم رعل وذكوان، عند بئر يقال لها بئر معونة، فقال القوم والله ما إياكم أردنا، إنما نحن مجتازون في حاجة للنبي صلى الله عليه وسلم، فقتلوهم فدعا النبي صلى الله عليه وسلم عليهم شهرا في صلاة الغداة، وذلك بدء القنوت وما كنا نقنت‏.‏ قال عبد العزيز وسأل رجل أنسا عن القنوت أبعد الركوع، أو عند فراغ من القراءة قال لا بل عند فراغ من القراءة‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     Anas said, \"The Prophet sent seventy men, called Al-Qurra 'for some purpose. The two groups of Bani Sulaim called Ri'l and Dhakwan, appeared to them near a well called Bir Ma'una. The people (i.e. Al- Qurra) said, 'By Allah, we have not come to harm you, but we are passing by you on our way to do something for the Prophet.' But (the infidels) killed them. The Prophet therefore invoked evil upon them for a month during the morning prayer. That was the beginning of Al Qunut and we used not to say Qunut before that.\" A man asked Anas about Al-Qunut, \"Is it to be said after the Bowing (in the prayer) or after finishing the Recitation (i.e. before Bowing)?\" Anas replied, \"No, but (it is to be said) after finishing the Recitation.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن عبد العزيز، عن أنس  رضى الله عنه  قال جعل المهاجرون والأنصار يحفرون الخندق حول المدينة، وينقلون التراب على متونهم وهم يقولون نحن الذين بايعوا محمدا على الإسلام ما بقينا أبدا قال يقول النبي صلى الله عليه وسلم وهو يجيبهم ‏\"‏ اللهم إنه لا خير إلا خير الآخره، فبارك في الأنصار والمهاجره ‏\"‏‏.‏ قال يؤتون بملء كفى من الشعير فيصنع لهم بإهالة سنخة توضع بين يدى القوم، والقوم جياع، وهى بشعة في الحلق ولها ريح منتن‏.‏",
      "text_en": " Narrated Anas:                     Al-Muhajirun (i.e. the Emigrants) and the Ansar were digging the trench around Medina and were carrying the earth on their backs while saying, \"We are those who have given the pledge of allegiance to Muhammad for Islam as long as we live.\" The Prophet said in reply to their saying, \"O Allah! There is no goodness except the goodness of the Hereafter; so please grant Your Blessing to the Ansar and the Emigrants.\" The people used to bring a handful of barley, and a meal used to be prepared thereof by cooking it with a cooking material (i.e. oil, fat and butter having a change in color and smell) and it used to be presented to the people (i.e. workers) who were hungry, and it used to stick to their throats and had a nasty smell.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4250",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن عبد العزيز بن صهيب، قال سمعت أنس بن مالك  رضى الله عنه  يقول سبى النبي صلى الله عليه وسلم صفية، فأعتقها وتزوجها‏.‏ فقال ثابت لأنس ما أصدقها قال أصدقها نفسها فأعتقها‏.‏",
      "text_en": " Narrated `Abdul `Aziz bin Suhaib:                     Anas bin Malik said, \"The Prophet took Safiya as a captive. He manumitted her and married her.\" Thabit asked Anas, \"What did he give her as Mahr (i.e. marriage gift)?\" Anas replied. \"Her Mahr was herself, for he manumitted her.\"",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4563",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن عبد العزيز، عن أنس، قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used to say, \"O Allah! Our Lord! Give us in this world that, which is good and in the Hereafter that, which is good and save us from the torment of the Fire.\" (2.201)",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4660",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا عبد العزيز بن صهيب، قال قال أنس بن مالك  رضى الله عنه  ما كان لنا خمر غير فضيخكم هذا الذي تسمونه الفضيخ‏.‏ فإني لقائم أسقي أبا طلحة وفلانا وفلانا إذ جاء رجل فقال وهل بلغكم الخبر فقالوا وما ذاك قال حرمت الخمر‏.‏ قالوا أهرق هذه القلال يا أنس‏.‏ قال فما سألوا عنها ولا راجعوها بعد خبر الرجل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We had no alcoholic drink except that which was produced from dates and which you call Fadikh. While I was standing offering drinks to Abu Talh and so-and-so and so-and-so, a man cam and said, \"Has the news reached you? They said, \"What is that?\" He said. \"Alcoholic drinks have been prohibited. They said, \"Spill (the contents of these pots, O Anas! \"Then they neither asked about it (alcoholic drinks) nor returned it after the news from that man.",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4840",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس  رضى الله عنه  قال بني على النبي صلى الله عليه وسلم بزينب ابنة جحش بخبز ولحم فأرسلت على الطعام داعيا فيجيء قوم فيأكلون ويخرجون، ثم يجيء قوم فيأكلون ويخرجون، فدعوت حتى ما أجد أحدا أدعو فقلت يا نبي الله ما أجد أحدا أدعوه قال ارفعوا طعامكم، وبقي ثلاثة رهط يتحدثون في البيت، فخرج النبي صلى الله عليه وسلم فانطلق إلى حجرة عائشة فقال ‏\"‏ السلام عليكم أهل البيت ورحمة الله ‏\"‏‏.‏ فقالت وعليك السلام ورحمة الله، كيف وجدت أهلك بارك الله لك فتقرى حجر نسائه كلهن، يقول لهن كما يقول لعائشة، ويقلن له كما قالت عائشة، ثم رجع النبي صلى الله عليه وسلم فإذا ثلاثة رهط في البيت يتحدثون، وكان النبي صلى الله عليه وسلم شديد الحياء، فخرج منطلقا نحو حجرة عائشة فما أدري آخبرته أو أخبر أن القوم خرجوا، فرجع حتى إذا وضع رجله في أسكفة الباب داخلة وأخرى خارجة أرخى الستر بيني وبينه، وأنزلت آية الحجاب‏.‏",
      "text_en": " Narrated Anas:                     A banquet of bread and meat was held on the occasion of the marriage of the Prophet to Zainab bint Jahsh. I was sent to invite the people (to the banquet), and so the people started coming (in groups); They would eat and then leave. Another batch would come, eat and leave. So I kept on inviting the people till I found nobody to invite. Then I said, \"O Allah's Prophet! I do not find anybody to invite.\" He said, \"Carry away the remaining food.\" Then a batch of three persons stayed in the house chatting. The Prophet left and went towards the dwelling place of Aisha and said, \"Peace and Allah's Mercy be on you, O the people of the house!\" She replied, \"Peace and the mercy of Allah be on you too. How did you find your wife? May Allah bless you. Then he went to the dwelling places of all his other wives and said to them the same as he said to Aisha and they said to him the same as Aisha had said to him. Then the Prophet returned and found a group of three persons still in the house chatting. The Prophet was a very shy person, so he went out (for the second time) and went towards the dwelling place of `Aisha. I do not remember whether I informed him that the people have gone away. So he returned and as soon as he entered the gate, he drew the curtain between me and him, and then the Verse of Al-Hijab was revealed.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5203",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد العزيز بن صهيب، عن أنس، أن عبد الرحمن بن عوف، تزوج امرأة على وزن نواة، فرأى النبي صلى الله عليه وسلم بشاشة العرس فسأله فقال إني تزوجت امرأة على وزن نواة‏.‏ وعن قتادة عن أنس أن عبد الرحمن بن عوف تزوج امرأة على وزن نواة من ذهب‏.‏",
      "text_en": " Narrated Anas:                     `Abdur Rahman bin `Auf married a woman and gave her gold equal to the weight of a date stone (as Mahr). When the Prophet noticed the signs of cheerfulness of the marriage (on his face) and asked him about it, he said, \"I have married a woman and gave (her) gold equal to a date stone in weight (as Mahr).",
      "chain": [
        "20193",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5235",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال أبصر النبي صلى الله عليه وسلم نساء وصبيانا مقبلين من عرس، فقام ممتنا فقال ‏\"‏ اللهم أنتم من أحب الناس إلى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the Prophet saw some women and children coming from a wedding party. He got up energetically and happily and said, \"By Allah! You (i.e., the Ansar) are the most beloved of all people to me.\"",
      "chain": [
        "30147",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5507",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن عبد العزيز، قال قيل لأنس ما سمعت النبي صلى الله عليه وسلم في الثوم فقال ‏\"‏ من أكل فلا يقربن مسجدنا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     It was said to Anas \"What did you hear the Prophet saying about garlic?\" Anas replied, \"Whoever has eaten (garlic) should not approach our mosque.\"",
      "chain": [
        "30175",
        "20258",
        "11295"
      ]
    },
    {
      "hadith_no": "5611",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يضحي بكبشين وأنا أضحي بكبشين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to offer two rams as sacrifices, and I also used to offer two rams.",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5801",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن عبد العزيز، قال دخلت أنا وثابت، على أنس بن مالك فقال ثابت يا أبا حمزة اشتكيت‏.‏ فقال أنس ألا أرقيك برقية رسول الله صلى الله عليه وسلم قال بلى‏.‏ قال ‏\"‏ اللهم رب الناس مذهب الباس اشف أنت الشافي لا شافي إلا أنت، شفاء لا يغادر سقما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     Thabit and I went to Anas bin Malik. Thabit said, \"O Abu Hamza! I am sick.\" On that Anas said, \"Shall I treat you with the Ruqya of Allah's Apostle?\" Thabit said, \"Yes,\" Anas recited, \"O Allah! The Lord of the people, the Remover of trouble! (Please) cure (Heal) (this patient), for You are the Healer. None brings about healing but You; a healing that will leave behind no ailment.\"",
      "chain": [
        "30175",
        "20258",
        "11295"
      ]
    },
    {
      "hadith_no": "5892",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك  قال شعبة فقلت أعن النبي صلى الله عليه وسلم فقال شديدا عن النبي صلى الله عليه وسلم  فقال ‏\"‏ من لبس الحرير في الدنيا فلن يلبسه في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, Whoever wears silk in this world shall not wear it in the Hereafter.\"",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5907",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن عبد العزيز، عن أنس، قال نهى النبي صلى الله عليه وسلم أن يتزعفر الرجل‏.‏",
      "text_en": " Narrated Anas:                     The Prophet forbade men to use saffron.",
      "chain": [
        "30175",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5935",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس  رضى الله عنه  قال صنع النبي صلى الله عليه وسلم خاتما قال ‏\"‏ إنا اتخذنا خاتما، ونقشنا فيه نقشا، فلا ينقش عليه أحد ‏\"‏‏.‏ قال فإني لأرى بريقه في خنصره‏.‏",
      "text_en": " Narrated Anas:                     The Prophet got a ring made for himself and said, \"I have got a ring made (for myself) and engraved a certain engraving on it so none of you should get such an engraving on his ring.\" I saw the glitter of the ring on his little finger.",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5938",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  أن رسول الله صلى الله عليه وسلم اتخذ خاتما من فضة، ونقش فيه، محمد رسول الله‏.‏ وقال ‏\"‏ إني اتخذت خاتما من ورق، ونقشت فيه، محمد رسول الله‏.‏ فلا ينقشن أحد على نقشه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle took a silver ring and had 'Muhammad, the Apostle' of Allah' engraved on it. The Prophet then said (to us), 'I have a silver ring with 'Muhammad, the Apostle of Allah engraved on it, so none of you should have the same engraving on his ring.\"",
      "chain": [
        "30175",
        "20022",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6025",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أنس  رضى الله عنه  قال كان قرام لعائشة سترت به جانب بيتها، فقال لها النبي صلى الله عليه وسلم ‏\"‏ أميطي عني، فإنه لا تزال تصاويره تعرض لي في صلاتي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Aisha had a thick curtain (having pictures on it) and she screened the side of her i house with it. The Prophet said to her, \"Remove it from my sight, for its pictures are still coming to my mind in my prayers.\"",
      "chain": [
        "30156",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6365",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد العزيز، عن أنس   رضى الله عنه  قال أقيمت الصلاة ورجل يناجي رسول الله صلى الله عليه وسلم فما زال يناجيه حتى نام أصحابه، ثم قام فصلى‏.‏",
      "text_en": " Narrated Anas:                     The Iqama for the prayer was announced while a man was talking to Allah's Apostle privately. He continued talking in that way till the Prophet's companions slept, and afterwards the Prophet got up and offered the prayer with them.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6395",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم إذا دخل الخلاء قال ‏\"‏ اللهم إني أعوذ بك من الخبث والخبائث ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet went to the lavatory, he used to say: \"Allahumma Inni a`udhu bika minalkhubthi Wal khaba'ith.\"",
      "chain": [
        "20282",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6412",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا عبد العزيز، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دعا أحدكم فليعزم المسألة، ولا يقولن اللهم إن شئت فأعطني‏.‏ فإنه لا مستكره له ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"When anyone of you appeal to Allah for something, he should ask with determination and should not say, 'O Allah, if You wish, give me.', for nobody can force Allah to do something against His Will.",
      "chain": [
        "30175",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6425",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا ابن سلام، أخبرنا إسماعيل ابن علية، عن عبد العزيز بن صهيب، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يتمنين أحد منكم الموت لضر نزل به، فإن كان لا بد متمنيا للموت فليقل اللهم أحيني ما كانت الحياة خيرا لي، وتوفني إذا كانت الوفاة خيرا لي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said,\" None of you should long for death because of a calamity that had befallen him, and if he cannot, but long for death, then he should say, 'O Allah! Let me live as long as life is better for me, and take my life if death is better for me.' \"",
      "chain": [
        "30376",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "6445",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم يتعوذ يقول ‏\"‏ اللهم إني أعوذ بك من الكسل، وأعوذ بك من الجبن، وأعوذ بك من الهرم، وأعوذ بك من البخل ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle used to seek refuge with Allah saying, \"O Allah! I seek refuge with You from laziness, and seek refuge with You from cowardice, and seek refuge with You from geriatric old age, and seek refuge with You from miserliness.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    }
  ],
  "total_hadiths": 146
}