{
  "id": "11299",
  "name": "Ghalib bin Khataf al-Qatan غالب بن خطاف القطان",
  "full_name": "Ghalib bin Khataf al-Qatan غالب بن خطاف القطان",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]",
      "Fiqh"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11265",
      "name": "Abu al-Juza' - Aws bin 'Abdullah أبو الجوزاء - أوس بن عبد الله الربعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19858",
      "name": "Malik bin Dinar al-Naji مالك بن دينار السامي الناجي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14466",
      "name": "Abu al-Mahzam أبو المهزم - يزيد بن سفيان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20227",
      "name": "Khalid bin 'Abdur Rahman خالد بن عبد الرحمن بن بكير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20715",
      "name": "'Abdullah bin Shwdhb عبد الله بن شوذب الخراساني أبو عبد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-385",
      "hadith_no": "385",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا بشر بن المفضل، قال حدثني غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع النبي صلى الله عليه وسلم فيضع أحدنا طرف الثوب من شدة الحر في مكان السجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet and some of us used to place the ends of their clothes at the place of prostration because of scorching heat.",
      "usc_msa_ref": "382",
      "chain": [
        "20296",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-542",
      "hadith_no": "542",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد  يعني ابن مقاتل  قال أخبرنا عبد الله، قال أخبرنا خالد بن عبد الرحمن، حدثني غالب القطان، عن بكر بن عبد الله المزني، عن أنس بن مالك، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم بالظهائر فسجدنا على ثيابنا اتقاء الحر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When we offered the Zuhr prayers behind Allah's Apostle we used to prostrate on our clothes to protect ourselves from the heat.",
      "usc_msa_ref": "517",
      "chain": [
        "30118",
        "20025",
        "20227",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1208",
      "hadith_no": "1208",
      "source": "Sahih Bukhari",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا غالب، عن بكر بن عبد الله، عن أنس بن مالك  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم في شدة الحر، فإذا لم يستطع أحدنا أن يمكن وجهه من الأرض بسط ثوبه فسجد عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet in scorching heat, and if someone of us could not put his face on the earth (because of the heat) then he would spread his clothes and prostrate over them.",
      "usc_msa_ref": "299",
      "chain": [
        "30175",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1438",
      "hadith_no": "1438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، حدثنا بشر بن المفضل، عن غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن جبهته من الأرض بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " Anas b. Malik reported:                      We used to say (the noonprayer) with the Messenger of Allah (may peace be upon him) in the intense heat, but when someone amongst us found it hard to place his forehead on the ground, he spread his cloth and prostrated on it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-660",
      "hadith_no": "660",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - حدثنا غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن وجهه من الأرض بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " Anas b. Malik said:                      we used to pray along with the Messenger of Allah (ﷺ) in intense heat. When any of us could not rest his face on bare ground while prostrating due to intense heat he spread his cloth and would prostrate on it.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2934",
      "hadith_no": "2934",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا غالب القطان، عن رجل، عن أبيه، عن جده، أنهم كانوا على منهل من المناهل فلما بلغهم الإسلام جعل صاحب الماء لقومه مائة من الإبل على أن يسلموا فأسلموا وقسم الإبل بينهم وبدا له أن يرتجعها منهم فأرسل ابنه إلى النبي صلى الله عليه وسلم فقال له ائت النبي صلى الله عليه وسلم فقل له إن أبي يقرئك السلام وإنه جعل لقومه مائة من الإبل على أن يسلموا فأسلموا وقسم الإبل بينهم وبدا له أن يرتجعها منهم أفهو أحق بها أم هم فإن قال لك نعم أو لا فقل له إن أبي شيخ كبير وهو عريف الماء وإنه يسألك أن تجعل لي العرافة بعده ‏.‏ فأتاه فقال إن أبي يقرئك السلام ‏.‏ فقال ‏\"‏ وعليك وعلى أبيك السلام ‏\"‏ ‏.‏ فقال إن أبي جعل لقومه مائة من الإبل على أن يسلموا فأسلموا وحسن إسلامهم ثم بدا له أن يرتجعها منهم أفهو أحق بها أم هم فقال ‏\"‏ إن بدا له أن يسلمها لهم فليسلمها وإن بدا له أن يرتجعها فهو أحق بها منهم فإن هم أسلموا فلهم إسلامهم وإن لم يسلموا قوتلوا على الإسلام ‏\"‏ ‏.‏ فقال إن أبي شيخ كبير وهو عريف الماء وإنه يسألك أن تجعل لي العرافة بعده ‏.‏ فقال ‏\"‏ إن العرافة حق ولا بد للناس من العرفاء ولكن العرفاء في النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Ghalib al-Qattan:                     Ghalib quoted a man who stated on the authority of his father that his grandfather reported: They lived at one of the springs. When Islam reached them, the master of the spring offered his people one hundred camels if they embraced Islam. So they embraced Islam, and he distributed the camels among them. But it occurred to him that he should take the camels back from them.  He sent his son to the Prophet (ﷺ) and said to him: Go to the Prophet (ﷺ) and tell him: My father extends his greetings to you. He asked his people to give them one hundred camels if they embraced Islam, and they embraced Islam. He divided the camels among them. But it occurred to him then that he should withdraw his camels from them. Is he more entitled to them or we? If he says: Yes or no, then tell him: My father is an old man, and he is the chief of the people living at the water. He has requested you to make me chief after him.  He came to him and said: My father has extended his greetings to you.  He replied: On you and you father be peace.  He said: My father asked his people to give them one hundred camels if they embraced Islam. So they embraced Islam, and their belief in Islam is good. Then it occurred to him that he should take his camels back from them. Is he more entitled to them or are they?  He said: If he likes to give them the camels, he may give them; and if he likes to take them back, he is more entitled to them than his people. If they embraced Islam, then for them is their Islam. If they do not embrace Islam, they will be fought against in the cause of Islam.  He said: My father is an old man; he is the chief of the people living at the spring. He has asked you to appoint me chief after him.  He replied: The office of a chief is necessary, for people must have chiefs, but the chiefs will go to Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11299"
      ]
    },
    {
      "id": "sunan-abi-daud-5231",
      "hadith_no": "5231",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل، عن غالب، قال إنا لجلوس بباب الحسن إذ جاء رجل فقال حدثني أبي عن جدي قال بعثني أبي إلى رسول الله صلى الله عليه وسلم فقال ائته فأقرئه السلام ‏.‏ قال فأتيته فقلت إن أبي يقرئك السلام ‏.‏ فقال ‏\"‏ عليك وعلى أبيك السلام ‏\"‏ ‏.‏",
      "text_en": " Narrated A man:                     Ghalib said: When we were sitting at al-Hasan's door, a man came along. He said: My father told me on the authority of my grandfather, saying: My father sent me to the Messenger of Allah (ﷺ) and said: Go to him and give him a greeting. So I went to him and said: My father sends you a greeting. He said: Upon you and upon your father be peace.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30103",
        "11299"
      ]
    },
    {
      "id": "jami-al-tirmidhi-584",
      "hadith_no": "584",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن محمد، حدثنا عبد الله بن المبارك، أخبرنا خالد بن عبد الرحمن، قال حدثني غالب القطان، عن بكر بن عبد الله المزني، عن أنس بن مالك، قال كنا إذا صلينا خلف النبي صلى الله عليه وسلم بالظهائر سجدنا على ثيابنا اتقاء الحر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن جابر بن عبد الله وابن عباس ‏.‏ وقد روى وكيع هذا الحديث عن خالد بن عبد الرحمن ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"When we prayed behind the Prophet in the midday heat, we would prostrate on our garments as a protection against the heat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "20227",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-615",
      "hadith_no": "615",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "وقال محمد حدثنا ابن نمير، عن عبيد الله بن موسى، عن غالب، بهذا ‏.‏",
      "text_en": " Muhammad said:                     \"Ibn Numair narrated to us from Ubaidullah bin Musa, from Ghalib\" with this (Hadith).",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30212",
        "20340",
        "11299"
      ]
    },
    {
      "id": "sunan-an-nasai-1116",
      "hadith_no": "1116",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن خالد بن عبد الرحمن، - هو السلمي - قال حدثني غالب القطان، عن بكر بن عبد الله المزني، عن أنس، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم بالظهائر سجدنا على ثيابنا اتقاء الحر ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"When he prayed Zuhr behind the Messenger of Allah (ﷺ) we would prostrate on our garments because of the heat.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-1086",
      "hadith_no": "1086",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب، حدثنا بشر بن المفضل، عن غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع النبي  صلى الله عليه وسلم  في شدة الحر فإذا لم يقدر أحدنا أن يمكن جبهته بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “We used to perform prayerwiththe Prophet (ﷺ) when it was very hot. When one of us could notplace his forehead firmly on the ground, he would spread his garmentand prostrates on it.”",
      "usc_msa_ref": "",
      "chain": [
        "34027",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    }
  ],
  "total_hadiths": 11
}