{
  "id": "11290",
  "name": "Siyar bin Salaama, Abu al-Minhal سيار بن سلامة الرياحي أبو المنهال",
  "full_name": "Siyar bin Salaama, Abu al-Minhal سيار بن سلامة الرياحي أبو المنهال",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Rayahi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "227",
      "name": "Abu Burzah al-Aslami ( أبو برزة الأسلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18072",
      "name": "al-Bra'a al-Slyty البراء السليطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11424",
      "name": "Rafi' bin Mahran Abi al-Aliya رفيع بن مهران أبي العالية الرياحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11589",
      "name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24191",
      "name": "Sawar bin 'Abdullah bin Qadama سوار بن عبد الله بن قدامة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "541",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي المنهال، عن أبي برزة، كان النبي صلى الله عليه وسلم يصلي الصبح وأحدنا يعرف جليسه، ويقرأ فيها ما بين الستين إلى المائة، ويصلي الظهر إذا زالت الشمس، والعصر وأحدنا يذهب إلى أقصى المدينة ثم يرجع والشمس حية، ونسيت ما قال في المغرب، ولا يبالي بتأخير العشاء إلى ثلث الليل‏.‏ ثم قال إلى شطر الليل‏.‏ وقال معاذ قال شعبة ثم لقيته مرة فقال أو ثلث الليل‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     Abu Barza said, \"The Prophet used to offer the Fajr (prayer) when one could recognize the person sitting by him (after the prayer) and he used to recite between 60 to 100 Ayat (verses) of the Qur'an. He used to offer the Zuhr prayer as soon as the sun declined (at noon) and the `Asr at a time when a man might go and return from the farthest place in Medina and find the sun still hot. (The sub-narrator forgot what was said about the Maghrib). He did not mind delaying the `Isha prayer to one third of the night or the middle of the night.\"",
      "chain": [
        "30329",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا عوف، عن سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي، فقال له أبي كيف كان رسول الله صلى الله عليه وسلم يصلي المكتوبة فقال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية  ونسيت ما قال في المغرب  وكان يستحب أن يؤخر العشاء التي تدعونها العتمة، وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه، ويقرأ بالستين إلى المائة‏.‏",
      "text_en": " Narrated Saiyar bin Salama:                     I along with my father went to Abu- Barza Al-Aslami and my father asked him, \"How Allah's Apostle used to offer the five compulsory congregational prayers?\" Abu- Barza said, \"The Prophet used to pray the Zuhr prayer which you (people) call the first one at midday when the sun had just declined The `Asr prayer at a time when after the prayer, a man could go to the house at the farthest place in Medina (and arrive) while the sun was still hot. (I forgot about the Maghrib prayer). The Prophet Loved to delay the `Isha which you call Al- `Atama [??] and he disliked sleeping before it and speaking after it. After the Fajr prayer he used to leave when a man could recognize the one sitting beside him and he used to recite between 60 to 100 Ayat (in the Fajr prayer) .",
      "chain": [
        "30118",
        "20025",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "568",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا عبد الوهاب الثقفي، قال حدثنا خالد الحذاء، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يكره النوم قبل العشاء والحديث بعدها‏.‏",
      "text_en": " Narrated Abu Barza:                     Allah's Apostle disliked to sleep before the `Isha' prayer and to talk after it.",
      "chain": [
        "30376",
        "20259",
        "11282",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "599",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، قال حدثنا عوف، قال حدثنا أبو المنهال، قال انطلقت مع أبي إلى أبي برزة الأسلمي فقال له أبي حدثنا كيف، كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير وهى التي تدعونها الأولى حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى أهله في أقصى المدينة والشمس حية، ونسيت ما قال في المغرب‏.‏ قال وكان يستحب أن يؤخر العشاء‏.‏ قال وكان يكره النوم قبلها والحديث بعدها، وكان ينفتل من صلاة الغداة حين يعرف أحدنا جليسه، ويقرأ من الستين إلى المائة‏.‏",
      "text_en": " Narrated Abu-l-Minhal:                     My father and I went to Abi Barza Al-Aslami and my father said to him, \"Tell us how Allah's Apostle used to offer the compulsory congregational prayers.\" He said, \"He used to pray the Zuhr prayer, which you call the first prayer, as the sun declined at noon, the `Asr at a time when one of US could go to his family at the farthest place in Medina while the sun was still hot. (The narrator forgot what Abu Barza had said about the Maghrib prayer), and the Prophet preferred to pray the `Isha' late and disliked to sleep before it or talk after it. And he used to return after finishing the morning prayer at such a time when it was possible for one to recognize the person sitting by his side and he (the Prophet) used to recite 60 to 100 'Ayat' (verses) of the Qur'an in it.\"",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "771",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي فسألناه عن وقت الصلوات، فقال كان النبي صلى الله عليه وسلم يصلي الظهر حين تزول الشمس، والعصر ويرجع الرجل إلى أقصى المدينة والشمس حية، ونسيت ما قال في المغرب، ولا يبالي بتأخير العشاء إلى ثلث الليل ولا يحب النوم قبلها، ولا الحديث بعدها، ويصلي الصبح فينصرف الرجل فيعرف جليسه، وكان يقرأ في الركعتين أو إحداهما ما بين الستين إلى المائة‏.‏",
      "text_en": " Narrated Saiyar bin Salama:                     My father and I went to Abu Barza-al-Aslami to ask him about the stated times for the prayers. He replied, \"The Prophet used to offer the Zuhr prayer when the sun just declined from its highest position at noon; the `Asr at a time when if a man went to the farthest place in Medina (after praying) he would find the sun still hot (bright). (The sub narrator said: I have forgotten what Abu Barza said about the Maghrib prayer). The Prophet never found any harm in delaying the `Isha' prayer to the first third of the night and he never liked to sleep before it and to talk after it. He used to offer the morning prayer at a time when after finishing it one could recognize the person sitting beside him and used to recite between 60 to 100 verses in one or both the rak`at.\"",
      "chain": [
        "20404",
        "20020",
        "11290"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، عن أبي المنهال، قال كنت أتجر في الصرف، فسألت زيد بن أرقم  رضى الله عنه  فقال قال النبي صلى الله عليه وسلم‏.‏    وحدثني الفضل بن يعقوب، حدثنا الحجاج بن محمد، قال ابن جريج أخبرني عمرو بن دينار، وعامر بن مصعب، أنهما سمعا أبا المنهال، يقول سألت البراء بن عازب وزيد بن أرقم عن الصرف، فقالا كنا تاجرين على عهد رسول الله صلى الله عليه وسلم فسألنا رسول الله صلى الله عليه وسلم عن الصرف فقال ‏\"‏ إن كان يدا بيد فلا بأس، وإن كان نساء فلا يصلح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the Prophet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam about practicing money exchange. They replied, 'We were traders in the time of Allah's Apostle and I asked Allah's Apostle about money exchange. He replied, 'If it is from hand to hand, there is no harm in it; otherwise it is not permissible.\"",
      "chain": [
        "20241",
        "11070",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني حبيب بن أبي ثابت، قال سمعت أبا المنهال، قال سألت البراء بن عازب وزيد بن أرقم  رضى الله عنهم  عن الصرف،، فكل واحد منهما يقول هذا خير مني‏.‏ فكلاهما يقول نهى رسول الله صلى الله عليه وسلم عن بيع الذهب بالورق دينا‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I asked Al-Bara' bin `Azib and Zaid bin Arqam about money exchanges. Each of them said, \"This is better than I,\" and both of them said, \"Allah's Apostle forbade the selling of silver for gold on credit. \"",
      "chain": [
        "30329",
        "20020",
        "11331",
        "11290",
        "400"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل ابن علية، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم المدينة، والناس يسلفون في الثمر العام والعامين  أو قال عامين أو ثلاثة‏.‏ شك إسماعيل  فقال ‏\"‏ من سلف في تمر فليسلف في كيل معلوم، ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle came to Medina and the people used to pay in advance the price of fruits to be delivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or two to three years.) The Prophet said, \"Whoever pays money in advance for dates (to be delivered later) should pay it for known specified weight and measure (of the dates).",
      "chain": [
        "30365",
        "20208",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا صدقة، أخبرنا ابن عيينة، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة، وهم يسلفون بالتمر السنتين والثلاث، فقال ‏\"‏ من أسلف في شىء ففي كيل معلوم ووزن معلوم، إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and the people used to pay in advance the price of dates to be delivered within two or three years. He said (to them), \"Whoever pays in advance the price of a thing to be delivered later should pay it for a specified measure at specified weight for a specified period.\"",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم النبي صلى الله عليه وسلم وقال ‏\"‏ في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came (to Medina) and he told the people (regarding the payment of money in advance that they should pay it) for a known specified measure and a known specified weight and a known specified period.",
      "chain": [
        "30367",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2253",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة وهم يسلفون في الثمار السنتين والثلاث، فقال ‏\"‏ أسلفوا في الثمار في كيل معلوم إلى أجل معلوم ‏\"‏‏.‏ وقال عبد الله بن الوليد حدثنا سفيان، حدثنا ابن أبي نجيح، وقال، ‏\"‏ في كيل معلوم ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and the people used to pay in advance the prices of fruits to be delivered within two to three years. The Prophet said (to them), \"Buy fruits by paying their prices in advance on condition that the fruits are to be delivered to you according to a fixed specified measure within a fixed specified period.\" Ibn Najih said, \" ... by specified measure and specified weight.\"",
      "chain": [
        "20348",
        "20012",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2497",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن عثمان يعني ابن الأسود، قال أخبرني سليمان بن أبي مسلم، قال سألت أبا المنهال عن الصرف، يدا بيد فقال اشتريت أنا وشريك، لي شيئا يدا بيد ونسيئة، فجاءنا البراء بن عازب فسألناه، فقال فعلت أنا وشريكي زيد بن أرقم، وسألنا النبي صلى الله عليه وسلم عن ذلك فقال ‏\"‏ ما كان يدا بيد فخذوه، وما كان نسيئة فذروه ‏\"‏‏.‏",
      "text_en": " Narrated Sulaiman bin Abu Muslim:                     I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine bought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked about it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet and asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"",
      "chain": [
        "30153",
        "20241",
        "20197",
        "11247",
        "11290"
      ]
    },
    {
      "hadith_no": "7197",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن عوف، عن أبي المنهال، قال لما كان ابن زياد ومروان بالشأم، ووثب ابن الزبير بمكة، ووثب القراء بالبصرة، فانطلقت مع أبي إلى أبي برزة الأسلمي حتى دخلنا عليه في داره وهو جالس في ظل علية له من قصب، فجلسنا إليه فأنشأ أبي يستطعمه الحديث فقال يا أبا برزة ألا ترى ما وقع فيه الناس فأول شىء سمعته تكلم به إني احتسبت عند الله أني أصبحت ساخطا على أحياء قريش، إنكم يا معشر العرب كنتم على الحال الذي علمتم من الذلة والقلة والضلالة، وإن الله أنقذكم بالإسلام وبمحمد صلى الله عليه وسلم حتى بلغ بكم ما ترون، وهذه الدنيا التي أفسدت بينكم، إن ذاك الذي بالشأم والله إن يقاتل إلا على الدنيا‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and Qurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we entered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with him and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the people has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of being angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in misery and were few in number and misguided, and that Allah has brought you out of all that with Islam and with Muhammad till He brought you to this state (of prosperity and happiness) which you see now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. The one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: and those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that one who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly gain.\"",
      "chain": [
        "30184",
        "11613",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "7357",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر، قال سمعت عوفا، أن أبا المنهال، حدثه أنه، سمع أبا برزة، قال إن الله يغنيكم أو نغشكم بالإسلام وبمحمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abal Minhal:                     Abu Barza said, \"(O people!) Allah makes you self-sufficient or has raised you high with Islam and with Muhammad",
      "chain": [
        "30142",
        "20288",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "461",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن التيمي، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة من الستين إلى المائة ‏.‏",
      "text_en": " Abu Barza reported:                      The Messenger of Allah (may peace be upon him) used to recite in the morning prayer from sixty to one hundred verses.",
      "chain": [
        "30201",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "461",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن خالد الحذاء، عن أبي المنهال، عن أبي برزة الأسلمي، قال كان رسول الله صلى الله عليه وسلم يقرأ في الفجر ما بين الستين إلى المائة آية ‏.‏",
      "text_en": " Abu Barza Aslami reported:                      The Messenger of Allah (may peace be upon him) used to recite from sixty to one hundred verses in the morning prayer.",
      "chain": [
        "30216",
        "20032",
        "20012",
        "11282",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "1494",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، أخبرني سيار بن سلامة، قال سمعت أبي يسأل أبا برزة، عن صلاة، رسول الله صلى الله عليه وسلم - قال - قلت آنت سمعته قال فقال كأنما أسمعك الساعة - قال - سمعت أبي يسأله عن صلاة رسول الله صلى الله عليه وسلم فقال كان لا يبالي بعض تأخيرها - قال يعني العشاء - إلى نصف الليل ولا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته بعد فسألته فقال وكان يصلي الظهر حين تزول الشمس والعصر يذهب الرجل إلى أقصى المدينة والشمس حية - قال - والمغرب لا أدري أى حين ذكر ‏.‏ قال ثم لقيته بعد فسألته فقال وكان يصلي الصبح فينصرف الرجل فينظر إلى وجه جليسه الذي يعرف فيعرفه ‏.‏ قال وكان يقرأ فيها بالستين إلى المائة ‏.‏",
      "text_en": " Sayyar b. Salama reported:                      I heard my father asking Abu Barza (al- Aslami) about the prayer of Allah's Messenger (may peace be upon him) I (Shu'ba, one of the narrators) said: Did you hear it (from Abu Barza)? He said: 1 feel as if I am bearing you at this very time. He said: I heard my father asking about the prayer of the Messenger of Allah (may peace be upon him) and he (Abu Barza) making this reply: He (the Holy Prophet) did not mind delaying-some (prayer) i. e. 'Isya' prayer, even up to the midnight and did not like sleeping before observing it, and talking after it. Shu'ba said: I met him subsequently and asked him (about the prayers of the Holy Prophet) and he said: He observed the noon prayer when the sun was past the meridian, he would pray the afternoon prayer, after which a person would o to the outskirts of Medina and the sun was still bright; (I forgot what he said about the evening prayer) ; I then met him on a subsequent occasion and asked him (about the prayers of the Holy Prophet; and he said: He would observe the morning prayer (at such a time) so that a man would go back and would recognise his neighbour by casting a glance at his face, and he would recite from sixty to one hundred verses in it.",
      "chain": [
        "20226",
        "20020",
        "11290"
      ]
    },
    {
      "hadith_no": "1495",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سيار بن سلامة، قال سمعت أبا برزة، يقول كان رسول الله صلى الله عليه وسلم لا يبالي بعض تأخير صلاة العشاء إلى نصف الليل وكان لا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته مرة أخرى فقال أو ثلث الليل ‏.‏",
      "text_en": " Sayyar b. Salama reported:                      I heard Abu Barza saying that the Messenger of Allah (may peace be upon him) did not mind some delay in the 'Isha' prayer even up to midnight and he did not like sleeping before (observing it) and talking after it. Shu'ba said: I again met him (Sayyar b. Salama) for the second time and he said: Even up to the third (part) of the night.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "1496",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه أبو كريب، حدثنا سويد بن عمرو الكلبي، عن حماد بن سلمة، عن سيار بن سلامة أبي المنهال، قال سمعت أبا برزة الأسلمي، يقول كان رسول الله صلى الله عليه وسلم يؤخر العشاء إلى ثلث الليل ويكره النوم قبلها والحديث بعدها وكان يقرأ في صلاة الفجر من المائة إلى الستين وكان ينصرف حين يعرف بعضنا وجه بعض ‏.‏",
      "text_en": " Abu Barza b. Aslami is reported to have said:                      The Messenger of Allah (may peace be upon him) delayed the night prayer till a third of the night had passed and he did not approve of sleeping before it, and talking after it, and he used to recite in the morning prayer from one hundred to sixty verses (and completed the prayer at such hours) when we recognised the faces of one another.",
      "chain": [
        "30216",
        "30466",
        "20021",
        "11290"
      ]
    },
    {
      "hadith_no": "4155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا سفيان بن عيينة، عن عمرو، عن أبي، المنهال قال باع شريك لي ورقا بنسيئة إلى الموسم أو إلى الحج فجاء إلى فأخبرني فقلت هذا أمر لا يصلح ‏.‏ قال قد بعته في السوق فلم ينكر ذلك على أحد ‏.‏ فأتيت البراء بن عازب فسألته فقال قدم النبي صلى الله عليه وسلم المدينة ونحن نبيع هذا البيع فقال ‏\"‏ ما كان يدا بيد فلا بأس به وما كان نسيئة فهو ربا ‏\"‏ ‏.‏ وائت زيد بن أرقم فإنه أعظم تجارة مني ‏.‏ فأتيته فسألته فقال مثل ذلك ‏.‏",
      "text_en": " Abu Minhal reported:                      My partner sold silver to be paid in the (Hajj) season or (in the days of) Hajj. He (my partner) came to me and informed me, and I said to him: Such transaction is not desirable. He said: I sold it in the market (on loan) but nobody objected to this. I went to al-Bara' b. 'Azib and asked him, and he said: Allah's Apostle (may peace be upon him) came to Medina and we made such transaction, whereupon he said: In case the payment is made on the spot, there is no harm in it, and in case (it is 'sold) on loan, it is usury. You better go to Zaid b. Arqam, for he is a greater trader than I; so I went to him and asked him, and he said like it.",
      "chain": [
        "30514",
        "20005",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "4156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن حبيب، أنه سمع أبا المنهال، يقول سألت البراء بن عازب عن الصرف، فقال سل زيد بن أرقم فهو أعلم ‏.‏ فسألت زيدا فقال سل البراء فإنه أعلم ثم قالا نهى رسول الله صلى الله عليه وسلم عن بيع الورق بالذهب دينا.",
      "text_en": " Habib reported that he heard Abu Minhal as saying:                      I asked al-Bara' b. Azib about the exchange of (gold for silver or vice versa), whereupon he said: you better ask Zaid b. Arqam for he knows more than I. So I asked Zaid but he said: You better ask al-Bara' for he knows more than I. Then both of them said: Allah's Messenger (may peace be upon him) forbade the sale of silver for gold when payment is to be made in future.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11276",
        "11290",
        "400"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، وعمرو الناقد، - واللفظ ليحيى قال عمرو حدثنا وقال يحيى - أخبرنا سفيان بن عيينة عن ابن أبي نجيح عن عبد الله بن كثير عن أبي المنهال عن ابن عباس قال قدم النبي صلى الله عليه وسلم المدينة وهم يسلفون في الثمار السنة والسنتين فقال ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Prophet (may peace be upon him) came to Medina, they were paying one and two years in advance for fruits, so he said:                      Those who pay in advance for anything must do so for a specified weight and for a definite time.",
      "chain": [
        "30399",
        "20377",
        "20031",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن ابن أبي نجيح، حدثني عبد الله، بن كثير عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم والناس يسلفون فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف فلا يسلف إلا في كيل معلوم ووزن معلوم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Messenger (may peace be upon him) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them:                      He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period).",
      "chain": [
        "20656",
        "20258",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي المنهال، عن أبي برزة، قال كان رسول الله صلى الله عليه وسلم يصلي الظهر إذا زالت الشمس ويصلي العصر وإن أحدنا ليذهب إلى أقصى المدينة ويرجع والشمس حية ونسيت المغرب وكان لا يبالي تأخير العشاء إلى ثلث الليل ‏.‏ قال ثم قال إلى شطر الليل ‏.‏ قال وكان يكره النوم قبلها والحديث بعدها وكان يصلي الصبح وما يعرف أحدنا جليسه الذي كان يعرفه وكان يقرأ فيها من الستين إلى المائة ‏.‏",
      "text_en": " Abu Barzah reported:                      The Messenger of Allah (ﷺ) would offer the Zuhr prayer when the sun had passed the meridian; he would offer 'Asr prayer after which one of us would visit the skirts of Medina and return him while the sun was still bright; I forgot what he said about the Maghrib prayer; he did not fear postponing the Isha prayer until a third of night had passed, or he said: until the midnight had passed. He would dislike sleeping before it or talking after it. And he would offer the Fajr prayer when a man could recognize his neighbor whom he recognized well; and he would recite from sixty to a hundred verses during it.",
      "chain": [
        "30329",
        "20020",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "3463",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم وهم يسلفون في التمر السنة والسنتين والثلاثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     When the Messenger of Allah (ﷺ) came to Medina, they were paying one, two and three years in advance for fruits, so he said: Those who pay in advance for anything, must do for a specified measure and weight with a specified time fixed.",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "3478",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا داود بن عبد الرحمن العطار، عن عمرو بن دينار، عن أبي المنهال، عن إياس بن عبد أن رسول الله صلى الله عليه وسلم نهى عن بيع فضل الماء ‏.‏",
      "text_en": " Narrated Iyas ibn Abd:                     The Messenger of Allah (ﷺ) forbade the sale of excess water.",
      "chain": [
        "30352",
        "20192",
        "11081",
        "11290",
        "4078"
      ]
    },
    {
      "hadith_no": "4849",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عوف، قال حدثني أبو المنهال، عن أبي برزة، قال كان رسول الله صلى الله عليه وسلم ينهى عن النوم قبلها والحديث بعدها ‏.‏",
      "text_en": " ABU BARZAH SAID:                      THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) FORBADE SLEEPING BEFORE THE NIGHT PRAYER AND TALKING AFTER IT.",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا عوف، قال أحمد وحدثنا عباد بن عباد، هو المهلبي وإسماعيل ابن علية جميعا عن عوف، عن سيار بن سلامة، هو أبو المنهال الرياحي عن أبي برزة، قال كان النبي صلى الله عليه وسلم يكره النوم قبل العشاء والحديث بعدها ‏.‏ قال وفي الباب عن عائشة وعبد الله بن مسعود وأنس ‏.‏ قال أبو عيسى حديث أبي برزة حديث حسن صحيح ‏.‏ وقد كره أكثر أهل العلم النوم قبل صلاة العشاء والحديث بعدها ورخص في ذلك بعضهم ‏.‏ وقال عبد الله بن المبارك أكثر الأحاديث على الكراهية ‏.‏ ورخص بعضهم في النوم قبل صلاة العشاء في رمضان ‏.‏ وسيار بن سلامة هو أبو المنهال الرياحي ‏.‏",
      "text_en": " Abu Barzah narrated:                     \"The Prophet would dislike to sleep before Isha and to talk after it.\"",
      "chain": [
        "30242",
        "20468",
        "11298",
        "30007",
        "20243",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "1271",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا داود بن عبد الرحمن العطار، عن عمرو بن دينار، عن أبي المنهال، عن إياس بن عبد المزني، قال نهى النبي صلى الله عليه وسلم عن بيع الماء ‏.‏ قال وفي الباب عن جابر وبهيسة عن أبيها وأبي هريرة وعائشة وأنس وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث إياس حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم أنهم كرهوا بيع الماء ‏.‏ وهو قول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقد رخص بعض أهل العلم في بيع الماء ‏.‏ منهم الحسن البصري ‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     From Iyas bin 'Abd al-Muzani who said: \"The Prophet (ﷺ) prohibited selling water.\"[He said:] There are narrations on this topic from Jabir, Buhaisah from her father, Abu Hurairah, 'Aishah, Anas and 'Abdullah bin 'Amr.[Abu 'Eisa said:] The Hadith is Iyas is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge, they dislike selling water. This is the view of Ibn Al-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge permitted selling water, Al-Hasan al-Basri is one of them.",
      "chain": [
        "30367",
        "20192",
        "11081",
        "11290",
        "4078"
      ]
    },
    {
      "hadith_no": "1311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم المدينة وهم يسلفون في الثمر فقال ‏\"‏ من أسلف فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏ قال وفي الباب عن ابن أبي أوفى وعبد الرحمن بن أبزى ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أجازوا السلف في الطعام والثياب وغير ذلك مما يعرف حده وصفته واختلفوا في السلم في الحيوان فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم السلم في الحيوان جائزا ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وكره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم السلم في الحيوان ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ أبو المنهال اسمه عبد الرحمن بن مطعم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"When the Prophet (ﷺ) arrived in Al-Madinah, they were paying in advance for fruits. So he said: 'Whoever pays in advance, then let him pay in advance for known measurements (of dates), and known weights for a specified period of time.'\"He said: There are narrations on this topic from Ibn Abi Awfa and 'Abdur-Rahman bin Abza.[Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Sahih Hadith. This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others. They allow for advanced payments on food, garments and other things in which the limits and description are known. They differed over delay in delivery of animals. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others thought that delay in delivery of animals is allowed. This is the view of Ash-Shafi'i, Ahmad and Ishaq. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked delay in delivery of animals. This is the saying of Sufyan and the people of Al-Kufah. And Abu Al-Minhal's (a narrator) name is 'Abdur-Rahman bin Mut'im.",
      "chain": [
        "30242",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال حدثنا سيار بن سلامة، قال سمعت أبي يسأل أبا برزة، عن صلاة، رسول الله صلى الله عليه وسلم قلت أنت سمعته قال كما أسمعك الساعة فقال سمعت أبي يسأل عن صلاة رسول الله صلى الله عليه وسلم قال كان لا يبالي بعض تأخيرها - يعني العشاء - إلى نصف الليل ولا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته بعد فسألته قال كان يصلي الظهر حين تزول الشمس والعصر يذهب الرجل إلى أقصى المدينة والشمس حية والمغرب لا أدري أى حين ذكر ثم لقيته بعد فسألته فقال وكان يصلي الصبح فينصرف الرجل فينظر إلى وجه جليسه الذي يعرفه فيعرفه ‏.‏ قال وكان يقرأ فيها بالستين إلى المائة ‏.‏",
      "text_en": " Shu'bah said:                      \"Sayyar bin Salamah, narrated to us, he said: 'I heard my father ask Abu Barzah about the prayer of the Messenger of Allah (ﷺ).' I said: 'Did you really hear him?' He said: 'As I can hear you now.' He said: 'I heard my father ask about the prayer of the Messenger of Allah (ﷺ).' He said: 'He would not mind if he delayed it - meaning 'Isha' until midnight, and he did not like to sleep before it or speak after it.'\" Shu'bah said: \"Then I met him later on and asked him. He said: 'He used to pray Zauhr when the sun had passed its zenith, and (he would pray) 'Asr and a man could walk to the farthest point in Al-Madinah and the sun would still be clear and hot. And Maghrib, I do not know the time he mentioned.' After that I met him and asked him, and he said: 'He used to pray Fajr then after the prayer a man could regarding it, sitting next to him, look at the face of someone he knew and he could recognize it.' He said: 'And he used to recite in it between sixty and one hundred (verses).'\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11290"
      ]
    },
    {
      "hadith_no": "530",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا عوف، قال حدثني سيار بن سلامة، قال دخلت على أبي برزة فسأله أبي كيف كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس وكان يصلي العصر حين يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية ونسيت ما قال في المغرب وكان يستحب أن يؤخر العشاء التي تدعونها العتمة وكان يكره النوم قبلها والحديث بعدها وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه وكان يقرأ بالستين إلى المائة ‏.‏",
      "text_en": " Sayyar bin Salamah said:                      \"I entered upon Abu Barzah, and my fatehr asked him: 'How did the Messenger of Allah (ﷺ) pray the prescribed prayers?' He said: 'He used to pray Zuhr, which you call Al-Uula (the first) when the sun passed its zenith; he used to pray 'Asr when one of us could go back to his hoome in the farthest part of Al-Madinah while the sun was still bright.' I forgot what he said about Maghrib. 'And he used to like to delay 'Isha', which you call Al-'Atamah, and he did not like to sleep before it nor talk after it. And he used to finish the Al-Ghadah (Fajr) prayer when a man could recognize his neighbor, and he used to recite (in it) between sixty and one hundred verses.'\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "535",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عوف، عن سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي فقال له أبي أخبرنا كيف، كان رسول الله صلى الله عليه وسلم يصلي المكتوبة قال كان يصلي الهجير التي تدعونها الأولى حين تدحض الشمس وكان يصلي العصر ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية قال ونسيت ما قال في المغرب قال وكان يستحب أن تؤخر صلاة العشاء التي تدعونها العتمة قال وكان يكره النوم قبلها والحديث بعدها وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه وكان يقرأ بالستين إلى المائة ‏.‏",
      "text_en": " Sayyar bin Salamah said:                      \"My father and I entered upon Abu Barzah, and my father said to him: 'How did the Messenger of Allah (ﷺ) pray the prescribed prayers?' He said: He used to pray Zuhr, which you call Al-Uala (the first) when the sun passed its zenith; he used to pray 'Asr then one of us could go back to his home in the farthest part of Al-Madinah when the sun was still bright.'\" - He said: \"I forgot what he said to me about Maghrib.\" - \"And he used to like to delay 'Isha', which you call Al-'Atamah, and he did not like to sleep before it nor speak after it. And he used to finish the Al-Ghadah (Fajr) prayer when a man could recognize his neighbor, and he used to recite between sixty and one hundred verses.'\"",
      "chain": [
        "38265",
        "20025",
        "11298",
        "11290"
      ]
    },
    {
      "hadith_no": "948",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا سليمان التيمي، عن سيار، - يعني ابن سلامة - عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة بالستين إلى المائة ‏.‏",
      "text_en": " It was narrated from Abu Barzah that:                     The Messenger of Allah (ﷺ) used to recite between sixty and one hundred verses in Al-Ghadah (Subh) prayer.",
      "chain": [
        "34188",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "4575",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، عن عمرو، عن أبي المنهال، قال باع شريك لي ورقا بنسيئة فجاءني فأخبرني فقلت، هذا لا يصلح ‏.‏ فقال قد والله بعته في السوق وما عابه على أحد فأتيت البراء بن عازب فسألته فقال قدم علينا النبي صلى الله عليه وسلم المدينة ونحن نبيع هذا البيع فقال ‏\"‏ ما كان يدا بيد فلا بأس وما كان نسيئة فهو ربا ‏\"‏ ‏.‏ ثم قال لي ائت زيد بن أرقم فأتيته فسألته فقال مثل ذلك ‏.‏",
      "text_en": " It was narrated that abu Al-Minhal said:                     \"Sharik sold some silver on credit for me. He came to me and told me. And I said: 'This is not correct.' He said; 'By Allah, I did this transaction in the market and no one criticized me .' So I went to Al-Bara bin Azib and asked him about that. He said: 'The Prophet came to us in Al-Madinah and we used to do this kind of transaction, but he said: Whatever is hand to hand, there is nothing wrong with it, but whatever is on credit, is Riba. Then he said to me: 'Go to Zaid bin Arqam.' So I went to him and asked him, and he said the same thing.\"",
      "chain": [
        "36658",
        "20005",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "4576",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني إبراهيم بن الحسن، قال حدثنا حجاج، قال قال ابن جريج أخبرني عمرو بن دينار، وعامر بن مصعب، أنهما سمعا أبا المنهال، يقول سألت البراء بن عازب وزيد بن أرقم فقالا كنا تاجرين على عهد رسول الله صلى الله عليه وسلم فسألنا نبي الله صلى الله عليه وسلم عن الصرف فقال ‏\"‏ إن كان يدا بيد فلا بأس وإن كان نسيئة فلا يصلح ‏\"‏ ‏.‏",
      "text_en": " Abu Al-Minhal said:                     \" I asked Al-Bara bin 'Azib and Zaid bin Arqam and they said: 'We were merchants at the time of the Messenger of Allah and we asked the Prophet of Allah about money exchange. He said: \"If it is done hand to hand there is nothing wrong with it, but if it is done on credit then it is not right.\"",
      "chain": [
        "38070",
        "20219",
        "11070",
        "11081",
        "11696",
        "11290"
      ]
    },
    {
      "hadith_no": "4577",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، عن محمد، قال حدثنا شعبة، عن حبيب، قال سمعت أبا المنهال، قال سألت البراء بن عازب عن الصرف، فقال سل زيد بن أرقم فإنه خير مني وأعلم ‏.‏ فسألت زيدا فقال سل البراء فإنه خير مني وأعلم فقالا جميعا نهى رسول الله صلى الله عليه وسلم عن الورق بالذهب دينا ‏.‏",
      "text_en": " Abu Al-Minhal said:                     \"I asked Al-Bara bin 'Azib about money exchange. He said: 'Ask Zaid bin Arqam, for he is better than me and more knowledgeable.' So I asked Zaid and he said: 'Ask Al-Bara for he is better than me and more knowledgeable.' And they both said: 'The Messenger of Allah forbade (selling) silver for gold on credit.\"'",
      "chain": [
        "30213",
        "20020",
        "11276",
        "11290",
        "400"
      ]
    },
    {
      "hadith_no": "4616",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، قال سمعت ابن عباس، قال قدم رسول الله صلى الله عليه وسلم المدينة وهم يسلفون في التمر السنتين والثلاث فنهاهم وقال ‏\"‏ من أسلف سلفا فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Minhal said:                     \"I heard Ibn 'Abbas say: 'When the Prophet came (to al-Madinah), they used to pay in advance for dates, two or three years in advance. He forbade them that and said: 'whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time'''",
      "chain": [
        "30367",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "4661",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، وعبد الله بن محمد بن عبد الرحمن، - واللفظ له - قالا حدثنا سفيان، عن عمرو بن دينار، قال سمعت أبا المنهال، يقول سمعت إياس بن عمر، - وقال مرة ابن عبد - يقول سمعت رسول الله صلى الله عليه وسلم ينهى عن بيع الماء ‏.‏ قال قتيبة لم أفقه عنه بعض حروف أبي المنهال كما أردت ‏.‏",
      "text_en": " Abu Al-Minhal said:                     \"I heard Iyas bin 'Umar\" - and on one occasion he said: \"Ibn 'Abd - say: 'I heard the Messenger of Allah forbid the sale of water.\"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "4662",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا داود، عن عمرو، عن أبي المنهال، عن إياس، أن رسول الله صلى الله عليه وسلم نهى عن بيع فضل الماء ‏.‏ وباع قيم الوهط فضل ماء الوهط فكرهه عبد الله بن عمرو ‏.‏",
      "text_en": " It was narrated from Iyas that:                     the Messenger of Allah forbade selling surplus water. The keeper of al-Wahat sold the surplus water of al-Wahat, and 'Abdullah bin 'Arm disapproved of that.",
      "chain": [
        "30367",
        "20377",
        "11290"
      ]
    },
    {
      "hadith_no": "4663",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إبراهيم بن الحسن، عن حجاج، قال قال ابن جريج أخبرني عمرو بن دينار، أن أبا المنهال، أخبره أن إياس بن عبد صاحب النبي صلى الله عليه وسلم قال لا تبيعوا فضل الماء فإن النبي صلى الله عليه وسلم نهى عن بيع فضل الماء ‏.‏",
      "text_en": " Iya bin 'Abd, the companion of the Prophet said:                     \"do not sell surplus water, for the Prophet forbade the sale of surplus water.\"",
      "chain": [
        "38070",
        "20219",
        "11070",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن عوف بن أبي جميلة، عن سيار بن سلامة، عن أبي برزة الأسلمي، قال كان النبي  صلى الله عليه وسلم  يصلي صلاة الهجير التي تدعونها الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"The Prophet used to pray the Hajir prayer, which you call 'Zuhr', when the sun had passed its zenith.\"",
      "chain": [
        "30160",
        "20031",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وعبد الوهاب، قالوا حدثنا عوف، عن أبي المنهال، سيار بن سلامة عن أبي برزة الأسلمي، قال كان رسول الله  صلى الله عليه وسلم  يستحب أن يؤخر العشاء وكان يكره النوم قبلها والحديث بعدها ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"The Messenger of Allah used to like to delay the 'Isha', and he disliked sleeping before it, and engaging in conversation after it.\"",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20259",
        "11298",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "867",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عباد بن العوام، عن عوف، عن أبي المنهال، عن أبي برزة، ح وحدثنا سويد، حدثنا معتمر بن سليمان، عن أبيه، حدثه أبو المنهال، عن أبي برزة، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في الفجر ما بين الستين إلى المائة ‏.‏",
      "text_en": " It wasnarrated from Abu Barzah that the Messenger of Allah (ﷺ)used torecite between sixty and one hundred (Verses) in Fajr prayer.",
      "chain": [
        "30269",
        "20431",
        "11298",
        "11290",
        "227",
        "20288",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس، قال قدم النبي  صلى الله عليه وسلم  وهم يسلفون في التمر السنتين والثلاث فقال ‏\"‏ من أسلف في تمر فليسلف في كيل معلوم ووزن معلوم إلى أجل معلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Prophet (ﷺ) came (to Al-Madinah), they used to pay in advance for dates, two or three years in advance. He said: 'Whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time.’”",
      "chain": [
        "30288",
        "20005",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2570",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن أبي المنهال، سمعت إياس بن عبد المزني، ورأى، أناسا يبيعون الماء فقال لا تبيعوا الماء فإني سمعت رسول الله صلى الله عليه وسلم نهى أن يباع الماء ‏.‏",
      "text_en": " It was narrated that Abu Minhal said:                     “I heard Iyas bin 'Abd Muzani say - when he saw people selling water: 'Do not sell water, for I heard the Messenger of Allah (ﷺ) forbidding selling of water.' ”",
      "chain": [
        "30201",
        "20005",
        "11081",
        "11290",
        "4078"
      ]
    }
  ],
  "total_hadiths": 46
}