{
  "id": "11296",
  "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
  "full_name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Kundi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "464",
      "name": "Rabi'ah ibn Kab al-Aslami ( ربيعة بن كعب بن مالك الأسلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3240",
      "name": "'Aidh bin 'Amr al-Mazni ( عائذ بن عمرو المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11865",
      "name": "'Abdullah bin Rbah عبد الله بن رباح الأنصاري أبو خالد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10695",
      "name": "'Abdullah bin al-Samit عبد الله بن الصامت",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19855",
      "name": "'Alqama bin 'Abdullah علقمة بن عبد الله بن سنان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19002",
      "name": "Msh'th bin Tryf Qady Hrah مشعث بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10690",
      "name": "Salah bin Rastum, Abu 'Amir al-Khazaz صالح بن رستم المزني أبو عامر الخزاز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20533",
      "name": "al-Harith bin 'Ubaid al-Ayadi الحارث بن عبيد الإيادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20230",
      "name": "Ziyad bin al-Rabi' al-Yhmdy زياد بن الربيع اليحمدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20251",
      "name": "'Abdul 'Aziz bin 'Abdul Samad عبد العزيز بن عبد الصمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2259",
      "source": " Sahih Bukhari ",
      "chapter": "Shuf'a - كتاب الشفعة",
      "chapter_no": "36",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، ح وحدثني علي بن عبد الله، حدثنا شبابة، حدثنا شعبة، حدثنا أبو عمران، قال سمعت طلحة بن عبد الله، عن عائشة  رضى الله عنها  قلت يا رسول الله، إن لي جارين، فإلى أيهما أهدي قال ‏\"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     I said, \"O Allah's Apostle! I have two neighbors and would like to know to which of them I should give presents.\" He replied, \"To the one whose door is nearer to you.\"",
      "chain": [
        "20219",
        "20020",
        "30026",
        "20426",
        "20020",
        "11296",
        "53"
      ]
    },
    {
      "hadith_no": "2595",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن طلحة بن عبد الله  رجل من بني تيم بن مرة  عن عائشة  رضى الله عنها  قالت قلت يا رسول الله، إن لي جارين فإلى أيهما أهدي قال ‏\"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     I said, \"O Allah's Apostle! I have two neighbors; which of them should I give a gift to?\" The Prophet said, \"(Give) to the one whose door is nearer to you.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "53"
      ]
    },
    {
      "hadith_no": "3243",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا همام، قال سمعت أبا عمران الجوني، يحدث عن أبي بكر بن عبد الله بن قيس الأشعري، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ الخيمة درة مجوفة، طولها في السماء ثلاثون ميلا، في كل زاوية منها للمؤمن أهل لا يراهم الآخرون ‏\"‏‏.‏ قال أبو عبد الصمد والحارث بن عبيد عن أبي عمران ستون ميلا‏.‏",
      "text_en": " Narrated `Abdullah bin Qais Al-Ash`ari:                     The Prophet said, \"A tent (in Paradise) is like a hollow pearl which is thirty miles in height and on every corner of the tent the believer will have a family that cannot be seen by the others.\" (Narrated Abu `Imran in another narration, \"The tent is sixty miles in height.\")",
      "chain": [
        "20219",
        "20297",
        "11296"
      ]
    },
    {
      "hadith_no": "3334",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قيس بن حفص، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي عمران الجوني، عن أنس، يرفعه ‏\"‏ أن الله، يقول لأهون أهل النار عذابا لو أن لك ما في الأرض من شىء كنت تفتدي به قال نعم‏.‏ قال فقد سألتك ما هو أهون من هذا وأنت في صلب آدم أن لا تشرك بي‏.‏ فأبيت إلا الشرك ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Allah will say to that person of the (Hell) Fire who will receive the least punishment, 'If you had everything on the earth, would you give it as a ransom to free yourself (i.e. save yourself from this Fire)?' He will say, 'Yes.' Then Allah will say, 'While you were in the backbone of Adam, I asked you much less than this, i.e. not to worship others besides Me, but you insisted on worshipping others besides me.' \"",
      "chain": [
        "30158",
        "20226",
        "20020",
        "11296"
      ]
    },
    {
      "hadith_no": "4927",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد العزيز بن عبد الصمد العمي، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ جنتان من فضة، آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما، وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبر على وجهه في جنة عدن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Qais:                     Allah's Apostle said, \"Two gardens, the utensils and the contents of which are of silver, and two other gardens, the utensils and contents of which are of gold. And nothing will prevent the people who will be in the Garden of Eden from seeing their Lord except the curtain of Majesty over His Face.\"",
      "chain": [
        "30145",
        "20251",
        "11296"
      ]
    },
    {
      "hadith_no": "4928",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثني عبد العزيز بن عبد الصمد، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في الجنة خيمة من لؤلؤة مجوفة، عرضها ستون ميلا، في كل زاوية منها أهل، ما يرون الآخرين يطوف عليهم المؤمنون ‏\"‏‏.‏         ‏\"‏ وجنتان من فضة، آنيتهما وما فيهما، وجنتان من كذا آنيتهما، وما فيهما، وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبر على وجهه في جنة عدن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Qais:                     Allah's Apostle said, \"In Paradise there is a pavilion made of a single hollow pearl sixty miles wide, in each corner of which there are wives who will not see those in the other corners; and the believers will visit and enjoy them. And there are two gardens, the utensils and contents of which are made of silver; and two other gardens, the utensils and contents of which are made of so-and-so (i.e. gold) and nothing will prevent the people staying in the Garden of Eden from seeing their Lord except the curtain of Majesty over His Face.\"",
      "chain": [
        "30170",
        "20251",
        "11296"
      ]
    },
    {
      "hadith_no": "5115",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أبي عمران الجوني، عن جندب بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ اقرءوا القرآن ما ائتلفت قلوبكم، فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but if you have any difference of opinion (as regards to its interpretation and meaning) then you should stop reciting it (for the time being).",
      "chain": [
        "20283",
        "20022",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "5116",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب، قال النبي صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏ تابعه الحارث بن عبيد وسعيد بن زيد عن أبي عمران ولم يرفعه حماد بن سلمة وأبان‏.‏ وقال غندر عن شعبة عن أبي عمران سمعت جندبا قوله‏.‏ وقال ابن عون عن أبي عمران عن عبد الله بن الصامت عن عمر قوله، وجندب أصح وأكثر‏.‏",
      "text_en": " Narrated Jundub:                     The Prophet said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but when you have any difference of opinion (as regards its interpretation and meaning) then you should stop reciting it (for the time being)'",
      "chain": [
        "30153",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "6089",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أبو عمران، قال سمعت طلحة، عن عائشة، قالت قلت يا رسول الله إن لي جارين فإلى أيهما أهدي قال ‏\"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I said, \"O Allah's Apostle! I have two neighbors! To whom shall I send my gifts?\" He said, \"To the one whose gate in nearer to you.\"",
      "chain": [
        "20219",
        "20020",
        "11296",
        "11356",
        "53"
      ]
    },
    {
      "hadith_no": "7451",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرحمن بن مهدي، عن سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as you are in agreement as to its interpretation and meanings, but when you have differences regarding its interpretation and meanings, then you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)",
      "chain": [
        "30021",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "7452",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا همام، حدثنا أبو عمران الجوني، عن جندب بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم، فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏ وقال يزيد بن هارون عن هارون الأعور، حدثنا أبو عمران، عن جندب، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as your hearts are in agreement as to its meanings, but if you have differences as regards its meaning, stop reading it then.\"",
      "chain": [
        "30312",
        "20250",
        "20297",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وأبو غسان المسمعي وإسحاق بن إبراهيم جميعا عن عبد العزيز بن عبد الصمد، - واللفظ لأبي غسان قال حدثنا أبو عبد الصمد، - حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ جنتان من فضة آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبرياء على وجهه في جنة عدن ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Qais transmitted on the authority of his father (Abu Musa Ash'ari) that the Apostle (may peace be upon him) said:                      There would be two gardens (in Paradise) the vessels and contents of which would be of silver, and two gardens whose vessels and contents would be of gold. The only thing intervening to hinder the people from looking at their Lord will be the mantle of Grandeur over His face in the Garden of Eden.",
      "chain": [
        "30395",
        "30456",
        "11296"
      ]
    },
    {
      "hadith_no": "258",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، كلاهما عن جعفر، - قال يحيى أخبرنا جعفر بن سليمان، - عن أبي عمران الجوني، عن أنس بن مالك، قال قال أنس وقت لنا في قص الشارب وتقليم الأظفار ونتف الإبط وحلق العانة أن لا نترك أكثر من أربعين ليلة ‏.‏",
      "text_en": " Anas reported:                      A time limit has been prescribed for us for clipping the moustache, cutting the nails, plucking hair under the armpits, shaving the pubes, that it should not be neglected far more than forty nights.",
      "chain": [
        "30399",
        "30367",
        "20532",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح قال وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله ‏\"‏ كيف أنت إذا كانت عليك أمراء يؤخرون الصلاة عن وقتها أو يميتون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قلت فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصل فإنها لك نافلة ‏\"‏ ‏.‏ ولم يذكر خلف عن وقتها ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: How would you act when you are under the rulers who would delay the prayer beyond its prescribed time, or they would make prayer a dead thing as far as its proper time is concerned? I said: What do you command? He (the Holy Prophet) said: Observe the prayer at Its proper time, and if you can say it along with them do so, for it would be a superetogatory prayer for you. Khalaf (one of the narrators in the above hadith) has not mentioned\" beyond their (prescribed) time\".",
      "chain": [
        "30503",
        "20022",
        "30137",
        "30559",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا جعفر بن سليمان، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إنه سيكون بعدي أمراء يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: O Abu Dharr, you would soon find after me rulers who would make their prayers dead. You should say prayer at its prescribed time. If you say prayer at its prescribed time that would be a supererogatory prayer for you, otherwise you saved your prayer.",
      "chain": [
        "30399",
        "20532",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "5025",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وقتيبة بن سعيد، - واللفظ ليحيى - قال قتيبة حدثنا وقال، يحيى أخبرنا جعفر بن سليمان، عن أبي عمران الجوني، عن أبي بكر بن، عبد الله بن قيس عن أبيه، قال سمعت أبي وهو، بحضرة العدو يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أبواب الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ فقام رجل رث الهيئة فقال يا أبا موسى آنت سمعت رسول الله صلى الله عليه وسلم يقول هذا قال نعم ‏.‏ قال فرجع إلى أصحابه فقال أقرأ عليكم السلام ‏.‏ ثم كسر جفن سيفه فألقاه ثم مشى بسيفه إلى العدو فضرب به حتى قتل ‏.‏",
      "text_en": " The tradition has been narrated on the authority of 'Abdullah b. Qais. He heard it from his father who, while facing the enemy, reported that the Messenger of Allah (may peace be upon him) said:                      Surely, the gates of Paradise are under the shadows of the swords. A man in a shabby condition got up and said; Abu Musa, did you hear the Messenger of Allah (may peace be upon him) say this? He said: Yes. (The narrator said): He returned to his friends and said: I greet you (a farewell greeting). Then he broke the sheath of his sword, threw it away, advanced with his (naked) sword towards the enemy and fought (them) with it until he was slain.",
      "chain": [
        "30399",
        "30367",
        "30367",
        "20031",
        "20532",
        "11296"
      ]
    },
    {
      "hadith_no": "6129",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وابن أبي عمر المكي، - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا عبد العزيز بن عبد، الصمد العمي عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قلت يا رسول الله ما آنية الحوض قال ‏\"‏ والذي نفس محمد بيده لآنيته أكثر من عدد نجوم السماء وكواكبها ألا في الليلة المظلمة المصحية آنية الجنة من شرب منها لم يظمأ آخر ما عليه يشخب فيه ميزابان من الجنة من شرب منه لم يظمأ عرضه مثل طوله ما بين عمان إلى أيلة ماؤه أشد بياضا من اللبن وأحلى من العسل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      Allah's Messenger, what about the vessels of that Cistern? He said: By Him in Whose Hand is the life of Muhammad, the vessels would outnumber the stars in the sky and its planets shining on a dark cloudless night. These would be the vessels of Paradise. He who drinks out of it (the Cistern) would never feel thirsty. There would flow in it two spouts from Paradise and he who would drink out of it would not feel thirsty; and the distance between its (two corners) is that between 'Amman and Aila, and its water is whiter than milk and sweeter than honey.",
      "chain": [
        "30201",
        "30123",
        "30421",
        "30312",
        "20251",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6586",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن المثنى، وابن، بشار جميعا عن  ابن مهدي، قال قال ابن المثنى حدثني عبد الرحمن بن مهدي، حدثنا شعبة، عن أبي عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ائت قومك فقل إن رسول الله صلى الله عليه وسلم قال أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
      "chain": [
        "30024",
        "30170",
        "20033",
        "20033",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6847",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سويد بن سعيد، عن معتمر بن سليمان، عن أبيه، حدثنا أبو عمران الجوني، عن جندب، أن رسول الله صلى الله عليه وسلم حدث ‏\"‏ أن رجلا قال والله لا يغفر الله لفلان وإن الله تعالى قال من ذا الذي يتألى على أن لا أغفر لفلان فإني قد غفرت لفلان وأحبطت عملك ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " Jundub reported that Allah's Messenger (may peace be upon him) stated that a person said:                      Allah would not forgive such and such (person). Thereupon Allah the Exalted and Glorious, said: Who is he who adjures about Me that I would not grant pardon to so and so; I have granted pardon to so and so and blotted out his deeds (who took an oath that I would not grant pardon to him).",
      "chain": [
        "30547",
        "20288",
        "11289",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "6855",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كامل الجحدري، وإسحاق بن إبراهيم، - واللفظ لإسحاق - قال أبو كامل حدثنا وقال، إسحاق أخبرنا عبد العزيز بن عبد الصمد العمي، حدثنا أبو عمران، الجوني عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إذا طبخت مرقة فأكثر ماءها وتعاهد جيرانك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Abu Dharr, when you prepare the broth, add water to that and give that (as a present) to your neighbour.",
      "chain": [
        "30559",
        "30123",
        "30312",
        "20251",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6856",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن إدريس، أخبرنا شعبة، ح وحدثنا أبو كريب حدثنا ابن إدريس، أخبرنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال إن خليلي صلى الله عليه وسلم أوصاني ‏\"‏ إذا طبخت مرقا فأكثر ماءه ثم انظر أهل بيت من جيرانك فأصبهم منها بمعروف ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) commanded me thus:                      Whenever you prepare a broth, add water to it, and have in your mind the members of the household of your neighbours and then give them out of this with courtesy.",
      "chain": [
        "30201",
        "20102",
        "20020",
        "30216",
        "20102",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6857",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا عثمان بن عمر، حدثنا أبو عامر، - يعني الخزاز - عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ لا تحقرن من المعروف شيئا ولو أن تلقى أخاك بوجه طلق ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      Allah's Apostle (may peace be upon him) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance.",
      "chain": [
        "30456",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو الربيع، وأبو كامل فضيل بن حسين - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخران، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قيل لرسول الله صلى الله عليه وسلم أرأيت الرجل يعمل العمل من الخير ويحمده الناس عليه قال ‏\"‏ تلك عاجل بشرى المؤمن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      It was said to Allah's Messenger (may peace be upon him): What is your opinion about the person who has done good deeds and the people praise him? He said: It is glad tidings for a believer (which he has received in this mortal world).",
      "chain": [
        "30399",
        "30137",
        "20031",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6892",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، عن وكيع، ح وحدثنا محمد، بن بشار حدثنا محمد بن جعفر، ح وحدثنا محمد بن المثنى، حدثني عبد الصمد، ح وحدثنا  إسحاق، أخبرنا النضر، كلهم عن شعبة، عن أبي عمران الجوني، بإسناد حماد بن زيد ‏.‏ بمثل حديثه غير أن في، حديثهم عن شعبة غير عبد الصمد ويحبه الناس عليه ‏.‏ وفي حديث عبد الصمد ويحمده الناس ‏.‏ كما قال حماد ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters also and the one transmitted on the authority of Shu'ba (the words are):                     \" People love him.\" In the hadith transmitted on the authority of 'Abd-us-Samad (the words are):\" People praise him as stated by Hammad.\"",
      "chain": [
        "30201",
        "30123",
        "20032",
        "30160",
        "20173",
        "30170",
        "20250",
        "30312",
        "20020",
        "11296"
      ]
    },
    {
      "hadith_no": "6947",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين الجحدري حدثنا حماد بن زيد، حدثنا أبو عمران الجوني قال كتب إلى عبد الله بن رباح الأنصاري أن عبد الله بن عمرو قال هجرت إلى رسول الله صلى الله عليه وسلم يوما - قال - فسمع أصوات رجلين اختلفا في آية فخرج علينا رسول الله صلى الله عليه وسلم يعرف في وجهه الغضب فقال ‏\"‏ إنما هلك من كان قبلكم باختلافهم في الكتاب ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported:                      I went to Allah's Messenger (may peace be upon him) in the morning and he heard the voice of two persons who had an argumentation with each other about a verse. Allah's Apostle (may peace be upon him) came to us (and) the (signs) of anger could be seen on his face. He said: Verily, the (peoples) before you were ruined because of their disputation in the Book.",
      "chain": [
        "30559",
        "20022",
        "11296",
        "29"
      ]
    },
    {
      "hadith_no": "6949",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا همام، حدثنا أبو عمران، الجوني عن جندب، - يعني ابن عبد الله - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم فإذا اختلفتم فقوموا ‏\"‏ ‏.‏",
      "text_en": " Jundub (i. e. Ibn 'Abdullah) reported that Allah's Messenger (may peace be upon him) said:                      Recite the Qur'an as long as your hearts agree to do so and when you find variance between them, then stand up.",
      "chain": [
        "30313",
        "20250",
        "20297",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "6950",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا أبان، حدثنا أبو عمران قال قال لنا جندب ونحن غلمان بالكوفة قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ‏\"‏ ‏.‏ بمثل حديثهما ‏.‏",
      "text_en": " Abu Imran reported that Jundub told us as we we-re young boys living in Kilfa, that Allah's Messenger (may peace be upon him) had said:                      Recite the Qur'an. The rest of the hadith is the same.",
      "chain": [
        "30296",
        "20218",
        "20577",
        "11296"
      ]
    },
    {
      "hadith_no": "7261",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي عمران الجوني، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقول الله تبارك وتعالى لأهون أهل النار عذابا لو كانت لك الدنيا وما فيها أكنت مفتديا بها فيقول نعم فيقول قد أردت منك أهون من هذا وأنت في صلب آدم أن لا تشرك - أحسبه قال - ولا أدخلك النار فأبيت إلا الشرك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and High, would say to one who shall have to undergo the least torture (on the Day of Resurrection): Would you like to go as ransom if you had all worldly riches; he would say: Yes. Allah would say to him: When you were in the loins of Adam, I demadded from you something easier than this that you should not associate anything with Me. (The narrator says): I think He also said: I would not cause you to enter Hell-Fire but you defied and attributed Divinity (to others besides Me).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "7337",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا سعيد بن منصور، عن أبي قدامة، - وهو الحارث بن عبيد - عن أبي، عمران الجوني عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن للمؤمن في الجنة لخيمة من لؤلؤة واحدة مجوفة طولها ستون ميلا للمؤمن فيها أهلون يطوف عليهم المؤمن فلا يرى بعضهم بعضا ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (may peace be upon him) said that in Paradise there would be for a believer a tent of a single hollowed pearl the breadth of which would be sixty miles. It would be meant for a believer and the believers would go around it and none would be able to see the others.",
      "chain": [
        "30116",
        "20533",
        "11296"
      ]
    },
    {
      "hadith_no": "7338",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا أبو عبد الصمد، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في الجنة خيمة من لؤلؤة مجوفة عرضها ستون ميلا في كل زاوية منها أهل ما يرون الآخرين يطوف عليهم المؤمن ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (may peace be upon him) said that in Paradise there would be a tent made of a single hollowed pearl, the breadth of which would be sixty miles from all sides and there would live a family in each corner and the other would not be able to see the believer who goes around them.",
      "chain": [
        "30456",
        "11296"
      ]
    },
    {
      "hadith_no": "7339",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا همام، عن أبي، عمران الجوني عن أبي بكر بن أبي موسى بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيمة درة طولها في السماء ستون ميلا في كل زاوية منها أهل للمؤمن لا يراهم الآخرون ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Bakr b. Abu Musa b. Qais who, on the authority of his father, reported the Apostle (may peace be upon him) to have said that there would be a tent made of a pearl whose height towards the sky would be sixty miles. In each corner, there would be a fanaily of the believer, out of sight for the others.",
      "chain": [
        "30201",
        "20472",
        "20297",
        "11296"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران، - يعني الجوني - عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر كيف أنت إذا كانت عليك أمراء يميتون الصلاة ‏\"‏ ‏.‏ أو قال ‏\"‏ يؤخرون الصلاة ‏\"‏ ‏.‏ قلت يا رسول الله فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصلها فإنها لك نافلة ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr said:                      \"The Messenger of Allah (ﷺ) asked me: 'How will you act, Abu Dharr, when you are under rulers who kill prayer or delay it (beyond its proper time) ?' I said: 'Messenger of Allah, what do you command me ?' He replied: 'Offer the prayer at its proper time, and if you say it along with them, say it, for it will be a supererogatory prayer for you.'\"",
      "chain": [
        "30175",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "2137",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، حدثنا مرحوم بن عبد العزيز العطار، حدثني أبو عمران الجوني، عن يزيد بن بابنوس، عن عائشة، أن رسول الله صلى الله عليه وسلم بعث إلى النساء - تعني في مرضه - فاجتمعن فقال ‏\"‏ إني لا أستطيع أن أدور بينكن فإن رأيتن أن تأذن لي فأكون عند عائشة فعلتن ‏\"‏ ‏.‏ فأذن له ‏.‏",
      "text_en": " A’ishah said The Apostle of Allaah(ﷺ) sent for his wives during his illness. When they got together, he(ﷺ) said “I am unable to visit all of you. If you think to permit me to stay with A’ishah you may do so.” So they permitted him (to stay with A’ishah).",
      "chain": [
        "30175",
        "20284",
        "11296",
        "53"
      ]
    },
    {
      "hadith_no": "2655",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا أبو عمران الجوني، عن علقمة بن عبد الله المزني، عن معقل بن يسار، أن النعمان، - يعني ابن مقرن - قال شهدت رسول الله صلى الله عليه وسلم إذا لم يقاتل من أول النهار أخر القتال حتى تزول الشمس وتهب الرياح وينزل النصر ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Muqarrin:                     I was present at fighting along with the Messenger of Allah (ﷺ), and when he did not fight at the beginning of the day, he waited till the sun had passed the meridian, the winds blew, and help came down.",
      "chain": [
        "20040",
        "20022",
        "11296",
        "19855",
        "3120",
        "3122"
      ]
    },
    {
      "hadith_no": "3652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الله بن محمد بن يحيى، حدثنا يعقوب بن إسحاق المقرئ الحضرمي، حدثنا سهيل بن مهران، - أخو حزم القطعي - حدثنا أبو عمران، عن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال في كتاب الله عز وجل برأيه فأصاب فقد أخطأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Jundub:                     The Prophet (ﷺ) said: If anyone interprets the Book of Allah in the light of his opinion even if he is right, he has erred.",
      "chain": [
        "20679",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "4200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا صدقة الدقيقي، حدثنا أبو عمران الجوني، عن أنس بن مالك، قال وقت لنا رسول الله صلى الله عليه وسلم حلق العانة وتقليم الأظفار وقص الشارب ونتف الإبط أربعين يوما مرة ‏.‏ قال أبو داود رواه جعفر بن سليمان عن أبي عمران عن أنس لم يذكر النبي صلى الله عليه وسلم قال وقت لنا وهذا أصح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Messenger of Allah (ﷺ) fixed forty days to shave the pubes, paring the nails, clipping the moustaches, and plucking the hair under the armpit.Abu Dawud said: Ja'far b. Sulaiman transmitted it from Abu 'Imran on the authority of Anas. In this version he did not mention the Prophet (ﷺ). He said: Forty days were fixed for us. This is a more correct version.",
      "chain": [
        "20285",
        "24209",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "4261",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله وسعديك ‏.‏ فذكر الحديث قال فيه ‏\"‏ كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ‏\"‏ ‏.‏ قلت الله ورسوله أعلم أو قال ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بالصبر ‏\"‏ ‏.‏ أو قال ‏\"‏ تصبر ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك وسعديك ‏.‏ قال ‏\"‏ كيف أنت إذا رأيت أحجار الزيت قد غرقت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بمن أنت منه ‏\"‏ ‏.‏ قلت يا رسول الله أفلا آخذ سيفي وأضعه على عاتقي قال ‏\"‏ شاركت القوم إذا ‏\"‏ ‏.‏ قلت فما تأمرني قال ‏\"‏ تلزم بيتك ‏\"‏ ‏.‏ قلت فإن دخل على بيتي قال ‏\"‏ فإن خشيت أن يبهرك شعاع السيف فألق ثوبك على وجهك يبوء بإثمك وإثمه ‏\"‏ ‏.‏ قال أبو داود لم يذكر المشعث في هذا الحديث غير حماد بن زيد ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to me: O AbuDharr.  I replied: At thy service and at thy pleasure, Messenger of Allah.  He then mentioned the tradition in which he said: What will you do when there the death of the people (in Medina) and a house will reach the value of a slave (that is, a grave will be sold for a slave).  I replied: Allah and His Apostle know best. Or he said: What Allah and His Apostle choose for me.  He said: You must show endurance. Or he said; you may endure. He then said to me: What will you do, AbuDharr, when you see the Ahjar az-Zayt covered with blood?  I replied: What Allah and His Apostle choose for me.  He said: You must go to those who are like-minded.  I asked: Should I not take my sword and put it on my shoulder?  He replied: you would then associate yourself with the people.  I then asked: What do you order me to do?  You must stay at home.  I asked: (What should I do) if people enter my house and find me?  He replied: If you are afraid the gleam of the sword may dazzle you, put the end of your garment over your face in order that (the one who kills you) may bear the punishment of your sins and his.Abu Dawud said: No one mentioned al-Mush'ath in the chain of this tradition except Hammad b. Zaid.",
      "chain": [
        "30175",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "5155",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد بن مسرهد، وسعيد بن منصور، أن الحارث بن عبيد، حدثهم عن أبي عمران الجوني، عن طلحة، عن عائشة، رضى الله عنها قالت قلت يا رسول الله إن لي جارين بأيهما أبدأ قال ‏\"‏ بأدناهما بابا ‏\"‏ ‏.‏ قال أبو داود قال شعبة في هذا الحديث طلحة رجل من قريش ‏.‏",
      "text_en": " ‘A’ishah said:                      I asked : apostle of Allah! I have two neighbors. With which of them should I begin? He replied: Begin with the one whose door is nearer to you.Abu Dawud said: Shu’bah said this tradition : Talhah is a man of the Quraish.",
      "chain": [
        "30175",
        "30116",
        "20533",
        "11296",
        "11356",
        "53"
      ]
    },
    {
      "hadith_no": "176",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا جعفر بن سليمان الضبعي، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر أمراء يكونون بعدي يميتون الصلاة فصل الصلاة لوقتها فإن صليت لوقتها كانت لك نافلة وإلا كنت قد أحرزت صلاتك ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن مسعود وعبادة بن الصامت ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن ‏.‏ وهو قول غير واحد من أهل العلم يستحبون أن يصلي الرجل الصلاة لميقاتها إذا أخرها الإمام ثم يصلي مع الإمام والصلاة الأولى هي المكتوبة عند أكثر أهل العلم ‏.‏ وأبو عمران الجوني اسمه عبد الملك بن حبيب ‏.‏",
      "text_en": " Abu Dharr narrated that :                     the Prophet said: \"O Abu Dharr! There will be leaders after me who cause the Salat to die; so perform the Salat during its time. If you pray (with them) during its time, then that will be voluntary Salat for you, if not, then you will have attained your Salat.\"",
      "chain": [
        "38602",
        "20532",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1613",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عفان بن مسلم، والحجاج بن منهال، قالا حدثنا حماد بن سلمة، حدثنا أبو عمران الجوني، عن علقمة بن عبد الله المزني، عن معقل بن يسار، أن عمر بن الخطاب، بعث النعمان بن مقرن إلى الهرمزان فذكر الحديث بطوله فقال النعمان بن مقرن شهدت مع رسول الله صلى الله عليه وسلم فكان إذا لم يقاتل أول النهار انتظر حتى تزول الشمس وتهب الرياح وينزل النصر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعلقمة بن عبد الله هو أخو بكر بن عبد الله المزني ‏.‏",
      "text_en": " Narrated Ma'qil bin Yasar:                     \"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.",
      "chain": [
        "30115",
        "30106",
        "20219",
        "20021",
        "11296",
        "19855",
        "3120",
        "3"
      ]
    },
    {
      "hadith_no": "1659",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة، حدثنا جعفر بن سليمان الضبعي، عن أبي عمران الجوني، عن أبي بكر بن أبي موسى الأشعري، قال سمعت أبي بحضرة العدو، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أبواب الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ فقال رجل من القوم رث الهيئة أأنت سمعت هذا من رسول الله صلى الله عليه وسلم يذكره قال نعم ‏.‏ فرجع إلى أصحابه فقال أقرأ عليكم السلام ‏.‏ وكسر جفن سيفه فضرب به حتى قتل ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث جعفر بن سليمان الضبعي ‏.‏ وأبو عمران الجوني اسمه عبد الملك بن حبيب وأبو بكر بن أبي موسى قال أحمد بن حنبل هو اسمه ‏.‏",
      "text_en": " Narrated Abu Bakr bin Abi Musa Al-Ash'ari:                     \"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"",
      "chain": [
        "30367",
        "20532",
        "11296",
        "11900"
      ]
    },
    {
      "hadith_no": "1833",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسين بن علي بن الأسود البغدادي، حدثنا عمرو بن محمد العنقزي، حدثنا إسرائيل، عن صالح بن رستم أبي عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحقرن أحدكم شيئا من المعروف وإن لم يجد فليلق أخاه بوجه طليق وإن اشتريت لحما أو طبخت قدرا فأكثر مرقته واغرف لجارك منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة عن أبي عمران الجوني ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Messenger of Allah (ﷺ) said: \"Let one of you not consider any good to be insignificant. If he has nothing, then let him meet his brother with a smiling face. If you buy some meat or cook something in a pot, then increase its broth, and serve some of it to you neighbor.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported it from Abu 'Imran Al-Jawni.",
      "chain": [
        "20315",
        "20597",
        "20311",
        "17514",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عبد الصمد العمي عبد العزيز بن عبد الصمد، حدثنا أبو عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قلت يا رسول الله ما آنية الحوض قال ‏\"‏ والذي نفسي بيده لآنيته أكثر من عدد نجوم السماء وكواكبها في ليلة مظلمة مصحية من آنية الجنة من شرب منها شربة لم يظمأ آخر ما عليه عرضه مثل طوله ما بين عمان إلى أيلة ماؤه أشد بياضا من اللبن وأحلى من العسل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وفي الباب عن حذيفة بن اليمان وعبد الله بن عمرو وأبي برزة الأسلمي وابن عمر وحارثة بن وهب والمستورد بن شداد ‏.‏ - وروي عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ حوضي كما بين الكوفة إلى الحجر الأسود ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr narrated:                      \"I said: 'O Messenger of Allah! What about the vessels of the Hawd?' He said:'By the one in Whose Hand is my soul! Its vessels number more than the stars of the heavens and the planets on a clear dark night. (They are) among the vessels of Paradise, whoever drinks from them, he will never be thirsty again. Its longest breadth is the same as its length, like that which is between 'Amman to Aylah, its water is whiter than milk and sweeter than honey.'\"",
      "chain": [
        "30160",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "2635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا زياد بن الربيع، حدثنا أبو عمران الجوني، عن أنس بن مالك، قال ما أعرف شيئا مما كنا عليه على عهد النبي صلى الله عليه وسلم ‏.‏ فقلت أين الصلاة قال أولم تصنعوا في صلاتكم ما قد علمتم ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث أبي عمران الجوني وقد روي من غير وجه عن أنس ‏.‏",
      "text_en": " Abu 'Imaran Al-Jawni narrated :                     \"From Anas bin Malik who said : 'I do not recognize anything (today) from what we were upon during the time of The Messenger of Allah (s.a.w).' So I said : 'What about the Salat?' He said: 'Have you (people) not done what you know (you have done)?'\"",
      "chain": [
        "30448",
        "20230",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "2719",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد العزيز بن عبد الصمد أبو عبد الصمد العمي، عن أبي عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة جنتين آنيتهما وما فيهما من فضة وجنتين آنيتهما وما فيهما من ذهب وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبرياء على وجهه في جنة عدن ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr bin 'Abdullah bin Qais narrated from his father that the Prophet (s.a.w) said:                     \"Indeed, in Paradise, there are two gardens, their vessels and all that are in them are of silver. And, there are two gardens, their vessels and all that are in them are of gold. There is nothing between the people and their seeing their Lord except the Cloak of Greatness upon his Face in the Garden of Eternity.\"And from the chain it is reported from the Prophet (s.a.w) he said: \"Indeed in Paradise there is a great tent of hollowed pearl, its breadth is sixty miles, in every corner of it is a family, they do not see the others, and the believer goes around to them.\"",
      "chain": [
        "30160",
        "11296"
      ]
    },
    {
      "hadith_no": "2983",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الصمد بن عبد الوارث، حدثنا صدقة بن موسى أبو محمد، صاحب الدقيق حدثنا أبو عمران الجوني، عن أنس بن مالك، عن النبي صلى الله عليه وسلم أنه وقت لهم في كل أربعين ليلة تقليم الأظفار وأخذ الشارب وحلق العانة ‏.‏",
      "text_en": " Narrated Anas:                     from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.",
      "chain": [
        "30313",
        "20250",
        "24209",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "2984",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة، حدثنا جعفر بن سليمان، عن أبي عمران الجوني، عن أنس بن مالك، قال وقت لنا رسول الله صلى الله عليه وسلم في قص الشارب وتقليم الأظفار وحلق العانة ونتف الإبط أن لا نترك أكثر من أربعين يوما ‏.‏ قال هذا أصح من حديث الأول ‏.‏ وصدقة بن موسى ليس عندهم بالحافظ ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"",
      "chain": [
        "30367",
        "20532",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "3206",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حبان بن هلال، حدثنا سهيل بن عبد الله، وهو ابن أبي حزم أخو حزم القطعي حدثنا أبو عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال في القرآن برأيه فأصاب فقد أخطأ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد تكلم بعض أهل العلم في سهيل بن أبي حزم ‏.‏ قال أبو عيسى هكذا روي عن بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أنهم شددوا في هذا في أن يفسر القرآن بغير علم ‏.‏ وأما الذي روي عن مجاهد وقتادة وغيرهما من أهل العلم أنهم فسروا القرآن فليس الظن بهم أنهم قالوا في القرآن أو فسروه بغير علم أو من قبل أنفسهم وقد روي عنهم ما يدل على ما قلنا أنهم لم يقولوا من قبل أنفسهم بغير علم ‏.‏",
      "text_en": " Narrated Jundab bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"Whoever says (something) about the Qur'an according to his own opinion and he is correct, yet he has committed a mistake.\"",
      "chain": [
        "30553",
        "20218",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "14",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا جعفر، - هو ابن سليمان - عن أبي عمران الجوني، عن أنس بن مالك، قال وقت لنا رسول الله صلى الله عليه وسلم في قص الشارب وتقليم الأظفار وحلق العانة ونتف الإبط أن لا نترك أكثر من أربعين يوما ‏.‏ وقال مرة أخرى أربعين ليلة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"A time limit was set for us, by the Messenger of Allah (ﷺ), regarding trimming the mustache, clipping the nails and plucking the pubes; we were not to leave that for more than forty days,\" on one occasion he said: \"Forty nights.\"",
      "chain": [
        "30367",
        "20532",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "3998",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عبد الله بن محمد بن تميم، قال حدثنا حجاج، قال أخبرني شعبة، عن أبي عمران الجوني، قال قال جندب حدثني فلان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يجيء المقتول بقاتله يوم القيامة فيقول سل هذا فيم قتلني فيقول قتلته على ملك فلان ‏\"‏ ‏.‏ قال جندب فاتقها ‏.‏ 85",
      "text_en": " It was narrated that Abu 'Imran Al-Jawni said:                     \"Jundab said: 'So and so told me that the Messenger of Allah [SAW] said: The slain will bring his killer on the Day of Resurrection and will say: Ask him why he killed me. He will say: I killed him defending the kingdom of so and so.'\" Jundab said: \"So be careful.'\"",
      "chain": [
        "20219",
        "20020",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "64",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا حماد بن نجيح، - وكان ثقة - عن أبي عمران الجوني، عن جندب بن عبد الله، قال كنا مع النبي  صلى الله عليه وسلم  ونحن فتيان حزاورة فتعلمنا الإيمان قبل أن نتعلم القرآن ثم تعلمنا القرآن فازددنا به إيمانا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jundub bin 'Abdullah said:                     \"We were with the Prophet (ﷺ), and we were strong youths, so we learned faith before we learned Qur'an. Then we learned Qur'an and our faith increased thereby.\"",
      "chain": [
        "38409",
        "20032",
        "14090",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "191",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عبد الصمد عبد العزيز بن عبد الصمد، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس الأشعري، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ جنتان من فضة آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى ربهم تبارك وتعالى إلا رداء الكبرياء على وجهه في جنة عدن ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr bin Qais Al-Ash'ari narrated that his father said:                     \"The Messenger of Allah said: 'Two gardens of silver, their vessels and everything in them; and two gardens of gold, their vessels and everything in them, and nothing between the people and their seeing their Lord, the Blessed and Exalted, except the Veil of Pride covering His Face in the Garden of Eden (Jannat 'Adn).\"",
      "chain": [
        "30160",
        "20251",
        "11296"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان، عن أبي عمران الجوني، عن أنس بن مالك، قال وقت لنا في قص الشارب وحلق العانة ونتف الإبط وتقليم الأظفار أن لا نترك أكثر من أربعين ليلة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"We were given a time limit with regard to trimming the mustache, shaving the pubic hairs, plucking the armpit hairs and clipping the nails. We were not to leave that for more than forty days.\"",
      "chain": [
        "30537",
        "20532",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "1314",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ صل الصلاة لوقتها فإن أدركت الإمام يصلي بهم فصل معهم وقد أحرزت صلاتك وإلا فهي نافلة لك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “Offerprayeron time, and if you reached the Imam leading them in prayers(ontime), then perform it with them, and you will be safe with yourprayer, otherwise it will be voluntary for you.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "2972",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، أنه انتهى إلى الربذة وقد أقيمت الصلاة فإذا عبد يؤمهم فقيل هذا أبو ذر ‏.‏ فذهب يتأخر فقال أبو ذر أوصاني خليلي صلى الله عليه وسلم أن أسمع وأطيع وإن كان عبدا حبشيا مجدع الأطراف ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that he reached Rabadhah when theIqamah forthe prayer had already been given, and there was a slaveleading themin prayer. It was said:                      “This is Abu Dharr,” so he (theslave)started to move back. But Abu Dharr said: “My close friend(i.e.,the Prophet (ﷺ)) told me to listen and obey, even if (theleaderwas) an Ethiopian slave with amputated limbs.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "3487",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا أبو عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا عملت مرقة فأكثر ماءها واغترف لجيرانك منها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Prophet (ﷺ) said:                      “When youmakebroth, add more water and give some to your neighbor.”",
      "chain": [
        "30160",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "4093",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كيف أنت يا أبا ذر وموتا يصيب الناس حتى يقوم البيت بالوصيف ‏\"‏ ‏.‏ يعني القبر قلت ما خار الله لي ورسوله - أو قال الله ورسوله أعلم - قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال ‏\"‏ كيف أنت وجوعا يصيب الناس حتى تأتي مسجدك فلا تستطيع أن ترجع إلى فراشك ولا تستطيع أن تقوم من فراشك إلى مسجدك ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم أو - ما خار الله لي ورسوله - قال ‏\"‏ عليك بالعفة ‏\"‏ ‏.‏ ثم قال ‏\"‏ كيف أنت وقتلا يصيب الناس حتى تغرق حجارة الزيت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ الحق بمن أنت منه ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا آخذ بسيفي فأضرب به من فعل ذلك قال ‏\"‏ شاركت القوم إذا ولكن ادخل بيتك ‏\"‏ ‏.‏ قلت يا رسول الله فإن دخل بيتي قال ‏\"‏ إن خشيت أن يبهرك شعاع السيف فألق طرف ردائك على وجهك فيبوء بإثمه وإثمك فيكون من أصحاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                      “What will you do, O Abu Dharr, when death overwhelms thepeopleto such an extent that a grave will be equal in value to aslave?” Isaid: “Whatever Allah and His Messenger choose for me,or Allah andHis Messenger know best.” He said “Be patient.” Hesaid: ‘What willyou do when famine strikes the people so that youwill go to the placewhere you pray and will not be able to return toyour bed, or you willnot be able to get up from your bed to go tothe place where youpray?” He said: “I said: ‘Allah and HisMessenger know best, orwhatever Allah and His Messenger choose forme.” He said: “You mustrefrain from forbidden things.” Hesaid: “What will you do whenkilling befalls the people so thatHijaratuz-Zait*is covered withblood?” I said: “Whatever Allahand His Messenger choose for me.” Hesaid: “Stay with those whomyou belong to.” He said: “I said: ‘OMessenger of Allah, shouldI not take my sword and strike those who dothat?’” He said:“Then you will be just like the people. Rather enteryour house.”I said: “O Messenger of Allah, what if they enter myhouse?” Hesaid: “If you are afraid that the flashing of the swordwill dazzleyou, then put the edge of your garment over your face, andlet himcarry his own sin and your sin, and he will be one of thepeople ofthe Hellfire.”",
      "chain": [
        "30423",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    }
  ],
  "total_hadiths": 57
}