{
  "id": "11297",
  "name": "'Ali bin Da'ud,Abu al-Mutawakkal al-Naji علي بن داود أبو المتوكل الناجي",
  "full_name": "'Ali bin Da'ud,Abu al-Mutawakkal al-Naji علي بن داود أبو المتوكل الناجي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "108",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Hadith"
    ],
    "tags": [
      "al-Naji",
      "al-Basri",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14894",
      "name": "Rabi'yah al-Jrshy ربيعة الجرشي",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "24229",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10685",
      "name": "Sulaiman bin 'Ali al-Rabi'y سليمان بن علي الربعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14164",
      "name": "Sulaiman al-Aswad al-Najy سليمان الأسود الناجي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20716",
      "name": "'Ali bin 'Ali bin Njad علي بن علي بن نجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10668",
      "name": "Isma'il bin Muslim al-Bdy إسماعيل بن مسلم العبدي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10725",
      "name": "al-Waleed bin Muslim bin Shahab الوليد بن مسلم بن شهاب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2276",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد  رضى الله عنه  قال انطلق نفر من أصحاب النبي صلى الله عليه وسلم في سفرة سافروها حتى نزلوا على حى من أحياء العرب فاستضافوهم، فأبوا أن يضيفوهم، فلدغ سيد ذلك الحى، فسعوا له بكل شىء لا ينفعه شىء، فقال بعضهم لو أتيتم هؤلاء الرهط الذين نزلوا لعله أن يكون عند بعضهم شىء، فأتوهم، فقالوا يا أيها الرهط، إن سيدنا لدغ، وسعينا له بكل شىء لا ينفعه، فهل عند أحد منكم من شىء فقال بعضهم نعم والله إني لأرقي، ولكن والله لقد استضفناكم فلم تضيفونا، فما أنا براق لكم حتى تجعلوا لنا جعلا‏.‏ فصالحوهم على قطيع من الغنم، فانطلق يتفل عليه ويقرأ ‏{‏الحمد لله رب العالمين‏}‏ فكأنما نشط من عقال، فانطلق يمشي وما به قلبة، قال فأوفوهم جعلهم الذي صالحوهم عليه، فقال بعضهم اقسموا‏.‏ فقال الذي رقى لا تفعلوا، حتى نأتي النبي صلى الله عليه وسلم فنذكر له الذي كان، فننظر ما يأمرنا‏.‏ فقدموا على رسول الله صلى الله عليه وسلم فذكروا له، فقال ‏\"‏ وما يدريك أنها رقية  ثم قال  قد أصبتم اقسموا واضربوا لي معكم سهما ‏\"‏‏.‏ فضحك رسول الله صلى الله عليه وسلم‏.‏ وقال شعبة حدثنا أبو بشر سمعت أبا المتوكل بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Some of the companions of the Prophet went on a journey till they reached some of the 'Arab tribes (at night). They asked the latter to treat them as their guests but they refused. The chief of that tribe was then bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some of them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at night, it may be that some of them might possess something (as treatment),\" They went to the group of the companions (of the Prophet ) and said, \"Our chief has been bitten by a snake (or stung by a scorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" One of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as your guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees to pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are for the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a chain, and got up and started walking, showing no signs of sickness. They paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide their earnings among themselves, but the one who performed the recitation said, \"Do not divide them till we go to the Prophet and narrate the whole story to him, and wait for his order.\" So, they went to Allah's Apostle and narrated the story. Allah's Apostle asked, \"How did you come to know that Suratul- Fatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you have earned) and assign a share for me as well.\" The Prophet smiled thereupon.",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "2440",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي المتوكل الناجي، عن أبي سعيد الخدري  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا خلص المؤمنون من النار حبسوا بقنطرة بين الجنة والنار، فيتقاصون مظالم كانت بينهم في الدنيا، حتى إذا نقوا وهذبوا أذن لهم بدخول الجنة، فوالذي نفس محمد صلى الله عليه وسلم بيده لأحدهم بمسكنه في الجنة أدل بمنزله كان في الدنيا ‏\"‏‏.‏ وقال يونس بن محمد حدثنا شيبان عن قتادة حدثنا أبو المتوكل‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"When the believers pass safely over (the bridge across) Hell, they will be stopped at a bridge in between Hell and Paradise where they will retaliate upon each other for the injustices done among them in the world, and when they get purified of all their sins, they will be admitted into Paradise. By Him in Whose Hands the life of Muhammad is everybody will recognize his dwelling in Paradise better than he recognizes his dwelling in this world.\"",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "2470",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم، حدثنا أبو عقيل، حدثنا أبو المتوكل الناجي، قال أتيت جابر بن عبد الله  رضى الله عنهما  قال دخل النبي صلى الله عليه وسلم المسجد، فدخلت إليه، وعقلت الجمل في ناحية البلاط فقلت هذا جملك‏.‏ فخرج فجعل يطيف بالجمل قال ‏\"‏ الثمن والجمل لك ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet entered the Mosque, and I too went there after tying the camel at the pavement of the Mosque. I said (to the Prophet ), \"This is your camel.\" He came out and started examining the camel and said, \"Both the camel and its price are for you.\"",
      "chain": [
        "20285",
        "11297"
      ]
    },
    {
      "hadith_no": "2861",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسلم، حدثنا أبو عقيل، حدثنا أبو المتوكل الناجي، قال أتيت جابر بن عبد الله الأنصاري، فقلت له حدثني بما، سمعت من، رسول الله صلى الله عليه وسلم قال سافرت معه في بعض أسفاره  قال أبو عقيل لا أدري غزوة أو عمرة  فلما أن أقبلنا قال النبي صلى الله عليه وسلم ‏\"‏ من أحب أن يتعجل إلى أهله فليعجل ‏\"‏‏.‏ قال جابر فأقبلنا وأنا على جمل لي أرمك ليس فيه شية، والناس خلفي، فبينا أنا كذلك إذ قام على، فقال لي النبي صلى الله عليه وسلم ‏\"‏ يا جابر استمسك ‏\"‏‏.‏ فضربه بسوطه ضربة، فوثب البعير مكانه‏.‏ فقال ‏\"‏ أتبيع الجمل ‏\"‏‏.‏ قلت نعم‏.‏ فلما قدمنا المدينة ودخل النبي صلى الله عليه وسلم المسجد في طوائف أصحابه، فدخلت إليه، وعقلت الجمل في ناحية البلاط‏.‏ فقلت له هذا جملك‏.‏ فخرج، فجعل يطيف بالجمل ويقول ‏\"‏ الجمل جملنا ‏\"‏‏.‏ فبعث النبي صلى الله عليه وسلم أواق من ذهب فقال ‏\"‏ أعطوها جابرا ‏\"‏‏.‏ ثم قال ‏\"‏ استوفيت الثمن ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ الثمن والجمل لك ‏\"‏‏.‏",
      "text_en": " Narrated Muslim from Abu `Aqil from Abu Al-Mutawakkil An-Naji:                     I called on Jabir bin `Abdullah Al-Ansari and said to him, \"Relate to me what you have heard from Allah's Apostle .\" He said, \"I accompanied him on one of the journeys.\" (Abu `Aqil said, \"I do not know whether that journey was for the purpose of Jihad or `Umra.\") \"When we were returning,\" Jabir continued, \"the Prophet said, 'Whoever wants to return earlier to his family, should hurry up.' We set off and I was on a black red tainted camel having no defect, and the people were behind me. While I was in that state the camel stopped suddenly (because of exhaustion). On that the Prophet said to me, 'O Jabir, wait!' Then he hit it once with his lash and it started moving on a fast pace. He then said, 'Will you sell the camel?' I replied in the affirmative when we reached Medina, and the Prophet went to the Mosque along with his companions. I, too, went to him after tying the camel on the pavement at the Mosque gate. Then I said to him, 'This is your camel.' He came out and started examining the camel and saying, 'The camel is ours.' Then the Prophet sent some Awaq (i.e. an amount) of gold saying, 'Give it to Jabir.' Then he asked, 'Have you taken the full price (of the camel)?' I replied in the affirmative. He said, 'Both the price and the camel are for you.' ''",
      "chain": [
        "20285",
        "11297"
      ]
    },
    {
      "hadith_no": "5746",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أبي المتوكل، عن أبي سعيد، أن رجلا، أتى النبي صلى الله عليه وسلم فقال أخي يشتكي بطنه‏.‏ فقال ‏\"‏ اسقه عسلا ‏\"‏‏.‏ ثم أتى الثانية فقال ‏\"‏ اسقه عسلا ‏\"‏‏.‏ ثم أتاه فقال فعلت‏.‏ فقال ‏\"‏ صدق الله، وكذب بطن أخيك، اسقه عسلا ‏\"‏‏.‏ فسقاه فبرأ‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A man came to the Prophet and said, \"My brother has some Abdominal trouble.\" The Prophet said to him \"Let him drink honey.\" The man came for the second time and the Prophet said to him, 'Let him drink honey.\" He came for the third time and the Prophet said, \"Let him drink honey.\" He returned again and said, \"I have done that ' The Prophet then said, \"Allah has said the truth, but your brother's `Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.",
      "chain": [
        "30157",
        "20246",
        "11168",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5776",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي المتوكل، عن أبي سعيد، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن أخي استطلق بطنه‏.‏ فقال ‏\"‏ اسقه عسلا ‏\"‏‏.‏ فسقاه‏.‏ فقال إني سقيته فلم يزده إلا استطلاقا‏.‏ فقال ‏\"‏ صدق الله وكذب بطن أخيك ‏\"‏‏.‏ تابعه النضر عن شعبة‏.‏",
      "text_en": " Narrated Abu Sa`id:                     A man came to the prophet and said, 'My brother has got loose motions. The Prophet said, Let him drink honey.\" The man again (came) and said, 'I made him drink (honey) but that made him worse.' The Prophet said, 'Allah has said the Truth, and the `Abdomen of your brother has told a lie.\" (See Hadith No. 88)",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5795",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري  رضى الله عنه  أن ناسا من أصحاب النبي صلى الله عليه وسلم أتوا على حى من أحياء العرب فلم يقروهم، فبينما هم كذلك إذ لدغ سيد أولئك فقالوا هل معكم من دواء أو راق فقالوا إنكم لم تقرونا، ولا نفعل حتى تجعلوا لنا جعلا‏.‏ فجعلوا لهم قطيعا من الشاء، فجعل يقرأ بأم القرآن، ويجمع بزاقه، ويتفل، فبرأ، فأتوا بالشاء، فقالوا لا نأخذه حتى نسأل النبي صلى الله عليه وسلم فسألوه فضحك وقال ‏\"‏ وما أدراك أنها رقية، خذوها، واضربوا لي بسهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some of the companions of the Prophet came across a tribe amongst the tribes of the Arabs, and that tribe did not entertain them. While they were in that state, the chief of that tribe was bitten by a snake (or stung by a scorpion). They said, (to the companions of the Prophet ), \"Have you got any medicine with you or anybody who can treat with Ruqya?\" The Prophet's companions said, \"You refuse to entertain us, so we will not treat (your chief) unless you pay us for it.\" So they agreed to pay them a flock of sheep. One of them (the Prophet's companions) started reciting Surat-al-Fatiha and gathering his saliva and spitting it (at the snake-bite). The patient got cured and his people presented the sheep to them, but they said, \"We will not take it unless we ask the Prophet (whether it is lawful).\" When they asked him, he smiled and said, \"How do you know that Surat-al-Fatiha is a Ruqya? Take it (flock of sheep) and assign a share for me.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5808",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد، أن رهطا، من أصحاب رسول الله صلى الله عليه وسلم انطلقوا في سفرة سافروها، حتى نزلوا بحى من أحياء العرب فاستضافوهم، فأبوا أن يضيفوهم، فلدغ سيد ذلك الحى، فسعوا له بكل شىء لا ينفعه شىء، فقال بعضهم لو أتيتم هؤلاء الرهط الذين قد نزلوا بكم، لعله أن يكون عند بعضهم شىء‏.‏ فأتوهم فقالوا يا أيها الرهط إن سيدنا لدغ، فسعينا له بكل شىء، لا ينفعه شىء، فهل عند أحد منكم شىء فقال بعضهم نعم، والله إني لراق، ولكن والله لقد استضفناكم فلم تضيفونا، فما أنا براق لكم حتى تجعلوا لنا جعلا‏.‏ فصالحوهم على قطيع من الغنم، فانطلق فجعل يتفل ويقرأ ‏{‏الحمد لله رب العالمين‏}‏ حتى لكأنما نشط من عقال، فانطلق يمشي ما به قلبة‏.‏ قال فأوفوهم جعلهم الذي صالحوهم عليه، فقال بعضهم اقسموا‏.‏ فقال الذي رقى لا تفعلوا حتى نأتي رسول الله صلى الله عليه وسلم فنذكر له الذي كان، فننظر ما يأمرنا‏.‏ فقدموا على رسول الله صلى الله عليه وسلم فذكروا له فقال ‏\"‏ وما يدريك أنها رقية أصبتم اقسموا واضربوا لي معكم بسهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     A group of the companions of Allah's Apostle proceeded on a journey till they dismounted near one of the Arab tribes and requested them to entertain them as their guests, but they (the tribe people) refused to entertain them. Then the chief of that tribe was bitten by a snake (or stung by a scorpion) and he was given all sorts of treatment, but all in vain. Some of them said, \"Will you go to the group (those travelers) who have dismounted near you and see if one of them has something useful?\" They came to them and said, \"O the group! Our leader has been bitten by a snake (or stung by a scorpion) and we have treated him with everything but nothing benefited him Has anyone of you anything useful?\" One of them replied, \"Yes, by Allah, I know how to treat with a Ruqya. But. by Allah, we wanted you to receive us as your guests but you refused. I will not treat your patient with a Ruqya till you fix for us something as wages.\" Consequently they agreed to give those travellers a flock of sheep. The man went with them (the people of the tribe) and started spitting (on the bite) and reciting Surat-al-Fatiha till the patient was healed and started walking as if he had not been sick. When the tribe people paid them their wages they had agreed upon, some of them (the Prophet's companions) said, \"Distribute (the sheep).\" But the one who treated with the Ruqya said, \"Do not do that till we go to Allah's Apostle and mention to him what has happened, and see what he will order us.\" So they came to Allah's Apostle and mentioned the story to him and he said, \"How do you know that Surat-al-Fatiha is a Ruqya? You have done the right thing. Divide (what you have got) and assign for me a share with you.\"",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "6614",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني الصلت بن محمد، حدثنا يزيد بن زريع، ‏{‏ونزعنا ما في صدورهم من غل‏}‏ قال حدثنا سعيد عن قتادة عن أبي المتوكل الناجي أن أبا سعيد الخدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يخلص المؤمنون من النار، فيحبسون على قنطرة بين الجنة والنار، فيقص لبعضهم من بعض، مظالم كانت بينهم في الدنيا، حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة، فوالذي نفس محمد بيده لأحدهم أهدى بمنزله في الجنة منه بمنزله كان في الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"The believers, after being saved from the (Hell) Fire, will be stopped at a bridge between Paradise and Hell and mutual retaliation will be established among them regarding wrongs they have committed in the world against one another. After they are cleansed and purified (through the retaliation), they will be admitted into Paradise; and by Him in Whose Hand Muhammad's soul is, everyone of them will know his dwelling in Paradise better than he knew his dwelling in this world.\"",
      "chain": [
        "30140",
        "20304",
        "11168",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ح وحدثنا أبو كريب، أخبرنا ابن أبي زائدة، ح وحدثني عمرو الناقد، وابن، نمير قالا حدثنا مروان بن معاوية الفزاري، كلهم عن عاصم، عن أبي المتوكل، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ ‏\"‏ ‏.‏ زاد أبو بكر في حديثه بينهما وضوءا وقال ثم أراد أن يعاود ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) said: When anyone amongst you has sexual intercourse with his wife and then he intends to repeat it, he should perform ablution. In the hadith transmitted by Abu Bakr. (the words are):\" Between the two (acts) there should be an ablution,\" or he (the narrator) said:\" Then he intended that it should be repeated.\"",
      "chain": [
        "30201",
        "20317",
        "30216",
        "20366",
        "30263",
        "30212",
        "20201",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "4148",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا إسماعيل بن مسلم العبدي، حدثنا أبو المتوكل الناجي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب والفضة بالفضة والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح مثلا بمثل يدا بيد فمن زاد أو استزاد فقد أربى الآخذ والمعطي فيه سواء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, salt by salt, like by like, payment being made hand to hand. He who made an addition to it, or asked for an addition, in fact dealt in usury. The receiver and the giver are equally guilty.",
      "chain": [
        "30201",
        "20032",
        "10668",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "4149",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عمرو الناقد، حدثنا يزيد بن هارون، أخبرنا سليمان الربعي، حدثنا أبو المتوكل الناجي عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب مثلا بمثل ‏\"‏ ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id al-Khudri (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30263",
        "20472",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "4188",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عقبة بن مكرم العمي، حدثنا يعقوب بن إسحاق، حدثنا بشير بن عقبة، عن أبي المتوكل الناجي، عن جابر بن عبد الله، قال سافرت مع رسول الله صلى الله عليه وسلم في بعض أسفاره - أظنه قال غازيا - واقتص الحديث وزاد فيه قال ‏\"‏ يا جابر أتوفيت الثمن ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ لك الثمن ولك الجمل لك الثمن ولك الجمل‏\"‏ ‏.‏",
      "text_en": " Abd Mutawakkil al-Najl reported from Jabir b. 'Abdullah (Allah be pleased with them) who said:                      I accompanied Allah's Messenger (may peace be upon him) in one of his journeys (the narrator says, he said in Jihad), and he narrated the rest of the hadith, and made this addition: He (the Holy Prophet) said: Jabir, have you received the price? I said: Yes, whereupon he said: Yours is the price as well as the camel; yours is the price as well as the camel.",
      "chain": [
        "30441",
        "20679",
        "11297",
        "34"
      ]
    },
    {
      "hadith_no": "5267",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا وكيع، عن إسماعيل بن مسلم العبدي، عن أبي، المتوكل الناجي عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب النبيذ منكم فليشربه زبيبا فردا أو تمرا فردا أو بسرا فردا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      He who amongst you drinks Nabidh should drink that (prepared either from) grapes alone, or from dates alone, or from unripe dates alone (and not by mixing them with one another).",
      "chain": [
        "30367",
        "20032",
        "10668",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5301",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا المثنى، - يعني ابن سعيد - عن أبي المتوكل، عن أبي سعيد، قال نهى رسول الله صلى الله عليه وسلم عن الشرب في الحنتمة والدباء والنقير ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) forbade drinking in green pitcher, in gourd and in the hollow stump.",
      "chain": [
        "30395",
        "20264",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5863",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا هشيم، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، أن ناسا، من أصحاب رسول الله صلى الله عليه وسلم كانوا فى سفر فمروا بحى من أحياء العرب فاستضافوهم فلم يضيفوهم ‏.‏ فقالوا لهم هل فيكم راق فإن سيد الحى لديغ أو مصاب ‏.‏ فقال رجل منهم نعم فأتاه فرقاه بفاتحة الكتاب فبرأ الرجل فأعطي قطيعا من غنم فأبى أن يقبلها ‏.‏ وقال حتى أذكر ذلك للنبي صلى الله عليه وسلم ‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له ‏.‏ فقال يا رسول الله والله ما رقيت إلا بفاتحة الكتاب ‏.‏ فتبسم وقال ‏\"‏ وما أدراك أنها رقية ‏\"‏ ‏.‏ ثم قال ‏\"‏ خذوا منهم واضربوا لي بسهم معكم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that some persons amongst the Companions of Allah's Messenger (may peace be upon him) set out on a journey and they happened to pass by a tribe from the tribes of Arabia. They demanded hospitality from the members of that tribe, but they did not extend any hospitality to them. They said to them:                      Is there any incantator amongst you, at the chief of the tribe has bgen stung by a scorpion? A person amongst us said: 'Yes. So he came to him and he practised incan- tation with the help of Sura al-Fatiha and the person became all right. He was given a flock of sheep (as recompense), but he refused to accept that, saying: I shall make a mention of it to Allah's Apostle (may peace be upon him), and if he approves of it. then I shall accept it. So we came to Allah's Apostle (may peace be upon him) and made a mention of that to him and he (that person) said: Allah's Messenger by Allah, I did not practice incantation but with the help of Sura al-Fatiha of the Holy Book. He (the Holy Prophet) smiled and said: How did you come to know that it can be used (as incactation)? - and then said: Take out of that and allocate a share for me along with your share.",
      "chain": [
        "30399",
        "20468",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5901",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي المتوكل، عن أبي سعيد الخدري، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن أخي استطلق بطنه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسقه عسلا ‏\"‏ ‏.‏ فسقاه ثم جاءه فقال إني سقيته عسلا فلم يزده إلا استطلاقا ‏.‏ فقال له ثلاث مرات ثم جاء الرابعة فقال ‏\"‏ اسقه عسلا ‏\"‏ ‏.‏ فقال لقد سقيته فلم يزده إلا استطلاقا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدق الله وكذب بطن أخيك ‏\"‏ ‏.‏ فسقاه فبرأ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that a person came to Allah's Apostle (may peace be upon him) and told him that his brother's bowels were loose. Thereupon Allah's Messenger (may peace be upon him) said:                      Give him honey. So he gave him that and then came and said: I gave him honey but it has only made his bowels more loose. He said this three times; and then he came the fourth time, and he (the Holy Prophet) said: Give him honey. He said: I did give him, but it has only made his bowels more loose, whereupon Allah's Messenger (may peace be upon him) said: Allah has spoken the truth and your brother's bowels are in the wrong. So he made him drink (honey) and he was recovered. This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5902",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنيه عمرو بن زرارة، أخبرنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، عن أبي المتوكل الناجي، عن أبي سعيد الخدري، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إن أخي عرب بطنه ‏.‏ فقال له ‏\"‏ اسقه عسلا ‏\"‏ ‏.‏ بمعنى حديث شعبة ‏.‏",
      "text_en": "",
      "chain": [
        "20557",
        "11168",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "220",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عون، حدثنا حفص بن غياث، عن عاصم الأحول، عن أبي المتوكل، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم أهله ثم بدا له أن يعاود فليتوضأ بينهما وضوءا ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khudri reported :                      The Prophet (May peace be upon him) said : When any of you has intercourse with his wife and desire to repeat it, he should perform ablution between them.",
      "chain": [
        "30154",
        "20317",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "574",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن سليمان الأسود، عن أبي المتوكل، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم أبصر رجلا يصلي وحده فقال ‏\"‏ ألا رجل يتصدق على هذا فيصلي معه ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id al-Khudri:                     The Messenger of Allah  (ﷺ) saw a person praying alone. He said: Is there any man who may do good with this (man) and pray along with him.",
      "chain": [
        "20040",
        "20299",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، عن علي بن علي الرفاعي، عن أبي المتوكل الناجي، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم إذا قام من الليل كبر ثم يقول ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ ثم يقول ‏\"‏ لا إله إلا الله ‏\"‏ ‏.‏ ثلاثا ثم يقول ‏\"‏ الله أكبر كبيرا ‏\"‏ ‏.‏ ثلاثا ‏\"‏ أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه ‏\"‏ ‏.‏ ثم يقرأ ‏.‏ قال أبو داود وهذا الحديث يقولون هو عن علي بن علي عن الحسن مرسلا الوهم من جعفر ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the Messenger of Allah (ﷺ) got up to pray at night (for tahajjud prayer) he uttered the takbir and then said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name,\" and Exalted is Thy greatness.\" and \"There is no god but Thee.\" He then said: \"There is no god but Allah\" three times; he then said: \"Allah is altogether great\" three times: \"I seek refuge in Allah, All-Hearing and All-Knowing from the accursed devil, from his evil suggestion (hamz), from his puffing up (nafkh), and from his spitting (nafth)\" He then recited (the Qur'an).Abu Dawud said: It is said that this tradition has been narrated by 'Ali b. 'Ali from al-Hasan omitting the name of the Companion of the Prophet (ﷺ). The misunderstanding occurred on the part of Ja'far.",
      "chain": [
        "20249",
        "11407",
        "20716",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "3418",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، أن رهطا، من أصحاب رسول الله صلى الله عليه وسلم انطلقوا في سفرة سافروها فنزلوا بحى من أحياء العرب فاستضافوهم فأبوا أن يضيفوهم - قال - فلدغ سيد ذلك الحى فشفوا له بكل شىء لا ينفعه شىء ‏.‏ فقال بعضهم لو أتيتم هؤلاء الرهط الذين نزلوا بكم لعل أن يكون عند بعضهم شىء ينفع صاحبكم فقال بعضهم إن سيدنا لدغ فشفينا له بكل شىء فلا ينفعه شىء فهل عند أحد منكم شىء يشفي صاحبنا يعني رقية ‏.‏ فقال رجل من القوم إني لأرقي ولكن استضفناكم فأبيتم أن تضيفونا ما أنا براق حتى تجعلوا لي جعلا ‏.‏ فجعلوا له قطيعا من الشاء فأتاه فقرأ عليه بأم الكتاب ويتفل حتى برئ كأنما أنشط من عقال فأوفاهم جعلهم الذي صالحوه عليه ‏.‏ فقالوا اقتسموا فقال الذي رقى لا تفعلوا حتى نأتي رسول الله صلى الله عليه وسلم فنستأمره ‏.‏ فغدوا على رسول الله صلى الله عليه وسلم فذكروا له فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أين علمتم أنها رقية أحسنتم واضربوا لي معكم بسهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     Some of the Companions of Prophet (ﷺ) went on a journey. They encamped with a clan of the Arabs and sought hospitality from them, but they refused to provide them with any hospitality. The chief of the clan was stung by a scorpion or bitten by a snake. They gave him all sorts of treatment, but nothing gave him relied. One of them said: Would that you had gone to those people who encamped with you ; some of them might have something which could give you relief to your companion. (So they went and) one of them said: Our chief has been stung by a scorpion or bitten by a snake. We administered all sorts of medicine but nothing gave him relief. Has any of you anything, i.e. charm, which gives healing to our companion. One of those people said: I shall apply charm; we sought hospitality from you, but you refused to entertain us. I am not going to apply charm until you give me some wages. So they offered them a number of sheep. He then came to and recited Faithat-al-Kitab and spat until he was cured as if he were set free from a bond. Thereafter they made payment of the wages as agreed by them. They said: Apportion (the wages). The man who applied the charm said: Do not do until we come to the Messenger of Allah (ﷺ) and consult him. So they came to the Messenger of Allah (ﷺ) next morning and mentioned it to him. The Messenger of Allah (ﷺ) said: From where did you learn that it was a charm ? You have done right. Give me a share along with you.",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "3648",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الحذاء، عن أبي المتوكل الناجي، عن أبي سعيد الخدري، قال ما كنا نكتب غير التشهد والقرآن ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                      \"We used not to write anything but the Tasha-hud and the Qur'an.\"",
      "chain": [
        "30184",
        "11613",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "3900",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، أن رهطا، من أصحاب النبي صلى الله عليه وسلم انطلقوا في سفرة سافروها فنزلوا بحى من أحياء العرب فقال بعضهم إن سيدنا لدغ فهل عند أحد منكم شىء ينفع صاحبنا فقال رجل من القوم نعم والله إني لأرقي ولكن استضفناكم فأبيتم أن تضيفونا ما أنا براق حتى تجعلوا لي جعلا ‏.‏ فجعلوا له قطيعا من الشاء فأتاه فقرأ عليه أم الكتاب ويتفل حتى برأ كأنما أنشط من عقال ‏.‏ قال فأوفاهم جعلهم الذي صالحوهم عليه فقالوا اقتسموا ‏.‏ فقال الذي رقى لا تفعلوا حتى نأتي رسول الله صلى الله عليه وسلم فنستأمره ‏.‏ فغدوا على رسول الله صلى الله عليه وسلم فذكروا له فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أين علمتم أنها رقية أحسنتم اقتسموا واضربوا لي معكم بسهم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’d al-KHudri said :                      Some of the Companions of the Prophet (ﷺ) went on a journey. They alighted with a certain clan of the Arabs. Someone of them said : Our chief has been stung by a scorpion or bitten by a snake. Has any of you something which gives relief to our chief? A man of the people said : Yes, I swear by Allah. I shall apply charm ; but we asked you for hospitality and you denied it to us. I shall not apply charm until you give me some payment. So they promised to give some sheep to him. He came to him and recited Surat al-Fatihah over him and spat till he was cured, and ha seemed as if he were set free from a bond. So they gave him the payment that was agreed between them. They said : Apportion them. The man who applied charm said : Do not do it until we approach the Apostle of allah (ﷺ) said: From where did you learn that it was a charm ? you have done right. Apportion them, and give me a share along with you.",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "141",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا حفص بن غياث، عن عاصم الأحول، عن أبي المتوكل، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ بينهما وضوءا ‏\"‏ ‏.‏ قال وفي الباب عن عمر ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏ وهو قول عمر بن الخطاب وقال به غير واحد من أهل العلم قالوا إذا جامع الرجل امرأته ثم أراد أن يعود فليتوضأ قبل أن يعود ‏.‏ وأبو المتوكل اسمه علي بن داود ‏.‏ وأبو سعيد الخدري اسمه سعد بن مالك بن سنان ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     the Prophet said: When one of you comes to his wife, then he wants to repeat (it), let him perform Wudu between them.\"",
      "chain": [
        "30480",
        "20317",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "220",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن سعيد بن أبي عروبة، عن سليمان الناجي البصري، عن أبي المتوكل، عن أبي سعيد، قال جاء رجل وقد صلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيكم يتجر على هذا ‏\"‏ ‏.‏ فقام رجل فصلى معه ‏.‏ قال وفي الباب عن أبي أمامة وأبي موسى والحكم بن عمير ‏.‏ قال أبو عيسى وحديث أبي سعيد حديث حسن ‏.‏ وهو قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم من التابعين قالوا لا بأس أن يصلي القوم جماعة في مسجد قد صلي فيه جماعة ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال آخرون من أهل العلم يصلون فرادى ‏.‏ وبه يقول سفيان وابن المبارك ومالك والشافعي يختارون الصلاة فرادى ‏.‏ وسليمان الناجي بصري ويقال سليمان بن الأسود ‏.‏ وأبو المتوكل اسمه علي بن داود ‏.‏",
      "text_en": " Abu Sa'eed narrated:                     \"A man came when Allah's Messenger had already prayed, so he said: 'Which of you will give some reward to this person?' So a man stood to pray with him.\"",
      "chain": [
        "30480",
        "20337",
        "11073",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا جعفر بن سليمان الضبعي، عن علي بن علي الرفاعي، عن أبي المتوكل، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة بالليل كبر ثم يقول ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ ثم يقول ‏\"‏ الله أكبر كبيرا ‏\"‏ ‏.‏ ثم يقول ‏\"‏ أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وعائشة وعبد الله بن مسعود وجابر وجبير بن مطعم وابن عمر ‏.‏ قال أبو عيسى وحديث أبي سعيد أشهر حديث في هذا الباب ‏.‏ وقد أخذ قوم من أهل العلم بهذا الحديث وأما أكثر أهل العلم فقالوا بما روي عن النبي صلى الله عليه وسلم أنه كان يقول ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ وهكذا روي عن عمر بن الخطاب وعبد الله بن مسعود ‏.‏ والعمل على هذا عند أكثر أهل العلم من التابعين وغيرهم ‏.‏ وقد تكلم في إسناد حديث أبي سعيد كان يحيى بن سعيد يتكلم في علي بن علي الرفاعي وقال أحمد لا يصح هذا الحديث ‏.‏",
      "text_en": " Abu Sa'eeed Al Khudri narrated:                     \"When Allah;s Messenger stood for Salat during the night, he would say the Takbir (Allahu Akbar), then say: (Subhanaka Allahumma wa bihamdika wa Tabarakasmuka wa Ta'ala Jadduka wa la ilaha ghairuk.) 'Glorious You are O Allah, and with Your praise, and blesses is Your Name, and exalted is Your majesty, and none has the right to be worshipped but You' Then he would say: (A'udhu Bilahi As-Sami'il-Alimi min Ash-Shaitanir-Rajimi, min Hamzihi Wa Nafkhihi wa Nafthihi.)\" 'Allah is undoubtedly the greatest.' (Allahu Akbaru Kabira). Then he would say: 'I seek refuge in Allah the All-Hearing, the All-Knowing, from the cursed Shaitan, from his madness, his arrogance, and his poetry.'",
      "chain": [
        "38602",
        "20532",
        "20716",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "448",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر، محمد بن نافع البصري حدثنا عبد الصمد بن عبد الوارث، عن إسماعيل بن مسلم العبدي، عن أبي المتوكل الناجي، عن عائشة، قالت قام النبي صلى الله عليه وسلم بآية من القرآن ليلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet (S) stood (in prayer) with an Ayah from the Qur'an at night\"",
      "chain": [
        "20250",
        "10668",
        "11297",
        "53"
      ]
    },
    {
      "hadith_no": "2226",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي المتوكل، عن أبي سعيد، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إن أخي استطلق بطنه ‏.‏ فقال ‏\"‏ اسقه عسلا ‏\"‏ ‏.‏ فسقاه ثم جاء فقال يا رسول الله قد سقيته عسلا فلم يزده إلا استطلاقا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسقه عسلا ‏\"‏ ‏.‏ فسقاه ثم جاءه فقال يا رسول الله قد سقيته عسلا فلم يزده إلا استطلاقا ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدق الله وكذب بطن أخيك اسقه عسلا ‏\"‏ ‏.‏ فسقاه عسلا فبرأ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Sa'eed said:                     \"A man came to the Prophet (S.A.W) and said: 'My brother is suffering from loose bowels.' He said: 'Let him drink Honey.' So he drank it. Then he came and said: O Messenger of Allah (S.A.W)! He has drunk honey, but it has only made him more worse.' So the Messenger of Allah (S.A.W) said: ' Let him drink honey.'\" He said: \"So he drank it. Then he came and said: 'O Messenger of Allah (S.A.W)! I gave him some more to drink, but it has only made him more worse.'\" He said: \"The Messenger of Allah (S.A.W) said: 'Allah has told the truth,and your brother's stomach has lied. Give him honey to drink'. So he gave him some more honey to drink and he was cured.'\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا سفيان، عن عاصم، عن أبي المتوكل، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أراد أحدكم أن يعود توضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that the Prophet (ﷺ) said:                      \"When any one of you a wants to return (to have intercourse again), let him perform Wudu'.\"",
      "chain": [
        "30325",
        "20005",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن أبي عوانة، عن منصور بن زاذان، عن الوليد أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يقوم في الظهر فيقرأ قدر ثلاثين آية في كل ركعة ثم يقوم في العصر في الركعتين الأوليين قدر خمس عشرة آية ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"The Messenger of Allah (ﷺ) used to stand in Zuhr and recite the equivalent of thirty verses in each Rak'ah, then in the first two Rak'ahs of 'Asr he would stand for the equivalent of fifteen verses.\"",
      "chain": [
        "38265",
        "20025",
        "20469",
        "11444",
        "10725",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبيد الله بن فضالة بن إبراهيم، قال أنبأنا عبد الرزاق، قال أنبأنا جعفر بن سليمان، عن علي بن علي، عن أبي المتوكل، عن أبي سعيد، أن النبي صلى الله عليه وسلم كان إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     When the Prophet (ﷺ) started to pray he would say: \"Subhanakallahumma, wa bihamdika tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuk (Glory and praise be to You, O Allah. Blessed be Your name and exalted be Your majesty, there is none worthy of worship except You.)\"",
      "chain": [
        "20121",
        "20532",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "900",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثني جعفر بن سليمان، عن علي بن علي، عن أبي المتوكل، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"When the Messenger of Allah (ﷺ) started to pray, he would say: 'Subhanakallahumma, wa bihamdika tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuk (Glory and praise be to You, O Allah. Blessed be Your name and exalted be Your majesty, there is none worthy of worship except You.)\"",
      "chain": [
        "38022",
        "20650",
        "20532",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "3956",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا أسد بن موسى، قال حدثنا حماد بن سلمة، عن ثابت، عن أبي المتوكل، عن أم سلمة، أنها - يعني - أتت بطعام في صحفة لها إلى رسول الله صلى الله عليه وسلم وأصحابه فجاءت عائشة متزرة بكساء ومعها فهر ففلقت به الصحفة فجمع النبي صلى الله عليه وسلم بين فلقتى الصحفة ويقول ‏\"‏ كلوا غارت أمكم ‏\"‏ ‏.‏ مرتين ثم أخذ رسول الله صلى الله عليه وسلم صحفة عائشة فبعث بها إلى أم سلمة وأعطى صحفة أم سلمة عائشة ‏.‏",
      "text_en": " It was narrated from Umm Salamah that she brought some food in a dish of hers to the Messenger of Allah and his Companions, then 'Aishah came, wrapped up in a garment, with a stone pestle and broke the dish. The Prophet gathered the broken pieces of the dish and said:                      \"Eat; your mother got jealous,\" twice. Then the Messenger of Allah took the dish of 'Aishah and sent it to Umm Salamah and he gave the dish of Umm Salamah to 'Aishah.",
      "chain": [
        "30583",
        "28040",
        "20021",
        "11269",
        "11297",
        "56"
      ]
    },
    {
      "hadith_no": "5569",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن خالد، قال حدثنا شعيب بن حرب، قال حدثنا إسماعيل بن مسلم، قال حدثنا أبو المتوكل الناجي، قال حدثني أبو سعيد الخدري، أن النبي صلى الله عليه وسلم نهى أن يخلط بسرا بتمر أو زبيبا بتمر أو زبيبا ببسر وقال ‏\"‏ من شرب منكم فليشرب كل واحد منه فردا ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا أبو المتوكل اسمه علي بن داود ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet [SAW] forbade mixing Al-Busr with dried dates, or raisins with dried dates, or raisins with Al-Busr, and he said: \"Whoever among you (wants to) drink them, let him drink each one on its own.\"",
      "chain": [
        "20194",
        "22025",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5571",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، - يعني ابن عمران - عن إسماعيل بن مسلم، عن أبي المتوكل، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم نهى أن ينبذ التمر والزبيب والتمر والبسر وقال ‏\"‏ انتبذوا الزبيب فردا والتمر فردا والبسر فردا ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو كثير اسمه يزيد بن عبد الرحمن ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Prophet [SAW] forbade soaking dried dates and raisins, and dried dates and Al-Busr, and he said: \"Soak raisins on their own, and dried dates on their own, and Al-Busr on their own.\"",
      "chain": [
        "30029",
        "22025",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5633",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن المثنى بن سعيد، عن أبي المتوكل، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن الشرب في الحنتم والدباء والنقير ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     The Messenger of Allah [SAW] forbade drinking from green pitchers, gourds and vessels carved from wood.",
      "chain": [
        "38265",
        "20025",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "630",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم الأحول، عن أبي المتوكل، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah said: 'If anyone of you has intercourse with his wife, then he wants to do it again, let him perform ablution.'\"",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "853",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثني جعفر بن سليمان الضبعي، حدثني علي بن علي الرفاعي، عن أبي المتوكل، عن أبي سعيد الخدري، قال كان رسول الله  صلى الله عليه وسلم  يستفتح صلاته يقول ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) used to start his prayer by saying: ‘Subhanaka Allahummawabi hamdika, wa tabarakas-muka, wa ta’ala jadduka, wa la ilahaghairuka (Glory and praise be to You, O Allah, blessed be Your Nameand exalted be Your majesty, none has the right to be worshipped butyou).”",
      "chain": [
        "30201",
        "20650",
        "20532",
        "20716",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "2240",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو كريب، حدثنا هشيم، حدثنا أبو بشر، عن أبي المتوكل، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  بنحوه ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏ قال أبو عبد الله والصواب هو أبو المتوكل إن شاء الله ‏.‏",
      "text_en": "",
      "chain": [
        "30216",
        "20468",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبي، عن المثنى بن سعيد، عن أبي المتوكل، عن أبي سعيد الخدري، قال نهى رسول الله  صلى الله عليه وسلم  عن الشرب في الحنتم والدباء والنقير ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) forbade drinking from Hantam, Dubba’ and Naqir.",
      "chain": [
        "30395",
        "20264",
        "11297",
        "38"
      ]
    }
  ],
  "total_hadiths": 41
}