{
  "id": "113",
  "name": "Abu Usayd Malik bin Rabi'a ( مالك بن ربيعة أبو أسيد الساعدي الأنصاري ( رضي الله عنه",
  "full_name": "Abu Usayd Malik bin Rabi'a ( مالك بن ربيعة أبو أسيد الساعدي الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "60",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Sa'ida B.Ka'b B.al-Khazraj",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1460",
      "name": "Salama bint Wahab ( سلامة بنت وهب , أم أسيد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "1463",
      "name": "Usayd bin Abi Usayd al-Sa'idi ( أسيد بن أبي أسيد الساعدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1462",
      "name": "al-Mundhir bin Abi Usayd al-Sa'idi ( المنذر بن أبي أسيد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1461",
      "name": "Hamza bin Abi Usayd al-Sa'idi ( حمزة بن أبي أسيد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11689",
      "name": "al-Zubair bin Abi Usayd الزبير بن أبي أسيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1461",
      "name": "Hamza bin Abi Usayd al-Sa'idi ( حمزة بن أبي أسيد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "1463",
      "name": "Usayd bin Abi Usayd al-Sa'idi ( أسيد بن أبي أسيد الساعدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1462",
      "name": "al-Mundhir bin Abi Usayd al-Sa'idi ( المنذر بن أبي أسيد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11689",
      "name": "al-Zubair bin Abi Usayd الزبير بن أبي أسيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12372",
      "name": "'Ali bin 'Ubaid al-Ansari علي بن عبيد الأنصاري المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11697",
      "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2900",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد الرحمن بن الغسيل، عن حمزة بن أبي أسيد، عن أبيه، قال قال النبي صلى الله عليه وسلم يوم بدر حين صففنا لقريش وصفوا لنا ‏\"‏ إذا أكثبوكم فعليكم بالنبل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Usaid:                     On the day (of the battle) of Badr when we stood in rows against (the army of) Quraish and they stood in rows against us, the Prophet said, \"When they do come near you, throw arrows at them.\"",
      "chain": [
        "20348",
        "11517",
        "1461",
        "113"
      ]
    },
    {
      "hadith_no": "3835",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت قتادة، عن أنس بن مالك، عن أبي أسيد  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ خير دور الأنصار بنو النجار، ثم بنو عبد الأشهل، ثم بنو الحارث بن خزرج، ثم بنو ساعدة، وفي كل دور الأنصار خير ‏\"‏‏.‏ فقال سعد ما أرى النبي صلى الله عليه وسلم إلا قد فضل علينا فقيل قد فضلكم على كثير‏.‏",
      "text_en": " Narrated Abu Usaid:                     The Prophet said, \"The best of the Ansar's families (homes) are those of Banu An-Najjar and then (those of) Banu `Abdul Ash-hal, then (those of) Banu Al-Harith bin Al-Khazraj and then (those of) Banu Sa`ida; nevertheless, there is good in all the families (houses) of the Ansar.\" On this, Sa`d (bin Ubada) said, \"I see that the Prophet has preferred some people to us.\" Somebody said (to him), \"No, but he has given you superiority to many.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19",
        "113"
      ]
    },
    {
      "hadith_no": "3836",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال عبد الصمد حدثنا شعبة، حدثنا قتادة، سمعت أنسا، قال أبو أسيد عن النبي صلى الله عليه وسلم بهذا، وقال سعد بن عبادة‏.‏",
      "text_en": " Narrated Abu Usaid:                     That he heard the Prophet saying, \"The best of the Ansar, or the best of the Ansar families (homes) are Banu An-Najjar, Bani `Abdul Ash-hal, Banu Al-Harith and Banu Sai'da.\"",
      "chain": [
        "20250",
        "20020",
        "11019",
        "19",
        "113"
      ]
    },
    {
      "hadith_no": "3837",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أبو سلمة أخبرني أبو أسيد، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ خير الأنصار  أو قال خير دور الأنصار  بنو النجار وبنو عبد الأشهل وبنو الحارث وبنو ساعدة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "113"
      ]
    },
    {
      "hadith_no": "4033",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن الغسيل، عن حمزة بن أبي أسيد، والزبير بن المنذر بن أبي أسيد، عن أبي أسيد  رضى الله عنه  قال قال لنا رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ إذا أكثبوكم فارموهم واستبقوا نبلكم ‏\"‏‏.‏",
      "text_en": " Narrated Usaid:                     On the day of Badr, Allah's Apostle said to us, \"When the enemy comes near to you, shoot at them but use your arrows sparingly (so that your arrows should not be wasted).",
      "chain": [
        "30351",
        "20355",
        "11517",
        "1461",
        "11689",
        "113"
      ]
    },
    {
      "hadith_no": "4034",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن الغسيل، عن حمزة بن أبي أسيد، والمنذر بن أبي أسيد، عن أبي أسيد  رضى الله عنه  قال قال لنا رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ إذا أكثبوكم  يعني كثروكم  فارموهم، واستبقوا نبلكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Usaid:                     On the day of (the battle of) Badr, Allah's Apostle said to us, \"When your enemy comes near to you (i.e. overcome you by sheer number), shoot at them but use your arrows sparingly.\"",
      "chain": [
        "30272",
        "20355",
        "11517",
        "1461",
        "1462",
        "113"
      ]
    },
    {
      "hadith_no": "5310",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد الرحمن بن غسيل، عن حمزة بن أبي أسيد، عن أبي أسيد  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم حتى انطلقنا إلى حائط يقال له الشوط، حتى انتهينا إلى حائطين فجلسنا بينهما فقال النبي صلى الله عليه وسلم ‏\"‏ اجلسوا ها هنا ‏\"‏‏.‏ ودخل وقد أتي بالجونية، فأنزلت في بيت في نخل في بيت أميمة بنت النعمان بن شراحيل ومعها دايتها حاضنة لها، فلما دخل عليها النبي صلى الله عليه وسلم قال ‏\"‏ هبي نفسك لي ‏\"‏‏.‏ قالت وهل تهب الملكة نفسها للسوقة‏.‏ قال فأهوى بيده يضع يده عليها لتسكن فقالت أعوذ بالله منك‏.‏ فقال ‏\"‏ قد عذت بمعاذ ‏\"‏‏.‏ ثم خرج علينا، فقال ‏\"‏ يا أبا أسيد اكسها رازقيتين وألحقها بأهلها‏\"‏‏.‏",
      "text_en": " Narrated Abu Usaid:                     We went out with the Prophet to a garden called Ash-Shaut till we reached two walls between which we sat down. The Prophet said, \"Sit here,\" and went in (the garden). The Jauniyya (a lady from Bani Jaun) had been brought and lodged in a house in a date-palm garden in the home of Umaima bint An- Nu`man bin Sharahil, and her wet nurse was with her. When the Prophet entered upon her, he said to her, \"Give me yourself (in marriage) as a gift.\" She said, \"Can a princess give herself in marriage to an ordinary man?\" The Prophet raised his hand to pat her so that she might become tranquil. She said, \"I seek refuge with Allah from you.\" He said, \"You have sought refuge with One Who gives refuge. Then the Prophet came out to us and said, \"O Abu Usaid! Give her two white linen dresses to wear and let her go back to her family.\" Narrated Sahl and Abu Usaid: The Prophet married Umaima bint Sharahil, and when she was brought to him, he stretched his hand towards her. It seemed that she disliked that, whereupon the Prophet ordered Abu Usaid to prepare her and to provide her with two white linen dresses. (See Hadith No. 541).",
      "chain": [
        "20348",
        "1461",
        "113"
      ]
    },
    {
      "hadith_no": "5311",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وقال الحسين بن الوليد النيسابوري عن عبد الرحمن، عن عباس بن سهل، عن أبيه، وأبي، أسيد قالا تزوج النبي صلى الله عليه وسلم أميمة بنت شراحيل، فلما أدخلت عليه بسط يده إليها فكأنها كرهت ذلك فأمر أبا أسيد أن يجهزها ويكسوها ثوبين رازقيين‏.‏",
      "text_en": "",
      "chain": [
        "28114",
        "20033",
        "113"
      ]
    },
    {
      "hadith_no": "6122",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبي الزناد، عن أبي سلمة، عن أبي أسيد الساعدي، قال قال النبي صلى الله عليه وسلم ‏\"‏ خير دور الأنصار بنو النجار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Usaid As-Sa`idi:                     The Prophet said, \"The best family among the Ansar is the Banu An-Najjar. \"",
      "chain": [
        "20351",
        "20012",
        "11061",
        "10567",
        "113"
      ]
    },
    {
      "hadith_no": "1685",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد، عن أبي حميد، - أو عن أبي أسيد، - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم المسجد فليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏ قال مسلم سمعت يحيى بن يحيى يقول كتبت هذا الحديث من كتاب سليمان بن بلال ‏.‏ قال بلغني أن يحيى الحماني يقول وأبي أسيد ‏.‏",
      "text_en": " Abu Usaid reported that the Messenger of Allah (may peace be upon him) said:                      When any one of you enters the mosque, he should say:\" O Allah! open for me the doors of Thy mercy\" ; and when he steps out he should say: 'O Allah! I beg of Thee Thy Grace.\" (Imam Muslim said: I heard Yahya saying: I transcribed this hadith from the compilation of Sulaiman b. Bilal.)",
      "chain": [
        "30399",
        "20160",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) by Abu Usaid.",
      "chain": [
        "30128",
        "20212",
        "11894",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "6577",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، سمعت قتادة، يحدث عن أنس بن مالك، عن أبي أسيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار بنو النجار ثم بنو عبد الأشهل ثم بنو الحارث بن الخزرج ثم بنو ساعدة وفي كل دور الأنصار خير ‏\"‏ ‏.‏ فقال سعد ما أرى رسول الله صلى الله عليه وسلم إلا قد فضل علينا ‏.‏ فقيل قد فضلكم على كثير ‏.‏",
      "text_en": " Abu Usaid reported Allah's Messenger (may peace be upon him) as saying:                      The worthiest clans of the Ansar are Banu Najjar, thereafter Banu al-Ashhal; thereafter Banu Harith b. Banu Khazraj; thereafter Banu Sa'idah and there is goodness in all clans of the Ansar. Sa'd said: I see that he (the Holy Prophet) has placed others above us. It was said to (him): He has placed you above many others.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11019",
        "19",
        "113"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن سليمان بن الغسيل، عن حمزة بن أبي أسيد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم حين اصطففنا يوم بدر ‏\"‏ إذا أكثبوكم - يعني إذا غشوكم - فارموهم بالنبل واستبقوا نبلكم ‏\"‏ ‏.‏",
      "text_en": " Abu Usaid reported the Apostle of Allaah(ﷺ) as saying to us at the battle of Badr when he drew up in rows. When they came near you, shoot arrows at them, but do not use all your arrows.",
      "chain": [
        "30297",
        "20355",
        "11517",
        "1461",
        "113"
      ]
    },
    {
      "hadith_no": "5272",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، - يعني ابن محمد عن أبي اليمان، عن شداد بن أبي عمرو بن حماس، عن أبيه، عن حمزة بن أبي أسيد الأنصاري، عن أبيه، أنه سمع رسول الله صلى الله عليه وسلم يقول وهو خارج من المسجد فاختلط الرجال مع النساء في الطريق فقال رسول الله صلى الله عليه وسلم للنساء ‏\"‏ استأخرن فإنه ليس لكن أن تحققن الطريق عليكن بحافات الطريق ‏\"‏ ‏.‏ فكانت المرأة تلتصق بالجدار حتى إن ثوبها ليتعلق بالجدار من لصوقها به ‏.‏",
      "text_en": " Narrated AbuUsayd al-Ansari:                     AbuUsayd heard the Messenger of Allah (ﷺ) say when he was coming out of the mosque, and men and women were mingled in the road: Draw back, for you must not walk in the middle of the road; keep to the sides of the road. Then women were keeping so close to the wall that their garments were rubbing against it.",
      "chain": [
        "20164",
        "20167",
        "30330",
        "12169",
        "1461",
        "113"
      ]
    },
    {
      "hadith_no": "1852",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وأبو نعيم قالا حدثنا سفيان، عن عبد الله بن عيسى، عن رجل، يقال له عطاء من أهل الشام عن أبي أسيد قال قال النبي صلى الله عليه وسلم ‏\"‏ كلوا الزيت وادهنوا به فإنه من شجرة مباركة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه إنما نعرفه من حديث سفيان الثوري عن عبد الله بن عيسى ‏.‏",
      "text_en": " Narrated Abu Asid:                     \"The Prophet (ﷺ) said: Eat of its oil and use it (the olives), for indeed it is from a blessed tree.\"[Abu 'Eisa said:] This Hadith is Gharib from this route. We only know of it from the narration of Sufyan At-Thawri, from 'Abdullah bin 'Eisa.",
      "chain": [
        "30277",
        "20355",
        "20348",
        "20012",
        "11361",
        "113"
      ]
    },
    {
      "hadith_no": "4289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، عن أبي أسيد الساعدي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار دور بني النجار ثم دور بني عبد الأشهل ثم بني الحارث بن الخزرج ثم بني ساعدة وفي كل دور الأنصار خير ‏\"‏ ‏.‏ فقال سعد ما أرى رسول الله صلى الله عليه وسلم إلا قد فضل علينا ‏.‏ فقيل قد فضلكم على كثير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو أسيد الساعدي اسمه مالك بن ربيعة ‏.‏ وقد روي نحو هذا عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ ورواه معمر عن الزهري عن أبي سلمة وعبيد الله بن عبد الله بن عتبة عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Usaid As-Sa'idi:                     that the Messenger of Allah (ﷺ) said: \"The Best houses of the Ansar are the houses of Banu An-Najjar, then the house of Banu 'Abdul-Ashhal, then Banu Al-Harith bin Al-Khazraj, then Banu Sa'idah. And in all of the houses of the Ansar there is good.\" So Sa'd said: \"I do not see except that the Prophet (ﷺ) has preferred everyone over us.\" So it was said: \"He preferred you over many.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "19",
        "113"
      ]
    },
    {
      "hadith_no": "2318",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا إسحاق بن إبراهيم بن سعيد، حدثني صفوان بن سليم، حدثني محمد، وعلي، ابنا الحسن بن أبي الحسن البراد أن الزبير بن المنذر بن أبي أسيد الساعدي، حدثهما أن أباه المنذر حدثه عن أبي أسيد، أن أبا أسيد، حدثه أن رسول الله  صلى الله عليه وسلم  ذهب إلى سوق النبيط فنظر إليه فقال ‏\"‏ ليس هذا لكم بسوق ‏\"‏ ‏.‏ ثم ذهب إلى سوق فنظر إليه فقال ‏\"‏ ليس هذا لكم بسوق ‏\"‏ ‏.‏ ثم رجع إلى هذا السوق فطاف فيه ثم قال ‏\"‏ هذا سوقكم فلا ينتقصن ولا يضربن عليه خراج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Usaid said that :                     the Messenger of Allah (ﷺ) went to the market of Nabit,[1] and looked at it, and said: \"This is not a market for you.\" Then we went to another market and looked at it, and said: \"This is not a market for you.\" Then he came back to this market and walked around in it then he said: \"This is your market. It will always be your market and no duty will be levied on it.\" (Do,if)",
      "chain": [
        "30308",
        "30123",
        "11177",
        "20278",
        "113"
      ]
    },
    {
      "hadith_no": "3711",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو إسحاق الهروي، إبراهيم بن عبد الله بن حاتم حدثنا عبد الله بن عثمان بن إسحاق بن سعد بن أبي وقاص، حدثني جدي أبو أمي، مالك بن حمزة بن أبي أسيد الساعدي عن أبيه، عن جده أبي أسيد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  للعباس بن عبد المطلب ودخل عليهم فقال ‏\"‏ السلام عليكم ‏\"‏ ‏.‏ قالوا وعليك السلام ورحمة الله وبركاته ‏.‏ قال ‏\"‏ كيف أصبحتم ‏\"‏ ‏.‏ قالوا بخير نحمد الله فكيف أصبحت بأبينا وأمنا يا رسول الله قال ‏\"‏ أصبحت بخير أحمد الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Usaid Sa'idi said:                     \"The Messenger of Allah(ﷺ) said to Abbas ibn Abdul Muttalib, when he entered upon them: \"Assalamu alaikum'. They said: 'Wa alaikas salamu wa ahmatullahi wa barakatuhu.' He said: 'How are you this morning?' They said: ' Well, praise is to Allah. And how are you this morning, may our fathers and mothers be ransomed for you, O Messenger of Allah?!' He said: 'I am well, praise is to Allah.'\"(Daif)",
      "chain": [
        "113"
      ]
    }
  ],
  "total_hadiths": 18
}