{
  "id": "11309",
  "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
  "full_name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Khurasan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Basri",
      "Khurasan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3240",
      "name": "'Aidh bin 'Amr al-Mazni ( عائذ بن عمرو المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11680",
      "name": "Jwyryh bin Qdamh جويرية بن قدامة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11589",
      "name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20552",
      "name": "al-S'q bin Hzn الصعق بن حزن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20718",
      "name": "'Imran bin Da'ud al-'Ami Abu al-'Awwam عمران بن داود العمي أبو العوام القطان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "53",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن الجعد، قال أخبرنا شعبة، عن أبي جمرة، قال كنت أقعد مع ابن عباس، يجلسني على سريره فقال أقم عندي حتى أجعل لك سهما من مالي، فأقمت معه شهرين، ثم قال إن وفد عبد القيس لما أتوا النبي صلى الله عليه وسلم قال ‏\"‏ من القوم أو من الوفد ‏\"‏‏.‏ قالوا ربيعة‏.‏ قال ‏\"‏ مرحبا بالقوم  أو بالوفد  غير خزايا ولا ندامى ‏\"‏‏.‏ فقالوا يا رسول الله، إنا لا نستطيع أن نأتيك إلا في شهر الحرام، وبيننا وبينك هذا الحى من كفار مضر، فمرنا بأمر فصل، نخبر به من وراءنا، وندخل به الجنة‏.‏ وسألوه عن الأشربة‏.‏ فأمرهم بأربع، ونهاهم عن أربع، أمرهم بالإيمان بالله وحده‏.‏ قال ‏\"‏ أتدرون ما الإيمان بالله وحده ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصيام رمضان، وأن تعطوا من المغنم الخمس ‏\"‏‏.‏ ونهاهم عن أربع عن الحنتم والدباء والنقير والمزفت‏.‏ وربما قال المقير‏.‏ وقال ‏\"‏ احفظوهن وأخبروا بهن من وراءكم ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Jamra:                          I used to sit with Ibn 'Abbas and he made me sit on his sitting place.     He requested me to stay with him in order that he might give me a      share from his property. So I stayed with him for two months. Once he      told (me) that when the delegation of the tribe of 'Abdul Qais came to     the Prophet, the Prophet asked them, \"Who are the people (i.e. you)?      (Or) who are the delegate?\" They replied, \"We are from the tribe of      Rabi'a.\" Then the Prophet said to them, \"Welcome! O people (or O      delegation of 'Abdul Qais)! Neither will you have disgrace nor will      you regret.\" They said, \"O Allah's Apostle! We cannot come to you      except in the sacred month and there is the infidel tribe of Mudar      intervening between you and us. So please order us to do something      good (religious deeds) so that we may inform our people whom we have      left behind (at home), and that we may enter Paradise (by acting on      them).\" Then they asked about drinks (what is legal and what is      illegal). The Prophet ordered them to do four things and forbade them      from four things. He ordered them to believe in Allah Alone and asked      them, \"Do you know what is meant by believing in Allah Alone?\" They      replied, \"Allah and His Apostle know better.\" Thereupon the Prophet      said, \"It means:     1. To testify that none has the right to be worshipped but Allah and      Muhammad is Allah's Apostle.      2. To offer prayers perfectly     3. To pay the Zakat (obligatory charity)      4. To observe fast during the month of Ramadan.     5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's     Cause).     Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann      Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic     drinks were prepared) (The Prophet mentioned the container of wine and     he meant the wine itself). The Prophet further said (to them):      \"Memorize them (these instructions) and convey them to the people whom     you have left behind.\"",
      "chain": [
        "20386",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "87",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي جمرة، قال كنت أترجم بين ابن عباس وبين الناس فقال إن وفد عبد القيس أتوا النبي صلى الله عليه وسلم فقال ‏\"‏ من الوفد  أو من القوم ‏\"‏‏.‏ قالوا ربيعة‏.‏ فقال ‏\"‏ مرحبا بالقوم  أو بالوفد  غير خزايا ولا ندامى ‏\"‏‏.‏ قالوا إنا نأتيك من شقة بعيدة، وبيننا وبينك هذا الحى من كفار مضر، ولا نستطيع أن نأتيك إلا في شهر حرام فمرنا بأمر نخبر به من وراءنا، ندخل به الجنة‏.‏ فأمرهم بأربع، ونهاهم عن أربع أمرهم بالإيمان بالله عز وجل وحده‏.‏ قال ‏\"‏ هل تدرون ما الإيمان بالله وحده ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وتعطوا الخمس من المغنم ‏\"‏‏.‏ ونهاهم عن الدباء والحنتم والمزفت‏.‏ قال شعبة ربما قال النقير، وربما قال المقير‏.‏ قال ‏\"‏ احفظوه وأخبروه من وراءكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the tribe of `Abdul Qais came to the Prophet who asked them, \"Who are the people (i.e. you)? (Or) who are the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet said to them, \"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor will you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the infidels of Mudar intervening between you and us and we cannot come to you except in the sacred month. So please order us to do something good (religious deeds) and that we may also inform our people whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The Prophet ordered them to do four things, and forbade them from four things. He ordered them to believe in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet said, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, (and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them four things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the names of pots in which alcoholic drinks used to be prepared). The Prophet further said, \"Memorize them (these instructions) and tell them to the people whom you have left behind.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "523",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا عباد  هو ابن عباد  عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إنا من هذا الحى من ربيعة، ولسنا نصل إليك إلا في الشهر الحرام، فمرنا بشىء نأخذه عنك، وندعو إليه من وراءنا‏.‏ فقال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع الإيمان بالله  ثم فسرها لهم شهادة أن لا إله إلا الله، وأني رسول الله، وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا إلى خمس ما غنمتم، وأنهى عن الدباء والحنتم والمقير والنقير ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"Once a delegation of `Abdul Qais came to Allah's Apostle and said, \"We belong to such and such branch of the tribe of Rab'a [??] and we can only come to you in the sacred months. Order us to do something good so that we may (carry out) take it from you and also invite to it our people whom we have left behind (at home).\" The Prophet said, \" I order you to do four things and forbid you from four things. (The first four are as follows): -1. To believe in Allah. (And then he: explained it to them i.e.) to testify that none has the right to be worshipped but Allah and (Muhammad) am Allah's Apostle -2. To offer prayers perfectly (at the stated times): -3. To pay Zakat (obligatory charity) -4. To give me Khumus (The other four things which are forbidden are as follows): -1. Dubba -2. Hantam -3. Muqaiyat [??] -4. Naqir (all these are utensils used for the preparation of alcoholic drinks).",
      "chain": [
        "30367",
        "20243",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "574",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هدبة بن خالد، قال حدثنا همام، حدثني أبو جمرة، عن أبي بكر بن أبي موسى، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى البردين دخل الجنة ‏\"‏‏.‏ وقال ابن رجاء حدثنا همام عن أبي جمرة أن أبا بكر بن عبد الله بن قيس أخبره بهذا‏.‏ حدثنا إسحاق، عن حبان، حدثنا همام، حدثنا أبو جمرة، عن أبي بكر بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Abu Bakr bin Abi Musa:                     My father said, \"Allah's Apostle said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to Paradise.' \"",
      "chain": [
        "20294",
        "20297",
        "11309",
        "11900",
        "41"
      ]
    },
    {
      "hadith_no": "892",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عامر العقدي، قال حدثنا إبراهيم بن طهمان، عن أبي جمرة الضبعي، عن ابن عباس، أنه قال إن أول جمعة جمعت بعد جمعة في مسجد رسول الله صلى الله عليه وسلم في مسجد عبد القيس بجواثى من البحرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first Jumua prayer which was offered after a Jumua prayer offered at the mosque of Allah's Apostle took place in the mosque of the tribe of `Abdul Qais at Jawathi in Bahrain.",
      "chain": [
        "30170",
        "20443",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1138",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، قال حدثني أبو جمرة، عن ابن عباس  رضى الله عنهما  قال كان صلاة النبي صلى الله عليه وسلم ثلاث عشرة ركعة‏.‏ يعني بالليل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The prayer of the Prophet used to be of thirteen rak`at, i.e. of the night prayer.",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1418",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج، حدثنا حماد بن زيد، حدثنا أبو جمرة، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم وفد عبد القيس على النبي صلى الله عليه وسلم فقالوا يا رسول الله إن هذا الحى من ربيعة قد حالت بيننا وبينك كفار مضر، ولسنا نخلص إليك إلا في الشهر الحرام، فمرنا بشىء نأخذه عنك، وندعو إليه من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع الإيمان بالله وشهادة أن لا إله إلا الله  وعقد بيده هكذا  وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا خمس ما غنمتم، وأنهاكم عن الدباء والحنتم والنقير والمزفت ‏\"‏‏.‏ وقال سليمان وأبو النعمان عن حماد ‏\"‏ الإيمان بالله شهادة أن لا إله إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A delegation of the tribe of `Abdul Qais came to the Prophet and said, \"O Allah's Apostle! We are from the tribe of Rabi`a, and the infidels of the tribe of Mudar stands between us and you; so we cannot come to you except during the Sacred Months. Please order us to do something (religious deeds) which we may carry out and also invite to it our people whom we have left behind.\" The Prophet said, \"I order you to do four things and forbid you four others: (I order you) to have faith in Allah, and confess that none has the right to be worshipped but Allah, (and the Prophet gestured with his hand like this (i.e. one knot) and to offer prayers perfectly and to pay the Zakat, and to pay onefifth of the booty in Allah's Cause. And I forbid you to use Dubba', Hantam, Naqir and Muzaffat (all these are the names of utensils used for preparing alcoholic drinks).\"",
      "chain": [
        "20219",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1713",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا النضر، أخبرنا شعبة، حدثنا أبو جمرة، قال سألت ابن عباس  رضى الله عنهما  عن المتعة، فأمرني بها، وسألته عن الهدى، فقال فيها جزور أو بقرة أو شاة أو شرك في دم قال وكأن ناسا كرهوها، فنمت فرأيت في المنام كأن إنسانا ينادي حج مبرور، ومتعة متقبلة‏.‏ فأتيت ابن عباس  رضى الله عنهما  فحدثته فقال الله أكبر سنة أبي القاسم صلى الله عليه وسلم قال وقال آدم ووهب بن جرير وغندر عن شعبة عمرة متقبلة، وحج مبرور‏.‏",
      "text_en": " Narrated Abu Jamra:                     I asked Ibn `Abbas about Hajj-at-Tamattu`. He ordered me to perform it. I asked him about the Hadi (sacrifice). He said, \"You have to slaughter a camel, a cow or a sheep, or you may share the Hadi with the others.\" It seemed that some people disliked it (Hajj-at-Tamattu`). I slept and dreamt as if a person was announcing: \"Hajj Mabrur and accepted Mut'ah (Hajj-at-Tamattu`)\" I went to Ibn `Abbas and narrated it to him. He said, \"Allah is Greater. (That was) the tradition of Abu Al-Qasim (i.e. Prophet). Narrated Shu`ba that the call in the dream was. \"An accepted `Umra and Hajj-Mabrur. \"",
      "chain": [
        "30313",
        "20291",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2651",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا أبو جمرة، قال سمعت زهدم بن مضرب، قال سمعت عمران بن حصين  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ‏\"‏‏.‏ قال عمران لا أدري أذكر النبي صلى الله عليه وسلم بعد قرنين أو ثلاثة‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إن بعدكم قوما يخونون ولا يؤتمنون، ويشهدون، ولا يستشهدون وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudrab:                     I heard `Imran bin Husain saying, \"The Prophet said, 'The best people are those living in my generation, then those coming after them, and then those coming after (the second generation).\" `Imran said \"I do not know whether the Prophet mentioned two or three generations after your present generation. The Prophet added, 'There will be some people after you, who will be dishonest and will not be trustworthy and will give witness (evidences) without being asked to give witness, and will vow but will not fulfill their vows, and fatness will appear among them.\"",
      "chain": [
        "20404",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "3095",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أبي حمزة الضبعي، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم وفد عبد القيس فقالوا يا رسول الله، إنا هذا الحى من ربيعة، بيننا وبينك كفار مضر، فلسنا نصل إليك إلا في الشهر الحرام، فمرنا بأمر نأخذ منه وندعو إليه من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله شهادة أن لا إله إلا الله  وعقد بيده  وإقام الصلاة وإيتاء الزكاة وصيام رمضان، وأن تؤدوا لله خمس ما غنمتم، وأنهاكم عن الدباء والنقير والحنتم والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The delegates of the tribe of `Abdul-Qais came and said, \"O Allah's Apostle! We are from the tribe of Rabi`a, and there is the infidels of the tribe of Mudar intervening between you and us, so we cannot come to you except in the Sacred Months. So please order us some instructions that we may apply it to ourselves and also invite our people whom we left behind us to observe as well.\" The Prophet said, \"I order you (to do) four (things) and forbid you (to do) four: I order you to believe in Allah, that is, to testify that None has the right to be worshipped but Allah (the Prophet pointed with his hand); to offer prayers perfectly; to pay Zakat; to fast the month of Ramadan, and to pay the Khumus (i.e. one-fifth) of the war booty to Allah and I forbid you to use Ad-dubba', An-Naqir, Al-Hantam and Al-Muzaffat (i.e. utensils used for preparing alcoholic drinks).\" (See Hadith No. 50, Vol. 1).",
      "chain": [
        "20283",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا أبو جمرة، قال سمعت جويرية بن قدامة التميمي، قال سمعت عمر بن الخطاب  رضى الله عنه  قلنا أوصنا يا أمير المؤمنين‏.‏ قال أوصيكم بذمة الله، فإنه ذمة نبيكم، ورزق عيالكم‏.‏",
      "text_en": " Narrated Juwairiya bin Qudama at-Tamimi:                     We said to `Umar bin Al-Khattab, Jo Chief of the believers! Advise us.\" He said, \"I advise you to fulfill Allah's Convention (made with the Dhimmis) as it is the convention of your Prophet and the source of the livelihood of your dependents (i.e. the taxes from the Dhimmis.) \"",
      "chain": [
        "20404",
        "20020",
        "11309",
        "11680",
        "3"
      ]
    },
    {
      "hadith_no": "3261",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا همام، عن أبي جمرة الضبعي، قال كنت أجالس ابن عباس بمكة، فأخذتني الحمى، فقال أبردها عنك بماء زمزم، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ الحمى من فيح جهنم فأبردوها بالماء ‏\"‏‏.‏ أو قال ‏\"‏ بماء زمزم ‏\"‏‏.‏ شك همام‏.‏",
      "text_en": " Narrated Abu Jamra Ad-Dabi:                     I used to sit with Ibn `Abbas in Mecca. Once I had a fever and he said (to me), \"Cool your fever with Zamzam water, for Allah's Apostle said: 'It, (the Fever) is from the heat of the (Hell) Fire; so, cool it with water (or Zamzam water).",
      "chain": [
        "30351",
        "20443",
        "20297",
        "11309"
      ]
    },
    {
      "hadith_no": "3550",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن أبي جمرة، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنا من هذا الحى من ربيعة قد حالت بيننا وبينك كفار مضر، فلسنا نخلص إليك إلا في كل شهر حرام، فلو أمرتنا بأمر، نأخذه عنك، ونبلغه من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة وإيتاء الزكاة، وأن تؤدوا إلى الله خمس ما غنمتم، وأنهاكم عن الدباء، والحنتم، والنقير، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The delegates of `Abd-ul-Qais came to Allah's Apostle and said, \"O Allah's Apostle! We are from the tribe of Rabi`a and the infidels of Mudar tribe stand between us and you, so that we cannot come to you except in the Sacred Months. Therefore we would like you to give us some instructions which we may follow and convey to our people staying behind us.\" The Prophet said, \"I order you to observe four things and forbid you (to do) four things: (I order you) to believe in Allah testifying that None has the right to be worshipped except Allah; to offer the prayer perfectly; to pay the Zakat; and to give one-fifth of the war booty to Allah. And I forbid you to use Ad-Dubba, Al-Hantam, An-Naqir and Al- Muzaffat.\" (These are names of utensils in which alcoholic drinks were served.)",
      "chain": [
        "30175",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا زيد  هو ابن أخزم  قال أبو قتيبة سلم بن قتيبة حدثني مثنى بن سعيد القصير، قال حدثني أبو جمرة، قال لنا ابن عباس ألا أخبركم بإسلام أبي ذر، قال قلنا بلى‏.‏ قال قال أبو ذر كنت رجلا من غفار، فبلغنا أن رجلا قد خرج بمكة، يزعم أنه نبي، فقلت لأخي انطلق إلى هذا الرجل كلمه وأتني بخبره‏.‏ فانطلق فلقيه، ثم رجع فقلت ما عندك فقال والله لقد رأيت رجلا يأمر بالخير وينهى عن الشر‏.‏ فقلت له لم تشفني من الخبر‏.‏ فأخذت جرابا وعصا، ثم أقبلت إلى مكة فجعلت لا أعرفه، وأكره أن أسأل عنه، وأشرب من ماء زمزم وأكون في المسجد‏.‏ قال فمر بي علي فقال كأن الرجل غريب‏.‏ قال قلت نعم‏.‏ قال فانطلق إلى المنزل‏.‏ قال فانطلقت معه لا يسألني عن شىء، ولا أخبره، فلما أصبحت غدوت إلى المسجد لأسأل عنه، وليس أحد يخبرني عنه بشىء‏.‏ قال فمر بي علي فقال أما نال للرجل يعرف منزله بعد قال قلت لا‏.‏ قال انطلق معي‏.‏ قال فقال ما أمرك وما أقدمك هذه البلدة قال قلت له إن كتمت على أخبرتك‏.‏ قال فإني أفعل‏.‏ قال قلت له بلغنا أنه قد خرج ها هنا رجل يزعم أنه نبي، فأرسلت أخي ليكلمه فرجع ولم يشفني من الخبر، فأردت أن ألقاه‏.‏ فقال له أما إنك قد رشدت، هذا وجهي إليه، فاتبعني، ادخل حيث أدخل، فإني إن رأيت أحدا أخافه عليك، قمت إلى الحائط، كأني أصلح نعلي، وامض أنت، فمضى ومضيت معه، حتى دخل ودخلت معه على النبي صلى الله عليه وسلم فقلت له اعرض على الإسلام‏.‏ فعرضه فأسلمت مكاني، فقال لي ‏\"‏ يا أبا ذر اكتم هذا الأمر، وارجع إلى بلدك، فإذا بلغك ظهورنا فأقبل ‏\"‏‏.‏ فقلت والذي بعثك بالحق لأصرخن بها بين أظهرهم‏.‏ فجاء إلى المسجد، وقريش فيه فقال يا معشر قريش، إني أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله‏.‏ فقالوا قوموا إلى هذا الصابئ‏.‏ فقاموا فضربت لأموت فأدركني العباس، فأكب على ثم أقبل عليهم، فقال ويلكم تقتلون رجلا من غفار، ومتجركم وممركم على غفار‏.‏ فأقلعوا عني، فلما أن أصبحت الغد رجعت فقلت مثل ما قلت بالأمس، فقالوا قوموا إلى هذا الصابئ‏.‏ فصنع ‏{‏بي‏}‏ مثل ما صنع بالأمس وأدركني العباس فأكب على، وقال مثل مقالته بالأمس‏.‏ قال فكان هذا أول إسلام أبي ذر رحمه الله‏.‏",
      "text_en": " Narrated Abu Jamra:                     Ibn `Abbas said to us, \"Shall I tell you the story of Abu Dhar's conversion to Islam?\" We said, \"Yes.\" He said, \"Abu Dhar said: I was a man from the tribe of Ghifar. We heard that a man had appeared in Mecca, claiming to be a Prophet. ! said to my brother, 'Go to that man and talk to him and bring me his news.' He set out, met him and returned. I asked him, 'What is the news with you?' He said, 'By Allah, I saw a man enjoining what is good and forbidding what is evil.' I said to him, 'You have not satisfied me with this little information.' So, I took a waterskin and a stick and proceeded towards Mecca. Neither did I know him (i.e. the Prophet ), nor did I like to ask anyone about him. I Kept on drinking Zam zam water and staying in the Mosque. Then `Ali passed by me and said, 'It seems you are a stranger?' I said, 'Yes.' He proceeded to his house and I accompanied him. Neither did he ask me anything, nor did I tell him anything. Next morning I went to the Mosque to ask about the Prophet but no-one told me anything about him. `Ali passed by me again and asked, 'Hasn't the man recognized his dwelling place yet' I said, 'No.' He said, 'Come along with me.' He asked me, 'What is your business? What has brought you to this town?' I said to him, 'If you keep my secret, I will tell you.' He said, 'I will do,' I said to him, 'We have heard that a person has appeared here, claiming to be a Prophet. I sent my brother to speak to him and when he returned, he did not bring a satisfactory report; so I thought of meeting him personally.' `Ali said (to Abu Dhar), 'You have reached your goal; I am going to him just now, so follow me, and wherever I enter, enter after me. If I should see someone who may cause you trouble, I will stand near a wall pretending to mend my shoes (as a warning), and you should go away then.' `Ali proceeded and I accompanied him till he entered a place, and I entered with him to the Prophet to whom I said, 'Present (the principles of) Islam to me.' When he did, I embraced Islam 'immediately. He said to me, 'O Abu Dhar! Keep your conversion as a secret and return to your town; and when you hear of our victory, return to us. ' I said, 'By H him Who has sent you with the Truth, I will announce my conversion to Islam publicly amongst them (i.e. the infidels),' Abu Dhar went to the Mosque, where some people from Quraish were present, and said, 'O folk of Quraish ! I testify that None has the right to be worshipped except Allah, and I (also) testify that Muhammad is Allah's Slave and His Apostle.' (Hearing that) the Quraishi men said, 'Get at this Sabi (i.e. Muslim) !' They got up and beat me nearly to death. Al `Abbas saw me and threw himself over me to protect me. He then faced them and said, 'Woe to you! You want to kill a man from the tribe of Ghifar, although your trade and your communications are through the territory of Ghifar?' They therefore left me. The next morning I returned (to the Mosque) and said the same as I have said on the previous day. They again said, 'Get at this Sabi!' I was treated in the same way as on the previous day, and again Al-Abbas found me and threw himself over me to protect me and told them the same as he had said the day before.' So, that was the conversion of Abu Dhar (may Allah be Merciful to him) to Islam.\"",
      "chain": [
        "30136",
        "20233",
        "11309"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إسحاق، حدثنا النضر، أخبرنا شعبة، عن أبي جمرة، سمعت زهدم بن مضرب، سمعت عمران بن حصين  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي قرني ثم الذين يلونهم ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فلا أدري أذكر بعد قرنه قرنين أو ثلاثا ‏\"‏ ثم إن بعدكم قوما يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     \"Allah's Apostle said, 'The best of my followers are those living in my generation (i.e. my contemporaries). and then those who will follow the latter\" `Imran added, \"I do not remember whether he mentioned two or three generations after his generation, then the Prophet added, 'There will come after you, people who will bear witness without being asked to do so, and will be treacherous and untrustworthy, and they will vow and never fulfill their vows, and fatness will appear among them.\"",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن بن مهدي، حدثنا المثنى، عن أبي جمرة، عن ابن عباس  رضى الله عنهما  قال لما بلغ أبا ذر مبعث النبي صلى الله عليه وسلم قال لأخيه اركب إلى هذا الوادي، فاعلم لي علم هذا الرجل الذي يزعم أنه نبي، يأتيه الخبر من السماء، واسمع من قوله، ثم ائتني‏.‏ فانطلق الأخ حتى قدمه وسمع من قوله، ثم رجع إلى أبي ذر، فقال له رأيته يأمر بمكارم الأخلاق، وكلاما ما هو بالشعر‏.‏ فقال ما شفيتني مما أردت، فتزود وحمل شنة له فيها ماء حتى قدم مكة، فأتى المسجد، فالتمس النبي صلى الله عليه وسلم ولا يعرفه، وكره أن يسأل عنه حتى أدركه بعض الليل، فرآه علي فعرف أنه غريب‏.‏ فلما رآه تبعه، فلم يسأل واحد منهما صاحبه عن شىء حتى أصبح، ثم احتمل قربته وزاده إلى المسجد، وظل ذلك اليوم ولا يراه النبي صلى الله عليه وسلم حتى أمسى، فعاد إلى مضجعه، فمر به علي فقال أما نال للرجل أن يعلم منزله فأقامه، فذهب به معه لا يسأل واحد منهما صاحبه عن شىء، حتى إذا كان يوم الثالث، فعاد علي مثل ذلك، فأقام معه ثم قال ألا تحدثني ما الذي أقدمك قال إن أعطيتني عهدا وميثاقا لترشدنني فعلت ففعل فأخبره‏.‏ قال فإنه حق وهو رسول الله صلى الله عليه وسلم، فإذا أصبحت فاتبعني، فإني إن رأيت شيئا أخاف عليك قمت كأني أريق الماء، فإن مضيت فاتبعني حتى تدخل مدخلي‏.‏ ففعل، فانطلق يقفوه حتى دخل على النبي صلى الله عليه وسلم ودخل معه، فسمع من قوله، وأسلم مكانه فقال له النبي صلى الله عليه وسلم ‏\"‏ ارجع إلى قومك، فأخبرهم حتى يأتيك أمري ‏\"‏‏.‏ قال والذي نفسي بيده لأصرخن بها بين ظهرانيهم، فخرج حتى أتى المسجد فنادى بأعلى صوته أشهد أن لا إله إلا الله، وأن محمدا رسول الله‏.‏ ثم قام القوم فضربوه حتى أضجعوه، وأتى العباس فأكب عليه قال ويلكم ألستم تعلمون أنه من غفار وأن طريق تجاركم إلى الشأم فأنقذه منهم، ثم عاد من الغد لمثلها، فضربوه وثاروا إليه، فأكب العباس عليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abu Dhar received the news of the Advent of the Prophet he said to his brother, \"Ride to this valley (of Mecca) and try to find out the truth of the person who claims to be a prophet who is informed of the news of Heaven. Listen to what he says and come back to me.\" So his brother set out and came to the Prophet and listened to some of his talks, and returned to Abu Dhar and said to him. \"I have seen him enjoining virtuous behavior and saying something that is not poetry.\" Abu Dhar said, \"You have not satisfied me as to what I wanted.\" He then took his journey-food and carried a waterskin of his, containing some water till be reached Mecca. He went to the Mosque and searched for the Prophet and though he did not know him, he hated to ask anybody about him. When a part of the night had passed away, `Ali saw him and knew that he was a stranger. So when Abu Dhar saw `Ali, he followed him, and none of them asked his companion about anything, and when it was dawn, Abu Dhar took his journey food and his water-skin to the Mosque and stayed there all the day long without being perceived by the Prophet, and when it was evening, he came back to his retiring place. `Ali passed by him and said, \"Has the man not known his dwelling place yet?\" So `Ali awakened him and took him with him and none of them spoke to the other about anything. When it was the third day. `Ali did the same and Abu Dhar stayed with him. Then `Ali said \"Will you tell me what has brought you here?\" Abu Dhar said, \"If you give me a firm promise that you will guide me, then I will tell you.\" `Ali promised him, and he informed `Ali about the matter. `Ali said, \"It is true, and he is the Apostle of Allah. Next morning when you get up, accompany me, and if I see any danger for you, I will stop as if to pass water, but if I go on, follow me and enter the place which I will enter.\" Abu Dhar did so, and followed `Ali till he entered the place of the Prophet, and Abu Dhar went in with him, Abu Dhar listened to some of the Prophet's talks and embraced Islam on the spot. The Prophet said to him, \"Go back to your people and inform them (about it) till you receive my order.\" Abu Dhar said, \"By Him in Whose Hand my life is, I will proclaim my conversion loudly amongst them (i.e. the pagans).\" So he went out, and when he reached the Mosque, he said as loudly as possible, \"I bear witness that None has the right to be worshipped except Allah, and Muhammad is the Apostle of Allah.\" The People got up and beat him painfully. Then Al-Abbas came and knelt over him ((to protect him) and said (to the people), \"Woe to you! Don't you know that this man belongs to the tribe of Ghifar and your trade to Sha'm is through their way?\" So he rescued him from them. Abu Dhar again did the same the next day. They beat him and took vengeance on him and again Al-Abbas knelt over him (to protect him).",
      "chain": [
        "30152",
        "20033",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا شاذان، عن شعبة، عن أبي جمرة، قال سألت عائذ بن عمرو  رضى الله عنه  وكان من أصحاب النبي صلى الله عليه وسلم من أصحاب الشجرة هل ينقض الوتر قال إذا أوترت من أوله، فلا توتر من آخره‏.‏",
      "text_en": " Narrated Abu Jamra:                     I asked Aidh bin `Amr, who was one of the companions of the Prophet one of those (who gave the allegiance to the Prophet the Tree: \"Can the witr prayer be repeated (in one night)?\" He said, \"If you have offered it in the first part of the night, you should not repeat it in the last part 'of the night.\" (See Fath-ul-Bari page 458 Vol 8th).",
      "chain": [
        "30163",
        "20380",
        "20020",
        "11309",
        "3240"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا أبو عامر العقدي، حدثنا قرة، عن أبي جمرة، قلت لابن عباس  رضى الله عنهما  إن لي جرة ينتبذ لي نبيذ، فأشربه حلوا في جر إن أكثرت منه، فجالست القوم، فأطلت الجلوس خشيت أن أفتضح فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقال ‏\"‏ مرحبا بالقوم غير خزايا ولا الندامى ‏\"‏‏.‏ فقالوا يا رسول الله، إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر الحرم، حدثنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو به من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع، الإيمان بالله، هل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة وصوم رمضان، وأن تعطوا من المغانم الخمس، وأنهاكم عن أربع ما انتبذ في الدباء، والنقير، والحنتم، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I said to Ibn `Abbas, \"I have an earthenware pot containing Nabidh (i.e. water and dates or grapes) for me, and I drink of it while it is sweet. If I drink much of it and stay with the people for a long time, I get afraid that they may discover it (for I will appear as if I were drunk). Ibn `Abbas said, \"A delegation of `Abdul Qais came to Allah's Apostle and he said, \"Welcome, O people! Neither will you have disgrace nor will you regret.\" They said, \"O Allah's Apostle! There are the Mudar pagans between you and us, so we cannot come to you except in the sacred Months. So please teach us some orders on acting upon which we will enter Paradise. Besides, we will preach that to our people who are behind us.\" The Prophet said, \"I order you to do four things and forbid you from four things (I order you): To believe in Allah...Do you know what is to believe in Allah? That is to testify that None has the right to be worshipped except Allah: (I order you also to offer prayers perfectly to pay Zakat; and to fast the month of Ramadan and to give the Khumus (i.e. one-fifth of the booty) (for Allah's Sake). I forbid you from four other things (i.e. the wine that is prepared in) Ad-Dubba, An-Naquir, Az-Hantam and Al-Muzaffat. (See Hadith No. 50 Vol. 1)",
      "chain": [
        "30021",
        "20443",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4412",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، يقول قدم وفد عبد القيس على النبي صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة، وقد حالت بيننا وبينك كفار مضر، فلسنا نخلص إليك إلا في شهر حرام، فمرنا بأشياء نأخذ بها وندعو إليها من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع، الإيمان بالله شهادة أن لا إله إلا الله  وعقد واحدة  وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا لله خمس ما غنمتم، وأنهاكم عن الدباء، والنقير والحنتم والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The delegation of `Abdul Qais came to the Prophet and said, \"O Allah's Apostle We belong to the tribe of Rabi`a. The infidels of Mudar tribe intervened between us and you so that we cannot come to you except in the Sacred Months, so please order us some things we may act on and invite those left behind to act on. The Prophet said, \"I order you to observe four things and forbid you from four things: (I order you) to believe in Allah, i.e. to testify that None has the right to be worshipped except Allah.\" The Prophet pointed with finger indicating one and added, \"To offer prayers perfectly: to give Zakat, and to give one-fifth of the booty you win (for Allah's Sake). I forbid you to use Ad-Dubba', An-Naquir, Al-Hantam and Al-Muzaffat, (Utensils used for preparing alcoholic liquors and drinks).",
      "chain": [
        "20193",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4414",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا أبو عامر عبد الملك، حدثنا إبراهيم  هو ابن طهمان  عن أبي جمرة، عن ابن عباس، رضى الله عنهما قال أول جمعة جمعت بعد جمعة جمعت في مسجد رسول الله صلى الله عليه وسلم في مسجد عبد القيس بجواثى‏.‏ يعني قرية من البحرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first Friday (i.e. Jumua) prayer offered after the Friday Prayer offered at the Mosque of Allah's Apostle was offered at the mosque of `Abdul Qais situated at Jawathi, that is a village at Al Bahrain .",
      "chain": [
        "30351",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "5172",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي جمرة، قال سمعت ابن عباس، سئل عن متعة النساء، فرخص فقال له مولى له إنما ذلك في الحال الشديد وفي النساء قلة أو نحوه‏.‏ فقال ابن عباس نعم‏.‏",
      "text_en": " Narrated Abu Jamra:                     I heard Ibn `Abbas (giving a verdict) when he was asked about the Mut'a with the women, and he permitted it (Nikah-al-Mut'a). On that a freed slave of his said to him, \"That is only when it is very badly needed and women are scarce.\" On that, Ibn `Abbas said, \"Yes.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "6246",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا أبو التياح، عن أبي جمرة، عن ابن عباس  رضى الله عنهما  قال لما قدم وفد عبد القيس على النبي صلى الله عليه وسلم قال ‏\"‏ مرحبا بالوفد الذين جاءوا غير خزايا ولا ندامى ‏\"‏‏.‏ فقالوا يا رسول الله إنا حى من ربيعة وبيننا وبينك مضر، وإنا لا نصل إليك إلا في الشهر الحرام، فمرنا بأمر فصل ندخل به الجنة، وندعو به من وراءنا‏.‏ فقال ‏\"‏ أربع وأربع أقيموا الصلاة، وآتوا الزكاة، وصوم رمضان، وأعطوا خمس ما غنمتم، ولا تشربوا في الدباء، والحنتم، والنقير، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the delegation of `Abdul Qais came to the Prophet, he said, \"Welcome, O the delegation who have come! Neither you will have disgrace, nor you will regret.\" They said, \"O Allah's Apostle! We are a group from the tribe of Ar-Rabi`a, and between you and us there is the tribe of Mudar and we cannot come to you except in the sacred months. So please order us to do something good (religious deeds) so that we may enter Paradise by doing that, and also that we may order our people who are behind us (whom we have left behind at home) to follow it.\" He said, \"Four and four:\" offer prayers perfectly , pay the Zakat, (obligatory charity), fast the month of Ramadan, and give one-fifth of the war booty (in Allah's cause), and do not drink in (containers called) Ad-Duba,' Al-Hantam, An-Naqir and Al-Muzaffat.\"",
      "chain": [
        "30156",
        "20258",
        "11317",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "6504",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت أبا جمرة، قال حدثني زهدم بن مضرب، قال سمعت عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فما أدري قال النبي صلى الله عليه وسلم بعد قوله مرتين أو ثلاثا ‏\"‏ ثم يكون بعدهم قوم يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudarrib:                     `Imran bin Husain said: The Prophet said, \"The best people are my contemporaries (i.e., the present (my) generation) and then those who come after them (i.e., the next generation).\" `Imran added: I am not sure whether the Prophet repeated the statement twice after his first saying. The Prophet added, \"And after them there will come people who will bear witness, though they will not be asked to give their witness; and they will be treacherous and nobody will trust them, and they will make vows, but will not fulfill them, and fatness will appear among them.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "6778",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا مسدد، عن يحيى، عن شعبة، قال حدثني أبو جمرة، حدثنا زهدم بن مضرب، قال سمعت عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم  قال عمران لا أدري ذكر ثنتين أو ثلاثا بعد قرنه  ثم يجيء قوم ينذرون ولا يفون، ويخونون ولا يؤتمنون، ويشهدون ولا يستشهدون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudarrab:                     `Imran bin Hussain said, \"The Prophet said, 'The best of you (people) are my generation, and the second best will be those who will follow them, and then those who will follow the second generation.\" `Imran added, \"I do not remember whether he mentioned two or three (generations) after his generation. He added, 'Then will come some people who will make vows but will not fulfill them; and they will be dishonest and will not be trustworthy, and they will give their witness without being asked to give their witness, and fatness will appear among them.' \"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "7352",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة،‏.‏ وحدثني إسحاق، أخبرنا النضر، أخبرنا شعبة، عن أبي جمرة، قال كان ابن عباس يقعدني على سريره فقال إن وفد عبد القيس لما أتوا رسول الله صلى الله عليه وسلم قال ‏\"‏ من الوفد ‏\"‏‏.‏ قالوا ربيعة‏.‏ قال ‏\"‏ مرحبا بالوفد والقوم، غير خزايا ولا ندامى ‏\"‏‏.‏ قالوا يا رسول الله إن بيننا وبينك كفار مضر، فمرنا بأمر ندخل به الجنة، ونخبر به من وراءنا فسألوا عن الأشربة، فنهاهم عن أربع وأمرهم بأربع أمرهم بالإيمان بالله قال ‏\"‏ هل تدرون ما الإيمان بالله ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وحده لا شريك له وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة  وأظن فيه  صيام رمضان، وتؤتوا من المغانم الخمس ‏\"‏‏.‏ ونهاهم عن الدباء، والحنتم، والمزفت، والنقير، وربما قال المقير‏.‏ قال ‏\"‏ احفظوهن، وأبلغوهن من وراءكم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the delegate of `Abd Al-Qais came to Allah's Apostle, he said, \"Who are the delegate?\" They said, \"The delegate are from the tribe of Rabi`a.\" The Prophet said, \"Welcome, O the delegate, and welcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's Apostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do something good (religious deeds) that by acting on them we may enter Paradise, and that we may inform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. He forbade them from four things and ordered them to do four things. He ordered them to believe in Allah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His Apostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the One, Who has no partners with Him, and that Muhammad is Allah's Apostle; and to offer prayers perfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give one-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 Hantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet said, \"Remember all these things by heart and preach it to those whom you have left behind.\"",
      "chain": [
        "20386",
        "30312",
        "20291",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "7651",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا قرة بن خالد، حدثنا أبو جمرة الضبعي، قلت لابن عباس فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر حرم، فمرنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو إليها من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع، آمركم بالإيمان بالله، وهل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة، وتعطوا من المغنم الخمس، وأنهاكم عن أربع لا تشربوا في الدباء، والنقير، والظروف المزفتة، والحنتمة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The delegates of `Abdul Qais came to Allah's Apostle and said, \"The pagans of the tribe of Mudar intervene between you and us therefore we cannot come to you except in the Holy months. So please order us to do something good (Religious deeds) by which we may enter Paradise (by acting on them) and we may inform our people whom we have left behind to observe it.\" The Prophet said, \"I order you to do four things and forbid you from four things: I order you to believe in Allah. Do you know what is meant by belief in Allah? It is to testify that none has the right to be worshipped except Allah, to offer prayers perfectly, to give Zakat, and to give Al-Khumus (one-fifth of the war booty) (in Allah's Cause). And I forbid you four things, (i.e., Do not drink alcoholic drinks) Ad-Dubba, An- Naqir, (pitched water skins), Az-Zuruf, Al-Muzaffat and Al--Hantam (names of utensils used for the preparation of alcoholic drinks).\" (See Hadith No. 50, Vol. 1)",
      "chain": [
        "30153",
        "20241",
        "11301",
        "11309"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا عباد بن عباد، عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة وقد حالت بيننا وبينك كفار مضر فلا نخلص إليك إلا في شهر الحرام فمرنا بأمر نعمل به وندعو إليه من وراءنا ‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع الإيمان بالله - ثم فسرها لهم فقال - شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا خمس ما غنمتم وأنهاكم عن الدباء والحنتم والنقير والمقير ‏\"‏ ‏.‏ زاد خلف في روايته ‏\"‏ شهادة أن لا إله إلا الله ‏\"‏ ‏.‏ وعقد واحدة ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that a delegation of Abdul Qais came to the Messenger of Allah (may peace be upon him) and said:                      Messenger of Allah, verily ours is a tribe of Rabi'a and there stand between you and us the unbelievers of Mudar and we find no freedom to come to you except in the sacred month. Direct us to an act which we should ourselves perform and invite those who live beside us. Upon this the Prophet remarked: I command you to do four things and prohibit you against four acts. (The four deeds which you are commanded to do are): Faith in Allah, and then he explained it for them and said: Testifying the fact. that there is no god but Allah, that Muhammad is the messenger of Allah, performance of prayer, payment of Zakat, that you pay Khums (one-fifth) of the booty fallen to your lot, and I prohibit you to use round gourd, wine jars, wooden pots or skins for wine. Khalaf b. Hisham has made this addition in his narration: Testifying the fact that there is no god but Allah, and then he with his finger pointed out the oneness of the Lord.",
      "chain": [
        "30503",
        "20022",
        "11309",
        "17",
        "30399",
        "20243",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، وألفاظهم، متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن أبي جمرة، قال كنت أترجم بين يدى ابن عباس وبين الناس فأتته امرأة تسأله عن نبيذ الجر، فقال إن وفد عبد القيس أتوا رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من الوفد أو من القوم ‏\"‏ ‏.‏ قالوا ربيعة ‏.‏ قال ‏\"‏ مرحبا بالقوم أو بالوفد غير خزايا ولا الندامى ‏\"‏ ‏.‏ قال فقالوا يا رسول الله إنا نأتيك من شقة بعيدة وإن بيننا وبينك هذا الحى من كفار مضر وإنا لا نستطيع أن نأتيك إلا في شهر الحرام فمرنا بأمر فصل نخبر به من وراءنا ندخل به الجنة ‏.‏ قال فأمرهم بأربع ونهاهم عن أربع ‏.‏ قال أمرهم بالإيمان بالله وحده ‏.‏ وقال ‏\"‏ هل تدرون ما الإيمان بالله ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تؤدوا خمسا من المغنم ‏\"‏ ‏.‏ ونهاهم عن الدباء والحنتم والمزفت ‏.‏ قال شعبة وربما قال النقير ‏.‏ قال شعبة وربما قال المقير ‏.‏ وقال ‏\"‏ احفظوه وأخبروا به من ورائكم ‏\"‏ ‏.‏ وقال أبو بكر في روايته ‏\"‏ من وراءكم ‏\"‏ وليس في روايته المقير ‏.‏",
      "text_en": " Abu Jamra reported:                      I was an interpreter between Ibn Abbas and the people, that a woman happened to come there and asked about nabidh or the pitcher of wine. He replied: A delegation of the people of 'Abdul-Qais came to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) asked the delegation or the people (of the delegation about their identity). They replied that they belonged to the tribe of Rabi'a. He (the Holy Prophet) welcomed the people or the delegation which were neither humiliated nor put to shame. They (the members of the delegation) said: Messenger of Allah, we come to you from a far-off distance and there lives between you and us a tribe of the unbelievers of Mudar and, therefore, it is not possible for us to come to you except in the sacred months. Thus direct us to a clear command, about which we should inform people beside us and by which we may enter heaven. He (the Holy Prophet) replied: I command you to do four deeds and forbid you to do four (acts), and added: I direct you to affirm belief in Allah alone, and then asked them: Do you know what belief in Allah really implies? They said: Allah and His Messenger know best. The Prophet said: It implies testimony to the fact that there is no god but Allah, and that Muhammad is the messenger of Allah, establishment of prayer, payment of Zakat, fast of Ramadan, that you pay one-fifth of the booty (fallen to your lot) and I forbid you to use gourd, wine jar, or a receptacle for wine. Shu'ba sometimes narrated the word naqir (wooden pot) and sometimes narrated it as muqayyar. The Holy Prophet also said: Keep it in your mind and inform those who have been left behind.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20436",
        "20278",
        "20020",
        "20173",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا نصر بن علي الجهضمي، قال أخبرني أبي قالا، جميعا حدثنا قرة بن خالد، عن أبي جمرة، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث شعبة ‏.‏ وقال ‏\"‏ أنهاكم عما ينبذ في الدباء والنقير والحنتم والمزفت ‏\"‏ ‏.‏ وزاد ابن معاذ في حديثه عن أبيه قال وقال رسول الله صلى الله عليه وسلم للأشج أشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏",
      "text_en": " There is another hadith narrated on the authority of Ibn Abbas (the contents of which are similar to the one) narrated by Shu'ba in which the Holy Prophet (may peace be upon him) said:                      I forbid you to prepare nabidh in a gourd, hollowed block of wood, a varnished jar or receptacle. Ibn Mu'adh made this addition on the authority of his father that the Messenger of Allah said to Ashajj, of the tribe of 'Abdul-Qais: You possess two qualities which are liked by Allah: insight and deliberateness.",
      "chain": [
        "30150",
        "20286",
        "30395",
        "20264",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا هداب بن خالد الأزدي، حدثنا همام بن يحيى، حدثني أبو جمرة الضبعي، عن أبي بكر، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى البردين دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      He who observed two prayers at two cool (hours) would enter Paradise.",
      "chain": [
        "20297",
        "11309",
        "2",
        "500"
      ]
    },
    {
      "hadith_no": "1839",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي جمرة، قال سمعت ابن عباس، يقول كان رسول الله صلى الله عليه وسلم يصلي من الليل ثلاث عشرة ركعة ‏.‏",
      "text_en": " Zaid b Khalid al-Juhani said:                      I would definitely watch at night the prayer observed by the Messenger of Allah (may peace be upon him). He prayed two short rak'ahs, then two long, long, long rak'ahs, then he prayed two rak'ahs which were shorter than the two preceding rak'ahs, then he prayed two rak'ahs which were shorter than the two preceding, then he prayed two rak'ahs which were shorter than the two preceding, then observed a single one (Witr), making a total of thirteen rak'ahs",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30160",
        "20173",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، ووكيع، جميعا عن شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - قال حدثنا يحيى، بن سعيد حدثنا شعبة، حدثنا أبو جمرة، عن ابن عباس، قال جعل في قبر رسول الله صلى الله عليه وسلم قطيفة حمراء ‏.‏ قال مسلم أبو جمرة اسمه نصر بن عمران وأبو التياح اسمه يزيد بن حميد ماتا بسرخس ‏.‏",
      "text_en": " Ibn 'Abbas said that a piece of red stuff was put in the grave of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30399",
        "20032",
        "30201",
        "20278",
        "20020",
        "30170",
        "20031",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "3074",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت أبا جمرة الضبعي، قال تمتعت فنهاني ناس عن ذلك، فأتيت ابن عباس فسألته عن ذلك، فأمرني بها ‏.‏ - قال - ثم انطلقت إلى البيت فنمت فأتاني آت في منامي فقال عمرة متقبلة وحج مبرور - قال - فأتيت ابن عباس فأخبرته بالذي رأيت فقال الله أكبر الله أكبر سنة أبي القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Jam at al-Dubu'i reported:                      I performed Tamattu' but the people dis- couraged me to do so. I came to Ibn 'Abbas and asked him about it. He ordered me to do so. I came to the House (Ka'ba) and slept. I saw a visitant in the dream who said: 'Umra is acceptable and so is the Hajj performed for God's sake. I came to Ibn Abbas and informed him about that Which I saw in the dream whereupon he said: Allah is the Greatest, Allah is the Greatest This is the Sunnah of Abu'l-Qasim (the Holy Pro- phet) (may peace be upon him).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "5293",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عباد بن عباد، عن أبي جمرة، عن ابن عباس، ح وحدثنا خلف بن هشام، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، يقول قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أنهاكم عن الدباء والحنتم والنقير والمقير ‏\"‏ ‏.‏ وفي حديث حماد جعل - مكان المقير - المزفت ‏.‏",
      "text_en": " Ishaq b. Suwaid reported through the same chain of transmitters but for the difference that he substituted the word\" gourd\" for\" waterskin\" (meant for preserving wine).",
      "chain": [
        "30399",
        "20243",
        "11309",
        "17",
        "30503",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "6243",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا بشر بن السري، حدثنا حماد، عن أبي جمرة الضبعي، عن ابن عباس، قال أقام رسول الله صلى الله عليه وسلم بمكة ثلاث عشرة سنة يوحى إليه وبالمدينة عشرا ومات وهو ابن ثلاث وستين سنة ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) stayed in Mecca for thirteen years (after he had received revelation) and stayed in Medina for ten years, and he was sixty-three when he died.",
      "chain": [
        "30421",
        "20190",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "6516",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة السامي، ومحمد بن حاتم، - وتقاربا في سياق الحديث واللفظ لابن حاتم - قالا حدثنا عبد الرحمن بن مهدي حدثنا المثنى بن سعيد عن أبي جمرة عن ابن عباس قال لما بلغ أبا ذر مبعث النبي صلى الله عليه وسلم بمكة قال لأخيه اركب إلى هذا الوادي فاعلم لي علم هذا الرجل الذي يزعم أنه يأتيه الخبر من السماء فاسمع من قوله ثم ائتني ‏.‏ فانطلق الآخر حتى قدم مكة وسمع من قوله ثم رجع إلى أبي ذر فقال رأيته يأمر بمكارم الأخلاق وكلاما ما هو بالشعر ‏.‏ فقال ما شفيتني فيما أردت ‏.‏ فتزود وحمل شنة له فيها ماء حتى قدم مكة فأتى المسجد فالتمس النبي صلى الله عليه وسلم ولا يعرفه وكره أن يسأل عنه حتى أدركه - يعني الليل - فاضطجع فرآه علي فعرف أنه غريب فلما رآه تبعه فلم يسأل واحد منهما صاحبه عن شىء حتى أصبح ثم احتمل قريبته وزاده إلى المسجد فظل ذلك اليوم ولا يرى النبي صلى الله عليه وسلم حتى أمسى فعاد إلى مضجعه فمر به علي فقال ما أنى للرجل أن يعلم منزله فأقامه فذهب به معه ولا يسأل واحد منهما صاحبه عن شىء حتى إذا كان يوم الثالث فعل مثل ذلك فأقامه علي معه ثم قال له ألا تحدثني ما الذي أقدمك هذا البلد قال إن أعطيتني عهدا وميثاقا لترشدني فعلت ‏.‏ ففعل فأخبره فقال فإنه حق وهو رسول الله صلى الله عليه وسلم فإذا أصبحت فاتبعني فإني إن رأيت شيئا أخاف عليك قمت كأني أريق الماء فإن مضيت فاتبعني حتى تدخل مدخلي ‏.‏ ففعل فانطلق يقفوه حتى دخل على النبي صلى الله عليه وسلم ودخل معه فسمع من قوله وأسلم مكانه فقال له النبي صلى الله عليه وسلم ‏\"‏ ارجع إلى قومك فأخبرهم حتى يأتيك أمري ‏\"‏ ‏.‏ فقال والذي نفسي بيده لأصرخن بها بين ظهرانيهم ‏.‏ فخرج حتى أتى المسجد فنادى بأعلى صوته أشهد أن لا إله إلا الله وأن محمدا رسول الله ‏.‏ وثار القوم فضربوه حتى أضجعوه فأتى العباس فأكب عليه فقال ويلكم ألستم تعلمون أنه من غفار وأن طريق تجاركم إلى الشام عليهم ‏.‏ فأنقذه منهم ثم عاد من الغد بمثلها وثاروا إليه فضربوه فأكب عليه العباس فأنقذه ‏.‏",
      "text_en": " Ibn 'Abbas reported that when Abu Dharr heard of the advent of the Apostle (may peace be upon him) in Mecca he said:                      Brother, ride in this valley and bring information for me about the person who claims that there comes to him information from the Heavens. Listen to his words and then come to me. So he rode on until he came to Mecca and he heard his words (the sacred words of the Holy Prophet) and then came back to Abu Dharr and said: I have seen him exhorting (people) to develop good morals and his expressions can in no way be termed as poetry. He (Abu Dharr) said: I have not been satisfied with it regarding that which I had in my mind (as I sent you). So he took up provisions for the journey and a small water-skin con- taining water (and set forth) until he came to Mecca. He came to the mosque (Ka'ba) and began to find out Allah's Apostle (may peace be upon him) and he did not re- cognise him (the Holy Prophet) and he did not even like that he should ask about him from anyone until it was night, and he slept. 'All saw him and found him to be a stranger. So he went with him. He followed hive but one did not make any inquiry from the other about anything until it was morning. He then brought the water and his provisions to the mosque and spent a day there, but he did not see Allah's Apostle (may peace be upon him) until it was night. He then returned to his bed that there happened to pass 'Ali and he said: This man has not been able to find his destination until this time. He made him stand and he went with him and no one made an in- quiry from his companion about anything. And when it was the third day he did the same. 'Ali made him stand up and brought him along with him. He said: By Him, besides Whom there is no god, why don't you tell me (the reason) which brought you here to this town? He said: (I shall do this) provided you hold me promise and a covenant that you would guide me aright. He then did that. He ('Ali) said: Verily, he Is truthful and he is a Messenger of Allah (may peace be upon him) and when it is morning, follow me and if I would say anything from which I would sense fear about you I would stand (in a manner) as if I was throwing water and if I move on, you then follow me until I get in (some house). He did that and I followed him until he came to Allah's Messenger (may peace be upon him). He entered (the house) of Allah's Apostle (may peace be upon him) along with him and listened to his words and embraced Islam at his very place. Allah's Apostle (may peace be upon him) said to him: Go to your people and inform them until my command reaches you. Thereupon he said: By Him in Whose Hand is my life, I shall say to the people of Mecca this thing at the top of my voice So he set forth until he came to the mosque and then spoke at the top of his voice (saying): I bear testimony to the fact that there is no god but Allah and that Muhammad is the Messenger of Allah. The people attacked him and made him fall down when 'Abbas came and he leaned over him and said: Woe be upon you, don't you know that he is from amongst the tribe of Ghifar and your trad- ing route to Syria passes through (the settlements of this tribe), and he rescued him. He (Abu Dharr) did the same on the next day and they (the Meccans) again attacked him and Abbas leaned upon him and he rescued him.",
      "chain": [
        "38487",
        "20033",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "6638",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن غندر، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، سمعت أبا جمرة، حدثني زهدم بن، مضرب سمعت عمران بن حصين، يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن خيركم قرني ثم الذين يلونهم ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال عمران فلا أدري أقال رسول الله صلى الله عليه وسلم بعد قرنه مرتين أو ثلاثة ‏\"‏ ثم يكون بعدهم قوم يشهدون ولا يستشهدون ويخونون ولا يتمنون وينذرون ولا يوفون ويظهر فيهم السمن ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain reported Allah's-Messenger (may peace be upon him) as saying:                      The best among you (are) the people (who belong to) my age. Then those next to them, then those next to them, then those next to them. 'Imran said: I do not know whether Allah's Messenger (may peace be upon him) said twice or thrice (the words:\" Then next\" ) after (saying) about his (own age but he then said): Then after them (after successors or those who would succeed them) would come a people who would give evidence before they are asked for it, and would be dishonest and not trustworthy, who would make vows but would not fulfil them, and would be significant in being bulky.",
      "chain": [
        "30201",
        "30170",
        "20278",
        "20173",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد بن عبد الله المخرمي، - لفظه - قالا حدثنا وكيع، عن إبراهيم بن طهمان، عن أبي جمرة، عن ابن عباس، قال إن أول جمعة جمعت في الإسلام بعد جمعة جمعت في مسجد رسول الله صلى الله عليه وسلم بالمدينة لجمعة جمعت بجواثاء قرية من قرى البحرين ‏.‏ قال عثمان قرية من قرى عبد القيس ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Friday prayer first offered in Islam after the Friday prayer offered in the mosque of the Messenger of Allah (ﷺ) is Friday prayer offered at Juwatha, a village from the villages of al-Bahrain. The narrator ‘Uthman said: it is a village from the village of the tribe of ‘Abd al-Qais.",
      "chain": [
        "30203",
        "20032",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "3042",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن سنان الواسطي، حدثنا محمد بن بلال، عن عمران القطان، عن أبي جمرة، عن ابن عباس، قال إن أهل فارس لما مات نبيهم كتب لهم إبليس المجوسية ‏.‏",
      "text_en": " Ibn ‘Abbas said “When the Prophet of the Persians dies, Iblis (satan) led them to Mazdaism.”",
      "chain": [
        "30297",
        "24388",
        "20718",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "3692",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عبيد، قالا حدثنا حماد، ح وحدثنا مسدد، حدثنا عباد بن عباد، عن أبي جمرة، قال سمعت ابن عباس، يقول - وقال مسدد عن ابن عباس، وهذا، حديث سليمان قال - قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة قد حال بيننا وبينك كفار مضر ولسنا نخلص إليك إلا في شهر حرام فمرنا بشىء نأخذ به وندعو إليه من وراءنا ‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع الإيمان بالله وشهادة أن لا إله إلا الله ‏\"‏ ‏.‏ وعقد بيده واحدة ‏.‏ وقال مسدد الإيمان بالله ثم فسرها لهم شهادة أن لا إله إلا الله ‏\"‏ وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا الخمس مما غنمتم وأنهاكم عن الدباء والحنتم والمزفت والمقير ‏\"‏ ‏.‏ وقال ابن عبيد النقير مكان المقير ‏.‏ وقال مسدد والنقير والمقير ولم يذكر المزفت ‏.‏ قال أبو داود أبو جمرة نصر بن عمران الضبعي ‏.‏",
      "text_en": " Ibn 'Abbas said:                      The deputation of 'Abd al-Qais came to Messenger of Allah (ﷺ) and said: This is the tribe of Rabi'ah, and the infidels of Mudar are between us and you. We are able to come to you only in the sacred month. So give a decisive command which we may follow ourselves and to which we call those at home behind us. He (the Prophet) said: I command you to observe four things, and forbade you four things: Belief in Allah. the testimony that there is no god but Allah, and he expresses one by folding his hand. Musadad's version has: Faith in Allah, and he explained to them: The testimony that there is no god but Allah and that Muhammad is the Messenger of Allah, observance of prayer, payment of zakat, and your giving the filth of the booty. I forbid you the use of pumpkins, green jarrs, vessels smeared with pitch, and hollow stumps of palm-trees. Ibn 'Ubaid's version has word muqayyar (vessels smeared with pitch) instead of naqir (hollow stumps). Musaddad's version has naqir and muqayyar (pitch); he did not mention muzaffat (vessels smeared with pitch).Abu Dawud said: The name of Abu Jamrah is Nasr bin 'Imran al-Duba'i.",
      "chain": [
        "20193",
        "30213",
        "20022",
        "30175",
        "20243",
        "11309",
        "17",
        "30175",
        "17"
      ]
    },
    {
      "hadith_no": "4677",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثني يحيى بن سعيد، عن شعبة، حدثني أبو جمرة، قال سمعت ابن عباس، قال إن وفد عبد القيس لما قدموا على رسول الله صلى الله عليه وسلم أمرهم بالإيمان بالله قال ‏\"‏ أتدرون ما الإيمان بالله ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تعطوا الخمس من المغنم ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      When the deputation of ‘Abd al-Qais came to the Messenger of Allah (May peace be upon him), he commanded them to believe in Allah. He asked : Do you know what faith in Allah is? They replied : Allah and his Apostle know best. He said: It includes the testimony that there is no god but Allah, and that Muhammad is Allah’s Apostle, the observance of the prayer, the payment of zakat, the fasts of Ramadan, and your giving a fifth of the booty.",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، قال حدثنا وكيع، عن شعبة، عن أبي جمرة الضبعي، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يصلي من الليل ثلاث عشرة ركعة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو جمرة الضبعي اسمه نصر بن عمران الضبعي ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet (S) would pray thirteen Rak'ah at night.\"",
      "chain": [
        "30216",
        "20032",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1599",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا عباد بن عباد المهلبي، عن أبي جمرة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لوفد عبد القيس ‏\"‏ آمركم أن تؤدوا خمس ما غنمتم ‏\"‏ ‏.‏ قال وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Prophet (ﷺ) said to a delegation from 'Abdul-Qais: \"I order you to give the Khumus from your spoils of war.\"He said: There is a story with this Hadith[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30367",
        "20243",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1599",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أبي جمرة، عن ابن عباس، نحوه ‏.‏",
      "text_en": " Another chain with similar narration.",
      "chain": [
        "30367",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2143",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا بشر بن المفضل، عن قرة بن خالد، عن أبي جمرة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لأشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وفي الباب عن الأشج العصري ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah said to the Ashajj 'Abdul-Qais:                     \"Indeed there are two traits in you that Allah loves: Forbearance, and deliberateness.\"",
      "chain": [
        "30448",
        "20212",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2611",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، حدثنا عباد بن عباد المهلبي، عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إنا هذا الحى من ربيعة ولسنا نصل إليك إلا في أشهر الحرام فمرنا بشيء نأخذه عنك وندعو إليه من وراءنا ‏.‏ فقال ‏\"‏ آمركم بأربع الإيمان بالله ثم فسرها لهم شهادة أن لا إله إلا الله وأني رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا خمس ما غنمتم ‏\"‏ ‏.‏ حدثنا قتيبة، حدثنا حماد بن زيد، عن أبي جمرة، عن ابن عباس، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو جمرة الضبعي اسمه نصر بن عمران ‏.‏ وقد رواه شعبة عن أبي جمرة أيضا وزاد فيه أتدرون ما الإيمان شهادة أن لا إله إلا الله وأني رسول الله وذكر الحديث ‏.‏ سمعت قتيبة بن سعيد يقول ما رأيت مثل هؤلاء الأشراف الأربعة مالك بن أنس والليث بن سعد وعباد بن عباد المهلبي وعبد الوهاب الثقفي ‏.‏ قال قتيبة كنا نرضى أن نرجع من عند عباد كل يوم بحديثين وعباد بن عباد هو من ولد المهلب بن أبي صفرة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"A delegation of Abdul-Qais came to the Messenger of Allah (ﷺ) and said: 'We are a tribe from Rabi'ah, and we cannot come to you except during the sacred months. So order us with something that we can take from you, and then we call those who are behind us to it.'So he said: 'I order you with four things: To testify to La Ilaha Illallah, and that I am the Messenger of Allah; to establish the Salat, to give the Zakat, and to give the Khumus from the spoils of war that you gain.'\"",
      "chain": [
        "30367",
        "20243",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2012",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن يزيد، - وهو ابن زريع - قال حدثنا شعبة، عن أبي جمرة، عن ابن عباس، قال ‏:‏ جعل تحت رسول الله صلى الله عليه وسلم حين دفن قطيفة حمراء ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Messenger of Allah was buried, a red velvet cloak was placed beneath him.\"",
      "chain": [
        "34033",
        "20304",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن أبي جمرة، عن زهدم، قال سمعت عمران بن حصين، يذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خيركم قرني ثم الذين يلونهم ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ فلا أدري أذكر مرتين بعده أو ثلاثا ثم ذكر قوما يخونون ولا يؤتمنون ويشهدون ولا يستشهدون وينذرون ولا يوفون ويظهر فيهم السمن ‏.‏ قال أبو عبد الرحمن هذا نصر بن عمران أبو جمرة ‏.‏",
      "text_en": " 'Imran bin Husain said:                      \"The Messenger of Allah said: 'The best of you are my generation, then those who come after them, then those whom after them, then those who come after them.' -I do not know if he said two times after him or three. Then he mentioned some people who betray and cannot be trusted, who bear witness without being asked to do so, who make vows and do not fulfill them, and fatness will prevail among them.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "5031",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا قتيبة قال حدثنا عباد وهو ابن عباد عن أبي جمرة عن ابن عباس قال  قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إنا هذا الحي من ربيعة ولسنا نصل إليك إلا في الشهر الحرام فمرنا بشيء نأخذه عنك وندعو إليه من وراءنا فقال آمركم بأربع وأنهاكم عن أربع الإيمان بالله ثم فسرها لهم شهادة أن لا إله إلا الله وأني رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا إلي خمس ما غنمتم وأنهاكم عن الدباء والحنتم والمقير والمزفت",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The delegation of 'Abdul-Qais came to the Messenger of Allah [SAW] and said: 'We are a group of people from (the tribe of) Rabi'ah, and we can only reach you during the sacred month. Tell us something that we can take from you and to which we may call those who are behind us.' He said: 'I command you to do four things and I forbid you from four: Faith in Allah'- and he explained that to them- 'bearing witness that there is none worthy of worship except Allah, establishing Salah, paying Zakah, and giving me one-fifth (the Khumus) of the spoils of war you acquire. And I forbid you from Ad-Dubba', Al-Hantam, Al-Muqayyir, and Al-Muzaffat.'\"",
      "chain": [
        "30367",
        "20243",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "5691",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن أبي جمرة، قال كنت أترجم بين ابن عباس وبين الناس فأتته امرأة تسأله عن نبيذ الجر، فنهى عنه ‏.‏ قلت يا أبا عباس إني أنتبذ في جرة خضراء نبيذا حلوا فأشرب منه فيقرقر بطني ‏.‏ قال لا تشرب منه وإن كان أحلى من العسل ‏.‏",
      "text_en": " It was narrated that Abu Hamzah said:                     \"I used to interpret between Ibn 'Abbas and the people. A woman came to him and asked him about Nabidh made in earthenware jars, and he forbade it. I said: 'O Abu 'Abbas, I make a sweet Nabidh in a green earthenware jar; when I drink it, my stomach makes noises.' He said: 'Do not drink it even if it is sweeter than honey.'\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309"
      ]
    }
  ],
  "total_hadiths": 50
}