{
  "id": "11305",
  "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
  "full_name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "95",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Amiri",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "5130",
      "name": "'Abdullah bin al-Shakhayr ( عبد الله بن الشخير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11318",
      "name": "Yazid bin 'Abdullah bin al-Shakhayr يزيد بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19101",
      "name": "Hani' bin 'Abdullah bin al-Shakhayr هانئ بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [
    {
      "id": "14225",
      "name": "'Abdullah bin Matraf bin 'Abdullah عبد الله بن مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "5130",
      "name": "'Abdullah bin al-Shakhayr ( عبد الله بن الشخير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5217",
      "name": "Ayad bin Hmar bin Aby ( عياض بن حمار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3242",
      "name": "'Abdullah bin Mughfal al-Mazni ( عبد الله بن مغفل المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19375",
      "name": "Abu Muslim al-Jdhmy أبو مسلم الجذمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11318",
      "name": "Yazid bin 'Abdullah bin al-Shakhayr يزيد بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11319",
      "name": "Yazid bin Abi Yazid, al-Rashk يزيد بن أبي يزيد الضبعي الرشك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11300",
      "name": "Ghaylan bin Jarir غيلان بن جرير المعولي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11427",
      "name": "Sa'id bin Abi Hnd سعيد بن أبي هند الفزاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14249",
      "name": "Abd al-Krym bin Rshyd عبد الكريم بن رشيد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11288",
      "name": "Sa'id bin Yazid bin Muslima سعيد بن يزيد بن مسلمة الأزدي القصير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "786",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف بن عبد الله، قال صليت خلف علي بن أبي طالب  رضى الله عنه  أنا وعمران بن حصين،، فكان إذا سجد كبر، وإذا رفع رأسه كبر، وإذا نهض من الركعتين كبر، فلما قضى الصلاة أخذ بيدي عمران بن حصين فقال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد صلى بنا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif bin `Abdullah:                     `Imran bin Husain and I offered the prayer behind `Ali bin Abi Talib. When `Ali prostrated, he said the Takbir, when he raised his head, he said the Takbir and when he got up for the third rak`a he said the Takbir. On completion of the prayer `Imran took my hand and said, \"This (i.e. `Ali) made me remember the prayer of Muhammad\" Or he said, \"He led us in a prayer like that of Muhammad.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11305"
      ]
    },
    {
      "hadith_no": "6676",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا يزيد الرشك، قال سمعت مطرف بن عبد الله بن الشخير، يحدث عن عمران بن حصين، قال قال رجل يا رسول الله أيعرف أهل الجنة من أهل النار قال ‏\"‏ نعم ‏\"‏‏.‏ قال فلم يعمل العاملون قال ‏\"‏كل يعمل لما خلق له  أو لما يسر له‏\"‏ ‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     A man said, \"O Allah's Apostle! Can the people of Paradise be known (differentiated) from the people of the Fire; The Prophet replied, \"Yes.\" The man said, \"Why do people (try to) do (good) deeds?\" The Prophet said, \"Everyone will do the deeds for which he has been created to do or he will do those deeds which will be made easy for him to do.\" (i.e. everybody will find easy to do such deeds as will lead him to his destined place for which he has been created).",
      "chain": [
        "20404",
        "20020",
        "11319",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "7646",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، قال يزيد حدثني مطرف بن عبد الله، عن عمران، قال قلت يا رسول الله فيما يعمل العاملون قال ‏\"‏ كل ميسر لما خلق له ‏\"‏‏.‏",
      "text_en": " Narrated `Imran:                     I said, \"O Allah's Apostle! Why should a doer (people) try to do good deeds?' The Prophet said, \"Everybody will find easy to do such deeds as will lead him to his destined place for which he has been created.'",
      "chain": [
        "30315",
        "20258",
        "20472",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، سمع مطرف بن عبد الله، يحدث عن ابن المغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب ثم قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ ثم رخص في كلب الصيد وكلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة في التراب ‏\"‏ ‏.‏",
      "text_en": " Ibn Mughaffal reported:                      The Messenger of Allah (may peace be upon him) ordered killing of the dogs, and then said: What about them, i. e. about other dogs? and then granted concession (to keep) the dog for hunting and the dog for (the security) of the herd, and said: When the dog licks the utensil, wash it seven times, and rub it with earth the eighth time.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "11305"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا سعيد بن أبي عروبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، أن عائشة، نبأته أن رسول الله صلى الله عليه وسلم كان يقول في ركوعه وسجوده ‏\"‏ سبوح قدوس رب الملائكة والروح ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (way peace he upon him) used to pronounce while bowing and prostrating himself:                      All Glorious, All Holy, Lord of the Angels and the Spirit.",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11305"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، أخبرني قتادة، قال سمعت مطرف بن عبد الله بن الشخير، قال أبو داود وحدثني هشام، عن قتادة، عن مطرف، عن عائشة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha by another chain of transmitters.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "11305",
        "30002",
        "20295",
        "11019",
        "11395",
        "53"
      ]
    },
    {
      "hadith_no": "3036",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، حدثنا عيسى بن يونس، حدثنا سعيد بن أبي عروبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن عمران بن الحصين، - رضى الله عنه - قال اعلم أن رسول الله صلى الله عليه وسلم جمع بين حج وعمرة ثم لم ينزل فيها كتاب ولم ينهنا عنهما رسول الله صلى الله عليه وسلم ‏.‏ قال فيها رجل برأيه ما شاء‏.‏",
      "text_en": " 'Imran b. al-Husain (Allah be pleased with him) said:                      Know well that Allah's Messenger (may peace be upon him) combined 'Hajj and 'Umra, and nothing was revealed in the Book (to abrogate it), and the Messenger of Allah (may peace be upon him) too did not forbid us from (combining) them. And whatever a person said was out of his personal opinion.",
      "chain": [
        "30123",
        "20347",
        "11073",
        "11019",
        "11305"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، سمع مطرف، بن عبد الله عن ابن المغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب ثم قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ ثم رخص في كلب الصيد وكلب الغنم ‏.‏",
      "text_en": "  Ibn Mughaffal reported:                      Allah's Messenger (may peace be upon him) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keehing of dogs for hunting and (the protection of) herds.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "11305"
      ]
    },
    {
      "hadith_no": "7386",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني أبو غسان المسمعي، ومحمد بن المثنى، ومحمد بن بشار بن عثمان، - واللفظ لأبي غسان وابن المثنى - قالا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن  مطرف بن عبد الله بن الشخير، عن عياض بن حمار المجاشعي، أن رسول الله صلى الله عليه وسلم قال ذات يوم في خطبته ‏\"‏ ألا إن ربي أمرني أن أعلمكم ما جهلتم مما علمني يومي هذا كل مال نحلته عبدا حلال وإني خلقت عبادي حنفاء كلهم وإنهم أتتهم الشياطين فاجتالتهم عن دينهم وحرمت عليهم ما أحللت لهم وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا وإن الله نظر إلى أهل الأرض فمقتهم عربهم وعجمهم إلا بقايا من أهل الكتاب وقال إنما بعثتك لأبتليك وأبتلي بك وأنزلت عليك كتابا لا يغسله الماء تقرؤه نائما ويقظان وإن الله أمرني أن أحرق قريشا فقلت رب إذا يثلغوا رأسي فيدعوه خبزة قال استخرجهم كما استخرجوك واغزهم نغزك وأنفق فسننفق عليك وابعث جيشا نبعث خمسة مثله وقاتل بمن أطاعك من عصاك ‏.‏ قال وأهل الجنة ثلاثة ذو سلطان مقسط متصدق موفق ورجل رحيم رقيق القلب لكل ذي قربى ومسلم وعفيف متعفف ذو عيال - قال - وأهل النار خمسة الضعيف الذي لا زبر له الذين هم فيكم تبعا لا يتبعون أهلا ولا مالا والخائن الذي لا يخفى له طمع وإن دق إلا خانه ورجل لا يصبح ولا يمسي إلا وهو يخادعك عن أهلك ومالك ‏\"‏ ‏.‏ وذكر البخل أو الكذب ‏\"‏ والشنظير الفحاش ‏\"‏ ‏.‏ ولم يذكر أبو غسان في حديثه ‏\"‏ وأنفق فسننفق عليك ‏\"‏ ‏.‏",
      "text_en": " 'Iyad b. Him-ar reported that Allah's Messenger (may peace be upon him), while delivering a sermon one day, said:                      Behold, my Lord commanded me that I should teach you which you do not know and which He has taught me today. (He has instructed thus): The property which I have conferred upon them is lawful for them. I have created My servants as one having a natural inclination to the worship of Allah but it is Satan who turns them away from the right religion and he makes unlawful what has been declared lawful for them and he commands them to ascribe partnership with Re, although he has no justification for that. And verily, Allah looked towards the people of the world and He showed hatred for the Arabs and the non-Arabs, but with the exception of some remnants from the People of the Book. And He (further) said: I have sent thee (the Holy Prophet) in order to put you to test and put (those to test) through you. And I sent the Book to you which cannot be washed away by water, so that you may recite it while in the state of wakefulness or sleep. Verily, Allah commanded me to burn (kill) the Quraish. I said: My Lord, they would break my head (like the tearing) of bread, and Allah said: You turn them out as they turned you out, you fight against them and We shall help you in this, you should spend and you would be conferred upon. You send an army and I would send an army five times greater than that. Fight against those who disobey you along with those who obey you. The inmates of Paradise are three: One who wields authority and is just and fair, one who Is truthful and has been endowed with power to do good deeds. And the person who is merciful and kind hearted towards his relatives and to every pious Muslim, and one who does not stretch his hand in spite of having a large family to support. And He said: The inmates of Hell are five: the weak who lack power to (avoid evil), the (carefree) who pursue (everything irrespective of the fact that it is good or evil) and who do not have any care for their family or for their wealth. And those dishonest whose greed cannot be concealed even in the case of minor things. And the third. who betray you. morning and evening, in regard to your family and your property. He also made a mention of the miser and the liar and those who are in the habit of abusing people and using obscene and foul language. Abu Ghassan in his narration did not make mention of\" Spend and there would be spent for you.\"",
      "chain": [
        "30456",
        "30170",
        "30160",
        "20287",
        "20295",
        "11019",
        "11305",
        "5217"
      ]
    },
    {
      "hadith_no": "7389",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو عمار، حسين بن حريث حدثنا الفضل بن موسى، عن الحسين، عن  مطر، حدثني قتادة، عن مطرف بن عبد الله بن الشخير، عن عياض بن حمار، أخي بني مجاشع قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم خطيبا فقال ‏\"‏ إن الله أمرني ‏\"‏ ‏.‏ وساق الحديث بمثل حديث هشام عن قتادة وزاد فيه ‏\"‏ وإن الله أوحى إلى أن تواضعوا حتى لا يفخر أحد على أحد ولا يبغي أحد على أحد ‏\"‏ ‏.‏ وقال في حديثه ‏\"‏ وهم فيكم تبعا لا يبغون أهلا ولا مالا ‏\"‏ ‏.‏ فقلت فيكون ذلك يا أبا عبد الله قال نعم  والله لقد أدركتهم في الجاهلية وإن الرجل ليرعى على الحى ما به إلا وليدتهم يطؤها  ‏.‏",
      "text_en": " Iyad. b. Himar reported tbat, while Allah's Messenger (may peace be upon him) was delivering an address, he stated that Allah commanded me The rest of the hadith is the same, and there is an addition in it:                     \" Allah revealed to me that we should be humble amongst ourselves and none should show pride upon the others, And it does not behove one to do so, and He also said: There are among you people to follow not caring a bit for their family and property. Qatada said: Abu Abdullah, would this happen? Thereupon he said: Yes. By Allah, I found this in the days of ignorance that a person grazed the goat of a tribe and did not find anyone but their slave-girl (and he did not spare her) but committed adultery with her.",
      "chain": [
        "20452",
        "11278",
        "11019",
        "11305",
        "5217"
      ]
    },
    {
      "hadith_no": "531",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا سعيد الجريري، عن أبي العلاء، عن مطرف بن عبد الله، عن عثمان بن أبي العاص، قال قلت وقال موسى في موضع آخر إن عثمان بن أبي العاص قال يا رسول الله اجعلني إمام قومي ‏.‏ قال ‏\"‏ أنت إمامهم واقتد بأضعفهم واتخذ مؤذنا لا يأخذ على أذانه أجرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Uthman ibn Abul'As:                     Messenger of Allah, appoint me the leader of the tribe in prayer. He said: You are their leader, but you should follow on who is the weakest of them: and appoint a mu'adhdhin who does not charge for the calling of adhan.",
      "chain": [
        "20040",
        "20022",
        "11286",
        "11305",
        "3210",
        "3210"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، حدثنا خالد يعني الطحان، ح وحدثنا موسى بن إسماعيل، حدثنا وهيب، - المعنى - عن خالد الحذاء، عن أبي العلاء، عن مطرف، - يعني ابن عبد الله - عن عياض بن حمار، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجد لقطة فليشهد ذا عدل - أو ذوى عدل - ولا يكتم ولا يغيب فإن وجد صاحبها فليردها عليه وإلا فهو مال الله عز وجل يؤتيه من يشاء ‏\"‏ ‏.‏",
      "text_en": " Narrated Iyad ibn Himar:                     The Prophet (ﷺ) said: He who finds something should call one or two trusty persons as witnesses and not conceal it or cover it up; then if he finds its owner he should return it to him, otherwise it is Allah's property which He gives to whom He will.",
      "chain": [
        "30175",
        "20423",
        "20040",
        "11282",
        "11305",
        "5217"
      ]
    },
    {
      "hadith_no": "2186",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا بشر بن هلال، أن جعفر بن سليمان، حدثهم عن يزيد الرشك، عن مطرف بن عبد الله، أن عمران بن حصين، سئل عن الرجل، يطلق امرأته ثم يقع بها ولم يشهد على طلاقها ولا على رجعتها فقال طلقت لغير سنة ‏.‏ وراجعت لغير سنة أشهد على طلاقها وعلى رجعتها ولا تعد ‏.‏",
      "text_en": " Narrated Mutarrif ibn Abdullah:                     Imran ibn Husayn was asked about a person who divorces his wife, and then has intercourse with her, but he does not call any witness to her divorce nor to her restoration. He said: You divorced against the sunnah and took her back against the sunnah. Call someone to bear witness to her divorce, and to her return in marriage, and do not repeat it.",
      "chain": [
        "30537",
        "20532",
        "11319",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "2303",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو هريرة، محمد بن فراس البصري حدثنا أبو قتيبة، سلم بن قتيبة حدثنا أبو العوام، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل ابن آدم وإلى جنبه تسع وتسعون منية إن أخطأته المنايا وقع في الهرم حتى يموت ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو العوام هو عمران وهو ابن داور القطان ‏.‏",
      "text_en": " Mutarrif bin 'Abdullah bin Ash-Shikh-khir narrated from his father, from the Prophet (s.a.w), who said:                     'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"",
      "chain": [
        "20233",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "2644",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو هريرة، محمد بن فراس البصري حدثنا أبو قتيبة، سلم بن قتيبة حدثنا أبو العوام، وهو عمران القطان عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل ابن آدم وإلى جنبه تسعة وتسعون منية إن أخطأته المنايا وقع في الهرم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Mutarrif bin 'Abdullah bin Ash-Shikh-khir narrated from his father from the Prophet(s.a.w) who said:                     \"The case of the son of Adam is such that he is surrounded by ninety-nine calamities, if the calamities miss him, he falls into decrepitude.\"",
      "chain": [
        "20233",
        "20718",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "3678",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وهب بن جرير، حدثنا شعبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، أنه انتهى إلى النبي صلى الله عليه وسلم وهو يقرأ ‏(‏ ألهاكم التكاثر ‏)‏ قال ‏\"‏ يقول ابن آدم مالي مالي وهل لك من مالك إلا ما تصدقت فأمضيت أو أكلت فأفنيت أو لبست فأبليت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Mutarrif bin Abdullah bin Ash-Shikh-khir reported from his father, :                     that he went to the Prophet and he was reciting: ‘The mutual rivalry (for piling up worldly things) diverts you.’ He said: “The son of Adam says: ‘My wealth, my wealth.’ And do you own anything except what you give in charity, such that you’ve spent it, or what you eat, suc that you’ve finished it, or you wear, such that you’ve worn it out?”",
      "chain": [
        "30277",
        "20298",
        "20020",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "4077",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا جعفر بن سليمان الضبعي، عن يزيد الرشك، عن مطرف بن عبد الله، عن عمران بن حصين، قال بعث رسول الله صلى الله عليه وسلم جيشا واستعمل عليهم علي بن أبي طالب فمضى في السرية فأصاب جارية فأنكروا عليه وتعاقد أربعة من أصحاب رسول الله صلى الله عليه وسلم فقالوا إذا لقينا رسول الله صلى الله عليه وسلم أخبرناه بما صنع علي وكان المسلمون إذا رجعوا من السفر بدءوا برسول الله صلى الله عليه وسلم فسلموا عليه ثم انصرفوا إلى رحالهم فلما قدمت السرية سلموا على النبي صلى الله عليه وسلم فقام أحد الأربعة فقال يا رسول الله ألم تر إلى علي بن أبي طالب صنع كذا وكذا ‏.‏ فأعرض عنه رسول الله صلى الله عليه وسلم ثم قام الثاني فقال مثل مقالته فأعرض عنه ثم قام إليه الثالث فقال مثل مقالته فأعرض عنه ثم قام الرابع فقال مثل ما قالوا فأقبل إليه رسول الله صلى الله عليه وسلم والغضب يعرف في وجهه فقال ‏\"‏ ما تريدون من علي ما تريدون من علي ما تريدون من علي إن عليا مني وأنا منه وهو ولي كل مؤمن بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث جعفر بن سليمان ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     that the Messenger of Allah (ﷺ) dispatched an army and he put 'Ali bin Abi Talib in charge of it. He left on the expedition and he entered upon a female slave. So four of the Companions of the Messenger of Allah (ﷺ) scolded him, and they made a pact saying: \"[If] we meet the Messenger of Allah (ﷺ) we will inform him of what 'Ali did.\" When the Muslims returned from the journey, they would begin with the Messenger of Allah (ﷺ) and give him Salam, then they would go to their homes. So when the expedition arrived, they gave Salam to the Prophet (ﷺ), and one of the four stood saying: \"O Messenger of Allah! Do you see that 'Ali bin Abi Talib did such and such.\" The Messenger of Allah (ﷺ) turned away from him. Then the second one stood and said as he said, and he turned away from him. Then the third stood before him, and said as he said, and he turned away from him. Then the fourth stood and said as they had said. The Messenger of Allah (ﷺ) faced him, and the anger was visible on his face, he said: \"What do you want from 'Ali?! What do you want from 'Ali?! Indeed 'Ali is from me, and I am from him, and he is the ally of every believer after me.\"",
      "chain": [
        "30367",
        "20532",
        "11319",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف بن عبد الله، قال صلى علي بن أبي طالب فكان يكبر في كل خفض ورفع يتم التكبير ‏.‏ فقال عمران بن حصين لقد ذكرني هذا صلاة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Mutarrif bin 'Abdullah said:                     \"Ali bin Abi Talib prayed, and he said the takbir every time he went down and came up, in all movements of the prayer. 'Imran bin Husain said: 'This reminds me of the prayer of the Messenger of Allah (ﷺ).'\"",
      "chain": [
        "30153",
        "20031",
        "20022",
        "11300",
        "11305"
      ]
    },
    {
      "hadith_no": "2380",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عمرو بن هشام، قال حدثنا مخلد، عن الأوزاعي، عن قتادة، عن مطرف بن عبد الله بن الشخير، أخبرني أبي أنه، سمع رسول الله صلى الله عليه وسلم وذكر عنده رجل يصوم الدهر قال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mutarrif bin 'Abdullah bin 'Abdullah bin Ash-Shikhkhir:                     \"My father told me that he heard the Messenger of Allah say, when mention was made in his presence of a man who fasted for the rest of his life: 'He neither fasted nor broke his fast.\"' 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "38434",
        "20462",
        "20024",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "2381",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا أبو داود، قال حدثنا شعبة، عن قتادة، قال سمعت مطرف بن عبد الله بن الشخير، يحدث عن أبيه، أن رسول الله صلى الله عليه وسلم قال في صوم الدهر ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " Mutarrif bin 'Abdullah bin Ash-Shikhkhir narrated from his father that:                     the Messenger of Allah said, concerning one who fasted for the rest of his life: \"He neither fasted nor broke his fast.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "2728",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو داود، قال حدثنا مسلم بن إبراهيم، قال حدثنا إسماعيل بن مسلم، قال حدثنا محمد بن واسع، عن مطرف بن عبد الله، قال قال لي عمران بن حصين تمتعنا مع رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن إسماعيل بن مسلم ثلاثة هذا أحدهم لا بأس به وإسماعيل بن مسلم شيخ يروي عن أبي الطفيل لا بأس به وإسماعيل بن مسلم يروي عن الزهري والحسن متروك الحديث ‏.‏",
      "text_en": " It was narrated that Mutarrif bin 'Abdullah said:                     \"Imran bnin Husain said to me: 'We performed Tamattu' with the Messenger of",
      "chain": [
        "30002",
        "20285",
        "22025",
        "11305"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن محمد بن إسحاق، عن سعيد بن أبي هند، عن مطرف بن عبد الله بن الشخير، قال سمعت عثمان بن أبي العاص، يقول كان آخر ما عهد إلى النبي  صلى الله عليه وسلم  حين أمرني على الطائف قال لي ‏\"‏ يا عثمان تجاوز في الصلاة واقدر الناس بأضعفهم فإن فيهم الكبير والصغير والسقيم والبعيد وذا الحاجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mutarrif bin ‘Abdullah bin Shikhkhir said:                      “Iheard‘Uthman bin Abul-‘As say: “The last thing that the Prophet(ﷺ)enjoined on me when he appointed me governor of Ta’if wasthat hesaid: “O ‘Uthman! Be tolerable in prayer and estimate thepeople basedupon the weakest among them, for among them are theelderly, theyoung, the sick, those who live far from the mosque, andthose whohave pressing needs.”",
      "chain": [
        "30201",
        "20208",
        "11107",
        "11427",
        "11305",
        "3210"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن بشار، حدثنا يزيد بن هارون، وأبو داود قالوا حدثنا شعبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ من صام الأبد فلا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Shikhkhir that his father said:                     “TheProphet (ﷺ) said: ‘Whoever fasts continually, he neither fastsnor breaks his fast.’”",
      "chain": [
        "30201",
        "20665",
        "30160",
        "20472",
        "20547",
        "20020",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "2103",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، عن يزيد الرشك، عن مطرف بن عبد الله بن الشخير، أن عمران بن الحصين، سئل عن رجل، يطلق امرأته ثم يقع بها ولم يشهد على طلاقها ولا على رجعتها ‏.‏ فقال عمران طلقت بغير سنة وراجعت بغير سنة أشهد على طلاقها وعلى رجعتها ‏.‏",
      "text_en": " 'Imran bin Husain:                     was asked about a man who divorced his wife then had intercourse with her, and there were no witnesses to his divorcing her or his taking her back. 'Imran said: \"You have divorced (her) in a manner that is not according to the Sunnah, and you have taken her back in a manner that is not according to the Sunnah. Bring people to witness your divorcing her and taking her back.\"",
      "chain": [
        "30537",
        "20532",
        "11319",
        "11305"
      ]
    },
    {
      "hadith_no": "2549",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا مطرف بن عبد الله، حدثنا مالك، عن داود بن الحصين، عن أبي سفيان، - مولى ابن أبي أحمد - أنه أخبره أنه، سمع أبا سعيد الخدري، يقول نهى رسول الله صلى الله عليه وسلم عن المحاقلة ‏.‏ والمحاقلة استكراء الأرض ‏.‏",
      "text_en": " It was narrated from Abu Sufyan, the freed slave of Ibn Abu Ahmad, that he told him that he heard Abu Sa'eed Al-Khudri say:                     “The Messenger of Allah (ﷺ) forbade Muhaqlah.” (Sahih)Muhaqlah means leasing out land",
      "chain": [
        "11222",
        "11305",
        "20001",
        "11160",
        "38"
      ]
    },
    {
      "hadith_no": "2598",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن حميد الطويل، عن الحسن، عن مطرف بن عبد الله بن الشخير، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ضالة المسلم حرق النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mutarrif bin 'Abdullah bin Shikhkhir that his father said:                     “The Messenger of Allah (ﷺ) said: 'The lost animal of the Muslim may lead to the burning flame of Hell.' ”",
      "chain": [
        "30170",
        "20031",
        "11279",
        "11016",
        "11305",
        "5130"
      ]
    }
  ],
  "total_hadiths": 26
}