{
  "id": "11300",
  "name": "Ghaylan bin Jarir غيلان بن جرير المعولي",
  "full_name": "Ghaylan bin Jarir غيلان بن جرير المعولي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11850",
      "name": "Ziyad bin Ryah زياد بن رياح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10697",
      "name": "'Abdullah bin Ma'bd عبد الله بن معبد الزماني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11693",
      "name": "Safwan bin Mhrz bin Ziyad صفوان بن محرز بن زياد المازني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11399",
      "name": "Musa bin Abi Aa'isha موسى بن أبي عائشة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20551",
      "name": "Shadad bin Sa'id شداد بن سعيد أبو طلحة الراسبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "244",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم فوجدته يستن بسواك بيده يقول ‏\"‏ أع أع ‏\"‏، والسواك في فيه، كأنه يتهوع‏.‏",
      "text_en": " Narrated Abu Burda:                     My father said, \"I came to the Prophet and saw him carrying a Siwak in his hand and cleansing his teeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "529",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا مهدي، عن غيلان، عن أنس، قال ما أعرف شيئا مما كان على عهد النبي صلى الله عليه وسلم‏.‏ قيل الصلاة‏.‏ قال أليس ضيعتم ما ضيعتم فيها‏.‏",
      "text_en": "      Narrated Ghailan:                          Anas said, \"I do not find (now-a-days) things as they were (practiced)     at the time of the Prophet.\" Somebody said \"The prayer (is as it      was.)\" Anas said, \"Have you not done in the prayer what you have      done?",
      "chain": [
        "20040",
        "11307",
        "11300",
        "19"
      ]
    },
    {
      "hadith_no": "786",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف بن عبد الله، قال صليت خلف علي بن أبي طالب  رضى الله عنه  أنا وعمران بن حصين،، فكان إذا سجد كبر، وإذا رفع رأسه كبر، وإذا نهض من الركعتين كبر، فلما قضى الصلاة أخذ بيدي عمران بن حصين فقال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد صلى بنا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif bin `Abdullah:                     `Imran bin Husain and I offered the prayer behind `Ali bin Abi Talib. When `Ali prostrated, he said the Takbir, when he raised his head, he said the Takbir and when he got up for the third rak`a he said the Takbir. On completion of the prayer `Imran took my hand and said, \"This (i.e. `Ali) made me remember the prayer of Muhammad\" Or he said, \"He led us in a prayer like that of Muhammad.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11305"
      ]
    },
    {
      "hadith_no": "826",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف، قال صليت أنا وعمران، صلاة خلف علي بن أبي طالب  رضى الله عنه  فكان إذا سجد كبر، وإذا رفع كبر، وإذا نهض من الركعتين كبر، فلما سلم أخذ عمران بيدي فقال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif:                     `Imran and I prayed behind `Ali bin Abi Talib and he said Takbir on prostrating, on rising and on getting up after the two rak`at (i.e. after the second rak`a). When the prayer was finished, `Imran took me by the hand and said, \"He (`Ali) has prayed the prayer of Muhammad\" (or said, \"He made us remember the prayer of Muhammad).",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "1983",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي، عن غيلان،‏.‏ وحدثنا أبو النعمان، حدثنا مهدي بن ميمون، حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه سأله  أو سأل رجلا وعمران يسمع  فقال ‏\"‏ يا أبا فلان أما صمت سرر هذا الشهر ‏\"‏‏.‏ قال أظنه قال يعني رمضان‏.‏ قال الرجل لا يا رسول الله‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏‏.‏ لم يقل الصلت أظنه يعني رمضان‏.‏ قال أبو عبد الله وقال ثابث عن مطرف عن عمران عن النبي صلى الله عليه وسلم ‏\"‏ من سرر شعبان ‏\"‏‏.‏",
      "text_en": " Narrated Mutarrif from `Imran Ibn Husain:                     That the Prophet asked him (Imran) or asked a man and `Imran was listening, \"O Abu so-and-so! Have you fasted the last days of this month?\" (The narrator thought that he said, \"the month of Ramadan\"). The man replied, \"No, O Allah's Apostle!\" The Prophet said to him, \"When you finish your fasting (of Ramadan) fast two days (in Shawwal).\" Through another series of narrators `Imran said, \"The Prophet said, '(Have you fasted) the last days of Sha'ban?\"",
      "chain": [
        "30140",
        "11307",
        "20283",
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3822",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا مهدي بن ميمون، حدثنا غيلان بن جرير، قال قلت لأنس أرأيت اسم الأنصار كنتم تسمون به، أم سماكم الله قال بل سمانا الله، كنا ندخل على أنس فيحدثنا مناقب الأنصار ومشاهدهم، ويقبل على أو على رجل من الأزد فيقول فعل قومك يوم كذا وكذا كذا وكذا‏.‏",
      "text_en": " Narrated Ghailan bin Jarir:                     I asked Anas, \"Tell me about the name 'Al-Ansar.; Did you call yourselves by it or did Allah call you by it?\" He said, \"Allah called us by it.\" We used to visit Anas (at Basra) and he used to narrate to us the virtues and deeds of the Ansar, and he used to address me or a person from the tribe of Al-Azd and say, \"Your tribe did so-and-so on such-and-such a day.\"",
      "chain": [
        "20040",
        "11307",
        "11300",
        "19"
      ]
    },
    {
      "hadith_no": "3892",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو النعمان، حدثنا مهدي، قال غيلان بن جرير كنا نأتي أنس بن مالك فيحدثنا عن الأنصار،، وكان، يقول لي فعل قومك كذا وكذا يوم كذا وكذا، وفعل قومك كذا وكذا يوم كذا وكذا‏.‏",
      "text_en": " Narrated Ghailan bin Jarir:                     We used to visit Anas bin Malik and he used to talk to us about the Ansar, and used to say to me: \"Your people did so-and-so on such-and-such a day, and your people did so-and-so on such-and-such a day.\"",
      "chain": [
        "20283",
        "11307",
        "11300"
      ]
    },
    {
      "hadith_no": "6571",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو الوليد، حدثنا مهدي، عن غيلان، عن أنس  رضى الله عنه  قال إنكم لتعملون أعمالا هي أدق في أعينكم من الشعر، إن كنا نعدها على عهد النبي صلى الله عليه وسلم الموبقات‏.‏ قال أبو عبد الله يعني بذلك المهلكات‏.‏",
      "text_en": " Narrated Ghailan:                     Anas said \"You people do (bad) deeds (commit sins) which seem in your eyes as tiny (minute) than hair while we used to consider those (very deeds) during the life-time of the Prophet as destructive sins.\"",
      "chain": [
        "20296",
        "11307",
        "11300",
        "19"
      ]
    },
    {
      "hadith_no": "6705",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم في رهط من الأشعريين أستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم عليه ‏\"‏‏.‏ قال ثم لبثنا ما شاء الله أن نلبث، ثم أتي بثلاث ذود غر الذرى فحملنا عليها فلما انطلقنا قلنا أو قال بعضنا والله لا يبارك لنا، أتينا النبي صلى الله عليه وسلم نستحمله، فحلف أن لا يحملنا ثم حملنا، فارجعوا بنا إلى النبي صلى الله عليه وسلم فنذكره، فأتيناه فقال ‏\"‏ ما أنا حملتكم، بل الله حملكم، وإني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها، إلا كفرت عن يميني، وأتيت الذي هو خير ‏\"‏‏.‏ أو ‏\"‏ أتيت الذي هو خير وكفرت عن يميني ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     I went to the Prophet along with a group of Al-Ash`ariyin in order to request him to provide us with mounts. He said, \"By Allah, I will not provide you with mounts and I haven't got anything to mount you on.\" Then we stayed there as long as Allah wished us to stay, and then three very nice looking she-camels were brought to him and he made us ride them. When we left, we, or some of us, said, \"By Allah, we will not be blessed, as we came to the Prophet asking him for mounts, and he swore that he would not give us any mounts but then he did give us. So let us go back to the Prophet and remind him (of his oath).\" When we returned to him (and reminded him of the fact), he said, \"I did not give you mounts, but it is Allah Who gave you. By Allah, Allah willing, if I ever take an oath to do something and then I find something else than the first, I will make expiation for my oath and do the thing which is better (or do something which is better and give the expiation for my oath).",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6803",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد، عن غيلان بن جرير، عن أبي بردة بن أبي موسى، عن أبي موسى الأشعري، قال أتيت رسول الله صلى الله عليه وسلم في رهط من الأشعريين أستحمله فقال ‏\"‏ والله لا أحملكم، ما عندي ما أحملكم ‏\"‏‏.‏ ثم لبثنا ما شاء الله، فأتي بإبل فأمر لنا بثلاثة ذود، فلما انطلقنا قال بعضنا لبعض لا يبارك الله لنا، أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا فحملنا‏.‏ فقال أبو موسى فأتينا النبي صلى الله عليه وسلم فذكرنا ذلك له فقال ‏\"‏ ما أنا حملتكم بل الله حملكم، إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها، إلا كفرت عن يميني، وأتيت الذي هو خير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I went to Allah's Apostle along with a group of people from (the tribe of) Al-Ash`ari, asking for mounts. The Prophet said, \"By Allah, I will not give you anything to ride, and I have nothing to mount you on.\" We stayed there as long as Allah wished, and after that, some camels were brought to the Prophet and he ordered that we be given three camels. When we set out, some of us said to others, \"Allah will not bless us, as we all went to Allah's Apostle asking him for mounts, and although he had sworn that he would not give us mounts, he did give us.\" So we returned to the Prophet; and mentioned that to him. He said, \"I have not provided you with mounts, but Allah has. By Allah, Allah willing, if I ever take an oath, and then see that another is better than the first, I make expiration for my (dissolved) oath, and do what is better and make expiration.\"",
      "chain": [
        "30367",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "254",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا حماد بن زيد، عن غيلان، - وهو ابن جرير المعولي - عن أبي بردة، عن أبي موسى، قال دخلت على النبي صلى الله عليه وسلم وطرف السواك على لسانه ‏.‏",
      "text_en": " Abu Musa reported:                      I went to the Apostle (may peace be upon him) and found one end of the tooth-stick upon his tongue (i. e. he was rinsing his mouth).",
      "chain": [
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن غيلان، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب فكان إذا سجد كبر وإذا رفع رأسه كبر وإذا نهض من الركعتين كبر فلما انصرفنا من الصلاة - قال - أخذ عمران بيدي ثم قال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم ‏.‏ أو قال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Mutarrif reported:                      I and 'Imran b. Husain said prayer behind 'Ali b. Abu, Talib. He recited takbir when he prostrated, and he recited takbir when he raised his head and he recited takbir while rising up (from the sitting position at the end of two rak'ahs). When we had finished our prayer, 'Imran caught hold of my hand and said: He (Hadrat Ali) has led prayer like Muhammad (may peace be upon him) or he said: He in fact recalled to my mind the prayer of Muhammad (may peace be upon him.)",
      "chain": [
        "30399",
        "30503",
        "20022",
        "20031",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "2802",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي، - وهو ابن ميمون - حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين، - رضى الله عنهما - أنصلى الله عليه وسلم قال له أو قال لرجل وهو يسمع ‏\"‏ يا فلان أصمت من سرة هذا الشهر ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) said to him (or he said to another person and he was listening to it):                      O, so and so, did you observe fast in the middle of the month? He said: No. Thereupon he (the Messenger of Allah) said: When you break it, then observe fast for two days.",
      "chain": [
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "2803",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، وقتيبة بن سعيد، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن غيلان، عن عبد الله بن معبد الزماني، عن أبي قتادة، رجل أتى النبي صلى الله عليه وسلم فقال كيف تصوم فغضب رسول الله صلى الله عليه وسلم فلما رأى عمر - رضى الله عنه - غضبه قال رضينا بالله ربا وبالإسلام دينا وبمحمد نبيا نعوذ بالله من غضب الله وغضب رسوله ‏.‏ فجعل عمر - رضى الله عنه - يردد هذا الكلام حتى سكن غضبه فقال عمر يا رسول الله كيف بمن يصوم الدهر كله قال ‏\"‏ لا صام ولا أفطر - أو قال - لم يصم ولم يفطر ‏\"‏ ‏.‏ قال كيف من يصوم يومين ويفطر يوما قال ‏\"‏ ويطيق ذلك أحد ‏\"‏ ‏.‏ قال كيف من يصوم يوما ويفطر يوما قال ‏\"‏ ذاك صوم داود عليه السلام ‏\"‏ ‏.‏ قال كيف من يصوم يوما ويفطر يومين قال ‏\"‏ وددت أني طوقت ذلك ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث من كل شهر ورمضان إلى رمضان فهذا صيام الدهر كله صيام يوم عرفة أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده وصيام يوم عاشوراء أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada reported that a person came to the Apostle of Allah (may peace be upon him) and said:                      How do you observe fast? The Messenger of Allah (may peace be upon him) felt annoyed. 1560 When 'Umar (Allah be pleased with him) noticed his annoyance, he said: We are well pleased with Allah as our Lord, with Islam as our Code of Life, and with Muhammad as our Prophet. We seek refuge with Allah from the anger of Allah and that of His Messenger. 'Umar kept on repeating these words till his (the Prophet's) anger calmed down. Then Umar said: Messenger of Allah. what is the position of one who perpetually observes fasts? Thereupon he said: He neither fasted nor broke it, or he said: He did not fast and he did not break it. He said: What about him who observes fast for two days and breaks one day. There- upon he said: Is anyone capable of doing it? He ('Umar) said: What is the position of him who observes fast for a day and breaks on the other day? Thereupon he (the Holy Prophet) said: That is the fast of David (peace be upon him). He ('Umar) said: What about him who observes fast one day and breaks it for two days. Thereupon he (the Messenger of Allah) said: I wish, I were given strength to observe that. Thereafter he said: The observance of three days' fast every Month and that of Ramadan every year is a perpetual fasting. I seek from Allah that fasting on the day of 'Arafa may atone for the sins of the preceding and the coming years. and I seek from Allah that fasting on the day of Ashura may atone for the sins of the preceding year.",
      "chain": [
        "30399",
        "30367",
        "20022",
        "20031",
        "20022",
        "11300",
        "10697"
      ]
    },
    {
      "hadith_no": "2804",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن غيلان بن جرير، سمع عبد الله بن معبد الزماني، عن أبي قتادة الأنصاري، رضى الله عنه أن رسول الله صلى الله عليه وسلم سئل عن صومه قال فغضب رسول الله صلى الله عليه وسلم فقال عمر رضى الله عنه رضينا بالله ربا وبالإسلام دينا وبمحمد رسولا وببيعتنا بيعة ‏.‏ قال فسئل عن صيام الدهر فقال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏ أو ‏\"‏ ما صام وما أفطر ‏\"‏ ‏.‏ قال فسئل عن صوم يومين وإفطار يوم قال ‏\"‏ ومن يطيق ذلك ‏\"‏ ‏.‏ قال وسئل عن صوم يوم وإفطار يومين قال ‏\"‏ ليت أن الله قوانا لذلك ‏\"‏ ‏.‏ قال وسئل عن صوم يوم وإفطار يوم قال ‏\"‏ ذاك صوم أخي داود عليه السلام ‏\"‏ ‏.‏ قال وسئل عن صوم يوم الاثنين قال ‏\"‏ ذاك يوم ولدت فيه ويوم بعثت أو أنزل على فيه ‏\"‏ ‏.‏ قال فقال ‏\"‏ صوم ثلاثة من كل شهر ورمضان إلى رمضان صوم الدهر ‏\"‏ ‏.‏ قال وسئل عن صوم يوم عرفة فقال ‏\"‏ يكفر السنة الماضية والباقية ‏\"‏ ‏.‏ قال وسئل عن صوم يوم عاشوراء فقال ‏\"‏ يكفر السنة الماضية ‏\"‏ ‏.‏ وفي هذا الحديث من رواية شعبة قال وسئل عن صوم يوم الاثنين والخميس فسكتنا عن ذكر الخميس لما نراه وهما ‏.‏",
      "text_en": " Abu Qatada al-Ansari (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) was asked about his fasting. The Messenger of Allah (may peace be upon him) felt annoyed. Thereupon 'Umar (Allah be pleased with him) said:                      We are pleased with Allah as the Lord, with Islam as our Code of Life, with Muhammad as the Messenger and with our pledge (to you for willing and cheerful submission) as a (sacred) commitment. He was then asked about perpetual fasting, whereupon he said: He neither fasted nor did he break it, or he did not fast and he did not break it. He was then asked about fasting for two days and breaking one day. He (the Holy Prophet) said: And who has strength enough to do it? He was asked about fasting for a day and breaking for two days, whereupon he said: May Allah bestow upon us strength to do it. He was then asked about fasting for a day and breaking on the other, whereupon he said: That is the fasting of my brother David (peace be upon him). He was then asked about fasting on Monday, whereupon he said: It was the day on which I was born. on which I was commissioned with prophethood or revelation was sent to me, (and he further) said: Three days' fasting every month and of the whole of Ramadan every year is a perpetual fast. He was asked about fasting on the day of 'Arafa (9th of Dhu'I-Hijja), whereupon he said: It expiates the sins of the preceding year and the coming year. He was asked about fasting on the day of 'Ashura (10th of Muharram), whereupon be said: It expiates the sins of the preceding year. (Imam Muslim said that in this hadith there is a) narration of Imam Shu'ba that he was asked about fasting on Monday and Thursday, but we (Imam Muslim) did not mention Thursday for we found it as an error (in reporting).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "2806",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان بن هلال، حدثنا أبان العطار، حدثنا غيلان بن جرير، في هذا الإسناد بمثل حديث شعبة غير أنه ذكر فيه الاثنين ولم يذكر الخميس ‏.‏",
      "text_en": " This hadith has been narrated by Ghailan b. Jarir with the same chain of transmitters, but with one variation, that there has been made mention of Monday and not of Thursday.",
      "chain": [
        "30296",
        "20218",
        "20205",
        "11300"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا مهدي بن ميمون، عن غيلان، عن عبد الله بن معبد الزماني، عن أبي قتادة الأنصاري، رضى الله عنه أنرسول الله صلى الله عليه وسلم سئل عن صوم الاثنين فقال ‏\"‏ فيه ولدت وفيه أنزل على ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada Ansari (Allah be pleased with him) reported that Allah's Massenger (may peace be upon him) was asked about fasting on Monday, whereupon he said:                      It is (the day) when I was born and revelation was sent down to me.",
      "chain": [
        "30022",
        "20033",
        "11307",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "4352",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا خلف بن هشام، وقتيبة بن سعيد، ويحيى بن حبيب الحارثي، - واللفظ لخلف - قالوا حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبي موسى، الأشعري قال أتيت النبي صلى الله عليه وسلم في رهط من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ قال فلبثنا ما شاء الله ثم أتي بإبل فأمر لنا بثلاث ذود غر الذرى فلما انطلقنا قلنا - أو قال بعضنا لبعض - لا يبارك الله لنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا ثم حملنا ‏.‏ فأتوه فأخبروه فقال ‏\"‏ ما أنا حملتكم ولكن الله حملكم وإني والله إن شاء الله لا أحلف على يمين ثم أرى خيرا منها إلا كفرت عن يميني وأتيت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported:                      I came to Allah's Apostle (may peace be upon him) along with a group of Ash'arites requesting to give us a mount. He (the Holy Prophet) said: By Allah, I cannot provide you with a mount, and there is nothing with me which I should give you as a ride. He (the narrator) said: We stayed there as long as Allah willed. Then there were brought to him (to the Holy Prophet) camels. He (the Holy Prophet) then ordered to give us three white humped camels, We started and said (or some of us said to the others): Allah will not bless us. We came to Allah's Messenger (may peace be upon him) begging him to provide us with riding camels. He swore that he could not provide us with a mount, but later on he provided us with that. They (some of the Prophet's Companions) came and informed him about this (rankling of theirs), whereupon he said: It was not I who provided you with a mount, but Allah has provided you with that. So far as I am concerned, by Allah, if He so wills, I would not swear, but if, later on, I would see better than it, I (would break the vow) and expiate it and do that which is better.",
      "chain": [
        "30503",
        "30367",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4892",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - حدثنا غيلان بن، جرير عن أبي قيس بن رياح، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من خرج من الطاعة وفارق الجماعة فمات مات ميتة جاهلية ومن قاتل تحت راية عمية يغضب لعصبة أو يدعو إلى عصبة أو ينصر عصبة فقتل فقتلة جاهلية ومن خرج على أمتي يضرب برها وفاجرها ولا يتحاش من مؤمنها ولا يفي لذي عهد عهده فليس مني ولست منه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      One who defected from obedience (to the Amir) and separated from the main body of the Muslims-if he died in that state-would die the death of one belonging to the days of Jahiliyya (i. e. would not die as a Muslim). One who fights under the banner of a people who ate blind (to the cause for which they are fighting. i. e. do not know whether their cause is just or otherwise), who gets flared up with family pride, calls, (people) to fight for their. family honour, and supports his kith and kin (i. e. fignts not for the cause of Allah but for the sake of this family or tribe) -if he is killed (in this fight), he dies as one belonging to the days of Jhiliyya. Whoso attacks my Umma (indiscriminately) killing the righteous and the wicked of them, sparing not (even) those staunch in faith and fulfilling not his promise made with those who have been given a pledge of security-he has nothing to do with me and I have nothing to do with him.",
      "chain": [
        "20656",
        "11272",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "4893",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا أيوب، عن غيلان، بن جرير عن زياد بن رياح القيسي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بنحو حديث جرير وقال ‏\"‏ لا يتحاشى من مؤمنها ‏\"‏ ‏.‏",
      "text_en": " The same tradition has been narrated by the same authority through another chain of transmitters with a slight difference in wording.",
      "chain": [
        "30024",
        "20022",
        "11015",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "4894",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا مهدي بن ميمون، عن غيلان بن جرير، عن زياد بن رياح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خرج من الطاعة وفارق الجماعة ثم مات مات ميتة جاهلية ومن قتل تحت راية عمية يغضب للعصبة ويقاتل للعصبة فليس من أمتي ومن خرج من أمتي على أمتي يضرب برها وفاجرها لا يتحاش من مؤمنها ولا يفي بذي عهدها فليس مني ‏\"‏ ‏.‏",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Who defected from obedience (to the Amir) and separated from the main body of the Muslim-then he died in that state-would die the death of one belonging to the days of Jahillyya. And he who is killed under the banner of a man who is blind (to the cause for which he is fighting), who gets flared up with family pride and fights for his tribe-is not from my Umma, and whoso from my followers attacks my followers (indiscriminately) killing the righteous and the wicked of them, sparing not (even) those staunch in faith and fulfilling not his obligation towards them who have been given a pledge (of security), is not from me (i. e. is not my follower).",
      "chain": [
        "30022",
        "20033",
        "11307",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "7190",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا حرمي بن عمارة، حدثنا شداد أبو طلحة الراسبي، عن غيلان بن جرير، عن أبي بردة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ يجيء يوم القيامة ناس من المسلمين بذنوب أمثال الجبال فيغفرها الله لهم ويضعها على اليهود والنصارى ‏\"‏ ‏.‏ فيما أحسب أنا ‏.‏ قال أبو روح لا أدري ممن الشك ‏.‏ قال أبو بردة فحدثت به عمر بن عبد العزيز فقال أبوك حدثك هذا عن النبي صلى الله عليه وسلم قلت نعم ‏.‏",
      "text_en": " Abu Burda reported Allah's Messenger (may peace be upon him) as saying:                      There would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar b. 'Abd al-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle (may peace be upon him)? I said: Yes.",
      "chain": [
        "30452",
        "20221",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7575",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، وأحمد بن عثمان النوفلي، قالا حدثنا وهب، بن جرير حدثنا أبي قال، سمعت غيلان بن جرير، يحدث عن الشعبي، عن فاطمة بنت، قيس قالت قدم على رسول الله صلى الله عليه وسلم تميم الداري فأخبر رسول الله صلى الله عليه وسلم أنه ركب البحر فتاهت به سفينته فسقط إلى جزيرة فخرج إليها يلتمس الماء فلقي إنسانا يجر شعره ‏.‏ واقتص الحديث وقال فيه ثم قال أما إنه لو قد أذن لي في الخروج قد وطئت البلاد كلها غير طيبة ‏.‏ فأخرجه رسول الله صلى الله عليه وسلم إلى الناس فحدثهم قال ‏\"‏ هذه طيبة وذاك الدجال ‏\"‏ ‏.‏",
      "text_en": " Tamim Dari came to Allah's Messenger (may peace be upon him) and informed Allah's Messenger (may peace be upon him) that he sailed in an ocean and his ship lost direction and thus landed at an island. They moved about in that land in search of water. There they saw a person who had been pulling his hair. The rest of the hadith is the same. And he (Dajjal) said:                      If I were to be permitted to set out I would have covered all the lands except Taiba. Then Allah's Messerger (may peace be upon him) brought (Tamim Dari) before the public and he narrated to them and said: That is Taiba and that is the Dajjal.",
      "chain": [
        "30115",
        "30185",
        "20298",
        "11272",
        "11300",
        "11052",
        "224"
      ]
    },
    {
      "hadith_no": "49",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال مسدد قال أتينا رسول الله صلى الله عليه وسلم نستحمله فرأيته يستاك على لسانه - قال أبو داود وقال سليمان قال دخلت على النبي صلى الله عليه وسلم وهو يستاك وقد وضع السواك على طرف لسانه - وهو يقول ‏\"‏ إه إه ‏\"‏ ‏.‏ يعني يتهوع ‏.‏ قال أبو داود قال مسدد فكان حديثا طويلا اختصرته ‏.‏",
      "text_en": " Narrated Abu Burdah:                     On the authority of his father ( Abu Musa al-Ash'ari), reported (according to the version of Musaddad) : We came to the Apostle of Allaah (sal Allaahu alayhi wa sallam) to provide us with a mount, and found him using the tooth-stick, its one end being at his tongue (i.e. he wsa rinsing his mouth).According to the version of Sulaiman it goes : I entered upon the Prophet (sal Allaahu alayhi wa sallam ) who was using the tooth-stick, and had it placed at one side of his tongue, producing a gurgling sound.Abu Dawud said : Musaddad said that the tradition was a lengthy but he shortened it.",
      "chain": [
        "30175",
        "30584",
        "20022",
        "11300",
        "11901",
        "41",
        "30175"
      ]
    },
    {
      "hadith_no": "835",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن غيلان بن جرير، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب - رضى الله عنه - فكان إذا سجد كبر وإذا ركع كبر وإذا نهض من الركعتين كبر فلما انصرفنا أخذ عمران بيدي وقال لقد صلى هذا قبل أو قال لقد صلى بنا هذا قبل صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Mutarrif said:                      I and ‘Imran b. Husain offered prayer behind ‘All b. AbI Talib(may Allah be pleased with him). When he prostrated, he uttered the takbir (Allah is most great) and when he bowed, he uttered the takbir and when he stood up at the end of two rak’ahs, he uttered the takbir. When we finished our prayer, ‘Imran caught hold of my hand, and said: He has led us in prayer just now like the prayer offered by Muhammed(may peace by upon him).",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن يعلى المحاربي، حدثنا أبي، حدثنا غيلان، عن جعفر بن إياس، عن مجاهد، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ والذين يكنزون الذهب والفضة ‏}‏ قال كبر ذلك على المسلمين فقال عمر - رضى الله عنه أنا أفرج عنكم ‏.‏ فانطلق فقال يا نبي الله إنه كبر على أصحابك هذه الآية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لم يفرض الزكاة إلا ليطيب ما بقي من أموالكم وإنما فرض المواريث لتكون لمن بعدكم ‏\"‏ ‏.‏ فكبر عمر ثم قال له ‏\"‏ ألا أخبرك بخير ما يكنز المرء المرأة الصالحة إذا نظر إليها سرته وإذا أمرها أطاعته وإذا غاب عنها حفظته ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When this verse was revealed: \"And those who hoard gold and silver,\" the Muslims were grieved about it. Umar said: I shall dispel your care. He, therefore, went and said: Prophet of Allah, your Companions were grieved by this verse. The Messenger of Allah (ﷺ) said: Allah has made zakat obligatory simply to purify your remaining property, and He made inheritances obligatory that they might come to those who survive you. Umar then said: Allah is most great. He then said to him: Let me inform you about the best a man hoards; it is a virtuous woman who pleases him when he looks at her, obeys him when he gives her a command, and guards his interests when he is away from her.",
      "chain": [
        "30203",
        "20369",
        "20371",
        "11300",
        "11419",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2127",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا كثير، - يعني ابن عبيد - حدثنا أبو حيوة، عن شعيب، عن غيلان، عن عكرمة، عن ابن عباس، مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by  Ibn 'Abbas through a different chain of narrators.",
      "chain": [
        "38462",
        "20428",
        "11300",
        "11023"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله كيف تصوم فغضب رسول الله صلى الله عليه وسلم من قوله فلما رأى ذلك عمر قال رضينا بالله ربا وبالإسلام دينا وبمحمد نبيا نعوذ بالله من غضب الله ومن غضب رسوله ‏.‏ فلم يزل عمر يرددها حتى سكن غضب رسول الله صلى الله عليه وسلم ‏.‏ فقال يا رسول الله كيف بمن يصوم الدهر كله قال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏ قال مسدد ‏\"‏ لم يصم ولم يفطر أو ما صام ولا أفطر ‏\"‏ ‏.‏ شك غيلان ‏.‏ قال يا رسول الله كيف بمن يصوم يومين ويفطر يوما قال ‏\"‏ أويطيق ذلك أحد ‏\"‏ ‏.‏ قال يا رسول الله فكيف بمن يصوم يوما ويفطر يوما قال ‏\"‏ ذلك صوم داود ‏\"‏ ‏.‏ قال يا رسول الله فكيف بمن يصوم يوما ويفطر يومين قال ‏\"‏ وددت أني طوقت ذلك ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث من كل شهر ورمضان إلى رمضان فهذا صيام الدهر كله وصيام عرفة إني أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده وصوم يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuQatadah:                     A man came to the Prophet (ﷺ) and said: How do you fast, Messenger of Allah? The Messenger of Allah (ﷺ) became angry at what he said.  When Umar observed this (his anger), he said: We are satisfied with Allah as Lord, with Islam as religion, and with Muhammad as Prophet. We seek refuge in Allah from the anger of Allah, and from the anger of His Apostle. Umar continued to repeat these words till his anger cooled down. He then asked: Messenger of Allah, what is the position of one who observes a perpetual fast?  He replied: May he not fast or break his fast.  Musaddad said in his version: He has neither fasted nor broken his fast. The narrator, Ghaylan, doubted the actual wordings.  He asked: What is the position of one who fasts two days and does not fast one day?  He said: Is anyone able to do that?  He asked: What is the position of one who fasts every second day (i.e. fasts one day and does not fasts the next day)?  He (the Prophet) said: This is the fast that David observed.  He asked: Messenger of Allah, what is the position of one who fasts one day and breaks it for two days?  He replied: I wish I were given the power to observe that. Then the Messenger of Allah (ﷺ) said: The observance of three days' fast every month and of one Ramadan to the other (i.e. the fast of Ramadan every year) is (equivalent to) a perpetual fast. I seek from Allah that fasting on the day of Arafah may atone for the sins of the preceding and the coming year, and I seek from Allah that fasting on the day of Ashura' may atone for the sins of the preceding year.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "2426",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا مهدي، حدثنا غيلان، عن عبد الله بن معبد الزماني، عن أبي قتادة، بهذا الحديث زاد قال يا رسول الله أرأيت صوم يوم الاثنين ويوم الخميس قال ‏\"‏ فيه ولدت وفيه أنزل على القرآن ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Qatadah through a different chain of narrators. This version add:                      He said: Messenger of Allah, tell me about keeping fast on Monday and Thursday. He said: On it I was born, and on it the Qur'an was first revealed to me.",
      "chain": [
        "20040",
        "11307",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "3276",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، حدثنا غيلان بن جرير، عن أبي بردة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا كفرت عن يميني، وأتيت الذي هو خير ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ إلا أتيت الذي هو خير وكفرت يميني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Burdah:                     On the authority of his father that the Prophet (ﷺ) said: I swear by Allah that if Allah wills I shall swear on an oath and then consider something else to be better than it without making atonement for my oath and doing the thing that is better. Or he said (according to another version): But doing the thing that is better and making atonement for my oath.",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن أبي بكر بن أبي شيبة، حدثنا يحيى بن يعلى بن الحارث، حدثنا أبي، عن غيلان، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم استنكه ماعزا ‏.‏",
      "text_en": " Buraidah said. :                      The Prophet (ﷺ) smelt the breath of Ma’iz.",
      "chain": [
        "11300",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال ‏\"‏ صيام يوم عرفة إني أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن ‏.‏ وقد استحب أهل العلم صيام يوم عرفة إلا بعرفة ‏.‏",
      "text_en": " Abu Qatadah narrated that :                     the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "752",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال ‏\"‏ صيام يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏ وفي الباب عن علي ومحمد بن صيفي وسلمة بن الأكوع وهند بن أسماء وابن عباس والربيع بنت معوذ بن عفراء وعبد الرحمن بن سلمة الخزاعي عن عمه وعبد الله بن الزبير ذكروا عن رسول الله صلى الله عليه وسلم أنه حث على صيام يوم عاشوراء ‏.‏ قال أبو عيسى لا نعلم في شيء من الروايات أنه قال ‏\"‏ صيام يوم عاشوراء كفارة سنة ‏\"‏ ‏.‏ إلا في حديث أبي قتادة ‏.‏ وبحديث أبي قتادة يقول أحمد وإسحاق ‏.‏",
      "text_en": " Abu Qatadah narrated that :                     the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "767",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد، عن أبي قتادة، قال قيل يا رسول الله كيف بمن صام الدهر قال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏ أو ‏\"‏ لم يصم ولم يفطر ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن عمرو وعبد الله بن الشخير وعمران بن حصين وأبي موسى ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن ‏.‏ وقد كره قوم من أهل العلم صيام الدهر وأجازه قوم آخرون وقالوا إنما يكون صيام الدهر إذا لم يفطر يوم الفطر ويوم الأضحى وأيام التشريق فمن أفطر هذه الأيام فقد خرج من حد الكراهية ولا يكون قد صام الدهر كله ‏.‏ هكذا روي عن مالك بن أنس وهو قول الشافعي ‏.‏ وقال أحمد وإسحاق نحوا من هذا وقالا لا يجب أن يفطر أياما غير هذه الخمسة الأيام التي نهى رسول الله صلى الله عليه وسلم عنها يوم الفطر ويوم الأضحى وأيام التشريق ‏.‏",
      "text_en": " Abu Qatadah said:                     \"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11300",
        "391"
      ]
    },
    {
      "hadith_no": "4318",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد القدوس بن محمد العطار البصري، حدثنا محمد بن كثير العبدي البصري، حدثنا مهدي بن ميمون، حدثني غيلان بن جرير، قال سمعت أنس بن مالك، يقول إن لم نكن من الأزد فلسنا من الناس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas:                     \"If we are not from Al-Azd then we are not from the people.\"",
      "chain": [
        "28531",
        "11307",
        "11300",
        "19"
      ]
    },
    {
      "hadith_no": "3",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عبدة، قال حدثنا حماد بن زيد، قال أخبرنا غيلان بن جرير، عن أبي بردة، عن أبي موسى، قال دخلت على رسول الله صلى الله عليه وسلم وهو يستن وطرف السواك على لسانه وهو يقول ‏\"‏ عأعأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                      \"I came to the Messenger of Allah (ﷺ) when he was using the Siwak, and the end of the Siwak was on his toungue, and he was saying, \"'A','a'.\"",
      "chain": [
        "30423",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1082",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب فكان إذا سجد كبر وإذا رفع رأسه من السجود كبر وإذا نهض من الركعتين كبر فلما قضى صلاته أخذ عمران بيدي فقال لقد ذكرني هذا - قال كلمة يعني - صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Imran bin Husain and I prayed behind Ali bin Abi Talib. When he prostrated he said the Takbir, and when he raised his head from prostration he said the takbir, and when he stood up following two rak'ahs he said the takbir, and when he had finished praying, 'Imran took my hand and said: 'This reminded me of- he said a word meaning- the prayer of Muhammad (ﷺ).'\"",
      "chain": [
        "30459",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف بن عبد الله، قال صلى علي بن أبي طالب فكان يكبر في كل خفض ورفع يتم التكبير ‏.‏ فقال عمران بن حصين لقد ذكرني هذا صلاة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Mutarrif bin 'Abdullah said:                     \"Ali bin Abi Talib prayed, and he said the takbir every time he went down and came up, in all movements of the prayer. 'Imran bin Husain said: 'This reminds me of the prayer of the Messenger of Allah (ﷺ).'\"",
      "chain": [
        "30153",
        "20031",
        "20022",
        "11300",
        "11305"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال أنبأنا إسرائيل، عن موسى، - هو ابن أبي عائشة - عن غيلان، قال خرجت مع أبي قلابة في سفر فقرب طعاما فقلت إني صائم ‏.‏ فقال إن رسول الله صلى الله عليه وسلم خرج في سفر فقرب طعاما فقال لرجل ‏\"‏ ادن فاطعم ‏\"‏ ‏.‏ قال إني صائم ‏.‏ قال ‏\"‏ إن الله وضع عن المسافر نصف الصلاة والصيام في السفر ‏\"‏ ‏.‏ فادن فاطعم فدنوت فطعمت ‏.‏",
      "text_en": " It was narrated that Ghalian said:                     \"I went out with Abu Qilabah on a journey and he brought some food. I said: 'I am fasting.' He said: 'The Messenger of Allah went out on a journey and brought some food, and said to a man: Come and eat. He said: I am fasting. He said: Allah has waived for the traveler half of the prayer and fasting when traveling, so come and eat. So I came close and ate.\"'",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11399",
        "11300"
      ]
    },
    {
      "hadith_no": "2382",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا الحسن بن موسى، قال أنبأنا أبو هلال، قال حدثنا غيلان، - وهو ابن جرير - قال حدثنا عبد الله، - وهو ابن معبد الزماني - عن أبي قتادة، عن عمر، قال كنا مع رسول الله صلى الله عليه وسلم فمررنا برجل فقالوا يا نبي الله هذا لا يفطر منذ كذا وكذا ‏.‏ فقال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"We were with the Messenger of Allah and we passed by a man. They said: 'O Prophet of Allah, this man has not broken his fast for such and such a time.' He said: 'He has neither fasted nor broken his fast.\"' 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "30524",
        "20383",
        "19857",
        "11300",
        "10697",
        "391",
        "3"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن غيلان، أنه سمع عبد الله بن معبد الزماني، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم سئل عن صومه فغضب فقال عمر رضينا بالله ربا وبالإسلام دينا وبمحمد رسولا ‏.‏ وسئل عمن صام الدهر فقال ‏\"‏ لا صام ولا أفطر أو ما صام وما أفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that:                     the Messenger of Allah was asked about his fasting and he got angry. 'Umr said: \"We are content with Allah as our lord, Islam as our religion and Muhammad as or Prophet.\" And he was aksed about someone who fasted for the rest of his life and said: \"He neither fasted nor broke his fast.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "2387",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال عمر يا رسول الله كيف بمن يصوم الدهر كله قال ‏\"‏ لا صام ولا أفطر أو لم يصم ولم يفطر ‏\"‏ ‏.‏ قال يا رسول الله كيف بمن يصوم يومين ويفطر يوما قال ‏\"‏ أويطيق ذلك أحد ‏\"‏ ‏.‏ قال فكيف بمن يصوم يوما ويفطر يوما قال ‏\"‏ ذلك صوم داود عليه السلام ‏\"‏ ‏.‏ قال فكيف بمن يصوم يوما ويفطر يومين قال ‏\"‏ وددت أني أطيق ذلك ‏\"‏ ‏.‏ قال ثم قال ‏\"‏ ثلاث من كل شهر ورمضان إلى رمضان هذا صيام الدهر كله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Qatadah said:                     \"Umar said: 'O Messenger of Allah, what about a person who fasted for an entire lifetime?' He said: 'He neither fasted nor broke his fast for one day?' He said: 'Can anyone do that?' He said: 'What about a person who fasted for one day?' He said: 'That is the fast of Dawud, peace be upon him.' He said: 'What about a person who fasted for one day, and broke his fast for two days?' he said: 'I wish that I could do that.' Then he said: 'Three days of each month, and from Ramadan to Ramadan, this is fasting for an entire lifetime.\"' 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "30367",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "3780",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن غيلان بن جرير، عن أبي بردة، عن أبي موسى الأشعري، قال أتيت رسول الله صلى الله عليه وسلم في رهط من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم ‏\"‏ ‏.‏ ثم لبثنا ما شاء الله فأتي بإبل فأمر لنا بثلاث ذود فلما انطلقنا قال بعضنا لبعض لا يبارك الله لنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا ‏.‏ قال أبو موسى فأتينا النبي صلى الله عليه وسلم فذكرنا ذلك له فقال ‏\"‏ ما أنا حملتكم بل الله حملكم إني والله لا أحلف على يمين فأرى غيرها خيرا منها إلا كفرت عن يميني وأتيت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa Al-Ash'ari said:                      \"I came to the Messenger of Allah with a group of the Ash'ari people and asked him to give us animals to ride. He said: 'By Allah, I cannot give you anything to ride and I have nothing to give you to ride.' We stayed as long as Allah willed, then some camels were brought to him. He ordered that we be given three fine-looking camels. When we left, we said to one another: 'We came to the Messenger of Allah to ask him for animals to ride, and he swore by Allah that he would not give us anything to ride, then he gave us something.'\" Abu Musa said: \"We came to the Prophet and told him about that. He said: 'I did not give you animals to ride, rather Allah gave you them to ride. By Allah, I do not swear an oath and then see something better than it, but I offer expiation for my oath and do that which is better.'\"",
      "chain": [
        "30367",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4114",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا بشر بن هلال الصواف، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن غيلان بن جرير، عن زياد بن رباح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خرج من الطاعة وفارق الجماعة فمات مات ميتة جاهلية ومن خرج على أمتي يضرب برها وفاجرها لا يتحاشى من مؤمنها ولا يفي لذي عهدها فليس مني ومن قاتل تحت راية عمية يدعو إلى عصبية أو يغضب لعصبية فقتل فقتلة جاهلية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Whoever parts from obedience, and splits away from the Jama'ah and dies, then he has died a death of Jahiliyyah. Whoever rebels against my Ummah, killing good and evil people alike, and does not try to avoid killing the believers, and does not pay attention to those who are under a covenant, then he is not of me. Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, and he is killed, then he has died a death of Jahiliyyah.'\"",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "5077",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن مسلم، قال حدثنا يحيى بن يعلى، قال حدثنا به أبي، عن غيلان، عن أبي إسحاق، عن ابن أبي ليلى، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل ما غيرتم به الشمط الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that:                     The Prophet [SAW] said: \"The best things with which you can change gray hair are Henna and Katam.\"",
      "chain": [
        "167",
        "11300",
        "11049",
        "11196",
        "23"
      ]
    },
    {
      "hadith_no": "1784",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، حدثنا غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال عمر بن الخطاب يا رسول الله كيف بمن يصوم يومين ويفطر يوما قال ‏\"‏ ويطيق ذلك أحد ‏\"‏ ‏.‏ قال يا رسول الله كيف بمن يصوم يوما ويفطر يوما قال ‏\"‏ ذلك صوم داود ‏\"‏ ‏.‏ قال كيف بمن يصوم يوما ويفطر يومين قال ‏\"‏ وددت أني طوقت ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Qatadah said:                      “Umar bin Khattab said: ‘OMessenger of Allah! What about a person who fasts two days and doesnot fast one day?’ He said: ‘Is anyone able to do that?’ Hesaid: ‘OMessenger of Allah! What about a person who fasts one dayand not thenext?’ He said: ‘That is the fast of Dawud.’ Hesaid: ‘What about aman who fasts one day and does not fast thenext two days?’ He said:‘I wish that I were given the ability todo that.’”",
      "chain": [
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "1802",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صيام يوم عرفة إني أحتسب على الله أن يكفر السنة التي قبله والتي بعده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ)said:                     “Fasting on the Day of ‘Arafah, I hope from Allah, expiates forthe sins of the year before and the year after.”",
      "chain": [
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "1810",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صيام يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ)said:                     “Fasting the day of ‘Ashura’, I hope, will expiate for the sinsof the previous year.”",
      "chain": [
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "2185",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا غيلان بن جرير، عن أبي بردة، عن أبيه أبي موسى، قال أتيت رسول الله  صلى الله عليه وسلم  في رهط من الأشعريين نستحمله فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ والله ما أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ قال فلبثنا ما شاء الله ثم أتي بإبل فأمر لنا بثلاثة إبل ذود غر الذرى فلما انطلقنا قال بعضنا لبعض أتينا رسول الله  صلى الله عليه وسلم  نستحمله فحلف ألا يحملنا ثم حملنا ارجعوا بنا ‏.‏ فأتيناه فقلنا يا رسول الله إنا أتيناك نستحملك فحلفت أن لا تحملنا ‏.‏ ثم حملتنا فقال ‏\"‏ والله ما أنا حملتكم فإن الله حملكم والله ما أنا حملتكم بل الله حملكم إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا كفرت عن يميني وأتيت الذي هو خير ‏\"‏ ‏.‏ أو قال ‏\"‏ أتيت الذي هو خير وكفرت عن يميني ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Burdah that his father Abu Musa said:                     \"I came to the Messenger of Allah (ﷺ) with a group of Asharites and asked him to give us animals to ride. He said: 'By Allah, I cannot give you anything to ride, and I have nothing to give you to ride.' We stayed as long as Allah willed, then some camels were brought to him. He ordered that we be given three she-camels with fine humps. When we left, we said to one another: 'We came to the Messenger of Allah (ﷺ) to ask him for animals to ride, and he swore by Allah that he would not give us anything to ride, then he gave us something. Let us go back.' So we went to him and we said: 'O Messenger of Allah! We came to you seeking mounts, and you took an oath that you would not give us mounts, then you gave us some mounts.' He said: 'By Allah, I did not give you animals to ride, rather Allah gave you them to ride. I, by Allah, if Allah wills, do not swear and then see something better than it, but I offer expiation for what I swore about, and do that which is better.' Or he said: 'I do that which is better and offer expiation for what I swore about.'\"",
      "chain": [
        "30423",
        "20022",
        "11300",
        "11901"
      ]
    },
    {
      "hadith_no": "4083",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، حدثنا أيوب، عن غيلان بن جرير، عن زياد بن رياح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قاتل تحت راية عمية يدعو إلى عصبية أو يغضب لعصبية فقتلته جاهلية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Whoever fights under a banner of folly, supportingtribalism,or getting angry for the sake of tribalism, he dies in astate ofignorance.”",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11300",
        "13"
      ]
    }
  ],
  "total_hadiths": 50
}