{
  "id": "11303",
  "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
  "full_name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "149",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "24353",
      "name": "'Awn bin Kahmus bin al-Hasan عون بن كهمس بن الحسن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10922",
      "name": "Durayb bin Nufayr, Abu al-Salayl al-Qays ضريب بن نقير أبو السليل القيسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11318",
      "name": "Yazid bin 'Abdullah bin al-Shakhayr يزيد بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "14174",
      "name": "Siyar bin Manzur bin Siyar سيار بن منظور بن سيار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "24353",
      "name": "'Awn bin Kahmus bin al-Hasan عون بن كهمس بن الحسن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20711",
      "name": "Sufyan bin Habib al-Basri سفيان بن حبيب البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20305",
      "name": "Yusuf bin Y'aqub al-Sadusi al-Sal'ai يوسف بن يعقوب أبو يعقوب السلعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "627",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يزيد، قال حدثنا كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال النبي صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة  ثم قال في الثالثة  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     The prophet said, \"There is a prayer between the two Adhans (Adhan and Iqama), there is a prayer between the two Adhans.\" And then while saying it the third time he added, \"For the one who wants to (pray).",
      "chain": [
        "1945",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "4513",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5537",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يوسف بن راشد، حدثنا وكيع، ويزيد بن هارون  واللفظ ليزيد  عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، أنه رأى رجلا يخذف فقال له لا تخذف فإن رسول الله صلى الله عليه وسلم نهى عن الخذف  أو كان يكره الخذف  وقال ‏\"‏ إنه لا يصاد به صيد ولا ينكى به عدو، ولكنها قد تكسر السن وتفقأ العين ‏\"‏‏.‏ ثم رآه بعد ذلك يخذف فقال له أحدثك عن رسول الله صلى الله عليه وسلم أنه نهى عن الخذف‏.‏ أو كره الخذف، وأنت تخذف لا أكلمك كذا وكذا‏.‏",
      "text_en": " Narrated `Abdullah bin Maghaffal:                     that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw stones, for Allah's Apostle has forbidden throwing stones, or e used to dislike it.\" `Abdullah added: Throwing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or gouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I tell you that Allah's Apostle has forbidden or disliked the throwing the stones (in such a way), yet you are throwing stones! I shall not talk to you for such-and-such a period.\"",
      "chain": [
        "30224",
        "20032",
        "20472",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو خيثمة، زهير بن حرب حدثنا وكيع، عن كهمس، عن عبد الله بن بريدة، عن يحيى بن يعمر، ح وحدثنا عبيد الله بن معاذ العنبري، - وهذا حديثه - حدثنا أبي، حدثنا كهمس، عن ابن بريدة، عن يحيى بن يعمر، قال كان أول من قال في القدر بالبصرة معبد الجهني فانطلقت أنا وحميد بن عبد الرحمن الحميري حاجين أو معتمرين فقلنا لو لقينا أحدا من أصحاب رسول الله صلى الله عليه وسلم فسألناه عما يقول هؤلاء في القدر فوفق لنا عبد الله بن عمر بن الخطاب داخلا المسجد فاكتنفته أنا وصاحبي أحدنا عن يمينه والآخر عن شماله فظننت أن صاحبي سيكل الكلام إلى فقلت أبا عبد الرحمن إنه قد ظهر قبلنا ناس يقرءون القرآن ويتقفرون العلم - وذكر من شأنهم - وأنهم يزعمون أن لا قدر وأن الأمر أنف ‏.‏ قال فإذا لقيت أولئك فأخبرهم أني بريء منهم وأنهم برآء مني والذي يحلف به عبد الله بن عمر لو أن لأحدهم مثل أحد ذهبا فأنفقه ما قبل الله منه حتى يؤمن بالقدر ثم قال حدثني أبي عمر بن الخطاب قال بينما نحن عند رسول الله صلى الله عليه وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال يا محمد أخبرني عن الإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ‏.‏ قال صدقت ‏.‏ قال فعجبنا له يسأله ويصدقه ‏.‏ قال فأخبرني عن الإيمان ‏.‏ قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فأخبرني عن الإحسان ‏.‏ قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال فأخبرني عن الساعة ‏.‏ قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فأخبرني عن أمارتها ‏.‏ قال ‏\"‏ أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال ثم انطلق فلبثت مليا ثم قال لي ‏\"‏ يا عمر أتدري من السائل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه جبريل أتاكم يعلمكم دينكم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Yahya b. Ya'mur that the first man who discussed about Qadr (Divine Decree) in Basra was Ma'bad al-Juhani. I along with Humaid b. 'Abdur-Rahman Himyari set out for prilgrimage or for 'Umrah and said:                      Should it so happen that we come into contact with one of the Companions of the Messenger of Allah (peace be upon him) we shall ask him a bout what is talked about Taqdir (Division Decree). Accidentally we came across Abdullah ibn Umar ibn al-Khattab, while he was entering the mosque. My companion and I surrounded him. One of us (stood) on his right and the other stood on his left. I expected that my companion would authorize me to speak. I therefore said: Abu Abdur Rahman! there have appeared some people in our land who recite the Holy Qur'an and pursue knowledge. And then after talking about their affairs, added: They (such people) claim that there is no such thing as Divine Decree and events are not predestined. He (Abdullah ibn Umar) said: When you happen to meet such people tell them that I have nothing to do with them and they have nothing to do with me. And verily they are in no way responsible for my (belief). Abdullah ibn Umar swore by Him (the Lord) (and said): If any one of them (who does not believe in the Divine Decree) had with him gold equal to the bulk of (the mountain) Uhud and then, it (in the way of Allah), Allah would not accept it unless he affirmed his faith in Divine Decree. He further said: My father, Umar ibn al-Khattab, told me: One day we were sitting in the company of Allah's Apostle (peace be upon him) when there appeared before us a man dressed in pure white clothes, his hair extraordinarily black. There were no signs of travel on him. None amongst us recognized him. At last he sat with the Apostle (peace be upon him) He knelt before him placed his palms on his thighs and said: Muhammad, inform me about al-Islam. The Messenger of Allah (peace be upon him) said: Al-Islam implies that you testify that there is no god but Allah and that Muhammad is the messenger of Allah, and you establish prayer, pay Zakat, observe the fast of Ramadan, and perform pilgrimage to the (House) if you are solvent enough (to bear the expense of) the journey. He (the inquirer) said: You have told the truth. He (Umar ibn al-Khattab) said: It amazed us that he would put the question and then he would himself verify the truth. He (the inquirer) said: Inform me about Iman (faith). He (the Holy Prophet) replied: That you affirm your faith in Allah, in His angels, in His Books, in His Apostles, in the Day of Judgment, and you affirm your faith in the Divine Decree about good and evil. He (the inquirer) said: You have told the truth. He (the inquirer) again said: Inform me about al-Ihsan (performance of good deeds). He (the Holy Prophet) said: That you worship Allah as if you are seeing Him, for though you don't see Him, He, verily, sees you. He (the enquirer) again said: Inform me about the hour (of the Doom). He (the Holy Prophet) remarked: One who is asked knows no more than the one who is inquiring (about it). He (the inquirer) said: Tell me some of its indications. He (the Holy Prophet) said: That the slave-girl will give birth to her mistress and master, that you will find barefooted, destitute goat-herds vying with one another in the construction of magnificent buildings. He (the narrator, Umar ibn al-Khattab) said: Then he (the inquirer) went on his way but I stayed with him (the Holy Prophet) for a long while. He then, said to me: Umar, do you know who this inquirer was? I replied: Allah and His Apostle knows best. He (the Holy Prophet) remarked: He was Gabriel (the angel). He came to you in order to instruct you in matters of religion.",
      "chain": [
        "30022",
        "20032",
        "11303",
        "11432",
        "11316",
        "11303",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا كهمس، عن يزيد بن عبد الله بن الشخير، عن أبيه، قال صليت مع رسول الله صلى الله عليه وسلم فرأيته تنخع فدلكها بنعله ‏.‏",
      "text_en": " Abdullah b. Shakhkhir reported on the authority of his father that he said:                      I said prayer with the Messenger of Allah (may peace be upon him) and saw him spitting and rubbing it off with his shoe.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11318",
        "5130"
      ]
    },
    {
      "hadith_no": "1552",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت كهمسا، يحدث عن أبي نضرة، عن جابر بن عبد الله، قال أراد بنو سلمة أن يتحولوا، إلى قرب المسجد ‏.‏ - قال - والبقاع خالية فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم ‏\"‏ ‏.‏ فقالوا ما كان يسرنا أنا كنا تحولنا ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Banu Salama decided to shift near the mosque (as there were) some plots vacant. This (news) reached the Apostle of Allah (may peace be upon him), whereupon he said:                      O people of the Salama tribe, you better stay in your houses (where you are living), for your footsteps are recorded They said. We could not be more delighted even by shifting (near the mosque) as we were delighted (on hearing these words from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "20288",
        "11303",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "1694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس بن الحسن القيسي، عن عبد الله بن شقيق، قال قلت لعائشة أكان النبي صلى الله عليه وسلم يصلي الضحى قالت لا إلا أن يجيء من مغيبه",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I aksed 'A'isha whether the Apostle of Allah (may peace be upon him) used to observe the forenoon prayer. She said: No, except when he came back from a journey.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة ‏.‏ فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) died (in this very state) that he observed most of his (Nafl) prayers in a sitting position.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1977",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ووكيع، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة - قالها ثلاثا قال في الثالثة - لمن شاء ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Abdullah b. Mughaffal by another chain of transmitters, but with this variation that he (the Holy Prophet) said at the fourth time:                     \" He who wishes (may do to).\"",
      "chain": [
        "30201",
        "20318",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن عبد الله بن شقيق، قال قلت لعائشة - رضى الله عنها - أكان رسول الله صلى الله عليه وسلم يصوم شهرا كله قالت ما علمته صام شهرا كله إلا رمضان ولا أفطره كله حتى يصوم منه حتى مضى لسبيله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I said to 'A'isha (Allah be pleased with her): Did the Messenger of Allah (may peace be upon him) observe fast during a month? She said, I do not know of any month in which he fasted throughout except Ramedan and (the month) in which he did not fast at all till he ran the course of his life. May peace be upon him.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "4799",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، أنه قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة ‏.‏",
      "text_en": " It has been narrated by Buraida who heard it from his father that he joined the Messenger of Allah (may peace be upon him) in sixteen military campaigns",
      "chain": [
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا كهمس، عن ابن بريدة، قال رأى عبد الله بن المغفل رجلا من أصحابه يخذف فقال له لا تخذف فإن رسول الله صلى الله عليه وسلم كان يكره - أو قال - ينهى عن الخذف فإنه لا يصطاد به الصيد ولا ينكأ به العدو ولكنه يكسر السن ويفقأ العين ‏.‏ ثم رآه بعد ذلك يخذف فقال له أخبرك أن رسول الله صلى الله عليه وسلم كان يكره أو ينهى عن الخذف ثم أراك تخذف لا أكلمك كلمة كذا وكذا ‏.‏",
      "text_en": " Ibn Buraida reported that Abdullah b. al-Mughaffal saw a person from amongst his companions throwing small pebbles, whereupon he said:                      Don't throw pebbles. for Allah's Messenger (may peace be upon him) did not like it, or he forbade flinging of pebbles since neither the game is taken thereby, nor an enemy defeated. but it may break a tooth or put out an eye. He, afterwards, again saw him flinging pebbles, and said to him: I inform you that the Messenger of Allah (may peace be upon him) did not approve or he forbade flinging of pebbles, but if I see you again flinging pebbles. I will not speak with you.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11432"
      ]
    },
    {
      "hadith_no": "5163",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني أبو داود، سليمان بن معبد حدثنا عثمان بن عمر، أخبرنا كهمس، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Kahmas.",
      "chain": [
        "30545",
        "20262",
        "11303"
      ]
    },
    {
      "hadith_no": "956",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا كهمس بن الحسن، عن عبد الله بن شقيق، قال سألت عائشة أكان رسول الله صلى الله عليه وسلم يقرأ السورة في ركعة قالت المفصل ‏.‏ قال قلت فكان يصلي قاعدا قالت حين حطمه الناس ‏.‏",
      "text_en": " ‘Abd Allah b. Shaqiq said:                      I asked ‘A’ishah whether the Messenger of Allah (ﷺ) recited a whole Surah (of the Quran) in one Rak’ah of the prayer. She replied : (He recited from among) the Mufassal surahs. I asked: Did he pray (at night) sitting? She replied : (he prayed sitting) when the people made him old.",
      "chain": [
        "30203",
        "20472",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "1669",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا كهمس، عن سيار بن منظور، - رجل من بني فزارة - عن أبيه، عن امرأة، يقال لها بهيسة عن أبيها، قالت استأذن أبي النبي صلى الله عليه وسلم فدخل بينه وبين قميصه فجعل يقبل ويلتزم ثم قال يا رسول الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الماء ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الملح ‏\"‏ ‏.‏ قال يا رسول الله ما الشىء الذي لا يحل منعه قال ‏\"‏ أن تفعل الخير خير لك ‏\"‏ ‏.‏",
      "text_en": " Buhaysah reported on the authority of his father:                      My father sought permission from the Prophet (ﷺ). (When permission was granted and he came near him) he lifted his shirt, and began to kiss him and embrace him (out of love for him). He asked: Messenger of Allah, what is the thing which it is unlawful to refuse? He replied: Water. He again asked: Prophet of Allah, what is the thing which it is unlawful to refuse? He replied: Salt. He again asked: Prophet of Allah, what is the thing which it is unlawful to refuse? He said: To do good is better for you.",
      "chain": [
        "30150",
        "11303",
        "14174",
        "14379"
      ]
    },
    {
      "hadith_no": "3476",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن سيار بن منظور، - رجل من بني فزارة - عن أبيه، عن امرأة، يقال لها بهيسة عن أبيها، قالت استأذن أبي النبي صلى الله عليه وسلم فدخل بينه وبين قميصه فجعل يقبل ويلتزم ثم قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الماء ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الملح ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ أن تفعل الخير خير لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Buhaisah:                     On the authority of her father: My father asked the Prophet (ﷺ) for permission (to kiss his body). (When he was given permission), lifting his shirt he approached his body, and began to kiss and stick to him. He then asked: Prophet of Allah, what is the thing withholding of which is not lawful ? He replied: Water. He asked: Prophet of Allah, what is the thing withholding of which is not lawful ? He replied: Salt. He again asked: Prophet of Allah, what is the thing withholding of which is not lawful ? He said: That you do a good work is better for you.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "14174",
        "14379"
      ]
    },
    {
      "hadith_no": "4695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا كهمس، عن ابن بريدة، عن يحيى بن يعمر، قال كان أول من تكلم في القدر بالبصرة معبد الجهني فانطلقت أنا وحميد بن عبد الرحمن الحميري حاجين أو معتمرين فقلنا لو لقينا أحدا من أصحاب رسول الله صلى الله عليه وسلم فسألناه عما يقول هؤلاء في القدر ‏.‏ فوفق الله لنا عبد الله بن عمر داخلا في المسجد فاكتنفته أنا وصاحبي فظننت أن صاحبي سيكل الكلام إلى فقلت أبا عبد الرحمن إنه قد ظهر قبلنا ناس يقرءون القرآن ويتفقرون العلم يزعمون أن لا قدر والأمر أنف ‏.‏ فقال إذا لقيت أولئك فأخبرهم أني بريء منهم وهم برآء مني والذي يحلف به عبد الله بن عمر لو أن لأحدهم مثل أحد ذهبا فأنفقه ما قبله الله منه حتى يؤمن بالقدر ثم قال حدثني عمر بن الخطاب قال بينا نحن عند رسول الله صلى الله عليه وسلم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا نعرفه حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال يا محمد أخبرني عن الإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فعجبنا له يسأله ويصدقه ‏.‏ قال فأخبرني عن الإيمان ‏.‏ قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فأخبرني عن الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال فأخبرني عن الساعة ‏.‏ قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فأخبرني عن أماراتها ‏.‏ قال ‏\"‏ أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال ثم انطلق فلبثت ثلاثا ثم قال ‏\"‏ يا عمر هل تدري من السائل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه جبريل أتاكم يعلمكم دينكم ‏\"‏ ‏.‏",
      "text_en": " Yahya b. Ya’mur said :                      The first to speak on Divine decree in al-Basrah was Ma’bad al Juhani. I and Humaid b.’Abd al-Rahman al-Himyari proceeded to perform HAJJ or UMRAH. We said : would that we meet any of the Companions of the Messenger of Allah (May peace be upon him) so that we could ask him about what they say with regard to divine decree. So Allah helped us to meet ‘Abd Allah b. Umar who was entering the mosque. So I and my companion surrounded him, and I thought that my companion would entrust me the task of speaking to him. Then I said : Abu ‘Abd al-Rahman, there appeared on our side some people who recite the Quran and are engaged in the hair-splitting of knowledge. They conceive that there is no Divine decree and everything happens freely without predestination. He said : When you meet those people, tell them that I am free from them, and they are free from me. By Him by Whom swears ‘Abd Allah b. ‘Umar, if one of them has gold equivalent to Uhud and he spends it, Allah will not accept it from him until he believes in Divine decree. He then said : ‘Umar b. Khattab transmitted to me a tradition, saying : One day when we were with the Messenger of Allah (May peace be upon him) a man with very white clothing and very black hair came up to us. No mark of travel was visible on him, and we did not recognize him. Sitting down beside the Messenger of Allah (May peace be upon him), leaning his knees against his and placing his hands on his thighs, he said : tell me, Muhammad, about Islam. The Messenger of Allah (May peace be upon him) said : Islam means that you should testify that there is no god but Allah, and Muhammad is Allah’s Apostle, that you should observe prayer, pay ZAKAT, fast during RAMADAN, and perform Hajj to the house (i.e., KABAH), If you have the meant to go. He said : You have spoken the truth. We were surprised at his questioning him and then declaring that he spoke the truth. He said : now tell me about faith. He replied : It means that you should believe in Allah, his angels, his Books, his Apostles and the last day, and that you should believe in the decreeing both of good and evil. He said : you have spoken the truth. He said : now tell me about doing good (ihsan). He replied: it means that you should worship Allah as though you are seeing him; if you are not seeing him, he is seeing you. He said: Now tell me about the hour. He replied : The one who is asked about it is no better informed than the one who is asking. He said : Then tell me about its signs. He replied : That a maidservant should beget her mistress, and that you should see barefooted, naked, poor men and shepherds exalting themselves in buildings. ‘Umar said : He then went away, and I waited for three days, then he said : Do you know who the questioner was, Umar? I replied : Allah and his Apostle know best. He said : He was Gabriel who came to you to teach you your religion.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "185",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم قال ‏\"‏ بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن الزبير ‏.‏ قال أبو عيسى حديث عبد الله بن مغفل حديث حسن صحيح ‏.‏ وقد اختلف أصحاب النبي صلى الله عليه وسلم في الصلاة قبل المغرب فلم ير بعضهم الصلاة قبل المغرب ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم أنهم كانوا يصلون قبل صلاة المغرب ركعتين بين الأذان والإقامة ‏.‏ وقال أحمد وإسحاق إن صلاهما فحسن ‏.‏ وهذا عندهما على الاستحباب ‏.‏",
      "text_en": " Abdullah bin Mughaffal narrated that :                     the Prophet said: \"Between every two calls (to prayer) there is a Salat for whoever wills.\"",
      "chain": [
        "30480",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "2610",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث الخزاعي، أخبرنا وكيع، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن يحيى بن يعمر، قال أول من تكلم في القدر معبد الجهني قال فخرجت أنا وحميد بن عبد الرحمن الحميري حتى أتينا المدينة فقلنا لو لقينا رجلا من أصحاب النبي صلى الله عليه وسلم فسألناه عما أحدث هؤلاء القوم ‏.‏ قال فلقيناه يعني عبد الله بن عمر وهو خارج من المسجد قال فاكتنفته أنا وصاحبي قال فظننت أن صاحبي سيكل الكلام إلى فقلت يا أبا عبد الرحمن إن قوما يقرءون القرآن ويتقفرون العلم ويزعمون أن لا قدر وأن الأمر أنف قال فإذا لقيت أولئك فأخبرهم أني منهم بريء وأنهم مني برآء والذي يحلف به عبد الله لو أن أحدهم أنفق مثل أحد ذهبا ما قبل ذلك منه حتى يؤمن بالقدر خيره وشره ‏.‏ قال ثم أنشأ يحدث فقال قال عمر بن الخطاب كنا عند رسول الله صلى الله عليه وسلم فجاء رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد حتى أتى النبي صلى الله عليه وسلم فألزق ركبته بركبته ثم قال يا محمد ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر والقدر خيره وشره ‏\"‏ ‏.‏ قال فما الإسلام قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا عبده ورسوله وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏ قال فما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال في كل ذلك يقول له صدقت ‏.‏ قال فتعجبنا منه يسأله ويصدقه ‏.‏ قال فمتى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فما أمارتها قال أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة أصحاب الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال عمر فلقيني النبي صلى الله عليه وسلم بعد ذلك بثلاث فقال ‏\"‏ يا عمر هل تدري من السائل ذاك جبريل أتاكم يعلمكم معالم دينكم ‏\"‏ ‏.‏ حدثنا أحمد بن محمد، أخبرنا ابن المبارك، أخبرنا كهمس بن الحسن، بهذا الإسناد نحوه ‏.‏\tحدثنا محمد بن المثنى، حدثنا معاذ بن معاذ، عن كهمس، بهذا الإسناد نحوه بمعناه ‏.‏ وفي الباب عن طلحة بن عبيد الله وأنس بن مالك وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح قد روي من غير وجه نحو هذا عن عمر ‏.‏ وقد روي هذا الحديث عن ابن عمر عن النبي صلى الله عليه وسلم والصحيح هو ابن عمر عن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah bin Buraidah from Yahya bin Ya'mur who said:                     \"The first person to speak about Al-Qadar was Ma'bad Al-Juhani.\" He said: \"Humaid bin Abdur-Rahman Al-Himyari and I went out until we reached Al-Madinah, and we said: 'If we could only meet someone among the companions of the Prophet (ﷺ) so we could ask him about what those people have innovated.\" [He said:] \"So we met him - meaning Abdullah bin 'Umar - while he was leaving the Masjid.\" [He said:] \"My companion and I were on either side of him.\" [He said:] I thought my companion was going to leave the speaking to me so I said: \"O Abu Abdur-Rahman! There is a group of people who recite the Qur'an and seek knowledge, and they claim there is no Al-Qadar, and that the affair is left to chance.' He said: \"Whenever you meet those people, then tell them that I am not of them and they are not of me. By the One Whom Abdullah swears by! If one of them were to spend gold the like of Uhud (mountain) in charity, it would not be accepted from him until he believes in Al-Qadar; the good of it and the bad of it.'\" He said: \"Then he began to narrate, he said: \"'Umar bin Al-Khattab said: \"We were with the Messenger of Allah when a man came with extremely white garments, and extremely black hair. He had no appearance of traveling visible on him, yet none of us recognized him. He came until he reached the Prophet (ﷺ). He put his knees up against his knees, and then said: \"O Muhammad! What is Iman?' He said 'To believe in Allah, His Angels, His, Books, His Messengers, the Day of Judgement, and Al-Qadar, the good of it and the bad of it.' He said: 'Then what is Islam?' He said: 'Testifying to La Ilaha Illallah, and that Muhammad is His servant and Messenger, establishing the Salat, giving the Zakat, performing Hajj to the House, and fasting (the month of) Ramadan.' He said: 'Then what is Ihsan?' He said 'That (is) you worship Allah as if you see Him, and although you do not see Him, He certainly sees you.' He said: 'For all of those he replied to him: 'You have told the truth.'\" He said: \"So we were amazed at him, he would ask, and then tell him that he is telling the truth. He said: 'Then when is the Hour?' He (ﷺ) said: 'The one being asked knows no more than the questioner.' He said: 'Then what are its signs?' He said: 'That the slave woman gives birth to her master, and that the naked, poor, and bare-footed shepherds rival each other in the height of the buildings.'\" 'Umar said: 'Then the Prophet (ﷺ) met me three days after that and said: 'O 'Umar! Do you know who the questioner was? It was Jibril. He came to teach you about the matters of your religion.'\"",
      "chain": [
        "20032",
        "11303",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "3513",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جعفر بن سليمان الضبعي، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عائشة، قالت قلت يا رسول الله أرأيت إن علمت أى ليلة ليلة القدر ما أقول فيها قال ‏\"‏ قولي اللهم إنك عفو كريم تحب العفو فاعف عني ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated:                     “I said: ‘O Messenger of Allah, what is your view if I know when the Night of Al-Qadr is, then what should I say in it?” He said: ‘Say: “O Allah, indeed You are Pardoning, [Generous,] You love pardon, so pardon me (Allahumma Innaka Afuwun [Karimun], Tuhibbul-Afwa Fa’fu Anni.).’”",
      "chain": [
        "30367",
        "20532",
        "11303",
        "11432",
        "53"
      ]
    },
    {
      "hadith_no": "689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                      \"The Messenger of Allah (ﷺ) said: 'Between each two Adhans [1] there is a prayer, between each two Adhans there is a prayer, between each two Adhans there is a prayer, for whoever wants to do it.\"[1]Meaning, between the Adhan and Iqamah.",
      "chain": [
        "30359",
        "20031",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يوسف بن يعقوب، قال حدثنا كهمس، عن ابن بريدة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المؤمن يموت بعرق الجبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from (Ibn Buraidah) that his father said:                     \"I heard the Messenger of Allah say: 'The believer dies with sweat on his forehead.\"'",
      "chain": [
        "30172",
        "20305",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال أنبأنا خالد، - وهو ابن الحارث - عن كهمس، عن عبد الله بن شقيق، قال قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت لا إلا أن يجيء من مغيبه ‏.‏ قلت هل كان رسول الله صلى الله عليه وسلم يصوم شهرا كله قالت لا ما علمت صام شهرا كله إلا رمضان ولا أفطر حتى يصوم منه حتى مضى لسبيله ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     \"I said to Aishah: 'Did the Messenger of Allah offer Duha prayer? She said: \"No, unless he was returning from a journey, I Did the Messenger of Allah fast an entire month?' She said: 'No, I do not remember him fasting any month in full apart from Ramadan, and he did not break his fast for a whole month, rather he would fast some of (each month) until he passed away.\"' '",
      "chain": [
        "34033",
        "20226",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا علي بن غراب، قال حدثنا كهمس بن الحسن، عن عبد الله بن بريدة، عن عائشة، أن فتاة، دخلت عليها فقالت إن أبي زوجني ابن أخيه ليرفع بي خسيسته وأنا كارهة ‏.‏ قالت اجلسي حتى يأتي النبي صلى الله عليه وسلم فجاء رسول الله صلى الله عليه وسلم فأخبرته فأرسل إلى أبيها فدعاه فجعل الأمر إليها فقالت يا رسول الله قد أجزت ما صنع أبي ولكن أردت أن أعلم أللنساء من الأمر شىء",
      "text_en": " It was narrated from 'Aishah:                      \"A girl came to her and said: 'My father married me to his brother's son so that he might raise his own status thereby, and I was unwilling.' She said: 'Sit here until the Prophet comes.' Then the Messenger of Allah came, and I told him (what she had said). He sent word to her father, calling him, and he left the matter up to her. She said: 'O Messenger of Allah, I accept what my father did, but I wanted to know whether women have any say in the matter.'\"",
      "chain": [
        "30249",
        "25197",
        "11303",
        "11432",
        "53"
      ]
    },
    {
      "hadith_no": "4815",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا كهمس، عن عبد الله بن بريدة، عن عبد الله بن مغفل، أنه رأى رجلا يخذف فقال لا تخذف فإن نبي الله صلى الله عليه وسلم كان ينهى عن الخذف أو يكره الخذف ‏.‏ شك كهمس ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that he saw a man throwing pebbles and he said:                     \"Do not throw pebbles, for the Prophet of Allah forbade throwing pebbles,\" or \"he disliked the throwing of pebbles.\" Kahmas (one of the narrators) was not sure.",
      "chain": [
        "38022",
        "20472",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "4990",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا النضر بن شميل، قال أنبأنا كهمس بن الحسن، قال حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، أن عبد الله بن عمر، قال حدثني عمر بن الخطاب، قال بينما نحن عند رسول الله صلى الله عليه وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد حتى جلس إلى رسول الله صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه ثم قال يا محمد أخبرني عن الإسلام قال ‏\"‏ أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ‏\"‏ ‏.‏ قال صدقت ‏.‏ فعجبنا إليه يسأله ويصدقه ثم قال أخبرني عن الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر والقدر كله خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فأخبرني عن الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال فأخبرني عن الساعة قال ‏\"‏ ما المسئول عنها بأعلم بها من السائل ‏\"‏ ‏.‏ قال فأخبرني عن أماراتها قال ‏\"‏ أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال عمر فلبثت ثلاثا ثم قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عمر هل تدري من السائل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه جبريل عليه السلام أتاكم ليعلمكم أمر دينكم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Umar said:                     \"Umar bin Al-Khattab told me: 'While we were with the Messenger of Allah [SAW] one day, a man appeared before us whose clothes were exceedingly white and whose hair was exceedingly black. We could see no signs of travel on him, but none of us knew him. He came and sat before the Messenger of Allah [SAW], putting his knees against his, and placing his hands on his thighs, then he said: \"O Muhammad, tell me about Islam.\" He said: \"It is to bear witness that there is none worthy of worship except Allah [SWT] and that Muhammad [SAW] is the Messenger of Allah, to establish the Salah, to give Zakah, to fast Ramadan, and to perform Hajj to the House if you are able to bear the journey.\" He said: \"You have spoken the truth.\" And we were amazed by his asking him, and then saying, \"You have spoken the truth\". Then he said: \"Tell me about Faith.\" He said: \"It is to believe in Allah [SWT] , His Angels, His Books, His Messengers, the Last Day, and in the Divine Decree, its good and its bad.\" He said: \"You have spoken the truth.\" He said: \"Tell me about Al-Ihsan.\" He said: \"It is to worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.\" He said: \"Tell me about the Hour.\" He said: \"The one who is asked about it does not know more about it than the one who is asking.\" He said: \"Then tell me about its signs.\" He said: \"When a slave woman gives birth to her mistress, when you see the barefoot, naked, destitute shepherds competing in making tall buildings.'\" 'Umar said: 'Three (days) passed, then the Messenger of Allah [SAW] said to me: \"O 'Umar, do you know who the questioner was?\" I said: \"Allah and His Messenger know best.\" He said: \"That was Jibril, peace be upon him, who came to you to teach you your religion.\"",
      "chain": [
        "30123",
        "20291",
        "11303",
        "11432",
        "11316",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "5058",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن كهمس، عن عبد الله بن شقيق، قال كان رجل من أصحاب النبي صلى الله عليه وسلم عاملا بمصر فأتاه رجل من أصحابه فإذا هو شعث الرأس مشعان قال ما لي أراك مشعانا وأنت أمير قال كان نبي الله صلى الله عليه وسلم ينهانا عن الإرفاه ‏.‏ قلنا وما الإرفاه قال الترجل كل يوم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     \"One of the Companions of the Prophet [SAW] was a governor in Egypt, and one of his companions came to him and found him with unkempt, wild hair. He said: 'How come I see you with wild hair when you are a governor?' He said: 'The Prophet of Allah [SAW] forbade us from Al-Irfah,' and we said: 'What is Al-Irfah?' He said: 'To comb your hair every day.'\"",
      "chain": [
        "34033",
        "20226",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "5082",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت كهمسا، يحدث عن عبد الله بن بريدة، أنه بلغه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that:                     He heard that the Messenger of Allah [SAW] said: \"The best things with which you can change gray hair are Henna and Katam.\"",
      "chain": [
        "30449",
        "20288",
        "11303",
        "11432"
      ]
    },
    {
      "hadith_no": "66",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن يحيى بن يعمر، عن ابن عمر، عن عمر، قال كنا جلوسا عند النبي  صلى الله عليه وسلم  فجاء رجل شديد بياض الثياب شديد سواد شعر الرأس لا يرى عليه أثر السفر ولا يعرفه منا أحد ‏.‏ قال فجلس إلى النبي  صلى الله عليه وسلم  فأسند ركبته إلى ركبته ووضع يديه على فخذيه ‏.‏ ثم قال يا محمد ما الإسلام قال ‏\"‏ شهادة أن لا إله إلا الله وأني رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وحج البيت ‏\"‏ ‏.‏ قال صدقت ‏.‏ فعجبنا منه يسأله ويصدقه ‏.‏ ثم قال يا محمد ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته ورسله وكتبه واليوم الآخر والقدر خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ فعجبنا منه يسأله ويصدقه ‏.‏ ثم قال يا محمد ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال فمتى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فما أمارتها قال ‏\"‏ أن تلد الأمة ربتها ‏\"‏ ‏.‏ قال وكيع يعني تلد العجم العرب ‏\"‏ وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البناء ‏\"‏ ‏.‏ قال ثم قال فلقيني النبي  صلى الله عليه وسلم  بعد ثلاث فقال ‏\"‏ أتدري من الرجل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ ذاك جبريل أتاكم يعلمكم معالم دينكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"We were sitting with the Prophet (ﷺ) when a man came to him whose clothes were intensely white and whose hair was intensely black; no signs of travel could be seen upon him, and none of us recognized him. He sat down facing the Prophet (ﷺ), with his knees touching his, and he put his hands on his thighs, and said: 'O Muhammad, what is Islam?' He said: 'To testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah, to establish regular prayer, to pay Zakat, to fast in Ramadan, and to perform Hajj to the House (the Ka'bah).' He said: 'You have spoken the truth.' We were amazed by him: He asked a question, then told him that he had spoken the truth. Then he said: 'O Muhammad, what is Iman faith? He said: 'To believe in Allah, His angels, His Messengers, His books, the Last day, and the Divine Decree (Qadar), both the good of it and the bad of it.' He said' You have spoken the truth.' We were amazed by him. He asked a question, then told him that he had spoken the truth. Then he said: 'O Muhammad, what is Ihsan (right action, goodness, sincerity)? He said: 'To worship Allah as if you see Him, for even though you do not see Him, He sees you.' He asked: \"When will the Hour be?' He said: 'The one who is being asked about it does not know more than the one who is asking.' He asked: 'Then what are its signs?' he said: 'When the slave woman gives birth to her mistress' (Waki' said: This means when non-Arabs will give birth to Arabs\")  'and when you see barefoot, naked, destitute shepherds competing in constructing tall buildings.' The Prophet (ﷺ) met me three days later and asked me: 'Do you know who that man was? I said\" 'Allah and his Messenger know best.' He said: 'That was Jibril, who came to you to teach you your religion.'\"",
      "chain": [
        "38409",
        "20032",
        "11303",
        "11432",
        "11316",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "1217",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ووكيع، عن كهمس، حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال نبي الله  صلى الله عليه وسلم  ‏\"‏ بين كل أذانين صلاة ‏\"‏ ‏.‏ قالها ثلاثا قال في الثالثة ‏\"‏ لمن شاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mughaffal said:                      “The Prophet ofAllah(ﷺ) said: ‘Between every two Adhans there is a prayer.’ Hesaidit three times, and on the third time he said, ‘For those whowish.’”*",
      "chain": [
        "30201",
        "20318",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1947",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هناد بن السري، حدثنا وكيع، عن كهمس بن الحسن، عن ابن بريدة، عن أبيه، قال جاءت فتاة إلى النبي  صلى الله عليه وسلم  فقالت إن أبي زوجني ابن أخيه ليرفع بي خسيسته ‏.‏ قال فجعل الأمر إليها ‏.‏ فقالت قد أجزت ما صنع أبي ولكن أردت أن تعلم النساء أن ليس إلى الآباء من الأمر شىء ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that:                     his father said: “A girl came to the Prophet and said: 'My father married married me to his brother's son so that he might raise his status thereby.' The Prophet gave her the choice, and she said: 'I approve of what my father did, but I wanted to know that their fathers have no right to do that.' ”",
      "chain": [
        "30480",
        "20032",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3850",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عائشة، أنها قالت يا رسول الله أرأيت إن وافقت ليلة القدر ما أدعو قال ‏\"‏ تقولين اللهم إنك عفو تحب العفو فاعف عني ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that she said:                     \"O Messenger of Allah, what do you think I should say in my supplication, if I come upon Laylatul-Qadr?\" He said: \"Say: 'Allahumma innaka 'afuwwun tuhibbul-'afwa, fa'fu 'anni (O Allah, You are Forgiving and love forgiveness, so forgive me).'\"",
      "chain": [
        "38409",
        "20032",
        "11303",
        "11432",
        "53"
      ]
    }
  ],
  "total_hadiths": 32
}