{
  "id": "11308",
  "name": "Muwarraq bin Mashmarij al-Ajli مورق بن المشمرج العجلي",
  "full_name": "Muwarraq bin Mashmarij al-Ajli مورق بن المشمرج العجلي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Ajli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14",
      "name": "Salman Farsi ( سلمان أبو عبد الله الفارسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11693",
      "name": "Safwan bin Mhrz bin Ziyad صفوان بن محرز بن زياد المازني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11579",
      "name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1175",
      "hadith_no": "1175",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن توبة، عن مورق، قال قلت لابن عمر  رضى الله عنهما  أتصلي الضحى قال لا‏.‏ قلت فعمر‏.‏ قال لا‏.‏ قلت فأبو بكر‏.‏ قال لا‏.‏ قلت فالنبي صلى الله عليه وسلم قال لا إخاله‏.‏",
      "text_en": " Narrated Muwarriq:                     I asked Ibn `Umar \"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did `Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr use to pray it?\" He replied in the negative. I again asked, \"Did the Prophet use to pray it?\" Ibn `Umar replied, \"I don't think he did.\"",
      "usc_msa_ref": "271",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11579",
        "11308"
      ]
    },
    {
      "id": "sahih-bukhari-2890",
      "hadith_no": "2890",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، عن إسماعيل بن زكرياء، حدثنا عاصم، عن مورق العجلي، عن أنس  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم أكثرنا ظلا الذي يستظل بكسائه، وأما الذين صاموا فلم يعملوا شيئا، وأما الذين أفطروا فبعثوا الركاب وامتهنوا وعالجوا فقال النبي صلى الله عليه وسلم ‏\"‏ ذهب المفطرون اليوم بالأجر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     We were with the Prophet (on a journey) and the only shade one could have was the shade made by one's own garment. Those who fasted did not do any work and those who did not fast served the camels and brought the water on them and treated the sick and (wounded). So, the Prophet said, \"Today, those who were not fasting took (all) the reward.\"",
      "usc_msa_ref": "140",
      "chain": [
        "30584",
        "20313",
        "11080",
        "11308",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2678",
      "hadith_no": "2678",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، أخبرنا أبو معاوية، عن عاصم، عن مورق، عن أنس، - رضى الله عنه - قال كنا مع النبي صلى الله عليه وسلم في السفر فمنا الصائم ومنا المفطر - قال - فنزلنا منزلا في يوم حار أكثرنا ظلا صاحب الكساء ومنا من يتقي الشمس بيده - قال - فسقط الصوام وقام المفطرون فضربوا الأبنية وسقوا الركاب فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذهب المفطرون اليوم بالأجر ‏\"‏ ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      We were with the Apostle of Allah (may peace be upon him) on a journey. Some of us had been observing the fast and some of us had not been fasting. We got down at a place on a hot day. Most of us had the cloth for shelter. There were also those amongst us who sheltered (themselves against the rays of the) sun with the help of their hands. The observers of the fast fell down (on account of weakness). Those who had not observed it got up and pitched tents and watered the mounts. Thereupon the Messenger of Allah (may peace be upon him) said: The breakers of the fast have taken away the reward today.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11080",
        "11308",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2679",
      "hadith_no": "2679",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو كريب، حدثنا حفص، عن عاصم الأحول، عن مورق، عن أنس، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم في سفر فصام بعض وأفطر بعض فتحزم المفطرون وعملوا وضعف الصوام عن بعض العمل - قال - فقال في ذلك ‏\"‏ ذهب المفطرون اليوم بالأجر ‏\"‏ ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) was journeying (along with his Companions). Some of them had observed the fast whereas the others had broken it. Those who did not fast girded up their loins and worked, but the observers of the fast were too weak to work. Upon this he (the Apostle of Allah) said:                      Today the breakers of the fast have gone with the reward.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "11080",
        "11308",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6421",
      "hadith_no": "6421",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ ليحيى - قال أبو بكر حدثنا وقال، يحيى أخبرنا أبو معاوية، عن عاصم الأحول، عن مورق العجلي، عن عبد، الله بن جعفر قال كان رسول الله صلى الله عليه وسلم إذا قدم من سفر تلقي بصبيان أهل بيته - قال - وإنه قدم من سفر فسبق بي إليه فحملني بين يديه ثم جيء بأحد ابنى فاطمة فأردفه خلفه - قال - فأدخلنا المدينة ثلاثة على دابة ‏.‏",
      "text_en": " Abdullah b. Ja'far reported that when Allah's Messenger (may peace be, upon him) came back from a journey, the children of his family used to accord him welcome. It was in this way that once he came back from a journey and I went to him first of all. He mounted me before him. Then there came one of the two sons of Fatima and he mounted him behind him and this is how we three entered Medina riding on a beast.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20436",
        "20031",
        "20354",
        "11080",
        "11308",
        "108"
      ]
    },
    {
      "id": "sahih-muslim-6422",
      "hadith_no": "6422",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عاصم، حدثني  مورق، حدثني عبد الله بن جعفر، قال كان النبي صلى الله عليه وسلم إذا قدم من سفر تلقي بنا - قال - فتلقي بي وبالحسن أو بالحسين - قال - فحمل أحدنا بين يديه والآخر خلفه حتى دخلنا المدينة ‏.‏",
      "text_en": " Abdullah b. Ja'a'far reported that when Allah's Messenger (may peace be upon him) came back from a journey he met us. Once he met me, Hasan or Husain, and he mounted one of us before him and the other one behind him until we entered Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11080",
        "11308",
        "108"
      ]
    },
    {
      "id": "sunan-abi-daud-570",
      "hadith_no": "570",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن المثنى، أن عمرو بن عاصم، حدثهم قال حدثنا همام، عن قتادة، عن مورق، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة المرأة في بيتها أفضل من صلاتها في حجرتها وصلاتها في مخدعها أفضل من صلاتها في بيتها ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) reported the prophet (ﷺ) as saying; it is more excellent for a woman to pray in her house than in her courtyard, and more excellent for her to pray in her private chamber than in her house.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20267",
        "20297",
        "11019",
        "11308",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2566",
      "hadith_no": "2566",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن عاصم بن سليمان، عن مورق، - يعني العجلي - حدثني عبد الله بن جعفر، قال كان رسول الله صلى الله عليه وسلم إذا قدم من سفر استقبل بنا فأينا استقبل أولا جعله أمامه فاستقبل بي فحملني أمامه ثم استقبل بحسن أو حسين فجعله خلفه فدخلنا المدينة وإنا لكذلك ‏.‏",
      "text_en": " ‘Abd Allah bin Ja’far said “When the Prophet (ﷺ) arrived after a journey, we were taken for his reception. Any of us who met him first he lifted him in front of him. As I was the first to meet him, he lifted me in front of him. Then Hasan or Hussain was brought to him and he set him behind him. We the entered Madeenah and we (were) riding so (three on one beast).”",
      "usc_msa_ref": "",
      "chain": [
        "20405",
        "11080",
        "11308",
        "108"
      ]
    },
    {
      "id": "sunan-abi-daud-5161",
      "hadith_no": "5161",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا جرير، عن منصور، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لاءمكم من مملوكيكم فأطعموه مما تأكلون واكسوه مما تكتسون ومن لم يلائمكم منهم فبيعوه ولا تعذبوا خلق الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: Feed those of your slaves who please you from what you eat and clothe them with what you clothe yourselves, but sell those who do not please you and do not punish Allah's creatures.",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "20028",
        "11067",
        "11028",
        "11308",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1206",
      "hadith_no": "1206",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن مورق، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ المرأة عورة فإذا خرجت استشرفها الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abdullah narrated that The Prophet said:                      “The woman is Awrah, so when she goes out, the Shaitan seeks to tempt her.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20267",
        "20297",
        "11019",
        "11308",
        "20327",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2312",
      "hadith_no": "2312",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن إبراهيم بن المهاجر، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني أرى ما لا ترون وأسمع ما لا تسمعون أطت السماء وحق لها أن تئط ما فيها موضع أربع أصابع إلا وملك واضع جبهته ساجدا لله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا وما تلذذتم بالنساء على الفرش ولخرجتم إلى الصعدات تجأرون إلى الله ‏\"‏ ‏.‏ لوددت أني كنت شجرة تعضد ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة وابن عباس وأنس ‏.‏ قال هذا حديث حسن غريب ‏.‏ ويروى من غير هذا الوجه أن أبا ذر قال لوددت أني كنت شجرة تعضد ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah (s.a.w) said:",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20355",
        "20311",
        "11028",
        "11308",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-2283",
      "hadith_no": "2283",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا أبو معاوية، قال حدثنا عاصم الأحول، عن مورق العجلي، عن أنس بن مالك، قال كنا مع رسول الله صلى الله عليه وسلم في السفر فمنا الصائم ومنا المفطر فنزلنا في يوم حار واتخذنا ظلالا فسقط الصوام وقام المفطرون فسقوا الركاب فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذهب المفطرون اليوم بالأجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"We were with the Messenger of Allah on a journey, and some of us were fasting and some of us were not. We made a stop on a hot day and looked for shade. Those who were fasting fell to the ground, but those who were not fasting got up and watered the animals. The Messenger of Allah said: 'Those who were not fasting today have taken the reward.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20354",
        "11080",
        "11308",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3773-2",
      "hadith_no": "3773",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عاصم، حدثنا مورق العجلي، حدثني عبد الله بن جعفر، قال كان رسول الله  صلى الله عليه وسلم  إذا قدم من سفر تلقي بنا ‏.‏ قال فتلقي بي وبالحسن أو بالحسين ‏.‏ قال فحمل أحدنا بين يديه والآخر خلفه حتى قدمنا المدينة ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Ja'far said:                     \"Whenever the Messenger of Allah(ﷺ) came back from a journey, he would be met by us(children). (One day) he was met by me and Hasan or Husain. He made one of us ride in front of him and the other behind him, until we came to Al-Madinah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11080",
        "11308",
        "108"
      ]
    }
  ],
  "total_hadiths": 13
}