{
  "id": "11313",
  "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
  "full_name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "109",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Sadusi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11609",
      "name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11275",
      "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11454",
      "name": "Abu Hashim al-Rmany أبو هاشم الرماني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10709",
      "name": "'Imran bin Hdyr عمران بن حدير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14399",
      "name": "Nwh bin Rabi'ya al-Ansari نوح بن ربيعة الأنصاري مولاهم أبو مكين",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11711",
      "name": "Amarh bin Abi Hafs'h عمارة بن أبي حفصة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19850",
      "name": "'Abdullah bin Husain al-Azdi عبد الله بن حسين أبو حريز",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1003",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن يونس، قال حدثنا زائدة، عن التيمي، عن أبي مجلز، عن أنس، قال قنت النبي صلى الله عليه وسلم شهرا يدعو على رعل وذكوان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
      "chain": [
        "30184",
        "20320",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "2022",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد الواحد، حدثنا عاصم، عن أبي مجلز، وعكرمة، قال ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هي في العشر، هي في تسع يمضين أو في سبع يبقين ‏\"‏‏.‏ يعني ليلة القدر‏.‏ قال عبد الوهاب عن أيوب‏.‏ وعن خالد عن عكرمة عن ابن عباس التمسوا في أربع وعشرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"The Night of Qadr is in the last ten nights of the month (Ramadan), either on the first nine or in the last (remaining) seven nights (of Ramadan).\" Ibn `Abbas added, \"Search for it on the twenty-fourth (of Ramadan).",
      "chain": [
        "30145",
        "20256",
        "11080",
        "11313",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله الرقاشي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  أنه قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ وقال قيس بن عباد وفيهم أنزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين تبارزوا يوم بدر حمزة وعلي وعبيدة أو أبو عبيدة بن الحارث وشيبة بن ربيعة وعتبة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Mijlaz:                     From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), the Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also said, \"The following Verse was revealed in their connection:-- \"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) Qais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu 'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4015",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  قال نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ في ستة من قريش علي وحمزة وعبيدة بن الحارث وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Dhar:                     The following Holy Verse:-- \"These two opponents (believers & disbelievers) dispute with each other about their Lord,\" (22.19) was revealed concerning six men from Quraish, namely, `Ali, Hamza, 'Ubaida bin Al-Harith; Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20351",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4016",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم الصواف، حدثنا يوسف بن يعقوب  كان ينزل في بني ضبيعة وهو مولى لبني سدوس  حدثنا سليمان التيمي، عن أبي مجلز، عن قيس بن عباد، قال قال علي  رضى الله عنه فينا نزلت هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏",
      "text_en": " Narrated `Ali:                     The following Holy Verse:-- \"These two opponents (believers and disbelievers) dispute with each other about their Lord.\" (22.19) was revealed concerning us.",
      "chain": [
        "30123",
        "20305",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4017",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن جعفر، أخبرنا وكيع، عن سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، سمعت أبا ذر  رضى الله عنه  يقسم لنزلت هؤلاء الآيات في هؤلاء الرهط الستة يوم بدر‏.‏ نحوه‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     I heard Abu Dhar swearing that these Holy Verses were revealed in connection with those six persons on the day of Badr.",
      "chain": [
        "30397",
        "20032",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4018",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس، قال سمعت أبا ذر، يقسم قسما إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏ نزلت في الذين برزوا يوم بدر حمزة وعلي وعبيدة بن الحارث وعتبة وشيبة ابنى ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais:                     I heard Abu Dhar swearing that the following Holy verse:-- \"These two opponents (believers and disbelievers) disputing with each other about their Lord,\" (22.19) was revealed concerning those men who fought on the day of Badr, namely, Hamza, `Ali, Ubaida bin Al-Harith, `Utba and Shaiba----the two sons of Rabi`a-- and Al-Walid bin `Utba.",
      "chain": [
        "20184",
        "20468",
        "11454",
        "11313",
        "11046"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا سليمان التيمي، عن أبي مجلز، عن أنس  رضى الله عنه  قال قنت النبي صلى الله عليه وسلم بعد الركوع شهرا يدعو على رعل وذكوان ويقول ‏\"‏ عصية عصت الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said Al-Qunut after Bowing (i.e. Ar-Ruku') for one month, invoking evil upon (the tribes of) Ril and Dhakwan. He used to say, \"Usaiya disobeyed Allah and His Apostle.\"",
      "chain": [
        "30213",
        "20025",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "4790",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  أنه كان يقسم فيها إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم‏}‏ نزلت في حمزة وصاحبيه، وعتبة وصاحبيه يوم برزوا في يوم بدر رواه سفيان عن أبي هاشم‏.‏ وقال عثمان عن جرير عن منصور عن أبي هاشم عن أبي مجلز قوله‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     Abu Dharr used to take an oath confirming that the Verse: 'These two opponents (believers, and disbelievers) dispute with each other about their Lord.' (22.19) was Revealed in connection with Hamza and his two companions and `Utbah and his two companions on the day when they ease out of the battle of Badr.",
      "chain": [
        "20219",
        "20468",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4838",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الرقاشي، حدثنا معتمر بن سليمان، قال سمعت أبي يقول، حدثنا أبو مجلز، عن أنس بن مالك  رضى الله عنه  قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا القوم، فطعموا ثم جلسوا يتحدثون وإذا هو كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام، وقعد ثلاثة نفر فجاء النبي صلى الله عليه وسلم ليدخل فإذا القوم جلوس ثم إنهم قاموا، فانطلقت فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه فأنزل الله ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle married Zainab bint Jahsh, he invited the people to a meal. They took the meal and remained sitting and talking. Then the Prophet (showed them) as if he is ready to get up, yet they did not get up. When he noticed that (there was no response to his movement), he got up, and the others too, got up except three persons who kept on sitting. The Prophet came back in order to enter his house, but he went away again. Then they left, whereupon I set out and went to the Prophet to tell him that they had departed, so he came and entered his house. I wanted to enter along with him, but he put a screen between me and him. Then Allah revealed: 'O you who believe! Do not enter the houses of the Prophet...' (33.53)",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "6311",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر، قال أبي حدثنا أبو مجلز، عن أنس  رضى الله عنه  قال لما تزوج النبي صلى الله عليه وسلم زينب دخل القوم فطعموا، ثم جلسوا يتحدثون فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام من القوم وقعد بقية القوم، وإن النبي صلى الله عليه وسلم جاء ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا فأخبرت النبي صلى الله عليه وسلم فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet married Zainab, the people came and were offered a meal, and then they sat down (after finishing their meals) and started chatting. The Prophet showed as if he wanted to get up, but they did not get up. When he noticed that, he got up, and some of the people also got up and went away, while some others kept on sitting. When the Prophet returned to enter, he found the people still sitting, but then they got up and left. So I told the Prophet of their departure and he came and went in. I intended to go in but the Prophet put a screen between me and him, for Allah revealed:-- 'O you who believe! Enter not the Prophet's houses..' (33.53)",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "6345",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا الحسن بن عمر، حدثنا معتمر، سمعت أبي يذكر، عن أبي مجلز، عن أنس بن مالك  رضى الله عنه  قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا الناس طعموا ثم جلسوا يتحدثون  قال  فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام معه من الناس، وبقي ثلاثة، وإن النبي صلى الله عليه وسلم جاء ليدخل فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا  قال  فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل فذهبت أدخل، فأرخى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم‏}‏ إلى قوله ‏{‏إن ذلكم كان عند الله عظيما‏}‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle married Zainab bint Jahsh, he invited the people who took their meals and then remained sitting and talking. The Prophet pretended to be ready to get up, but the people did not get up. When he noticed that, he got up, and when he had got up, some of those people got up along with him and there remained three (who kept on sitting). Then the Prophet came back and found those people still sitting. Later on those people got up and went away. So I went to the Prophet and informed him that they had left. The Prophet came, and entered (his house). I wanted to enter(along with him) but he dropped a curtain between me and him. Allah then revealed: 'O you who believe! Do not enter the Prophet's Houses until leave is given... (to His statement)... Verily! That shall be an enormity, in Allah's sight.' (33.53)",
      "chain": [
        "30130",
        "20288",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عبيد الله بن معاذ العنبري، وأبو كريب وإسحاق بن إبراهيم ومحمد بن عبد الأعلى - واللفظ لابن معاذ - حدثنا المعتمر بن سليمان، عن أبيه، عن أبي مجلز، عن أنس بن مالك، قنت رسول الله صلى الله عليه وسلم شهرا بعد الركوع في صلاة الصبح يدعو على رعل وذكوان ويقول ‏\"‏ عصية عصت الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Ri'l, Dhakwan, and said that 'Usayya had disobeyed Allah and His Apostle (may peace be upon him).",
      "chain": [
        "30150",
        "20288",
        "11289",
        "11313"
      ]
    },
    {
      "hadith_no": "1793",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن أبي التياح، قال حدثني أبو مجلز، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      Witr is a rak'ah at the end of the night prayer.",
      "chain": [
        "20656",
        "20258",
        "11317",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "1794",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي مجلز، قال سمعت ابن عمر، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " Abu Mijlaz reported:                      I asked Ibn 'Abbas about the Witr prayer. He said: I heard the Messenger of Allah (may peace be upon him) as saying: It is a rak'ah at the end of the night prayer.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد، حدثنا همام، حدثنا قتادة، عن أبي مجلز، قال سألت ابن عباس عن الوتر، فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ركعة من آخر الليل ‏\"‏ ‏.‏ وسألت ابن عمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      A person called (the attention) of the Messenger of Allah (may peace be upon him) as he was in the mosque, and said: Messenger of Allah, how should I make the rak'ahs of the night prayer an odd number? Upon this the Messenger of Allah (way peace he upon him) said: He who prays (night prayer) he should observe it in pairs, but if he apprehends the rise of morning, he should observe one rak'ah; that would make the number odd (for the rak'ahs) observed by him. This was narrated by Abd Kuraib 'Ubaidullah b. 'Abdullah and Ibn 'Umar did not make mention of it.",
      "chain": [
        "30022",
        "20250",
        "20297",
        "11019",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "3578",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، وعاصم بن النضر التيمي، ومحمد بن عبد الأعلى، كلهم عن معتمر، - واللفظ لابن حبيب - حدثنا معتمر بن سليمان، قال سمعت أبي، حدثنا أبو مجلز، عن أنس بن مالك، قال لما تزوج النبي صلى الله عليه وسلم زينب بنت جحش دعا القوم فطعموا ثم جلسوا يتحدثون - قال - فأخذ كأنه يتهيأ للقيام فلم يقوموا فلما رأى ذلك قام فلما قام قام من قام من القوم ‏.‏ زاد عاصم وابن عبد الأعلى في حديثهما قال فقعد ثلاثة وإن النبي صلى الله عليه وسلم جاء ليدخل فإذا القوم جلوس ثم إنهم قاموا فانطلقوا - قال - فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا - قال - فجاء حتى دخل فذهبت أدخل فألقى الحجاب بيني وبينه - قال - وأنزل الله عز وجل ‏{‏ يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏ إن ذلكم كان عند الله عظيما‏}‏ ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) reported:                      When Allah's Apostle (may peace be upon him) married Zainab bint jahsh, he invited people (to the wedding feast) and they ate food. They then sat there and entered into conversation. He (the Holy Prophet) made a stir as if he was preparing to stand up, but (the persons busy in talking) did not stand up. When he (the Holy Prophet) saw it, he stood up and when he did so, some other persons stood up. 'Asim and Abd al-A'la in their narrations made this addition: Three (persons) sat there, and Allah's Apostle (may peace be upon him) came there to enter (the apartment) but he found the people sitting there. Then they stood up and went away. He said: Then I came and informed Allah's Apostle (may peace be upon him) that they had gone away. He (the Holy Prophet) then came there until he entered (the apartment). I also went and was about to enter, when he hung a curtain between me and him (and it was on this occasion that) Allah, the Exalted and Majestic, revealed this verse:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished to the (words)\" Surely this is serious in the sight of Allah\" (xxxiii. 53).",
      "chain": [
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "4898",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هريم بن عبد الأعلى، حدثنا المعتمر، قال سمعت أبي يحدث، عن أبي، مجلز عن جندب بن عبد الله البجلي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل تحت راية عمية يدعو عصبية أو ينصر عصبية فقتلة جاهلية ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn 'Abdullah al-Bajali that the Messenger of Allah (may peace be upon him) said:                      One who is killed under the banner of a man who is blind (to his just cause), who raises the slogan of family or supports his own tribe, dies the death of one belonging to the days of Jahiliyya.",
      "chain": [
        "20288",
        "11289",
        "11313",
        "4053"
      ]
    },
    {
      "hadith_no": "7747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا عمرو بن زرارة، حدثنا هشيم، عن أبي هاشم، عن أبي مجلز، عن قيس، بن عباد قال سمعت أبا ذر، يقسم قسما إن ‏{‏ هذان خصمان اختصموا في ربهم‏}‏ إنها نزلت في الذين برزوا يوم بدر حمزة وعلي وعبيدة بن الحارث وعتبة وشيبة ابنا ربيعة والوليد بن عتبة ‏.‏",
      "text_en": " Abu Dharr took an oath that this verse:                     \" These two adversaries who dispute about their Lord\" (xxii. 19) was revealed in connection with those who on the Day of Badr came out (of rows to fight against the non-believers and they were) Hamza, 'Ali, 'Ubaida b. Harith (from the side of the Muslims) and 'Utba and Shaiba, both of them the sons of Rabi'a and Walid b. 'Utba (from the side of the non-believers of Mecca).",
      "chain": [
        "30365",
        "20468",
        "11454",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "7748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، جميعا عن سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، قال سمعت أبا ذر، يقسم لنزلت ‏{‏ هذان خصمان‏}‏ بمثل حديث هشيم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Dharr through another chain of transmitters.",
      "chain": [
        "30201",
        "20032",
        "30170",
        "20005",
        "11454",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي ح، وحدثنا موسى بن مروان، حدثنا شعيب، - يعني ابن إسحاق المعنى - عن عمران، عن لاحق، عن بشير بن نهيك، قال قال أبو هريرة لو كنت قدام النبي صلى الله عليه وسلم لرأيت إبطيه ‏.‏ زاد ابن معاذ قال يقول لاحق ألا ترى أنه في الصلاة ولا يستطيع أن يكون قدام رسول الله صلى الله عليه وسلم وزاد موسى يعني إذا كبر رفع يديه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     If I were in front of the Prophet (ﷺ), I would see his armpits. Ibn Mu'adh added that Lahiq said: Do you not see, AbuHurayrah could not stand in front of the Prophet (ﷺ) while he was praying. Musa added: When he uttered the takbir, he raised his hands.",
      "chain": [
        "30150",
        "20286",
        "35154",
        "20239",
        "123",
        "11313",
        "11266"
      ]
    },
    {
      "hadith_no": "807",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا معتمر بن سليمان، ويزيد بن هارون، وهشيم، عن سليمان التيمي، عن أمية، عن أبي مجلز، عن ابن عمر، أن النبي صلى الله عليه وسلم سجد في صلاة الظهر ثم قام فركع فرأينا أنه قرأ تنزيل السجدة ‏.‏ قال ابن عيسى لم يذكر أمية أحد إلا معتمر ‏.‏",
      "text_en": " Ibn ‘Umr said:                      The prophet (ﷺ) prostrated himself in the noon prayer; then he stood up and bowed, and we knew that he recited Tanzil al-sajdah(surah xxxii).Ibn ‘Isa said: No one narrated this tradition to Umayyah except Mu’tamir.",
      "chain": [
        "31167",
        "20288",
        "20472",
        "20468",
        "11289",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "1977",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا خالد بن الحارث، حدثنا شعبة، عن قتادة، قال سمعت أبا مجلز، يقول سألت ابن عباس عن شىء، من أمر الجمار فقال ما أدري أرماها رسول الله صلى الله عليه وسلم بست أو بسبع ‏.‏",
      "text_en": " AbuMijlaz said:                      I asked Ibn Abbas about a thing concerning the throwing of stones at the jamrahs. He said: I do not know whether the Messenger of Allah (ﷺ) threw six or seven pebbles.",
      "chain": [
        "30147",
        "20226",
        "20020",
        "11019",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "4826",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان، حدثنا قتادة، قال حدثني أبو مجلز، عن حذيفة، أن رسول الله صلى الله عليه وسلم لعن من جلس وسط الحلقة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     The Messenger of Allah (ﷺ) cursed the one who sat in the middle of a circle.",
      "chain": [
        "20040",
        "20577",
        "11019",
        "11313",
        "145"
      ]
    },
    {
      "hadith_no": "5229",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب بن الشهيد، عن أبي مجلز، قال خرج معاوية على ابن الزبير وابن عامر فقام ابن عامر وجلس ابن الزبير فقال معاوية لابن عامر اجلس فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أحب أن يمثل له الرجال قياما فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     AbuMijlaz said: Mu'awiyah went out to Ibn az-Zubayr and Ibn Amir. Ibn Amir got up and Ibn az-Zubayr remained sitting. Mu'awiyah said to Ibn Amir: Sit down, for I heard the Messenger of Allah (ﷺ) say: Let him who likes people to stand up before him prepare his place in Hell.",
      "chain": [
        "20040",
        "20022",
        "11275",
        "11313"
      ]
    },
    {
      "hadith_no": "1681",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن رافع، حدثنا يحيى بن إسحاق، وهو السالحاني حدثنا يزيد بن حيان، قال سمعت أبا مجلز، لاحق بن حميد يحدث عن ابن عباس، قال كانت راية رسول الله صلى الله عليه وسلم سوداء ولواؤه أبيض ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas.",
      "chain": [
        "30375",
        "30525",
        "28642",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "2977",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا سويد، أخبرنا عبد الله، أخبرنا شعبة، عن قتادة، عن أبي مجلز، أن رجلا، قعد وسط حلقة فقال حذيفة ملعون على لسان محمد أو لعن الله على لسان محمد صلى الله عليه وسلم - من قعد وسط الحلقة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو مجلز اسمه لاحق بن حميد ‏.‏",
      "text_en": " Narrated Abu Miljaz:                     that a man sat in the middle of a circle so Hudhaifah said: \"Cursed upon the tongue of Muhammad - or - Cursed, by Allah upon the tongue of Muhammad (ﷺ), is he who sits in the middle of a the circle.\"",
      "chain": [
        "20025",
        "20020",
        "11019",
        "11313"
      ]
    },
    {
      "hadith_no": "2979",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا قبيصة، حدثنا سفيان، عن حبيب بن الشهيد، عن أبي مجلز، قال خرج معاوية فقام عبد الله بن الزبير وابن صفوان حين رأوه ‏.‏ فقال اجلسا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سره أن يتمثل له الرجال قياما فليتبوأ مقعده من النار ‏\"‏ ‏.‏ وفي الباب عن أبي أمامة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Miljaz:                     that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"",
      "chain": [
        "30277",
        "20351",
        "20012",
        "11275",
        "11313"
      ]
    },
    {
      "hadith_no": "2980",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا أبو أسامة، عن حبيب بن الشهيد، عن أبي مجلز، عن معاوية، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30480",
        "20318",
        "11275",
        "11313",
        "27"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد، عن أبي هاشم، عن أبي مجلز، عن الحارث بن نوفل، عن عائشة، قالت كنت أفرك الجنابة - وقالت مرة أخرى المني - من ثوب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I used to scrape the Janabah.\" On another occasion she said: \"The semen from the garment of the Messenger of Allah (ﷺ).\"",
      "chain": [
        "30367",
        "20022",
        "11454",
        "11313",
        "53"
      ]
    },
    {
      "hadith_no": "588",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عبيد الله بن معاذ، قال أنبأنا أبي قال، حدثنا عمران بن حدير، قال سألت لاحقا عن الركعتين، قبل غروب الشمس فقال كان عبد الله بن الزبير يصليهما فأرسل إليه معاوية ما هاتان الركعتان عند غروب الشمس فاضطر الحديث إلى أم سلمة فقالت أم سلمة إن رسول الله صلى الله عليه وسلم كان يصلي ركعتين قبل العصر فشغل عنهما فركعهما حين غابت الشمس فلم أره يصليهما قبل ولا بعد ‏.‏",
      "text_en": " 'Imran bin Hudair said:                      \"I asked Lahiq about the two Rak'ahs before sunset. He said: \"Abdullah bin Az-Zubair used to pray them, and Mu'awiyah sent word to him asking: 'What are these two Rak'ahs at sunset?' He had to refer to Umm Salamah, and Umm Salamah said: 'The Messenger of Allah (ﷺ) used to pray two Rak'ahs before 'Asr, then he was distracted and did not pray them, so he prayed them when the sun set, and I never saw him pray them before or after that.'\"",
      "chain": [
        "11524",
        "30150",
        "20286",
        "10709",
        "11313"
      ]
    },
    {
      "hadith_no": "808",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عمر بن علي بن مقدم، قال حدثنا يوسف بن يعقوب، قال أخبرني التيمي، عن أبي مجلز، عن قيس بن عباد، قال بينا أنا في المسجد، في الصف المقدم فجبذني رجل من خلفي جبذة فنحاني وقام مقامي فوالله ما عقلت صلاتي فلما انصرف فإذا هو أبى بن كعب فقال يا فتى لا يسؤك الله إن هذا عهد من النبي صلى الله عليه وسلم إلينا أن نليه ثم استقبل القبلة فقال هلك أهل العقد ورب الكعبة ثلاثا ثم قال والله ما عليهم آسى ولكن آسى على من أضلوا ‏.‏ قلت يا أبا يعقوب ما يعني بأهل العقد قال الأمراء ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                      \"While I was in the Masjid in the first row, a man pulled me from behind and moved me aside, and took my place. By Allah, I could not focus on my prayer, then when he left I saw that it was Ubayy bin Ka'b. He said: '0 boy, may Allah protect you from harm. This is what the Prophet instructed us to do, to stand directly behind him.' Then he (Ubayy) turned to face the Qiblah and said: 'Doomed are Ah1 Al-'Uqd, by the Lord of the Ka'bah! - three times.'Then he said: 'By Allah, I am not sad for them, but I am sad for the people whom they have misled.' I said: '0 Abu Ya'qub, what do you mean by Ah1 Al-'Uqd?' He said: 'The rulers.\"'",
      "chain": [
        "30582",
        "20305",
        "11289",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "1070",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن سليمان التيمي، عن أبي مجلز، عن أنس بن مالك، قال قنت رسول الله صلى الله عليه وسلم شهرا بعد الركوع يدعو على رعل وذكوان وعصية عصت الله ورسوله ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) prayed (saying the) Qunut after bowing for a month, supplicating against Ri'l, Dhakwan and 'Usayyah who had disobeyed Allah and His Messenger.\" (Sahih).",
      "chain": [
        "30123",
        "20028",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا معتمر بن سليمان، عن عمران، عن أبي مجلز، عن بشير بن نهيك، عن أبي هريرة، قال لو كنت بين يدى رسول الله صلى الله عليه وسلم لأبصرت إبطيه ‏.‏ قال أبو مجلز كأنه قال ذلك لأنه في صلاة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"If I were in front of the Messenger of Allah (ﷺ) I would be able to see the whiteness of his armpits.\" (One of the narrators) Abu Mijlaz said: \"It is as if he said that because he was praying.\"",
      "chain": [
        "30448",
        "20288",
        "123",
        "11313",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "1306",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا شريك، عن أبي هاشم الواسطي، عن أبي مجلز، عن قيس بن عباد، قال صلى عمار بن ياسر بالقوم صلاة أخفها فكأنهم أنكروها فقال ألم أتم الركوع والسجود قالوا بلى ‏.‏ قال أما إني دعوت فيها بدعاء كان النبي صلى الله عليه وسلم يدعو به ‏\"‏ اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي وأسألك خشيتك في الغيب والشهادة وكلمة الإخلاص في الرضا والغضب وأسألك نعيما لا ينفد وقرة عين لا تنقطع وأسألك الرضاء بالقضاء وبرد العيش بعد الموت ولذة النظر إلى وجهك والشوق إلى لقائك وأعوذ بك من ضراء مضرة وفتنة مضلة اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                     \"Ammar bin Yasir led the people in prayer and he made the prayer short. It was as if they disliked that, so he said: 'Did I not do bowing and prostration properly?' They said: 'Yes.' He said: 'And I said a supplication that the Prophet (ﷺ) used to say:Allahumma bi 'ilmikal-ghaiba wa qudratika 'alal-khalqi ahini ma 'alimtal-hayata khairan li, wa tawaffani idha 'alimtal-wafata khairan li. Allahumma as'aluka khashyataka fil-ghaibi wash-shahadati wa as'aluka kalimatul-aqua fir-rida'i wal ghadab, wa as'alukal-qasda fil faqr wal-ghina, wa as'aluka na'iman la yanfadu wa as'aluka qurrata ainan la tanqati'u wa as'alukar-rida'i ba'dal-qada'i wa as'aluka bardal 'aishi ba'dal-mawti, wa as'aluka ladhatan-nazari ila wajhika wash-shawqa ila liqa'ika fi fitnatin mudillatin, Allahumma zayyina dizinatil-imani waj'alna hudatan muhtadin (O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know that living is good for me and cause me to die when You know that death is better for me. O Allah, cause me to fear You in secret and in public. I ask You to make me true in speech in times of pleasure and of anger. I ask You to make me moderate in times of wealth and poverty. And I ask You for everlasting delight and joy that will never cease. I ask You to make me pleased with that which You have decreed and for an easy life after death. I ask You for the sweetness of looking upon Your face and a longing to meet You in a manner that does not entail a calamity that will bring about harm or a trial that will cause deviation. O Allah, beautify us with the adornment of faith and make us among those who guide and are rightly guided.\"",
      "chain": [
        "20587",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "1689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا وهب بن جرير، قال حدثنا شعبة، عن أبي التياح، عن أبي مجلز، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated fom Ibn Umar that:                     The Prophet (ﷺ) said: \"Witr is one rak'ah at the end of the night.\"",
      "chain": [
        "11222",
        "20298",
        "20020",
        "11317",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "1690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، ومحمد، قالا حدثنا ثم، ذكر كلمة معناها شعبة عن قتادة، عن أبي مجلز، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Umar that:                     The Prophet (ﷺ) said: \"Witr is one rak'ah at the end of the night.\"",
      "chain": [
        "30160",
        "20031",
        "20278",
        "11019",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "1728",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا أبو النعمان، قال حدثنا حماد بن سلمة، عن عاصم الأحول، عن أبي مجلز، أن أبا موسى، كان بين مكة والمدينة فصلى العشاء ركعتين ثم قام فصلى ركعة أوتر بها فقرأ فيها بمائة آية من النساء ثم قال ما ألوت أن أضع قدمى حيث وضع رسول الله صلى الله عليه وسلم قدميه وأنا أقرأ بما قرأ به رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Abu Mijlaz that:                     Abu Musa was between Makkah and Al-Madinah. He prayed 'Isha with two rak'ahs, then he stood and prayed one rak'ah of witr in which he recited one hundred verses from An-Nisa'. Then he said: \"I tried my best to place my feet where the Messenger of Allah (ﷺ) placed his, and to recite what the Messenger of Allah (ﷺ) recited.\"",
      "chain": [
        "38088",
        "20283",
        "20021",
        "11080",
        "11313",
        "30170"
      ]
    },
    {
      "hadith_no": "1926",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن ابن علية، عن سليمان التيمي، عن أبي مجلز، عن ابن عباس، والحسن بن علي، مرت بهما جنازة فقام أحدهما وقعد الآخر فقال الذي قام أما والله لقد علمت أن رسول الله صلى الله عليه وسلم قد قام قال له الذي جلس لقد علمت أن رسول الله صلى الله عليه وسلم قد جلس ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas and Al-Hasan bin 'Ali that:                     a funeral passed by them and one of them stood and the other sat. The one who stood up said: \"By Allah, I know that the Messnger of Allah stood up.\" The one who was sitting said: \"I know that the Messenger of Allah sat.\"",
      "chain": [
        "20184",
        "20208",
        "11289",
        "11313",
        "17",
        "30"
      ]
    },
    {
      "hadith_no": "3078",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، قال سمعت أبا مجلز، يقول سألت ابن عباس عن شىء، من أمر الجمار فقال ما أدري رماها رسول الله صلى الله عليه وسلم بست أو بسبع ‏.‏",
      "text_en": " It was narrated the Qatadah said:                     \"I heard Abu Mijlaz say: 'I asked Ibn 'Abbas something about the Jimar, and he said: I do not know, the Messenger of Allah stoned it with six or seven.",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11019",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "4115",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، عن عبد الرحمن، قال حدثنا عمران القطان، عن قتادة، عن أبي مجلز، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قاتل تحت راية عمية يقاتل عصبية ويغضب لعصبية فقتلته جاهلية ‏\"‏ ‏.‏ قال أبو عبد الرحمن عمران القطان ليس بالقوي ‏.‏",
      "text_en": " It was narrated that Jundab bin 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, then he has died a death of Jahiliyyah.'\"",
      "chain": [
        "30170",
        "20033",
        "20718",
        "11019",
        "11313",
        "4053"
      ]
    },
    {
      "hadith_no": "5716",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن أبي مجلز، عن عامر بن عبد الله، أنه قال قرأت كتاب عمر بن الخطاب إلى أبي موسى أما بعد فإنها قدمت على عير من الشام تحمل شرابا غليظا أسود كطلاء الإبل وإني سألتهم على كم يطبخونه فأخبروني أنهم يطبخونه على الثلثين ذهب ثلثاه الأخبثان ثلث ببغيه وثلث بريحه فمر من قبلك يشربونه ‏.‏",
      "text_en": " It was narrated that 'Amir bin 'Abdullah said:                     \"I saw the letter of 'Umar bin Al-Khattab to Abu Musa (in which he said): 'A caravan came to me from Ash-Sham carrying a thick black paint like the pitch that is daubed on camels. I asked them how long they cooked it, and they told me that they cooked it until it was reduced by two-third. So the bad two-third had gone, one-third to take away evil and one-third to take away the bad smell. So let those who are with you drink it.\"",
      "chain": [
        "16",
        "11289",
        "11313"
      ]
    },
    {
      "hadith_no": "1231",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم، عن أبي مجلز، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الليل مثنى مثنى والوتر ركعة ‏\"‏ قلت أرأيت إن غلبتني عيني أرأيت إن نمت قال اجعل أرأيت عند ذلك النجم ‏.‏ فرفعت رأسي فإذا السماك ثم أعاد فقال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الليل مثنى مثنى والوتر ركعة قبل الصبح ‏\"‏ ‏.‏",
      "text_en": " AbuMijlaz narrated that Ibn ‘Umar said:                      “The Messenger of Allah(ﷺ) said: ‘Night prayers are to be offered two by two, and Witrisone Rak’ah.’ I said: ‘What do you think if I become drowsyand I wantto sleep?’ He said: ‘Put “what do you think” upthere with that star?(i.e., don’t think about it at all).’ Iraised my head and saw As-Simak.* He repeated that the Messenger ofAllah (ﷺ) said, ‘Nightprayers are to be offered two by two, andWitr is one Rak’ah, beforedawn.’”",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "2925",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن إسحاق الواسطي الناقد، حدثنا يحيى بن إسحاق، عن يزيد بن حيان، سمعت أبا مجلز، يحدث عن ابن عباس، أن راية، رسول الله صلى الله عليه وسلم كانت سوداء ولواؤه أبيض ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the flag of the Messenger ofAllah(ﷺ) was black, and his standard was white.",
      "chain": [
        "30525",
        "28642",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن حكيم، وحفص بن عمرو، قالا حدثنا عبد الرحمن بن مهدي، ح وحدثنا محمد بن إسماعيل، أنبأنا وكيع، قالا حدثنا سفيان، عن أبي هاشم الرماني، - قال أبو عبد الله هو يحيى بن الأسود - عن أبي مجلز، عن قيس بن عباد، قال سمعت أبا ذر، يقسم لنزلت هذه الآيات في هؤلاء الرهط الستة يوم بدر ‏{‏هذان خصمان اختصموا في ربهم‏}‏ إلى قوله‏:‏ ‏{‏ إن الله يفعل ما يريد‏}‏ في حمزة بن عبد المطلب وعلي بن أبي طالب وعبيدة بن الحارث وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عتبة اختصموا في الحجج يوم بدر ‏.‏",
      "text_en": " It wasnarrated that Qais bin ‘Ubaid said:                      “I heard Abu Dharrswearingthat these verses were revealed concerning those six peopleon theDay of Badr: ‘These two opponents (believers and disbelievers)dispute with each other about their Lord.”[22:19] to the words“Verily, Allah does what he wills.’[22:14] (that is) Hamzah bin‘Abdul-Muttalib, ‘Ali bin Abi Talib, ‘Ubaidah bin Al-Harith,‘Utbahbin Rabi’ah, Shaibah bin Rabi’ah and Al-Walid bin‘Utbah. They arguedwith one another on the Day of Badr.”",
      "chain": [
        "34280",
        "20033",
        "34188",
        "20032",
        "20012",
        "11454",
        "30184",
        "11313",
        "11609"
      ]
    }
  ],
  "total_hadiths": 46
}