{
  "id": "11317",
  "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
  "full_name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Daba'i",
      "Basri",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10752",
      "name": "Jabir Bun Nauf, Abu al-Wadak جبر بن نوف أبو الوداك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "27499",
      "name": "Hafs al-Lythy Sm' 'Imran bin Husayn حفص الليثي",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11270",
      "name": "Thmamh bin 'Abdullah ثمامة بن عبد الله بن أنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "28450",
      "name": "'Imran bin Aban bin 'Imran عمران بن أبان بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "14187",
      "name": "Skhr bin Bdr al-Jly صخر بن بدر العجلي البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11309",
      "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11406",
      "name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24032",
      "name": "Bstam bin Muslim bin Nmyr بسطام بن مسلم بن نمير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "69",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، قال حدثني أبو التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسروا ولا تعسروا، وبشروا ولا تنفروا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam).",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "80",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عمران بن ميسرة، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن يرفع العلم، ويثبت الجهل، ويشرب الخمر، ويظهر الزنا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"From among the portents of the Hour are (the following): -1. Religious knowledge will be taken away (by the death of Religious learned men). -2. (Religious) ignorance will prevail. -3. Drinking of Alcoholic drinks (will be very common). -4. There will be prevalence of open illegal sexual intercourse.",
      "chain": [
        "30156",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال أخبرنا أبو التياح، يزيد بن حميد عن أنس، قال كان النبي صلى الله عليه وسلم يصلي قبل أن يبنى المسجد في مرابض الغنم‏.‏",
      "text_en": " Narrated Anas:                     Prior to the construction of the mosque, the Prophet offered the prayers at sheep-folds.",
      "chain": [
        "20404",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "428",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس، قال قدم النبي صلى الله عليه وسلم المدينة فنزل أعلى المدينة، في حى يقال لهم بنو عمرو بن عوف‏.‏ فأقام النبي صلى الله عليه وسلم فيهم أربع عشرة ليلة، ثم أرسل إلى بني النجار فجاءوا متقلدي السيوف، كأني أنظر إلى النبي صلى الله عليه وسلم على راحلته، وأبو بكر ردفه، وملأ بني النجار حوله، حتى ألقى بفناء أبي أيوب، وكان يحب أن يصلي حيث أدركته الصلاة، ويصلي في مرابض الغنم، وأنه أمر ببناء المسجد، فأرسل إلى ملإ من بني النجار فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏‏.‏ قالوا لا والله، لا نطلب ثمنه إلا إلى الله‏.‏ فقال أنس فكان فيه ما أقول لكم، قبور المشركين، وفيه خرب، وفيه نخل، فأمر النبي صلى الله عليه وسلم بقبور المشركين فنبشت، ثم بالخرب فسويت، وبالنخل فقطع، فصفوا النخل قبلة المسجد، وجعلوا عضادتيه الحجارة، وجعلوا ينقلون الصخر، وهم يرتجزون، والنبي صلى الله عليه وسلم معهم وهو يقول ‏\"‏ اللهم لا خير إلا خير الآخره فاغفر للأنصار والمهاجره ‏\"‏",
      "text_en": " Narrated Anas:                     When the Prophet arrived Medina he dismounted at `Awali-i-Medina amongst a tribe called Banu `Amr bin `Auf. He stayed there For fourteen nights. Then he sent for Bani An-Najjar and they came armed with their swords. As if I am looking (just now) as the Prophet was sitting over his Rahila (Mount) with Abu Bakr riding behind him and all Banu An-Najjar around him till he dismounted at the courtyard of Abu Aiyub's house. The Prophet loved to pray wherever the time for the prayer was due even at sheep-folds. Later on he ordered that a mosque should be built and sent for some people of Banu-An-Najjar and said, \"O Banu An-Najjar! Suggest to me the price of this (walled) piece of land of yours.\" They replied, \"No! By Allah! We do not demand its price except from Allah.\" Anas added: There were graves of pagans in it and some of it was unleveled and there were some date-palm trees in it. The Prophet ordered that the graves of the pagans be dug out and the unleveled land be level led and the date-palm trees be cut down . (So all that was done). They aligned these cut date-palm trees towards the Qibla of the mosque (as a wall) and they also built two stone side-walls (of the mosque). His companions brought the stones while reciting some poetic verses. The Prophet was with them and he kept on saying, \"There is no goodness except that of the Hereafter, O Allah! So please forgive the Ansars and the emigrants. \"",
      "chain": [
        "30175",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي التياح، عن أنس، قال كان النبي صلى الله عليه وسلم يصلي في مرابض الغنم، ثم سمعته بعد يقول كان يصلي في مرابض الغنم قبل أن يبنى المسجد‏.‏",
      "text_en": " Narrated Abu Al-Taiyah [??]:                     Anas said, \"The Prophet prayed in the sheep fold.\" Later on I heard him saying, \"He prayed in the sheep folds before the construction of the, mosque.\"",
      "chain": [
        "20193",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "587",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن أبان، قال حدثنا غندر، قال حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، يحدث عن معاوية، قال إنكم لتصلون صلاة، لقد صحبنا رسول الله صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Muawiya:                     You offer a prayer which I did not see being offered by Allah's Apostle when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "11421",
        "27"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، حدثنا شعبة، قال حدثني أبو التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ اسمعوا وأطيعوا، وإن استعمل حبشي كأن رأسه زبيبة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Listen and obey (your chief) even if an Ethiopian whose head is like a raisin were made your chief.\"",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "696",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبان، حدثنا غندر، عن شعبة، عن أبي التياح، أنه سمع أنس بن مالك، قال النبي صلى الله عليه وسلم لأبي ذر ‏\"‏ اسمع وأطع، ولو لحبشي كأن رأسه زبيبة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said to Abu-Dhar, \"Listen and obey (your chief) even if he is an Ethiopian with a head like a raisin.\"",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1901",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن أبي التياح، عن أنس  رضى الله عنه  قدم النبي صلى الله عليه وسلم المدينة فأمر ببناء المسجد فقال ‏\"‏ يا بني النجار ثامنوني ‏\"‏‏.‏ فقالوا لا نطلب ثمنه إلا إلى الله‏.‏ فأمر بقبور المشركين، فنبشت، ثم بالخرب فسويت، وبالنخل فقطع، فصفوا النخل قبلة المسجد‏.‏",
      "text_en": " Narrated Anas:                     The Prophet came to Medina and ordered a mosque to be built and said, \"O Bani Najjar! Suggest to me the price (of your land).\" They said, \"We do not want its price except from Allah\" (i.e. they wished for a reward from Allah for giving up their land freely). So, the Prophet ordered the graves of the pagans to be dug out and the land to be leveled, and the date-palm trees to be cut down. The cut datepalms were fixed in the direction of the Qibla of the mosque.",
      "chain": [
        "30315",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1981",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أبو التياح، قال حدثني أبو عثمان، عن أبي هريرة  رضى الله عنه  قال أوصاني خليلي صلى الله عليه وسلم بثلاث صيام ثلاثة أيام من كل شهر، وركعتى الضحى، وأن أوتر قبل أن أنام‏.‏",
      "text_en": " Narrated Abu Huraira:                     My friend (the Prophet ) advised me to observe three things: (1) to fast three days a month; (2) to pray two rak`at of Duha prayer (forenoon prayer); and (3) to pray witr before sleeping.",
      "chain": [
        "30315",
        "20258",
        "11317",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "2106",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الوارث، عن أبي التياح، عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ يا بني النجار ثامنوني بحائطكم ‏\"‏‏.‏ وفيه خرب ونخل‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"O Bani Najjar! Suggest a price for your garden.\" Part of it was a ruin and it contained some date palms.",
      "chain": [
        "20040",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن أبي التياح، عن أنس  رضى الله عنه  قال أمر النبي صلى الله عليه وسلم ببناء المسجد فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏‏.‏ قالوا لا‏.‏ والله لا نطلب ثمنه إلا إلى الله‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet ordered that the mosque be built, he said, \"O Bani An-Najjar! Suggest to me a price for this garden of yours.\" They replied, \"By Allah! We will demand its price from none but Allah.\"",
      "chain": [
        "30175",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، قال سمعت أبي، حدثنا أبو التياح، قال حدثني أنس بن مالك  رضى الله عنه  لما قدم رسول الله صلى الله عليه وسلم المدينة أمر بالمسجد وقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle came to Medina, he ordered that a mosque be built. He said, \"O Bani An- Najjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price except from Allah.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2779",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن أبي التياح، عن أنس  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ يا بني النجار ثامنوني بحائطكم ‏\"‏‏.‏ قالوا لا نطلب ثمنه إلا إلى الله‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said (at the time of building the Mosque), \"O Ban, An-Najjar! Suggest to me a price for your garden.\" They replied, \"We do not ask its price except from Allah.\"",
      "chain": [
        "30175",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن أبي التياح، عن أنس بن مالك  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البركة في نواصي الخيل ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                      Allah's Apostle () said, \"There is a blessing in the fore-heads of horses.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3647",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا أبو معمر، إسماعيل بن إبراهيم حدثنا أبو أسامة، حدثنا شعبة، عن أبي التياح، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يهلك الناس هذا الحى من قريش ‏\"‏‏.‏ قالوا فما تأمرنا قال ‏\"‏ لو أن الناس اعتزلوهم ‏\"‏‏.‏ قال محمود حدثنا أبو داود أخبرنا شعبة عن أبي التياح سمعت أبا زرعة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"This branch from Quraish will ruin the people.\" The companions of the Prophet asked, \"What do you order us to do (then)?\" He said, \"I would suggest that the people keep away from them.''",
      "chain": [
        "30272",
        "20318",
        "20020",
        "11317",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "3688",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قيس بن حفص، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي التياح، قال سمعت أنسا، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل معقود في نواصيها الخير ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"There is always goodness in horses.\"",
      "chain": [
        "30158",
        "20226",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3812",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، عن معاوية  رضى الله عنه  قال إنكم لتصلون صلاة لقد صحبنا النبي صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Humran bin `Abbas:                     Muawiya said (to the people), \"You offer a prayer which we, who were the companions of the Prophet never saw the Prophet offering, and he forbade its offering,\" i.e. the two rak`at after the compulsory `Asr prayer.",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11317",
        "11421",
        "27"
      ]
    },
    {
      "hadith_no": "3824",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي التياح، قال سمعت أنسا  رضى الله عنه  يقول قالت الأنصار يوم فتح مكة  وأعطى قريشا  والله إن هذا لهو العجب، إن سيوفنا تقطر من دماء قريش، وغنائمنا ترد عليهم‏.‏ فبلغ ذلك النبي صلى الله عليه وسلم فدعا الأنصار قال فقال ‏\"‏ ما الذي بلغني عنكم ‏\"‏‏.‏ وكانوا لا يكذبون‏.‏ فقالوا هو الذي بلغك‏.‏ قال ‏\"‏ أولا ترضون أن يرجع الناس بالغنائم إلى بيوتهم، وترجعون برسول الله صلى الله عليه وسلم إلى بيوتكم لو سلكت الأنصار واديا أو شعبا، لسلكت وادي الأنصار أو شعبهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     On the day of the Conquest of Mecca, when the Prophet had given (from the booty) the Quraish, the Ansar said, \"By Allah, this is indeed very strange: While our swords are still dribbling with the blood of Quraish, our war booty are distributed amongst them.\" When this news reached the Prophet he called the Ansar and said, \"What is this news that has reached me from you?\" They used not to tell lies, so they replied, \"What has reached you is true.\" He said, \"Doesn't it please you that the people take the booty to their homes and you take Allah's Apostle to your homes? If the Ansar took their way through a valley or a mountain pass, I would take the Ansar's valley or a mountain pass.\"",
      "chain": [
        "20296",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3980",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث،‏.‏ وحدثنا إسحاق بن منصور، أخبرنا عبد الصمد، قال سمعت أبي يحدث، حدثنا أبو التياح، يزيد بن حميد الضبعي قال حدثني أنس بن مالك  رضى الله عنه  قال لما قدم رسول الله صلى الله عليه وسلم المدينة، نزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف  قال  فأقام فيهم أربع عشرة ليلة، ثم أرسل إلى ملإ بني النجار  قال  فجاءوا متقلدي سيوفهم، قال وكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته، وأبو بكر ردفه، وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب، قال فكان يصلي حيث أدركته الصلاة، ويصلي في مرابض الغنم، قال ثم إنه أمر ببناء المسجد، فأرسل إلى ملإ بني النجار، فجاءوا فقال ‏\"‏ يا بني النجار، ثامنوني حائطكم هذا ‏\"‏‏.‏ فقالوا لا، والله لا نطلب ثمنه إلا إلى الله‏.‏ قال فكان فيه ما أقول لكم كانت فيه قبور المشركين، وكانت فيه خرب، وكان فيه نخل، فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت، وبالخرب فسويت، وبالنخل فقطع، قال فصفوا النخل قبلة المسجد  قال  وجعلوا عضادتيه حجارة‏.‏ قال قال جعلوا ينقلون ذاك الصخر وهم يرتجزون، ورسول الله صلى الله عليه وسلم معهم يقولون اللهم إنه لا خير إلا خير الآخره فانصر الأنصار والمهاجره‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle arrived at Medina, he alighted at the upper part of Medina among the people called Bani `Amr bin `Auf and he stayed with them for fourteen nights. Then he sent for the chiefs of Bani An-Najjar, and they came, carrying their swords. As if I am just now looking at Allah's Apostle on his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Bani An- Najjar around him till he dismounted in the courtyard of Abu Aiyub's home. The Prophet used to offer the prayer wherever the prayer was due, and he would pray even in sheepfolds. Then he ordered that the mosque be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said, \"O Banu An-Najjar! Suggest to me the price of this garden of yours.\" They replied \"No! By Allah, we do not demand its price except from Allah.\" In that garden there were the (following) things that I will tell you: Graves of pagans, unleveled land with holes and pits etc., and date-palm trees. Allah's Apostle ordered that the graves of the pagans be dug up and, the unleveled land be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the wall facing the Qibla. The Stone pillars were built at the sides of its gate. The companions of the Prophet were carrying the stones and reciting some lyrics, and Allah's Apostle . . was with them and they were saying, \"O Allah! There is no good Excel the good of the Hereafter, so bestow victory on the Ansar and the Emigrants. \"",
      "chain": [
        "30175",
        "30313",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4376",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي التياح، عن أنس، قال لما كان يوم فتح مكة قسم رسول الله صلى الله عليه وسلم غنائم بين قريش‏.‏ فغضبت الأنصار قال النبي صلى الله عليه وسلم ‏\"‏ أما ترضون أن يذهب الناس بالدنيا، وتذهبون برسول الله صلى الله عليه وسلم ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ لو سلك الناس واديا أو شعبا لسلكت وادي الأنصار أو شعبهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When it was the day of the Conquest (of Mecca) Allah's Apostle distributed the war booty amongst the people of Quraish which caused the Ansar to become angry. So the Prophet said, \"Won't you be pleased that the people take the worldly things and you take Allah's Apostle with you? \"They said, \"Yes.\" The Prophet said, \"If the people took their way through a valley or mountain pass, I would take my way through the Ansar's valley or mountain pass.\"",
      "chain": [
        "20193",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6193",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن أبي التياح، قال سمعت أنس بن مالك  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ يسروا ولا تعسروا، وسكنوا ولا تنفروا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Make things easy for the people, and do not make it difficult for them, and make them calm (with glad tidings) and do not repulse (them ).",
      "chain": [
        "20404",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6197",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا أبو التياح، قال سمعت أنس بن مالك  رضى الله عنه  يقول إن كان النبي صلى الله عليه وسلم ليخالطنا حتى يقول لأخ لي صغير ‏\"‏ يا أبا عمير ما فعل النغير ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to mix with us to the extent that he would say to a younger brother of mine, 'O father of `Umar! What did the Nughair (a kind of bird) do?\"",
      "chain": [
        "20404",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6246",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا أبو التياح، عن أبي جمرة، عن ابن عباس  رضى الله عنهما  قال لما قدم وفد عبد القيس على النبي صلى الله عليه وسلم قال ‏\"‏ مرحبا بالوفد الذين جاءوا غير خزايا ولا ندامى ‏\"‏‏.‏ فقالوا يا رسول الله إنا حى من ربيعة وبيننا وبينك مضر، وإنا لا نصل إليك إلا في الشهر الحرام، فمرنا بأمر فصل ندخل به الجنة، وندعو به من وراءنا‏.‏ فقال ‏\"‏ أربع وأربع أقيموا الصلاة، وآتوا الزكاة، وصوم رمضان، وأعطوا خمس ما غنمتم، ولا تشربوا في الدباء، والحنتم، والنقير، والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the delegation of `Abdul Qais came to the Prophet, he said, \"Welcome, O the delegation who have come! Neither you will have disgrace, nor you will regret.\" They said, \"O Allah's Apostle! We are a group from the tribe of Ar-Rabi`a, and between you and us there is the tribe of Mudar and we cannot come to you except in the sacred months. So please order us to do something good (religious deeds) so that we may enter Paradise by doing that, and also that we may order our people who are behind us (whom we have left behind at home) to follow it.\" He said, \"Four and four:\" offer prayers perfectly , pay the Zakat, (obligatory charity), fast the month of Ramadan, and give one-fifth of the war booty (in Allah's cause), and do not drink in (containers called) Ad-Duba,' Al-Hantam, An-Naqir and Al-Muzaffat.\"",
      "chain": [
        "30156",
        "20258",
        "11317",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "6274",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن أبي التياح، عن أنس، قال كان النبي صلى الله عليه وسلم أحسن الناس خلقا، وكان لي أخ يقال له أبو عمير  قال أحسبه فطيم  وكان إذا جاء قال ‏\"‏ يا أبا عمير ما فعل النغير ‏\"‏‏.‏ نغر كان يلعب به، فربما حضر الصلاة وهو في بيتنا، فيأمر بالبساط الذي تحته فيكنس وينضح، ثم يقوم ونقوم خلفه فيصلي بنا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet was the best of all the people in character. I had a brother called Abu `Umar, who, I think, had been newly weaned. Whenever he (that child) was brought to the Prophet the Prophet used to say, \"O Abu `Umar! What did Al-Nughair (nightingale) (do)?\" It was a nightingale with which he used to play. Sometimes the time of the Prayer became due while he (the Prophet) was in our house. He would order that the carpet underneath him be swept and sprayed with water, and then he would stand up (for the prayer) and we would line up behind him, and he would lead us in prayer.",
      "chain": [
        "30175",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6583",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد الله بن محمد  هو الجعفي  حدثنا وهب بن جرير، حدثنا شعبة، عن قتادة، وأبي التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11019",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "7229",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن أبي التياح، عن أنس بن مالك  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا وأطيعوا وإن استعمل عليكم عبد حبشي كأن رأسه زبيبة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"You should listen to and obey, your ruler even if he was an Ethiopian (black) slave whose head looks like a raisin.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، سمع مطرف بن عبد الله، يحدث عن ابن المغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب ثم قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ ثم رخص في كلب الصيد وكلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة في التراب ‏\"‏ ‏.‏",
      "text_en": " Ibn Mughaffal reported:                      The Messenger of Allah (may peace be upon him) ordered killing of the dogs, and then said: What about them, i. e. about other dogs? and then granted concession (to keep) the dog for hunting and the dog for (the security) of the herd, and said: When the dog licks the utensil, wash it seven times, and rub it with earth the eighth time.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "11305"
      ]
    },
    {
      "hadith_no": "1201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وشيبان بن فروخ، كلاهما عن عبد الوارث، - قال يحيى أخبرنا عبد الوارث بن سعيد، عن أبي التياح الضبعي، حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم قدم المدينة فنزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف ‏.‏ فأقام فيهم أربع عشرة ليلة ثم إنه أرسل إلى ملإ بني النجار فجاءوا متقلدين بسيوفهم - قال - فكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر ردفه وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب - قال - فكان رسول الله صلى الله عليه وسلم يصلي حيث أدركته الصلاة ويصلي في مرابض الغنم ثم إنه أمر بالمسجد قال فأرسل إلى ملإ بني النجار فجاءوا فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله ‏.‏ قال أنس فكان فيه ما أقول كان فيه نخل وقبور المشركين وخرب ‏.‏ فأمر رسول الله صلى الله عليه وسلم بالنخل فقطع وبقبور المشركين فنبشت وبالخرب فسويت - قال - فصفوا النخل قبلة وجعلوا عضادتيه حجارة - قال - فكانوا يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم إنه لا خير إلا خير الآخره فانصر الأنصار والمهاجره",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) came to Medina and stayed in the upper part of Medina for fourteen nights with a tribe called Banu 'Amr b 'Auf. He then sent for the chiefs of Banu al-Najir, and they came with swords around their inecks. He (the narrator) said: I perceive as if I am seeing the Messenger of Allah (may peace be upon him) on his ride with Abu Bakr behind him and the chiefs of Banu al-Najjar around him till he alighted in the courtyard of Abu Ayyub. He (the narrator) said: The Messenger of Allah (may peace be upon him) said prayer when the time came for prayer, and he prayed in the fold of goats and sheep. He then ordered mosques to be built and sent for the chiefs of Banu al-Najjar, and they came (to him). He (the Holy Prophet) said to them: O Banu al-Najjar, sell these lands of yours to me. They said: No, by Allah. we would not demand their price, but (reward) from the Lord. Anas said: There (in these lands) were trees and graves of the polytheists, and ruins. The Messenger of Allah (may peace he upon him) ordered that the trees should be cut, and the graves should be dug out, and the ruins should be levelled. The trees (were thus) placed in rows towards the qibla and the stones were set on both sides of the door, and (while building the mosque) they (the Companions) sang rajaz verses along with the Messenger of Allah (may peace be upon him): O Allah: there is no good but the good of the next world, So help the Ansar and the Muhajirin.",
      "chain": [
        "30399",
        "20656",
        "20258",
        "20031",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني أبو التياح، عن أنس، أن رسول الله صلى الله عليه وسلم كان يصلي في مرابض الغنم قبل أن يبنى المسجد ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) used to pray in the folds of the sheep and goats before the mosque was built.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه يحيى بن يحيى، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن أبي التياح، قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu al-Tiyyah reported:                      I heard from Anas a narration like this from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30399",
        "20226",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، وأبو الربيع، كلاهما عن عبد الوارث، قال شيبان حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا فربما تحضر الصلاة وهو في بيتنا فيأمر بالبساط الذي تحته فيكنس ثم ينضح ثم يؤم رسول الله صلى الله عليه وسلم ونقوم خلفه فيصلي بنا وكان بساطهم من جريد النخل ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) wits the best among people in character. On occasions, the time of prayer would come while he was in our house. He would then order to spread the mat lying under him. That was dusted and then water was sprinkled over it. The Messenger of Allah (may peace be upon him) then led the prayer and we stood behind him, and that mat was made of the leaves of date-palm.",
      "chain": [
        "20656",
        "20258",
        "20240",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا أبو التياح، حدثني أبو عثمان النهدي، عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث بصيام ثلاثة أيام من كل شهر وركعتى الضحى وأن أوتر قبل أن أرقد ‏.‏",
      "text_en": " Abu Huraira reported. My friend (the Holy Prophet, may peace be upon him) has instructed me to do three things:                      three fasts during every month, two rak'ahs of the forenoon prayer, and observing Witr prayer before going to bed.",
      "chain": [
        "20656",
        "20258",
        "11317",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "1793",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن أبي التياح، قال حدثني أبو مجلز، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      Witr is a rak'ah at the end of the night prayer.",
      "chain": [
        "20656",
        "20258",
        "11317",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي التياح، قال سمعت أنس بن مالك، قال لما فتحت مكة قسم الغنائم في قريش فقالت الأنصار إن هذا لهو العجب إن سيوفنا تقطر من دمائهم وإن غنائمنا ترد عليهم ‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فجمعهم فقال ‏\"‏ ما الذي بلغني عنكم ‏\"‏ ‏.‏ قالوا هو الذي بلغك ‏.‏ وكانوا لا يكذبون ‏.‏ قال ‏\"‏ أما ترضون أن يرجع الناس بالدنيا إلى بيوتهم وترجعون برسول الله إلى بيوتكم لو سلك الناس واديا أو شعبا وسلكت الأنصار واديا أو شعبا لسلكت وادي الأنصار أو شعب الأنصار ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      When Mecca was conquered, he (the Holy Prophet) distributed the spoils among the Quraish. Upon this the Ansar said: It is strange that our swords are dripping with their blood, whereas our spoils have been given to them (to the Quraish). This (remark) reached the Messenger of Allah (may peace be upon him), and so he gathered them and said: What is this that has been conveyed to me about you? They said: (Yes) it is that very thing that, has reached you-and they were not (the people) to speak lie. Upon this he said: Don't you like that the people should return to their houses along with worldly riches, whereas you should return to your houses with the Messenger of Allah? If the people were to tread a valley or d narrow path, and the Ansar were also to tread a valley or a narrow path, I would tread the valley (along with the) Ansar or the narrow path (along with the) Ansar.",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الوارث بن سعيد، عن أبي التياح الضبعي، حدثني موسى بن سلمة الهذلي، قال انطلقت أنا وسنان بن سلمة، معتمرين قال وانطلق سنان معه ببدنة يسوقها فأزحفت عليه بالطريق فعيي بشأنها إن هي أبدعت كيف يأتي بها ‏.‏ فقال لئن قدمت البلد لأستحفين عن ذلك ‏.‏ قال فأضحيت فلما نزلنا البطحاء قال انطلق إلى ابن عباس نتحدث إليه ‏.‏ قال فذكر له شأن بدنته ‏.‏ فقال على الخبير سقطت بعث رسول الله صلى الله عليه وسلم بست عشرة بدنة مع رجل وأمره فيها - قال - فمضى ثم رجع فقال يا رسول الله كيف أصنع بما أبدع على منها قال ‏\"‏ انحرها ثم اصبغ نعليها في دمها ثم اجعله على صفحتها ولا تأكل منها أنت ولا أحد من أهل رفقتك ‏\"‏ ‏.‏",
      "text_en": " Musa b. Salama al-Hudhali reported:                      I and Sinan b. Salama proceeded (to Mecca to perform Umra. Sinan had a sacrificial camel with him which he was driving. The camel stopped in the way being completely exhausted and this state of it made him (Sinan) helpless. (He thought) if it stops proceeding further how he would be able to take it, along with him and said: I would definitely find out (the religious verdict) about it. I moved on in the morning and as we encamped at al-Batha', (Sinan) said: Come (along with me) to Ibn 'Abbis (Allah be pleased with them) so that we should narrate to him (this incident), and he (Sinan) reported to him the incident of the sacrificial camel. He (Ibn Abbas) said: You have referred (the matter) to the well informed person. (Now listen) Allah's Messenger (may peace be upon him) sent sixteen sacrificial camels with a man whom he put in change of them. He set out and came back and said: Messenger of Allah, what should I do with those who are completely exhausted and become powerless to move on, whereupon he said: Slaughter them, and dye their hoofs in their blood, and put them on the sides of their humps, but neither you nor anyone among those who are with you must eat any part of them.",
      "chain": [
        "30399",
        "20258",
        "11317",
        "26042"
      ]
    },
    {
      "hadith_no": "3281",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه يحيى بن يحيى، وأبو بكر بن أبي شيبة وعلي بن حجر قال يحيى أخبرنا وقال الآخران، حدثنا إسماعيل ابن علية، عن أبي التياح، عن موسى بن سلمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث بثمان عشرة بدنة مع رجل ‏.‏ ثم ذكر بمثل حديث عبد الوارث ولم يذكر أول الحديث ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) sent eighteen sacrificial camels with a person. The rest of the hadith is the same, and the first part (of the above-mentioned hadith) is not mentioned.",
      "chain": [
        "30399",
        "20031",
        "20208",
        "11317",
        "26042",
        "17"
      ]
    },
    {
      "hadith_no": "3938",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا همام، عن أبي التياح، قال سمعت عبد الله بن الحارث، يحدث عن حكيم بن حزام، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏ قال مسلم بن الحجاج ولد حكيم بن حزام في جوف الكعبة وعاش مائة وعشرين سنة ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Hakim b. Hizam (Imam Muslim) said:                      Hakim b. Hizam was born inside the Ka'ba and lived for one hundred and twenty years.",
      "chain": [
        "30153",
        "20033",
        "20297",
        "11317",
        "912",
        "423"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، سمع مطرف، بن عبد الله عن ابن المغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب ثم قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ ثم رخص في كلب الصيد وكلب الغنم ‏.‏",
      "text_en": "  Ibn Mughaffal reported:                      Allah's Messenger (may peace be upon him) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keehing of dogs for hunting and (the protection of) herds.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "11305"
      ]
    },
    {
      "hadith_no": "4625",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي التياح، عن أنس، ح. وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن سعيد، ح وحدثنا محمد بن، الوليد حدثنا محمد بن جعفر، كلاهما عن شعبة، عن أبي التياح، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسروا ولا تعسروا وسكنوا ولا تنفروا ‏\"‏.",
      "text_en": " The Messenger of Allah (may peace he upon him) has been reported by Anas b. Malik to have said:                      Show leniency; do not be hard; give solace and do not create aversion.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "19",
        "30201",
        "30359",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4776",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا يحيى بن يحيى، وشيبان بن فروخ، قال يحيى أخبرنا وقال، شيبان حدثنا عبد الوارث، عن أبي التياح، حدثنا أنس بن مالك، قال كانوا يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم لا خير إلا خير الآخره فانصر الأنصار والمهاجره وفي حديث شيبان بدل فانصر فاغفر ‏.‏",
      "text_en": " According to still another version of the tradition narrated by the same authority, and handed down through a different chain of transmitters, it has been reported that they (the Companions of the Holy Prophet) were reciting rajaz verses and the Messenger of Allah (may peace be upon him) was (reciting) with them. And they were chanting:                      O God, there is no good but the good of the Hereafter. So help Thou the Ansar and the Muhajirs. Shaiban substituted\" So forgive Thou\" for\" So help Thou\".",
      "chain": [
        "30399",
        "20656",
        "20031",
        "20240",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4962",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا يحيى بن سعيد، كلاهما عن شعبة، عن أبي التياح، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البركة في نواصي الخيل ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                      There is a blessing in the forelocks of the war horses.",
      "chain": [
        "30150",
        "20286",
        "30170",
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4963",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن، الوليد حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن أبي التياح، سمع أنسا، يحدث عن  النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "20226",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "5746",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود العتكي حدثنا عبد الوارث، حدثنا أبو التياح، حدثنا أنس بن مالك، ح  وحدثنا شيبان بن فروخ، - واللفظ له - حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا وكان لي أخ يقال له أبو عمير - قال أحسبه قال - كان فطيما - قال - فكان إذا جاء رسول الله صلى الله عليه وسلم فرآه قال ‏\"‏ أبا عمير ما فعل النغير ‏\"‏ ‏.‏ قال فكان يلعب به ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) had the sublimest character among mankind. I had a brother who was called Abd 'Umair. I think he was weaned. When Allah's Messenger (may peace he upon him) came to our house he saw him, and said:                      Abu 'Umair, what has the sparrow done? He (Anas) said that he had been playing with that.",
      "chain": [
        "30137",
        "20258",
        "11317",
        "19",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6157",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا شيبان بن فروخ، وأبو الربيع، قالا حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) was the best amongst people in disposition and behaviour.",
      "chain": [
        "20656",
        "30137",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6956",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا أبو التياح، حدثني أنس بن، مالك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أشراط الساعة أن يرفع العلم ويثبت الجهل ويشرب الخمر ويظهر الزنا ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying:                      It is from the conditions of the Last Hour that knowledge would be taken away and ignorance would prevail (upon the world), the liquor would be drunk, and adultery would become rampant.",
      "chain": [
        "20656",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "7118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن أبي التياح، قال كان لمطرف بن عبد الله امرأتان فجاء من عند إحداهما فقالت الأخرى جئت من عند فلانة فقال جئت من عند عمران بن حصين فحدثنا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أقل ساكني الجنة النساء ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain reported that Allah's Messenger (may peace be upon him) said:                      Amongst the inmates of Paradise the women would form a minority.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317"
      ]
    },
    {
      "hadith_no": "7119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  أبي التياح، قال سمعت مطرفا، يحدث أنه كانت له امرأتان بمعنى حديث معاذ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mutarrif through another chain of transmitters.",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "hadith_no": "7509",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا شعبة، عن أبي التياح، قال سمعت أبا زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يهلك أمتي هذا الحى من قريش ‏\"‏ ‏.‏ قالوا فما تأمرنا قال ‏\"‏ لو أن الناس اعتزلوهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) as saying:                      This tribe of the Quraish would kill (people) of wy Ummah. They (the Companions) said: What us to do (in such a situations)? Thereupon he said: Would that the people remain aside from them (and not besmear their hand with the blood of the Muslim).",
      "chain": [
        "30201",
        "20318",
        "20020",
        "11317",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "7595",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن الوليد، حدثنا محمد، بن جعفر قالا حدثنا شعبة، عن أبي التياح، عن أنس، عن النبي صلى الله عليه وسلم بهذا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا أبو التياح، حدثني شيخ، قال لما قدم عبد الله بن عباس البصرة فكان يحدث عن أبي موسى، فكتب عبد الله إلى أبي موسى يسأله عن أشياء، فكتب إليه أبو موسى إني كنت مع رسول الله صلى الله عليه وسلم ذات يوم فأراد أن يبول فأتى دمثا في أصل جدار فبال ثم قال صلى الله عليه وسلم ‏\"‏ إذا أراد أحدكم أن يبول فليرتد لبوله موضعا ‏\"‏ ‏.‏",
      "text_en": " Abu al-Tayyah reported on the authority of a shaykh (an old man):                      When Abdullah ibn Abbas came to Basrah, people narrated to him traditions from AbuMusa.  Therefore Ibn Abbas wrote to him asking him about certain things.  In reply AbuMusa wrote to him saying: One day I was in the company of the Messenger of Allah (ﷺ).  He wanted to urinate.  Then he came to a soft ground at the foot of a wall and urinated.  He (the Prophet) then said: If any of you wants to urinate, he should look for a place (like this) for his urination.",
      "chain": [
        "20040",
        "20022",
        "11317"
      ]
    },
    {
      "hadith_no": "74",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، حدثنا أبو التياح، عن مطرف، عن ابن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم ولها ‏\"‏ ‏.‏ فرخص في كلب الصيد وفي كلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرار والثامنة عفروه بالتراب ‏\"‏ ‏.‏ قال أبو داود وهكذا قال ابن مغفل ‏.‏",
      "text_en": " Narrated Ibn Mughaffal:                     The Messenger of Allaah (sal Allaahu alayhi wa sallam) ordered the killing of the dogs, and then said: Why are they (people) after them (dogs)? and then granted permission (to keep) for hunting  and for (the security) of the herd, and said : When the dog licks the utensil wash it seven times, and rub it with earth the eighth time.Abu Dawud said : Ibn Mughaffal narrated in a similar way.",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "hadith_no": "453",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال قدم رسول الله صلى الله عليه وسلم المدينة فنزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف فأقام فيهم أربع عشرة ليلة ثم أرسل إلى بني النجار فجاءوا متقلدين سيوفهم - فقال أنس - فكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر ردفه وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب وكان رسول الله صلى الله عليه وسلم يصلي حيث أدركته الصلاة ويصلي في مرابض الغنم وإنه أمر ببناء المسجد فأرسل إلى بني النجار فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ فقالوا والله لا نطلب ثمنه إلا إلى الله عز وجل ‏.‏ قال أنس وكان فيه ما أقول لكم كانت فيه قبور المشركين وكانت فيه خرب وكان فيه نخل فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت وبالخرب فسويت وبالنخل فقطع فصفوا النخل قبلة المسجد وجعلوا عضادتيه حجارة وجعلوا ينقلون الصخر وهم يرتجزون والنبي صلى الله عليه وسلم معهم وهو يقول اللهم لا خير إلا خير الآخره فانصر الأنصار والمهاجره",
      "text_en": " Anas b. Malik reported:                      Messenger of Allah (ﷺ) came over to Medina and encamped at the upper side of Medina among the tribe known as Banu 'Amr b. 'Awf. He stayed among them for fourteen days. He then sent someone to call Banu al-Najjar. They came to him hanging their swords from the necks. Anas then said: As if I am looking at the Messenger of Allah (ﷺ) sitting on his mount and Abu Bakr seated behind him, and Banu al-Najjar standing around him. He descended in the courtyard of Abu Ayyub. The Messenger of Allah (ﷺ) would say his prayer in the folds of the sheep and goats. He commanded us to build a mosque. He then sent for Banu al-Najjar and said to them: Banu al-Najjar, sell this land of yours to me for some price. They replied: By Allah, we do not want any price (from you) except from Allah. Anas said: I tell what this land contained. It contained the graves of the disbelievers, dung-hills, and some trees of date-palm. The Messenger of Allah (ﷺ) commanded and the graves of the disbelievers were dug open, and the trees of the date-palm were cut off. The wood of the date-palm were erected in front of the mosque ; the door-steps wre built of stone. They were reciting verses carrying the stones. The Prophet (ﷺ) also joined them (in reciting verses) saying: O Allah, there is no good except the good of the Hereafter. So grant you aid to the Ansar and the Muhajirah.",
      "chain": [
        "30175",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "454",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد بن سلمة، عن أبي التياح، عن أنس بن مالك، قال كان موضع المسجد حائطا لبني النجار فيه حرث ونخل وقبور المشركين فقال رسول الله صلى الله عليه وسلم ‏\"‏ ثامنوني به ‏\"‏ ‏.‏ فقالوا لا نبغي به ثمنا ‏.‏ فقطع النخل وسوي الحرث ونبش قبور المشركين وساق الحديث وقال ‏\"‏ فاغفر ‏\"‏ ‏.‏ مكان ‏\"‏ فانصر ‏\"‏ ‏.‏ قال موسى وحدثنا عبد الوارث بنحوه وكان عبد الوارث يقول خرب وزعم عبد الوارث أنه أفاد حمادا هذا الحديث ‏.‏",
      "text_en": " Anas b. Malik said:                      The Mosque (of the Prophet) was built in the land of Banu al-Najjar which contained crops, palm trees and graves of the disbelievers. The Messenger of Allah (ﷺ) said: Sell it to me for some price. They (Banu al-Najjar) replied: We do not want (any price). The palm-trees were cut off, and the crops removed and the graves of the disbelievers dug opened. He then narrated the rest of the tradition. But this version has the word \"forgive\" in the verse, instead of the word \"help\". Musa said: 'Abd al-Warith also narrated this tradition in a like manner. The version of 'Abd al-Warith has the word \"dung-hill\" (instead of crop), and he asserted that he narrated this tradition to Hammad.",
      "chain": [
        "20040",
        "20021",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1763",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، ح حدثنا مسدد، حدثنا عبد الوارث، - وهذا حديث مسدد - عن أبي التياح، عن موسى بن سلمة، عن ابن عباس، قال بعث رسول الله صلى الله عليه وسلم فلانا الأسلمي وبعث معه بثمان عشرة بدنة فقال أرأيت إن أزحف على منها شىء قال ‏\"‏ تنحرها ثم تصبغ نعلها في دمها ثم اضربها على صفحتها ولا تأكل منها أنت ولا أحد من أصحابك ‏\"‏ ‏.‏ أو قال ‏\"‏ من أهل رفقتك ‏\"‏ ‏.‏ قال أبو داود الذي تفرد به من هذا الحديث قوله ‏\"‏ ولا تأكل منها أنت ولا أحد من أهل رفقتك ‏\"‏ ‏.‏ وقال في حديث عبد الوارث ‏\"‏ ثم اجعله على صفحتها ‏\"‏ ‏.‏ مكان ‏\"‏ اضربها ‏\"‏ ‏.‏ قال أبو داود سمعت أبا سلمة يقول إذا أقمت الإسناد والمعنى كفاك ‏.‏",
      "text_en": " Ibn Abbas said:                      The Messenger of Allah (SWAS) sent a man of al-Aslam tribe and sent with him eighteen sacrificial camels (as offering to Makkah).  What do you think if any one of them becomes fatigued.  He replied : You should sacrifice it then dye its shoe with its blood, then mark with it on its neck.  But you or any of your companions should not eat out of it.  Abu Dawud said: The following words of this tradition are not supported by any other tradition “You should not eat of it yourself nor any of your companions”.The version of `Abdal Warith has the words “then hang it in its neck” instead of the words “mark or strike with it”.  Abu Dawud said I heard Abu Salamah say if the chain of narrators and the meaning are correct, it is sufficient for you.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "30175",
        "20258",
        "11317",
        "26042",
        "17"
      ]
    },
    {
      "hadith_no": "4247",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، حدثنا أبو التياح، عن صخر بن بدر العجلي، عن سبيع بن خالد، بهذا الحديث عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فإن لم تجد يومئذ خليفة فاهرب حتى تموت فإن تمت وأنت عاض ‏\"‏ ‏.‏ وقال في آخره قال قلت فما يكون بعد ذلك قال ‏\"‏ لو أن رجلا نتج فرسا لم تنتج حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Hudhaifah through a different chain of narrators from the Prophet (ﷺ). This version says:                      He said: If you do not find a caliph in those days, then flee away until you die, even of you die holding on (to a stump of a tree). I asked: What will come next ? He replied: If a man wants the mare to bring forth a foal, it will not deliver in till the Last Hour comes.",
      "chain": [
        "30175",
        "20258",
        "11317",
        "14187",
        "145"
      ]
    },
    {
      "hadith_no": "333",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن شعبة، عن أبي التياح الضبعي، قال سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يخالطنا حتى إن كان يقول لأخ لي صغير ‏\"‏ يا أبا عمير ما فعل النغير ‏\"‏ ‏.‏ قال ونضح بساط لنا فصلى عليه ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم لم يروا بالصلاة على البساط والطنفسة بأسا ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ واسم أبي التياح يزيد بن حميد ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"Allah's Messenger used to mingle with us such that he said to my younger brother: 'O Abu Umair! What did the Nughair do?'\" He (Anas) said: \"A Bisat of ours would be sprinkled (with water) to perform Salat on.\"",
      "chain": [
        "30480",
        "20032",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن شعبة، عن أبي التياح الضبعي، عن أنس بن مالك، أن النبي صلى الله عليه وسلم كان يصلي في مرابض الغنم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو التياح الضبعي اسمه يزيد بن حميد ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"The Prophet would perform Salat in sheep pens.\"",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا يوسف بن حماد المعني البصري، حدثنا عبد الوارث بن سعيد، عن أبي التياح، حدثنا حفص الليثي، قال أشهد على عمران بن حصين أنه حدثنا أنه، قال نهى رسول الله صلى الله عليه وسلم عن التختم بالذهب ‏.‏ قال وفي الباب عن علي وابن عمر وأبي هريرة ومعاوية ‏.‏ قال أبو عيسى حديث عمران حديث حسن ‏.‏ وأبو التياح اسمه يزيد بن حميد ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     \"The Messenger of Allah (ﷺ) prohibited us from (wearing) rings of gold.\"[He said:] THere are narrations on this topic from 'Ali, Ibn 'Umar, Abu Hurairah, and Mu'awiyah. [Abu 'Eisa said:] The Hadith of 'Imran is a Hasan Hadith. Abu At-Tayyah's (a narrator) name is Yazid bin Humaid.",
      "chain": [
        "30573",
        "20258",
        "11317",
        "27499"
      ]
    },
    {
      "hadith_no": "2119",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن الوضاح الكوفي، حدثنا عبد الله بن إدريس، عن شعبة، عن أبي التياح، عن أنس، قال إن كان رسول الله صلى الله عليه وسلم ليخالطنا حتى إن كان ليقول لأخ لي صغير ‏\"‏ يا أبا عمير ما فعل النغير ‏\"‏ ‏.‏",
      "text_en": " Anas narrated:                      \"The Messenger of Allah used to mingle with us such that he said to my younger brother: 'O Abu 'Umair! What did the Nughair do?'\"",
      "chain": [
        "20102",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2120",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن شعبة، عن أبي التياح، عن أنس، نحوه ‏.‏ وأبو التياح اسمه يزيد بن حميد الضبعي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "30480",
        "20032",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، وأحمد بن منيع، قالا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة ‏.‏ وهذا حديث حسن غريب ‏.‏ وقد رواه عبد الله بن شوذب وغير واحد عن أبي التياح ولا نعرفه إلا من حديث أبي التياح ‏.‏",
      "text_en": " Abu Bakr As-Siddiq said:                     \"The Messenger of Allah(s.a.w) narrated to us, saying: 'The Dajjal shall emerge from a land in the east called Khurasan. He is followed by a people whom appear as if their f aces are shields coated with leather. '\"",
      "chain": [
        "30160",
        "30242",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    },
    {
      "hadith_no": "67",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن المغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ورخص في كلب الصيد والغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Al-Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:                      \"If a dog licks a vessel then wash it seven times, and rub it the eighth time with dust.\"",
      "chain": [
        "20423",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، - يعني ابن الحارث - عن شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ورخص في كلب الصيد والغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:                      \"If a dog licks a vessel then wash it seven times and rub it the eighth time with dust.\"",
      "chain": [
        "30449",
        "20226",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال لما قدم رسول الله صلى الله عليه وسلم نزل في عرض المدينة في حى يقال لهم بنو عمرو بن عوف فأقام فيهم أربع عشرة ليلة ثم أرسل إلى ملإ من بني النجار فجاءوا متقلدي سيوفهم كأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر - رضى الله عنه - رديفه وملأ من بني النجار حوله حتى ألقى بفناء أبي أيوب وكان يصلي حيث أدركته الصلاة فيصلي في مرابض الغنم ثم أمر بالمسجد فأرسل إلى ملإ من بني النجار فجاءوا فقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ قالوا والله لا نطلب ثمنه إلا إلى الله عز وجل ‏.‏ قال أنس وكانت فيه قبور المشركين وكانت فيه خرب وكان فيه نخل فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت وبالنخل فقطعت وبالخرب فسويت فصفوا النخل قبلة المسجد وجعلوا عضادتيه الحجارة وجعلوا ينقلون الصخر وهم يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم لا خير إلا خير الآخرة فانصر الأنصار والمهاجرة",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Messenger of Allah (ﷺ) came to Al-Madinah, he alighted in the upper part of Al-Madinah among the tribe called Banu 'Amr bin 'Awf and he stayed with them for fourteen nights. Then he sent for the chiefs of Banu An-Najjar, and they came with their swords by their sides. It is as if I can see the Messenger of Allah (ﷺ) on his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Banu An-Najjar around him, until he dismounted in the courtyard of Abu Ayyub. The Prophet (ﷺ) used to offer the prayer wherever he was when the time for prayer came, and he would pray even in sheepfolds. Then he ordered that the Masjid be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said: 'O Banu An-Najjar, name me a price for this grove of yours.' They said: 'By Allah, we will not ask for its price except from Allah.'\" Anas said: \"In (that grove) there were graves of idolators, ruins and date-palm trees. The Messenger of Allah (ﷺ) ordered that the graves of the idolators be dug up, the ruins be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the walls facing the Qiblah. The stone pillars were built at the sides of its gate. They started to move the stones, reciting some lines of verse, and the Messenger of Allah (ﷺ) was with them when they were saying: 'O Allah! There is no good except the good of the Hereafter. So bestow victory on the Ansar and the Muhajirin.'\"",
      "chain": [
        "28454",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا وهب بن جرير، قال حدثنا شعبة، عن أبي التياح، عن أبي مجلز، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated fom Ibn Umar that:                     The Prophet (ﷺ) said: \"Witr is one rak'ah at the end of the night.\"",
      "chain": [
        "11222",
        "20298",
        "20020",
        "11317",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا أبو التياح، قال حدثني موسى بن سلمة الهذلي، أن ابن عباس، قال أمرت امرأة سنان بن سلمة الجهني أن يسأل، رسول الله صلى الله عليه وسلم أن أمها ماتت ولم تحج أفيجزئ عن أمها أن تحج عنها قال ‏\"‏ نعم لو كان على أمها دين فقضته عنها ألم يكن يجزئ عنها فلتحج عن أمها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                     \"The wife of sinan bin Salamah Al-Juhani ordered that the question be put to the Messenger of Allah about her mother who had died and had not performed Hajj; would it be good enough if she were to perform Hajj on behalf of her mother? He said: 'Yes. If her mother owed a debt and she paid it off, would that not be good enough? Let her perform Hajj on behalf of her mother.'''",
      "chain": [
        "28454",
        "20258",
        "11317",
        "26042",
        "17"
      ]
    },
    {
      "hadith_no": "3571",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال حدثنا شعبة، عن أبي التياح، قال سمعت أنسا، ح وأنبأنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثني أبو التياح، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البركة في نواصي الخيل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah said: 'Blessing is in the forelocks of horses.'\"",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11317",
        "19",
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "5187",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يوسف بن حماد المعني البصري، قال حدثنا عبد الوارث، عن أبي التياح، قال حدثنا حفص الليثي، قال أشهد على عمران أنه حدثنا قال نهى رسول الله صلى الله عليه وسلم عن لبس الحرير وعن التختم بالذهب وعن الشرب في الحناتم ‏.‏",
      "text_en": " Hafs Al-Laithi said:                     \"I bear witness that 'Imran narrated to us, he said: 'The Messenger of Allah [SAW] forbade wearing silk, and gold rings, and drinking from Al-Hanatim.'\"",
      "chain": [
        "30573",
        "20258",
        "11317",
        "27499"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، يحدث عن عبد الله بن المغفل، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that:                     The Messenger of Allah said: 'If a dog licks a vessel, wash it seven times and rub it with dust the eight times.\"",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "hadith_no": "742",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن حماد بن سلمة، عن أبي التياح الضبعي، عن أنس بن مالك، قال كان موضع مسجد النبي  صلى الله عليه وسلم  لبني النجار وكان فيه نخل ومقابر للمشركين فقال لهم النبي  صلى الله عليه وسلم  ‏\"‏ ثامنوني به ‏\"‏ ‏.‏ قالوا لا نأخذ له ثمنا أبدا ‏.‏ قال فكان النبي  صلى الله عليه وسلم  يبنيه وهم يناولونه والنبي  صلى الله عليه وسلم  يقول ‏\"‏ ألا إن العيش عيش الآخرة فاغفر للأنصار والمهاجرة ‏\"‏ ‏.‏ قال وكان النبي  صلى الله عليه وسلم  يصلي قبل أن يبني المسجد حيث أدركته الصلاة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The location where the Prophet's Mosque was built belonged to Banu Najjar. In it there were date-palm trees and graves of the idolaters. The Prophet said to them: 'Name its price.' They said: 'We will never take any money for it.' The Prophet built it and they were assisting him, and the Prophet was saying: 'The real life is the life of the Hereafter so forgive the Ansar and the Muhajirah.' Before the mosque was built, the Prophet would perform prayer wherever he was when the time for prayer came.\"",
      "chain": [
        "38409",
        "20032",
        "20021",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1637",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا روح، حدثنا بسطام بن مسلم، قال سمعت أبا التياح، قال سمعت ابن أبي مليكة، عن عائشة، أن رسول الله  صلى الله عليه وسلم  رخص في زيارة القبور ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) gavepermission for visiting the graves.",
      "chain": [
        "30498",
        "20229",
        "24032",
        "11317",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "2970",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، وأبو بشر بكر بن خلف قالا حدثنا يحيى بن سعيد، حدثنا شعبة، حدثني أبو التياح، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا وأطيعوا وإن استعمل عليكم عبد حبشي كأن رأسه زبيبة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “Listen and obey, even if the one appointed over you is anEthiopian slave with a head like a raisin.”",
      "chain": [
        "30160",
        "34043",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، يحدث عن عبد الله بن مغفل، أن رسول الله  صلى الله عليه وسلم  أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم وللكلاب ‏\"‏ ‏.‏ ثم رخص لهم في كلب الصيد ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) commanded that dogs be killed, then he said:                      “What do theyuse dogs for?” Then he permitted them to keep hunting dogs.",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "hadith_no": "3322",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، ح وحدثنا محمد بن الوليد، حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله  صلى الله عليه وسلم  أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم وللكلاب ‏\"‏ ‏.‏ ثم رخص لهم في كلب الزرع وكلب العين ‏.‏ قال بندار العين حيطان المدينة ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) commanded that dogs be killed, then he said:                      “What do theyuse dogs for?” Then he permitted them to keep farming dogs and dogsof‘Ein. Bundar said: “The ‘Ein refers to the walls ofAl-Madinah.”",
      "chain": [
        "30160",
        "20262",
        "20459",
        "20173",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شعبة، عن أبي التياح، قال سمعت أنس بن مالك، يقول كان رسول الله  صلى الله عليه وسلم  يخالطنا حتى يقول لأخ لي صغير ‏\"‏ يا أبا عمير ما فعل النغير ‏\"‏ ‏.‏ قال وكيع يعني طيرا كان يلعب به ‏.‏",
      "text_en": " It was narrated that Abu Taiyah said:                     \"I heard Anas Bin Malik say: The Messenger of Allah(ﷺ) sed to mix with us so much that he said to al ittle brother of mine: \"O Abu Umair, what happened to the Nughair(one of the narratrs Waki said that it means a bird that he used to play with).\"",
      "chain": [
        "38409",
        "20032",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن شعبة، عن أبي التياح، عن أنس، قال كان النبي  صلى الله عليه وسلم  يأتينا فيقول لأخ لي وكان صغيرا ‏\"‏ يا أبا عمير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Prophet(ﷺ) used to come to us and say to a brother of mine, who was small: 'O Abu Umair.'\".",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، ومحمد بن بشار، ومحمد بن المثنى، قالوا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله  صلى الله عليه وسلم  ‏\"‏ أن الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakr Siddiq said:                      \"The Messenger ofAllah(ﷺ) told us: 'Dajjal will emerge in a land in the east calledKhorasan, and will be followed by people with faces like hammeredshields.'\"",
      "chain": [
        "30395",
        "30160",
        "30170",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    }
  ],
  "total_hadiths": 78
}