{
  "id": "11314",
  "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
  "full_name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Hadrami",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11287",
      "name": "Sa'id bin Abi al-Hasan سعيد بن أبي الحسن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11171",
      "name": "Salman al-Aghar Abu 'Abdullah سلمان الأغر أبو عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11603",
      "name": "'Uqba bin Abd al-Ghafr عقبة بن عبد الغافر الأزدي العوذي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14235",
      "name": "'Abdur Rahman bin Adhynh عبد الرحمن بن أذينة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1081",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا يحيى بن أبي إسحاق، قال سمعت أنسا، يقول خرجنا مع النبي صلى الله عليه وسلم من المدينة إلى مكة، فكان يصلي ركعتين ركعتين حتى رجعنا إلى المدينة‏.‏ قلت أقمتم بمكة شيئا قال أقمنا بها عشرا‏.‏",
      "text_en": " Narrated Yahya bin 'Is-haq:                     I heard Anas saying, \"We traveled with the Prophet from Medina to Mecca and offered two rak`at (for every prayer) till we returned to Medina.\" I said, \"Did you stay for a while in Mecca?\" He replied, \"We stayed in Mecca for ten days.\"",
      "chain": [
        "30315",
        "20258",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "2175",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا إسماعيل ابن علية، قال حدثني يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، قال قال أبو بكرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا سواء بسواء، والفضة بالفضة إلا سواء بسواء، وبيعوا الذهب بالفضة والفضة بالذهب كيف شئتم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said, \"Don't sell gold for gold unless equal in weight, nor silver for silver unless equal in weight, but you could sell gold for silver or silver for gold as you like.\"",
      "chain": [
        "30343",
        "20208",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عباد بن العوام، أخبرنا يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن الفضة بالفضة والذهب بالذهب، إلا سواء بسواء، وأمرنا أن نبتاع الذهب بالفضة كيف شئنا، والفضة بالذهب كيف شئنا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakra:                     that his father said, \"The Prophet forbade the selling of gold for gold and silver for silver except if they are equivalent in weight, and allowed us to sell gold for silver and vice versa as we wished.\"",
      "chain": [
        "30156",
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3085",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، قال حدثني يحيى بن أبي إسحاق، عن أنس بن مالك  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم مقفله من عسفان، ورسول الله صلى الله عليه وسلم على راحلته، وقد أردف صفية بنت حيى، فعثرت ناقته فصرعا جميعا، فاقتحم أبو طلحة فقال يا رسول الله، جعلني الله فداءك‏.‏ قال ‏\"‏ عليك المرأة ‏\"‏‏.‏ فقلب ثوبا على وجهه وأتاها، فألقاها عليها وأصلح لهما مركبهما فركبا، واكتنفنا رسول الله صلى الله عليه وسلم، فلما أشرفنا على المدينة قال ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقول ذلك حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were in the company of the Prophet while returning from 'Usfan, and Allah's Apostle was riding his she-camel keeping Safiya bint Huyay riding behind him. His she-camel slipped and both of them fell down. Abu Talha jumped from his camel and said, \"O Allah's Apostle! May Allah sacrifice me for you.\" The Prophet said, \"Take care of the lady.\" So, Abu Talha covered his face with a garment and went to Safiya and covered her with it, and then he set right the condition of their shecamel so that both of them rode, and we were encircling Allah's Apostle like a cover. When we approached Medina, the Prophet said, \"We are returning with repentance and worshipping and praising our Lord.\" He kept on saying this till he entered Medina.",
      "chain": [
        "30315",
        "20258",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك  رضى الله عنه أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وإن أبا طلحة  قال أحسب قال  اقتحم عن بعيره فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداءك، هل أصابك من شىء قال ‏\"‏ لا، ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه، فقصد قصدها فألقى ثوبه عليها، فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة  أو قال أشرفوا على المدينة  قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he and Abu Talha came in the company of the Prophet and Safiya was accompanying the Prophet, who let her ride behind him on his she-camel. During the journey, the she-camel slipped and both the Prophet and (his) wife fell down. Abu Talha (the sub-narrator thinks that Anas said that Abu Talha jumped from his camel quickly) said, \"O Allah's Apostle! May Allah sacrifice me for your sake! Did you get hurt?\" The Prophet replied,\"No, but take care of the lady.\" Abu Talha covered his face with his garment and proceeded towards her and covered her with his garment, and she got up. He then set right the condition of their she-camel and both of them (i.e. the Prophet and his wife) rode and proceeded till they approached Medina. The Prophet said, \"We are returning with repentance and worshipping and praising our Lord.\" The Prophet kept on saying this statement till he entered Medina.",
      "chain": [
        "30026",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "4342",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان،‏.‏ حدثنا قبيصة، حدثنا سفيان، عن يحيى بن أبي إسحاق، عن أنس  رضى الله عنه  قال أقمنا مع النبي صلى الله عليه وسلم عشرا نقصر الصلاة‏.‏",
      "text_en": " Narrated Anas:                     We stayed (in Mecca) for ten days along with the Prophet and used to offer shortened prayers (i.e. journey prayers).",
      "chain": [
        "20348",
        "20351",
        "20012",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "6034",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحسن بن محمد بن صباح، حدثنا يحيى بن عباد، حدثنا شعبة، أخبرني يحيى بن أبي إسحاق، قال سمعت أنس بن مالك  رضى الله عنه  قال أقبلنا مع رسول الله صلى الله عليه وسلم من خيبر، وإني لرديف أبي طلحة وهو يسير وبعض نساء رسول الله صلى الله عليه وسلم رديف رسول الله صلى الله عليه وسلم إذ عثرت الناقة فقلت المرأة‏.‏ فنزلت‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها أمكم ‏\"‏‏.‏ فشددت الرحل وركب رسول الله صلى الله عليه وسلم فلما دنا أو رأى المدينة قال ‏\"‏ آيبون تائبون، عابدون لربنا، حامدون ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were coming from Khaibar along with Allah's Apostle while l was riding behind Abu Talha and he was proceeding. While one of the wives of Allah's Apostle was riding behind Allah's Apostle, suddenly the foot of the camel Slipped and I said, \"The woman!\" and alighted (hurriedly). Allah's Apostle said, \"She is your mother.\" Sol resaddled the she-camel and Allah's Apostle mounted it. When he approached or saw Medina, he said, \"Ayibun, ta'ibun, 'abidun, li-Rabbina hami-dun.\"",
      "chain": [
        "30245",
        "10840",
        "20020",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "6148",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الصمد، قال حدثني أبي قال، حدثني يحيى بن أبي إسحاق، قال قال لي سالم بن عبد الله ما الإستبرق قلت ما غلظ من الديباج وخشن منه‏.‏ قال سمعت عبد الله يقول رأى عمر على رجل حلة من إستبرق فأتى بها النبي صلى الله عليه وسلم فقال يا رسول الله اشتر هذه فالبسها لوفد الناس إذا قدموا عليك‏.‏ فقال ‏\"‏ إنما يلبس الحرير من لا خلاق له ‏\"‏‏.‏ فمضى في ذلك ما مضى، ثم إن النبي صلى الله عليه وسلم بعث إليه بحلة فأتى بها النبي صلى الله عليه وسلم فقال بعثت إلى بهذه، وقد قلت في مثلها ما قلت قال ‏\"‏ إنما بعثت إليك لتصيب بها مالا ‏\"‏‏.‏ فكان ابن عمر يكره العلم في الثوب لهذا الحديث‏.‏",
      "text_en": " Narrated `Abdullah:                     `Umar saw a silken cloak over a man (for sale) so he took it to the Prophet and said, 'O Allah's Apostle! Buy this and wear it when the delegate come to you.' He said, 'The silk is worn by one who will have no share (in the Here-after).' Some time passed after this event, and then the Prophet sent a (similar) cloak to him. `Umar brought that cloak back to the Prophet and said, 'You have sent this to me, and you said about a similar one what you said?' The Prophet said, 'I have sent it to you so that you may get money by selling it.' Because of this, Ibn `Umar used to hate the silken markings on the garments.",
      "chain": [
        "30351",
        "20250",
        "20258",
        "11314",
        "16"
      ]
    },
    {
      "hadith_no": "6255",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية، مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وأن أبا طلحة  قال أحسب  اقتحم عن بعيره، فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداك، هل أصابك من شىء‏.‏ قال ‏\"‏ لا ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه فقصد قصدها، فألقى ثوبه عليها فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة  أو قال أشرفوا على المدينة  قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون، عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he and Abu Talha were coming in the company of the Prophet towards Medina), while Safiya (the Prophet's wife) was riding behind him on his she-camel. After they had covered a portion of the way suddenly the foot of the she-camel slipped and both the Prophet and the woman (i.e., his wife, Safiya) fell down. Abu Talha jumped quickly off his camel and came to the Prophet (saying.) \"O Allah's Apostle! Let Allah sacrifice me for you! Have you received any injury?\" The Prophet said, \"No, but take care of the woman (my wife).\" Abu Talha covered his face with his garment and went towards her and threw his garment over her. Then the woman got up and Abu Talha prepared their she camel (by tightening its saddle, etc.) and both of them (the Prophet and Safiya) mounted it. Then all of them proceeded and when they approached near Medina, or saw Medina, the Prophet said, \"Ayibun,' abidun, taibun, liRabbina hamidun (We are coming back (to Medina) with repentance, worshipping (our Lord) and celebrating His (our Lord's) praises\". The Prophet continued repeating these words till he entered the city of Medina.",
      "chain": [
        "30026",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1618",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا هشيم، عن يحيى بن أبي إسحاق، عن أنس بن مالك، قال خرجنا مع رسول الله صلى الله عليه وسلم من المدينة إلى مكة فصلى ركعتين ركعتين حتى رجع ‏.‏ قلت كم أقام بمكة قال عشرا ‏.‏",
      "text_en": " Anas b. Malik reported:                      We went out from Medina to Mecca with the Messenger of Allah (may peace be upon him) and he prayed two rak'ahs at each time of prayer till we returned to Medina. I said: For how long did he stay in Mecca? He said: (For) ten (days).",
      "chain": [
        "30399",
        "20468",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه قتيبة، حدثنا أبو عوانة، ح وحدثناه أبو كريب، حدثنا ابن علية، جميعا عن يحيى بن أبي إسحاق، عن أنس، عن النبي صلى الله عليه وسلم بمثل حديث هشيم ‏.‏",
      "text_en": " A hadith like this has been narrated by Anas by another chain of transmitters.",
      "chain": [
        "30367",
        "20469",
        "30216",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، قال حدثني يحيى بن أبي إسحاق، قال سمعت أنس بن مالك، يقول خرجنا من المدينة إلى الحج ‏.‏ ثم ذكر مثله ‏.‏",
      "text_en": " Yahya b. Abu Ishaq reported:                      I heard Anas b. Malik say: We went out for Pilgrimage from Medina. The rest is the same.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1621",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا أبو أسامة، جميعا عن الثوري، عن يحيى بن أبي إسحاق، عن أنس، عن النبي صلى الله عليه وسلم بمثله ولم يذكر الحج ‏.‏",
      "text_en": " A hadith like this has been transmitted by Anas, but no mention has been made of Pilgrimage.",
      "chain": [
        "30212",
        "20331",
        "30216",
        "20012",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3087",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن يحيى بن أبي إسحاق، وعبد العزيز، بن صهيب وحميد أنهم سمعوا أنسا، - رضى الله عنه - قال سمعت رسول الله صلى الله عليه وسلم أهل بهما جميعا ‏\"‏ لبيك عمرة وحجا لبيك عمرة وحجا ‏\"‏ ‏.‏ وحدثنيه علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن يحيى بن أبي إسحاق، وحميد الطويل قال يحيى سمعت أنسا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لبيك عمرة وحجا ‏\"‏ ‏.‏ وقال حميد قال أنس سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لبيك بعمرة وحج ‏\"‏ ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) pronouncing Talbiya for both simultaneously, Talbiya for 'Umra and Hajj. Talbiya for Uwra and Hajj (he performed both Hajj and Umra as a Qarin). In another version words are: I heard Allah's Messenger (may peace be upon him) pronouncing Talbiya for Umra and Hajj (simultaneously).\"",
      "chain": [
        "30399",
        "20468",
        "11314"
      ]
    },
    {
      "hadith_no": "3345",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل ابن علية، عن يحيى بن أبي إسحاق، قال قال أنس بن مالك أقبلنا مع النبي صلى الله عليه وسلم أنا وأبو طلحة ‏.‏ وصفية رديفته على ناقته حتى إذا كنا بظهر المدينة قال ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏ ‏.‏ فلم يزل يقول ذلك حتى قدمنا المدينة ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) reported:                      I and Abu Talha (both) came back along with Allah's Apostle (may peace be upon him). Safiyyah (the wife of the Holy Prophet) rode behind him on his camel and as we came to the out- skirts of Medina he said: (We are those) who return, who repent, who worship our Lord, who praise (Him), and he went on uttering this until we entered Medina.",
      "chain": [
        "30022",
        "20208",
        "11314"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Anas b. Malik (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30430",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا حماد بن إسماعيل ابن علية، حدثنا أبي، عن وهيب، عن يحيى بن أبي، إسحاق أنه حدث عن أبي سعيد، مولى المهري أنه أصابهم بالمدينة جهد وشدة وأنه أتى أبا سعيد الخدري فقال له إني كثير العيال وقد أصابتنا شدة فأردت أن أنقل عيالي إلى بعض الريف ‏.‏ فقال أبو سعيد لا تفعل الزم المدينة فإنا خرجنا مع نبي الله صلى الله عليه وسلم - أظن أنه قال - حتى قدمنا عسفان فأقام بها ليالي فقال الناس والله ما نحن ها هنا في شىء وإن عيالنا لخلوف ما نأمن عليهم ‏.‏ فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ ما هذا الذي بلغني من حديثكم - ما أدري كيف قال - والذي أحلف به أو والذي نفسي بيده لقد هممت أو إن شئتم - لا أدري أيتهما قال - لآمرن بناقتي ترحل ثم لا أحل لها عقدة حتى أقدم المدينة - وقال - اللهم إن إبراهيم حرم مكة فجعلها حرما وإني حرمت المدينة حراما ما بين مأزميها أن لا يهراق فيها دم ولا يحمل فيها سلاح لقتال ولا يخبط فيها شجرة إلا لعلف اللهم بارك لنا في مدينتنا اللهم بارك لنا في صاعنا اللهم بارك لنا في مدنا اللهم بارك لنا في صاعنا اللهم بارك لنا في مدنا اللهم بارك لنا في مدينتنا اللهم اجعل مع البركة بركتين والذي نفسي بيده ما من المدينة شعب ولا نقب إلا عليه ملكان يحرسانها حتى تقدموا إليها - ثم قال للناس - ارتحلوا ‏\"‏ ‏.‏ فارتحلنا فأقبلنا إلى المدينة فوالذي نحلف به أو يحلف به - الشك من حماد - ما وضعنا رحالنا حين دخلنا المدينة حتى أغار علينا بنو عبد الله بن غطفان وما يهيجهم قبل ذلك شىء ‏.‏",
      "text_en": " Abu Sa'id Maula al-Mahri reported that they were hard pressed by the distress and hardship of Medina, and he come to AbU Sa'Id al-Khudri and said to him:                      I have a large family (to support) and we are enduring hardships; I have, therefore, made up my mind to take my family to some fertile land. Thereupon Abu Sa'id said: Don't do that, stick to Medina, for we have come out with Allah's Apostle (may peace be upon him), and (I think that he also said) until we reached 'Usfan, and he (the Holy Prophet along with his Companions) stayed there for some nights. There the people said: By Allah, we are lying here idle, whereas our children are unprotected behind us, and we do not feel secure about them. This (apprehension of theirs) reached Allah's Apostle (may peace be upon him), whereupon he said: What is this matter concerning you that has reached me? (I do not retain how he said it, whether he said like this: ) By Him (in the name of Whom) I take oath, (or he said like this: ) By Him in Whose Hand is my life, I made up my mind or if you like (I do not retain what word did he actually say), I should command my camel to proceed and not to let it halt until it comes to Medina and then said: Ibrahim declared Mecca as the sacred territory and it became sacred, and I declare Medina as the sacred territory-the area between the two mountains ('Air and Uhud). Thus no blood is to be shed within its (bounds) and no weapon is to be carried for fighting, and the leaves of the trees there should not be beaten off except for fodder. O Allah, bless us in our city; O Allab, bless us in our sil; O Allah, bless us in our mudd; O Allah, bless us in our sa; O Allah, bless us in our mudd. O Allah, bless us in our city. O Allah, bless with this blessing two more blessings. By Him in Whose Hand is my life, there is no ravine or mountain path of Medina which is not protected by two angels until you reach there. (He then said to the people: ) Proceed, and we, therefore, proceeded and we came to Medina By Him (in Whose name) we take oath and (in Whose name) oath is taken (Hammad is in doubt about it), we had hardly put down our camel saddles on arriving at Medina that we were attacked by the people of the tribe of 'Abdullah b. Ghatafan but none dared to do it before.",
      "chain": [
        "20299",
        "11314",
        "10992"
      ]
    },
    {
      "hadith_no": "4157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا عباد بن العوام، أخبرنا يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن الفضة بالفضة والذهب بالذهب إلا سواء بسواء وأمرنا أن نشتري الفضة بالذهب كيف شئنا ونشتري الذهب بالفضة كيف شئنا ‏.‏ قال فسأله رجل فقال يدا بيد فقال هكذا سمعت ‏.‏",
      "text_en": " Abd al-Rabman b. Abia Bakra reported on the authority of his father that Allah's Messenger (may peace be upon him) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said:                      It is to be made on the spot. This is what I heard (from Allah's Messenger (may peace be upon him ).",
      "chain": [
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يحيى بن صالح، حدثنا معاوية، عن يحيى، - وهو ابن أبي كثير - عن يحيى بن أبي إسحاق، أن عبد الرحمن بن أبي بكرة، أخبره أن أبا بكرة قال نهانا رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abd al-Rabman b. Abu Bakra said:                      Allah's Messenger (may peace be upon him) prohibited us. The rest of the hadith is the same.",
      "chain": [
        "30313",
        "20470",
        "27",
        "11449",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "5529",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الصمد، قال سمعت أبي يحدث، قال حدثني يحيى بن أبي إسحاق، قال قال لي سالم بن عبد الله في الإستبرق قال قلت ما غلظ من الديباج وخشن منه ‏.‏ فقال سمعت عبد الله بن عمر يقول رأى عمر على رجل حلة من إستبرق فأتى بها النبي صلى الله عليه وسلم ‏.‏ فذكر نحو حديثهم غير أنه قال فقال ‏\"‏ إنما بعثت بها إليك لتصيب بها مالا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported that 'Umar saw a person with a garment of brocade and he brought it to Allah's Apostle (may peace he upon him) -the rest of the hadith is the same, except for the words that he (the Holy Prophet) said:                      I sent it to you that you might get money thereby.",
      "chain": [
        "30170",
        "20250",
        "20258",
        "11314",
        "18"
      ]
    },
    {
      "hadith_no": "1233",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى بن إسماعيل، ومسلم بن إبراهيم، - المعنى - قالا حدثنا وهيب، حدثني يحيى بن أبي إسحاق، عن أنس بن مالك، قال خرجنا مع رسول الله صلى الله عليه وسلم من المدينة إلى مكة فكان يصلي ركعتين حتى رجعنا إلى المدينة فقلنا هل أقمتم بها شيئا قال أقمنا بها عشرا ‏.‏",
      "text_en": " Narrated Anas b. Malik :                     We went out from Medina to Mecca with the Messenger of Allah (ﷺ) and he prayed two rak'ahs (at each time of prayer) till we returned to Medina. We (the people) said: Did you stay there for some time ? He replied: We stayed there ten days.",
      "chain": [
        "20040",
        "20285",
        "20299",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، قال حدثنا هشيم، أخبرنا يحيى بن أبي إسحاق، وعبد العزيز بن صهيب، وحميد الطويل، عن أنس بن مالك، أنهم سمعوه يقول سمعت رسول الله صلى الله عليه وسلم يلبي بالحج والعمرة جميعا يقول ‏\"‏ لبيك عمرة وحجا لبيك عمرة وحجا ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said I heard the Apostle of Allaah(ﷺ) uttering talbiyah(labbaik) aloud for both Hajj and ‘Umrah. He was saying in a loud voice “Labbaik for ‘Umrah and Hajj, labbaik for ‘Umrah and Hajj”.",
      "chain": [
        "30007",
        "20468",
        "11314",
        "11295",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "548",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يحيى بن أبي إسحاق الحضرمي، حدثنا أنس بن مالك، قال خرجنا مع النبي صلى الله عليه وسلم من المدينة إلى مكة فصلى ركعتين ‏.‏ قال قلت لأنس كم أقام رسول الله صلى الله عليه وسلم بمكة قال عشرا ‏.‏ قال وفي الباب عن ابن عباس وجابر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ وقد روي عن ابن عباس عن النبي صلى الله عليه وسلم أنه أقام في بعض أسفاره تسع عشرة يصلي ركعتين ‏.‏ قال ابن عباس فنحن إذا أقمنا ما بيننا وبين تسع عشرة صلينا ركعتين وإن زدنا على ذلك أتممنا الصلاة ‏.‏ وروي عن علي أنه قال من أقام عشرة أيام أتم الصلاة ‏.‏ وروي عن ابن عمر أنه قال من أقام خمسة عشر يوما أتم الصلاة ‏.‏ وقد روي عنه ثنتى عشرة ‏.‏ وروي عن سعيد بن المسيب أنه قال إذا أقام أربعا صلى أربعا ‏.‏ وروى عنه ذلك قتادة وعطاء الخراساني ‏.‏ وروى عنه داود بن أبي هند خلاف هذا ‏.‏ واختلف أهل العلم بعد في ذلك فأما سفيان الثوري وأهل الكوفة فذهبوا إلى توقيت خمس عشرة وقالوا إذا أجمع على إقامة خمس عشرة أتم الصلاة ‏.‏ وقال الأوزاعي إذا أجمع على إقامة ثنتى عشرة أتم الصلاة ‏.‏ وقال مالك بن أنس والشافعي وأحمد إذا أجمع على إقامة أربعة أتم الصلاة ‏.‏ وأما إسحاق فرأى أقوى المذاهب فيه حديث ابن عباس قال لأنه روى عن النبي صلى الله عليه وسلم ثم تأوله بعد النبي صلى الله عليه وسلم إذا أجمع على إقامة تسع عشرة أتم الصلاة ‏.‏ ثم أجمع أهل العلم على أن المسافر يقصر ما لم يجمع إقامة وإن أتى عليه سنون ‏.‏",
      "text_en": " Yahya bin Abi Ishaq Al-Hadrami narrated :                     that Anas bin Malik said: \"We went with the Messenger of Allah from Al-Madinah to Makkah, and he prayed two Rak'ah.\" He said: \"I said to Anas: 'How long did Messenger of Allah stay in Makkah?' He said: 'Ten (days).'\"",
      "chain": [
        "30242",
        "20468",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن يحيى بن أبي إسحاق، عن أنس، قال خرجت مع رسول الله صلى الله عليه وسلم من المدينة إلى مكة فلم يزل يقصر حتى رجع فأقام بها عشرا ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"I went out with the Messenger of Allah (ﷺ) from Al-Madinah to Mekkah, and he continued to shorten his prayers, and he stayed there for ten days.\"",
      "chain": [
        "30367",
        "20469",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "1452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا يزيد، قال أنبأنا يحيى بن أبي إسحاق، عن أنس بن مالك، قال خرجنا مع رسول الله صلى الله عليه وسلم من المدينة إلى مكة فكان يصلي بنا ركعتين حتى رجعنا ‏.‏ قلت هل أقام بمكة قال نعم أقمنا بها عشرا ‏.‏",
      "text_en": " It was narrated from Yahya bin Abi Ishaq that :                     Anas bin Malik said: \" We went out with the Messenger of Allah (ﷺ) from Al-Madinah to Makkah and he used to lead us in praying two rak'ahs until we came back.\" I (Yahya) said: \"Did he stay in Makkah?\" He (Anas) said: \"Yes, we stayed there for ten days.\"",
      "chain": [
        "30430",
        "20304",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا مجاهد بن موسى، عن هشيم، عن يحيى بن أبي إسحاق، عن سليمان بن يسار، عن عبد الله بن عباس، أن رجلا، سأل النبي صلى الله عليه وسلم أن أبي أدركه الحج وهو شيخ كبير لا يثبت على راحلته فإن شددته خشيت أن يموت أفأحج عنه قال ‏\"‏ أرأيت لو كان عليه دين فقضيته أكان مجزئا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فحج عن أبيك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that:                     a man asked the Prophet \"The command of ) Hajj has come while my father is an old man and cannot sit firmly in his saddle; if I tie him (to the saddle) I fear that he will die. Can I perform Hajj on his behalf?\" He said: \"don't you think that if your father owed a debt and you paid it off, that would be good enough?\" He said: \"Yes.\" He said: \"Then perform Hajj on behalf of your father. \"",
      "chain": [
        "30521",
        "20468",
        "11314",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "2643",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، - وهو ابن هارون - قال أنبأنا هشام، عن محمد، عن يحيى بن أبي إسحاق، عن سليمان بن يسار، عن الفضل بن عباس، أنه كان رديف النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إن أمي عجوز كبيرة وإن حملتها لم تستمسك وإن ربطتها خشيت أن أقتلها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت لو كان على أمك دين أكنت قاضيه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فحج عن أمك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas that:                     he was riding behind the Messenger of Allah and a man came and said: \"O Messenger of Allah! My mother is an old woman and she cannot sit firmly in the saddle. If I tie her I fear that I may kill her.\" The Messenger of Allah said: \"Don't you think that if your mother owed a debt you would pay it off?\" He said: \"Yes.\" Her said: \"Then perform Hajj on behalf of your mother.\"(Shih)",
      "chain": [
        "38022",
        "20472",
        "20295",
        "20278",
        "11314",
        "11005",
        "135"
      ]
    },
    {
      "hadith_no": "2729",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا مجاهد بن موسى، عن هشيم، عن يحيى، وعبد العزيز بن صهيب، وحميد الطويل، ح وأنبأنا يعقوب بن إبراهيم، قال أنبأنا هشيم، قال أنبأنا عبد العزيز بن صهيب، وحميد الطويل، ويحيى بن أبي إسحاق، كلهم عن أنس، سمعوه يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لبيك عمرة وحجا لبيك عمرة وحجا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"I heard the Messenger of Allah 'Labbaika 'Umratan wa Hajjan ma'an, Iabbaika 'Umratan wa Hajjan ma'an (Here I am (O Allah) for \"Umrah and Hajj together, here I am (O Allah) for \"Umrah and Hajj together)",
      "chain": [
        "30521",
        "20468",
        "20031",
        "11295",
        "11279",
        "20184",
        "20468",
        "11295",
        "11279",
        "11314"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا هشيم، قال أنبأنا يحيى بن أبي إسحاق، عن سليمان بن يسار، عن عبيد الله بن عباس، أن الغميصاء، أو الرميصاء أتت النبي صلى الله عليه وسلم تشتكي زوجها أنه لا يصل إليها فلم يلبث أن جاء زوجها فقال يا رسول الله هي كاذبة وهو يصل إليها ولكنها تريد أن ترجع إلى زوجها الأول ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس ذلك حتى تذوقي عسيلته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that Al-Ghumaisa or Ar-Rumaisa' came to the Prophet complaining that her husband would not have intercourse with her. It was not long before her husband came and said:                      \"O Messenger of Allah, she is lying; he is having intercourse with her, but she wants to go back to her first husband.\" The Messenger of Allah said: \"She cannot do that until she tastes his sweetness.\"",
      "chain": [
        "20387",
        "20468",
        "11314",
        "11005"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني زياد بن أيوب، قال حدثنا ابن علية، قال حدثنا يحيى بن أبي إسحاق، قال حدثني رجل، من بني غفار في مجلس سالم بن عبد الله قال سالم بن عبد الله سمعت عبد الله، - يعني ابن عمر - وهو يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏",
      "text_en": " Yahya bin Abi Ishaq said:                      \"A man from Banu Ghifar told me, in the gathering of Salim bin 'Abdullah, Salim bin 'Abdullah said: 'I heard 'Abdullah -that is, Ibn 'Umar- say: \"The Messenger of Allah said: 'Allah forbids you to swear by your forefathers.'\"'\"",
      "chain": [
        "30249",
        "20208",
        "11314",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4578",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "وفيما قرأ علينا أحمد بن منيع قال حدثنا عباد بن العوام، قال حدثنا يحيى بن أبي إسحاق، قال حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن بيع الفضة بالفضة والذهب بالذهب إلا سواء بسواء وأمرنا أن نبتاع الذهب بالفضة كيف شئنا والفضة بالذهب كيف شئنا ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated that his father said:                     \"The Messenger of Allah forbade selling silver for silver and gold for god, unless it was of equal amounts. And he told us to sell gold fro silver however we wanted, and silver for gold however we wanted.",
      "chain": [
        "20431",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "5300",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا يحيى، - وهو ابن أبي إسحاق - قال قال سالم ما الإستبرق قلت ما غلظ من الديباج وخشن منه ‏.‏ قال سمعت عبد الله بن عمر يقول رأى عمر مع رجل حلة سندس فأتى بها النبي صلى الله عليه وسلم فقال ‏\"‏ اشتر هذه ‏\"‏ ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Yahya - bin Ishaq - said:                     \"Salim said: 'What is Al-Istabraq?' I said: 'A thick type of Ad-Dibaj, and a coarse type of it.' He said: 'I heard 'Abdullah (bin 'Umar) say: \"Umar saw a Hullah of Sundus with a man, and he brought it to the Messenger of Allah [SAW] and said: 'Buy this'\" and he quoted the Hadith.",
      "chain": [
        "28454",
        "20258",
        "11314",
        "18"
      ]
    },
    {
      "hadith_no": "5393",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا مجاهد بن موسى، عن هشيم، عن يحيى بن أبي إسحاق، عن سليمان بن يسار، عن عبد الله بن عباس، أن رجلا، سأل النبي صلى الله عليه وسلم إن أبي أدركه الحج وهو شيخ كبير لا يثبت على راحلته فإن شددته خشيت أن يموت أفأحج عنه قال ‏\"‏ أفرأيت لو كان عليه دين فقضيته أكان مجزئا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فحج عن أبيك ‏\"‏‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that:                     A man asked the Messenger of Allah [SAW]: \"The (command to perform) Hajj has come while my father is an old man and cannot sit firmly in the saddle, and if I tie him, I fear that he may die. Can I perform Hajj on his behalf?\" He said: \"Do you think that if he owed a debt you would pay it off for him?\" He said: \"Yes.\" He said: \"Then perform Hajj on behalf of your father.\"",
      "chain": [
        "30521",
        "20468",
        "11314",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "5394",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا هشام، عن محمد، عن يحيى بن أبي إسحاق، عن سليمان بن يسار، عن الفضل بن العباس، أنه كان رديف النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إن أمي عجوز كبيرة إن حملتها لم تستمسك وإن ربطتها خشيت أن أقتلها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت لو كان على أمك دين أكنت قاضيه ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فحج عن أمك ‏\"‏‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas, that:                     He was riding behind the Messenger of Allah [SAW], when a man came and said: \"O Messenger of Allah, my mother is an old woman; if I put her on a mount she cannot sit firmly, and if I tie her, I fear that I may kill her.\" He said: \"Do you think that if your mother owed a debt you would pay it off for her?\" He said: \"Yes.\" He said: \"Then perform Hajj on behalf of your mother.\"",
      "chain": [
        "38022",
        "20472",
        "20295",
        "20278",
        "11314",
        "11005",
        "135"
      ]
    },
    {
      "hadith_no": "5395",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا أبو داود، قال حدثنا الوليد بن نافع، قال حدثنا شعبة، عن يحيى بن أبي إسحاق، قال سمعت سليمان بن يسار، يحدثه عن الفضل بن العباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا نبي الله إن أبي شيخ كبير لا يستطيع الحج وإن حملته لم يستمسك أفأحج عنه قال ‏\"‏ حج عن أبيك ‏\"‏‏.‏ قال أبو عبد الرحمن سليمان لم يسمع من الفضل بن العباس‏.‏",
      "text_en": " It was narrated from Sulaiman bin Yasar, who narrated from Al-Fadl bin 'Abbas, who said:                     \"A man came to the Prophet [SAW] and said: 'O Prophet of Allah, my father is an old man and cannot perform Hajj. If I put him on a mount he cannot sit firm. Can I perform Hajj on his behalf?' He said: 'Perform Hajj on behalf of your father.'\"",
      "chain": [
        "30002",
        "20020",
        "11314",
        "11005",
        "135"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا يزيد بن زريع، وعبد الأعلى، قالا حدثنا يحيى بن أبي إسحاق، عن أنس، قال خرجنا مع رسول الله  صلى الله عليه وسلم  من المدينة إلى مكة فصلى ركعتين ركعتين حتى رجعنا ‏.‏ قلت كم أقام بمكة قال عشرا ‏.‏",
      "text_en": " Yahyabin Abu Ishaq narrated that Anas said:                      “We went out with theMessenger of Allah (ﷺ) from Al-Madinah to Makkah, during which timewe shortened our prayer to two Rak’ah, until we came back.” Iasked:“How long did he stay in Makkah?” He said: “Ten (days).”",
      "chain": [
        "30395",
        "20304",
        "20246",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "2156",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا عباد بن العوام، عن يحيى بن أبي إسحاق، عن عبد الرحمن بن أذينة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  خير بريرة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah (ﷺ) gave Barirah the choice.",
      "chain": [
        "38108",
        "20431",
        "11314",
        "14235",
        "13"
      ]
    },
    {
      "hadith_no": "3081",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، قال خرجنا مع رسول الله  صلى الله عليه وسلم  إلى مكة فسمعته يقول ‏\"‏ لبيك عمرة وحجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “We went out with theMessengerof Allah (ﷺ) to Makkah, and I heard him say: ‘Labbaika‘Umratanwa hajjatan [Here I am (O Allah), for ‘Umrah and Hajj].’”",
      "chain": [
        "30395",
        "20246",
        "11314",
        "19"
      ]
    }
  ],
  "total_hadiths": 38
}