{
  "id": "11329",
  "name": "Jabla bin Sahaym جبلة بن سحيم",
  "full_name": "Jabla bin Sahaym جبلة بن سحيم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Taymi",
      "al-Shaybani",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15555",
      "name": "Mu'thar bin Ghaffara موثر بن عفازة الشيباني",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11441",
      "name": "al-'Awwam bin Hushab العوام بن حوشب بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1908",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن جبلة بن سحيم، قال سمعت ابن عمر  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ الشهر هكذا وهكذا ‏\"‏‏.‏ وخنس الإبهام في الثالثة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The month is like this and this,\" (at the same time he showed the fingers of both his hands thrice) and left out one thumb on the third time.",
      "chain": [
        "20296",
        "20020",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "2455",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن جبلة، كنا بالمدينة في بعض أهل العراق، فأصابنا سنة، فكان ابن الزبير يرزقنا التمر، فكان ابن عمر  رضى الله عنهما  يمر بنا فيقول إن رسول الله صلى الله عليه وسلم نهى عن الإقران، إلا أن يستأذن الرجل منكم أخاه‏.‏",
      "text_en": " Narrated Jabala:                     \"We were in Medina with some of the Iraqi people, and we were struck with famine and Ibn Az- Zubair used to give us dates. Ibn `Umar used to pass by and say, \"The Prophet forbade us to eat two dates at a time, unless one takes the permission of one's companions.\"",
      "chain": [
        "30329",
        "20020",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "2489",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، حدثنا جبلة بن سحيم، قال سمعت ابن عمر  رضى الله عنهما  يقول نهى النبي صلى الله عليه وسلم أن يقرن الرجل بين التمرتين جميعا، حتى يستأذن أصحابه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet decreed that one should not eat two dates together at a time unless he gets the permission from his companions (sharing the meal with him).",
      "chain": [
        "20191",
        "20012",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "5359",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا جبلة بن سحيم، سمعت ابن عمر، يقول قال النبي صلى الله عليه وسلم ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏‏.‏ يعني ثلاثين، ثم قال ‏\"‏ وهكذا وهكذا وهكذا ‏\"‏‏.‏ يعني تسعا وعشرين يقول، مرة ثلاثين ومرة تسعا وعشرين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (holding out his ten fingers thrice), said, \"The month is thus and thus and thus,\" namely thirty days. Then (holding out his ten fingers twice and then nine fingers), he said, \"It may be thus and thus and thus,\" namely twenty nine days. He meant once thirty days and once twenty nine days.",
      "chain": [
        "20404",
        "20020",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "5502",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا جبلة بن سحيم، قال أصابنا عام سنة مع ابن الزبير فرزقنا تمرا، فكان عبد الله بن عمر يمر بنا ونحن نأكل ويقول لا تقارنوا فإن النبي صلى الله عليه وسلم نهى عن القران‏.‏ ثم يقول إلا أن يستأذن الرجل أخاه‏.‏ قال شعبة الإذن من قول ابن عمر‏.‏",
      "text_en": " Narrated Jabala bin Suhaim.:                     At the time of Ibn Az-Zubair, we were struck with famine, and he provided us with dates for our food. `Abdullah bin `Umar used to pass by us while we were eating, and say, \"Do not eat two dates together at a time, for the Prophet forbade the taking of two dates together at a time (in a gathering).\" Ibn `Umar used to add, \"Unless one takes the permission of one's companions.\"",
      "chain": [
        "20404",
        "20020",
        "11329"
      ]
    },
    {
      "hadith_no": "5456",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني زهير بن حرب، ومحمد بن المثنى، قالا حدثنا عبد الرحمن، عن سفيان، عن جبلة بن سحيم، قال سمعت ابن عمر، يقول نهى رسول الله صلى الله عليه وسلم أن يقرن الرجل بين التمرتين حتى يستأذن أصحابه ‏.‏",
      "text_en": " Jabala b. Suhaim reported:                      I heard Ibn 'Umar as saying that Allah's Messenger (may peace be upon him) forbade anyone taking two dates together without seeking the consent of his companions.",
      "chain": [
        "30022",
        "30170",
        "20033",
        "20012",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "3834",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا ابن فضيل، عن أبي إسحاق، عن جبلة بن سحيم، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن الإقران إلا أن تستأذن أصحابك ‏.‏",
      "text_en": " Ibn ‘Umar said:                      The Messenger of Allah(ﷺ) prohibited anyone taking two dates together with the exception that you ask permission from your companions.",
      "chain": [
        "20356",
        "11049",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "1506",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا حجاج بن أرطاة، عن جبلة بن سحيم، أن رجلا، سأل ابن عمر عن الأضحية، أواجبة هي فقال ضحى رسول الله صلى الله عليه وسلم والمسلمون ‏.‏ فأعادها عليه فقال أتعقل ضحى رسول الله صلى الله عليه وسلم والمسلمون ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أن الأضحية ليست بواجبة ولكنها سنة من سنن رسول الله صلى الله عليه وسلم يستحب أن يعمل بها وهو قول سفيان الثوري وابن المبارك ‏.‏",
      "text_en": " Narrated Jabalah bin Suhaim :                     That a man asked Ibn 'Umar about the Udhiyah, \"Is it obligatory?\" So he said: \"The Messenger of Allah (ﷺ) performed the Udhiyah as did the Muslims.\" He repeated the question. So he said: \"Do you understand ?\" The Messenger of Allah (ﷺ) slaughtered as did the Muslims.\"",
      "chain": [
        "30242",
        "20468",
        "20580",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وعبيد الله، عن الثوري، عن جبلة بن سحيم، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يقرن بين التمرتين حتى يستأذن صاحبه ‏.‏ قال وفي الباب عن سعد مولى أبي بكر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) prohibited taking two dates at a time until seeking permission from one's companion.\"He said: There is something on this topic from Sa'd the freed slave of Abu Bakr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20355",
        "11201",
        "20012",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "2142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن جبلة بن سحيم، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الشهر هكذا ‏\"‏ ‏.‏ ووصف شعبة عن صفة جبلة عن صفة ابن عمر أنه تسع وعشرون فيما حكى من صنيعه مرتين بأصابع يديه ونقص في الثالثة إصبعا من أصابع يديه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet said:                     \"The month is like this,\" and (one of the narrators) Shubah did the same gesture as Jabalah had done, copying, Ibn 'Umar: \"It is twenty-nine, as he gestured twice with all fingers of both hands, and putting down one of his fingers the third time.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "5617",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا علي بن الحسين، قال حدثنا أمية، عن شعبة، عن جبلة بن سحيم، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن الحنتم قلت ما الحنتم قال الجر ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] forbade Al-Hantam. I (the narrator) said: \"What is Al-Hantam?\" He said: \"The earthenware jar.\"",
      "chain": [
        "11045",
        "20020",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "3244",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا الحجاج بن أرطاة، حدثنا جبلة بن سحيم، قال سألت ابن عمر ‏.‏ فذكر مثله سواء ‏.‏",
      "text_en": "",
      "chain": [
        "30288",
        "20736",
        "20580",
        "11329"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن جبلة بن سحيم، سمعت ابن عمر، يقول نهى رسول الله  صلى الله عليه وسلم  أن يقرن الرجل بين التمرتين حتى يستأذن أصحابه ‏.‏",
      "text_en": " Ibn‘Umar said:                      “The Messenger of Allah (ﷺ) forbade eating twodates at once unless he asks his companions permission to do so.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "4219",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يزيد بن هارون، حدثنا العوام بن حوشب، حدثني جبلة بن سحيم، عن مؤثر بن عفازة، عن عبد الله بن مسعود، قال لما كان ليلة أسري برسول الله  صلى الله عليه وسلم  لقي إبراهيم وموسى وعيسى فتذاكروا الساعة فبدءوا بإبراهيم فسألوه عنها فلم يكن عنده منها علم ثم سألوا موسى فلم يكن عنده منها علم فرد الحديث إلى عيسى ابن مريم فقال قد عهد إلى فيما دون وجبتها فأما وجبتها فلا يعلمها إلا الله ‏.‏ فذكر خروج الدجال قال فأنزل فأقتله فيرجع الناس إلى بلادهم فيستقبلهم يأجوج ومأجوج وهم من كل حدب ينسلون فلا يمرون بماء إلا شربوه ولا بشىء إلا أفسدوه فيجأرون إلى الله فأدعو الله أن يميتهم فتنتن الأرض من ريحهم فيجأرون إلى الله فأدعو الله فيرسل السماء بالماء فيحملهم فيلقيهم في البحر ثم تنسف الجبال وتمد الأرض مد الأديم فعهد إلى متى كان ذلك كانت الساعة من الناس كالحامل التي لا يدري أهلها متى تفجؤهم بولادتها ‏.‏ قال العوام ووجد تصديق ذلك في كتاب الله تعالى ‏{حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون}‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                      \"On the night onwhich the Messenger of Allah (ﷺ) was taken on the Night Journey(Isra'), he met Ibrahim, Musa and 'Eisa, and they discussed the Hour.They started with Ibrahim, and asked him about it, but he did nothave any knowledge of it. Then they asked Musa, and he did not haveany knowledge of it. Then they asked 'Eisa bin Maryam, and he said:'I have been assigned to some tasks before it happens.' As for aswhen it will take place, no one knows that except Allah. Then hementioned Dajjal and said: 'I will descend and kill him, then thepeople will return to their own lands and will be confronted with Gogand Magog people, who will: \"swoop down from everymound.\"[21:96] They will not pass by any water but they willdrink it, (and they will not pass) by anything but they will spoilit. They (the people) will beseech Allah, and I will pray to Allah tokill them. The earth will be filled with their stench and (thepeople) will beseech Allah and I will pray to Allah, then the skywill send down rain that will carry them and throw them in the sea.Then the mountains will turn to dust and the earth will be stretchedout like a hide. I have been promised that when that happens, theHour will come upon the people, like a pregnant woman whose familydoes not know when she will suddenly give birth.'\"(One of the narrators) 'Awwam said: \"Confirmation of that is found in the Book of Allah, where Allah says: \"Until, when Gog and Magog people are let loose (from their barrier), and they swoop down from every mound (21:96).\"",
      "chain": [
        "30160",
        "20472",
        "11441",
        "11329",
        "16"
      ]
    }
  ],
  "total_hadiths": 14
}