{
  "id": "11322",
  "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
  "full_name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك  تيم الرباب",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "52",
      "date_gregorian": "NA",
      "date_display": [
        "52 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "92",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Kufi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "B.Taym",
        "ar": "B.Taym",
        "ckb": "B.Taym"
      },
      {
        "en": "al-Kufi",
        "ar": "al-Kufi",
        "ckb": "al-Kufi"
      }
    ]
  },
  "parents": [
    {
      "id": "11405",
      "name": "Yazid bin Sharayk bin Tariq يزيد بن شريك بن طارق التيمي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11405",
      "name": "Yazid bin Sharayk bin Tariq يزيد بن شريك بن طارق التيمي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "11330",
      "name": "al-Harith bin Suwayd al-Tymy الحارث بن سويد التيمي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [1st Generation]",
        "ar": "تابعي [الجيل الأول]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی یەكەم]"
      }
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11393",
      "name": "Muslim bin 'Imran al-Batayn مسلم بن عمران البطين",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1903",
      "hadith_no": "1903",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي  رضى الله عنه  قال ما عندنا شىء إلا كتاب الله، وهذه الصحيفة عن النبي صلى الله عليه وسلم ‏\"‏ المدينة حرم، ما بين عائر إلى كذا، من أحدث فيها حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏ وقال ‏\"‏ ذمة المسلمين واحدة، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن تولى قوما بغير إذن مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     We have nothing except the Book of Allah and this written paper from the Prophet (wherein is written:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever innovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the curse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of worship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured (respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters without their permission incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted.",
      "usc_msa_ref": "94",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3172",
      "hadith_no": "3172",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا محمد، أخبرنا وكيع، عن الأعمش، عن إبراهيم التيمي، عن أبيه، قال خطبنا علي فقال ما عندنا كتاب نقرؤه إلا كتاب الله، وما في هذه الصحيفة فقال فيها الجراحات وأسنان الإبل، والمدينة حرم ما بين عير إلى كذا، فمن أحدث فيها حدثا أو آوى فيها محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن تولى غير مواليه فعليه مثل ذلك، وذمة المسلمين واحدة، فمن أخفر مسلما فعليه مثل ذلك‏.‏",
      "text_en": " Narrated Ibrahim at-Tamimi's father:                     `Ali delivered a sermon saying, \"We have no book to read except the Book of Allah and what is written in this paper which contains verdicts regarding (retaliation for) wounds, the ages of the camels (given as Zakat or as blood money) and the fact that Medina is a sanctuary in between Air mountain to so-and-so (mountain). So, whoever innovates in it an heresy or commits a sin or gives shelter in it, to such an innovator will incur the Curse of Allah, the angels and all the people, and none of his compulsory or optional good deeds of worship will be accepted. And whoever (freed slave) takes as his master (i.e. befriends) other than his real masters will incur the same (Curse). And the asylum granted by any Muslim is to be secured by all the other Muslims, and whoever betrays a Muslim in this respect will incur the same (Curse).",
      "usc_msa_ref": "397",
      "chain": [
        "30213",
        "20032",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3179",
      "hadith_no": "3179",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي  رضى الله عنه  قال ما كتبنا عن النبي صلى الله عليه وسلم إلا القرآن، وما في هذه الصحيفة، قال النبي صلى الله عليه وسلم ‏\"‏ المدينة حرام ما بين عائر إلى كذا، فمن أحدث حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه عدل ولا صرف، وذمة المسلمين واحدة يسعى بها أدناهم‏.‏ فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن والى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     We did not, write anything from the Prophet except the Qur'an and what is written in this paper, (wherein) the Prophet said, \"Medina is a sanctuary from (the mountain of) Air to so and-so, therefore, whoever innovates (in it) an heresy or commits a sin, or gives shelter to such an innovator, will incur the Curse of Allah. the angels and all the people; and none of his compulsory or optional good deeds of worship will be accepted And the asylum granted by any Muslim Is to be secured by all the Muslims even if it is granted by one of the lowest social status among them. And whoever betrays a Muslim in this respect will incur the Curse of Allah, the angels and all the people, and his compulsory and optional good deeds of worship will not be accepted. And any freed slave will take as masters (befriends) people other than his own real masters who freed him without taking the permission of the latter, will incur the Curse of Allah, the angels and all the people, and his compulsory and optional good deeds of worship will not be accepted.\"",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3199",
      "hadith_no": "3199",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لأبي ذر حين غربت الشمس ‏\"‏ تدري أين تذهب ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب حتى تسجد تحت العرش، فتستأذن فيؤذن لها، ويوشك أن تسجد فلا يقبل منها، وتستأذن فلا يؤذن لها، يقال لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها، فذلك قوله تعالى ‏{‏والشمس تجري لمستقر لها ذلك تقدير العزيز العليم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet asked me at sunset, \"Do you know where the sun goes (at the time of sunset)?\" I replied, \"Allah and His Apostle know better.\" He said, \"It goes (i.e. travels) till it prostrates Itself underneath the Throne and takes the permission to rise again, and it is permitted and then (a time will come when) it will be about to prostrate itself but its prostration will not be accepted, and it will ask permission to go on its course but it will not be permitted, but it will be ordered to return whence it has come and so it will rise in the west. And that is the interpretation of the Statement of Allah: \"And the sun Runs its fixed course For a term (decreed). that is The Decree of (Allah) The Exalted in Might, The All- Knowing.\" (36.38)",
      "usc_msa_ref": "",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3366",
      "hadith_no": "3366",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم التيمي، عن أبيه، قال سمعت أبا ذر  رضى الله عنه  قال قلت يا رسول الله، أى مسجد وضع في الأرض أول قال ‏\"‏ المسجد الحرام ‏\"‏‏.‏ قال قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏‏.‏ قلت كم كان بينهما قال ‏\"‏ أربعون سنة، ثم أينما أدركتك الصلاة بعد فصله، فإن الفضل فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     I said, \"O Allah's Apostle! Which mosque was first built on the surface of the earth?\" He said, \"Al- Masjid-ul-,Haram (in Mecca).\" I said, \"Which was built next?\" He replied \"The mosque of Al-Aqsa ( in Jerusalem) .\" I said, \"What was the period of construction between the two?\" He said, \"Forty years.\" He added, \"Wherever (you may be, and) the prayer time becomes due, perform the prayer there, for the best thing is to do so (i.e. to offer the prayers in time).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3425",
      "hadith_no": "3425",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال قلت يا رسول الله‏.‏ أى مسجد وضع أول قال ‏\"‏ المسجد الحرام ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ ثم المسجد الأقصى ‏\"‏‏.‏ قلت كم كان بينهما قال ‏\"‏ أربعون ‏\"‏‏.‏ ثم قال ‏\"‏ حيثما أدركتك الصلاة فصل، والأرض لك مسجد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhaar:                     I said, \"O Allah's Apostle! Which mosque was built first?\" He replied, \"Al-Masjid-ul-Haram.\" I asked, \"Which (was built) next?\" He replied, \"Al-Masjid-ul-Aqs-a (i.e. Jerusalem).\" I asked, \"What was the period in between them?\" He replied, \"Forty (years).\" He then added, \"Wherever the time for the prayer comes upon you, perform the prayer, for all the earth is a place of worshipping for you.\"",
      "usc_msa_ref": "636",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4850",
      "hadith_no": "4850",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في المسجد عند غروب الشمس فقال ‏\"‏ يا أبا ذر أتدري أين تغرب الشمس ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب حتى تسجد تحت العرش، فذلك قوله تعالى ‏{‏والشمس تجري لمستقر لها ذلك تقدير العزيز العليم‏}‏‏\"‏",
      "text_en": " Narrated Abu Dharr:                     Once I was with the Prophet in the mosque at the time of sunset. The Prophet said, \"O Abu Dharr! Do you know where the sun sets?\" I replied, \"Allah and His Apostle know best.\" He said, \"It goes and prostrates underneath (Allah's) Throne; and that is Allah's Statement:-- 'And the sun runs on its fixed course for a term (decreed). And that is the decree of All-Mighty, the All-Knowing....' (36.38)",
      "usc_msa_ref": "326",
      "chain": [
        "20348",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4851",
      "hadith_no": "4851",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا وكيع، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت النبي صلى الله عليه وسلم عن قوله تعالى ‏{‏والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     I asked the Prophet about the Statement of Allah:-- 'And the sun runs on fixed course for a term (decreed), ' (36.38) He said, \"Its course is underneath \"Allah's Throne.\" (Prostration of Sun trees, stars. mentioned in Qur'an and Hadith does not mean like our prostration but it means that these objects are obedient to their Creator (Allah) and they obey for what they have been created for).",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5654",
      "hadith_no": "5654",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سليمان، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي  رضى الله عنه  نهى النبي صلى الله عليه وسلم عن الدباء والمزفت‏.‏ حدثنا عثمان حدثنا جرير عن الأعمش بهذا‏.‏",
      "text_en": " Narrated `Ali:                     the Prophet forbade the use of Ad-Dubba' and Al Muzaffat.",
      "usc_msa_ref": "498",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11060",
        "11322",
        "11330",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5707",
      "hadith_no": "5707",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله  رضى الله عنه  أتيت النبي صلى الله عليه وسلم في مرضه وهو يوعك وعكا شديدا، وقلت إنك لتوعك وعكا شديدا‏.‏ قلت إن ذاك بأن لك أجرين‏.‏ قال ‏\"‏ أجل ما من مسلم يصيبه أذى، إلا حات الله عنه خطاياه، كما تحات ورق الشجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited the Prophet during his ailments and he was suffering from a high fever. I said, \"You have a high fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is afflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"",
      "usc_msa_ref": "550",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5708",
      "hadith_no": "5708",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال دخلت على رسول الله صلى الله عليه وسلم وهو يوعك فقلت يا رسول الله إنك توعك وعكا شديدا‏.‏ قال ‏\"‏ أجل إني أوعك كما يوعك رجلان منكم ‏\"‏‏.‏ قلت ذلك أن لك أجرين قال ‏\"‏ أجل ذلك كذلك، ما من مسلم يصيبه أذى شوكة فما فوقها، إلا كفر الله بها سيئاته، كما تحط الشجرة ورقها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited Allah's Apostle while he was suffering from a high fever. I said, \"O Allah's Apostle! You have a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you will have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it were the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"",
      "usc_msa_ref": "551",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5722",
      "hadith_no": "5722",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، قال قال عبد الله بن مسعود دخلت على رسول الله صلى الله عليه وسلم وهو يوعك فمسسته بيدي فقلت يا رسول الله إنك توعك وعكا شديدا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل إني أوعك كما يوعك رجلان منكم ‏\"‏‏.‏ فقلت ذلك أن لك أجرين‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يصيبه أذى مرض فما سواه إلا حط الله له سيئاته كما تحط الشجرة ورقها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     I visited Allah's Apostle while he was suffering from a high fever. I touched him with my hand and said, \"O Allah's Apostle! You have a high fever.\" Allah's Apostle said, \"Yes, I have as much fever as two men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Apostle said, \"Yes, no Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will remove his sins for him as a tree sheds its leaves.\"",
      "usc_msa_ref": "564",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11322",
        "11330"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5723",
      "hadith_no": "5723",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله  رضى الله عنه  قال أتيت النبي صلى الله عليه وسلم في مرضه فمسسته وهو يوعك وعكا شديدا فقلت إنك لتوعك وعكا شديدا، وذلك أن لك أجرين‏.‏ قال ‏\"‏ أجل، وما من مسلم يصيبه أذى إلا حاتت عنه خطاياه كما تحات ورق الشجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited the Prophet during his illness and touched him while he was having a fever. I said to him, \"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is afflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"",
      "usc_msa_ref": "565",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5729",
      "hadith_no": "5729",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا موسى، حدثنا عبد العزيز بن مسلم، حدثنا سليمان، عن إبراهيم التيمي، عن الحارث بن سويد، عن ابن مسعود  رضى الله عنه  قال دخلت على النبي صلى الله عليه وسلم وهو يوعك فمسسته فقلت إنك لتوعك وعكا شديدا‏.‏ قال ‏\"‏ أجل كما يوعك رجلان منكم ‏\"‏‏.‏ قال لك أجران قال ‏\"‏ نعم ما من مسلم يصيبه أذى مرض فما سواه إلا حط الله سيئاته كما تحط الشجرة ورقها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     I visited the Prophet while he was having a high fever. I touched him an said, \"You have a very high fever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double reward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other inconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"",
      "usc_msa_ref": "571",
      "chain": [
        "20040",
        "20253",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6518",
      "hadith_no": "6518",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عمر بن حفص، حدثني أبي، حدثنا الأعمش، قال حدثني إبراهيم التيمي، عن الحارث بن سويد، قال عبد الله قال النبي صلى الله عليه وسلم ‏\"‏ أيكم مال وارثه أحب إليه من ماله ‏\"‏‏.‏ قالوا يا رسول الله ما منا أحد إلا ماله أحب إليه‏.‏ قال ‏\"‏ فإن ماله ما قدم، ومال وارثه ما أخر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Who among you considers the wealth of his heirs dearer to him than his own wealth?\" They replied, \"O Allah's Apostle! There is none among us but loves his own wealth more.\" The Prophet said, \"So his wealth is whatever he spends (in Allah's Cause) during his life (on good deeds) while the wealth of his heirs is whatever he leaves after his death.\"",
      "usc_msa_ref": "449",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6841",
      "hadith_no": "6841",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن أبيه، قال قال علي  رضى الله عنه ما عندنا كتاب نقرؤه إلا كتاب الله، غير هذه الصحيفة‏.‏ قال فأخرجها فإذا فيها أشياء من الجراحات وأسنان الإبل‏.‏ قال وفيها المدينة حرم ما بين عير إلى ثور، فمن أحدث فيها حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه يوم القيامة صرف ولا عدل، ومن والى قوما بغير إذن مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه يوم القيامة صرف ولا عدل، وذمة المسلمين واحدة، يسعى بها أدناهم فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه يوم القيامة صرف ولا عدل‏.‏",
      "text_en": " Narrated `Ali:                     We have no Book to recite except the Book of Allah (Qur'an) and this paper. Then `Ali took out the paper, and behold ! There was written in it, legal verdicts about the retaliation for wounds, the ages of the camels (to be paid as Zakat or as blood money). In it was also written: 'Medina is a sanctuary from Air (mountain) to Thaur (mountain). So whoever innovates in it an heresy (something new in religion) or commits a crime in it or gives shelter to such an innovator, will incur the curse of Allah, the angels and all the people, and none of his compulsory or optional good deeds will be accepted on the Day of Resurrection. And whoever (a freed slave) takes as his master (i.e. be-friends) some people other than hi real masters without the permission of his real masters, will incur the curse of Allah, the angels and all the people, and none of his compulsory, or optional good deeds will be accepted on the Day of Resurrection. And the asylum granted by any Muslim is to be secured by all the Muslims, even if it is granted by one of the lowest social status among them; and whoever betrays a Muslim, in this respect will incur the curse of Allah, the angels, and all the people, and none of his Compulsory or optional good deeds will be accepted on the Day of Resurrection.\"",
      "usc_msa_ref": "747",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11322",
        "11405",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7386",
      "hadith_no": "7386",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم التيمي، حدثني أبي قال، خطبنا علي  رضى الله عنه  على منبر من آجر، وعليه سيف فيه صحيفة معلقة فقال والله ما عندنا من كتاب يقرأ إلا كتاب الله وما في هذه الصحيفة‏.‏ فنشرها فإذا فيها أسنان الإبل وإذا فيها ‏\"‏ المدينة حرم من عير إلى كذا، فمن أحدث فيها حدثا فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه صرفا ولا عدلا ‏\"‏‏.‏ وإذا فيه ‏\"‏ ذمة المسلمين واحدة يسعى بها أدناهم، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه صرفا ولا عدلا ‏\"‏‏.‏ وإذا فيها ‏\"‏ من والى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه صرفا ولا عدلا ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim At Taimi's father:                     `Ali addressed us while he was standing on a brick pulpit and carrying a sword from which was hanging a scroll He said \"By Allah, we have no book to read except Allah's Book and whatever is on this scroll,\" And then he unrolled it, and behold, in it was written what sort of camels were to be given as blood money, and there was also written in it: 'Medina is a sanctuary form 'Air (mountain) to such and such place so whoever innovates in it an heresy or commits a sin therein, he will incur the curse of Allah, the angels, and all the people and Allah will not accept his compulsory or optional good deeds.' There was also written in it: 'The asylum (pledge of protection) granted by any Muslims is one and the same, (even a Muslim of the lowest status is to be secured and respected by all the other Muslims, and whoever betrays a Muslim in this respect (by violating the pledge) will incur the curse of Allah, the angels, and all the people, and Allah will not accept his compulsory or optional good deeds.' There was also written in it: 'Whoever (freed slave) befriends (takes as masters) other than his real masters (manumitters) without their permission will incur the curse of Allah, the angels, and all the people, and Allah will not accept his compulsory or optional good deeds. ' (See Hadith No. 94, Vol. 3)",
      "usc_msa_ref": "",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7513",
      "hadith_no": "7513",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم  هو التيمي  عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس، فلما غربت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏‏.‏ قال قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب تستأذن في السجود فيؤذن لها، وكأنها قد قيل لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها ‏\"‏‏.‏ ثم قرأ ‏{‏ذلك مستقر لها‏}‏ في قراءة عبد الله‏.‏",
      "text_en": " Narrated Abu Dharr:                     I entered the mosque while Allah's Apostle was sitting there. When the sun had set, the Prophet said, \"O Abu Dharr! Do you know where this (sun) goes?\" I said, \"Allah and His Apostle know best.\" He said, \"It goes and asks permission to prostrate, and it is allowed, and (one day) it, as if being ordered to return whence it came, then it will rise from the west.\" Then the Prophet recited, \"That: \"And the sun runs on its fixed course (for a term decreed),\" (36.38) as it is recited by `Abdullah.",
      "usc_msa_ref": "520",
      "chain": [
        "30397",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7523",
      "hadith_no": "7523",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا وكيع، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت النبي صلى الله عليه وسلم عن قوله ‏{‏والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     I asked the Prophet regarding the Verse:--'And the sun runs on its fixed course for a term decreed for it.' (36.28) He said, \"Its fixed course is underneath Allah's Throne.\"",
      "usc_msa_ref": "",
      "chain": [
        "30157",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-418",
      "hadith_no": "418",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وإسحاق بن إبراهيم، جميعا عن ابن علية، - قال ابن أيوب حدثنا ابن علية، - حدثنا يونس، عن إبراهيم بن يزيد التيمي، - سمعه فيما، أعلم - عن أبيه، عن أبي ذر، أن النبي صلى الله عليه وسلم قال يوما ‏\"‏ أتدرون أين تذهب هذه الشمس ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ إن هذه تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ثم تجري حتى تنتهي إلى مستقرها تحت العرش فتخر ساجدة ولا تزال كذلك حتى يقال لها ارتفعي ارجعي من حيث جئت فترجع فتصبح طالعة من مطلعها ثم تجري لا يستنكر الناس منها شيئا حتى تنتهي إلى مستقرها ذاك تحت العرش فيقال لها ارتفعي أصبحي طالعة من مغربك فتصبح طالعة من مغربها ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتدرون متى ذاكم ذاك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr that the Messenger of Allah (may peace be upon him) one day said:                      Do you know where the sun goes? They replied: Allah and His Apostle know best. He (the Holy Prophet) observed: Verily it (the sun) glides till it reaches its resting place under the Throne. Then it falls prostrate and remains there until it is asked: Rise up and go to the place whence you came, and it goes back and continues emerging out from its rising place and then glides till it reaches its place of rest under the Throne and falls prostrate and remains in that state until it is asked: Rise up and return to the place whence you came, and it returns and emerges out from it rising place and the it glides (in such a normal way) that the people do not discern anything ( unusual in it) till it reaches its resting place under the Throne. Then it would be said to it: Rise up and emerge out from the place of your setting, and it will rise from the place of its setting. The Messenger of Allah (may peace be upon him) said. Do you know when it would happen? It would happen at the time when faith will not benefit one who has not previously believed or has derived no good from the faith.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30123",
        "20208",
        "20208",
        "20475",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-419",
      "hadith_no": "419",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبد الحميد بن بيان الواسطي، أخبرنا خالد، - يعني ابن عبد الله - عن يونس، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، أن النبي صلى الله عليه وسلم قال يوما ‏\"‏ أتدرون أين تذهب هذه الشمس ‏\"‏ بمثل معنى حديث ابن علية ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr that the Apostle of Allah (may peace be upon him) one day said:                      Do you know where the sun goes? The remaining part of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20423",
        "20475",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-420",
      "hadith_no": "420",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس فلما غابت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب فتستأذن في السجود فيؤذن لها وكأنها قد قيل لها ارجعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ في قراءة عبد الله وذلك مستقر لها ‏.‏",
      "text_en": " Abu Dharr reported:                      I entered the mosque and the Messenger of Allah (may peace be upon him) was sitting there. When the sun disappeared (from the sight) he said: O Abu Dharr! Do you know where it goes? He (the narrator) said: Allah and His Apostle know best. He (the Holy Prophet) said. Verily it goes and begs permission, for prostration (to Allah) and the permission is granted to it. Once it would be said: Return to the place whence you came, and then it would rise from its setting place. Then he, after the recitation of 'Abdullah recited it: And that is its appointed term.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-421",
      "hadith_no": "421",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، وإسحاق بن إبراهيم، - قال إسحاق أخبرنا وقال الأشج، حدثنا - وكيع، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى ‏{‏ والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I asked the Messenger of Allah (may peace be upon him) the (implication of the) words of Allah, the Exalted: The sun glides to its appointed resting place. He replied: Its appointed resting place is under the Throne.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "30123",
        "30312",
        "30200",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1189",
      "hadith_no": "1189",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أبو كامل الجحدري، حدثنا عبد الواحد، حدثنا الأعمش، ح قال وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال قلت يا رسول الله أى مسجد وضع في الأرض أول قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون سنة وأينما أدركتك الصلاة فصل فهو مسجد ‏\"‏ ‏.‏ وفي حديث أبي كامل ‏\"‏ ثم حيثما أدركتك الصلاة فصله فإنه مسجد ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I said: Messenger of Allah, which mosque was set up first on the earth? He said: Al-Masjid al-Haram (the sacred). I (again) said: Then which next? He said: It was the Masjid Aqsa. I (again) said: How long the space of time (between their setting up)? He (the Holy Prophet) said: It was forty years. And whenever the time comes for prayer, pray there, for that is a mosque; and in the hadith transmitted by Abu Kamil (the words are):\" Whenever time comes for prayer, pray, for that is a mosque (for you).\"",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "11060",
        "30201",
        "30216",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1190",
      "hadith_no": "1190",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا الأعمش، عن إبراهيم بن يزيد التيمي، قال كنت أقرأ على أبي القرآن في السدة فإذا قرأت السجدة سجد فقلت له يا أبت أتسجد في الطريق قال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم عن أول مسجد وضع في الأرض قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مسجد فحيثما أدركتك الصلاة فصل ‏\"‏ ‏.‏",
      "text_en": " Ibrahim b. Yazid al-Tayml reported:                      I used to read the Qur'an with my father in the vestibule (before the door of the mosque). When I recited the ayat (verses) concerning prostration, he prostrated himself. I said to him: Father, do you prostrate yourself in the path? He said: I heard Abu Dharr saying: I asked the Messenger of Allah (may peace be upon him) about the mosque that was first set up on the earth. He said: Masjid Harim. I said: Then which next? He said: The Masjid al-Aqsa. I said: How long is the space of time between the two? He said: Forty years. He (then) further said: The earth is a mosque for you, so wherever you are at the time of prayer, pray there.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11322",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3024",
      "hadith_no": "3024",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وأبو كريب قالوا حدثنا أبو معاوية عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، - رضى الله عنه - قال كانت المتعة في الحج لأصحاب محمد صلى الله عليه وسلم خاصة ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said that Tamattu' in Hajj was a special (concession) only for the Companions of Muhammad (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3025",
      "hadith_no": "3025",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن عياش العامري، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، - رضى الله عنه - قال كانت لنا رخصة ‏.‏ يعني المتعة في الحج ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) reported:                      Tamattu' in Hajj was a special concession for us.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20033",
        "20012",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3026",
      "hadith_no": "3026",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن فضيل، عن زبيد، عن إبراهيم التيمي، عن أبيه، قال قال أبو ذر رضى الله عنه لا تصلح المتعتان إلا لنا خاصة ‏.‏ يعني متعة النساء ومتعة الحج ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said:                      Two are the Mut'as which were not permissible but only for us, i. e. temporary marriage with women and Tamattu' in Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "20271",
        "11335",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3027",
      "hadith_no": "3027",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن بيان، عن عبد الرحمن بن أبي الشعثاء، قال أتيت إبراهيم النخعي وإبراهيم التيمي فقلت إني أهم أن أجمع العمرة والحج العام ‏.‏ فقال إبراهيم النخعي لكن أبوك لم يكن ليهم بذلك ‏.‏ قال قتيبة حدثنا جرير عن بيان عن إبراهيم التيمي عن أبيه أنه مر بأبي ذر - رضى الله عنه - بالربذة فذكر له ذلك فقال إنما كانت لنا خاصة دونكم ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abi al-Sha'tha' reported:                      I came to Ibrahim al-Nakha'I and Ibrahim Taimi and said: I intend to combine 'Umra and Hajj this year, whereupon Ibrahim al-Nakha'i said: But your father did not make such intention. Ibrahim narrated on the authority of, his father that he passed by Abu Dharr (Allah be pleased with him) at Rabdha, and made a mention of that, whereupon he said: It was a special concession for us and not for you.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11326",
        "30367",
        "20028",
        "11326",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3393",
      "hadith_no": "3393",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأبو كريب جميعا عن أبي معاوية، - قال أبو كريب حدثنا أبو معاوية، - حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، قال خطبنا علي بن أبي طالب فقال من زعم أن عندنا، شيئا نقرأه إلا كتاب الله وهذه الصحيفة - قال وصحيفة معلقة في قراب سيفه - فقد كذب فيها أسنان الإبل وأشياء من الجراحات وفيها قال النبي صلى الله تعالى عليه وسلم ‏\"‏ المدينة حرم ما بين عير إلى ثور فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا وذمة المسلمين واحدة يسعى بها أدناهم ومن ادعى إلى غير أبيه أو انتمى إلى غير مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا ‏\"‏ ‏.‏ وانتهى حديث أبي بكر وزهير عند قوله ‏\"‏ يسعى بها أدناهم ‏\"‏ ‏.‏ ولم يذكرا ما بعده وليس في حديثهما معلقة في قراب سيفه ‏.‏",
      "text_en": " Ibrahim al-Taimi reported on the authority of his father:                      'Ali b. Abi Talib (Allah be pleased with him) addressed us and said: He who thought that we have besides the Holy Qur'an anything else that we recite, he told a lie. And this document which is hanging by the sheath of the sword contains but the ages of the camels, and the nature of the wounds. He (Hadrat 'Ali) reported Allah's Apostle (may peace be upon him) as saying: Medina is sacred from 'Air to Thaur; So if anyone makes an innovation or accommodates an innovator, the curse of Allah, the angels, and all persons will fall upon him, and Allah will not accept any obligatory or supererogatory act as recompense from them. And the protection granted by the Muslims is one and must be respected by the humblest of them. If anyone makes a false claim to paternity, or being a client of other than his own masters, there is upon him the curse of Allah, the angels, and all the people. Allah will not accept from him any recompense in the form of obligatory acts or supererogatory acts. The hadith transmitted on the authority of Abu Bakr and Zabair ends with (these words): The humblest among them should respect it; and what follows after it is not mentioned there, and in the hadith transmitted by them (these words are) not found: (The document was hanging) on the sheath of his sword.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20354",
        "30216",
        "20354",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3867",
      "hadith_no": "3867",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم التيمي، عن  أبيه، قال خطبنا علي بن أبي طالب فقال من زعم أن عندنا، شيئا نقرأه إلا كتاب الله وهذه الصحيفة - قال وصحيفة معلقة في قراب سيفه - فقد كذب ‏.‏ فيها أسنان الإبل وأشياء من الجراحات وفيها قال النبي صلى الله عليه وسلم ‏\"‏ المدينة حرم ما بين عير إلى ثور فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا وذمة المسلمين واحدة يسعى بها أدناهم ومن ادعى إلى غير أبيه أو انتمى إلى غير مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا ‏\"‏ ‏.‏",
      "text_en": " Ibrahim al-Taimi reported on the authority of his father:                      'Ali b. Abu Talib (Allah be pleased with him) addressed us and said: He who thinks that we (the members of the Prophet's family) read anything else besides the Book of Allah and this Sahifa (and he said that Sahifa was tied to the scabbard of the sword) tells a lie. (This Sahifa) contains (problems) pertaining to the ages of the camels and (the recompense) of the injuries, and it also records the words of the Prophet (may peace be upon him): Medina is a sacred territory from 'Ayr to Thaur (it is most probably Uhud). He who innovates (an act or practice) or gives protection to an innovator, there is a curse of Allah and that of His angels and that of the whole humanity upon him. Allah will not accdpt from him (as a recompense) any obligatory act or supererogatory act, and the responsibility of the Muslims is a joint responsibility; even the lowest in rank can undertake the responsibility (on behalf of others), and he who claims anyone else as his father besides his own father or makes one his ally other than the one (who freed him), there is a curse of Allah. that of His angels and that of the wholemankind upon him. Allah will not accept the obligatory act of the supererogatery act (as a recompense) from him.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4396",
      "hadith_no": "4396",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، قال قال أبو مسعود البدري كنت أضرب غلاما لي بالسوط فسمعت صوتا من خلفي ‏\"‏ اعلم أبا مسعود ‏\"‏ ‏.‏ فلم أفهم الصوت من الغضب - قال - فلما دنا مني إذا هو رسول الله صلى الله عليه وسلم فإذا هو يقول ‏\"‏ اعلم أبا مسعود اعلم أبا مسعود ‏\"‏ ‏.‏ قال فألقيت السوط من يدي فقال ‏\"‏ اعلم أبا مسعود أن الله أقدر عليك منك على هذا الغلام ‏\"‏ ‏.‏ قال فقلت لا أضرب مملوكا بعده أبدا ‏.‏",
      "text_en": " Abu Mas'ud al-Badri reported:                      I was beating my slave with a whip when I heard a voice behind me: Understand, Abu Masud; but I did not recognise the voice due to intense anger. He (Abu Mas'ud) reported: As he came near me (I found) that he was the Messenger of Allah (may peace be upon him) and he was saying: Bear in mind, Abu Mas'ud; bear in mind. Abu Mas'ud. He (Aba Maslad) said: threw the whip from my hand. Thereupon he (the Holy Prophet) said: Bear in mind, Abu Mas'ud; verily Allah has more dominance upon you than you have upon your slave. I (then) said: I would never beat my servant in future.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4398",
      "hadith_no": "4398",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، التيمي عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب غلاما لي فسمعت من خلفي صوتا ‏\"‏ اعلم أبا مسعود لله أقدر عليك منك عليه ‏\"‏ ‏.‏ فالتفت فإذا هو رسول الله صلى الله عليه وسلم فقلت يا رسول الله هو حر لوجه الله ‏.‏ فقال ‏\"‏ أما لو لم تفعل للفحتك النار أو لمستك النار ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported:                      When I was beating my servant, I heard a voice behind me (saying): Abu Mas'ud, bear in mind Allah has more dominance over you than you have upon him. I turned and (found him) to be Allah's Messenger (may peace be upon him). I said: Allah's Messenger, I set him free for the sake of Allah. Thereupon he said: Had you not done that, (the gates of) Hell would have opened for you, or the fire would have burnt you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11322",
        "11405",
        "402"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4399",
      "hadith_no": "4399",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا ابن، أبي عدي عن شعبة، عن سليمان، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود، أنه كان يضرب غلامه فجعل يقول أعوذ بالله - قال - فجعل يضربه فقال أعوذ برسول الله ‏.‏ فتركه فقال رسول الله صلى الله عليه وسلم ‏\"‏ والله لله أقدر عليك منك عليه ‏\"‏ ‏.‏ قال فأعتقه ‏.‏",
      "text_en": " Abu Mas'ud reported that he had been beating his slave and he had been saying:                      I seek refuge with Allah, but he continued beating him, whereupon he said: I seek refuge with Allah's Messenger, and he spared him. Thereupon Allah's Messenger (may peace be upon him) said: By Allah, God has more dominance over you than you have over him (the slave). He said that he set him free. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but made no mention of (these words) of his: I seek refuge with Allah, I seek refuge with Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "20020",
        "11005",
        "11322",
        "11405",
        "402"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4741",
      "hadith_no": "4741",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن جرير، قال زهير حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن أبيه، قال كنا عند حذيفة فقال رجل لو أدركت رسول الله صلى الله عليه وسلم قاتلت معه وأبليت فقال حذيفة أنت كنت تفعل ذلك لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الأحزاب وأخذتنا ريح شديدة وقر فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا رجل يأتيني بخبر القوم جعله الله معي يوم القيامة ‏\"‏ ‏.‏ فسكتنا فلم يجبه منا أحد ثم قال ‏\"‏ ألا رجل يأتينا بخبر القوم جعله الله معي يوم القيامة ‏\"‏ ‏.‏ فسكتنا فلم يجبه منا أحد ثم قال ‏\"‏ ألا رجل يأتينا بخبر القوم جعله الله معي يوم القيامة ‏\"‏ ‏.‏ فسكتنا فلم يجبه منا أحد فقال ‏\"‏ قم يا حذيفة فأتنا بخبر القوم ‏\"‏ ‏.‏ فلم أجد بدا إذ دعاني باسمي أن أقوم قال ‏\"‏ اذهب فأتني بخبر القوم ولا تذعرهم على ‏\"‏ ‏.‏ فلما وليت من عنده جعلت كأنما أمشي في حمام حتى أتيتهم فرأيت أبا سفيان يصلي ظهره بالنار فوضعت سهما في كبد القوس فأردت أن أرميه فذكرت قول رسول الله صلى الله عليه وسلم ‏\"‏ ولا تذعرهم على ‏\"‏ ‏.‏ ولو رميته لأصبته فرجعت وأنا أمشي في مثل الحمام فلما أتيته فأخبرته بخبر القوم وفرغت قررت فألبسني رسول الله صلى الله عليه وسلم من فضل عباءة كانت عليه يصلي فيها فلم أزل نائما حتى أصبحت فلما أصبحت قال ‏\"‏ قم يا نومان ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Ibrahim al-Taimi on the authority of his father who said:                      We were sitting in the company of Hudhaifa. A man said: If I were in the time of the Messenger of Allah (may peace be upon him), I would have fought by his side and would have striven hard for his causes. Hudhaifa said: You might have done that, (but you should not make a flourish of your enthusiasm). I was with the Messenger of Allah (may peace be upon him) on the night of the Battle of Abzib and we were gripped by a violent wind and severe cold. The Messenger of Allah (may peace be him) said: Hark, the man who (goes reconnoitring and) brings me the news of the enemy shall be ranked with me on the Day of Judgment by Allah (the Glorious and Exalted). We all kept quiet and none of us responed to him. (Again) he said: Hark, a man who (goes reconnoitring and) brings me the news of the enemy shall be ranked with me on the Day of Judgment by Allah (the Glorious and Exalted). We kept quiet and none of us responded to him. He again said: Hark, a man who (goes reconnoitring and) brings me the news of the enemy shall be ranked with me on the Day of Judgtuent by Allah (the Glorious and Exalted) Then he said: Get up Hudhaifa, bring me the news of the enemy. When he called me by name I had no alternative but to get up. He said: Go and bring me information about the enemy, and do nothing that may provoke them against me. When I left him, I felt warm as if I were walking in a heated bath untill I reached them. I saw Abu Sufyan warming his back against fire I put an arrow in the middle of the bow. intending to shoot at him, when I recalled the words of the Messenger of Allah (may peace be upon him)\" Do not provoke them against me.\" Had I shot at him, I would have hit him. But I returned and (felt warm as if) I were walking in a heated bath (hammam). Presenting myself before him, I gave him information about the enemy. When I had done so, I began to feel cold, so the Messenger of Allah (may peace be upon him) wrapped me in a blanket that he had in excess to his own requirement and with which he used to cover himself while saying his prayers. So I continued to sleep until it was morning. When it was morning he said: Get up, O heavy sleeper.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30123",
        "20028",
        "20321",
        "4057",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5286",
      "hadith_no": "5286",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني زهير بن حرب، حدثنا  جرير، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، كلهم عن  الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي، قال نهى رسول الله صلى الله عليه وسلم أن ينتبذ في الدباء والمزفت ‏.‏ هذا حديث جرير ‏.‏ وفي حديث عبثر وشعبة أن النبي صلى الله عليه وسلم نهى عن الدباء والمزفت ‏.‏",
      "text_en": " 'Ali reported that Allah's Messenger (may peace be upon him) forbade to prepare Nabidh in gourd and varnished jar. This hadith has been narrated through another chain of transmitters with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "30022",
        "20028",
        "30126",
        "20173",
        "11060",
        "11322",
        "11330",
        "5"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6632",
      "hadith_no": "6632",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، وهناد بن السري، قالا حدثنا أبو الأحوص، عن منصور، عن إبراهيم بن يزيد، عن عبيدة السلماني، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي القرن الذين يلوني ثم الذين يلونهم ثم الذين يلونهم ثم يجيء قوم تسبق شهادة أحدهم يمينه ويمينه شهادته ‏\"‏ ‏.‏ لم يذكر هناد القرن في حديثه وقال قتيبة ‏\"‏ ثم يجيء أقوام ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      The best of my Umma would be those of the generation nearest to mine. Then those nearest to them, then those nearest to them, then people would come whose witness would precede the oath and the oath will precede the witness. Hannad has not made the mention of Qarn in his narration. Qutaiba said that, instead of the word Qaum, the word Aqwam has been used.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30480",
        "20327",
        "11067",
        "11322",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6724",
      "hadith_no": "6724",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال دخلت على رسول الله صلى الله عليه وسلم وهو يوعك فمسسته بيدي فقلت يا رسول الله إنك لتوعك وعكا شديدا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل إني أوعك كما يوعك رجلان منكم ‏\"‏ ‏.‏ قال فقلت ذلك أن لك أجرين فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يصيبه أذى من مرض فما سواه إلا حط الله به سيئاته كما تحط الشجرة ورقها ‏\"‏ ‏.‏ وليس في حديث زهير فمسسته بيدي ‏.‏",
      "text_en": " 'Abdullah reported:                      I visited Allah's Messenger (may peace be upon him) as he was running a high temperature. I touched his body with my hand and said to him: Allah's Messenger, you are running a high temperature, whereupon Allah's Messenger (may peace be upon him) said: Yes, it is so. I comparatively have a more severe fever than any one of you. I said: Is it because there is a double reward in store for you? Thereupon Allah's Messenger (may peace be upon him) said: Yes, it is so. And Allah's Messenger (may peace be upon him) again said: When a Muslim falls ill, his compensation is that his minor sins are obliterated just as leaves fall (in autumn). In the hadith transmitted on the authority of Zubair there is (no mention of these words):\" I touched his body with my hands.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30022",
        "30123",
        "30312",
        "4057",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6807",
      "hadith_no": "6807",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، - واللفظ لقتيبة - قالا حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تعدون الرقوب فيكم ‏\"‏ ‏.‏ قال قلنا الذي لا يولد له ‏.‏ قال ‏\"‏ ليس ذاك بالرقوب ولكنه الرجل الذي لم يقدم من ولده شيئا ‏\"‏ ‏.‏ قال ‏\"‏ فما تعدون الصرعة فيكم ‏\"‏ ‏.‏ قال قلنا الذي لا يصرعه الرجال ‏.‏ قال ‏\"‏ ليس بذلك ولكنه الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported Allah's Messenger (may peace be upon him) as saying:                      Whom do you count as\" Raqub\" amongst you? They (his Companions) said: One who has no children (the children are born unto him but they do not survive). Thereupon he (the Holy Prophet) said: He is not a Raqub but Raqub is one who does not find his child as the forerunner (in Paradise). He then said: Whom do you count as a wrestler amongst you? We said: He who wrestles with persons. He said: No, it is not he but one who controls himself when in a fit of rage.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-178",
      "hadith_no": "178",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، وعبد الرحمن، قالا حدثنا سفيان، عن أبي روق، عن إبراهيم التيمي، عن عائشة، أن النبي صلى الله عليه وسلم قبلها ولم يتوضأ ‏.‏ قال أبو داود كذا رواه الفريابي وغيره ‏.‏ قال أبو داود وهو مرسل إبراهيم التيمي لم يسمع من عائشة ‏.‏ قال أبو داود مات إبراهيم التيمي ولم يبلغ أربعين سنة وكان يكنى أبا أسماء ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) kissed me and did not perform ablution.Abu Dawud said: This tradition is Mursal (i.e. where the link of the Companions is missing and the Successor reports from the Prophet directly). Ibrahim at-Taimi did not hear anything from 'Aishah.Abu Dawud said: Al-Firyabi and other narrated this tradition in a like manner.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20012",
        "11322",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2034",
      "hadith_no": "2034",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي، - رضى الله عنه - قال ما كتبنا عن رسول الله صلى الله عليه وسلم إلا القرآن وما في هذه الصحيفة ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المدينة حرام ما بين عائر إلى ثور فمن أحدث حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه عدل ولا صرف وذمة المسلمين واحدة يسعى بها أدناهم فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه عدل ولا صرف ومن والى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " ‘Ali said “We wrote down nothing on the authority of the Apostle of Allaah(ﷺ) but the Qur’an and what this document contains.”. He reported the Apostle of Allaah(ﷺ) as saying “ Madeenah is sacred from A’ir to Thawr so if anyone produces an innovation (in it) or gives protection to an innovator the curse of Allaah, angels and all men will fall upon him and no repentance or ransom will be accepted from him. The protection granted by Muslim is one (even if) the humblest of them grants it. So if anyone breaks a covenant made by a Muslim the curse of Allaah, angels and all men will fall upon him and no repentance or ransom will be accepted from him. If anyone attributes his manumission to people without the permission of his masters the curse of Allaah, angels and all men will fall upon him and no repentance or ransom will be accepted from him.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4002",
      "hadith_no": "4002",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وعبيد الله بن عمر بن ميسرة، - المعنى - قالا حدثنا يزيد بن هارون، عن سفيان بن حسين، عن الحكم بن عتيبة، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كنت رديف رسول الله صلى الله عليه وسلم وهو على حمار والشمس عند غروبها فقال ‏\"‏ هل تدري أين تغرب هذه ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تغرب في عين حامية ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     I was sitting behind the Messenger of Allah (ﷺ) who was riding a donkey while the sun was setting. He asked: Do you know where this sets ? I replied: Allah and his Apostle know best. He said: It sets in a spring of warm water (Hamiyah).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20472",
        "20655",
        "11069",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4779",
      "hadith_no": "4779",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تعدون الصرعة فيكم ‏\"‏ ‏.‏ قالوا الذي لا يصرعه الرجال ‏.‏ قال ‏\"‏ لا ولكنه الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " ‘ABD ALLAH (B. MAS’UD) REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING:                      WHOM DO YOU CONSIDER A WRESTLER AMONG YOU? THE PEOPLE REPLIED: (THE MAN) WHOM THE MEN CANNOT DEFEAT IN WRESTLING. HE SAID: NO, IT IS HE WHO CONTROLS HIMSELF WHEN HE IS ANGRY.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5159",
      "hadith_no": "5159",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو معاوية، ح وحدثنا ابن المثنى، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب غلاما لي فسمعت من خلفي صوتا ‏\"‏ اعلم أبا مسعود ‏\"‏ ‏.‏ قال ابن المثنى مرتين ‏\"‏ لله أقدر عليك منك عليه ‏\"‏ ‏.‏ فالتفت فإذا هو النبي صلى الله عليه وسلم فقلت يا رسول الله هو حر لوجه الله ‏.‏ قال ‏\"‏ أما إنك لو لم تفعل للفعتك النار أو ‏\"‏ لمستك النار ‏\"‏ ‏.‏",
      "text_en": " Abu Mas’ud al-Ansari said:                      when I was beating a servant of mine, I heard a voice behind me saying: know, Abu Mas’ud-Ibn al-Muthanna said: “twice”-that Allah has more power over you than you have over him. I turned round and saw that it was that it was the prophet (May peace be upon him). I said : Messenger of Allah! He is free for Allah’s sake. He said : If you had not done it, fire would have burned you or the fire would have touched you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20354",
        "30170",
        "20354",
        "11060",
        "11322",
        "11405",
        "402"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-95",
      "hadith_no": "95",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن سعيد بن مسروق، عن إبراهيم التيمي، عن عمرو بن ميمون، عن أبي عبد الله الجدلي، عن خزيمة بن ثابت، عن النبي صلى الله عليه وسلم أنه سئل عن المسح على الخفين فقال ‏\"‏ للمسافر ثلاثة وللمقيم يوم ‏\"‏ ‏.‏ وذكر عن يحيى بن معين أنه صحح حديث خزيمة بن ثابت في المسح ‏.‏ وأبو عبد الله الجدلي اسمه عبد بن عبد ويقال عبد الرحمن بن عبد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن علي وأبي بكرة وأبي هريرة وصفوان بن عسال وعوف بن مالك وابن عمر وجرير ‏.‏",
      "text_en": " Khuzaimah bin Thabit narrated:                     \"The Prophet was asked about wiping over the Khuff.  So he said: \"Three (days) for the traveler, and one day for the resident.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "20016",
        "11322",
        "11382",
        "19307",
        "410"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-813",
      "hadith_no": "813",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا إبراهيم بن يزيد، عن محمد بن عباد بن جعفر، عن ابن عمر، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما يوجب الحج قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل عليه عند أهل العلم أن الرجل إذا ملك زادا وراحلة وجب عليه الحج ‏.‏ وإبراهيم بن يزيد هو الخوزي المكي وقد تكلم فيه بعض أهل العلم من قبل حفظه ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"A man came to the Prophet and said: 'O Messenger of Allah! What is it that makes Hajj obligatory?' He said: \"The provisions and a means of conveyance.\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20032",
        "11322",
        "11262",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2074",
      "hadith_no": "2074",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا مؤمل، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب مملوكا لي فسمعت قائلا من خلفي يقول ‏\"‏ اعلم أبا مسعود اعلم أبا مسعود ‏\"‏ ‏.‏ فالتفت فإذا أنا برسول الله صلى الله عليه وسلم فقال ‏\"‏ لله أقدر عليك منك عليه ‏\"‏ ‏.‏ قال أبو مسعود فما ضربت مملوكا لي بعد ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإبراهيم التيمي هو إبراهيم بن يزيد بن شريك ‏.‏",
      "text_en": " Abu Mas'ud [Al-Ansari] said:                     \"I was beating a slave of mine and I heard someone behind me saying: 'Beware O Abu Mas'ud! Beware O Abu Mas'ud!' So I turned around and saw that it was the Messenger of Allah. He said: 'Allah has more power over you than you do over him.\" Abu Mas'ud said: \"I have not beaten any slave of mine since then.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30180",
        "20012",
        "11060",
        "11322",
        "11405",
        "402"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2127-2",
      "hadith_no": "2127",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، قال خطبنا علي فقال من زعم أن عندنا شيئا نقرؤه إلا كتاب الله وهذه الصحيفة صحيفة فيها أسنان الإبل وأشياء من الجراحات فقد كذب وقال فيها قال رسول الله صلى الله عليه وسلم ‏\"‏ المدينة حرام ما بين عير إلى ثور فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا ومن ادعى إلى غير أبيه أو تولى غير مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه صرف ولا عدل وذمة المسلمين واحدة يسعى بها أدناهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن علي عن النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى وروى بعضهم عن الأعمش عن إبراهيم التيمي عن الحارث بن سويد عن علي نحوه ‏.‏  قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن علي عن النبي صلى الله عليه وسلم",
      "text_en": " Ibrahim At-Taimi narrated from his father:                     \"'Ali delivered a Khutbah for us in which he said: 'Whoever claims that we have some book to read other than Allah's Book and this paper, which include camel's ages and things related to (relatiation for) wounds, then he has lied.\" And he said in it: \"Al-Madinah is sacred, what is between 'Air to Thawr, so whoever introduces in it any innovation or shelters an innovator then upon him is the curse of Allah, the angels, and all people. On the Day of Judgment, Allah will not accept his compulsory nor optional good deeds. And whoever claims someone else to be his father, or claims Wala' for someone other than his Mawali, then upon him is the curse of Allah, the angels, and the people; his compulsory and optional good deeds shall not be accepted. The covenants of the Muslims are one, it covers the rest of them.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Some of them reported it similarly from Al-A'mash, from Ibrahim At-Taimi, from Al-Harith bin Suwaid from 'Ali.[Abu 'Eisa said:] It has been reported through more than one route from 'Ali [from the Prophet (ﷺ)].",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2186-2",
      "hadith_no": "2186",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد حين غابت الشمس والنبي صلى الله عليه وسلم جالس فقال ‏\"‏ يا أبا ذر أتدري أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب تستأذن في السجود فيؤذن لها وكأنها قد قيل لها اطلعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ ‏\"‏ وذلك مستقر لها ‏\"‏ ‏.‏ قال وذلك قراءة عبد الله بن مسعود ‏.‏ قال أبو عيسى وفي الباب عن صفوان بن عسال وحذيفة بن أسيد وأنس وأبي موسى ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Dharr said:                     \"I entered the Masjid at sunset, and the Prophet(s.a.w) was sitting. He said: 'O Abu Dharr! Do you know where this(sun) goes?' I said:'Allah and His Messenger know better.' He said: 'Indeed it goes to seek permission to prostrate, so it is permitted. And it is as if it has been said to it: \"Rise from whence you came.\" So it shall rise from its setting place.' Then he recited: 'That is its fixed course.\"' He said: \"That is the recitation of 'Abdulla bim Mas'ud.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3268",
      "hadith_no": "3268",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا إبراهيم بن يزيد، قال سمعت محمد بن عباد بن جعفر المخزومي، يحدث عن ابن عمر، قال قام رجل إلى النبي صلى الله عليه وسلم فقال من الحاج يا رسول الله قال ‏\"‏ الشعث التفل ‏\"‏ ‏.‏ فقام رجل آخر فقال أى الحج أفضل قال ‏\"‏ العج والثج ‏\"‏ ‏.‏ فقام رجل آخر فقال ما السبيل يا رسول الله قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث ابن عمر إلا من حديث إبراهيم بن يزيد الخوزي المكي ‏.‏ وقد تكلم بعض أهل الحديث في إبراهيم بن يزيد من قبل حفظه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"A man stood before the Prophet (ﷺ) and said: 'Who is the (real) Hajj pilgrim, O Messenger of Allah!' He said: 'The one with dishevelled hair who smells bad.' So another man stood and said: 'Which Hajj is most virtuous, O Messenger of Allah?' He said: 'The one with loud voices and blood (of the sacrifice).' Another man stood and said: 'What is 'the means', O Messenger of Allah?' He said: 'Provisions and a mount.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20121",
        "11322",
        "30377",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3534",
      "hadith_no": "3534",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال دخلت المسجد حين غابت الشمس والنبي صلى الله عليه وسلم جالس فقال النبي صلى الله عليه وسلم ‏\"‏ أتدري يا أبا ذر أين تذهب هذه ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها تذهب فتستأذن في السجود فيؤذن لها وكأنها قد قيل لها اطلعي من حيث جئت فتطلع من مغربها ‏\"‏ ‏.‏ قال ثم قرأ ‏:‏ ‏(‏وذلك مستقر لها ‏)‏ قال وذلك قراءة عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Dharr:                     \"I entered the Masjid when the sun had set, and the Prophet (ﷺ) was sitting. He said: 'O Abu Dharr! Do you know where this goes?' I said: 'Allah and His Messenger know better.' He said: 'Indeed it goes to seek permission to prostrate, so it is permitted. And it is as if it has been said to it: \"Rise from its setting place.' Then he recited: 'That is its fixed course.'\" He said: \"That is the recitation of 'Abdullah bin Mas'ud.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-171",
      "hadith_no": "171",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى بن سعيد، عن سفيان، قال أخبرني أبو روق، عن إبراهيم التيمي، عن عائشة، أن النبي صلى الله عليه وسلم كان يقبل بعض أزواجه ثم يصلي ولا يتوضأ ‏.‏ قال أبو عبد الرحمن ليس في هذا الباب حديث أحسن من هذا الحديث وإن كان مرسلا وقد روى هذا الحديث الأعمش عن حبيب بن أبي ثابت عن عروة عن عائشة ‏.‏ قال يحيى القطان حديث حبيب عن عروة عن عائشة هذا وحديث حبيب عن عروة عن عائشة تصلي وإن قطر الدم على الحصير لا شىء ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet (ﷺ) used to kiss one of his wives then pray without performing Wudu'.Abu 'Abdur-Rahman said:                      \"There is nothing for this chapter which is better than this hadith, even though it is Mursal. And Al-A'mash reported this Hadith from Habib bin Abi Thabit, from 'Urwah, from 'Aishah.Yahya Al-Qattan said: \"This is the Hadith of Habib from 'Urwah, from 'Aishah. And the Hadith of Habib from 'Urwah, from 'Aishah: \"She prays even if blood drips on the mat\" is nothing.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20012",
        "11322",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-403",
      "hadith_no": "403",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، حدثنا محمد بن موسى، قال حدثنا إبراهيم بن يزيد، عن رقبة، عن مجزأة الأسلمي، عن ابن أبي أوفى، قال كان النبي صلى الله عليه وسلم يقول ‏‏\"‏‏ اللهم طهرني بالثلج والبرد والماء البارد اللهم طهرني من الذنوب كما يطهر الثوب الأبيض من الدنس ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Ibn Abi Awfa said:                      \"The Prophet (ﷺ) used to say: 'Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid, Allahumma tahhirni min adh-dhunub kama yutahhar ath-thawb al-abyad min ad-danas (O Allah, purify me with snow and hail and cold water, O Allah, purify me of sin as a white garment is cleansed of dirt).\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "11322",
        "5115"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2809",
      "hadith_no": "2809",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن يزيد، عن عبد الرحمن، قال حدثنا سفيان، عن الأعمش، وعياش العامري، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، في متعة الحج قال كانت لنا رخصة ‏.‏",
      "text_en": " It was narrated that Abu Dharr said concerning Tamattu\" in Hajj:                     it was only for us.\"",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "20012",
        "11060",
        "11322",
        "11405"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2810",
      "hadith_no": "2810",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد، قال حدثنا شعبة، قال سمعت عبد الوارث بن أبي حنيفة، قال سمعت إبراهيم التيمي، يحدث عن أبيه، عن أبي ذر، قال في متعة الحج ليست لكم ولستم منها في شىء إنما كانت رخصة لنا أصحاب محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Dharr said concerning Tamattu' in Hajj:                     it is not for you, and you have nothing to do with it; it was only for us, the Companions of Muhammad.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20278",
        "20020",
        "25175",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2811",
      "hadith_no": "2811",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا بشر بن خالد، قال أنبأنا غندر، عن شعبة، عن سليمان، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كانت المتعة رخصة لنا ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     Tamattu was just for us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2812",
      "hadith_no": "2812",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى بن آدم، قال حدثنا مفضل بن مهلهل، عن بيان، عن عبد الرحمن بن أبي الشعثاء، قال كنت مع إبراهيم النخعي وإبراهيم التيمي فقلت لقد هممت أن أجمع العام الحج والعمرة ‏.‏ فقال إبراهيم لو كان أبوك لم يهم بذلك ‏.‏ قال وقال إبراهيم التيمي عن أبيه عن أبي ذر قال إنما كانت المتعة لنا خاصة ‏.‏",
      "text_en": " It was narrated that Abdur-Rahman bin Abi Ash-Shatha Said:                     \"I was with Ibrahm An-Nakha'i and Ibrahim At-taimi, and I said: 'I wanted to combine Hajj and 'Umrah this year,' but Ibrahim said: 'If you father were alive, he would not do that.' And Ibrahim At-Taimi said, (narrating) from his father, that Abu Dharr said: 'Tamattu' was only for us\". (Sahib)",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "11326",
        "11322"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3612",
      "hadith_no": "3612",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيكم مال وارثه أحب إليه من ماله ‏\"‏‏.‏ قالوا يا رسول الله ما منا من أحد إلا ماله أحب إليه من مال وارثه‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اعلموا أنه ليس منكم من أحد إلا مال وارثه أحب إليه من ماله مالك ما قدمت ومال وارثك ما أخرت ‏\"‏‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"The Messenger of Allah said: 'For whom among you is the wealth of his heirs dearer to him than his own wealth?' They said: 'O Messenger of Allah, there is no one among us for whom his own wealth is not dearer to him than the wealth of his heirs.' The Messenger of Allah said: 'Know that there is no one among you for whom the wealth of his heirs is not dearer than his own wealth. Your wealth is that which you have sent on ahead, and the wealth of your heirs is that which you have kept.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11330",
        "16"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5627",
      "hadith_no": "5627",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، عن سفيان، عن سليمان، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي، كرم الله وجهه عن النبي صلى الله عليه وسلم أنه نهى عن الدباء والمزفت ‏.‏",
      "text_en": " It was narrated from 'Ali - may Allah honor his face - that:                     The Prophet [SAW] forbade Ad-Dubba' (gourds) and Al-Muzaffat.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11060",
        "11322",
        "11330"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-24",
      "hadith_no": "24",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاذ بن معاذ، عن ابن عون، حدثنا مسلم البطين، عن إبراهيم التيمي، عن أبيه، عن عمرو بن ميمون، قال ما أخطأني ابن مسعود عشية خميس إلا أتيته فيه قال فما سمعته يقول لشىء قط قال رسول الله  صلى الله عليه وسلم  فلما كان ذات عشية قال قال رسول الله  صلى الله عليه وسلم  - قال فنكس ‏.‏ قال فنظرت إليه فهو قائم محللة أزرار قميصه قد اغرورقت عيناه وانتفخت أوداجه قال أو دون ذلك أو فوق ذلك أو قريبا من ذلك أو شبيها بذلك ‏.‏",
      "text_en": " Amr bin Maimun said :                     \"I used to visit Ibn Mas'ud every Thursday afternoon but he never uttered the words: 'The Messenger of Allah (ﷺ) said.' Then one evening, he said: 'The Messenger of Allah (ﷺ) said,' then he let his head hang down.\" He said: \"I looked at him and saw his shirt was unfastened; his eyes were filled with tears, and his veins were bulging out (with fear). He said:' Or more than that, or less than that, or close to that or something similar.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20286",
        "11071",
        "11393",
        "11322",
        "11405",
        "11382"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-596",
      "hadith_no": "596",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن إبراهيم التيمي، عن عمرو بن ميمون، عن خزيمة بن ثابت، قال جعل رسول الله  صلى الله عليه وسلم  للمسافر ثلاثا ولو مضى السائل على مسألته لجعلها خمسا ‏.‏",
      "text_en": " It was narrated that Khuzaimah bin Thabit said:                     \"The Messenger of Allah set a time limit for the traveler of three days, and if the questioner had persisted in asking, he would have made it five (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "20016",
        "11322",
        "11382",
        "410"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-597",
      "hadith_no": "597",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت إبراهيم التيمي، يحدث عن الحارث بن سويد، عن عمرو بن ميمون، عن خزيمة بن ثابت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة أيام - أحسبه قال - ولياليهن للمسافر في المسح على الخفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khuzaimah bin Thabit that:                     The Prophet said: \"Three days.\" I think he said, \"And three nights during which the traveler may wipe over his leather socks.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11350",
        "11322",
        "11330",
        "11382",
        "410"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-753",
      "hadith_no": "753",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا محمد بن عبيد، ح وحدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر الغفاري، قال قلت يا رسول الله أى مسجد وضع أول قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ ثم المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مصلى فصل حيث ما أدركتك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr Al-Ghifari said:                     \"I said: 'O Messenger of Allah! Which mosque was built first?' He said: 'Al-Masjid Al-Haram (in Makkah).' I said: 'Then which?' He said: 'then Al-Masjid Al-Aqsa (in Jerusalem).' I said: 'How many years between them?' He said: 'Forty years, but the whole earth is a mosque for you, so pray wherever you are when the time for prayer comes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38412",
        "30213",
        "38409",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1588",
      "hadith_no": "1588",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن عبد الله الأودي، حدثنا وكيع، عن إبراهيم بن يزيد المكي، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تدفنوا موتاكم بالليل إلا أن تضطروا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)said:                      “Do not bury your dead at night unless you are forced to.”",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "11322",
        "11263",
        "34"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3008",
      "hadith_no": "3008",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مروان بن معاوية، ح وحدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا إبراهيم بن يزيد المكي، عن محمد بن عباد بن جعفر المخزومي، عن ابن عمر، قال قام رجل إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله ما يوجب الحج قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ قال يا رسول الله فما الحاج قال ‏\"‏ الشعث التفل ‏\"‏ ‏.‏ وقام آخر فقال يا رسول الله وما الحج قال ‏\"‏ العج والثج ‏\"‏ ‏.‏ قال وكيع يعني بالعج العجيج بالتلبية والثج نحر البدن ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “A man stood up and said to theProphet (ﷺ): ‘O Messenger of Allah! What makes Hajj obligatory?’Hesaid: ‘Provision and a mount.’ He said: ‘O Messenger ofAllah, what isthe (real) Hajj?’ He said: ‘The one withdishevelled hair and noperfume.’ Another (man) stood up and said:‘O Messenger of Allah, whatis the (real) Hajj?’ He said:‘Raising one’s voice and slaughteringthe sacrificial animal.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20201",
        "38409",
        "20032",
        "11322",
        "30377",
        "18"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3027",
      "hadith_no": "3027",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا إبراهيم بن يزيد، عن أبي الزبير، عن جابر، قال خطبنا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ مهل أهل المدينة من ذي الحليفة ومهل أهل الشام من الجحفة ومهل أهل اليمن من يلملم ومهل أهل نجد من قرن ومهل أهل المشرق من ذات عرق ‏\"‏ ‏.‏ ثم أقبل بوجهه للأفق ثم قال ‏\"‏ اللهم أقبل بقلوبهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ)addressedus and said: ‘The Talbiyah of the people of Al-Madinahbegins atDhul-Hulaifah. The Talbiyah of the people of Sham begins atJuhfah.The Talbiyah of the people of Yemen begins at Yalamlam. TheTalbiyahof the people of Najd begins at Qarn. The Talbiyah of thepeople ofthe east begins at Dhat ‘Irq.’ Then he turned to face the(eastern) horizon and said: ‘O Allah, make their heartssteadfast.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11322",
        "11263",
        "34"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3099",
      "hadith_no": "3099",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال كانت المتعة في الحج لأصحاب محمد  صلى الله عليه وسلم  خاصة ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “Tamattu’ in Hajj was for theCompanions of Muhammad (ﷺ) specifically.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3187",
      "hadith_no": "3187",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا إبراهيم بن يزيد، عن طاوس، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  أن ينفر الرجل حتى يكون آخر عهده بالبيت ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade a man to depart until the last thing he did was (Tawafaround)the House.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11322",
        "11053",
        "18"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 68,
  "grade_display": {
    "en": "Follower (Tabi') [5th Generation]",
    "ar": "تابعي [الجيل الخامس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
  }
}