{
  "id": "11327",
  "name": "Jami' bin Abi Rashid جامع بن أبي راشد الكاهلي",
  "full_name": "Jami' bin Abi Rashid جامع بن أبي راشد الكاهلي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Kahali",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "21522",
      "name": "al-Rabi' bin Abi Rashid الربيع بن أبي راشد",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11398",
      "name": "al-Mandhir bin Ya'la al-Thauri منذر بن يعلى الثوري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1895",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا جامع، عن أبي وائل، عن حذيفة، قال قال عمر  رضى الله عنه  من يحفظ حديثا عن النبي صلى الله عليه وسلم في الفتنة قال حذيفة أنا سمعته يقول ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصيام والصدقة ‏\"‏‏.‏ قال ليس أسأل عن ذه، إنما أسأل عن التي تموج كما يموج البحر‏.‏ قال وإن دون ذلك بابا مغلقا‏.‏ قال فيفتح أو يكسر قال يكسر‏.‏ قال ذاك أجدر أن لا يغلق إلى يوم القيامة‏.‏ فقلنا لمسروق سله أكان عمر يعلم من الباب فسأله فقال نعم، كما يعلم أن دون غد الليلة‏.‏",
      "text_en": " Narrated Abu Wail from Hudhaifa:                     `Umar asked the people, \"Who remembers the narration of the Prophet about the affliction?\" Hudhaifa said, \"I heard the Prophet saying, 'The affliction of a person in his property, family and neighbors is expiated by his prayers, fasting, and giving in charity.\" `Umar said, \"I do not ask about that, but I ask about those afflictions which will spread like the waves of the sea.\" Hudhaifa replied, \"There is a closed gate in front of those afflictions.\" `Umar asked, \"Will that gate be opened or broken?\" He replied, \"It will be broken.\" `Umar said, \"Then the gate will not be closed again till the Day of Resurrection.\" We said to Masruq, \"Would you ask Hudhaifa whether `Umar knew what that gate symbolized?\" He asked him and he replied \"He (`Umar) knew it as one knows that there will be night before tomorrow, morning.",
      "chain": [
        "30026",
        "20005",
        "11327",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "3715",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا جامع بن أبي راشد، حدثنا أبو يعلى، عن محمد ابن الحنفية، قال قلت لأبي أى الناس خير بعد رسول الله صلى الله عليه وسلم قال أبو بكر‏.‏ قلت ثم من قال ثم عمر‏.‏ وخشيت أن يقول عثمان قلت ثم أنت قال ما أنا إلا رجل من المسلمين‏.‏",
      "text_en": " Narrated Muhammad bin Al-Hanafiya:                     I asked my father (`Ali bin Abi Talib), \"Who are the best people after Allah's Apostle ?\" He said, \"Abu Bakr.\" I asked, \"Who then?\" He said, \"Then `Umar. \" I was afraid he would say \"Uthman, so I said, \"Then you?\" He said, \"I am only an ordinary person.",
      "chain": [
        "28531",
        "20012",
        "11327",
        "30167",
        "10600"
      ]
    },
    {
      "hadith_no": "7535",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبد الملك بن أعين، وجامع بن أبي راشد، عن أبي وائل، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتطع مال امرئ مسلم بيمين كاذبة، لقي الله وهو عليه غضبان ‏\"‏‏.‏ قال عبد الله ثم قرأ رسول الله صلى الله عليه وسلم مصداقه من كتاب الله جل ذكره ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة ولا يكلمهم الله‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Whoever takes the property of a Muslim by taking a false oath, will meet Allah Who will be angry with him.\" Then the Prophet recited the Verse:-- 'Verily those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter, neither will Allah speak to them, nor look at them.' (3.77)",
      "chain": [
        "30418",
        "20005",
        "11367",
        "11327",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، عن جامع بن أبي راشد، وعبد الملك بن أعين، سمعا شقيق بن سلمة، يقول سمعت ابن مسعود، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف على مال امرئ مسلم بغير حقه لقي الله وهو عليه غضبان ‏\"‏ قال عبد الله ثم قرأ علينا رسول الله صلى الله عليه وسلم مصداقه من كتاب الله ‏{‏ إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Ibn Mas'ud says:                      I heard the Messenger of Allah observing: He who took an oath on the property of a Muslim without legitimate right would meet Allah and He would be angry, with him. Then the Messenger of Allah (may peace be upon him) in support of his contention recited the verse:\" Verily those who barter Allah's covenant and their oaths at a small price.",
      "chain": [
        "30421",
        "20005",
        "11327",
        "11367",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7452",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن جامع بن أبي راشد، والأعمش، عن  أبي وائل، عن حذيفة، قال قال عمر من يحدثنا عن الفتنة، واقتص الحديث، بنحو حديثهم ‏.‏",
      "text_en": " Hudhaifa reported that Umar said:                      Who would narrate to us (the ahadith pertaining to turmoil) and he reported a badith similar to these ahadith.",
      "chain": [
        "30421",
        "20005",
        "11327",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "3327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا الحسين بن عيسى البسطامي، وحامد بن يحيى، وعبد الله بن محمد الزهري، قالوا حدثنا سفيان، عن جامع بن أبي راشد، وعبد الملك بن أعين، وعاصم، عن أبي وائل، عن قيس بن أبي غرزة، بمعناه قال ‏\"‏ يحضره الكذب والحلف ‏\"‏ ‏.‏ وقال عبد الله الزهري ‏\"‏ اللغو والكذب ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Qais b. Abi Gharazah through a different chain of narrators to the same effect. This version has:                      \"Lying and swearing have a place on i.\" 'Abd Allah al-Zuhri said: \"Unprofitable speech and lying.\"",
      "chain": [
        "30326",
        "20005",
        "11327",
        "11367",
        "11080",
        "11353",
        "11046"
      ]
    },
    {
      "hadith_no": "4629",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، حدثنا جامع بن أبي راشد، حدثنا أبو يعلى، عن محمد ابن الحنفية، قال قلت لأبي أى الناس خير بعد رسول الله صلى الله عليه وسلم قال أبو بكر ‏.‏ قال قلت ثم من قال ثم عمر ‏.‏ قال ثم خشيت أن أقول ثم من فيقول عثمان فقلت ثم أنت يا أبة قال ما أنا إلا رجل من المسلمين ‏.‏",
      "text_en": " Muhammad b. al-Hanafiyyah said:                      I said to my father: Which of the people after the Messenger of Allah (ﷺ) is best? He replied: Abu Bakr. I then asked: Who comes next? He said: ‘Umar. I was then afraid of asking him who came next, and he might mention ‘Uthman, so I said: You came next, O my father? He said: I am only a man among the Muslims.",
      "chain": [
        "28531",
        "20012",
        "11327",
        "30167",
        "10600"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن جامع، وهو ابن أبي راشد وعبد الملك بن أعين عن أبي وائل، عن عبد الله بن مسعود، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ ما من رجل لا يؤدي زكاة ماله إلا جعل الله يوم القيامة في عنقه شجاعا ‏\"‏ ‏.‏ ثم قرأ علينا مصداقه من كتاب الله عز وجل ‏:‏ ‏(‏ولا تحسبن الذين يبخلون بما آتاهم الله من فضله ‏)‏ الآية ‏.‏ وقال مرة قرأ رسول الله صلى الله عليه وسلم مصداقه ‏:‏ ‏(‏سيطوقون ما بخلوا به يوم القيامة ‏)‏ ‏\"‏ ومن اقتطع مال أخيه المسلم بيمين لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ ثم قرأ رسول الله صلى الله عليه وسلم مصداقه من كتاب الله ‏:‏ ‏(‏إن الذين يشترون بعهد الله ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى قوله شجاعا أقرع يعني حية ‏.‏",
      "text_en": " Narrated Abu Wa'il:                     \"'Abdullah [bin Mas'ud] narrating from the Prophet (ﷺ) that he said: 'There is no person who does not pay the Zakat due on his wealth but on the Day of Resurrection Allah will make a Shuja'a around his neck.' Then he recited the Ayah for us from the Book of Allah, the Mighty and Sublime, testifying to that: And let not those who are stringy with that which Allah has bestowed on them of His bounty... (3:180) And another time he said: 'Testifying to that, the Messenger of Allah (ﷺ) recited: On the Day of Resurrection, the things that they were stingy with... (3:180)' and whoever deprives his Muslim brother of his wealth by swearing, then he shall meet Allah while He is angry with him.' Then testifying to that, the Messenger of Allah (ﷺ) recited the Ayah from Allah's Book: Verily, those who purchase a small gain at the cost of Allah's covenant (3:77).\"",
      "chain": [
        "30421",
        "20005",
        "11327",
        "11353"
      ]
    },
    {
      "hadith_no": "2441",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا مجاهد بن موسى، قال حدثنا ابن عيينة، عن جامع بن أبي راشد، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل له مال لا يؤدي حق ماله إلا جعل له طوقا في عنقه شجاع أقرع وهو يفر منه وهو يتبعه ‏\"‏ ‏.‏ ثم قرأ مصداقه من كتاب الله عز وجل ‏{‏ ولا تحسبن الذين يبخلون بما آتاهم الله من فضله هو خيرا لهم بل هو شر لهم سيطوقون ما بخلوا به يوم القيامة ‏}‏ الآية ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah said: 'There is no man who has wealth and does not pay the dues of his wealth, but a baldheaded Shuja'a will be made to encircle his neck, and he will run away from the Book of Allah: 'And let not those who covetously withhold of that which Allah has bestowed on them of His Bounty (wealth)' think that it is good for them (and so they do not pay the obligatory Zakah). Nay, it will be worse for them; the things which they covetously withheld, shall be tied toothier necks like a collar on the Day of Resurrection.\"'",
      "chain": [
        "30521",
        "20005",
        "11327",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3798",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، عن سفيان، عن عبد الملك، وعاصم، وجامع، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا نبيع بالبقيع فأتانا رسول الله صلى الله عليه وسلم وكنا نسمى السماسرة فقال ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فسمانا باسم هو خير من اسمنا ثم قال ‏\"‏ إن هذا البيع يحضره الحلف والكذب فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"We used to sell in Al-Baqi, and the Messenger of Allah came to us. We used to be called Samasir (brokers) but he said: 'O merchants!' And called us by a name that was better than our name. Then he said: 'This selling involves (false) oaths and lies, so mix some charity with it.'\"",
      "chain": [
        "20012",
        "11368",
        "11080",
        "11327",
        "11353",
        "11046"
      ]
    },
    {
      "hadith_no": "1856",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن أبي عمر العدني، حدثنا سفيان بن عيينة، عن عبد الملك بن أعين، وجامع بن أبي راشد، سمعا شقيق بن سلمة، يخبر عن عبد الله بن مسعود، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ما من أحد لا يؤدي زكاة ماله إلا مثل له يوم القيامة شجاعا أقرع حتى يطوق عنقه ‏\"‏ ‏.‏ ثم قرأ علينا رسول الله  صلى الله عليه وسلم  مصداقه من كتاب الله تعالى ‏(‏ولا يحسبن الذين يبخلون بما آتاهم الله من فضله}‏ الآية ‏.‏",
      "text_en": " 'Abdullah bin Masud (RAH) narrated that:                     the Messenger of Allah said: “There is no one who does not pay Zakat on his wealth but a bald headed snake will be made to appear to him on the Day of Resurrection, until it encircles his neck.” Then the messenger of Allah recited the following Verse from the Book of Allah the Most High: “And let not those who covetously withhold of that which Allah had bestowed on them of His Bounty(wealth) think that is good for them”",
      "chain": [
        "20005",
        "11367",
        "11327",
        "11353",
        "16"
      ]
    }
  ],
  "total_hadiths": 11
}