{
  "id": "11326",
  "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
  "full_name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Ahamsi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11662",
      "name": "Wabra bin 'Abdur Rahman al-Musli وبرة بن عبد الرحمن المسلي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11421",
      "name": "Hamran bin Aban حمران بن أبان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15581",
      "name": "Hashim bin al-Bryd هاشم بن البريد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3704",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن أبي الطيب، حدثنا إسماعيل بن مجالد، حدثنا بيان بن بشر، عن وبرة بن عبد الرحمن، عن همام، قال سمعت عمارا، يقول رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar:                     I saw Allah's Apostle and there was none with him but five slaves, two women and Abu Bakr (i.e. those were the only converts to Islam then).",
      "chain": [
        "30240",
        "20314",
        "11326",
        "11662",
        "11447",
        "25"
      ]
    },
    {
      "hadith_no": "3870",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن قيس، قال سمعته يقول قال جرير بن عبد الله  رضى الله عنه ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا ضحك‏.‏",
      "text_en": "     Narrated Jarir bin 'Abdullah:                          Allah's Apostle has never refused to admit me since I embraced Islam, and whenever he saw me, he would smile.",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "3900",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا بيان، وإسماعيل، قالا سمعنا قيسا، يقول سمعت خبابا، يقول أتيت النبي صلى الله عليه وسلم وهو متوسد بردة، وهو في ظل الكعبة، وقد لقينا من المشركين شدة فقلت ألا تدعو الله فقعد وهو محمر وجهه فقال ‏\"‏ لقد كان من قبلكم ليمشط بمشاط الحديد ما دون عظامه من لحم أو عصب ما يصرفه ذلك عن دينه، ويوضع المنشار على مفرق رأسه، فيشق باثنين، ما يصرفه ذلك عن دينه، وليتمن الله هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت ما يخاف إلا الله ‏\"‏‏.‏ زاد بيان والذئب على غنمه‏.‏",
      "text_en": " Narrated Khabbaba:                     I came to the Prophet while he was leaning against his sheet cloak in the shade of the Ka`ba. We were suffering greatly from the pagans in those days. i said (to him). \"Will you invoke Allah (to help us)?\" He sat down with a red face and said, \"(A believer among) those who were before you used to be combed with iron combs so that nothing of his flesh or nerves would remain on his bones; yet that would never make him desert his religion. A saw might be put over the parting of his head which would be split into two parts, yet all that would never make him abandon his religion. Allah will surely complete this religion (i.e. Islam) so that a traveler from Sana to Hadra-maut will not be afraid of anybody except Allah.\" (The sub-narrator, Baiyan added, \"Or the wolf, lest it should harm his sheep.\")",
      "chain": [
        "30418",
        "20005",
        "11326",
        "20208",
        "149"
      ]
    },
    {
      "hadith_no": "3905",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن حماد الآملي، قال حدثني يحيى بن معين، حدثنا إسماعيل بن مجالد، عن بيان، عن وبرة، عن همام بن الحارث، قال قال عمار بن ياسر رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان، وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar bin Yasir:                     I saw Allah's Apostle , and the only converts (to Islam) with him, were five slaves, two women and Abu Bakr.",
      "chain": [
        "30347",
        "30020",
        "20314",
        "11326",
        "11662",
        "11400"
      ]
    },
    {
      "hadith_no": "4398",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا بيان، عن قيس، عن جرير، قال كان بيت في الجاهلية يقال له ذو الخلصة والكعبة اليمانية والكعبة الشأمية، فقال لي النبي صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ فنفرت في مائة وخمسين راكبا، فكسرناه وقتلنا من وجدنا عنده، فأتيت النبي صلى الله عليه وسلم فأخبرته، فدعا لنا ولأحمس‏.‏",
      "text_en": " Narrated Jarir:                     In the Pre-lslamic Period of Ignorance there was a house called Dhu-l-Khalasa or Al-Ka`ba Al- Yamaniya or Al-Ka`ba Ash-Shamiya. The Prophet said to me, \"Won't you relieve me from Dhu-l- Khalasa?\" So I set out with one-hundred-and-fifty riders, and we dismantled it and killed whoever was present there. Then I came to the Prophet and informed him, and he invoked good upon us and Al- Ahmas (tribe) .",
      "chain": [
        "30175",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "4441",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني بيان، حدثنا النضر، أخبرنا شعبة، عن قيس، قال سمعت طارقا، عن أبي موسى الأشعري  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم بالبطحاء فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ كيف أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال رسول الله صلى الله عليه وسلم‏.‏ قال ‏\"‏ طف بالبيت وبالصفا والمروة ثم حل ‏\"‏‏.‏ فطفت بالبيت وبالصفا والمروة، وأتيت امرأة من قيس ففلت رأسي‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I came to the Prophet at a place called Al-Batha'. The Prophet said, \"Did you assume the Ihram for Hajj?\" I said, \"Yes,\" He said, \"How did you express your intention (for performing Hajj)? \" I said, \"Labbaik (i.e. I am ready) to assume the Ihram with the same intention as that of Allah's Apostle.\" The Prophet said, \"Perform the Tawaf around the Ka`ba and between Safa and Marwa, and then finish your Ihram.\" So I performed the Tawaf around the Ka`ba and between Safa and Marwa and then I came to a woman from the tribe of Qais who removed the lice from my head.",
      "chain": [
        "11326",
        "20291",
        "20020",
        "11046",
        "11355",
        "41"
      ]
    },
    {
      "hadith_no": "4697",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا بيان، أن وبرة، حدثه قال حدثني سعيد بن جبير، قال خرج علينا أو إلينا ابن عمر، فقال رجل كيف ترى في قتال الفتنة‏.‏ فقال وهل تدري ما الفتنة كان محمد صلى الله عليه وسلم يقاتل المشركين، وكان الدخول عليهم فتنة، وليس كقتالكم على الملك‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Umar came to us and a man said (to him), \"What do you think about 'Qit-alal-Fitnah' (fighting caused by afflictions).\" Ibn `Umar said (to him), \"And do you understand what an affliction is? Muhammad used to fight against the pagans, and his fighting with them was an affliction, (and his fighting was) not like your fighting which is carried on for the sake of ruling.\"",
      "chain": [
        "30184",
        "20321",
        "11326",
        "11662",
        "11050"
      ]
    },
    {
      "hadith_no": "5225",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، عن بيان، قال سمعت أنسا، يقول بنى النبي صلى الله عليه وسلم بامرأة فأرسلني فدعوت رجالا إلى الطعام‏.‏",
      "text_en": " Narrated Anas:                     The Prophet consummated his marriage with a woman (Zainab), so he sent me to invite men to the meals.",
      "chain": [
        "20357",
        "20321",
        "11326",
        "19"
      ]
    },
    {
      "hadith_no": "5541",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، عن بيان، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم قلت إنا قوم نصيد بهذه الكلاب‏.‏ فقال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله، فكل مما أمسكن عليكم، وإن قتلن إلا أن يأكل الكلب، فإني أخاف أن يكون إنما أمسكه على نفسه، وإن خالطها كلاب من غيرها فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi bin Hatim:                     I asked Allah's Apostle. \"We hunt with the help of these hounds.\" He said, \"If you let loose your trained hounds after a game, and mention the name of Allah, then you can eat what the hounds catch for you, even if they killed the game. But you should not eat of it if the hound has eaten of it, for then it is likely that the hound has caught the game for itself. And if other hounds join your hound in hunting the game, then do not eat of it.\"",
      "chain": [
        "30367",
        "20356",
        "11326",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5545",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثني محمد، أخبرني ابن فضيل، عن بيان، عن عامر، عن عدي بن حاتم  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم فقلت إنا قوم نتصيد بهذه الكلاب‏.‏ فقال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله، فكل مما أمسكن عليك، إلا أن يأكل الكلب، فلا تأكل فإني أخاف أن يكون إنما أمسك على نفسه، وإن خالطها كلب من غيرها، فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi Bin Hatim:                     I asked Allah's Apostle, \"We hunt with these hounds.\" He said, \"If you send your trained hounds after a game and mention Allah's Name on sending, you can eat of what they catch for you. But if the hound eats of the game, then you must not eat of it, for I am afraid that the hound caught it for itself, and if another hound joins your hounds (during the hunt), you should not eat of the game.\"",
      "chain": [
        "30213",
        "20356",
        "11326",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "6510",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن حماد، حدثنا أبو عوانة، عن بيان، عن قيس بن أبي حازم، عن مرداس الأسلمي، قال قال النبي صلى الله عليه وسلم ‏\"‏ يذهب الصالحون الأول فالأول، ويبقى حفالة كحفالة الشعير أو التمر، لا يباليهم الله بالة ‏\"‏‏.‏ قال أبو عبد الله يقال حفالة وحثالة‏.‏",
      "text_en": " Narrated Mirdas Al-Aslami:                     The Prophet said, \"The righteous (pious people will depart (die) in succession one after the other, and there will remain (on the earth) useless people like the useless husk of barley seeds or bad dates.",
      "chain": [
        "20574",
        "20469",
        "11326",
        "11046"
      ]
    },
    {
      "hadith_no": "7184",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن وبرة بن عبد الرحمن، عن سعيد بن جبير، قال خرج علينا عبد الله بن عمر فرجونا أن يحدثنا، حديثا حسنا  قال  فبادرنا إليه رجل فقال يا أبا عبد الرحمن حدثنا عن القتال في الفتنة والله يقول ‏{‏وقاتلوهم حتى لا تكون فتنة‏}‏ فقال هل تدري ما الفتنة ثكلتك أمك، إنما كان محمد صلى الله عليه وسلم يقاتل المشركين، وكان الدخول في دينهم فتنة، وليس كقتالكم على الملك‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     `Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before we asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles during the time of the afflictions, as Allah says:-- 'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" (2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother bereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion (The pagans will either kill him or chain him as a captive). His fighting was not like your fighting which is carried on for the sake of ruling.\"",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11662",
        "11050"
      ]
    },
    {
      "hadith_no": "7526",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏\"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle came out to us on the night of the full moon and said, \"You will see your Lord on the Day of Resurrection as you see this (full moon) and you will have no difficulty in seeing Him.\"",
      "chain": [
        "30149",
        "20315",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "1927",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن قيس بن أبي حازم، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تر آيات أنزلت الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق‏}‏ و ‏{‏ قل أعوذ برب الناس‏}‏ ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      The Messenger of Allah (may peace be upon him) said to me: There have been sent down to me verses the like of which had never been seen before. They are the Mu'awwadhatain.",
      "chain": [
        "30367",
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "hadith_no": "3027",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن بيان، عن عبد الرحمن بن أبي الشعثاء، قال أتيت إبراهيم النخعي وإبراهيم التيمي فقلت إني أهم أن أجمع العمرة والحج العام ‏.‏ فقال إبراهيم النخعي لكن أبوك لم يكن ليهم بذلك ‏.‏ قال قتيبة حدثنا جرير عن بيان عن إبراهيم التيمي عن أبيه أنه مر بأبي ذر - رضى الله عنه - بالربذة فذكر له ذلك فقال إنما كانت لنا خاصة دونكم ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abi al-Sha'tha' reported:                      I came to Ibrahim al-Nakha'I and Ibrahim Taimi and said: I intend to combine 'Umra and Hajj this year, whereupon Ibrahim al-Nakha'i said: But your father did not make such intention. Ibrahim narrated on the authority of, his father that he passed by Abu Dharr (Allah be pleased with him) at Rabdha, and made a mention of that, whereupon he said: It was a special concession for us and not for you.",
      "chain": [
        "30367",
        "20028",
        "11326",
        "30367",
        "20028",
        "11326",
        "11322",
        "11405"
      ]
    },
    {
      "hadith_no": "3057",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن وبرة، قال سأل رجل ابن عمر - رضى الله عنهما - أطوف بالبيت وقد أحرمت بالحج فقال وما يمنعك قال إني رأيت ابن فلان يكرهه وأنت أحب إلينا منه رأيناه قد فتنته الدنيا ‏.‏ فقال وأينا - أو أيكم - لم تفتنه الدنيا ثم قال رأينا رسول الله صلى الله عليه وسلم أحرم بالحج وطاف بالبيت وسعى بين الصفا والمروة فسنة الله وسنة رسوله صلى الله عليه وسلم أحق أن تتبع من سنة فلان إن كنت صادقا ‏.‏",
      "text_en": " Wabara reported:                      A person asked Ibn Umar (Allah be pleased with him): May I circumambulate the House, whereas I have entered-into the state of Ihram for Hajj? Thereupon he said: What prevents you from doing it? He said: I saw the son of so and so showing disapproval of it, and you are dearer to us as compared with him. And we see that he is allured by the world, whereupon he said: Who amongst you and us is not allured by the world? And said (further) ': 'We saw that Allah's Messenger (may peace be upon him) put on Ihram for Hajj and circumambulated the House and run between al Safa' and al-Marwa. And the way prescribed by Allah and that prescribed by His Apostle (may peace be upon him) deserve more to be followed than the way shown by so and so, if you speak the truth.",
      "chain": [
        "30367",
        "20028",
        "11326",
        "11662"
      ]
    },
    {
      "hadith_no": "5082",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن فضيل، عن بيان، عن الشعبي، عن عدي، بن حاتم قال سألت رسول الله صلى الله عليه وسلم قلت إنا قوم نصيد بهذه الكلاب فقال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله عليها فكل مما أمسكن عليك وإن قتلن إلا أن يأكل الكلب فإن أكل فلا تأكل فإني أخاف أن يكون إنما أمسك على نفسه وإن خالطها كلاب من غيرها فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      I asked Allah's Messenger (may peace be upon him) saying: We are a people who hunt with these (trained) dogs, then (what should we do)? Thereupon he (the Holy Prophet) said: When you set of your trained dogs having recited the name of Allah, then eat what these (hounds) have caught for you, oven if it (the game) is killed, provided (the hunting dog) has not eaten (any part of the game). If it has eaten (the game), then you don't eat it as I fear that it might have caught for its own self. And do not eat in case other dogs have joined your trained dogs.",
      "chain": [
        "30201",
        "20356",
        "11326",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "6517",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن بيان، عن قيس بن أبي، حازم عن جرير بن عبد الله، ح",
      "text_en": "",
      "chain": [
        "30399",
        "20423",
        "11326",
        "11046"
      ]
    },
    {
      "hadith_no": "6518",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني عبد الحميد بن بيان، حدثنا خالد، عن بيان، قال سمعت قيس بن أبي، حازم يقول قال جرير بن عبد الله ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك ‏.‏",
      "text_en": " (6050) Jarir b. 'Abdullah said:                      Allah's Messenger (may peace be upon him) never refused me permission to see him since I embraced Islam and never looked at me but with a smile.",
      "chain": [
        "30551",
        "20423",
        "11326",
        "11046"
      ]
    },
    {
      "hadith_no": "6520",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عبد الحميد بن بيان، أخبرنا خالد، عن بيان، عن قيس، عن جرير، قال كان في الجاهلية بيت يقال له ذو الخلصة وكان يقال له الكعبة اليمانية والكعبة الشامية فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل أنت مريحي من ذي الخلصة والكعبة اليمانية والشامية ‏\"‏ ‏.‏ فنفرت إليه في مائة وخمسين من أحمس فكسرناه وقتلنا من وجدنا عنده فأتيته فأخبرته - قال - فدعا لنا ولأحمس ‏.‏",
      "text_en": " Jabir reported that there was in pre-Islamic days a temple called Dhu'l- Khalasah and it was called the Yamanite Ka'ba or the northern Ka'ba. Allah's Messenger (may peace be upon him) said unto me:                      Will you rid me of Dhu'l-Khalasah and so I went forth at the head of 350 horsemen of the tribe of Ahmas and we destroyed it and killed whomsoever we found there. Then we came back to him (to the Holy Prophet) and informed him and he blessed us and the tribe of Ahmas.",
      "chain": [
        "30551",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "2848",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن فضيل، عن بيان، عن عامر، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم قلت إنا نصيد بهذه الكلاب فقال لي ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله عليها فكل مما أمسكن عليك وإن قتل إلا أن يأكل الكلب فإن أكل الكلب فلا تأكل فإني أخاف أن يكون إنما أمسكه على نفسه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Adi b. Hatim:                     I asked the Messenger of Allah. I said: We hunt with these dogs. He replied: When you set off your dog and mention Allah's name over it, eat what it catches for you, even if it kills it, except that the dog has eaten (any of it); if the dog has eaten (any of it), do not eat, for Im afraid it has caught it only for itself.",
      "chain": [
        "30480",
        "20356",
        "11326",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "3651",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا خالد، ح وحدثنا مسدد، حدثنا خالد، - المعنى - عن بيان بن بشر، - قال مسدد أبو بشر - عن وبرة بن عبد الرحمن، عن عامر بن عبد الله بن الزبير، عن أبيه، قال قلت للزبير ما يمنعك أن تحدث عن رسول الله صلى الله عليه وسلم كما يحدث عنه أصحابه فقال أما والله لقد كان لي منه وجه ومنزلة ولكني سمعته يقول ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " ’Abd Allah bin al-Zubair said on the authority of the father :                      I asked al-zubair : What prevents you from narrating traditions from the Apostle of allah (ﷺ) as his Companions narrate from him. But I heard him say: He who lies about me deliberately will certainly come to his abode in Hell.",
      "chain": [
        "30154",
        "20423",
        "30175",
        "11326",
        "11178",
        "106"
      ]
    },
    {
      "hadith_no": "680",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن بيان بن بشر، عن قيس بن أبي حازم، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لأن يغدو أحدكم فيحتطب على ظهره فيتصدق منه فيستغني به عن الناس خير له من أن يسأل رجلا أعطاه أو منعه ذلك فإن اليد العليا أفضل من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏ قال وفي الباب عن حكيم بن حزام وأبي سعيد الخدري والزبير بن العوام وعطية السعدي وعبد الله بن مسعود ومسعود بن عمرو وابن عباس وثوبان وزياد بن الحارث الصدائي وأنس وحبشي بن جنادة وقبيصة بن مخارق وسمرة وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب يستغرب من حديث بيان عن قيس ‏.‏",
      "text_en": " Abu Hurairah narrated that he heard :                     the Messenger of Allah saying: \"For one of you to go out early to gather firewood and carry it on his back so that he can give charity from it and be free of need from the people, is better for him than to ask a man who may give that to him or refuse. Indeed the upper hand (giving) is more virtuous than the lower hand (receiving), and begin with (those who are) your dependants.\"",
      "chain": [
        "30480",
        "20327",
        "11326",
        "11046",
        "13"
      ]
    },
    {
      "hadith_no": "2365",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن بيان، عن قيس بن أبي حازم، قال سمعت سعد بن أبي وقاص، يقول إني لأول رجل أهراق دما في سبيل الله وإني لأول رجل رمى بسهم في سبيل الله ولقد رأيتني أغزو في العصابة من أصحاب محمد صلى الله عليه وسلم ما نأكل إلا ورق الشجر والحبلة حتى إن أحدنا ليضع كما تضع الشاة أو البعير وأصبحت بنو أسد يعزروني في الدين لقد خبت إذا وضل عملي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث بيان ‏.‏",
      "text_en": " Sa'd Bin Abi Waqqas said:                     \"I was among the first men who spilled blood in Allah's cause, and I was among the first men to shoot an arrow in Allah's cause. I saw battles with troops of the Companions of Muhammad (s.a.w). We had nothing to eat except leaves of trees and Al-Hublah, such that one of us would leave droppings like the droppings of sheep and camels. Now Banu Asad have appeared wanting to instruct me in religion, ( then) I would be a loser and have wasted my efforts.\"",
      "chain": [
        "11326",
        "11046",
        "9"
      ]
    },
    {
      "hadith_no": "3525",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد، حدثني أبي، عن بيان، عن أنس بن مالك، رضى الله عنه قال بنى رسول الله صلى الله عليه وسلم بامرأة من نسائه فأرسلني فدعوت قوما إلى الطعام فلما أكلوا وخرجوا قام رسول الله صلى الله عليه وسلم منطلقا قبل بيت عائشة فرأى رجلين جالسين فانصرف راجعا فقام الرجلان فخرجا فأنزل الله عز وجل ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه ‏)‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث بيان ‏.‏ وروى ثابت عن أنس هذا الحديث بطوله ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) was staying with one of his wives, so he sent me to invite people for a meal. When they ate and left, the Messenger of Allah (ﷺ) stood and went off in the direction of 'Aishah's house. He saw two men (still) sitting, so he turned to come back, then the two men stood up to leave. So Allah [the Mighty and Sublime] revealed: 'O you who believe! Do not enter the Prophet's house unless permission is given to you for a meal, not to wait for its preparation (33:53).\" And there is a long story with the narration.",
      "chain": [
        "35100",
        "11326",
        "19"
      ]
    },
    {
      "hadith_no": "4191",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو الأزدي، حدثنا زائدة، عن بيان، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jarir bin 'Abdullah:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he laughed.\"",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "954",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن بيان، عن قيس، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ آيات أنزلت على الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Uqbah bin Amr said:                     The Messenger of Allah (ﷺ) said: 'Some verses were revealed to me tonight, the like of which has never been seen: \"Say: I seek refuge with (Allah), the Lord of the daybreak.\" And \"Say: I seek refuge with (Allah) the Lord of mankind.'\"",
      "chain": [
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، عن بيان بن بشر، عن موسى بن طلحة، عن ابن الحوتكية، عن أبي ذر، أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ عليك بصيام ثلاث عشرة وأربع عشرة وخمس عشرة ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ ليس من حديث بيان ولعل سفيان قال حدثنا اثنان فسقط الألف فصار بيان ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said to a man:                     \"You should fast the thirteenth, fourteenth and fifteenth.\" (Hasan)Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, it is not a narration of Bayan; perhaps Sufyan said: \"It was narrated to us by two (Ithnan)\" and the 'Alif was dropped so it became Bayan.",
      "chain": [
        "36658",
        "20005",
        "11326",
        "579",
        "23"
      ]
    },
    {
      "hadith_no": "2812",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى بن آدم، قال حدثنا مفضل بن مهلهل، عن بيان، عن عبد الرحمن بن أبي الشعثاء، قال كنت مع إبراهيم النخعي وإبراهيم التيمي فقلت لقد هممت أن أجمع العام الحج والعمرة ‏.‏ فقال إبراهيم لو كان أبوك لم يهم بذلك ‏.‏ قال وقال إبراهيم التيمي عن أبيه عن أبي ذر قال إنما كانت المتعة لنا خاصة ‏.‏",
      "text_en": " It was narrated that Abdur-Rahman bin Abi Ash-Shatha Said:                     \"I was with Ibrahm An-Nakha'i and Ibrahim At-taimi, and I said: 'I wanted to combine Hajj and 'Umrah this year,' but Ibrahim said: 'If you father were alive, he would not do that.' And Ibrahim At-Taimi said, (narrating) from his father, that Abu Dharr said: 'Tamattu' was only for us\". (Sahib)",
      "chain": [
        "20364",
        "11326",
        "11322"
      ]
    },
    {
      "hadith_no": "2929",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال حدثنا سويد، - وهو ابن عمرو الكلبي - عن زهير، قال حدثنا بيان، أن وبرة، حدثه قال سمعت عبد الله بن عمر، وسأله، رجل أطوف بالبيت وقد أحرمت بالحج قال وما يمنعك قال رأيت عبد الله بن عباس ينهى عن ذلك وأنت أعجب إلينا منه ‏.‏ قال رأينا رسول الله صلى الله عليه وسلم أحرم بالحج فطاف بالبيت وسعى بين الصفا والمروة ‏.‏",
      "text_en": " Wabarah said:                     \"I heard Abdullah bin Umar say, when a man asked him wether he could perform Tawaf around the House when he had entered Ihram for Hajj: 'What is stopping you?' He said: 'I saw Abdullah bin Abbas forbidding that, but you are telling us something different.' He said: 'We saw the Messenger of Allah enter Ihram for Hajj, then circumambulate the House then perform between As-Safa and Al-Marwah.'\"",
      "chain": [
        "30149",
        "30466",
        "20321",
        "11326",
        "18"
      ]
    },
    {
      "hadith_no": "680",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن بيان، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال كنا نصلي مع رسول الله  صلى الله عليه وسلم  صلاة الظهر بالهاجرة فقال لنا ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     We were praying Zuhr with the Messenger of Allah at the time of intense heat (i.e., midday when the sun has just passed its zenith) and he said to us, \"Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.\"",
      "chain": [
        "20411",
        "20587",
        "11326",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "3105",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا سفيان، عن بيان، وجابر، عن الشعبي، عن وهب بن خنبش، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ عمرة في رمضان تعدل حجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Wahb bin Khanbash that the Messenger of Allah(ﷺ)said:                      “ ‘Umrah during Ramadan is equivalent to Hajj (i.e. inreward).”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11326",
        "34",
        "11052"
      ]
    },
    {
      "hadith_no": "3268",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا عبد الرحمن بن مهدي، ومحمد بن يوسف، ح وحدثنا محمد بن يحيى، حدثنا عبد الرزاق، جميعا عن سفيان الثوري، عن بيان، عن الشعبي، عن أبي سريحة، قال حملني أهلي على الجفاء بعدما علمت من السنة كان أهل البيت يضحون بالشاة والشاتين والآن يبخلنا جيراننا ‏.‏",
      "text_en": " It wasnarrated that Abu Sarihah said:                      “My family started to putpressureon me after I came to know the Sunnah. People used tosacrifice oneor two sheep, but now our neighbors call us stingy.”",
      "chain": [
        "30313",
        "20033",
        "30388",
        "11222",
        "20121",
        "20012",
        "11326",
        "11052"
      ]
    },
    {
      "hadith_no": "3329",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا علي بن المنذر، حدثنا محمد بن فضيل، حدثنا بيان بن بشر، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله  صلى الله عليه وسلم  فقلت إنا قوم نصيد بهذه الكلاب ‏.‏ قال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله عليها فكل ما أمسكن عليك وإن قتلن إلا أن يأكل الكلب فإن أكل الكلب فلا تأكل فإني أخاف أن يكون إنما أمسك على نفسه وإن خالطها كلاب أخر فلا تأكل ‏\"‏ ‏.‏ قال ابن ماجه سمعته - يعني علي بن المنذر - يقول حججت ثمانية وخمسين حجة أكثرها راجل ‏.‏",
      "text_en": " It wasnarrated that ‘Adi bin Hatim said:                      “I asked the Messenger ofAllah (ﷺ): ‘We are people who hunt with these dogs.’ He said:‘Ifyou send out your trained dogs and mention the Name of Allahoverthem, then eat whatever they catch even if they kill it, unlessthedog has eaten any of it. If the dog has eaten any of it then donoteat it, for I fear that it will have caught it for itself. And ifanother dog joins it, then do not eat it.’”",
      "chain": [
        "20356",
        "11326",
        "11052",
        "212"
      ]
    }
  ],
  "total_hadiths": 34
}