{
  "id": "11323",
  "name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
  "full_name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-'Ajli",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19841",
      "name": "Tha'laba bin 'Aabad ثعلبة بن عباد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11509",
      "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10775",
      "name": "Shqyq bin 'Uqba al-Bdy شقيق بن عقبة العبدي الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "985",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن الأسود، عن جندب، قال صلى النبي صلى الله عليه وسلم يوم النحر ثم خطب، ثم ذبح فقال ‏\"‏ من ذبح قبل أن يصلي فليذبح أخرى مكانها، ومن لم يذبح فليذبح باسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jundab:                     On the day of Nahr the Prophet offered the prayer and delivered the Khutba and then slaughtered the sacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter another animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice mentioning Allah's name on it.\"",
      "chain": [
        "20285",
        "20020",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "1124",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا سفيان، عن الأسود، قال سمعت جندبا، يقول اشتكى النبي صلى الله عليه وسلم فلم يقم ليلة أو ليلتين‏.‏",
      "text_en": " Narrated Jundab:                     The Prophet became sick and did not get up (for Tahajjud prayer) for a night or two.",
      "chain": [
        "20348",
        "20012",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "1125",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن الأسود بن قيس، عن جندب بن عبد الله  رضى الله عنه  قال احتبس جبريل صلى الله عليه وسلم على النبي صلى الله عليه وسلم فقالت امرأة من قريش أبطأ عليه شيطانه‏.‏ فنزلت ‏{‏والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Gabriel did not come to the Prophet (for some time) and so one of the Quraish women said, \"His Satan has deserted him.\" So came the Divine Revelation: \"By the forenoon And by the night When it is still! Your Lord (O Muhammad) has neither Forsaken you Nor hated you.\" (93.1-3)",
      "chain": [
        "28531",
        "20012",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "1913",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الأسود بن قيس، حدثنا سعيد بن عمرو، أنه سمع ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنا أمة أمية، لا نكتب ولا نحسب الشهر هكذا وهكذا ‏\"‏‏.‏ يعني مرة تسعة وعشرين، ومرة ثلاثين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"We are an illiterate nation; we neither write, nor know accounts. The month is like this and this, i.e. sometimes of 29 days and sometimes of thirty days.\"",
      "chain": [
        "20404",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "2802",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن الأسود بن قيس، عن جندب بن سفيان، أن رسول الله صلى الله عليه وسلم كان في بعض المشاهد وقد دميت إصبعه، فقال ‏\"‏ هل أنت إلا إصبع دميت، وفي سبيل الله ما لقيت ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin Sufyan:                     In one of the holy Battles a finger of Allah's Apostle (got wounded and) bled. He said, \"You are just a finger that bled, and what you got is in Allah's Cause.\"",
      "chain": [
        "20040",
        "20469",
        "11323"
      ]
    },
    {
      "hadith_no": "5001",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأسود بن قيس، قال سمعت جندب بن سفيان  رضى الله عنه  قال اشتكى رسول الله صلى الله عليه وسلم فلم يقم ليلتين أو ثلاثا، فجاءت امرأة فقالت يا محمد إني لأرجو أن يكون شيطانك قد تركك، لم أره قربك منذ ليلتين أو ثلاثا‏.‏ فأنزل الله عز وجل ‏{‏والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
      "text_en": " Narrated Jundub bin Sufyan:                     Once Allah's Apostle became sick and could not offer his night prayer (Tahajjud) for two or three nights. Then a lady (the wife of Abu Lahab) came and said, \"O Muhammad! I think that your Satan has forsaken you, for I have not seen him with you for two or three nights!\" On that Allah revealed: 'By the fore-noon, and by the night when it darkens, your Lord (O Muhammad) has neither forsaken you, nor hated you.' (93.1-3)",
      "chain": [
        "30184",
        "20321",
        "11323"
      ]
    },
    {
      "hadith_no": "5002",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، غندر حدثنا شعبة، عن الأسود بن قيس، قال سمعت جندبا البجلي، قالت امرأة يا رسول الله ما أرى صاحبك إلا أبطأك‏.‏ فنزلت ‏{‏ما ودعك ربك وما قلى‏}‏",
      "text_en": " Narrated Jundub Al-Bajali:                     A lady said, \"O Allah's Apostle! I see that your friend has delayed. (in conveying Qur'an) to you.\" So there was revealed: 'Your Lord (O Muhammad) has neither forsaken you, not hated you.' (93.1-3)",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11323"
      ]
    },
    {
      "hadith_no": "5034",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن الأسود بن قيس، قال سمعت جندبا، يقول اشتكى النبي صلى الله عليه وسلم فلم يقم ليلة أو ليلتين فأتته امرأة فقالت يا محمد ما أرى شيطانك إلا قد تركك، فأنزل الله عز وجل ‏{‏والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
      "text_en": " Narrated Jundub:                     Once the Prophet fell ill and did not offer the night prayer (Tahajjud prayer) for a night or two. A woman (the wife of Abu Lahab) came to him and said, \"O Muhammad ! I do not see but that your Satan has left you.\" Then Allah revealed (Surat-Ad-Duha): 'By the fore-noon, and by the night when it darkens (or is still); Your Lord has not forsaken you, nor hated you.' (93)",
      "chain": [
        "20348",
        "20012",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "5558",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن الأسود بن قيس، عن جندب بن سفيان البجلي، قال ضحينا مع رسول الله صلى الله عليه وسلم أضحية ذات يوم فإذا أناس قد ذبحوا ضحاياهم قبل الصلاة فلما انصرف رآهم النبي صلى الله عليه وسلم أنهم قد ذبحوا قبل الصلاة فقال ‏\"‏ من ذبح قبل الصلاة فليذبح مكانها أخرى، ومن كان لم يذبح حتى صلينا فليذبح على اسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jundub bin Sufyan Al-Bajali:                     Once during the lifetime of Allah's Apostle we offered some animals as sacrifices. Some people slaughtered their sacrifices before the (Id) prayer, so when the Prophet finished his prayer, he saw that they had slaughtered their sacrifices before the prayer. He said, \"Whoever has slaughtered (his sacrifice) before the prayer, should slaughter (another sacrifice) in lieu of it; and whoever has not yet slaughtered it till we have prayed; should slaughter (it) by mentioning Allah's Name.\"",
      "chain": [
        "30367",
        "20469",
        "11323"
      ]
    },
    {
      "hadith_no": "5621",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الأسود بن قيس، سمعت جندب بن سفيان البجلي، قال شهدت النبي صلى الله عليه وسلم يوم النحر فقال ‏\"‏ من ذبح قبل أن يصلي فليعد مكانها أخرى، ومن لم يذبح فليذبح ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin Sufyan Al-Bajali:                     I witnessed the Prophet on the Day of Nahr. He said, \"Whoever slaughtered the sacrifice before offering the `Id prayer, should slaughter another sacrifice in its place; and whoever has not slaughtered their sacrifice yet, should slaughter now.\"",
      "chain": [
        "20404",
        "20020",
        "11323"
      ]
    },
    {
      "hadith_no": "6216",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن الأسود بن قيس، سمعت جندبا، يقول بينما النبي صلى الله عليه وسلم يمشي إذ أصابه حجر فعثر فدميت إصبعه فقال ‏\"‏ هل أنت إلا إصبع دميت وفي سبيل الله ما لقيت ‏\"‏‏.‏",
      "text_en": " Narrated Jundub:                     While the Prophet was walking, a stone hit his foot and stumbled and his toe was injured. He then (quoting a poetic verse) said, \"You are not more than a toe which has been bathed in blood in Allah's Cause.\"",
      "chain": [
        "20348",
        "20012",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "6755",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأسود بن قيس، قال سمعت جندبا، قال شهدت النبي صلى الله عليه وسلم صلى يوم عيد ثم خطب ثم قال ‏\"‏ من ذبح فليبدل مكانها، ومن لم يكن ذبح فليذبح باسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jundub:                     I witnessed the Prophet offering the `Id prayer (and after finishing it) he delivered a sermon and said, \"Whoever has slaughtered his sacrifice (before the prayer) should make up for it (i.e. slaughter another animal) and whoever has not slaughtered his sacrifice yet, should slaughter it by mentioning Allah's Name over it.\"",
      "chain": [
        "20193",
        "20020",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "7489",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الأسود بن قيس، عن جندب، أنه شهد النبي صلى الله عليه وسلم يوم النحر صلى ثم خطب فقال ‏\"‏ من ذبح قبل أن يصلي فليذبح مكانها أخرى، ومن لم يذبح فليذبح باسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jundab:                     That he witnessed the Prophet on the Day of Nahr. The Prophet offered prayer and then delivered a sermon saying, \"Whoever slaughtered his sacrifice before offering prayer, should slaughter another animal in place of the first; and whoever has not yet slaughtered any, should slaughter a sacrifice and mention Allah's Name while doing so.\"",
      "chain": [
        "30329",
        "20020",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "1461",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "قال مسلم ورواه الأشجعي عن سفيان الثوري، عن الأسود بن قيس، عن شقيق بن عقبة، عن البراء بن عازب، قال قرأناها مع النبي صلى الله عليه وسلم زمانا ‏.‏ بمثل حديث فضيل بن مرزوق ‏.‏",
      "text_en": " Imam Muslim said:                      Ashja'i narrated it from Sufyan al-Thauri, who narrated it from al-Aswad b. Qais, who narrated it from 'Uqba, who narrated it from al-Bara' b. 'Azib who said: We recited with the Prophet (may peace be upon him) (the above-mentioned verse like this, i. e. instead of Salat al- Wusta, Salat al-'Asr) for a certain period. as It has been mentioned (in the above-quoted hadith).",
      "chain": [
        "20012",
        "11323",
        "10775",
        "400"
      ]
    },
    {
      "hadith_no": "2563",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الأسود بن قيس، قال سمعت سعيد بن عمرو بن سعيد، أنه سمع ابن عمر، - رضى الله عنهما - يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا وهكذا وهكذا - وعقد الإبهام في الثالثة - والشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ يعني تمام ثلاثين ‏.‏",
      "text_en": "  Ibn 'Umar (may Allah be pleased with both of them) reported Allah's Apostle (may peace be upon him) as saying:                      We are an unlettered people who can neither write nor count. The month is thus, and thus. folding his thumb when he said it the third time.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "4755",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، كلاهما عن أبي عوانة، قال يحيى أخبرنا أبو عوانة، عن الأسود بن قيس، عن جندب بن سفيان، قال دميت إصبع رسول الله صلى الله عليه وسلم في بعض تلك المشاهد فقال ‏\"‏ هل أنت إلا إصبع دميت وفي سبيل الله ما لقيت ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jundub b. Sufyan who said:                      A finger of the Messenger of Allah (may peace be upon him) was wounded in one of the encounters He said: Thou art just a little finger which has bled, and what thou hast experienced is in the cause of Allah.",
      "chain": [
        "30399",
        "30367",
        "20469",
        "20031",
        "20469",
        "11323"
      ]
    },
    {
      "hadith_no": "4756",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن ابن عيينة، عن الأسود بن قيس، بهذا الإسناد وقال كان رسول الله صلى الله عليه وسلم في غار فنكبت إصبعه ‏.‏",
      "text_en": " It has been narrated on the authority of Aswad b. Qais who said:                      The Messenger of Allah (may peace be upon him) was in a cave (or raid) when his finger was hurt.",
      "chain": [
        "30201",
        "30123",
        "20005",
        "11323"
      ]
    },
    {
      "hadith_no": "4757",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا سفيان، عن الأسود بن قيس، أنه سمع جندبا، يقول أبطأ جبريل على رسول الله صلى الله عليه وسلم فقال المشركون قد ودع محمد فأنزل الله عز وجل ‏{‏ والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
      "text_en": " It has been narrated on the authority of Aswad b. Qais who heard Jundub saying that Gabriel delayed his visit to the Messenger of Allah (may peace be upon him) The polytheists began to say that Muhammad has been forsaken. At this Allah, the Glorious and Exalted, revealed:                     \" Wa'dd hd wa'l-laili iza saja, ma wadda'ka Rabbuka wa' ma qala\" [By the glorious morning light, and by the night when it is still: thy Lord has not forsaken thee, nor is He displeased].",
      "chain": [
        "30123",
        "20012",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "4758",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، - واللفظ لابن رافع - قال إسحاق أخبرنا وقال ابن رافع، حدثنا يحيى بن آدم، حدثنا زهير، عن الأسود بن قيس، قال سمعت جندب بن سفيان، يقول اشتكى رسول الله صلى الله عليه وسلم فلم يقم ليلتين أو ثلاثا فجاءته امرأة فقالت يا محمد إني لأرجو أن يكون شيطانك قد تركك لم أره قربك منذ ليلتين أو ثلاث قال فأنزل الله عز وجل ‏{‏ والضحى * والليل إذا سجى * ما ودعك ربك وما قلى‏}‏",
      "text_en": " It has been narrated on the authority of Aswad b. Qais who said:                      I heard Jundub b. Sufyan say: The Messenger of Allah (may peace be upon him) fell ill and did not wake up for two or three nights (for prayers) A woman came to him and said: Muhammad, I hope that your satan has left you. I haven't seen him approach you for two or three nights. The narrator says: At this, Allah, the Glorious and Exalted, revealed:\" By the Glorious......\"",
      "chain": [
        "30123",
        "30375",
        "30312",
        "20364",
        "20321",
        "11323"
      ]
    },
    {
      "hadith_no": "5176",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأسود بن قيس، ح وحدثناه يحيى، بن يحيى أخبرنا أبو خيثمة، عن الأسود بن قيس، حدثني جندب بن سفيان، قال شهدت الأضحى مع رسول الله صلى الله عليه وسلم فلم يعد أن صلى وفرغ من صلاته سلم فإذا هو يرى لحم أضاحي قد ذبحت قبل أن يفرغ من صلاته فقال ‏\"‏ من كان ذبح أضحيته قبل أن يصلي - أو نصلي - فليذبح مكانها أخرى ومن كان لم يذبح فليذبح باسم الله ‏\"‏ ‏.‏",
      "text_en": " Jundab b. Sufyan reported:                      I was with Allah's Messenger (may peace be upon him) on the day of 'Id al-Adha. While he had not returned after having offered (the Id prayer) and finished it, he saw the flesh of the sacrificial animals which had been slaughtered before he had completed the prayer. Thereupon he (the Holy Prophet) said: One who slaughtered his sacrificial animal before his prayer or our prayer ('Id), he should slaughter another one in its stead, and he who did not slaughter, he should slaughter by reciting the name of Allah.",
      "chain": [
        "30184",
        "20321",
        "11323",
        "30399",
        "20321",
        "11323"
      ]
    },
    {
      "hadith_no": "5177",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن الأسود، بن قيس عن جندب بن سفيان، قال شهدت الأضحى مع رسول الله صلى الله عليه وسلم فلما قضى صلاته بالناس نظر إلى غنم قد ذبحت فقال ‏\"‏ من ذبح قبل الصلاة فليذبح شاة مكانها ومن لم يكن ذبح فليذبح على اسم الله ‏\"‏ ‏.‏",
      "text_en": " Jundab b. Sufyan reported:                      I was with Allah's Messenger (may peace be upon him) (on the occasion) of 'Id al-Adha. After he had completed the prayer with people, he found that the goats had been slaughtered, whereupon he said: He who slaughtered sacrificial animal before the prayer should slaughter a goat (again) in its stead and he who has not slaughtered he should slaughter it by reciting the name of Allah.",
      "chain": [
        "30201",
        "11323"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن الأسود، سمع جندبا البجلي، قال شهدت رسول الله صلى الله عليه وسلم صلى يوم أضحى ثم خطب فقال ‏\"‏ من كان ذبح قبل أن يصلي فليعد مكانها ومن لم يكن ذبح فليذبح باسم الله ‏\"‏ ‏.‏",
      "text_en": " Jundab al-Bajali reported:                      I saw Allah's Messenger (may peace be upon him) observing ('Id) prayer on the Day of Sacrifice (10th of Dhu'l-Hijja) and then delivering a sermon and he said: He who sacrificed the (animal) before offering ('Id) prayer, he should offer again in its stead, and he who did not sacrifice the animal should slaughter it by reciting the name of Allah.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11323"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأسود بن قيس، حدثني ثعلبة بن عباد العبدي، من أهل البصرة أنه شهد خطبة يوما لسمرة بن جندب قال قال سمرة بينما أنا وغلام من الأنصار نرمي غرضين لنا حتى إذا كانت الشمس قيد رمحين أو ثلاثة في عين الناظر من الأفق اسودت حتى آضت كأنها تنومة فقال أحدنا لصاحبه انطلق بنا إلى المسجد فوالله ليحدثن شأن هذه الشمس لرسول الله صلى الله عليه وسلم في أمته حدثا قال فدفعنا فإذا هو بارز فاستقدم فصلى فقام بنا كأطول ما قام بنا في صلاة قط لا نسمع له صوتا قال ثم ركع بنا كأطول ما ركع بنا في صلاة قط لا نسمع له صوتا ثم سجد بنا كأطول ما سجد بنا في صلاة قط لا نسمع له صوتا ‏.‏ ثم فعل في الركعة الأخرى مثل ذلك قال فوافق تجلي الشمس جلوسه في الركعة الثانية قال ثم سلم ثم قام فحمد الله وأثنى عليه وشهد أن لا إله إلا الله وشهد أنه عبده ورسوله ثم ساق أحمد بن يونس خطبة النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     When, a boy from the Ansar and I were shooting (arrows) towards two of our targets, the sun was sighted by the people at the height of two or three lances above the horizon. It became black like the black herb called tannumah.  One of us said to his companion: Let us go to the mosque; by Allah, this incident of the sun will surely bring something new in the community of the Messenger of Allah (ﷺ).  As we reached it, we suddenly saw that he (the Prophet) had already come out (of his house). He stepped forward for a long time as much as he could do so in the prayer. But we did not hear his voice. He then performed a bowing and prolonged it as much as he could do in the prayer. But we did not hear his voice. He then prostrated himself with us and prolonged it which he never did in the prayer before. But we did not hear his voice. He then did similarly in the second rak'ah. The sun became bright when he sat after the second rak'ah. Then he uttered the salutation. He then stood up, praised Allah, and extolled Him, and testified that there was no god but Allah and testified that he was His servant and apostle. Ahmad ibn Yunus then narrated the address of the Prophet (ﷺ).",
      "chain": [
        "30184",
        "20321",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "1533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، عن الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، أن امرأة، قالت للنبي صلى الله عليه وسلم صل على وعلى زوجي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صلى الله عليك وعلى زوجك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     A woman said to the Prophet (ﷺ): Invoke blessing on me as well as on my husband. The Prophet (ﷺ) said: May Allah send blessing on you and your husband.",
      "chain": [
        "31167",
        "20469",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأسود بن قيس، عن سعيد بن عمرو، - يعني ابن سعيد بن العاص - عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا و هكذا وهكذا ‏\"‏ ‏.‏ وخنس سليمان أصبعه في الثالثة يعني تسعا وعشرين وثلاثين ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: The month consists of twenty-nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha'ban came, Ibn Umar would send someone (who tried) to sight the moon for him. If it was sighted, then well and good; in case it was not sighted, and there was no cloud and dust before him (on the horizon), he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn Umar would end his fasting alone with the people, and did not follow this calculation.",
      "chain": [
        "20193",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "2534",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبيدة بن حميد، عن الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، حدث عن رسول الله صلى الله عليه وسلم أنه أراد أن يغزو فقال ‏:‏ ‏\"‏ يا معشر المهاجرين والأنصار، إن من إخوانكم قوما ليس لهم مال ولا عشيرة فليضم أحدكم إليه الرجلين أو الثلاثة فما لأحدنا من ظهر يحمله إلا عقبة كعقبة ‏\"‏ ‏.‏ يعني أحدهم ‏.‏ فضممت إلى اثنين أو ثلاثة، قال ‏:‏ ما لي إلا عقبة كعقبة أحدهم من جملي ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     Once the Messenger of Allah (ﷺ) intended to go on an expedition. He said: O group of the emigrants (Muhajirun) and the helpers (Ansar), among your brethren there are people who have neither property nor family. So one of you should take with him two or three persons; with me. I also rode on my camel by turns like one of them.",
      "chain": [
        "31160",
        "20341",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "3165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأسود بن قيس، عن نبيح، عن جابر بن عبد الله، قال كنا حملنا القتلى يوم أحد لندفنهم فجاء منادي النبي صلى الله عليه وسلم فقال إن رسول الله صلى الله عليه وسلم يأمركم أن تدفنوا القتلى في مضاجعهم فرددناهم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     On the day of Uhud we brought the martyrs to bury them (at another place), but the crier of the Prophet (ﷺ) came and said: The Messenger of Allah (ﷺ) has commanded you to bury the martyrs at the place where they fell. So we took them back.",
      "chain": [
        "28531",
        "20012",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة بن جندب، قال صلى بنا النبي صلى الله عليه وسلم في كسوف لا نسمع له صوتا ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث سمرة حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وهو قول الشافعي ‏.‏",
      "text_en": " Samurah bin Jundah narrated:                     \"The Prophet led us in prayer during an eclipse; we did not hear his voice.\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "1717",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن الأسود بن قيس، قال سمعت نبيحا العنزي، يحدث عن جابر، قال لما كان يوم أحد جاءت عمتي بأبي لتدفنه في مقابرنا فنادى منادي رسول الله صلى الله عليه وسلم ردوا القتلى إلى مضاجعهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال أبو عيسى ونبيح ثقة ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "2712",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن منيع، حدثنا سفيان بن عيينة، عن الأسود بن قيس، عن نبيح العنزي، عن جابر، أن النبي صلى الله عليه وسلم نهاهم أن يطرقوا النساء ليلا ‏.‏ وفي الباب عن أنس وابن عمر وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن جابر عن النبي صلى الله عليه وسلم ‏.‏ - وقد روي عن ابن عباس أن النبي صلى الله عليه وسلم نهاهم أن يطرقوا النساء ليلا قال فطرق رجلان بعد نهى النبي صلى الله عليه وسلم فوجد كل واحد منهما مع امرأته رجلا ‏.‏",
      "text_en": " Narrated Jabir:                     that the Prophet (ﷺ) prohibited them from returning to the women from a journey during the night.",
      "chain": [
        "30242",
        "20005",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "3668",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن الأسود بن قيس، عن جندب البجلي، قال كنت مع النبي صلى الله عليه وسلم في غار فدميت أصبعه فقال النبي صلى الله عليه وسلم ‏\"‏ هل أنت إلا إصبع دميت وفي سبيل الله ما لقيت ‏\"‏ ‏.‏ قال وأبطأ عليه جبريل عليه السلام فقال المشركون قد ودع محمد فأنزل الله تعالى ‏:‏ ‏(‏ ما ودعك ربك وما قلى ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة والثوري عن الأسود بن قيس ‏.‏",
      "text_en": " Jundab Al-Bajali said:                     “I was with the Prophet in a battle when of his finger bled, so the Prophet said: ‘Are you but a finger that bleeds – In the cause of Allah is what you have met.’” He said: “Jibril [peace be upon him] was delayed, so the idolaters said: ‘Muhammad has been forsaken.’ So Allah, Blessed is He and Most High revealed: Your Lord has neither forsaken you, nor hate you.”",
      "chain": [
        "30421",
        "20005",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "1484",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا الحسين بن عياش، قال حدثنا زهير، قال حدثنا الأسود بن قيس، قال حدثني ثعلبة بن عباد العبدي، من أهل البصرة أنه شهد خطبة يوما لسمرة بن جندب فذكر في خطبته حديثا عن رسول الله صلى الله عليه وسلم قال سمرة بن جندب بينا أنا يوما وغلام من الأنصار نرمي غرضين لنا على عهد رسول الله صلى الله عليه وسلم حتى إذا كانت الشمس قيد رمحين أو ثلاثة في عين الناظر من الأفق اسودت فقال أحدنا لصاحبه انطلق بنا إلى المسجد فوالله ليحدثن شأن هذه الشمس لرسول الله صلى الله عليه وسلم في أمته حدثا - قال - فدفعنا إلى المسجد - قال - فوافينا رسول الله صلى الله عليه وسلم حين خرج إلى الناس - قال - فاستقدم فصلى فقام كأطول قيام قام بنا في صلاة قط ما نسمع له صوتا ثم ركع بنا كأطول ركوع ما ركع بنا في صلاة قط ما نسمع له صوتا ثم سجد بنا كأطول سجود ما سجد بنا في صلاة قط لا نسمع له صوتا ثم فعل ذلك في الركعة الثانية مثل ذلك - قال - فوافق تجلي الشمس جلوسه في الركعة الثانية فسلم فحمد الله وأثنى عليه وشهد أن لا إله إلا الله وشهد أنه عبد الله ورسوله ‏.‏ مختصر ‏.‏",
      "text_en": " Tha'labah bin 'Abbad Al-'Abdi from the people of Al-Basrah narrated that:                     He attended a Khutbah one day that was delivered by Samurah bin Jundub. In his Khutbah he mentioned a hadith from the Messenger of Allah (ﷺ). Samurah bin Jundub said: \"One day a boy from among the Ansar and I were shooting at two targets of ours, during the time of the Messenger of Allah (ﷺ), when the sun was at a height of two or three spears as it appears to one who is looking at the horizon. The sun turned black, and we said to one another, let us go to the masjid, for by Allah (SWT) this must herald some event concerning the Messenger of Allah (ﷺ) and his ummah. We went to the masjid and we saw the Messenger of Allah (ﷺ) coming out to the people. He went forward and prayed. He stood for the longest time that he had ever stood in any prayer in which he led us, but we did not hear him saying anything. Then he bowed for the longest time that he had ever bowed in any prayer in which he led us, but we did not hear him saying anything. Then he prostrated for the longest time that he had ever prostrated in any prayer in which he led us, but we did not hear him saying anything. The he did likewise in the second rak'ah. And the eclipse ended as he was sitting at the end of the second rak'ah. The he said the salam, then he praised and glorified Allah (SWT), and bore witness that there is none worthy of worship but Allah (SWT) and he bore witness that he was the slave and Messenger of Allah.\" Narrated in abridged form.",
      "chain": [
        "38684",
        "20321",
        "11323",
        "19841"
      ]
    },
    {
      "hadith_no": "1495",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو نعيم، قال حدثنا سفيان، عن الأسود بن قيس، عن ابن عباد، - رجل من بني عبد القيس - عن سمرة، ‏.‏ أن النبي صلى الله عليه وسلم صلى بهم في كسوف الشمس لا نسمع له صوتا ‏.‏",
      "text_en": " It was narrated from Samurah that:                     The Prophet (ﷺ) led them in prayer during an eclipse of the sun, and we did not hear him say anything.",
      "chain": [
        "38433",
        "20348",
        "20012",
        "11323"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود الحفري، عن سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة، أن النبي صلى الله عليه وسلم خطب حين انكسفت الشمس فقال ‏\"‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah that:                     The Prophet (ﷺ) delivered a Khutbah when the sun eclipsed and he said: 'Amma ba'd (to proceed).'\"",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "2004",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، ‏:‏ أن النبي صلى الله عليه وسلم أمر بقتلى أحد أن يردوا إلى مصارعهم، وكانوا قد نقلوا إلى المدينة ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah:                     That the Prophet commanded that those who had been killed at Uhud should be taken back to the place where they fell; they had been brought to Al-Madinah.",
      "chain": [
        "36658",
        "20005",
        "11323"
      ]
    },
    {
      "hadith_no": "2005",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن سفيان، عن الأسود بن قيس، عن نبيح العنزي، عن جابر، أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ ادفنوا القتلى في مصارعهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that the Prophet said:                     \"Bury the slain where they fell.\"",
      "chain": [
        "20032",
        "20012",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "2140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عبد الرحمن، عن سفيان، عن الأسود بن قيس، عن سعيد بن عمرو، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ ثلاثا حتى ذكر تسعا وعشرين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet said:                     \"We are an unlettered Ummah, we do not use astronomical counting or computation. The month is like this, and this, and this,\" he did three times, showing it as twenty-nine.",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "2141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، عن محمد، عن شعبة، عن الأسود بن قيس، قال سمعت سعيد بن عمرو بن سعيد بن أبي العاص، أنه سمع ابن عمر، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ إنا أمة أمية لا نحسب ولا نكتب والشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وعقد الإبهام في الثالثة ‏\"‏ والشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ تمام الثلاثين ‏.‏",
      "text_en": " It was narrated from Saeed bin 'Amr bin Saeed bin Abi Al-As, that:                     he heard Ibn 'Umar narrate that the Prophet said; \"We are an unlettered Ummah; we do not use computation. The month is like this, and this, and this,\" and he held down his thumb the last time. \"And the month is like this, and this, and this,\" completing thirty.",
      "chain": [
        "30170",
        "30160",
        "20278",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "4368",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن الأسود بن قيس، عن جندب بن سفيان، قال شهدت أضحى مع رسول الله صلى الله عليه وسلم فصلى بالناس فلما قضى الصلاة رأى غنما قد ذبحت فقال ‏\"‏ من ذبح قبل الصلاة فليذبح شاة مكانها ومن لم يكن ذبح فليذبح على اسم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jundub bin Sufyan said:                     \"I attended (the day of) sacrifice with the Messenger of Allah He led the people 9in prayer, then when he finished praying he saw some sheep that had been sacrificed. He said 'Whoever slaughtered (his sacrifice) before the prayer. Let him slaughtered (his sacrifice) before the prayer, let him slaughter a sheep in its place, and whoever has not slaughtered, let him offer a sacrifice in the name of Allah, the Mighty and Sublime.\"'",
      "chain": [
        "30480",
        "20327",
        "11323"
      ]
    },
    {
      "hadith_no": "4398",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن الأسود بن قيس، عن جندب بن سفيان، قال ضحينا مع رسول الله صلى الله عليه وسلم أضحى ذات يوم فإذا الناس قد ذبحوا ضحاياهم قبل الصلاة فلما انصرف رآهم النبي صلى الله عليه وسلم أنهم ذبحوا قبل الصلاة فقال ‏\"‏ من ذبح قبل الصلاة فليذبح مكانها أخرى ومن كان لم يذبح حتى صلينا فليذبح على اسم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jundab bin Sufyan said:                     \"We slaughtered the sacrifice with the Messenger of Allah on day, and the people slaughtered their sacrifices before the prayer. When he finished (the prayer) the Prophet saw that they had slaughtered their sacrifices before the prayer. He said: \"Whoever slaughtered his sacrifice before the prayer, let him slaughter another in its place, and whoever did not slaughter his sacrifice until we had prayed, let him slaughter it in the name of Allah, The Mighty and Sublime,\" (Sahih )",
      "chain": [
        "30367",
        "20469",
        "11323"
      ]
    },
    {
      "hadith_no": "254",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، قال كان النبي  صلى الله عليه وسلم  إذا مشى مشى أصحابه أمامه وتركوا ظهره للملائكة ‏.‏",
      "text_en": " It was narrarted that Jabir bin 'Abdullah said:                     \"When the Prophet walked, his Companions would walk in front of him, and he would leave his back for the angels.\"",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة بن جندب، قال صلى بنا رسول الله  صلى الله عليه وسلم  في الكسوف فلا نسمع له صوتا ‏.‏",
      "text_en": " It wasnarrated that Samurah bin Jundab said:                      “The Messenger of Allah(ﷺ) led us in the eclipse prayer, and we did not hear his voice.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20012",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "1583",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، وسهل بن أبي سهل، قالا حدثنا سفيان بن عيينة، عن الأسود بن قيس، سمع نبيحا العنزي، يقول سمعت جابر بن عبد الله، يقول إن رسول الله  صلى الله عليه وسلم  أمر بقتلى أحد أن يردوا إلى مصارعهم وكانوا نقلوا إلى المدينة ‏.‏",
      "text_en": " It wasnarrated from Aswad bin Qais that he heard Nubaih Al-‘Anazisay:                      “Iheard Jabir bin ‘Abdullah say: ‘The Messenger of Allah (ﷺ)commanded that the slain of the battle of Uhud should be returned tothe battlefield; they had been moved to Al-Madinah.’”",
      "chain": [
        "30288",
        "38259",
        "20005",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "3272",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن الأسود بن قيس، عن جندب البجلي، أنه سمعه يقول شهدت الأضحى مع رسول الله  صلى الله عليه وسلم  فذبح أناس قبل الصلاة فقال النبي  صلى الله عليه وسلم  ‏\"‏ من كان ذبح منكم قبل الصلاة فليعد أضحيته ومن لا فليذبح على اسم الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Aswad bin Qais that he heard Jundub Al-Bajalisay:                      “Iwas present on Adha day with the Messenger of Allah (ﷺ), andsomepeople slaughtered before the prayer. The Prophet (ﷺ) said:‘Whoever among you has slaughtered before the prayer, let himrepeathis sacrifice, and whoever has not, let him offer hissacrifice in theName of Allah.’”",
      "chain": [
        "30288",
        "20005",
        "11323",
        "4053"
      ]
    }
  ],
  "total_hadiths": 44
}