{
  "id": "11321",
  "name": "Ibrahim bin Muhammad إبراهيم بن محمد بن المنتشر",
  "full_name": "Ibrahim bin Muhammad إبراهيم بن محمد بن المنتشر",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "11388",
      "name": "Muhammad bin al-Muntashir bin al-Ajda' محمد بن المنتشر بن الأجدع",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11388",
      "name": "Muhammad bin al-Muntashir bin al-Ajda' محمد بن المنتشر بن الأجدع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11386",
      "name": "Qays bin Muslim al-Jadli قيس بن مسلم الجدلي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-267",
      "hadith_no": "267",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا ابن أبي عدي، ويحيى بن سعيد، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال ذكرته لعائشة فقالت يرحم الله أبا عبد الرحمن، كنت أطيب رسول الله صلى الله عليه وسلم، فيطوف على نسائه، ثم يصبح محرما ينضخ طيبا‏.‏",
      "text_en": " Narrated Muhammad bin Al-Muntathir:                     on the authority of his father that he had asked `Aisha (about the Hadith of Ibn `Umar). She said, \"May Allah be Merciful to Abu `Abdur-Rahman. I used to put scent on Allah's Apostle and he used to go round his wives, and in the morning he assumed the Ihram, and the fragrance of scent was still coming out from his body.\"",
      "usc_msa_ref": "267",
      "chain": [
        "30160",
        "20276",
        "20031",
        "20020",
        "11321",
        "11388"
      ]
    },
    {
      "id": "sahih-bukhari-270",
      "hadith_no": "270",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عائشة فذكرت لها قول ابن عمر ما أحب أن أصبح، محرما أنضخ طيبا‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم ثم طاف في نسائه ثم أصبح محرما‏.‏",
      "text_en": " Narrated Muhammad bin Al-Muntathir:                     on the authority of his father that he had asked `Aisha about the saying of Ibn `Umar (i.e. he did not like to be a Muhrim while the smell of scent was still coming from his body). `Aisha said, \"I scented Allah's Apostle and he went round (had sexual intercourse with) all his wives, and in the morning he was Muhrim (after taking a bath).",
      "usc_msa_ref": "",
      "chain": [
        "20283",
        "20469",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1182",
      "hadith_no": "1182",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان لا يدع أربعا قبل الظهر وركعتين قبل الغداة‏.‏ تابعه ابن أبي عدي وعمرو عن شعبة‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet never missed four rak`at before the Zuhr prayer and two rak`at before the Fajr prayer.",
      "usc_msa_ref": "276",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2065",
      "hadith_no": "2065",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وإسحاق جميعا عن جرير، - قال يحيى أخبرنا جرير، - عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن، سالم مولى النعمان بن بشير عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقرأ في العيدين وفي الجمعة ب ‏{‏ سبح اسم ربك الأعلى‏}‏ و ‏{‏ هل أتاك حديث الغاشية‏}‏ قال وإذا اجتمع العيد والجمعة في يوم واحد يقرأ بهما أيضا في الصلاتين.",
      "text_en": " Nu'man b. Bashir reported that the Messenger of Allah (may peace be upon him) used to recite on two 'Ids and in Friday prayer:                     \" Glorify The name of Thy Lord, the Most High\" (Surah lxxxvii.), and:\" Has there come to thee the news of the overwhelming event\" (lxxxviii.). And when the 'Id and Jumu'a combined on a day he recited these two (surah) in both the prayers.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20028",
        "20031",
        "4057",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-2899",
      "hadith_no": "2899",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وأبو كامل جميعا عن أبي عوانة، - قال سعيد حدثنا أبو عوانة، - عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عبد الله بن عمر - رضى الله عنهما - عن الرجل، يتطيب ثم يصبح محرما فقال ما أحب أن أصبح محرما أنضخ طيبا لأن أطلي بقطران أحب إلى من أن أفعل ذلك ‏.‏ فدخلت على عائشة - رضى الله عنها - فأخبرتها أن ابن عمر قال ما أحب أن أصبح محرما أنضخ طيبا لأن أطلي بقطران أحب إلى من أن أفعل ذلك ‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم عند إحرامه ثم طاف في نسائه ثم أصبح محرما ‏.‏",
      "text_en": " Muhammad b. al-Muntashir reported on the authority of his father:                      I asked 'Abdullah b. 'Umar (Allah be pleased with them) about a person who applied perfume and then (on the following) morning entered upon the state of lhram. There- upon he said: I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing this (i. e. the applying of perfume), I went to 'A'isha (Allah be pleased with her) and told her that Ibn 'Umar stated:\" I do not like to enter upon the state of Ihram shaking off the perfume. Rubbing of tar (upon my body) is dearer to me than doing it (the applying of perfume).\" Thereupon 'A'isha said: I applied perfume to the Messenger of Allah (may peace be upon him) at the time of his entering upon the state of Ihram. He then went round his wives and then put on Ihram in the morning.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20469",
        "11168",
        "20469",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2900",
      "hadith_no": "2900",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن إبراهيم بن محمد بن المنتشر، قال سمعت أبي يحدث، عن عائشة، - رضى الله عنها - أنها قالت كنت أطيب رسول الله صلى الله عليه وسلم ثم يطوف على نسائه ثم يصبح محرما ينضخ طيبا ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I used to apply perfume to the Messenger of Allah (may peace be upon him). He then went round his wives, and entered upon the state of Ihram in the morning and the perfume was shaken off.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2901",
      "hadith_no": "2901",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو كريب، حدثنا وكيع، عن مسعر، وسفيان، عن إبراهيم بن محمد بن، المنتشر عن أبيه، قال سمعت ابن عمر، - رضى الله عنهما - يقول لأن أصبح مطليا بقطران أحب إلى من أن أصبح محرما أنضخ طيبا - قال - فدخلت على عائشة - رضى الله عنها - فأخبرتها بقوله فقالت طيبت رسول الله صلى الله عليه وسلم فطاف في نسائه ثم أصبح محرما ‏.‏",
      "text_en": " Muhammad b. al-Muntashir reported on the authority of his father:                      I heard from Ibn 'mar having said this:\" It is dearer to me to rub tar (on my body) than to enter upon the state of Ihram (in a state) of shaking off the perfume.\" He (the narrator) said: I went to 'A'isha and told her about this statement of his (of Ibn 'Umar). Thereupon she said: I applied perfume to the Messenger of Allah (may peace be upon him) and he then went round his wives and then entered upon the state of Ihram in the morning.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20359",
        "20005",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1067",
      "hadith_no": "1067",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثني إسحاق بن منصور، حدثنا هريم، عن إبراهيم بن محمد بن المنتشر، عن قيس بن مسلم، عن طارق بن شهاب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الجمعة حق واجب على كل مسلم في جماعة إلا أربعة عبد مملوك أو امرأة أو صبي أو مريض ‏\"‏ ‏.‏ قال أبو داود طارق بن شهاب قد رأى النبي صلى الله عليه وسلم ولم يسمع منه شيئا ‏.‏",
      "text_en": " Narrated Tariq ibn Shihab:                     The Prophet (ﷺ) said: The Friday prayer in congregation is a necessary duty for every Muslim, with four exceptions; a slave, a woman, a boy, and a sick person.Abu Dawud said: Tariq b. Shihab had seen the Prophet (ﷺ) but not heard anything from him.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30313",
        "11321",
        "11386",
        "3680"
      ]
    },
    {
      "id": "sunan-abi-daud-1122",
      "hadith_no": "1122",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم كان يقرأ في العيدين ويوم الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ قال وربما اجتمعا في يوم واحد فقرأ بهما ‏.‏",
      "text_en": " Al-Nu'man b. Bashir said:                      The Messenger of Allah (ﷺ) used to recite at the two 'Ids (festivals) and on Friday, \"Glorify the name of your most high Lord.\" (87) and \"Has the story of the overwhelming reached you?\" (88) He said: When a festival ('Id) and a Friday coincided, he recited them both (at the two prayers).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-abi-daud-1253",
      "hadith_no": "1253",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم كان لا يدع أربعا قبل الظهر وركعتين قبل صلاة الغداة ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) never omitted four rak'ahs before the noon prayer, and two rak'ahs before the dawn prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-533",
      "hadith_no": "533",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، قال كان النبي صلى الله عليه وسلم يقرأ في العيدين وفي الجمعة ب  ‏(‏ سبح اسم ربك الأعلى ‏)‏ و ‏(‏هل أتاك حديث الغاشية ‏)‏ وربما اجتمعا في يوم واحد فيقرأ بهما ‏.‏ قال وفي الباب عن أبي واقد وسمرة بن جندب وابن عباس ‏.‏ قال أبو عيسى حديث النعمان بن بشير حديث حسن صحيح ‏.‏ وهكذا روى سفيان الثوري ومسعر عن إبراهيم بن محمد بن المنتشر نحو حديث أبي عوانة ‏.‏ وأما سفيان بن عيينة فيختلف عليه في الرواية يروى عنه عن إبراهيم بن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن أبيه عن النعمان بن بشير ‏.‏ ولا نعرف لحبيب بن سالم رواية عن أبيه ‏.‏ وحبيب بن سالم هو مولى النعمان بن بشير وروى عن النعمان بن بشير أحاديث ‏.‏ وقد روي عن ابن عيينة عن إبراهيم بن محمد بن المنتشر نحو رواية هؤلاء ‏.‏ وروي عن النبي صلى الله عليه وسلم أنه كان يقرأ في صلاة العيدين ب ‏(‏اقتربت الساعة ‏)‏ وبه يقول الشافعي ‏.‏",
      "text_en": " An-Numan bin Bashir narrated:                     \"For the two Eid and the Friday prayer, the Prophet would recite: Glorify the Name of your Lord, the Most High, and Has there come to you the narration of the overwhelming? And sometimes they would occur on he same day, so he would recite the two of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-417",
      "hadith_no": "417",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "حدثنا هناد بن السري، عن وكيع، عن مسعر، وسفيان، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سمعت ابن عمر، يقول لأن أصبح مطليا بقطران أحب إلى من أن أصبح محرما أنضخ طيبا ‏‏.‏‏ فدخلت على عائشة فأخبرتها بقوله فقالت طيبت رسول الله صلى الله عليه وسلم فطاف على نسائه ثم أصبح محرما ‏‏.‏‏",
      "text_en": " It was narrated from Ibrahim bin Muhammad bin Al-Muntashir that his father said:                      \"I heard Ibn 'Umar say: 'I would rather wake up in the morning covered in tar than wake up and enter Ihram with the smell of perfume coming from me.' I entered upon 'Aishah and told her what he had said, and she said: 'I put perfume on the Messenger of Allah (ﷺ) and he went round to all his wives, then in the morning he entered Ihram.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20359",
        "20005",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-619",
      "hadith_no": "619",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا يحيى بن حكيم، وعمرو بن يزيد، قالا حدثنا ابن أبي عدي، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، أنه كان في مسجد عمرو بن شرحبيل فأقيمت الصلاة فجعلوا ينتظرونه فقال إني كنت أوتر ‏.‏ قال وسئل عبد الله هل بعد الأذان وتر قال نعم وبعد الإقامة وحدث عن النبي صلى الله عليه وسلم أنه نام عن الصلاة حتى طلعت الشمس ثم صلى ‏.‏ واللفظ ليحيى ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Muhammad bin Al-Muntashir that his father was in the Masjid of 'Amr bin Shurahbil and the Iqamah for prayer was said, so they were waiting for him. He said:                      \"I was praying Witr, and 'Abdullah was asked: 'Is there any Witr after the Adhan?' He said: \"Yes, and after the Iqamah, and he narrated that the Prophet (ﷺ) slept and missed the prayer until the sun rose then prayed.'\" And the wording is that of Yahya.",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20276",
        "20020",
        "11321",
        "11388"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-60",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، أن إبراهيم بن محمد بن المنتشر، أخبره قال سمعت أبي يحدث، عن حبيب بن سالم، عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقرأ في الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و‏{‏ هل أتاك حديث الغاشية ‏}‏ وربما اجتمع العيد والجمعة فيقرأ بهما فيهما جميعا ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"The Messenger of Allah (ﷺ) used to recite 'Glorify the name of your Lord, the Most High' and 'Has there come to you the narration of the overwhelming (i.e. the day of resurrection)?' in the Jumu'ah prayer, and sometimes 'Eid and jumu'ah would fall on the same day, and he would recite them in both 'Eid and jumu'ah prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-1568",
      "hadith_no": "1568",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم كان يقرأ في العيدين ويوم الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و{‏ هل أتاك حديث الغاشية ‏}‏ وربما اجتمعا في يوم واحد فيقرأ بهما ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     The Messenger of Allah (ﷺ) used to recite on the two 'Eids and on Friday: \"GLorify the Name of Your Lord, the Most High\" and \"Has there come to you the narration of The Overwhelming?\" Sometimes the two ('Eid and Jumu'ah) occurred on the same day, and he would recite them (these two Surahs).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-1590",
      "hadith_no": "1590",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرني محمد بن قدامة، عن جرير، عن إبراهيم بن محمد بن المنتشر، قلت عن أبيه، قال نعم عن حبيب بن سالم، عن النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يقرأ في الجمعة والعيد ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ وإذا اجتمع الجمعة والعيد في يوم قرأ بهما ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                     \"The Messenger of Allah (ﷺ) used to recite: 'Glorify the Name of your Lord, the Most High' and \"Has there come to you the narration of The Overwhelming?', on Friday and on 'Eid, and when Friday and 'Eid converged, he would recite them both.\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-1685",
      "hadith_no": "1685",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن حكيم، قال حدثنا ابن أبي عدي، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، أنه كان في مسجد عمرو بن شرحبيل فأقيمت الصلاة فجعلوا ينتظرونه فجاء فقال إني كنت أوتر ‏.‏ قال وسئل عبد الله هل بعد الأذان وتر قال نعم وبعد الإقامة ‏.‏ وحدث عن النبي صلى الله عليه وسلم أنه نام عن الصلاة حتى طلعت الشمس ثم صلى ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Muhammad Al-Muntashir, from his father, that:                     He was in the masjid of 'Amr bin Shurahbil and the iqamah for prayer was said, and they were waiting. He came and said: \"I was praying witr.\" Abdullah was asked: \"Is there any witr after the adhan?\" He said: \"Yes, and after the Iqamah.\" And he narrated that the Prophet (ﷺ) once slept and missed the prayer until the sun had risen, then he prayed.",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20276",
        "20020",
        "11321",
        "11388"
      ]
    },
    {
      "id": "sunan-an-nasai-2704",
      "hadith_no": "2704",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت ابن عمر عن الطيب، عند الإحرام فقال لأن أطلي بالقطران أحب إلى من ذلك ‏.‏ فذكرت ذلك لعائشة فقالت يرحم الله أبا عبد الرحمن لقد كنت أطيب رسول الله صلى الله عليه وسلم فيطوف في نسائه ثم يصبح ينضح طيبا ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Al-Muntashir that his father said:                     \"I asked Ibn 'Umar about wearing perfume when entering Ihram and he said: 'If I were to be daubed with tar that would be dearer to me than that, I mentioned that to 'Aishah and she said: 'May Allah have mercy on Abu 'Abdur-Rahman. I used to put perfume on the Messenger of Allah then he would go around his wives, then in the morning he would be smelling strongly of perfume.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2705",
      "hadith_no": "2705",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هناد بن السري، عن وكيع، عن مسعر، وسفيان، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سمعت ابن عمر، يقول لأن أصبح مطليا بقطران أحب إلى من أن أصبح محرما أنضح طيبا ‏.‏ فدخلت على عائشة فأخبرتها بقوله فقالت طيبت رسول الله صلى الله عليه وسلم فطاف في نسائه ثم أصبح محرما ‏.‏",
      "text_en": " It was narrated from Muhammad bin Ibrahim bin Al-Muntashir that his father said:                     \"I heard Ibn 'Umar say: 'If I were to wake up daubed with tar, that would be dearer to me than waking up and entering Ihram smelling strongly of perfume.' I entered upon 'Aishah and told her what he had said. She said: 'I put perfume on the Messenger of Allah and he went around among his wives, then the next morning he entered Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20359",
        "20005",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1340",
      "hadith_no": "1340",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، عن حبيب بن سالم، عن النعمان بن بشير، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في العيدين ب ‏{سبح اسم ربك الأعلى}‏ و ‏{هل أتاك حديث الغاشية}‏ ‏.‏",
      "text_en": " It wasnarrated from Nu’man bin Bashir that the Messenger of Allah(ﷺ)used to recite “Glorify the Name of your Lord, the Most High,”[Al-A’la (87)] and “Has there come to you the narration of theoverwhelming?” [Al-Ghashiyah (88)] in the ‘Eid prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11321",
        "11388",
        "11837",
        "274"
      ]
    }
  ],
  "total_hadiths": 20
}