{
  "id": "11325",
  "name": "Bryd bin 'Abdullah بريد بن عبد الله بن أبي",
  "full_name": "Bryd bin 'Abdullah بريد بن عبد الله بن أبي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Asha'ri",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20367",
      "name": "Yahya bin Sa'id bin Aban bin Sa'id يحيى بن سعيد بن أبان بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "11",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد القرشي، قال حدثنا أبي قال، حدثنا أبو بردة بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قالوا يا رسول الله أى الإسلام أفضل قال ‏\"‏ من سلم المسلمون من لسانه ويده ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Musa:                          Some people asked Allah's Apostle, \"Whose Islam is the best? i.e. (Who     is a very good Muslim)?\" He replied, \"One who avoids harming the      Muslims with his tongue and hands.\"",
      "chain": [
        "30254",
        "20367",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا حماد بن أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل ما بعثني الله به من الهدى والعلم كمثل الغيث الكثير أصاب أرضا، فكان منها نقية قبلت الماء، فأنبتت الكلأ والعشب الكثير، وكانت منها أجادب أمسكت الماء، فنفع الله بها الناس، فشربوا وسقوا وزرعوا، وأصابت منها طائفة أخرى، إنما هي قيعان لا تمسك ماء، ولا تنبت كلأ، فذلك مثل من فقه في دين الله ونفعه ما بعثني الله به، فعلم وعلم، ومثل من لم يرفع بذلك رأسا، ولم يقبل هدى الله الذي أرسلت به ‏\"‏‏.‏ قال أبو عبد الله قال إسحاق وكان منها طائفة قيلت الماء‏.‏ قاع يعلوه الماء، والصفصف المستوي من الأرض‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال سئل النبي صلى الله عليه وسلم عن أشياء كرهها، فلما أكثر عليه غضب، ثم قال للناس ‏\"‏ سلوني عما شئتم ‏\"‏‏.‏ قال رجل من أبي قال ‏\"‏ أبوك حذافة ‏\"‏‏.‏ فقام آخر فقال من أبي يا رسول الله فقال ‏\"‏ أبوك سالم مولى شيبة ‏\"‏‏.‏ فلما رأى عمر ما في وجهه قال يا رسول الله، إنا نتوب إلى الله عز وجل‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet was asked about things which he did not like, but when the questioners insisted, the Prophet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my father?\" The Prophet replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is my father, O Allah's Apostle ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" So when `Umar saw that (the anger) on the face of the Prophet he said, \"O Allah's Apostle! We repent to Allah (Our offending you).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "196",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، أن النبي صلى الله عليه وسلم دعا بقدح فيه ماء، فغسل يديه ووجهه فيه ومج فيه‏.‏",
      "text_en": " Narrated Abu Musa:                     Once the Prophet asked for a tumbler containing water. He washed his hands and face in it and also threw a mouthful of water in it.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "558",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم ‏\"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا إلى الليل، فعملوا إلى نصف النهار، فقالوا لا حاجة لنا إلى أجرك، فاستأجر آخرين فقال أكملوا بقية يومكم، ولكم الذي شرطت، فعملوا حتى إذا كان حين صلاة العصر قالوا لك ما عملنا‏.‏ فاستأجر قوما فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night. They worked till midday and they said, 'We are not in need of your reward.' SO the man employed another batch and said to them, 'Complete the rest of the day and yours will be the wages I had fixed (for the first batch). They worked Up till the time of the `Asr prayer and said, 'Whatever we have done is for you.' He employed another batch. They worked for the rest of the day till sunset, and they received the wages of the two former batches.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "567",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن العلاء، قال أخبرنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كنت أنا وأصحابي الذين، قدموا معي في السفينة نزولا في بقيع بطحان، والنبي صلى الله عليه وسلم بالمدينة، فكان يتناوب النبي صلى الله عليه وسلم عند صلاة العشاء كل ليلة نفر منهم، فوافقنا النبي  عليه السلام  أنا وأصحابي وله بعض الشغل في بعض أمره فأعتم بالصلاة حتى ابهار الليل، ثم خرج النبي صلى الله عليه وسلم فصلى بهم، فلما قضى صلاته قال لمن حضره ‏\"‏ على رسلكم، أبشروا إن من نعمة الله عليكم أنه ليس أحد من الناس يصلي هذه الساعة غيركم ‏\"‏‏.‏ أو قال ‏\"‏ ما صلى هذه الساعة أحد غيركم ‏\"‏‏.‏ لا يدري أى الكلمتين قال‏.‏ قال أبو موسى فرجعنا ففرحنا بما سمعنا من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     My companions, who came with me in the boat and I landed at a place called Baqi [??] Buthan [??] . The Prophet was in Medina at that time. One of us used to go to the Prophet by turns every night at the time of the `Isha prayer. Once I along with my companions went to the Prophet and he was busy in some of his affairs, so the `Isha' prayer was delayed to the middle of the night He then came out and led the people (in prayer). After finishing from the prayer, he addressed the people present there saying, \"Be patient! Don't go away. Have the glad tiding. It is from the blessing of Allah upon you that none amongst mankind has prayed at this time save you.\" Or said, \"None except you has prayed at this time.\" Abu Musa added, 'So we returned happily after what we heard from Allah's Apostle .\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "651",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال قال النبي صلى الله عليه وسلم ‏\"‏ أعظم الناس أجرا في الصلاة أبعدهم فأبعدهم ممشى، والذي ينتظر الصلاة حتى يصليها مع الإمام أعظم أجرا من الذي يصلي ثم ينام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The people who get tremendous reward for the prayer are those who are farthest away (from the mosque) and then those who are next farthest and so on. Similarly one who waits to pray with the Imam has greater reward than one who prays and goes to bed. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1059",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال خسفت الشمس، فقام النبي صلى الله عليه وسلم فزعا، يخشى أن تكون الساعة، فأتى المسجد، فصلى بأطول قيام وركوع وسجود رأيته قط يفعله وقال ‏\"‏ هذه الآيات التي يرسل الله لا تكون لموت أحد ولا لحياته، ولكن يخوف الله به عباده، فإذا رأيتم شيئا من ذلك فافزعوا إلى ذكره ودعائه واستغفاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The sun eclipsed and the Prophet got up, being afraid that it might be the Hour (i.e. Day of Judgment). He went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I had ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the life or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything thereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1435",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليأتين على الناس زمان يطوف الرجل فيه بالصدقة من الذهب ثم لا يجد أحدا يأخذها منه، ويرى الرجل الواحد يتبعه أربعون امرأة، يلذن به من قلة الرجال وكثرة النساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Thy Prophet (p.b.u.h) said, \"A time will come upon the people when a person will wander about with gold as Zakat and will not find anybody to accept it, and one man will be seen followed by forty women to be their guardian because of scarcity of men and great number of women. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا أبو بردة بن عبد الله بن أبي بردة، حدثنا أبو بردة بن أبي موسى، عن أبيه  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم إذا جاءه السائل، أو طلبت إليه حاجة قال ‏\"‏ اشفعوا تؤجروا، ويقضي الله على لسان نبيه صلى الله عليه وسلم ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda bin Abu Musa:                     that his father said, \"Whenever a beggar came to Allah's Apostle or he was asked for something, he used to say (to his companions), \"Help and recommend him and you will receive the reward for it; and Allah will bring about what He will through His Prophet's tongue.\"",
      "chain": [
        "20040",
        "20256",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1460",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخازن المسلم الأمين الذي ينفذ  وربما قال يعطي  ما أمر به كاملا موفرا طيب به نفسه، فيدفعه إلى الذي أمر له به، أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"An honest Muslim storekeeper who carries out the orders of his master and pays fully what he has been ordered to give with a good heart and pays to that person to whom he was ordered to pay, is regarded as one of the two charitable persons.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2271",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا يوما إلى الليل على أجر معلوم، فعملوا له إلى نصف النهار فقالوا لا حاجة لنا إلى أجرك الذي شرطت لنا، وما عملنا باطل، فقال لهم لا تفعلوا أكملوا بقية عملكم، وخذوا أجركم كاملا، فأبوا وتركوا، واستأجر أجيرين بعدهم فقال لهما أكملا بقية يومكما هذا، ولكما الذي شرطت لهم من الأجر‏.‏ فعملوا حتى إذا كان حين صلاة العصر قالا لك ما عملنا باطل، ولك الأجر الذي جعلت لنا فيه‏.‏ فقال لهما أكملا بقية عملكما، فإن ما بقي من النهار شىء يسير‏.‏ فأبيا، واستأجر قوما أن يعملوا له بقية يومهم، فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين كليهما، فذلك مثلهم ومثل ما قبلوا من هذا النور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night for specific wages. They worked till midday and then said, 'We do not need your money which you have fixed for us and let whatever we have done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and take your full wages.' But they refused and went away. The man employed another batch after them and said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first batch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be annulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the rest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another batch to work for the rest of the day and they worked for the rest of the day till the sunset, and they received the wages of the two former batches. So, that was the example of those people (Muslims) and the example of this light (guidance) which they have accepted willingly.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الخازن الأمين الذي ينفق  وربما قال الذي يعطي  ما أمر به كاملا موفرا، طيب نفسه، إلى الذي أمر به، أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"An honest treasurer who gives what he is ordered to give fully, perfectly and willingly to the person to whom he is ordered to give, is regarded as one of the two charitable persons.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2446",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏‏.‏ وشبك بين أصابعه‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"A believer to another believer is like a building whose different parts enforce each other.\" The Prophet then clasped his hands with the fingers interlaced (while saying that).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2486",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حماد بن أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الأشعريين إذا أرملوا في الغزو، أو قل طعام عيالهم بالمدينة جمعوا ما كان عندهم في ثوب واحد، ثم اقتسموه بينهم في إناء واحد بالسوية، فهم مني وأنا منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the food of their families in Medina ran short, they would collect all their remaining food in one sheet and then distribute it among themselves equally by measuring it with a bowl. So, these people are from me, and I am from them.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2551",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المملوك الذي يحسن عبادة ربه، ويؤدي إلى سيده الذي له عليه من الحق والنصيحة والطاعة، له أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The Mamluk (slave) who worships his Lord in a perfect manner, and is dutiful, sincere and obedient to his Saiyid (master), will get a double reward.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن صباح، حدثنا إسماعيل بن زكرياء، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال سمع النبي صلى الله عليه وسلم رجلا يثني على رجل، ويطريه في مدحه فقال ‏\"‏ أهلكتم  أو قطعتم  ظهر الرجل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet heard someone praising another and exaggerating in his praise. The Prophet said, \"You have ruined or cut the man's back (by praising him so much).",
      "chain": [
        "30269",
        "20313",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2884",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال رمي أبو عامر في ركبته، فانتهيت إليه قال انزع هذا السهم‏.‏ فنزعته، فنزا منه الماء، فدخلت على النبي صلى الله عليه وسلم فأخبرته، فقال ‏\"‏ اللهم اغفر لعبيد أبي عامر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Abu 'Amir was hit with an arrow in his knee, so I went to him and he asked me to remove the arrow. When I removed it, the water started dribbling from it. Then I went to the Prophet and told him about it. He said, \"O Allah! Forgive `Ubaid Abu 'Amir.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3136",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال بلغنا مخرج النبي صلى الله عليه وسلم ونحن باليمن فخرجنا مهاجرين إليه، أنا وأخوان لي، أنا أصغرهم، أحدهما أبو بردة والآخر أبو رهم، إما قال في بضع، وإما قال في ثلاثة وخمسين أو اثنين وخمسين رجلا من قومي فركبنا سفينة، فألقتنا سفينتنا إلى النجاشي بالحبشة، ووافقنا جعفر بن أبي طالب وأصحابه عنده فقال جعفر إن رسول الله صلى الله عليه وسلم بعثنا ها هنا، وأمرنا بالإقامة فأقيموا معنا‏.‏ فأقمنا معه، حتى قدمنا جميعا، فوافقنا النبي صلى الله عليه وسلم حين افتتح خيبر، فأسهم لنا‏.‏ أو قال فأعطانا منها‏.‏ وما قسم لأحد غاب عن فتح خيبر منها شيئا، إلا لمن شهد معه، إلا أصحاب سفينتنا مع جعفر وأصحابه، قسم لهم معهم‏.‏",
      "text_en": " Narrated Abu Musa:                     We got the news of the migration of the Prophet while we were in Yemen, so we set out migrating to him. We were, I and my two brothers, I being the youngest, and one of my brothers was Abu Burda and the other was Abu Ruhm. We were over fifty (or fifty-three or fifty two) men from our people. We got on board a ship which took us to An-Najashi in Ethiopia, and there we found Ja`far bin Abu Talib and his companions with An-Najaishi. Ja`far said (to us), \"Allah's Apostle has sent us here and ordered us to stay here, so you too, stay with us.\" We stayed with him till we all left (Ethiopia) and met the Prophet at the time when he had conquered Khaibar. He gave us a share from its booty (or gave us from its booty). He gave only to those who had taken part in the Ghazwa with him. but he did not give any share to any person who had not participated in Khaibar's conquest except the people of our ship, besides Ja`far and his companions, whom he gave a share as he did them (i.e. the people of the ship).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3665",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن العلاء، حدثنا حماد بن أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى  أراه  عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في المنام أني أهاجر من مكة إلى أرض بها نخل، فذهب وهلي إلى أنها اليمامة أو هجر، فإذا هي المدينة يثرب، ورأيت في رؤياى هذه أني هززت سيفا فانقطع صدره، فإذا هو ما أصيب من المؤمنين يوم أحد، ثم هززته بأخرى فعاد أحسن ما كان، فإذا هو ما جاء الله به من الفتح واجتماع المؤمنين، ورأيت فيها بقرا والله خير فإذا هم المؤمنون يوم أحد، وإذا الخير ما جاء الله من الخير، وثواب الصدق الذي آتانا الله بعد يوم بدر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"In a dream I saw myself migrating from Mecca to a place having plenty of date trees. I thought that it was Al-Yamama or Hajar, but it came to be Medina i.e. Yathrib. In the same dream I saw myself moving a sword and its blade got broken. It came to symbolize the defeat which the Muslims suffered from, on the Day of Uhud. I moved the sword again, and it became normal as before, and that was the symbol of the victory Allah bestowed upon Muslims and their gathering together. I saw cows in my dream, and by Allah, that was a blessing, and they symbolized the believers on the Day of Uhud. And the blessing was the good Allah bestowed upon us and the reward of true belief which Allah gave us after the day of Badr.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3924",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  بلغنا مخرج النبي صلى الله عليه وسلم ونحن باليمن فركبنا سفينة فألقتنا سفينتنا إلى النجاشي بالحبشة، فوافقنا جعفر بن أبي طالب، فأقمنا معه حتى قدمنا، فوافقنا النبي صلى الله عليه وسلم حين افتتح خيبر، فقال النبي صلى الله عليه وسلم ‏\"‏ لكم أنتم يا أهل السفينة هجرتان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     We received the news of the departure of the Prophet (to Medina) while we were in Yemen. So we went on board a ship but our ship took us away to An-Najashi (the Negus) in Ethiopia. There we met Ja`far bin Abi Talib and stayed with him till we came (to Medina) by the time when the Prophet had conquered Khaibar. The Prophet said, \"O you people of the ship! You will have (the reward of) two migrations.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4036",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن جده أبي بردة، عن أبي موسى،، أراه عن النبي صلى الله عليه وسلم قال ‏\"‏ وإذا الخير ما جاء الله به من الخير بعد، وثواب الصدق الذي آتانا بعد يوم بدر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     That the Prophet said, \"The good is what Allah gave us later on (after Uhud), and the reward of truthfulness is what Allah gave us after the day (of the battle) of Badr.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4130",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى  رضى الله عنه  أرى عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في رؤياى أني هززت سيفا فانقطع صدره، فإذا هو ما أصيب من المؤمنين يوم أحد، ثم هززته أخرى فعاد أحسن ما كان، فإذا هو ما جاء به الله من الفتح واجتماع المؤمنين، ورأيت فيها بقرا والله خير، فإذا هم المؤمنون يوم أحد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"I saw in a dream that I moved a sword and its blade got broken, and that symbolized the casualties which the believers suffered on the day of Uhud. Then I moved it again, and it became as perfect as it had been, and that symbolized the Conquest (of Mecca) which Allah helped us to achieve, and the union of all the believers. I (also) saw cows in the dream, and what Allah does is always beneficial. Those cows appeared to symbolize the faithful believers (who were martyred) on the day of Uhud.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4178",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم في غزاة ونحن ستة نفر بيننا بعير نعتقبه، فنقبت أقدامنا ونقبت قدماى وسقطت أظفاري، وكنا نلف على أرجلنا الخرق، فسميت غزوة ذات الرقاع، لما كنا نعصب من الخرق على أرجلنا، وحدث أبو موسى بهذا، ثم كره ذاك، قال ما كنت أصنع بأن أذكره‏.‏ كأنه كره أن يكون شىء من عمله أفشاه‏.‏",
      "text_en": " Narrated Abu Burda:                     Abu Musa said, \"We went out in the company of the Prophet for a Ghazwa and we were six persons having one camel which we rode in rotation. So, (due to excessive walking) our feet became thin and my feet became thin and my nail dropped, and we used to wrap our feet with the pieces of cloth, and for this reason, the Ghazwa was named Dhat-ur-Riqa as we wrapped our feet with rags.\" When Abu- Musa narrated this (Hadith), he felt regretful to do so and said, as if he disliked to have disclosed a good deed of his.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4277",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال بلغنا مخرج النبي صلى الله عليه وسلم ونحن باليمن، فخرجنا مهاجرين إليه أنا، وأخوان لي أنا أصغرهم، أحدهما أبو بردة، والآخر أبو رهم  إما قال بضع وإما قال  في ثلاثة وخمسين أو اثنين وخمسين رجلا من قومي، فركبنا سفينة، فألقتنا سفينتنا إلى النجاشي بالحبشة، فوافقنا جعفر بن أبي طالب فأقمنا معه حتى قدمنا جميعا، فوافقنا النبي صلى الله عليه وسلم حين افتتح خيبر، وكان أناس من الناس يقولون لنا  يعني لأهل السفينة  سبقناكم بالهجرة، ودخلت أسماء بنت عميس، وهى ممن قدم معنا، على حفصة زوج النبي صلى الله عليه وسلم زائرة، وقد كانت هاجرت إلى النجاشي فيمن هاجر، فدخل عمر على حفصة وأسماء عندها، فقال عمر حين رأى أسماء من هذه قالت أسماء بنت عميس‏.‏ قال عمر الحبشية هذه البحرية هذه قالت أسماء نعم‏.‏ قال سبقناكم بالهجرة، فنحن أحق برسول الله صلى الله عليه وسلم منكم‏.‏ فغضبت وقالت كلا والله، كنتم مع رسول الله صلى الله عليه وسلم يطعم جائعكم، ويعظ جاهلكم، وكنا في دار أو في أرض البعداء البغضاء بالحبشة، وذلك في الله وفي رسوله صلى الله عليه وسلم وايم الله، لا أطعم طعاما، ولا أشرب شرابا حتى أذكر ما قلت لرسول الله صلى الله عليه وسلم ونحن كنا نؤذى ونخاف، وسأذكر ذلك للنبي صلى الله عليه وسلم وأسأله، والله لا أكذب ولا أزيغ ولا أزيد عليه‏.‏   فلما جاء النبي صلى الله عليه وسلم قالت يا نبي الله إن عمر قال كذا وكذا‏.‏ قال ‏\"‏ فما قلت له ‏\"‏‏.‏ قالت قلت له كذا وكذا‏.‏ قال ‏\"‏ ليس بأحق بي منكم، وله ولأصحابه هجرة واحدة، ولكم أنتم أهل السفينة هجرتان ‏\"‏‏.‏ قالت فلقد رأيت أبا موسى وأصحاب السفينة يأتوني أرسالا، يسألوني عن هذا الحديث، ما من الدنيا شىء هم به أفرح ولا أعظم في أنفسهم مما قال لهم النبي صلى الله عليه وسلم.",
      "text_en": " Narrated Abu Musa:                     The news of the migration of the Prophet (from Mecca to Medina) reached us while we were in Yemen. So we set out as emigrants towards him. We were (three) I and my two brothers. I was the youngest of them, and one of the two was Abu Burda, and the other, Abu Ruhm, and our total number was either 53 or 52 men from my people. We got on board a boat and our boat took us to Negus in Ethiopia. There we met Ja`far bin Abi Talib and stayed with him. Then we all came (to Medina) and met the Prophet at the time of the conquest of Khaibar. Some of the people used to say to us, namely the people of the ship, \"We have migrated before you.\" Asma' bint 'Umais who was one of those who had come with us, came as a visitor to Hafsa, the wife the Prophet . She had migrated along with those other Muslims who migrated to Negus. `Umar came to Hafsa while Asma' bint 'Umais was with her. `Umar, on seeing Asma,' said, \"Who is this?\" She said, \"Asma' bint 'Umais,\" `Umar said, \"Is she the Ethiopian? Is she the sea-faring lady?\" Asma' replied, \"Yes.\" `Umar said, \"We have migrated before you (people of the boat), so we have got more right than you over Allah's Apostle \" On that Asma' became angry and said, \"No, by Allah, while you were with Allah's Apostle who was feeding the hungry ones amongst you, and advised the ignorant ones amongst you, we were in the far-off hated land of Ethiopia, and all that was for the sake of Allah's Apostle . By Allah, I will neither eat any food nor drink anything till I inform Allah's Apostle of all that you have said. There we were harmed and frightened. I will mention this to the Prophet and will not tell a lie or curtail your saying or add something to it.\" So when the Prophet came, she said, \"O Allah's Prophet `Umar has said so-and-so.\" He said (to Asma'), \"What did you say to him?\" Asma's aid, \"I told him so-and-so.\" The Prophet said, \"He (i.e. `Umar) has not got more right than you people over me, as he and his companions have (the reward of) only one migration, and you, the people of the boat, have (the reward of) two migrations.\" Asma' later on said, \"I saw Abu Musa and the other people of the boat coming to me in successive groups, asking me about this narration,, and to them nothing in the world was more cheerful and greater than what the Prophet had said about them.\" Narrated Abu Burda: Asma' said, \"I saw Abu Musa requesting me to repeat this narration again and again.\" Narrated Abu Burda: Abu Musa said, \"The Prophet said, \"I recognize the voice of the group of Al- Ashariyun, when they recite the Qur'an, when they enter their homes at night, and I recognize their houses by (listening) to their voices when they are reciting the Qur'an at night although I have not seen their houses when they came to them during the day time. Amongst them is Hakim who, on meeting the cavalry or the enemy, used to say to them (i.e. the enemy). My companions order you to wait for them.' \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4280",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع حفص بن غياث، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال قدمنا على النبي صلى الله عليه وسلم بعد أن افتتح خيبر، فقسم لنا، ولم يقسم لأحد لم يشهد الفتح غيرنا‏.‏",
      "text_en": " Narrated Abu Musa:                     We came upon the Prophet after he had conquered Khaibar. He then gave us a share (from the booty), but apart from us he did not give to anybody else who did not attend the Conquest.",
      "chain": [
        "30123",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4367",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال لما فرغ النبي صلى الله عليه وسلم من حنين بعث أبا عامر على جيش إلى أوطاس فلقي دريد بن الصمة، فقتل دريد وهزم الله أصحابه‏.‏ قال أبو موسى وبعثني مع أبي عامر فرمي أبو عامر في ركبته، رماه جشمي بسهم فأثبته في ركبته، فانتهيت إليه فقلت يا عم من رماك فأشار إلى أبي موسى فقال ذاك قاتلي الذي رماني‏.‏ فقصدت له فلحقته فلما رآني ولى فاتبعته وجعلت أقول له ألا تستحي، ألا تثبت‏.‏ فكف فاختلفنا ضربتين بالسيف فقتلته ثم قلت لأبي عامر قتل الله صاحبك‏.‏ قال فانزع هذا السهم فنزعته فنزا منه الماء‏.‏ قال يا ابن أخي أقرئ النبي صلى الله عليه وسلم السلام، وقل له استغفر لي‏.‏ واستخلفني أبو عامر على الناس، فمكث يسيرا ثم مات، فرجعت فدخلت على النبي صلى الله عليه وسلم في بيته على سرير مرمل وعليه فراش قد أثر رمال السرير بظهره وجنبيه، فأخبرته بخبرنا وخبر أبي عامر، وقال قل له استغفر لي، فدعا بماء فتوضأ ثم رفع يديه فقال ‏\"‏ اللهم اغفر لعبيد أبي عامر ‏\"‏‏.‏ ورأيت بياض إبطيه ثم قال ‏\"‏ اللهم اجعله يوم القيامة فوق كثير من خلقك من الناس ‏\"‏‏.‏ فقلت ولي فاستغفر‏.‏ فقال ‏\"‏ اللهم اغفر لعبد الله بن قيس ذنبه وأدخله يوم القيامة مدخلا كريما ‏\"‏‏.‏ قال أبو بردة إحداهما لأبي عامر والأخرى لأبي موسى‏.‏",
      "text_en": " Narrated Abu Musa:                     When the Prophet had finished from the battle of Hunain, he sent Abu Amir at the head of an army to Autas He (i.e. Abu Amir) met Duraid bin As Summa and Duraid was killed and Allah defeated his companions. The Prophet sent me with Abu 'Amir. Abu Amir was shot at his knee with an arrow which a man from Jushm had shot and fixed into his knee. I went to him and said, \"O Uncle! Who shot you?\" He pointed me out (his killer) saying, \"That is my killer who shot me (with an arrow).\" So I headed towards him and overtook him, and when he saw me, he fled, and I followed him and started saying to him, \"Won't you be ashamed? Won't you stop?\" So that person stopped, and we exchanged two hits with the swords and I killed him. Then I said to Abu 'Amir. \"Allah has killed your killer.\" He said, \"Take out this arrow\" So I removed it, and water oozed out of the wound. He then said, \"O son of my brother! Convey my compliments to the Prophet and request him to ask Allah's Forgiveness for me.\" Abu Amir made me his successor in commanding the people (i.e. troops). He survived for a short while and then died. (Later) I returned and entered upon the Prophet at his house, and found him lying in a bed made of stalks of date-palm leaves knitted with ropes, and on it there was bedding. The strings of the bed had their traces over his back and sides. Then I told the Prophet about our and Abu Amir's news and how he had said \"Tell him to ask for Allah's Forgiveness for me.\" The Prophet asked for water, performed ablution and then raised hands, saying, \"O Allah's Forgive `Ubaid, Abu Amir.\" At that time I saw the whiteness of the Prophet's armpits. The Prophet then said, \"O Allah, make him (i.e. Abu Amir) on the Day of Resurrection, superior to many of Your human creatures.\" I said, \"Will you ask Allah's Forgiveness for me?\" (On that) the Prophet said, \"O Allah, forgive the sins of `Abdullah bin Qais and admit him to a nice entrance (i.e. paradise) on the Day of Resurrection.\" Abu Burda said, \"One of the prayers was for Abu 'Amir and the other was for Abu Musa (i.e. `Abdullah bin Qais).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4372",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال كنت عند النبي صلى الله عليه وسلم وهو نازل بالجعرانة بين مكة والمدينة ومعه بلال، فأتى النبي صلى الله عليه وسلم أعرابي فقال ألا تنجز لي ما وعدتني‏.‏ فقال له ‏\"‏ أبشر ‏\"‏‏.‏ فقال قد أكثرت على من أبشر‏.‏ فأقبل على أبي موسى وبلال كهيئة الغضبان فقال ‏\"‏ رد البشرى فاقبلا أنتما ‏\"‏‏.‏ قالا قبلنا‏.‏ ثم دعا بقدح فيه ماء فغسل يديه ووجهه فيه، ومج فيه، ثم قال ‏\"‏ اشربا منه، وأفرغا على وجوهكما ونحوركما، وأبشرا ‏\"‏‏.‏ فأخذا القدح ففعلا، فنادت أم سلمة من وراء الستر أن أفضلا لأمكما‏.‏ فأفضلا لها منه طائفة‏.‏",
      "text_en": " Narrated Abu Burda:                     Abu Musa said, \"I was with the Prophet when he was encamping at Al-Jarana (a place) between Mecca and Medina and Bilal was with him. A bedouin came to the Prophet and said, \"Won't you fulfill what you have promised me?\" The Prophet said, 'Rejoice (at what I will do for you).' The bedouin said, \"(You have said to me) rejoice too often.\" Then the Prophet turned to me (i.e. Abu Musa) and Bilal in an angry mood and said, 'The bedouin has refused the good tidings, so you both accept them.' Bilal and I said, 'We accept them.' Then the Prophet asked for a drinking bowl containing water and washed his hands and face in it, and then took a mouthful of water and threw it therein saying (to us), \"Drink (some of) it and pour (some) over your faces and chests and be happy at the good tidings.\" So they both took the drinking bowl and did as instructed. Um Salama called from behind a screen, \"Keep something (of the water for your mother.\" So they left some of it for her.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4459",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال أرسلني أصحابي إلى رسول الله صلى الله عليه وسلم أسأله الحملان لهم، إذ هم معه في جيش العسرة وهى غزوة تبوك فقلت يا نبي الله، إن أصحابي أرسلوني إليك لتحملهم‏.‏ فقال ‏\"‏ والله لا أحملكم على شىء ‏\"‏‏.‏ ووافقته، وهو غضبان ولا أشعر، ورجعت حزينا من منع النبي صلى الله عليه وسلم، ومن مخافة أن يكون النبي صلى الله عليه وسلم وجد في نفسه على، فرجعت إلى أصحابي فأخبرتهم الذي قال النبي صلى الله عليه وسلم، فلم ألبث إلا سويعة إذ سمعت بلالا ينادي أى عبد الله بن قيس‏.‏ فأجبته، فقال أجب رسول الله صلى الله عليه وسلم يدعوك، فلما أتيته، قال ‏\"‏ خذ هذين القرينين  وهذين القرينين لستة أبعرة ابتاعهن حينئذ من سعد  فانطلق بهن إلى أصحابك فقل إن الله  أو قال إن رسول الله صلى الله عليه وسلم  يحملكم على هؤلاء فاركبوهن ‏\"‏‏.‏ فانطلقت إليهم بهن، فقلت إن النبي صلى الله عليه وسلم يحملكم على هؤلاء ولكني والله لا أدعكم حتى ينطلق معي بعضكم إلى من سمع مقالة رسول الله صلى الله عليه وسلم لا تظنوا أني حدثتكم شيئا لم يقله رسول الله صلى الله عليه وسلم فقالوا لي إنك عندنا لمصدق، ولنفعلن ما أحببت‏.‏ فانطلق أبو موسى بنفر منهم حتى أتوا الذين سمعوا قول رسول الله صلى الله عليه وسلم منعه إياهم، ثم إعطاءهم بعد، فحدثوهم بمثل ما حدثهم به أبو موسى‏.‏",
      "text_en": " Narrated Abu Musa:                     My Companions sent me to Allah's Apostle to ask him for some animals to ride on as they were accompanying him in the army of Al-Usra, and that was the Ghazwa (Battle) of Tabuk, I said, \"O Allah's Prophet! My companions have sent me to you to provide them with means of transportation.\" He said, \"By Allah! I will not make you ride anything.\" It happened that when I reached him, he was in an angry mood, and I didn't notice it. So I returned in a sad mood because of the refusal the Prophet and for the fear that the Prophet might have become 'angry with me. So I returned to my companions and informed them of what the Prophet had said. Only a short while had passed when I heard Bilal calling, \"O `Abdullah bin Qais!\" I replied to his call. Bilal said, \"Respond to Allah's Apostle who is calling you.\" When I went to him (i.e. the Prophet), he said, \"Take these two camels tied together and also these two camels tied together,\"' referring to six camels he had brought them from Sa`d at that time. The Prophet added, \"Take them to your companions and say, 'Allah (or Allah's Apostle ) allows you to ride on these,' so ride on them.\" So I took those camels to them and said, \"The Prophet allows you to ride on these (camels) but by Allah, I will not leave you till some of you proceed with me to somebody who heard the statement of Allah's Apostle. Do not think that I narrate to you a thing which Allah's Apostle has not said.\" They said to me, \"We consider you truthful, and we will do what you like.\" The sub-narrator added: So Abu Musa proceeded along with some of them till they came to those who have heard the statement of Allah's Apostle wherein he denied them (some animals to ride on) and (his statement) whereby he gave them the same. So these people told them the same information as Abu Musa had told them.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4732",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا أبو معاوية، حدثنا بريد بن أبي بردة، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ليملي للظالم حتى إذا أخذه لم يفلته ‏\"‏‏.‏ قال ثم قرأ ‏{‏وكذلك أخذ ربك إذا أخذ القرى وهى ظالمة إن أخذه أليم شديد‏}‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"Allah gives respite to the oppressor, but when He takes him over, He never releases him.\" Then he recited:-- \"Such is the seizure of your Lord when He seizes (population of) towns in the midst of their wrong: Painful indeed, and severe is His seizure.' (11.102)",
      "chain": [
        "30343",
        "20354",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5086",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعاهدوا القرآن فوالذي نفسي بيده لهو أشد تفصيا من الإبل في عقلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"Keep on reciting the Qur'an, for, by Him in Whose Hand my life is, Qur'an runs away (is forgotten) faster than camels that are released from their tying ropes.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5102",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن خلف أبو بكر، حدثنا أبو يحيى الحماني، حدثنا بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال له ‏\"‏ يا أبا موسى لقد أوتيت مزمارا من مزامير آل داود ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     That the Prophet said to him' \"O Abu Musa! You have been given one of the musical windinstruments of the family of David .'",
      "chain": [
        "30268",
        "20332",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5523",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا أبو أسامة، قال حدثني بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال ولد لي غلام، فأتيت به النبي صلى الله عليه وسلم فسماه إبراهيم، فحنكه بتمرة، ودعا له بالبركة ودفعه إلى، وكان أكبر ولد أبي موسى‏.‏",
      "text_en": " Narrated Abu Musa:                     A son was born to me and I took him to the Prophet who named him Ibrahim, did Tahnik for him with a date, invoked Allah to bless him and returned him to me. (The narrator added: That was Abu Musa's eldest son.)",
      "chain": [
        "30311",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5592",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل الجليس الصالح والسوء كحامل المسك ونافخ الكير، فحامل المسك إما أن يحذيك، وإما أن تبتاع منه، وإما أن تجد منه ريحا طيبة، ونافخ الكير إما أن يحرق ثيابك، وإما أن تجد ريحا خبيثة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, 'The example of a good pious companion and an evil one is that of a person carrying musk and another blowing a pair of bellows. The one who is carrying musk will either give you some perfume as a present, or you will buy some from him, or you will get a good smell from him, but the one who is blowing a pair of bellows will either burn your clothes or you will get a bad smell from him.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6097",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم أنه كان إذا أتاه السائل أو صاحب الحاجة قال ‏\"‏ اشفعوا فلتؤجروا، وليقض الله على لسان رسوله ما شاء ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Musa:                          Whenever a beggar or a person in need came to the Prophet, the Prophet     would say \"Help and recommend him and you will receive the reward for      it, and Allah will bring about what he will through His Prophet's      tongue",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6129",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن صباح، حدثنا إسماعيل بن زكرياء، حدثنا بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال سمع النبي صلى الله عليه وسلم رجلا يثني على رجل ويطريه في المدحة فقال ‏\"‏ أهلكتم  أو قطعتم  ظهر الرجل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet heard a man praising another man and he was exaggerating in his praise. The Prophet said (to him). \"You have destroyed (or cut) the back of the man.\"",
      "chain": [
        "30269",
        "20313",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6269",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال ولد لي غلام، فأتيت به النبي صلى الله عليه وسلم فسماه إبراهيم، فحنكه بتمرة، ودعا له بالبركة، ودفعه إلى، وكان أكبر ولد أبي موسى‏.‏",
      "text_en": " Narrated Abu Musa:                     I got a son and I took him to the Prophet who named him Ibrahim, and put in his mouth the juice of a date fruit (which be himself had chewed?, and invoked for Allah's blessing upon him, and then gave him back to me. He was the eldest son of Abii Musa.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6367",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال احترق بيت بالمدينة على أهله من الليل، فحدث بشأنهم النبي صلى الله عليه وسلم قال ‏\"‏ إن هذه النار إنما هي عدو لكم، فإذا نمتم فأطفئوها عنكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     One night a house in Medina was burnt with its occupants. The Prophet spoke about them, saying, \"This fire is indeed your enemy, so whenever you go to bed, put it out to protect yourselves.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6456",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال دعا النبي صلى الله عليه وسلم بماء فتوضأ، ثم رفع يديه فقال ‏\"‏ اللهم اغفر لعبيد أبي عامر ‏\"‏‏.‏ ورأيت بياض إبطيه فقال ‏\"‏ اللهم اجعله يوم القيامة فوق كثير من خلقك من الناس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet asked for some water and performed the ablution, and then raised his hands (towards the sky) and said, \"O Allah! Forgive `Ubaid Abi 'Amir.\" I saw the whiteness of his armpits (while he was raising his hands) and he added, \"O Allah! Upgrade him over many of Your human creatures on the Day of Resurrection.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6482",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ مثل الذي يذكر ربه والذي لا يذكر مثل الحى والميت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of the one who celebrates the Praises of his Lord (Allah) in comparison to the one who does not celebrate the Praises of his Lord, is that of a living creature compared to a dead one.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6561",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثلي ومثل ما بعثني الله كمثل رجل أتى قوما فقال رأيت الجيش بعينى، وإني أنا النذير العريان فالنجا النجاء‏.‏ فأطاعته طائفة فأدلجوا على مهلهم فنجوا، وكذبته طائفة فصبحهم الجيش فاجتاحهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said. \"My example and the example of the message with which Allah has sent me is like that of a man who came to some people and said, \"I have seen with my own eyes the enemy forces, and I am a naked warner (to you) so save yourself, save yourself! A group of them obeyed him and went out at night, slowly and stealthily and were safe, while another group did not believe him and thus the army took them in the morning and destroyed them.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6587",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه، ومن كره لقاء الله كره الله لقاءه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"Whoever loves the meeting with Allah, Allah too, loves the meeting with him; and whoever hates the meeting with Allah, Allah too, hates the meeting with him.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6759",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال أرسلني أصحابي إلى النبي صلى الله عليه وسلم أسأله الحملان فقال ‏\"‏ والله لا أحملكم على شىء ‏\"‏‏.‏ ووافقته وهو غضبان فلما أتيته قال ‏\"‏ انطلق إلى أصحابك فقل إن الله  أو إن رسول الله صلى الله عليه وسلم  يحملكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     My companions sent me to the Prophet to ask him for some mounts. He said, \"By Allah! I will not mount you on anything!\" When I met him, he was in an angry mood, but when I met him (again), he said, \"Tell your companions that Allah or Allah's Apostle will provide you with mounts.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7121",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن جده أبي بردة، عن أبي موسى، أراه عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في المنام أني أهاجر من مكة إلى أرض بها نخل، فذهب وهلي إلى أنها اليمامة أو هجر، فإذا هي المدينة يثرب، ورأيت فيها بقرا والله خير، فإذا هم المؤمنون يوم أحد، وإذا الخير ما جاء الله من الخير وثواب الصدق الذي أتانا الله به بعد يوم بدر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"I saw in a dream that I was migrating from Mecca to a land where there were date palm trees. I thought that it might be the land of Al-Yamama or Hajar, but behold, it turned out to be Yathrib (i.e. Medina). And I saw cows (being slaughtered) there, but the reward given by Allah is better (than worldly benefits). Behold, those cows proved to symbolize the believers (who were killed) on the Day (of the battle) of Uhud, and the good (which I saw in the dream) was the good and the reward and the truth which Allah bestowed upon us after the Badr battle. (or the Battle of Uhud) and that was the victory bestowed by Allah in the Battle of Khaibar and the conquest of Mecca) .",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7127",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، أراه عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في رؤيا أني هززت سيفا فانقطع صدره، فإذا هو ما أصيب من المؤمنين يوم أحد، ثم هززته أخرى، فعاد أحسن ما كان، فإذا هو ما جاء الله به من الفتح، واجتماع المؤمنين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"I saw in a dream that I waved a sword and it broke in the middle, and behold, that symbolized the casualties the believers suffered on the Day (of the battle) of Uhud. Then I waved the sword again, and it became better than it had ever been before, and behold, that symbolized the Conquest (of Mecca) which Allah brought about and the gathering of the believers. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7158",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"Whoever takes up arms against us, is not from us.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7162",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا مر أحدكم في مسجدنا أو في سوقنا ومعه نبل فليمسك على نصالها  أو قال فليقبض بكفه  أن يصيب أحدا من المسلمين منها شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"If anyone of you passed through our mosque or through our market while carrying arrows, he should hold the iron heads,\" or said, \"..... he should hold (their heads) firmly with his hand lest he should injure one of the Muslims with it.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7237",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال دخلت على النبي صلى الله عليه وسلم أنا ورجلان من قومي فقال أحد الرجلين أمرنا يا رسول الله‏.‏ وقال الآخر مثله‏.‏ فقال ‏\"‏ إنا لا نولي هذا من سأله، ولا من حرص عليه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Two men from my tribe and I entered upon the Prophet. One of the two men said to the Prophet, \"O Allah's Apostle! Appoint me as a governor,\" and so did the second. The Prophet said, \"We do not assign the authority of ruling to those who ask for it, nor to those who are keen to have it.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7369",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما مثلي ومثل ما بعثني الله به كمثل رجل أتى قوما فقال يا قوم إني رأيت الجيش بعينى، وإني أنا النذير العريان فالنجاء‏.‏ فأطاعه طائفة من قومه فأدلجوا، فانطلقوا على مهلهم فنجوا، وكذبت طائفة منهم فأصبحوا مكانهم، فصبحهم الجيش، فأهلكهم واجتاحهم، فذلك مثل من أطاعني، فاتبع ما جئت به، ومثل من عصاني وكذب بما جئت به من الحق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"My example and the example of what I have been sent with is that of a man who came to some people and said, 'O people! I have seen the enemy's army with my own eyes, and I am the naked warner; so protect yourselves!' Then a group of his people obeyed him and fled at night proceeding stealthily till they were safe, while another group of them disbelieved him and stayed at their places till morning when the army came upon them, and killed and ruined them completely So this is the example of that person who obeys me and follows what I have brought (the Qur'an and the Sunna), and the example of the one who disobeys me and disbelieves the truth I have brought.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7377",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، عن بريد بن أبي بردة، عن أبي بردة، عن أبي موسى الأشعري، قال سئل رسول الله صلى الله عليه وسلم عن أشياء كرهها، فلما أكثروا عليه المسألة غضب وقال ‏\"‏ سلوني ‏\"‏‏.‏ فقام رجل فقال يا رسول الله من أبي قال ‏\"‏ أبوك حذافة ‏\"‏‏.‏ ثم قام آخر فقال يا رسول الله من أبي فقال ‏\"‏ أبوك سالم مولى شيبة ‏\"‏‏.‏ فلما رأى عمر ما بوجه رسول الله صلى الله عليه وسلم من الغضب قال إنا نتوب إلى الله عز وجل‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle was asked about things which he disliked, and when the people asked too many questions, he became angry and said, \"Ask me (any question).\" A man got up and said, \"O Allah's Apostle! Who is my father?\" The Prophet replied, \"Your father is Hudhaifa.\" Then another man got up and said, \"O Allah's Apostle! Who is my father?\" The Prophet said, \"Your father is Salim, Maula Shaiba.\" When `Umar saw the signs of anger on the face of Allah's Apostle, he said, \"We repent to Allah.\"",
      "chain": [
        "30224",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7428",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثني أبو كريب، حدثنا أبو أسامة، حدثنا بريد، عن أبي بردة، قال قدمت المدينة فلقيني عبد الله بن سلام فقال لي انطلق إلى المنزل فأسقيك في قدح شرب فيه رسول الله صلى الله عليه وسلم، وتصلي في مسجد صلى فيه النبي صلى الله عليه وسلم‏.‏ فانطلقت معه، فسقاني سويقا، وأطعمني تمرا، وصليت في مسجده‏.‏",
      "text_en": " Narrated Abu Burda:                     When I arrived at Medina, `Abdullah bin Salam met me and said to me, \"Accompany me to my house so that I may make you drink from a bowl from which Allah's Apostle used to drink, and that you may offer prayer in the mosque in which the Prophet used to pray.\" I accompanied him, and he made me drink Sawiq and gave me dates to eat, and then I prayed in his mosque.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901"
      ]
    },
    {
      "hadith_no": "7566",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كان النبي صلى الله عليه وسلم إذا أتاه السائل  وربما قال جاءه السائل  أو صاحب الحاجة قال ‏\"‏ اشفعوا فلتؤجروا، ويقضي الله على لسان رسوله ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Whenever a beggar or a person in need of something came to the Prophet , he used to say (to his companions), \"Intercede (for him) and you will be rewarded for that, and Allah will fulfill what He will through His Apostle's tongue.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، وأبو كريب قالوا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Musa Ash'ari:                      He who took up arms against us is not of us.",
      "chain": [
        "30201",
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو عامر الأشعري، وأبو كريب قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كنت أنا وأصحابي الذين، قدموا معي في السفينة نزولا في بقيع بطحان ورسول الله صلى الله عليه وسلم بالمدينة فكان يتناوب رسول الله صلى الله عليه وسلم عند صلاة العشاء كل ليلة نفر منهم قال أبو موسى فوافقنا رسول الله صلى الله عليه وسلم أنا وأصحابي وله بعض الشغل في أمره حتى أعتم بالصلاة حتى ابهار الليل ثم خرج رسول الله صلى الله عليه وسلم فصلى بهم فلما قضى صلاته قال لمن حضره ‏\"‏ على رسلكم أعلمكم وأبشروا أن من نعمة الله عليكم أنه ليس من الناس أحد يصلي هذه الساعة غيركم ‏\"‏ ‏.‏ أو قال ‏\"‏ ما صلى هذه الساعة أحد غيركم ‏\"‏ ‏.‏ لا ندري أى الكلمتين قال قال أبو موسى فرجعنا فرحين بما سمعنا من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      I and my companions who had sailed along with me in the boat landed with me in the valley of Buthan while the Messenger of Allah (may peace be upon him) was staying in Medina. A party of people amongst them went to the Messenger of Allah (may peace be upon him) every night at the time of the 'Isya' prayer turn by turn. Abu Musa said: (One night) we (I and my companions) went to the Messenger of Allah (may peace be upon him) and he was occupied in some matter till there was a delay in prayer so much so that it was the middle of the night. The Messenger of Allah (may peace be upon him) then came out and led them (Musa's companions) in prayer. And when he had observed his prayer he said to the audience present: Take it easy, I am going to give you information and glad tidings that it is the blessing of Allah upon you for there is none among the people, except you, who prays at this hour (of the night), or he said: None except you observed prayer at this. (late) hour. He (i. e. the narrator) said: I am not sure which of these two sentences he actually uttered. Abu Musa, said: We came back happy for what we heard from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1545",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، وأبو كريب قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أعظم الناس أجرا في الصلاة أبعدهم إليها ممشى فأبعدهم والذي ينتظر الصلاة حتى يصليها مع الإمام أعظم أجرا من الذي يصليها ثم ينام ‏\"‏ ‏.‏ وفي رواية أبي كريب ‏\"‏ حتى يصليها مع الإمام في جماعة ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      The most eminent among human beings (as a recipient of) reward (is one) who lives farthest away, and who has to walk the farthest distance, and he who waits for the prayer to observe it along with the Imam, his reward is greater than one who prays (alone) and then goes to sleep. In the narration of Abu Kuraib (the words are):\" (He waits) till he prays along with the Imam in congregation.\"",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1859",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء، قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل البيت الذي يذكر الله فيه والبيت الذي لا يذكر الله فيه مثل الحى والميت ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Do not make your houses as graveyards. Satan runs away from the house in which Surah Baqara is recited.",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، وأبو كريب قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعاهدوا هذا القرآن فوالذي نفس محمد بيده لهو أشد تفلتا من الإبل في عقلها ‏\"‏ ‏.‏ ولفظ الحديث لابن براد.",
      "text_en": " Abu Huraira reported this directly from the Messenger of Allah (may peace be upon him):                      God has not listened to anything as He listens to a Prophet reciting the Qur'an in a sweet voice.",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو عامر الأشعري عبد الله بن براد، ومحمد بن العلاء، قالا حدثنا أبو أسامة عن بريد، عن أبي بردة، عن أبي موسى، قال خسفت الشمس في زمن النبي صلى الله عليه وسلم فقام فزعا يخشى أن تكون الساعة حتى أتى المسجد فقام يصلي بأطول قيام وركوع وسجود ما رأيته يفعله في صلاة قط ثم قال ‏\"‏ إن هذه الآيات التي يرسل الله لا تكون لموت أحد ولا لحياته ولكن الله يرسلها يخوف بها عباده فإذا رأيتم منها شيئا فافزعوا إلى ذكره ودعائه واستغفاره ‏\"‏ ‏.‏ وفي رواية ابن العلاء كسفت الشمس وقال ‏\"‏ يخوف عباده ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported:                      The sun eclipsed during the time of the Apostle of Allah (may peace be upon him). He stood in great anxiety fearing that it might be the Doomsday, till he came to the mosque. He stood up to pray with prolonged qiyam, ruku', and prostration which I never saw him doing in prayer; and then he said: These are the signs which Allah sends, not on account of the death of anyone or life of any one, but Allah sends them to frighten thereby His servants. So when you see any such thing, hasten to remember Him, supplicate Him and beg pardon from Him, and in the narration transmitted by Ibn 'Ala the words are:\" The sun eclipsed\".\"\" He frightens His servants.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2385",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا عبد الله بن براد الأشعري، وأبو كريب محمد بن العلاء قالا حدثنا أبو أسامة عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليأتين على الناس زمان يطوف الرجل فيه بالصدقة من الذهب ثم لا يجد أحدا يأخذها منه ويرى الرجل الواحد يتبعه أربعون امرأة يلذن به من قلة الرجال وكثرة النساء ‏\"‏ ‏.‏ وفي رواية ابن براد ‏\"‏ وترى الرجل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      There would come a time for the people when a person would roam about with Sadaqa of gold, but he would find no one to accept it from him. And a man would be seen followed by forty women seeking refuge with him on account of the scarcity of males and abundance of females.\"",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو عامر الأشعري وابن نمير وأبو كريب كلهم عن أبي أسامة، - قال أبو عامر حدثنا أبو أسامة، - حدثنا بريد، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الخازن المسلم الأمين الذي ينفذ - وربما قال يعطي - ما أمر به فيعطيه كاملا موفرا طيبة به نفسه فيدفعه إلى الذي أمر له به - أحد المتصدقين ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Apostle (may peace be upon him) as saying:                      The honest Muslim trustee who spends (sometimes he said\" who gives\" ) what he is commanded to do and he gives that in full with his heart overflowing with cheerfulness and he gives it to one to whom he is ordered, he is one of the givers of charity.",
      "chain": [
        "30201",
        "20318",
        "20443",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4353",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، - وتقاربا في اللفظ - قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال أرسلني أصحابي إلى رسول الله صلى الله عليه وسلم أسأله لهم الحملان إذ هم معه في جيش العسرة - وهي غزوة تبوك - فقلت يا نبي الله إن أصحابي أرسلوني إليك لتحملهم ‏.‏ فقال ‏\"‏ والله لا أحملكم على شىء ‏\"‏ ‏.‏ ووافقته وهو غضبان ولا أشعر فرجعت حزينا من منع رسول الله صلى الله عليه وسلم ومن مخافة أن يكون رسول الله صلى الله عليه وسلم قد وجد في نفسه على فرجعت إلى أصحابي فأخبرتهم الذي قال رسول الله صلى الله عليه وسلم فلم ألبث إلا سويعة إذ سمعت بلالا ينادي أى عبد الله بن قيس ‏.‏ فأجبته فقال أجب رسول الله صلى الله عليه وسلم يدعوك ‏.‏ فلما أتيت رسول الله صلى الله عليه وسلم قال ‏\"‏ خذ هذين القرينين وهذين القرينين وهذين القرينين - لستة أبعرة ابتاعهن حينئذ من سعد - فانطلق بهن إلى أصحابك فقل إن الله - أو قال إن رسول الله صلى الله عليه وسلم - يحملكم على هؤلاء فاركبوهن ‏\"‏ ‏.‏ قال أبو موسى فانطلقت إلى أصحابي بهن فقلت إن رسول الله صلى الله عليه وسلم يحملكم على هؤلاء ولكن والله لا أدعكم حتى ينطلق معي بعضكم إلى من سمع مقالة رسول الله صلى الله عليه وسلم حين سألته لكم ومنعه في أول مرة ثم إعطاءه إياى بعد ذلك لا تظنوا أني حدثتكم شيئا لم يقله ‏.‏ فقالوا لي والله إنك عندنا لمصدق ولنفعلن ما أحببت ‏.‏ فانطلق أبو موسى بنفر منهم حتى أتوا الذين سمعوا قول رسول الله صلى الله عليه وسلم ومنعه إياهم ثم إعطاءهم بعد فحدثوهم بما حدثهم به أبو موسى سواء ‏.‏",
      "text_en": " Abu Musa reported:                      My friends sent me to Allah's Messenger (may peace be upon him) asking him to provide them with mounts as they were going along with him in jaish al-'Usrah (the army of destitutes or of meagre means or army setting out during the hard times and that is the occasion of the expedition of Tabuk) I said: Apostle of Allah, my friends have sent me to you so that you may provide them with mounts. He (the Holy Prophet) said: By Allah, I cannot provide you with anything to ride. And it so happened that he was at that time much perturbed. I little knew of it, so I came back with a heavy heart on account of the refusal of Allah's Messenger (may peace be upon him), and the fear that Allah's Messenger (may peace be upon him) might have some feelings against me. I returned to my friends and informed them about what Allah's Messenger (may peace be upon him) had said. I had hardly stayed for a little that I heard Bilal calling: 'Abdullah b. Qais. I responded to his call. He said: Hasten to Allah's Messenger (may peace be upon him), he is calling you, When I came to the Holy Prophet (may peace be upon him) he said: Take this pair, this pair, and this pair (i. e. six camels which he had bought from Sa'd), and take them to y, our friends and say: Verily Allah (or he said: Verily Allah's Messenger (may peace be upon him) has provided you with these animals. So ride upon them. Abu Musa said: I went along with them to my friends and said: Verily Allah's messenger (may peace be upon him) has provided you with these animals for riding; but by Allah, I shall not leave you until some of you go along with me to him who had heard the talk of Allah's Messenger (may peace be upon him) then I asked him for you, and his refusal for the first time, and then his granting them to me subsequently; so you should not think that I narrated to you something which he did not say. They said to me: By Allah, in our opinion you are certainly truthful, and we would do as you like. So Abu Musa went along withsome of the menfrom them until they came to those who had heard the words of Allah's Messenger (may, peace be upon him) and his refusal to (provide) them with (animals) ; and subsequently his granting (the animals) to them; and they narrated to them exactly as Abu Masa had narrated to them.",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4622",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا أبو أسامة عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال كان رسول الله صلى الله عليه وسلم إذا بعث أحدا من أصحابه في بعض أمره قال ‏\"‏ بشروا ولا تنفروا ويسروا ولا تعسروا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Masa that when the Messenger of Allah (may peace be upon him) deputed any of his Companions on a mission, he would say:                      Give tidings (to the people) ; do not create (in their minds) aversion (towards religion) ; show them leniency and do not be hard upon them.",
      "chain": [
        "30201",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4802",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو عامر عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، - واللفظ لأبي عامر - قالا حدثنا أبو أسامة، عن بريد بن أبي بردة، عن أبي بردة، عن أبي موسى، قال خرجنا مع رسول الله صلى الله عليه وسلم في غزاة ونحن ستة نفر بيننا بعير نعتقبه - قال - فنقبت أقدامنا فنقبت قدماى وسقطت أظفاري فكنا نلف على أرجلنا الخرق فسميت غزوة ذات الرقاع لما كنا نعصب على أرجلنا من الخرق ‏.‏ قال أبو بردة فحدث أبو موسى بهذا الحديث ثم كره ذلك ‏.‏ قال كأنه كره أن يكون شيئا من عمله أفشاه ‏.‏ قال أبو أسامة وزادني غير بريد والله يجزي به ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Musa (Ash'ari) who said:                      We set out on an expedition with the Messenger of Allah (may peace be upon him). We were six in number and had (with us) only one camel which we rode turn by turn Our feet were injured. My feet were so badly injured that my nails dropped off. We covered our feet with rags. so this expedition was called Dhat-ur-Riqa' (i. e. the expedition of rags) because we bandaged our feet with rags (on that day). Abu Burda said: Abu Musa narrated this tradition, and then disliked repeating it as he did not want to give any publicity to what he did in a noble cause Abu Usama said: Narrators other than Abu Buraida have added to the version of the words:\" God will reward it.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4821",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، قالا حدثنا أبو أسامة، عن بريد، بن عبد الله عن أبي بردة، عن أبي موسى، قال دخلت على النبي صلى الله عليه وسلم أنا ورجلان من بني عمي فقال أحد الرجلين يا رسول الله أمرنا على بعض ما ولاك الله عز وجل ‏.‏ وقال الآخر مثل ذلك فقال ‏\"‏ إنا والله لا نولي على هذا العمل أحدا سأله ولا أحدا حرص عليه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Abu Musa who said:                      Two of my cousins and I entered the apartment of the Holy Prophet (may peace be upon him). One of them said: Messenger of Allah, appoint us rulers of some lands that the Almighty and Glorious God has entrusted to thy care. The other also said something similar. He said: We do not appoint to this position one who asks for it nor anyone who is covetous for the same.",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأبو بكر بن أبي شيبة ومحمد بن عبد الله بن نمير وأبو عامر الأشعري وأبو كريب - واللفظ لأبي عامر - قالوا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال احترق بيت على أهله بالمدينة من الليل فلما حدث رسول الله صلى الله عليه وسلم بشأنهم قال ‏\"‏ إن هذه النار إنما هي عدو لكم فإذا نمتم فأطفئوها عنكم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that a house was burnt down in Medina during the night over its inhabitants. When their matter was reported to Allah's Messenger (may peace be upon him), he said; This fire is an enemy of yours. So when you go to sleep, extinguish it.",
      "chain": [
        "30465",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا بريد، عن جده، عن  أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن يأكل في معى واحد والكافر يأكل في سبعة أمعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      A believer eats in one intestine, whereas a non-believer eats in seven intestines.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "5739",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن براد الأشعري، وأبو كريب قالوا حدثنا  أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال ولد لي غلام فأتيت به النبي صلى الله عليه وسلم فسماه إبراهيم وحنكه بتمرة ‏.‏",
      "text_en": " Abu Musa reported:                      A child was born in my house and I brought him to Allah's Apostle (may peace be upod him) and he gave him the name of Ibrahim and he rubbed his palate with dates.",
      "chain": [
        "30201",
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6072",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو عامر عبد الله بن براد الأشعري، وأبو كريب محمد بن العلاء - وتقاربا في اللفظ - قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، جده عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في المنام أني أهاجر من مكة إلى أرض بها نخل فذهب وهلي إلى أنها اليمامة أو هجر فإذا هي المدينة يثرب ورأيت في رؤياى هذه أني هززت سيفا فانقطع صدره فإذا هو ما أصيب من المؤمنين يوم أحد ثم هززته أخرى فعاد أحسن ما كان فإذا هو ما جاء الله به من الفتح واجتماع المؤمنين ورأيت فيها أيضا بقرا والله خير فإذا هم النفر من المؤمنين يوم أحد وإذا الخير ما جاء الله به من الخير بعد وثواب الصدق الذي آتانا الله بعد يوم بدر ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      I saw in sleep that I was about to migrate from Mecca to a land abounding in palmtrees and I guessed that it would be Yamama or Hajar, but it was the city of Yathrib (the old name of Medina), and I saw in this dream of mine that I was brandishing a sword and its upper end was broken and this is what fell (in the form of misfortune to the believers on the Day of Ubud). I brandished (the sword) for the second time and it became all right and this is what came to be true when Allah granted us victory and solidarity of the believers. And I saw therein cows also and Allah is the Doer of good. These meant the group from amongst the believers on the Day of Ubud and the goodness which Allah brought after that and the reward of attestation of his Truth which Allah brought to us after the Day of Badr.",
      "chain": [
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6093",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو عامر الأشعري ومحمد بن العلاء - واللفظ لأبي عامر - قالوا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن مثل ما بعثني الله به عز وجل من الهدى والعلم كمثل غيث أصاب أرضا فكانت منها طائفة طيبة قبلت الماء فأنبتت الكلأ والعشب الكثير وكان منها أجادب أمسكت الماء فنفع الله بها الناس فشربوا منها وسقوا ورعوا وأصاب طائفة منها أخرى إنما هي قيعان لا تمسك ماء ولا تنبت كلأ فذلك مثل من فقه في دين الله ونفعه بما بعثني الله به فعلم وعلم ومثل من لم يرفع بذلك رأسا ولم يقبل هدى الله الذي أرسلت به ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Apostle (may peace be upon him) as saying:                      The similitude of that guidance and knowledge with which Allah, the Exalted and Glorious, has sent me is that of rain falling upon the earth. There is a good piece of land which receives the rainfall (eagerly) and as a result of it there is grown in it herbage and grass abundantly. Then there is a land hard and barren which retains water and the people derive benefit from it and they drink it and make the animals drink. Then there is another land which is barren. Neither water is retained in it, nor is the grass grown in it. And that is the similitude of the first one who develops the understanding of the religion of Allah and it becomes a source of benefit to him with which Allah sent me. (The second one is that) who acquires the knowledge of religion and imparts it to others. (Then the other type is) one who does not pay attention to (the revealed knowledge) and thus does not accept guidance of Allah with which I have been sent.",
      "chain": [
        "30201",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6094",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا  أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن مثلي ومثل ما بعثني الله به كمثل رجل أتى قومه فقال يا قوم إني رأيت الجيش بعينى وإني أنا النذير العريان فالنجاء ‏.‏ فأطاعه طائفة من قومه فأدلجوا فانطلقوا على مهلتهم وكذبت طائفة منهم فأصبحوا مكانهم فصبحهم الجيش فأهلكهم واجتاحهم فذلك مثل من أطاعني واتبع ما جئت به ومثل من عصاني وكذب ما جئت به من الحق ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of mine and of that with which Allah sent me is that of a person who came to us and said: O people, I have seen an army with my eyes and I am a plain warner (and issue you warning) that you should immediately manage to find an escape. A group of people from amongst them paying heed (to his warning) fled to a place of protection and a group amongst them belied him and the morning overtook them in their houses and the army attacked them and killed them and they were routed. And that is the similitude of the one who obeyed me, followed with which I had been sent and the similitude of the other is of one who disobeyed and belied me and the Truth with which I have been sent.",
      "chain": [
        "30549",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6105",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "قال مسلم وحدثت عن أبي أسامة، وممن، روى ذلك، عنه إبراهيم بن سعيد الجوهري حدثنا أبو أسامة، حدثني بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل إذا أراد رحمة أمة من عباده قبض نبيها قبلها فجعله لها فرطا وسلفا بين يديها وإذا أراد هلكة أمة عذبها ونبيها حى فأهلكها وهو ينظر فأقر عينه بهلكتها حين كذبوه وعصوا أمره ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      When Allah, the Exalted and Glorious, intends to show mercy to an Umma from amongst His servants He calls back His Apostle to his eternal home and makes him a harbinger and recompense in the world to come; and when He intends to cause destruction to an Umma, He punishes it while its Apostle is alive and He destroys it as he (the Apostle) witnesses it and he cools his eyes by destruction as they had belied him and disobeyed his command.",
      "chain": [
        "20318",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6274",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة عن بريد، عن أبي بردة، عن أبي موسى، قال سئل النبي صلى الله عليه وسلم عن أشياء كرهها فلما أكثر عليه غضب ثم قال للناس ‏\"‏ سلوني عم شئتم ‏\"‏ ‏.‏ فقال رجل من أبي قال ‏\"‏ أبوك حذافة ‏\"‏ ‏.‏ فقام آخر فقال من أبي يا رسول الله قال ‏\"‏ أبوك سالم مولى شيبة ‏\"‏ ‏.‏ فلما رأى عمر ما في وجه رسول الله صلى الله عليه وسلم من الغضب قال يا رسول الله إنا نتوب إلى الله ‏.‏ وفي رواية أبي كريب قال من أبي يا رسول الله قال ‏\"‏ أبوك سالم مولى شيبة ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that Allah's Apostle (may peace be upon him) was asked such things which he disapproved and when they persisted on asking him he felt enraged and then said to the people:                      Ask me what you wish to ask. Thereupon a person said: Who is my father? He said: Your father is Hudhafa. Then another person stood up and said: Allah's Messenger, who is my father? He said: Your father is Salim, the freed slave of Shaiba. When 'Umar saw the signs of anger upon the face of Allah's Apostle (may peace be upon him), he said: Allah's Messenger, we ask repentance from Allah. And in the hadith transmitted on the authority of Abu Kuraib (the words are):\" Allah's Messenger, who is my father? He said: Your father is Salim, the freed slave of Shaiba.\"",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6561",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو عامر الأشعري، وأبو كريب جميعا عن أبي أسامة، قال أبو عامر حدثنا أبو أسامة، حدثنا بريد، عن جده أبي بردة، عن أبي موسى، قال كنت عند النبي صلى الله عليه وسلم وهو نازل بالجعرانة بين مكة والمدينة ومعه بلال فأتى رسول الله صلى الله عليه وسلم رجل أعرابي فقال ألا تنجز لي يا محمد ما وعدتني فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أبشر ‏\"‏ ‏.‏ فقال له الأعرابي أكثرت على من ‏\"‏ أبشر ‏\"‏ ‏.‏ فأقبل رسول الله صلى الله عليه وسلم على أبي موسى وبلال كهيئة الغضبان فقال ‏\"‏ إن هذا قد رد البشرى فاقبلا أنتما ‏\"‏ ‏.‏ فقالا قبلنا يا رسول الله ‏.‏ ثم دعا رسول الله صلى الله عليه وسلم بقدح فيه ماء فغسل يديه ووجهه فيه ومج فيه ثم قال ‏\"‏ اشربا منه وأفرغا على وجوهكما ونحوركما وأبشرا ‏\"‏ ‏.‏ فأخذا القدح ففعلا ما أمرهما به رسول الله صلى الله عليه وسلم فنادتهما أم سلمة من وراء الستر أفضلا لأمكما مما في إنائكما ‏.‏ فأفضلا لها منه طائفة ‏.‏",
      "text_en": " Abu Musa reported:                      I was in the company of Allah's Apostle (may peace be upon him) as he had been sitting in Ji'rana (a place) between Mecca and Medina and Bilal was also there, that there came to Allah's Apostle (may peace be upon him) a desert Arab, and he said: Muhammad, fulfill your promise that you made with me. Allah's Messenger (may peace be upon him) said to him: Accept glad tidings. Thereupon the desert Arab said: You shower glad tidings upon me very much; then Allah's Messenger (may peace be upon him) turned towards Abu Musa and Bilal seemingly in a state of annoyance and said: Verily he has rejected glad tidings but you two should accept them. We said: Allah's Messenger, we have readily accepted them. Then Allah's Messenger (may peace be upon him) called for a cup of water and washed his hands in that and face too and put the saliva in it and then said: Drink out of it and pour it over your faces and over your chest and gladden yourselves. They took hold of the cup and did as Allah's Messenger (may peace be upon him) had commanded them to do. Thereupon Umm Salama called from behind the veil: Spare some water in your vessel for your mother also, and they also gave some water which had been spared for her.",
      "chain": [
        "20318",
        "20443",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6562",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن براد أبو عامر الأشعري، وأبو كريب محمد بن العلاء - واللفظ لأبي عامر - قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبيه، قال لما فرغ النبي صلى الله عليه وسلم من حنين بعث أبا عامر على جيش إلى أوطاس فلقي دريد بن الصمة فقتل دريد وهزم الله أصحابه فقال أبو موسى وبعثني مع أبي عامر - قال - فرمي أبو عامر في ركبته رماه رجل من بني جشم بسهم فأثبته في ركبته فانتهيت إليه فقلت يا عم من رماك فأشار أبو عامر إلى أبي موسى فقال إن ذاك قاتلي تراه ذلك الذي رماني ‏.‏ قال أبو موسى فقصدت له فاعتمدته فلحقته فلما رآني ولى عني ذاهبا فاتبعته وجعلت أقول له ألا تستحيي ألست عربيا ألا تثبت فكف فالتقيت أنا وهو فاختلفنا أنا وهو ضربتين فضربته بالسيف فقتلته ثم رجعت إلى أبي عامر فقلت إن الله قد قتل صاحبك ‏.‏ قال فانزع هذا السهم فنزعته فنزا منه الماء فقال يا ابن أخي انطلق إلى رسول الله صلى الله عليه وسلم فأقرئه مني السلام وقل له يقول لك أبو عامر استغفر لي ‏.‏ قال واستعملني أبو عامر على الناس ومكث يسيرا ثم إنه مات فلما رجعت إلى النبي صلى الله عليه وسلم دخلت عليه وهو في بيت على سرير مرمل وعليه فراش وقد أثر رمال السرير بظهر رسول الله صلى الله عليه وسلم وجنبيه فأخبرته بخبرنا وخبر أبي عامر وقلت له قال قل له يستغفر لي ‏.‏ فدعا رسول الله صلى الله عليه وسلم بماء فتوضأ منه ثم رفع يديه ثم قال ‏\"‏ اللهم اغفر لعبيد أبي عامر ‏\"‏ ‏.‏ حتى رأيت بياض إبطيه ثم قال ‏\"‏ اللهم اجعله يوم القيامة فوق كثير من خلقك أو من الناس ‏\"‏ ‏.‏ فقلت ولي يا رسول الله فاستغفر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم اغفر لعبد الله بن قيس ذنبه وأدخله يوم القيامة مدخلا كريما ‏\"‏ ‏.‏ قال أبو بردة إحداهما لأبي عامر والأخرى لأبي موسى ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father that when Allah's Apostle (may peace be upon him) had been free from the Battle of Hunain, he sent Abu 'Amir as the head of the army of Autas. He had an encounter with Duraid b. as_Simma. Duraid was killed and Allah gave defeat to his friends. Abu Musa said:                      He (the Holy Prophet) sent me along with Abu 'Amir and Abu 'Amir received a wound in his knee from the arrow, (shot by) a person of Bani Jusham. It stuck in his knee. I went to him and said: Uncle, who shot an arrow upon you? Abu 'Amir pointed out to Abu Musa and said: Verily that one who shot an arrow upon me in fact killed me. Abu Musa said: I followed him with the determination to kill him and overtook him and when he saw me he turned upon his heels. I followed him and I said to him: Don't you feel ashamed (that you run), aren't you an Arab? Why don't you stop? He stopped and I had an encounter with him and we exchanged the strokes of (swords). I struck him with the sword and killed him. Then I came back to Abu Amir and said: Verily Allah has killed the one who killed you. And he said: Now draw out this arrow. I drew out the arrow and there came out from that (wound) water. Abu 'Amir said: My nephew, go to Allah's Messenger (may peace be upon him) and convey my greetings to him and tell him that Abu Amir begs you to ask forgiveness for him. And Abu Amir appointed me as the chief of the people and he died after a short time. When I came to Allah's Apostle (may peace be upon him) I visited him and he had been lying on the cot woven by strings and there was (no) bed over it and so there had been marks of the strings on the back of Allah's Messenger (may peace be upon him) and on his sides. I narrated to him what had happened to us and narrated to him about Abu Amir and said to him that he had made a request to the effect that forgiveness should be sought for him (from Allah). Thereupon Allah's Messenger (may peace be. upon him) called for water and performed ablution with it. He then lifted his hands and said. O Allah, grant pardon to Thy servant Abu Amir. (The Holy Prophet had raised his hands so high for supplication) that I saw the whiteness of his armpits. He again said: O Allah, grant him distinction amongst the majority of Thine created beings or from amongst the people. I said: Allah's Messenger, ask forgiveness for me too. Thereupon Allah's Apostle (may peace be upon him) said: Allah, forgive the sins of Abdullah b. Qais (Abu Musa Ash'ari) and admit him to an elevated place on the Day of Resurrection. Abu Burda said: One prayer is for abu 'Amir and the other is tor Abu Musa.",
      "chain": [
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6563",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا بريد، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف أصوات رفقة الأشعريين بالقرآن حين يدخلون بالليل وأعرف منازلهم من أصواتهم بالقرآن بالليل وإن كنت لم أر منازلهم حين نزلوا بالنهار ومنهم حكيم إذا لقي الخيل - أو قال العدو - قال لهم إن أصحابي يأمرونكم أن تنظروهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that Allah's Messenger (may peace be upon him) said:                      I recognise the voice of the Ash'arites while they recite the Qur'an as they arrive during the night and I also recognise their station from the recital of the Qur'an during the night time, although I have not seen their encampments as they encamp during the day time. And there is a person amongst them, Hakim; when he encounters the horsemen or the enemies he says to them: My friends command you to wait for them.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6564",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو عامر الأشعري، وأبو كريب جميعا عن أبي أسامة، قال أبو عامر حدثنا أبو أسامة، حدثني بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الأشعريين إذا أرملوا في الغزو أو قل طعام عيالهم بالمدينة جمعوا ما كان عندهم في ثوب واحد ثم اقتسموه بينهم في إناء واحد بالسوية فهم مني وأنا منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that Allah's Messenger (may peace be upon him) said:                      When the Ash'arites run short of provisions in the campaigns or run short of food for their children in Medina they collect whatever is with them in the cloth and then partake equally from one vessel. They are from me and I am from them.",
      "chain": [
        "20318",
        "20443",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6566",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة حدثني بريد، عن أبي بردة، عن أبي موسى، قال بلغنا مخرج رسول الله صلى الله عليه وسلم ونحن باليمن فخرجنا مهاجرين إليه أنا وأخوان لي أنا أصغرهما أحدهما أبو بردة والآخر أبو رهم - إما قال بضعا وإما قال ثلاثة وخمسين أو اثنين وخمسين رجلا من قومي - قال فركبنا سفينة فألقتنا سفينتنا إلى النجاشي بالحبشة فوافقنا جعفر بن أبي طالب وأصحابه عنده فقال جعفر إن رسول الله صلى الله عليه وسلم بعثنا ها هنا وأمرنا بالإقامة فأقيموا معنا ‏.‏ فأقمنا معه حتى قدمنا جميعا - قال - فوافقنا رسول الله صلى الله عليه وسلم حين افتتح خيبر فأسهم لنا - أو قال أعطانا منها - وما قسم لأحد غاب عن فتح خيبر منها شيئا إلا لمن شهد معه إلا لأصحاب سفينتنا مع جعفر وأصحابه قسم لهم معهم - قال - فكان ناس من الناس يقولون لنا - يعني لأهل السفينة - نحن سبقناكم بالهجرة ‏.‏",
      "text_en": " Abu Musa reported:                      We were in Yemen when we heard of the migration of Allah's Messenger (may peace be upon him). We also set out as immigrants to him. And I was accompanied by two brothers of mine, I being the youngest of them; one of them was Abu Burda and the other one was Abu Ruhm, and there were some other persons with them. Some say they were fifty-three or fifty-two persons of my tribe. We embarked upon a boat, and the boat sailed away to the Negus of Abyssinia. There we met Ja'far b. Abu Talib and his companions. Ja'far said: Allall's Messenger (may peace be upon him) has sent us here and has commanded us to stay here and you should also stay with us. So we stayed with him and we came back (to Medina) and met Allah's Messenger (may peace be upon him) when Khaibar had been conquered. He (the Holy Prophet) allocated a share to us and in the ordinary course he did not allocate the share to one who had been absent on the occasion of the conquest of Khaibar but conferred (a share) upon him only who had been present there with him. He, however, made an exception for the people of the boat, viz. for Ja'far and his companions. He allocated a share to them, and some persons from amongst the people said to us, viz. the people of the boat: We have preceded you in migration. Asma' bint 'Umais who had migrated to Abyssinia and had come back along with them (along with immigrants) visited Hafsa, the wife of Allah's Apostle (may peace be upon him). (Accordingly), Umar had been sitting with her (Hafsa). As 'Umar saw Asma, he said: Who is she? She (Hafsa) said: She is Asma, daughter of 'Umais. He said: She is an Abyssinian and a sea-woman. Asma said: Yes, it is so. Thereupon 'Umar said: We preceded you in migration and so we have more right to Allah's Messenger (may peace be upon him) as compared with you. At this she felt annoyed and said: 'Umar, you are not stating the fact; by Allah, you had the privilege of being in the company of the Messenger (may peace be upon him) who fed the hungry among you and instructed the ignorant amongst you, whereas we had been far (from here) in the land of Abyssinia amongst the enemies and that was all for Allah and Allah's Messenger (may peace be upon him) and, by Allah, I would never take food nor take water unless I make a mention to Allah's Messenger (may peace be upon him) of what you have said. We remained in that country in constant trouble and dread and I shall talk about it to Allah's Messenger (way peace be upon him) and ask him (about it). By Allah, I shall not tell a lie and deviate (from the truth) and add anything to that. So, when Allah's Apostle (may peace be upon him) came, she said: Allah's Apostle, 'Umar says so and so. Upon this Allah's Messenger (may peace be upon him) said: His right is not more than yours, for him and his companions there is one migration, but for you, i. e. for the people of the boat, there are two migrations. She said: I saw Abu Musa and the people of the boat coming to me in groups and asking me about this hadith, because there was nothing more pleasing and more significant for them than this. Abu Burda reported that Asma said: I saw Abu Musa, asking me to repeat this hadith to him again and again.",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6746",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، حدثنا بريد بن أبي بردة، عن أبيه، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل يملي للظالم فإذا أخذه لم يفلته ‏\"‏ ‏.‏ ثم قرأ ‏{‏ وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد‏}‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and Glorious, grants respite to the oppessor. But when He lays Hand upon him, He does not then let him off. Re (the Holy Prophet) then recited this verse:\" Such is the chastisement of thy Lord when He chastises the towns (inhabited by) wrongdoing persons. Surely, His punishment is painful, severe\" (xi. 103).",
      "chain": [
        "30212",
        "20354",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "6750",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو عامر الأشعري قالا حدثنا عبد الله بن إدريس، وأبو أسامة ح وحدثنا محمد بن العلاء أبو كريب، حدثنا ابن المبارك، وابن، إدريس وأبو أسامة كلهم عن بريد، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      A believer is like a brick for another believer, the one supporting the other.",
      "chain": [
        "30201",
        "30216",
        "20025",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6831",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء، - واللفظ لعبد الله - قالا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا مر أحدكم في مسجدنا أو في سوقنا ومعه نبل فليمسك على نصالها بكفه أن يصيب أحدا من المسلمين منها بشىء ‏\"‏ ‏.‏ أو قال ‏\"‏ ليقبض على نصالها ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Apostle (may peace be upon him) assaying:                      He who amongst you moves in the mosque or in the bazar and there is an arrow with him he should take hold of its iron-head in his palm, so that none amongst the Muslims should receive any injury from it, or he said, should catch its iron-head.",
      "chain": [
        "30549",
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وحفص بن غياث، عن بريد، بن عبد الله عن أبي بردة، عن أبي موسى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه طالب حاجة أقبل على جلسائه فقال ‏\"‏ اشفعوا فلتؤجروا وليقض الله على لسان نبيه ما أحب ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that when any needy (person) came to Allah's Messenger (may peace be upon him) with a need he commanded him to his Companions, saying:                      Make a recommendation for him, and you would get the reward. Allah, however, gives the verdict through the tongue of His Apostle what He likes most.",
      "chain": [
        "30201",
        "20345",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6859",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن بريد بن عبد الله، عن  جده، عن أبي موسى، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30201",
        "20005",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "6860",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثنا محمد بن العلاء الهمداني، - واللفظ له - حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما مثل الجليس الصالح والجليس السوء كحامل المسك ونافخ الكير فحامل المسك إما أن يحذيك وإما أن تبتاع منه وإما أن تجد منه ريحا طيبة ونافخ الكير إما أن يحرق ثيابك وإما أن تجد ريحا خبيثة ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of good company and that of bad company is that of the owner of musk and of the one (iron-smith) blowing bellows, and the owner of musk would either offer you free of charge or you would buy it from him or you would. smell its pleasant odour, and so far as one who blows the. bellows is concerned, he would either burn your clothes or you shall have to smell its repugnant smell.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7004",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو عامر الأشعري وأبو كريب قالوا حدثنا أبو أسامة عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Apostle (may peace be upon him) as saying:                      He who loves to meet Allah, Allah too loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him.",
      "chain": [
        "30201",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7696",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني أبو جعفر، محمد بن الصباح حدثنا إسماعيل بن زكرياء، عن بريد بن، عبد الله بن أبي بردة عن أبي بردة، عن أبي موسى، قال سمع النبي صلى الله عليه وسلم رجلا يثني على رجل ويطريه في المدحة فقال ‏\"‏ لقد أهلكتم أو قطعتم ظهر الرجل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) saw a person lauding another person or praising him too much. Thereupon he said:                      You killed him, or you sliced the back of a person.",
      "chain": [
        "20313",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1684",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد بن العلاء، - المعنى - قالا حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الخازن الأمين - الذي يعطي ما أمر به كاملا موفرا طيبة به نفسه حتى يدفعه إلى الذي أمر له به - أحد المتصدقين ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported The Messenger of Allah (ﷺ) as saying The faithful trustee who gives what he is commanded completely and in full with a good will, and delivers it to the one whom he was told to give it, is one of the two who gives sadaqah.",
      "chain": [
        "30203",
        "30216",
        "20318",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "2587",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا مر أحدكم في مسجدنا أو في سوقنا ومعه نبل فليمسك على نصالها ‏\"‏ ‏.‏ أو قال ‏\"‏ فليقبض كفه ‏\"‏ ‏.‏ أو قال ‏\"‏ فليقبض بكفه أن يصيب أحدا من المسلمين ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported the Apostle of Allaah(ﷺ) as saying “ When one of you passes our Masjid or our market with an arrow, he should hold its head or hold it with its hand (the narrator is doubtful) so that no harm may be done to any Muslim.”",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2725",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، حدثنا بريد، عن أبي بردة، عن أبي موسى، قال قدمنا فوافقنا رسول الله صلى الله عليه وسلم حين افتتح خيبر فأسهم لنا أو قال فأعطانا منها وما قسم لأحد غاب عن فتح خيبر منها شيئا إلا لمن شهد معه إلا أصحاب سفينتنا جعفر وأصحابه فأسهم لهم معهم ‏.‏",
      "text_en": " Abu Nusa said “We arrived just at the moment when the Apostle of Allaah(ﷺ) conquered Khaibar and he allotted us a portion (or he said he gave us some of it). He allotted nothing to anyone who was not present at the conquest of Khaybar, giving shares only to those who were present with him except for those who were in our ship, Ja’far and his companions to whom he gave (a portion) something along with them.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4355",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن علي، حدثنا الحماني، - يعني عبد الحميد بن عبد الرحمن - عن طلحة بن يحيى، وبريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال قدم على معاذ وأنا باليمن، ورجل، كان يهوديا فأسلم فارتد عن الإسلام، فلما قدم معاذ قال لا أنزل عن دابتي حتى يقتل ‏.‏ فقتل ‏.‏ قال أحدهما وكان قد استتيب قبل ذلك ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     AbuMusa said: Mu'adh came to me when I was in the Yemen. A man who was Jew embraced Islam and then retreated from Islam. When Mu'adh came, he said: I will not come down from my mount until he is killed. He was then killed. One of them said: He was asked to repent before that.",
      "chain": [
        "30115",
        "11863",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4835",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن جده أبي بردة، عن أبي موسى، قال كان رسول الله صلى الله عليه وسلم إذا بعث أحدا من أصحابه في بعض أمره قال ‏\"‏ بشروا ولا تنفروا ويسروا ولا تعسروا ‏\"‏ ‏.‏",
      "text_en": " ABU MUSA REPORTED THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) AS SAYING:                      GLADDEN PEOPLE AND DO NOT SCARE THEM; MAKE THINGS EASY AND DO NOT MAKE THEM DIFFICULT.",
      "chain": [
        "30203",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5131",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن بريد بن أبي بردة، عن أبيه، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اشفعوا إلى لتؤجروا وليقض الله على لسان نبيه ما شاء ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported the Messenger of Allah (May peace be upon him) as saying:                      Make intercession to me, you will be rewarded, for Allah decrees what he wishes by the tongue of his prophet.",
      "chain": [
        "30175",
        "20012",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "5133",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو معمر، حدثنا سفيان، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Abu Musa from the prophet (May peace be upon him) through a different chain of narrators.",
      "chain": [
        "30315",
        "20005",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1459",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو كريب، وأبو السائب، سلم بن جنادة قالا حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وابن الزبير وأبي هريرة وسلمة بن الأكوع ‏.‏ قال أبو عيسى حديث أبي موسى حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Musa:                     That the Prophet (ﷺ) said: \"Whoever carries weapons against us, he is not from us.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، حدثنا بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، قال قدمت على رسول الله صلى الله عليه وسلم في نفر من الأشعريين خيبر فأسهم لنا مع الذين افتتحوها ‏.‏ هذا حديث حسن غريب ‏.‏ والعمل على هذا عند بعض أهل العلم قال الأوزاعي من لحق بالمسلمين قبل أن يسهم للخيل أسهم له ‏.‏ وبريد يكنى أبا بريدة وهو ثقة وروى عنه سفيان الثوري وابن عيينة وغيرهما ‏.‏",
      "text_en": " Narrated Abu Musa:                     \"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.",
      "chain": [
        "30200",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "قال حكاه إبراهيم بن بشار الرمادي عن سفيان بن عيينة، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم ‏.‏ أخبرني بذلك، محمد عن إبراهيم بن بشار، ‏.‏ قال وروى غير، واحد، عن سفيان، عن بريد، عن أبي بردة، عن النبي صلى الله عليه وسلم مرسلا وهذا أصح ‏.‏ قال محمد وروى إسحاق بن إبراهيم عن معاذ بن هشام عن أبيه عن قتادة عن أنس عن النبي صلى الله عليه وسلم ‏\"‏ إن الله سائل كل راع عما استرعاه ‏\"‏ ‏.‏ قال سمعت محمدا يقول هذا غير محفوظ وإنما الصحيح عن معاذ بن هشام عن أبيه عن قتادة عن الحسن عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Ibrahim bin Bash-shar Ar-Ramadi reported it from Sufyan bin 'Uyainah, from Buraid bin 'Abdullah bin Abu Burdah, from Abu Burdah, from Abu Musa, from the Prophet (ﷺ).Muhammad informed me of that, from Ibrahim bin Bash-Shar [Ar-Ramadi]. Muhammad said:                      \"More than one has reported it from Sufyan, from Buraid bin Abu Burdah [from Abu Burdah] from the Prophet (ﷺ) in Mursal form. This is more correct.\" Muhammad said: \"Ishaq bin Ibrahim reported from Mu'adh bin Hisham, from his father, from Qatadah, from Anas, from the Prophet (ﷺ) who said: 'Indeed Allah will question everyone who is responsible about his charge.'\" I heard Muhammad saying: \"This is not preserved. It is only correct from Mu'adh bin Hisham from his father, from Qatadah, from Al-Hasan, from the Prophet (ﷺ), in Mursal form.\"",
      "chain": [
        "20005",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2053",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا الحسن بن علي الخلال، وغير، واحد، قالوا حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Musa Al-Ash'arf narrated that the Messenger of Allah said:                     :The believer is to the believer like parts of a building, each one of them supporting the other.\"",
      "chain": [
        "30115",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2692",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال سئل رسول الله صلى الله عليه وسلم أى المسلمين أفضل قال ‏\"‏ من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏ هذا حديث صحيح غريب من هذا الوجه من حديث أبي موسى ‏.‏",
      "text_en": " Abu Musa said:                     \"The Messenger of Allah (s.a.w) was asked: 'Which of the Muslims is the most virtuous?' He said: 'The one whom the Muslims are safe from his tongue and his hand.'\"",
      "chain": [
        "30498",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا بذلك إبراهيم بن سعيد الجوهري حدثنا أبو أسامة عن بريد بن عبد الله بن أبي بردة عن جده أبي بردة عن أبي موسى الأشعري أن النبي صلى الله عليه وسلم سئل أى المسلمين أفضل قال ‏\"‏ من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من حديث أبي موسى الأشعري عن النبي صلى الله عليه وسلم.",
      "text_en": " Narrated Abu Musa Al-Ash'ari:                     that the Prophet (ﷺ) was asked: \"Which of the Muslims is most virtuous?\" He said: \"The one from (the harm of) whose tongue and hand (other) Muslims are safe.\"",
      "chain": [
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن غيلان، والحسن بن علي، وغير، واحد، قالوا حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى الأشعري، عن النبي صلى الله عليه وسلم قال ‏\"‏ اشفعوا ولتؤجروا وليقض الله على لسان نبيه ما شاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وبريد يكنى أبا بردة أيضا وهو كوفي ثقة في الحديث روى عنه شعبة والثوري وابن عيينة ‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash'ari:                     that the Prophet (ﷺ) said: \"Intercede, and you will be rewarded, and Allah will fulfill what He wills upon the tongue of His Prophet.\"",
      "chain": [
        "30277",
        "30",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله تبارك وتعالى يملي وربما قال يمهل للظالم حتى إذا أخذه لم يفلته ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏ كذلك أخذ ربك إذا أخذ القرى ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب وقد رواه أبو أسامة عن بريد نحوه وقال يملي ‏.‏",
      "text_en": " Narrated Abu Musa:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah Blessed and Most High gives respite (Yumli)\" and perhaps he said: \"(Yumhil)\" respite to the wrong-doer until, when He seizes him, and he cannot escape.\" Then he recited the Ayah: Such is the punishment of your Lord when He seizes the towns while they are doing wrong (11:102).",
      "chain": [
        "30216",
        "20354",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3396",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، عن أبي أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم نحوه وقال يملي ولم يشك فيه ‏.‏",
      "text_en": "",
      "chain": [
        "30498",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا أبو يحيى الحماني، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ يا أبا موسى لقد أعطيت مزمارا من مزامير آل داود ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏ قال وفي الباب عن بريدة وأبي هريرة وأنس ‏.‏",
      "text_en": " Narrated Abu Musa:                     that the Prophet (ﷺ) said: \"O Abu Musa! You have been given a Mizmar among the Mazamir of the family of Dawud.\"",
      "chain": [
        "20332",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4257",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا زياد بن الربيع، حدثنا خالد بن سلمة المخزومي، عن ابن أبي بردة، عن أبي موسى، قال ما أشكل علينا أصحاب رسول الله صلى الله عليه وسلم حديث قط فسألنا عائشة إلا وجدنا عندها منه علما ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abu Musa:                     \"Never was a Hadith unclear to us - the Companions of the Messenger of Allah - and we asked 'Aishah, except that we found some knowledge concerning it with her.\"",
      "chain": [
        "30430",
        "20230",
        "10680",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "1503",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، عن أبي أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال خسفت الشمس فقام النبي صلى الله عليه وسلم فزعا يخشى أن تكون الساعة فقام حتى أتى المسجد فقام يصلي بأطول قيام وركوع وسجود ما رأيته يفعله في صلاته قط ثم قال ‏\"‏ إن هذه الآيات التي يرسل الله لا تكون لموت أحد ولا لحياته ولكن الله يرسلها يخوف بها عباده فإذا رأيتم منها شيئا فافزعوا إلى ذكره ودعائه واستغفاره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"There was an eclipse of the sun, and the Messenger of Allah (ﷺ) got up in a rush, fearing that it might be the Hour. He went to the masjid, where he stood and prayed, standing, bowing and prostrating for the longest time that I ever saw him do in prayer. Then he said: 'These signs that Allah (SWT) sends do not occur for the death or birth of anyone, but Allah (SWT) sends them to strike fear into His slaves. If you see any of these things, then hasten to remember Him, call upon Him supplicate and ask for His forgiveness.'\"",
      "chain": [
        "35153",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1745",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد، عن أبي الحوراء، قال قال الحسن علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر في القنوت ‏\"‏ اللهم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت إنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Jawza said:                      \"Al-Hasan said:\"The Messenger of Allah (ﷺ) taught me some words to say in witr in Qunut: Allahumma ihdini fiman hadayta wa 'afini fiman afayta wa tawallani fiman tawallayta wa barik li fima a'tayta, wa qini sharra ma qadayta, fa innaka taqdi wa la yuqda 'alayk, wa innahu la yadhilluman walayta, tabarakta Rabbana wa at'alayt (O Allah, guide me among those whom You have guided, pardon me among those You have pardoned, turn to me in friendship among those on whom You have turned in friendship, and bless me in what You have bestowed, and save me from the evil of what You have decreed. For verily You decree and none can influence You; and he is not humiliated whom You have befriended. Blessed are You, O Lord, and Exalted.)'\"",
      "chain": [
        "30367",
        "20327",
        "11049",
        "11325"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني ابن أبي بردة، قال سمعت أبي يحدث، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل مسلم صدقة ‏\"‏ ‏.‏ قيل أرأيت إن لم يجدها قال ‏\"‏ يعتمل بيده فينفع نفسه ويتصدق ‏\"‏ ‏.‏ قيل أرأيت إن لم يفعل قال ‏\"‏ يعين ذا الحاجة الملهوف ‏\"‏ ‏.‏ قيل فإن لم يفعل قال ‏\"‏ يأمر بالخير ‏\"‏ ‏.‏ قيل أرأيت إن لم يفعل قال ‏\"‏ يمسك عن الشر فإنها صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet said:                     \"Every Muslim must give charity.\" It was said: \"What if he cannot find (anything to give)? \"He said: \"Let him work with his hands and benefit himself and give in charity.\" It was said: \"What if he cannot do that?\" He said: \"Let him help someone who is in desperate need.\" It was said: \"What if he cannot do that?\" He said: \"Let him enjoin good.\" It was said: \"What if he cannot do that? He said: \"Let him refrain from doing evil, for that is an act of charity.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "2556",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا سفيان، قال أخبرني أبو بردة بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ اشفعوا تشفعوا ويقضي الله عز وجل على لسان نبيه ما شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet said:                     \"Intercede and your intercession may be accepted, and Allah, the Mighty and Sublime, decrees on the lips of His Prophet whatsoever He will.\"",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2560",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني عبد الله بن الهيثم بن عثمان، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، عن بريد بن أبي بردة، عن جده، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏ ‏.‏ وقال ‏\"‏ الخازن الأمين الذي يعطي ما أمر به طيبا بها نفسه أحد المتصدقين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah said: 'The believers are like a building they support one another.' And he said: \"The trustworthy storekeeper who gives that which he has been commanded to give, and is happy with what he is doing, is one of the two giving charity.\"'",
      "chain": [
        "20033",
        "20012",
        "11325",
        "41"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن غيلان، وأبو كريب ويوسف بن موسى وعبد الله بن البراد قالوا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهر علينا السلاح فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-Ash'ari that the Messenger of Allah (ﷺ) said:                     “Whoever brandishes weapons against us is not one of us.'”",
      "chain": [
        "30277",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن بريد بن عبد الله، عن جده أبي بردة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤمن يأكل في معى واحد والكافر يأكل في سبعة أمعاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Musa that the Messenger of Allah (ﷺ) said:                     “Thebeliever eats with one intestine and the disbeliever eats withsevenintestines.”",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3770",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال احترق بيت بالمدينة على أهله فحدث النبي  صلى الله عليه وسلم  بشأنهم فقال ‏\"‏ إنما هذه النار عدو لكم فإذا نمتم فأطفئوها عنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"A house burned down in Al-Madinah, with its occupants inside. The Prophet(ﷺ) was told of what had happened, and he said: 'This fire is an enemy to you. When you go to sleep, extinguish it.'\"",
      "chain": [
        "30201",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3778",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن بريد، عن جده أبي بردة، عن أبي موسى، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا مر أحدكم في مسجدنا أو في سوقنا ومعه نبل فليمسك على نصالها بكفه أن تصيب أحدا من المسلمين بشىء أو فليقبض على نصالها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet(ﷺ) said:                     \"When anyone of you passes through our masjid or our marketplace carrying arrows, let him hold them by their heads, lest he hurt any Muslims.\"",
      "chain": [
        "30277",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3921",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، حدثنا بريد، عن أبي بردة، عن أبي موسى، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ رأيت في المنام أني أهاجر من مكة إلى أرض بها نخل فذهب وهلي إلى أنها يمامة أو هجر فإذا هي المدينة يثرب ورأيت في رؤياى هذه أني هززت سيفا فانقطع صدره فإذا هو ما أصيب من المؤمنين يوم أحد ثم هززته فعاد أحسن ما كان فإذا هو ما جاء الله به من الفتح واجتماع المؤمنين ورأيت فيها أيضا بقرا والله خير فإذا هم النفر من المؤمنين يوم أحد وإذا الخير ما جاء الله به من الخير بعد وثواب الصدق الذي آتانا الله به يوم بدر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Musa that the Prophet (ﷺ) said:                      “In adream Isaw myself emigrating from Makkah to a land in which thereweredate-palm trees, and I thought that it was Yamamah or Hajar, butitwas Al-Madinah, Yathrib. And I saw in this dream of mine that I waswielding a sword then it broke in the middle. That was what befellthebelievers on the Day of Uhud. Then I wielded it again and it wasbetter than it had been before, and that is what Allah brought aboutof the Conquest and the regrouping of the believers. And I also sawcows, and by Allah it is good, for they are the group of thebelievers(who were martyred) on the Day of Uhud, and the goodness isthat whichAllah brought forth after that, and the reward of thetruth whichAllah brought us on the Day of Badr.”",
      "chain": [
        "30277",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4154",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا أبو معاوية، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله يملي للظالم فإذا أخذه لم يفلته ‏\"‏ ‏.‏ ثم قرأ ‏{وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة}‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Messenger of Allah (ﷺ) said:                     ‘Allah gives respite to the wrongdoer, then when He seizes him, Hedoes not let him go.” Then he recited: “Such is the Seizure ofyourLord when He seizes the (population of) towns while they aredoingwrong.”[11:102]",
      "chain": [
        "30212",
        "38409",
        "20354",
        "11325",
        "11901",
        "41"
      ]
    }
  ],
  "total_hadiths": 114
}