{
  "id": "11324",
  "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
  "full_name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Mahrabi",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "11351",
      "name": "Saleem bin Aswad, Abu al-Ash'atha سليم بن أسود أبو الشعثاء المحاربي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10944",
      "name": "'Abdur Rahman bin Aby عبد الرحمن بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11351",
      "name": "Saleem bin Aswad, Abu al-Ash'atha سليم بن أسود أبو الشعثاء المحاربي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11620",
      "name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "3117",
      "name": "Mu'awiya bint Suwayd al-Mazni ( معاوية بن سويد بن مقرن المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "18831",
      "name": "Alaj bin 'Amr علاج بن عمرو",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "168",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، قال أخبرني أشعث بن سليم، قال سمعت أبي، عن مسروق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يعجبه التيمن في تنعله وترجله وطهوره وفي شأنه كله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to like to start from the right side on wearing shoes, combing his hair and cleaning or washing himself and on doing anything else.",
      "chain": [
        "30329",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يحب التيمن ما استطاع في شأنه كله في طهوره وترجله وتنعله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to start every thing from the right (for good things) whenever it was possible in all his affairs; for example: in washing, combing or wearing shoes.",
      "chain": [
        "20193",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "751",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا أشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الالتفات في الصلاة فقال ‏\"‏ هو اختلاس يختلسه الشيطان من صلاة العبد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked Allah's Apostle about looking hither and thither in prayer. He replied, \"It is a way of stealing by which Satan takes away (a portion) from the prayer of a person.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1132",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثني عبدان، قال أخبرني أبي، عن شعبة، عن أشعث، سمعت أبي قال، سمعت مسروقا، قال سألت عائشة  رضى الله عنها  أى العمل كان أحب إلى النبي صلى الله عليه وسلم قالت الدائم‏.‏ قلت متى كان يقوم قالت يقوم إذا سمع الصارخ‏.",
      "text_en": " Narrated Masruq:                     I asked `Aisha which deed was most loved by the Prophet. She said, \"A deed done continuously.\" I further asked, \"When did he used to get up (in the night for the prayer).\" She said, \"He used to get up on hearing the crowing of a cock.\"",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1609",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة  رضى الله عنها  قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا، ولولا أن قومك حديث عهدهم بالجاهلية فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت وأن ألصق بابه بالأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet whether the round wall (near Ka`ba) was part of the Ka`ba. The Prophet replied in the affirmative. I further said, \"What is wrong with them, why have they not included it in the building of the Ka`ba?\" He said, \"Don't you see that your people (Quraish) ran short of money (so they could not include it inside the building of Ka`ba)?\" I asked, \"What about its gate? Why is it so high?\" He replied, \"Your people did this so as to admit into it whomever they liked and prevent whomever they liked. Were your people not close to the Pre-Islamic Period of ignorance (i.e. they have recently embraced Islam) and were I not afraid that they would dislike it, surely I would have included the (area of the) wall inside the building of the Ka`ba and I would have lowered its gate to the level of the ground.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2445",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا شعبة، عن الأشعث بن سليم، قال سمعت معاوية بن سويد، سمعت البراء بن عازب  رضى الله عنهما  قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع‏.‏ فذكر عيادة المريض، واتباع الجنائز، وتشميت العاطس، ورد السلام، ونصر المظلوم، وإجابة الداعي، وإبرار المقسم‏.‏",
      "text_en": " Narrated Muawiya bin Suwaid:                     I heard Al-Bara' bin `Azib saying, \"The Prophet orders us to do seven things and prohibited us from doing seven other things.\" Then Al-Bara' mentioned the following:-- (1) To pay a visit to the sick (inquiring about his health), (2) to follow funeral processions, (3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), (4) to return greetings, (5) to help the oppressed, (6) to accept invitations, (7) to help others to fulfill their oaths. (See Hadith No. 753, Vol. 7)",
      "chain": [
        "20231",
        "20020",
        "11324",
        "400"
      ]
    },
    {
      "hadith_no": "2647",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، أن عائشة  رضى الله عنها  قالت دخل على النبي صلى الله عليه وسلم وعندي رجل، قال ‏\"‏ يا عائشة من هذا ‏\"‏‏.‏ قلت أخي من الرضاعة‏.‏ قال ‏\"‏ يا عائشة، انظرن من إخوانكن، فإنما الرضاعة من المجاعة ‏\"‏‏.‏ تابعه ابن مهدي عن سفيان‏.‏",
      "text_en": " Narrated Aisha:                     Once the Prophet came to me while a man was in my house. He said, \"O `Aisha! Who is this (man)?\" I replied, \"My foster brothers\" He said, \"O `Aisha! Be sure about your foster brothers, as fostership is only valid if it takes place in the suckling period (before two years of age).",
      "chain": [
        "28531",
        "20012",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال قالت عائشة  رضى الله عنها  سألت النبي صلى الله عليه وسلم عن التفات الرجل في الصلاة‏.‏ فقال ‏\"‏ هو اختلاس يختلس الشيطان من صلاة أحدكم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet about one's looking here and there during the prayer. He replied, \"It is what Satan steals from the prayer of any one of you.\"",
      "chain": [
        "30189",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5434",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا شعبة، عن أشعث، عن أبيه، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يحب التيمن ما استطاع في طهوره وتنعله وترجله‏.‏ وكان قال بواسط قبل هذا في شأنه كله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to love to start doing things from the right side whenever possible, in performing ablution, putting on his shoes, and combing his hair. (Al-Ash'ath said: The Prophet used to do so in all his affairs.)",
      "chain": [
        "30349",
        "20025",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5695",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن الأشعث بن سليم، عن معاوية بن سويد بن مقرن، عن البراء بن عازب، قال أمرنا رسول الله صلى الله عليه وسلم بسبع، ونهانا عن سبع، أمرنا بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإجابة الداعي، وإفشاء السلام، ونصر المظلوم وإبرار المقسم، ونهانا عن خواتيم الذهب، وعن الشرب في الفضة  أو قال آنية الفضة  وعن المياثر والقسي، وعن لبس الحرير والديباج والإستبرق‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     Allah's Apostle ordered us to do seven things and forbade us from seven. He ordered us to visit the sick, to follow funeral processions, (to say) to a sneezer, (May Allah bestow His Mercy on you, if he says, Praise be to Allah), to accept invitations, to greet (everybody), to help the oppressed and to help others to fulfill their oaths. He forbade us to wear gold rings, to drink in silver (utensils), to use Mayathir (silken carpets placed on saddles), to wear Al-Qissi (a kind of silken cloth), to wear silk, Dibaj or Istabraq (two kinds of silk).",
      "chain": [
        "20040",
        "20469",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "5710",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني أشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، عن البراء بن عازب  رضى الله عنهما  قال أمرنا رسول الله صلى الله عليه وسلم بسبع، ونهانا عن سبع، نهانا عن خاتم الذهب، ولبس الحرير، والديباج، والإستبرق، وعن القسي، والميثرة، وأمرنا أن نتبع الجنائز، ونعود المريض، ونفشي السلام‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle ordered us to do seven things and forbade us to do seven other things. He forbade us to wear gold rings, silk, Dibaj, Istabriq, Qissy, and Maithara; and ordered us to accompany funeral processions, visit the sick and greet everybody. (See Hadith No. 104)",
      "chain": [
        "30329",
        "20020",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "5899",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا سفيان، عن أشعث بن أبي الشعثاء، حدثنا معاوية بن سويد بن مقرن، عن ابن عازب، قال نهانا النبي صلى الله عليه وسلم عن المياثر الحمر والقسي‏.‏",
      "text_en": " Narrated Ibn Azib:                     The Prophet forbade us to use the red Mayathir and to use Al-Qassiy.",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11324",
        "3117"
      ]
    },
    {
      "hadith_no": "5910",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أشعث، عن معاوية بن سويد بن مقرن، عن البراء  رضى الله عنه  قال أمرنا النبي صلى الله عليه وسلم بسبع عيادة المريض، واتباع الجنائز، وتشميت العاطس، ونهانا عن لبس الحرير، والديباج، والقسي، والإستبرق، ومياثر الحمر‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet ordered us to observe seven things: To visit the sick; follow funeral processions; say 'May Allah bestow His Mercy on you', to the sneezer if he says, 'Praise be to Allah!; He forbade us to wear silk, Dibaj, Qassiy and Istibarq (various kinds of silken clothes); or to use red Mayathir (silkcushions). (See Hadith No. 253 A, Vol. 8).",
      "chain": [
        "20351",
        "20012",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "5915",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أشعث بن سليم، سمعت أبي يحدث، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يحب التيمن في طهوره وترجله وتنعله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to like starting from the right in performing ablution, combing his hair and putting on his shoes.",
      "chain": [
        "20219",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5924",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا أشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، قال سمعت البراء بن عازب  رضى الله عنهما  يقول نهانا النبي صلى الله عليه وسلم عن سبع نهى عن خاتم الذهب  أو قال حلقة الذهب  وعن الحرير، والإستبرق، والديباج، والميثرة الحمراء، والقسي، وآنية الفضة، وأمرنا بسبع بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ورد السلام، وإجابة الداعي، وإبرار المقسم، ونصر المظلوم‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet forbade us to use seven things: He forbade using gold rings, silk, Istabraq, Dibaj, red Mayathir, Al-Qassiy, and silver utensils. He ordered us to do seven other things. To pay a visit to the sick; to follow funeral processions; to say, \"May Allah be merciful to you\" to a sneezer if he says \"Praise be to Allah\"; to return greetings, to accept invitations; to help others to fulfil their oaths and to help the oppressed ones.",
      "chain": [
        "20404",
        "20020",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "5989",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، عن النبي صلى الله عليه وسلم أنه كان يعجبه التيمن ما استطاع في ترجله ووضوئه‏.‏",
      "text_en": " 'Narrated `Aisha:                     The Prophet used to like to start from the right side as far as possible in combing and in performing ablution.",
      "chain": [
        "20296",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "6294",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، عن البراء  رضى الله عنه  قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع، أمرنا بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإجابة الداعي، ورد السلام، ونصر المظلوم، وإبرار المقسم، ونهانا عن سبع، عن خاتم الذهب  أو قال حلقة الذهب  وعن لبس الحرير، والديباج، والسندس، والمياثر‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet ordered us to do seven (things) and forbade us from seven (other things): He ordered us to pay a visit to the sick, to follow funeral possessions, to say: May Allah be merciful to you to a sneezer, - if he says: Praise be to Allah, to accept invitation (invitation to a wedding banquet), to return greetings, to help the oppressed, and to help others to fulfill their oaths (provided it was not sinful). And he forbade us from seven (things): to wear golden rings or golden bangles, to wear silk (cloth), Dibaj, Sundus and Mayathir.",
      "chain": [
        "20193",
        "20020",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "6307",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الشيباني، عن أشعث بن أبي الشعثاء، عن معاوية بن سويد بن مقرن، عن البراء بن عازب  رضى الله عنهما  قال أمرنا رسول الله صلى الله عليه وسلم بسبع بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ونصر الضعيف، وعون المظلوم، وإفشاء السلام، وإبرار المقسم، ونهى عن الشرب في الفضة، ونهانا عن تختم الذهب، وعن ركوب المياثر، وعن لبس الحرير، والديباج، والقسي، والإستبرق‏.‏",
      "text_en": "      Narrated Al-Bara' bin 'Azib:                          Allah's Apostle ordered us to do seven (things): to visit the sick, to     follow the funeral processions, to say Tashmit to a sneezer, to help      the weak, to help the oppressed ones, to propagate As-Salam      (greeting), and to help others to fulfill their oaths (if it is not      sinful). He forbade us to drink from silver utensils, to wear gold      rings, to ride on silken saddles, to wear silk clothes, Dibaj (thick      silk cloth), Qassiy and Istabraq (two kinds of silk). (See      Hadith No. 539, Vol. 7)",
      "chain": [
        "30367",
        "20028",
        "11352",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "6538",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبدان، أخبرنا أبي، عن شعبة، عن أشعث، قال سمعت أبي قال، سمعت مسروقا، قال سألت عائشة  رضى الله عنها  أى العمل كان أحب إلى النبي صلى الله عليه وسلم قالت الدائم‏.‏ قال قلت فأى حين كان يقوم قالت كان يقوم إذا سمع الصارخ‏.‏",
      "text_en": " Narrated Masruq:                     I asked `Aisha \"What deed was the most beloved to the Prophet?\" She said, \"The regular constant one.\" I said, \"At what time did he use to get up at night (for the Tahajjud night prayer)?' She said, \"He used to get up on hearing (the crowing of) the cock (the last third of the night).",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "6735",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أشعث، عن معاوية بن سويد بن مقرن، عن البراء، عن النبي صلى الله عليه وسلم‏.‏ وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أشعث، عن معاوية بن سويد بن مقرن، عن البراء  رضى الله عنه  قال أمرنا النبي صلى الله عليه وسلم بإبرار المقسم‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet ordered us to help others to fulfill the oaths.",
      "chain": [
        "20351",
        "20012",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "6820",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثني محمود، حدثنا أبو النضر، حدثنا أبو معاوية، شيبان عن أشعث، عن الأسود بن يزيد، قال أتانا معاذ بن جبل باليمن معلما وأميرا، فسألناه عن رجل، توفي وترك ابنته وأخته، فأعطى الابنة النصف والأخت النصف‏.‏",
      "text_en": " Narrated Al-Aswad bin Yazid:                     Mu`adh bin Jabal came to us in Yemen as a tutor and a ruler, and we (the people of Yemen) asked him about (the distribution of the property of ) a man who had died leaving a daughter and a sister. Mu`adh gave the daughter one-half of the property and gave the sister the other half.",
      "chain": [
        "30277",
        "20390",
        "11324",
        "11054"
      ]
    },
    {
      "hadith_no": "7330",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة، قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذاك قومك، ليدخلوا من شاءوا، ويمنعوا من شاءوا، لولا أن قومك حديث عهدهم بالجاهلية، فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت، وأن ألصق بابه في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet about the wall (outside the Ka`ba). \"Is it regarded as part of the Ka`ba?\" He replied, \"Yes.\" I said, \"Then why didn't the people include it in the Ka`ba?\" He said, \"(Because) your people ran short of money.\" I asked, \"Then why is its gate so high?\" He replied, ''Your people did so in order to admit to it whom they would and forbid whom they would. Were your people not still close to the period of ignorance, and were I not afraid that their hearts might deny my action, then surely I would include the wall in the Ka`ba and make its gate touch the ground.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "7461",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، سمعا الأسود بن هلال، عن معاذ بن جبل، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن يعبدوه ولا يشركوا به شيئا، أتدري ما حقهم عليه ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     The Prophet said, \"O Mu`adh! Do you know what Allah's Right upon His slaves is?\" I said, \"Allah and His Apostle know best.\" The Prophet said, \"To worship Him (Allah) Alone and to join none in worship with Him (Allah). Do you know what their right upon Him is?\" I replied, \"Allah and His Apostle know best.\" The Prophet said, \"Not to punish them (if they do so).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، أنهما سمعا الأسود بن هلال، يحدث عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن يعبد الله ولا يشرك به شىء - قال - أتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ فقال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that the Messenger of Allah (may peace be upon him) said:                      Mu'adh, do you know the right of Allah over His bondsmen? He (Mu'adh) said: Allah and His Apostle know best. He (the Messenger of Allah) said: That Allah alone should be worshipped and nothing should be associated with Him. He (the Holy Prophet) said: What right have they (bondsmen) upon Him in case they do it? He (Mu'adh) said: Allah and His Apostle know best. He (the Holy Prophet) said: That He would not punish them.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليحب التيمن في طهوره إذا تطهر وفي ترجله إذا ترجل وفي انتعاله إذا انتعل ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (way peace be upon him) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.",
      "chain": [
        "30399",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، عن أشعث، عن الأسود بن هلال، عن المغيرة بن شعبة، قال بينا أنا مع، رسول الله صلى الله عليه وسلم ذات ليلة إذ نزل فقضى حاجته ثم جاء فصببت عليه من إداوة كانت معي فتوضأ ومسح على خفيه ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      I was with the Messenger of Allah (may peace be upon him) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.",
      "chain": [
        "30399",
        "20327",
        "11324",
        "11620",
        "166"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، عن عائشة، بهذا الحديث وفيه قالت وما صلى صلاة بعد ذلك إلا سمعته يتعوذ من عذاب القبر ‏.‏",
      "text_en": " Masruq reported this hadith on the authority of 'A'isha who said:                      Never did he (the Holy Prophet) say prayer after this in which I did not hear him seeking refuge from the torment of the grave.",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال سألت عائشة عن عمل، رسول الله صلى الله عليه وسلم فقالت كان يحب الدائم ‏.‏ قال قلت أى حين كان يصلي فقالت كان إذا سمع الصارخ قام فصلى ‏.‏",
      "text_en": " 'A'isha reported:                      Never did the earlier part of the dawn find the Messenger of Allah (may peace be upon him) but sleeping in my house or near me.",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن أشعث، بن أبي الشعثاء عن جعفر بن أبي ثور، عن جابر بن سمرة، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يأمرنا بصيام يوم عاشوراء ويحثنا عليه ويتعاهدنا عنده فلما فرض رمضان لم يأمرنا ولم ينهنا ولم يتعاهدنا عنده ‏.‏",
      "text_en": " Jabir b Samura reported that the Messenger of Allah (may peace be upon him) commanded us to observe fast on the day of Ashura and exhorted us to do it and was particular about it But when (fasting) in Ramadan was made obligatory, he hence. forth neither commanded us nor forbade us, nor was he so particular about it.",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو الأحوص، حدثنا أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فلم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏ ‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا ولولا أن قومك حديث عهدهم في الجاهلية فأخاف أن تنكر قلوبهم لنظرت أن أدخل الجدر في البيت وأن ألزق بابه بالأرض ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I asked Allah's Messenger (may peace be upon him) about the wall, circumpassing the House (i. e. whether the wall on the side of Hijr was included in the Ka'ba). He said, Yes. I said: Then why did they not include it in the House? He said: 'Your people ran short of the means (to do so). I said: Why is it that the level of its door is raised high? He said: Your people did it so that they should admit one whom they liked, and forbid him whom they disliked, and if your people were not new converts to faith, and I did not apprehend that their hearts would feel agitated at this. I would have definitely included (the area of) this wall-in the House and would have brought the door to the level of the ground.",
      "chain": [
        "30116",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، قال حدثنا عبيد الله، - يعني ابن موسى - حدثنا شيبان، عن أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الحجر ‏.‏ وساق الحديث بمعنى حديث أبي الأحوص وقال فيه فقلت فما شأن بابه مرتفعا لا يصعد إليه إلا بسلم وقال ‏\"‏ مخافة أن تنفر قلوبهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I asked Allah's Messenger (may peace be upon him) about Hijr, and the rest of the hadith is the same. I also said: Why is it that the door has been made on a higher level, and one cannot (get into it) but with the help of a ladder? The rest of the hadith is the same as reported above and the concluding words are: (I do not change it) out of the apprehension that their hearts may disapprove of it.\"",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، قال قالت عائشة دخل على رسول الله صلى الله عليه وسلم وعندي رجل قاعد فاشتد ذلك عليه ورأيت الغضب في وجهه قالت فقلت يا رسول الله إنه أخي من الرضاعة ‏.‏ قالت فقال ‏\"‏ انظرن إخوتكن من الرضاعة فإنما الرضاعة من المجاعة‏\".",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) visited me when a man was sitting near me, and he seemed to disapprove of that. And I saw signs of anger on his face and I said: Messenger of Allah, he is my brother by forsterage, whereupon he said: Consider who your brothers are because of fosterage since fosterage is through hunger (i. e. in infancy).",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "3778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثني زهير بن حرب، حدثنا هشيم، أخبرنا سيار، وحصين، ومغيرة، وأشعث، ومجالد وإسماعيل بن أبي خالد وداود كلهم عن الشعبي، قال دخلت على فاطمة بنت قيس فسألتها عن قضاء، رسول الله صلى الله عليه وسلم عليها فقالت طلقها زوجها البتة ‏.‏ فقالت فخاصمته إلى رسول الله صلى الله عليه وسلم في السكنى والنفقة - قالت - فلم يجعل لي سكنى ولا نفقة وأمرني أن أعتد في بيت ابن أم مكتوم ‏.‏",
      "text_en": " Sha'bi reported:                      I visited Fatima bint Qais and asked her about the verdict of Allah's Messenger (may peace be upon him) about (board and lodging during the 'Idda) and she said that her husband divorced her with an irrevocable divorce. She (further. said): I contended with him before Allah's Messerger (may peace be upon him) about lodging and maintenance allowance, and she said: He did not provide me with any lodging or maintenance allowance, and he commanded me to spend the 'Idda in the house of Ibn Umm Maktum.",
      "chain": [
        "30022",
        "20468",
        "11429",
        "15097",
        "11072",
        "11324",
        "11052"
      ]
    },
    {
      "hadith_no": "3779",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن حصين، وداود، ومغيرة، وإسماعيل، وأشعث عن الشعبي، أنه قال دخلت على فاطمة بنت قيس ‏.‏ بمثل حديث زهير عن هشيم.",
      "text_en": " A hadith like this has been trarismitted on the authority of Hushaim through another chain of narrators.",
      "chain": [
        "30399",
        "20468",
        "15097",
        "11072",
        "11418",
        "11324",
        "11052"
      ]
    },
    {
      "hadith_no": "5510",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو خيثمة، عن أشعث بن أبي الشعثاء، ح وحدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أشعث، حدثني معاوية بن سويد، بن مقرن قال دخلت على البراء بن عازب فسمعته يقول أمرنا رسول الله صلى الله عليه وسلم بسبع ونهانا عن سبع أمرنا بعيادة المريض واتباع الجنازة وتشميت العاطس وإبرار القسم أو المقسم ونصر المظلوم وإجابة الداعي وإفشاء السلام ‏.‏ ونهانا عن خواتيم أو عن تختم بالذهب وعن شرب بالفضة وعن المياثر وعن القسي وعن لبس الحرير والإستبرق والديباج ‏.‏",
      "text_en": " Mu'awiya b. Suwaid b. Muqarrin reporxed:                      I visited al-Bara' b. 'Azib and heard him say: Allah's Messenger (may peace be upon him) commanded us to do seven things and forbade us to do seven (things). He commanded us to visit the sick, to follow the funeral procession, to answer the sneezer, to fulfil the vow, to help the poor, to accept the invitation and to greet everybody, and he forbade us to wear rings or gold rings, to drink in silver (vessels), and to use the saddle cloth made of red silk, and to wear garments made of Qassi material, or garments made of silk or brocade and velvet.",
      "chain": [
        "30399",
        "30022",
        "11324",
        "30184",
        "20321",
        "11324",
        "3117"
      ]
    },
    {
      "hadith_no": "5511",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا أبو عوانة، عن أشعث بن سليم، بهذا الإسناد مثله إلا قوله وإبرار القسم أو المقسم ‏.‏ فإنه لم يذكر هذا الحرف في الحديث وجعل مكانه وإنشاد الضال ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ash'ath b. Sulaim with the same chain of transmitters but with a slight change of wording that he made no mention of:                     \" to fulfil the vows\" but substituted these words:\" finding of the lost articles\".",
      "chain": [
        "20469",
        "11324"
      ]
    },
    {
      "hadith_no": "27",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، والحسن بن علي، قالا حدثنا عبد الرزاق، قال أحمد حدثنا معمر، أخبرني أشعث، وقال الحسن، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبولن أحدكم في مستحمه ثم يغتسل فيه ‏\"‏ ‏.‏ قال أحمد ‏\"‏ ثم يتوضأ فيه فإن عامة الوسواس منه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Messenger of Allah (ﷺ) said: No one of you should make water in his bath and then wash himself there (after urination). The version of Ahmad has: Then performs ablution there, for evil thoughts come from it.",
      "chain": [
        "30007",
        "30",
        "20121",
        "30007",
        "20115",
        "11324",
        "11016",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن خلاد، حدثنا خالد بن الحارث، عن أشعث، عن الحسن، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم أنه كان يسكت سكتتين إذا استفتح وإذا فرغ من القراءة كلها ‏.‏ فذكر معنى حديث يونس ‏.‏",
      "text_en": " Samurah b. Jundub said:                      The Prophet(ﷺ) had two periods of silence; when he began his prayer and when he finished the recitation (of the Qur’an). He then narrated the tradition like the version of Yunus.",
      "chain": [
        "30357",
        "20226",
        "11324",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "910",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، عن الأشعث، - يعني ابن سليم - عن أبيه، عن مسروق، عن عائشة، - رضى الله عنها - قالت سألت رسول الله صلى الله عليه وسلم عن التفات الرجل في الصلاة فقال ‏\"‏ إنما هو اختلاس يختلسه الشيطان من صلاة العبد ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said:                      I asked the Messenger of Allah(ﷺ) about looking to the sides during prayer. He said: It is something which the devil snatches from a servant’s prayers.",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1039",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا محمد بن عبد الله بن المثنى، حدثني أشعث، عن محمد بن سيرين، عن خالد، - يعني الحذاء - عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن النبي صلى الله عليه وسلم صلى بهم فسها فسجد سجدتين ثم تشهد ثم سلم ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) led them in prayer and forgot something, so he made prostrations and uttered the tashahhud, then gave the salutation.",
      "chain": [
        "11222",
        "11324",
        "11035",
        "11282",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "1246",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني الأشعث بن سليم، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال كنا مع سعيد بن العاص بطبرستان فقام فقال أيكم صلى مع رسول الله صلى الله عليه وسلم صلاة الخوف فقال حذيفة أنا فصلى بهؤلاء ركعة وبهؤلاء ركعة ولم يقضوا ‏.‏ قال أبو داود وكذا رواه عبيد الله بن عبد الله ومجاهد عن ابن عباس عن النبي صلى الله عليه وسلم وعبد الله بن شقيق عن أبي هريرة عن النبي صلى الله عليه وسلم ويزيد الفقير وأبو موسى - قال أبو داود رجل من التابعين ليس بالأشعري - جميعا عن جابر عن النبي صلى الله عليه وسلم وقد قال بعضهم في حديث يزيد الفقير إنهم قضوا ركعة أخرى ‏.‏ وكذلك رواه سماك الحنفي عن ابن عمر عن النبي صلى الله عليه وسلم وكذلك رواه زيد بن ثابت عن النبي صلى الله عليه وسلم قال فكانت للقوم ركعة ركعة وللنبي صلى الله عليه وسلم ركعتين ‏.‏",
      "text_en": " Narrated Hudhayfah:                     Tha'labah ibn Zahdam said: We accompanied Sa'd ibn al-'As at Tabaristan. He stood and said: Which of you prayed along with the Messenger of Allah (ﷺ) in time of danger? Hudhayfah said: I then he led one section in one rak'ah and the other section in one rak'ah. They did not pray the second rak'ah by themselves.Abu Dawud: This tradition has been transmitted by 'Ubaid Allah b. 'Abd Allah and Mujahid on the authority of Ibn 'Abbas from the Prophet (ﷺ) in like manner. This has also been narrated by 'Abd Allah b. Shaqiq from Abu Hurairah from the Prophet (ﷺ). Yazid al-Faqir and Abu Musa also narrated this tradition from Jabir from the Prophet (ﷺ). Some of the narrators said in the version narrated by Yazid al-Faqir that they completed their second rak'ah. This has also been narrated by Simak al-Hanafi on the authority of Ibn 'Umar from the Prophet (ﷺ) something similar. Zaid b. Thabit also narrated from the Prophet (ﷺ) in like manner. This version adds: The people prayed on rak'ah and the Prophet (ﷺ) prayed two rak'ahs.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "1317",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا أبو الأحوص، ح وحدثنا هناد، عن أبي الأحوص، - وهذا حديث إبراهيم - عن أشعث، عن أبيه، عن مسروق، قال سألت عائشة - رضى الله عنها - عن صلاة رسول الله صلى الله عليه وسلم فقلت لها أى حين كان يصلي قالت كان إذا سمع الصراخ قام فصلى ‏.‏",
      "text_en": " Masruq said:                      I asked 'Aishah about the prayer of the Messenger of Allah (ﷺ), and I said to her: At what time he prayed at night ? She said: When he heard the cock crow, he got up and prayed.",
      "chain": [
        "30309",
        "20327",
        "30480",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا روح، حدثنا أشعث، عن الحسن، عن أنس بن مالك، أن النبي صلى الله عليه وسلم صلى الظهر ثم ركب راحلته فلما علا على جبل البيداء أهل ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) offered the noon prayer, and then rode on his mount. When he came to the hill of al-Bayda', he raised his voice in talbiyah.",
      "chain": [
        "30007",
        "20229",
        "11324",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "1933",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث بن سليم، عن أبيه، قال أقبلت مع ابن عمر من عرفات إلى المزدلفة فلم يكن يفتر من التكبير والتهليل حتى أتينا المزدلفة فأذن وأقام أو أمر إنسانا فأذن وأقام فصلى بنا المغرب ثلاث ركعات ثم التفت إلينا فقال الصلاة فصلى بنا العشاء ركعتين ثم دعا بعشائه ‏.‏ قال وأخبرني علاج بن عمرو بمثل حديث أبي عن ابن عمر قال فقيل لابن عمر في ذلك فقال صليت مع رسول الله صلى الله عليه وسلم هكذا ‏.‏",
      "text_en": " Ash’ath bin Sulaim reported on the authority of his father “I proceeded along with Ibn ‘Umar from ‘Arafah towards Al Muzdalifah.” He was not tiring of uttering “Allaah is most great” and “There is no god but Allaah”, till we came to Al Muzdalifah. He uttered the adhan and the iqamah or ordered some person who called the adhan and the iqamah. He then led us the three rak’ahs of the sunset prayers and turned to us and said (Another) prayer. Thereafter he led us in the two rak’ahs of the night prayer. Then he called for his dinner. He (Ash’ath) said ‘Ilaj bin ‘Amr reported a tradition like that of my father on the authority of Ibn ‘Umar. Ibn ‘Umar was asked about it. He said “I prayed along with the Apostle of Allaah(ﷺ) in a similar manner.”",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11351"
      ]
    },
    {
      "hadith_no": "2058",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا محمد بن كثير، أخبرنا سفيان، عن أشعث بن سليم، عن أبيه، عن مسروق، عن عائشة المعنى، واحد، أن رسول الله صلى الله عليه وسلم دخل عليها وعندها رجل قال حفص فشق ذلك عليه وتغير وجهه - ثم اتفقا - قالت يا رسول الله إنه أخي من الرضاعة ‏.‏ فقال ‏\"‏ انظرن من إخوانكن فإنما الرضاعة من المجاعة ‏\"‏ ‏.‏",
      "text_en": " A’ishah said the Apostle of Allaah(ﷺ) visited her when a man was with her. The narrator Hafs said “this grieved him and he frowned”. The agreed version then goes, She said “He is my foster brother Apostle of Allaah(ﷺ)”. He said “Consider, who are you brethren, for fosterage is consequent on hunger.”",
      "chain": [
        "30329",
        "20020",
        "28531",
        "20012",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "2589",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا قريش بن أنس، حدثنا أشعث، عن الحسن، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم نهى أن يقد السير بين أصبعين ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) prohibited to cut a piece of leather between two fingers.",
      "chain": [
        "30160",
        "20273",
        "11324",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "4140",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، ومسلم بن إبراهيم، قالا حدثنا شعبة، عن الأشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يحب التيمن ما استطاع في شأنه كله في طهوره وترجله ونعله ‏.‏ قال مسلم وسواكه ولم يذكر في شأنه كله ‏.‏ قال أبو داود رواه عن شعبة معاذ ولم يذكر سواكه ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) liked to begin with the right side as far as possible in all conditions: in his purification, and combing. The narrator Muslim added: \"in using tooth-stick,\" and he did not mention \"in all his conditions\".Abu Dawud said: Shu'bah transmitted it from Mu'adh, but did not mention \"his tooth-stick.\"",
      "chain": [
        "30329",
        "20285",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4664",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عمرو بن مرزوق، أخبرنا شعبة، عن الأشعث بن سليم، عن أبي بردة، عن ثعلبة بن ضبيعة، قال دخلنا على حذيفة فقال إني لأعرف رجلا لا تضره الفتن شيئا ‏.‏ قال فخرجنا فإذا فسطاط مضروب فدخلنا فإذا فيه محمد بن مسلمة فسألناه عن ذلك فقال ما أريد أن يشتمل على شىء من أمصاركم حتى تنجلي عما انجلت ‏.‏",
      "text_en": " Tha’labah b. Dubai’ah said:                      We entered upon Hudhaifah. He said: I know a man whom the trails will not harm. We came out and found that a tent was pitched. We entered and found in it Muhammad b. Maslamah. We asked him about it. He said : I do not intent that any place of your towns should occupy me until that which is prevailing is removed.",
      "chain": [
        "20268",
        "20020",
        "11324",
        "11901"
      ]
    },
    {
      "hadith_no": "4665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أشعث بن سليم، عن أبي بردة، عن ضبيعة بن حصين الثعلبي، بمعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Dubai’ah b. Husain al-Tha’labi through a different chain of narrators to the same effect.",
      "chain": [
        "30175",
        "20469",
        "11324",
        "11901"
      ]
    },
    {
      "hadith_no": "209",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا أبو زبيد، - وهو عبثر بن القاسم عن أشعث، عن الحسن، عن عثمان بن أبي العاص، قال إن من آخر ما عهد إلى رسول الله صلى الله عليه وسلم أن اتخذ مؤذنا لا يأخذ على أذانه أجرا ‏.‏ قال أبو عيسى حديث عثمان حديث حسن ‏.‏ والعمل على هذا عند أهل العلم كرهوا أن يأخذ المؤذن على الأذان أجرا واستحبوا للمؤذن أن يحتسب في أذانه ‏.‏",
      "text_en": " Uthman bin Abi Al-As narrated:                     \"Indeed, amount the last (of orders) Allah's Messenger ordered me with was to employ a Mu'adh-dhin who would not take a wage for his Adhan.\"",
      "chain": [
        "30480",
        "20329",
        "11324",
        "11016",
        "3210"
      ]
    }
  ],
  "total_hadiths": 110
}