{
  "id": "11338",
  "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
  "full_name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "149",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11385",
      "name": "Faras bin Yahya al-Hamdani al-Kharfi فراس بن يحيى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10680",
      "name": "Khalid bin Salma bin al-Aas, al-Fa'Fa' خالد بن سلمة بن العاص - الفأفاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10658",
      "name": "Mus'ab bin Shayba bin Jbyr مصعب بن شيبة بن جبير بن شيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "52",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، قال سمعت النعمان بن بشير، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلال بين والحرام بين، وبينهما مشبهات لا يعلمها كثير من الناس، فمن اتقى المشبهات استبرأ لدينه وعرضه، ومن وقع في الشبهات كراع يرعى حول الحمى، يوشك أن يواقعه‏.‏ ألا وإن لكل ملك حمى، ألا إن حمى الله في أرضه محارمه، ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله‏.‏ ألا وهي القلب ‏\"‏‏.‏",
      "text_en": "      Narrated An-Nu'man bin Bashir:                          I heard Allah's Apostle saying, 'Both legal and illegal things are      evident but in between them there are doubtful (suspicious) things and     most of the people have no knowledge about them. So whoever saves      himself from these suspicious things saves his religion and his honor.     And whoever indulges in these suspicious things is like a shepherd who     grazes (his animals) near the Hima (private pasture) of someone else      and at any moment he is liable to get in it. (O people!) Beware! Every     king has a Hima and the Hima of Allah on the earth is His illegal      (forbidden) things. Beware! There is a piece of flesh in the body if      it becomes good (reformed) the whole body becomes good but if it gets      spoilt the whole body gets spoilt and that is the heart.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا زكرياء، قال حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أذن أن تخرجن في حاجتكن ‏\"‏‏.‏ قال هشام يعني البراز‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said to his wives, \"You are allowed to go out to answer the call of nature. \"",
      "chain": [
        "11338",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم في سفر، فأهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين ‏\"‏‏.‏ فمسح عليهما‏.‏",
      "text_en": " Narrated `Urwa bin Al-Mughira:                     My father said, \"Once I was in the company of the Prophet on a journey and I dashed to take off his Khuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them after performing ablution. So he passed wet hands over them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "1728",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن مسروق، عن عائشة  رضى الله عنها  قالت فتلت لهدى النبي صلى الله عليه وسلم  تعني القلائد  قبل أن يحرم‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted (the garlands) for the Hadis of the Prophet before he assumed Ihram.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2433",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "وقال أحمد بن سعيد حدثنا روح، حدثنا زكرياء، حدثنا عمرو بن دينار، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يعضد عضاهها، ولا ينفر صيدها، ولا تحل لقطتها إلا لمنشد، ولا يختلى خلاها ‏\"‏‏.‏ فقال عباس يا رسول الله إلا الإذخر‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn 'Abbas (ra):                      Allah's Messenger () also said, \"It (i.e., Makkah's) thorny bushes should not be uprooted and its game should not be chased, and picking up its fallen things is illegal except by  him who makes public announcement about it, and its grass should not be cut.\" 'Abbas said, \"O Allah's Messenger ! Except Idhkhir (a kind of grass).\" The Prophet () said, \"Except Idhkhir.\"",
      "chain": [
        "30296",
        "20229",
        "11338",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، قال سمعت عامرا، يقول سمعت النعمان بن بشير  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل القائم على حدود الله والواقع فيها كمثل قوم استهموا على سفينة، فأصاب بعضهم أعلاها وبعضهم أسفلها، فكان الذين في أسفلها إذا استقوا من الماء مروا على من فوقهم فقالوا لو أنا خرقنا في نصيبنا خرقا، ولم نؤذ من فوقنا‏.‏ فإن يتركوهم وما أرادوا هلكوا جميعا، وإن أخذوا على أيديهم نجوا ونجوا جميعا ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     The Prophet said, \"The example of the person abiding by Allah's order and restrictions in comparison to those who violate them is like the example of those persons who drew lots for their seats in a boat. Some of them got seats in the upper part, and the others in the lower. When the latter needed water, they had to go up to bring water (and that troubled the others), so they said, 'Let us make a hole in our share of the ship (and get water) saving those who are above us from troubling them. So, if the people in the upper part left the others do what they had suggested, all the people of the ship would be destroyed, but if they prevented them, both parties would be safe.\"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2511",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه كان يقول ‏\"‏ الرهن يركب بنفقته، ويشرب لبن الدر إذا كان مرهونا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"One can ride the mortgaged animal because of what one spends on it, and one can drink the milk of a milch animal as long as it is mortgaged. \"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "13"
      ]
    },
    {
      "hadith_no": "2512",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا زكرياء، عن الشعبي، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏ ‏\"‏ الرهن يركب بنفقته إذا كان مرهونا، ولبن الدر يشرب بنفقته إذا كان مرهونا، وعلى الذي يركب ويشرب النفقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The mortgaged animal can be used for riding as long as it is fed and the milk of the milch animal can be drunk according to what one spend on it. The one who rides the animal or drinks its milk should provide the expenditures.\"",
      "chain": [
        "30118",
        "20025",
        "11338",
        "11052",
        "13"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، قال سمعت عامرا، يقول حدثني جابر  رضى الله عنه أنه كان يسير على جمل له قد أعيا، فمر النبي صلى الله عليه وسلم فضربه، فدعا له، فسار بسير ليس يسير مثله ثم قال ‏\"‏ بعنيه بوقية ‏\"‏‏.‏ قلت لا‏.‏ ثم قال ‏\"‏ بعنيه بوقية ‏\"‏‏.‏ فبعته فاستثنيت حملانه إلى أهلي، فلما قدمنا أتيته بالجمل، ونقدني ثمنه، ثم انصرفت، فأرسل على إثري، قال ‏\"‏ ما كنت لآخذ جملك، فخذ جملك ذلك فهو مالك ‏\"‏‏.‏ قال شعبة عن مغيرة عن عامر عن جابر أفقرني رسول الله صلى الله عليه وسلم ظهره إلى المدينة‏.‏ وقال إسحاق عن جرير عن مغيرة فبعته على أن لي فقار ظهره حتى أبلغ المدينة‏.‏ وقال عطاء وغيره لك ظهره إلى المدينة، وقال محمد بن المنكدر عن جابر شرط ظهره إلى المدينة‏.‏ وقال زيد بن أسلم عن جابر ولك ظهره حتى ترجع‏.‏ وقال أبو الزبير عن جابر أفقرناك ظهره إلى المدينة‏.‏ وقال الأعمش عن سالم عن جابر تبلغ عليه إلى أهلك‏.‏ وقال عبيد الله وابن إسحاق عن وهب عن جابر اشتراه النبي صلى الله عليه وسلم بوقية‏.‏ وتابعه زيد بن أسلم عن جابر‏.‏ وقال ابن جريج عن عطاء وغيره عن جابر أخذته بأربعة دنانير‏.‏ وهذا يكون وقية على حساب الدينار بعشرة دراهم‏.‏ ولم يبين الثمن مغيرة عن الشعبي عن جابر، وابن المنكدر وأبو الزبير عن جابر‏.‏ وقال الأعمش عن سالم عن جابر وقية ذهب‏.‏ وقال أبو إسحاق عن سالم عن جابر بمائتى درهم‏.‏ وقال داود بن قيس عن عبيد الله بن مقسم عن جابر اشتراه بطريق تبوك، أحسبه قال بأربع أواق‏.‏ وقال أبو نضرة عن جابر اشتراه بعشرين دينارا‏.‏ وقول الشعبي بوقية أكثر‏.‏ الاشتراط أكثر وأصح عندي‏.‏ قاله أبو عبد الله‏.‏",
      "text_en": " Narrated Jabir:                     While I was riding a (slow) and tired camel, the Prophet passed by and beat it and prayed for Allah's Blessings for it. The camel became so fast as it had never been before. The Prophet then said, \"Sell it to me for one Uqiyya (of gold).\" I said, \"No.\" He again said, \"Sell it to me for one Uqiyya (of gold).\" I sold it and stipulated that I should ride it to my house. When we reached (Medina) I took that camel to the Prophet and he gave me its price. I returned home but he sent for me (and when I went to him) he said, \"I will not take your camel. Take your camel as a gift for you.\" (Various narrations are mentioned here with slight variations in expressions relating the condition that Jabir had the right to ride the sold camel up to Medina).",
      "chain": [
        "20348",
        "11338",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2780",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "وقال لي علي بن عبد الله حدثنا يحيى بن آدم، حدثنا ابن أبي زائدة، عن محمد بن أبي القاسم، عن عبد الملك بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  قال خرج رجل من بني سهم مع تميم الداري وعدي بن بداء فمات السهمي بأرض ليس بها مسلم، فلما قدما بتركته فقدوا جاما من فضة مخوصا من ذهب، فأحلفهما رسول الله صلى الله عليه وسلم، ثم وجد الجام بمكة فقالوا ابتعناه من تميم وعدي‏.‏ فقام رجلان من أوليائه، فحلفا لشهادتنا أحق من شهادتهما، وإن الجام لصاحبهم‏.‏ قال وفيهم نزلت هذه الآية ‏{‏يا أيها الذين آمنوا شهادة بينكم ‏إذا حضر أحدكم الموت}‏",
      "text_en": " Ibn 'Abbas (ra) said, \"A man from the tribe of Bani Sahm went out in the company of Tamim Ad-Dari and 'Adi bin Badda'. The man of Bani Sahm died in a land where there was no Muslim. When Tamim and 'Adi returned conveying the property of the deceased, they claimed that they had lost a silver bowl with gold engraving. Allah's Messenger () made them take an oath (to confirm their claim), and then the bowl was found in Makkah with some people who claimed that they had bought it from Tamim and 'Adu, Then two witnesses from the relatives of the deceased got up and swore that their witnesses were more valid than the witnesses of  'Adi and Tamim, and that the bowl belonged to their deceased fellow. So, this verse was revealed in connection with this case ; 'O you who believe! When death approached any of you ...',\" (V 5:                     106)",
      "chain": [
        "30026",
        "20364",
        "20366",
        "11338",
        "17"
      ]
    },
    {
      "hadith_no": "2852",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، حدثنا عروة البارقي، أن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والمغنم ‏\"‏‏.‏",
      "text_en": " Narrated `Urwa Al-Bariqi:                     The Prophet said, \"Good will remain (as a permanent quality) in the foreheads of horses (for Jihad) till the Day of Resurrection, for they bring about either a reward (in the Hereafter) or (war) booty (in this world).\"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "5176"
      ]
    },
    {
      "hadith_no": "3023",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يحيى بن آدم، حدثنا يحيى بن أبي زائدة، عن أبيه، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال بعث رسول الله صلى الله عليه وسلم رهطا من الأنصار إلى أبي رافع فدخل عليه عبد الله بن عتيك بيته ليلا، فقتله وهو نائم‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle sent a group of the Ansar to Abu Rafi`. `Abdullah bin Atik entered his house at night and killed him while he was sleeping.",
      "chain": [
        "30351",
        "20364",
        "20366",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3235",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني محمد بن يوسف، حدثنا أبو أسامة، حدثنا زكرياء بن أبي زائدة، عن ابن الأشوع، عن الشعبي، عن مسروق، قال قلت لعائشة  رضى الله عنها  فأين قوله ‏{‏ثم دنا فتدلى * فكان قاب قوسين أو أدنى‏}‏ قالت ذاك جبريل كان يأتيه في صورة الرجل، وإنه أتاه هذه المرة في صورته التي هي صورته، فسد الأفق‏.‏",
      "text_en": " Narrated Masruq:                     I asked Aisha \"What about His Statement:-- \"Then he (Gabriel) approached And came closer, And was at a distance Of but two bow-lengths Or (even) nearer?\" (53.8-9) She replied, \"It was Gabriel who used to come to the Prophet in the figure of a man, but on that occasion, he came in his actual and real figure and (he was so huge) that he covered the whole horizon.\"",
      "chain": [
        "30388",
        "20318",
        "11338",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "3621",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، قال حدثني عامر، قال حدثني جابر  رضى الله عنه  أن أباه، توفي وعليه دين، فأتيت النبي صلى الله عليه وسلم فقلت إن أبي ترك عليه دينا وليس عندي إلا ما يخرج نخله، ولا يبلغ ما يخرج سنين ما عليه، فانطلق معي لكى لا يفحش على الغرماء‏.‏ فمشى حول بيدر من بيادر التمر فدعا ثم آخر، ثم جلس عليه فقال ‏\"‏ انزعوه ‏\"‏‏.‏ فأوفاهم الذي لهم، وبقي مثل ما أعطاهم‏.‏",
      "text_en": " Narrated Jabir:                     My father had died in debt. So I came to the Prophet and said, \"My father (died) leaving unpaid debts, and I have nothing except the yield of his date palms; and their yield for many years will not cover his debts. So please come with me, so that the creditors may not misbehave with me.\" The Prophet went round one of the heaps of dates and invoked (Allah), and then did the same with another heap and sat on it and said, \"Measure (for them).\" He paid them their rights and what remained was as much as had been paid to them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "3666",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن فراس، عن عامر، عن مسروق، عن عائشة  رضى الله عنها  قالت أقبلت فاطمة تمشي، كأن مشيتها مشى النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ مرحبا بابنتي ‏\"‏‏.‏ ثم أجلسها عن يمينه أو عن شماله، ثم أسر إليها حديثا، فبكت فقلت لها لم تبكين ثم أسر إليها حديثا فضحكت فقلت ما رأيت كاليوم فرحا أقرب من حزن، فسألتها عما قال‏.‏   فقالت ما كنت لأفشي سر رسول الله صلى الله عليه وسلم حتى قبض النبي صلى الله عليه وسلم فسألتها فقالت أسر إلى ‏\"‏ إن جبريل كان يعارضني القرآن كل سنة مرة، وإنه عارضني العام مرتين، ولا أراه إلا حضر أجلي، وإنك أول أهل بيتي لحاقا بي ‏\"‏‏.‏ فبكيت فقال ‏\"‏ أما ترضين أن تكوني سيدة نساء أهل الجنة  أو نساء المؤمنين ‏\"‏‏.‏ فضحكت لذلك‏.‏",
      "text_en": " Narrated `Aisha:                     Once Fatima came walking and her gait resembled the gait of the Prophet . The Prophet said, \"Welcome, O my daughter!\" Then he made her sit on his right or on his left side, and then he told her a secret and she started weeping. I asked her, \"Why are you weeping?\" He again told her a secret and she started laughing. I said, \"I never saw happiness so near to sadness as I saw today.\" I asked her what the Prophet had told her. She said, \"I would never disclose the secret of Allah's Apostle .\" When the Prophet died, I asked her about it. She replied. \"The Prophet said.) 'Every year Gabriel used to revise the Qur'an with me once only, but this year he has done so twice. I think this portends my death, and you will be the first of my family to follow me.' So I started weeping. Then he said. 'Don't you like to be the mistress of all the ladies of Paradise or the mistress of all the lady believers? So I laughed for that.\"",
      "chain": [
        "20348",
        "11338",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4088",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا يحيى بن آدم، حدثنا ابن أبي زائدة، عن أبيه، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال بعث رسول الله صلى الله عليه وسلم رهطا إلى أبي رافع فدخل عليه عبد الله بن عتيك بيته ليلا وهو نائم فقتله‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle sent a group of persons to Abu Rafi`. `Abdullah bin Atik entered his house at night, while he was sleeping, and killed him.",
      "chain": [
        "30311",
        "20364",
        "20366",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4427",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، وإسحاق بن نصر، قالا حدثنا يحيى بن آدم، حدثنا ابن أبي زائدة، عن أبيه، عن أبي إسحاق، عن الأسود بن يزيد، عن أبي موسى  رضى الله عنه  قال قدمت أنا وأخي، من اليمن، فمكثنا حينا ما نرى ابن مسعود وأمه إلا من أهل البيت، من كثرة دخولهم ولزومهم له‏.‏",
      "text_en": " Narrated Abu Musa:                     My brother and I came from Yemen (to Medina) and remained for some time, thinking that Ibn Masud and his mother belonged to the family of the Prophet because of their frequent entrance (upon the Prophet) and their being attached to him.",
      "chain": [
        "30351",
        "30311",
        "20364",
        "20366",
        "11338",
        "11049",
        "11054",
        "41"
      ]
    },
    {
      "hadith_no": "4861",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني الحسن، حدثنا إسماعيل بن خليل، أخبرنا عبد الرحيم، عن زكرياء بن أبي زائدة، عن عامر، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إني أول من يرفع رأسه بعد النفخة الآخرة، فإذا أنا بموسى متعلق بالعرش فلا أدري أكذلك كان أم بعد النفخة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I will be the first to raise my head after the second blowing of the trumpet and will see Moses hanging the Throne, and I will not know whether he had been in that state all the time or after the blowing of the trumpet.\"",
      "chain": [
        "11016",
        "30186",
        "20334",
        "11338",
        "11052",
        "13"
      ]
    },
    {
      "hadith_no": "5207",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبيد الله بن موسى، عن زكرياء  هو ابن أبي زائدة  عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تسأل طلاق أختها لتستفرغ صحفتها، فإنما لها ما قدر لها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"It is not lawful for a woman (at the time of wedding) to ask for the divorce of her sister (i.e. the other wife of her would-be husband) in order to have everything for herself, for she will take only what has been written for her.\"",
      "chain": [
        "20340",
        "11338",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5533",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن عدي بن حاتم  رضى الله عنه  قال سألت النبي صلى الله عليه وسلم عن صيد المعراض قال ‏\"‏ ما أصاب بحده فكله، وما أصاب بعرضه فهو وقيذ ‏\"‏‏.‏ وسألته عن صيد الكلب فقال ‏\"‏ ما أمسك عليك فكل، فإن أخذ الكلب ذكاة، وإن وجدت مع كلبك أو كلابك كلبا غيره فخشيت أن يكون أخذه معه، وقد قتله، فلا تأكل، فإنما ذكرت اسم الله على كلبك ولم تذكره على غيره ‏\"‏‏.‏",
      "text_en": " Narrated Adi bin Hatim:                     I asked the Prophet about the game killed by a Mi'rad (i.e. a sharp-edged piece of wood or a piece of wood provided with a sharp piece of iron used for hunting). He said, \"If the game is killed with its sharp edge, eat of it, but if it is killed with its shaft, with a hit by its broad side then the game is (unlawful to eat) for it has been beaten to death.\" I asked him about the game killed by a trained hound. He said, \"If the hound catches the game for you, eat of it, for killing the game by the hound, is like its slaughtering. But if you see with your hound or hounds another dog, and you are afraid that it might have shared in hunting the game with your hound and killed it, then you should not eat of it, because you have mentioned Allah's name on (sending) your hound only, but you have not mentioned it on some other hound.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5859",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في سفر فقال ‏\"‏ أمعك ماء ‏\"‏‏.‏ قلت نعم‏.‏ فنزل عن راحلته، فمشى حتى توارى عني في سواد الليل، ثم جاء فأفرغت عليه الإداوة، فغسل وجهه ويديه، وعليه جبة من صوف، فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة، فغسل ذراعيه، ثم مسح برأسه، ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين، فمسح عليهما ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     One night I was with the Prophet on a journey. He asked (me), \"Have you got water with you?\" I replied, \"Yes\" So he got down from his she-camel and went away till he disappeared in the darkness of the night. Then he came back and I poured water for him from the pot (for the ablution). He washed his face and hands while he was wearing a woollen cloak (the sleeves of which were narrow), so he could not take his arms out of it. So he took them out from underneath the cloak. Then he washed his forearms and passed his wet hands over his head. Then I tried to take off his Khuffs (socks made from thick fabric or leather), but he said, \"Leave them, for I have performed ablution before putting them on.\" And so he passed his wet hands over them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "6079",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، قال سمعته يقول سمعت النعمان بن بشير، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ترى المؤمنين في تراحمهم وتوادهم وتعاطفهم كمثل الجسد إذا اشتكى عضوا تداعى له سائر جسده بالسهر والحمى ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     Allah's Apostle said, \"You see the believers as regards their being merciful among themselves and showing love among themselves and being kind, resembling one body, so that, if any part of the body is not well then the whole body shares the sleeplessness (insomnia) and fever with it.\"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "6326",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، قال سمعت عامرا، يقول حدثني أبو سلمة بن عبد الرحمن، أن عائشة  رضى الله عنها  حدثته أن النبي صلى الله عليه وسلم قال لها ‏\"‏ إن جبريل يقرئك السلام ‏\"‏‏.‏ قالت وعليه السلام ورحمة الله‏.‏",
      "text_en": " Narrated `Aisha:                     That the Prophet said to her, \"Gabriel sends Salam (greetings) to you.\" She replied, \"Wa 'alaihi-s- Salam Wa Rahmatu-l-lah.\" (Peace and Allah's Mercy be on him).",
      "chain": [
        "20348",
        "11338",
        "11052",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "6563",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، قال سمعت عبد الله بن عمرو، يقول قال النبي صلى الله عليه وسلم ‏\"‏ المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"A Muslim is the one who avoids harming Muslims with his tongue or his hands. And a Muhajir (an emigrant) is the one who gives up (abandons) all what Allah has forbidden.\"",
      "chain": [
        "20348",
        "11338",
        "11052",
        "29"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبو أسامة، حدثنا زكرياء، عن ابن أشوع، عن عامر، عن مسروق، قال قلت لعائشة فأين قوله ‏{‏ ثم دنا فتدلى * فكان قاب قوسين أو أدنى * فأوحى إلى عبده ما أوحى‏}‏ قالت إنما ذاك جبريل صلى الله عليه وسلم كان يأتيه في صورة الرجال وإنه أتاه في هذه المرة في صورته التي هي صورته فسد أفق السماء ‏.‏",
      "text_en": " Masruq reported:                      I said to 'A'isha: What about the words of Allah:\" Then he drew nigh and came down, so he was at a distance of two bows or closer still: so He revealed to His servant what He revealed\" (al-Qur'an, liii. 8-10)? She said: It implies Gabriel. He used to come to him (the Holy Prophet) in the shape of men; but he came at this time in his true form and blocked up the horizon of the sky.",
      "chain": [
        "30212",
        "20318",
        "11338",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا وكيع، عن زكرياء بن أبي زائدة، عن مصعب بن شيبة، عن طلق بن حبيب، عن عبد الله بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ عشر من الفطرة قص الشارب وإعفاء اللحية والسواك واستنشاق الماء وقص الأظفار وغسل البراجم ونتف الإبط وحلق العانة وانتقاص الماء ‏\"‏ ‏.‏ قال زكرياء قال مصعب ونسيت العاشرة إلا أن تكون المضمضة ‏.‏ زاد قتيبة قال وكيع انتقاص الماء يعني الاستنجاء ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be npon him) said: Ten are the acts according to fitra: clipping the moustache, letting the beard grow, using the tooth-stick, snuffing water in the nose, cutting the nails, washing the finger joints, plucking the hair under the armpits, shaving the pubes and cleaning one's private parts with water. The narrator said: I have forgotten the tenth, but it may have been rinsing the mouth.",
      "chain": [
        "30367",
        "20032",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو كريب، أخبرنا ابن أبي زائدة، عن أبيه، عن مصعب بن شيبة، في هذا الإسناد مثله غير أنه قال قال أبوه ونسيت العاشرة ‏.‏",
      "text_en": " This hadith has been narrated by Mus'ab b. Shaiba with the same chain of transmitters except for these words:                     \" His father said: I forgot the tenth one.\"",
      "chain": [
        "30216",
        "20366",
        "11338",
        "10658"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، قال أخبرني عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في مسير فقال لي ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ قلت نعم ‏.‏ فنزل عن راحلته فمشى حتى توارى في سواد الليل ثم جاء فأفرغت عليه من الإداوة فغسل وجهه وعليه جبة من صوف فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة فغسل ذراعيه ومسح برأسه ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما فإني أدخلتهما طاهرتين ‏\"‏ ‏.‏ ومسح عليهما ‏.‏",
      "text_en": " 'Urwa b. Mughira reported his father having said:                      I was one night with the Apostle of Allah (may peace be upon him) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، وسهل بن عثمان، وأبو كريب - واللفظ لأبي كريب - قال سهل حدثنا وقال الآخران، أخبرنا ابن أبي زائدة، عن أبيه، عن مصعب بن شيبة، عن مسافع بن عبد الله، عن عروة بن الزبير، عن عائشة، أن امرأة، قالت لرسول الله صلى الله عليه وسلم هل تغتسل المرأة إذا احتلمت وأبصرت الماء فقال ‏\"‏ نعم ‏\"‏ ‏.‏ فقالت لها عائشة تربت يداك وألت ‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعيها وهل يكون الشبه إلا من قبل ذلك إذا علا ماؤها ماء الرجل أشبه الولد أخواله وإذا علا ماء الرجل ماءها أشبه أعمامه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'A'isha that a woman came to the Messenger of Allah (may peace be upon him) and inquired:                      Should a woman wash herself when she sees a sexual dream and sees (the marks) of liquid? He (the Holy Prophet) said: Yes. 'A'isha said to her: May your hand be covered with dust and injured. She narrated: The Messenger of Allah (may peace be upon him) said: Leave her alone. In what way does the child resemble her but for the fact that when the genes contributed by woman prevail upon those of man, the child resembles the maternal family, and when the genes of man prevail upon those of woman the child resembles the paternal family.",
      "chain": [
        "30309",
        "30546",
        "399",
        "20366",
        "11338",
        "10658",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء وإبراهيم بن موسى قالا حدثنا ابن أبي زائدة، عن أبيه، عن خالد بن سلمة، عن البهي، عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يذكر الله على كل أحيانه ‏.‏",
      "text_en": " 'A'isha said:                      The Apostle of Allah (may peace be upon him) used to remember Allah at all moments.",
      "chain": [
        "20366",
        "11338",
        "10680",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا زكرياء بن أبي زائدة، حدثنا عبد الملك بن عمير، عن أبي الأحوص، قال قال عبد الله لقد رأيتنا وما يتخلف عن الصلاة إلا منافق قد علم نفاقه أو مريض إن كان المريض ليمشي بين رجلين حتى يأتي الصلاة - وقال - إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى وإن من سنن الهدى الصلاة في المسجد الذي يؤذن فيه ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      I have seen the time when no one stayed away from prayer except a hypocrite, whose hypocrisy was well known, or a sick man, but it a sick man could walk between two persons (i. e. with the help of two persons with one on each side) he would come to prayer. And (further) said: The Messenger of Allah (may peace be upon him) taught us the paths of right guidance. among which is prayer in the mosque in which the Adzan is called.",
      "chain": [
        "30201",
        "20352",
        "11338",
        "11368",
        "20327"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سماك بن حرب، عن جابر بن سمرة، قال كنت أصلي مع النبي صلى الله عليه وسلم الصلوات فكانت صلاته قصدا وخطبته قصدا ‏.‏ وفي رواية أبي بكر زكرياء عن سماك.",
      "text_en": " Jabir b. Samura reported:                      I used to observe prayer with the Apostle of Allah (may peace be upon him) and his prayer was of moderate length and his sermon too was of moderate length.",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2941",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن زكرياء بن أبي زائدة، حدثنا عبد الرحمن بن الأصبهاني، حدثني عبد الله بن معقل، حدثني كعب بن عجرة، - رضى الله عنه - أنه خرج مع النبي صلى الله عليه وسلم محرما فقمل رأسه ولحيته فبلغ ذلك النبي صلى الله عليه وسلم فأرسل إليه فدعا الحلاق فحلق رأسه ثم قال له ‏\"‏ هل عندك نسك ‏\"‏ ‏.‏ قال ما أقدر عليه ‏.‏ فأمره أن يصوم ثلاثة أيام أو يطعم ستة مساكين لكل مسكينين صاع فأنزل الله عز وجل فيه خاصة ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه‏}‏ ثم كانت للمسلمين عامة ‏.‏",
      "text_en": " Ka'b b. Ujra (Allah be pleased with him) reported that he went out with the Apostle of Allah (may peace be upon him) in the state of Ihram, and his (Ka'b's) head and beard were infested with lice. This was conveyed to the Apostle of Allah (may peace be upon him). He sent for him (Ka'b) and called a barber (who) shaved his head. He (the Holy Prophet) said. Is there any sacrificial animal with you? He (Kalb) said:                      I cannot afford it. He then commanded him to observe fasts for three days or feed six needy persons, one sa' for every two needy persons. And Allah the Exalted and Majestic revealed this (verse) particular with regard to him:\" So whosoever among you is sick and has an ailment of the head..\" ; then (its application) became general for the Muslims.",
      "chain": [
        "30201",
        "20331",
        "11338",
        "11364",
        "18580",
        "4052"
      ]
    },
    {
      "hadith_no": "3992",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، كلاهما عن زكرياء، قال ابن أبي خلف حدثنا زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، حدثنا  أبو الوليد المكي، وهو جالس عند عطاء بن أبي رباح عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة والمخابرة وأن تشترى النخل حتى تشقه - والإشقاه أن يحمر أو يصفر أو يؤكل منه شىء - والمحاقلة أن يباع الحقل بكيل من الطعام معلوم والمزابنة أن يباع النخل بأوساق من التمر والمخابرة الثلث والربع وأشباه ذلك ‏.‏ قال زيد قلت لعطاء بن أبي رباح أسمعت جابر بن عبد الله يذكر هذا عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muhaqala, and Muzabana, and Mukhabara, and the buying of date-palm until its fruit is ripened (ripening means that its colour becomes red or yellow, or it is fit for being eaten). And Muhaqala implies that crops in the field are bought for grains according to a customary measure. Muzabana implies that date-palm should be sold for dry dates by measuring them with wisqs, and al-Mukhabara is (a share), maybe one-third or one-fourth (in produce) or something like it. Zaid (one of the narrators) said to Ata' b. Abu Rabah (the other narrator):                      Did You bear Jabir b. Abdullah (Allah be pleased with them) making a mention of it that he had heard it directly from Allah's Messenger (may peace be upon him)? He said: Yes.",
      "chain": [
        "30123",
        "11338",
        "30464",
        "11201",
        "11340",
        "20296",
        "34"
      ]
    },
    {
      "hadith_no": "4178",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير الهمداني، حدثنا أبي، حدثنا زكرياء، عن الشعبي، عن النعمان بن بشير، قال سمعته يقول سمعت رسول الله صلى الله عليه وسلم يقول وأهوى النعمان بإصبعيه إلى أذنيه ‏\"‏ إن الحلال بين وإن الحرام بين وبينهما مشتبهات لا يعلمهن كثير من الناس فمن اتقى الشبهات استبرأ لدينه وعرضه ومن وقع في الشبهات وقع في الحرام كالراعي يرعى حول الحمى يوشك أن يرتع فيه ألا وإن لكل ملك حمى ألا وإن حمى الله محارمه ألا وإن في الجسد مضغة إذا صلحت صلح الجسد كله وإذا فسدت فسد الجسد كله ألا وهي القلب ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon himn) as having said this (and Nu'man) pointed towards his ears with his fingers): What is lawful is evident and what is unlawful is evident, and in between them are the things doubtful which many people do not know. So he who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things God his declaced unlawful are His preserves. Beware, in the body there is a piece of flesh; if it is sound, the whole body is sound and if it is corrupt the whole body is corrupt, and hearken it is the heart.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4182",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، حدثني جابر بن عبد الله، أنه كان يسير على جمل له قد أعيا فأراد أن يسيبه قال فلحقني النبي صلى الله عليه وسلم فدعا لي وضربه فسار سيرا لم يسر مثله قال ‏\"‏ بعنيه بوقية ‏\"‏ ‏.‏ قلت لا ‏.‏ ثم قال ‏\"‏ بعنيه ‏\"‏ ‏.‏ فبعته بوقية واستثنيت عليه حملانه إلى أهلي فلما بلغت أتيته بالجمل فنقدني ثمنه ثم رجعت فأرسل في أثري فقال ‏\"‏ أتراني ماكستك لآخذ جملك خذ جملك ودراهمك فهو لك ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported that he was travelling on his camel which had grown jaded, and he decided to let it off. When Allah's Apostle (may peace be upon him) met him and prayed for him and struck it, so it trotted as it had never trotted before. He said:                      Sell it to me for an 'uqaya. I said: No. He again said: Sell it to me. So I sold it to him for an 'uqaya, but made the stipulation that I should be allowed to ride back to my family. Then when I came to (my place) I took the camel to him and he paid me its price in ready money. I then went back and he sent: (someone) behind me (and as I came) he said: Do you see that I asked you to reduce price for buying your camel. Take your camel and your coins; these are yours.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثناه علي بن خشرم، أخبرنا عيسى، - يعني ابن يونس - عن زكرياء، عن عامر، حدثني جابر بن عبد الله، بمثل حديث ابن نمير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir through another chain of transmitters.",
      "chain": [
        "30556",
        "20347",
        "11338",
        "11052"
      ]
    },
    {
      "hadith_no": "4239",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى، - وهو ابن يونس - حدثنا زكرياء، عن أبي إسحاق، عن البراء، أن آخر، سورة أنزلت تامة سورة التوبة وأن آخر آية أنزلت آية الكلالة ‏.‏",
      "text_en": " Abu Ishaq said that he heard al-Bara' b. 'Azib (Allah be pleased with him) say:                      The last complete sura revealed (in the Holy Qur'an) is Sura Tauba (i e. al-Bara'at, ix.), and the last verse revealed is that pertaining to Kalala.",
      "chain": [
        "30021",
        "20347",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4716",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن جناب المصيصي، حدثنا عيسى بن يونس، عن زكرياء، عن أبي، إسحاق قال جاء رجل إلى البراء فقال أكنتم وليتم يوم حنين يا أبا عمارة فقال أشهد على نبي الله صلى الله عليه وسلم ما ولى ولكنه انطلق أخفاء من الناس وحسر إلى هذا الحى من هوازن وهم قوم رماة فرموهم برشق من نبل كأنها رجل من جراد فانكشفوا فأقبل القوم إلى رسول الله صلى الله عليه وسلم وأبو سفيان بن الحارث يقود به بغلته فنزل ودعا واستنصر وهو يقول ‏\"‏ أنا النبي لا كذب أنا ابن عبد المطلب اللهم نزل نصرك ‏\"‏ ‏.‏ قال البراء كنا والله إذا احمر البأس نتقي به وإن الشجاع منا للذي يحاذي به ‏.‏ يعني النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated (through a different chain of transmitters) by Abu Ishiq that a person said to Bara' (b. 'Azib):                      Abu Umara, did you flee on the Day of Hunain? He replied: The Messenger of Allah (may peace be upon him) did not retreat. (What actually happened was that some hasty young men who were either inadequately armed or were unarmed met a group of men from Banu Hawazin and Banu Nadir who happened to be (excellent) archers. The latter shot at them a volley of arrows that did not miss. The people turned to the Messenger of Allah (may peace be upon him). Abu Sufyan b. Harith was leading his mule. So he got down, prayed and invoked God's help. He said: I am the Prophet. This is no untruth. I am the son of Abd al-Muttalib. O God, descend Thy help. Bara' continued: When the battle grew fierce. we, by God. would seek protection by his side, and the bravest among us was he who confronted the onslaught and it was the Holy Prophet (may peace be upon him).",
      "chain": [
        "30531",
        "20347",
        "11338",
        "11049"
      ]
    },
    {
      "hadith_no": "4727",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ووكيع، عن زكرياء، عن الشعبي، قال أخبرني عبد الله بن مطيع، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقول يوم فتح مكة ‏\"‏ لا يقتل قرشي صبرا بعد هذا اليوم إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. Muti' who heard from his father and said:                      I heard the Holy Prophet (may peace be upon him) say on the day of the Conquest of Mecca: No Quraishite will be killed hound hand and foot from this day until the Day of judgment.",
      "chain": [
        "30201",
        "20345",
        "20032",
        "11338",
        "11052",
        "30509"
      ]
    },
    {
      "hadith_no": "4731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وأحمد بن جناب المصيصي، جميعا عن عيسى بن يونس، - واللفظ لإسحاق - أخبرنا عيسى بن يونس، أخبرنا زكرياء، عن أبي إسحاق، عن البراء، قال لما أحصر النبي صلى الله عليه وسلم عند البيت صالحه أهل مكة على أن يدخلها فيقيم بها ثلاثا ولا يدخلها إلا بجلبان السلاح السيف وقرابه ‏.‏ ولا يخرج بأحد معه من أهلها ولا يمنع أحدا يمكث بها ممن كان معه ‏.‏ قال لعلي ‏\"‏ اكتب الشرط بيننا بسم الله الرحمن الرحيم هذا ما قاضى عليه محمد رسول الله ‏\"‏ ‏.‏ فقال له المشركون لو نعلم أنك رسول الله تابعناك ولكن اكتب محمد بن عبد الله ‏.‏ فأمر عليا أن يمحاها فقال علي لا والله لا أمحاها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرني مكانها ‏\"‏ ‏.‏ فأراه مكانها فمحاها وكتب ‏\"‏ ابن عبد الله ‏\"‏ ‏.‏ فأقام بها ثلاثة أيام فلما أن كان يوم الثالث قالوا لعلي هذا آخر يوم من شرط صاحبك فأمره فليخرج ‏.‏ فأخبره بذلك فقال ‏\"‏ نعم ‏\"‏ ‏.‏ فخرج ‏.‏ وقال ابن جناب في روايته مكان تابعناك بايعناك ‏.‏",
      "text_en": " It has been narrated on the authority of Bara' who said:                      When the Prophet (may peace be upon him) was checked from going to the Ka'ba, the people of Mecca made peace with him'on the condition that he would (be allowed to) enter Mecca (next year) and stay there for three days, that he would not enter (the city) except with swords in their sheaths and arms encased in their covers, that he would not take eway with him anyone from its dwellers, nor would he prevent anyone from those with him to stay on in Mecca (if he so desired). He said to 'Ali: Write down the terms settled between us. (So 'Ali wrote): In the name of Allah, most Gracious and most Merciful. This is what Muhammad, the Messenger of Allah, has settled (with the Meccans), The polytheists said to him: If we knew that thou art the Messenger of of Allah, we would follow you. But write: Muhammad b. 'Abdullah. So he told 'Ali to strike out these words. 'Ali said: No, by Allah, I will not strike them out. The Messenger of Allah (may Peace be upon him) said: Show me their place (on the parchment). So he ('Ali) showed him their place and he (the Holy Prophet) struck them out; and 'Ali wrote: Ibn 'Abdullah. (According to the terms of the treaty, next year) the Holy Prophet (may peace be upon him) stayed there for three days When it was the third day, they said to 'Ali: This is the last day according to the terms of your companion. So tell him to leave. 'Ali informed the Prophet (may peace be upon him) accordingly. He said: Yes, and left (the city). Ibn Janab in his version of the tradition used:\" we would swear allegiance to you\" instead of\" we would follow you\".",
      "chain": [
        "30021",
        "20347",
        "20347",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4750",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عبد الله بن عمر بن محمد بن أبان الجعفي، حدثنا عبد الرحيم، - يعني ابن سليمان - عن زكرياء، عن أبي إسحاق، عن عمرو بن ميمون الأودي، عن ابن مسعود، قال بينما رسول الله صلى الله عليه وسلم يصلي عند البيت وأبو جهل وأصحاب له جلوس وقد نحرت جزور بالأمس فقال أبو جهل أيكم يقوم إلى سلا جزور بني فلان فيأخذه فيضعه في كتفى محمد إذا سجد فانبعث أشقى القوم فأخذه فلما سجد النبي صلى الله عليه وسلم وضعه بين كتفيه قال فاستضحكوا وجعل بعضهم يميل على بعض وأنا قائم أنظر ‏.‏ لو كانت لي منعة طرحته عن ظهر رسول الله صلى الله عليه وسلم والنبي صلى الله عليه وسلم ساجد ما يرفع رأسه حتى انطلق إنسان فأخبر فاطمة فجاءت وهي جويرية فطرحته عنه ‏.‏ ثم أقبلت عليهم تشتمهم فلما قضى النبي صلى الله عليه وسلم صلاته رفع صوته ثم دعا عليهم وكان إذا دعا دعا ثلاثا ‏.‏ وإذا سأل سأل ثلاثا ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاث مرات فلما سمعوا صوته ذهب عنهم الضحك وخافوا دعوته ثم قال ‏\"‏ اللهم عليك بأبي جهل بن هشام وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عقبة وأمية بن خلف وعقبة بن أبي معيط ‏\"‏ ‏.‏ وذكر السابع ولم أحفظه فوالذي بعث محمدا صلى الله عليه وسلم بالحق لقد رأيت الذين سمى صرعى يوم بدر ثم سحبوا إلى القليب قليب بدر ‏.‏ قال أبو إسحاق الوليد بن عقبة غلط في هذا الحديث ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Mas'ud who said:                      While the Messenger of Allah (may peace be upon him) was saying his prayer near the Ka'ba and Abu Jahl with his companions was sitting (near by), Abu Jahl said, referring to the she-camel that had been slaughtered the previous day: Who will rise to fetch the foetus of the she-camel of so and so, and place it between the shoulders of Muhammad when he goes down in prostration (a posture in prayer). The one most accursed among the people got up, brought the foetus and, when the Prophet (may peace be upon him) went down in prostration, placed it between his shoulders. Then they laughed at him and some of them leaned upon the others with laughter. And I stood looking. If I had the power, I would have thrown it away from the back of the Messenger of Allah (may peace be upon him). The Prophet (may peace be upon him) had bent down his head in prostration and did not raise it, until a man went (to his house) and informed (his daughter) Fatima, who was a young girl (at that time) (about this ugly incident). She came and removed (the filthy thing) from him. Then she turned towards them rebuking them (the mischief-mongers). When the Prophet (may peace be upon him) had finished his prayer, he invoked God's imprecations upon them in a loud voice. When he prayed, he prayed thrice, and when he asked for God's blessings, he asked thrice. Then he said thrice: O Allah, it is for Thee to deal with the Quraish. When they heard his voice, laughter vanished from them and they feared his malediction. Then he said: O God, it is for Thee to deal with Abu Jahl b. Hisham, 'Utba b. Rabi'a, Shaiba b. Rabi'a. Walid b. Uqba, Umayya b. Khalaf, Uqba b. Abu Mu'ait (and he mentioned the name of the seventh person. which I did not remember). By One Who sent Muhammad with truth, I saw (all) those he had named lying slain on the Day of Badr. Their dead bodies were dragged to be thrown into a pit near the battlefield. Abu Ishiq had said that the name of Walid b. 'Uqba has been wrongly mentioned in this tradition.",
      "chain": [
        "20334",
        "11338",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "4797",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا زهير بن حرب، حدثنا روح بن عبادة، حدثنا زكرياء، أخبرنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول غزوت مع رسول الله صلى الله عليه وسلم تسع عشرة غزوة - قال جابر - لم أشهد بدرا ولا أحدا منعني أبي فلما قتل عبد الله يوم أحد لم أتخلف عن رسول الله صلى الله عليه وسلم في غزوة قط ‏.‏",
      "text_en": " It has been reported on the authority of Abu Zubair who heard Jabir b. Abdullah say:                      I fought in the company of the Messenger of Allah (may peace be upon him) nineteen battles. Jabir said: I did not participate in the Battle of Badr and the Battle of Uhud. My father prevented me (from participating in these battles as my age was tender). After 'Abdullah (my father) was killed on the Day of Ubud, I never lagged behind the Messenger of Allah (may peace be upon him) and joined every battle (he fought).",
      "chain": [
        "30022",
        "20229",
        "11338",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4957",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، عن  عروة البارقي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والمغنم ‏\"‏ ‏.‏",
      "text_en": " The same tradition has been narrated on the authority of Urwat al-Bariqi who said that the Prophet (may peace be upon him) said:                      Great good is attached to the forelock of the horses until the Day of Judgment.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "5176"
      ]
    },
    {
      "hadith_no": "5023",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن زكرياء، عن أبي إسحاق، عن البراء، قال جاء رجل من بني النبيت إلى النبي صلى الله عليه وسلم ح وحدثنا أحمد بن جناب المصيصي حدثنا عيسى - يعني ابن يونس - عن زكرياء عن أبي إسحاق عن البراء قال جاء رجل من بني النبيت - قبيل من الأنصار - فقال أشهد أن لا إله إلا الله وأنك عبده ورسوله ‏.‏ ثم تقدم فقاتل حتى قتل فقال النبي صلى الله عليه وسلم ‏\"‏ عمل هذا يسيرا وأجر كثيرا ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Bara! ' who stated:                      A man from Banu Nabit (one of the Ansar tribes) came to the Holy Prophet (may peace be upon him) and said: I testify that there is no god except Allah and that thou art His bondman and Messenger. Then he went forward and fought until he was killed. The Holy Prophet (may peace be upon him) said: He has done a little but shall be given a great reward.",
      "chain": [
        "30201",
        "20318",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "5086",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، عن  عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن صيد المعراض فقال ‏\"‏ ما أصاب بحده فكله وما أصاب بعرضه فهو وقيذ ‏\"‏ ‏.‏ وسألته عن صيد الكلب فقال ‏\"‏ ما أمسك عليك ولم يأكل منه فكله فإن ذكاته أخذه فإن وجدت عنده كلبا آخر فخشيت أن يكون أخذه معه وقد قتله فلا تأكل إنما ذكرت اسم الله على كلبك ولم تذكره على غيره ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      I asked Allah's Messenger (may peace be upon him) about hunting the game with the help of Mi'rad, whereupon he said: If it strikes (the game) with its point, then eat it, but if it strikes flat, that is (the game is) beaten (into death), (then do not eat that) 'Adi further said: I asked him about hunting with the help of a dog, whereupon he said: If that (the dog) catches it (the game) for you and does not eat out of that, then you eat (the game) for Dhakat (slaughtering) of that is its being caught by it (by the dog). But if you find another dog besides it, and you fear that that dog (the second one) had caught it (the game) along with that (your dog) and killed it. then don't eat; for you recited the name of Allah on your dog and did not recite that on the other one (which joined your dog incidentally).",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5087",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا زكرياء بن أبي، زائدة بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zakariya b. Abu Za'ida with the same chain of transmitters.",
      "chain": [
        "30123",
        "20347",
        "11338"
      ]
    },
    {
      "hadith_no": "5184",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا  أبي، حدثنا زكرياء، عن فراس، عن عامر، عن البراء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاتنا ووجه قبلتنا ونسك نسكنا فلا يذبح حتى يصلي ‏\"‏ ‏.‏ فقال خالي يا رسول الله قد نسكت عن ابن لي ‏.‏ فقال ‏\"‏ ذاك شىء عجلته لأهلك ‏\"‏ ‏.‏ فقال إن عندي شاة خير من شاتين قال ‏\"‏ ضح بها فإنها خير نسيكة ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' reported Allah's Messenger (may peace be upon him) having said:                      He who observes prayer like our prayer and turns his face towards our Qibla (in prayer) and who offers sacrifices (of animals) as we do, he must not slaughter the (animal as a sacrifice) until he has completed the prayer. Thereupon my maternal uncle said: Messenger of Allah, I have sacrificed the animal on behalf of my son. The Messenger of Allah (may peace be upon him) said: This is the thing in which you have made haste for your family. He said: I have a goat with me better than two goats. Thereupon he said: Sacrifice it for that is the best.",
      "chain": [
        "30201",
        "20331",
        "30212",
        "20331",
        "11338",
        "11385",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "6154",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سعيد، - وهو ابن أبي بردة - عن أنس، قال خدمت رسول الله صلى الله عليه وسلم تسع سنين فما أعلمه قال لي قط لم فعلت كذا وكذا ولا عاب على شيئا قط ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      I served the Messenger of Allah (may peace be upon him) for nine years, and I do not know (of any instance) when he said to me: Why you have done this and that, and he never found fault with me in anything.",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "11345",
        "19"
      ]
    },
    {
      "hadith_no": "6414",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واللفظ لأبي بكر - قالا حدثنا محمد بن بشر، عن زكرياء، عن مصعب بن شيبة، عن صفية بنت شيبة، قالت قالت عائشة خرج النبي صلى الله عليه وسلم غداة وعليه مرط مرحل من شعر أسود فجاء الحسن بن علي فأدخله ثم جاء الحسين فدخل معه ثم جاءت فاطمة فأدخلها ثم جاء علي فأدخله ثم قال ‏{‏ إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا‏}‏",
      "text_en": " 'A'isha reported that Allah's Apostle (may peace be upon him) went out one norning wearing a striped cloak of the black camel's hair that there came Hasan b. 'Ali. He wrapped hitn under it, then came Husain and he wrapped him under it along with the other one (Hasan). Then came Fatima and he took her under it, then came 'Ali and he also took him under it and then said:                      Allah only desires to take away any uncleanliness from you, O people of the household, and purify you (thorough purifying)",
      "chain": [
        "30201",
        "20352",
        "11338",
        "10658",
        "2802"
      ]
    }
  ],
  "total_hadiths": 123
}