{
  "id": "11339",
  "name": "Ziyad bin 'Alaqa زياد بن علاقة",
  "full_name": "Ziyad bin 'Alaqa زياد بن علاقة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "35",
      "date_gregorian": "NA",
      "date_display": [
        "35 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "135",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tha'labi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5239",
      "name": "Qutba bin Malik al-Tha'labi ( قطبة بن مالك الثعلبي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4000",
      "name": "Usama bin Sharek al-Tha'labi ( أسامة بن شريك الثعلبي العامري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4057",
      "name": "Jarir bin 'Abdullah al-Bajli ( جرير بن عبد الله البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5196",
      "name": "'Ammarah bin Ruwaybah ( عمارة بن رويبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "58",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا أبو عوانة، عن زياد بن علاقة، قال سمعت جرير بن عبد الله، يقول يوم مات المغيرة بن شعبة قام فحمد الله وأثنى عليه وقال عليكم باتقاء الله وحده لا شريك له، والوقار والسكينة حتى يأتيكم أمير، فإنما يأتيكم الآن، ثم قال استعفوا لأميركم، فإنه كان يحب العفو‏.‏ ثم قال أما بعد، فإني أتيت النبي صلى الله عليه وسلم قلت أبايعك على الإسلام‏.‏ فشرط على والنصح لكل مسلم‏.‏ فبايعته على هذا، ورب هذا المسجد إني لناصح لكم‏.‏ ثم استغفر ونزل‏.‏",
      "text_en": "      Narrated Ziyad bin'Ilaqa:                          I heard Jarir bin 'Abdullah (Praising Allah). On the day when      Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and      thanked and praised Allah and said, \"Be afraid of Allah alone Who has      none along with Him to be worshipped.(You should) be calm and quiet      till the (new) chief comes to you and he will come to you soon. Ask      Allah's forgiveness for your (late) chief because he himself loved to      forgive others.\" Jarir added, \"Amma badu (now then), I went to the      Prophet and said, 'I give my pledge of allegiance to you for Islam.\"      The Prophet conditioned (my pledge) for me to be sincere and true to      every Muslim so I gave my pledge to him for this. By the Lord of this      mosque! I am sincere and true to you (Muslims). Then Jarir asked for      Allah's forgiveness and came down (from the pulpit).",
      "chain": [
        "20283",
        "20469",
        "11339",
        "4057"
      ]
    },
    {
      "hadith_no": "1043",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا شيبان أبو معاوية، عن زياد بن علاقة، عن المغيرة بن شعبة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم، فقال الناس كسفت الشمس لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتم فصلوا وادعوا الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     \"The sun eclipsed in the lifetime of Allah's Apostle on the day when (his son) Ibrahim died. So the people said that the sun had eclipsed because of the death of Ibrahim. Allah's Apostle said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"",
      "chain": [
        "30351",
        "20390",
        "20240",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1060",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، قال حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول انكسفت الشمس يوم مات إبراهيم، فقال الناس انكسفت لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتموهما فادعوا الله وصلوا حتى ينجلي ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the death of Ibrahim (the son of the Prophet). Allah's Apostle said, \"The sun and the moon are two signs amongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see them, invoke Allah and pray till the eclipse is clear.\"",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا مسعر، عن زياد، قال سمعت المغيرة  رضى الله عنه  يقول إن كان النبي صلى الله عليه وسلم ليقوم ليصلي حتى ترم قدماه أو ساقاه، فيقال له فيقول ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet used to stand (in the prayer) or pray till both his feet or legs swelled. He was asked why (he offered such an unbearable prayer) and he said, \"should I not be a thankful slave.\"",
      "chain": [
        "20348",
        "20359",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2151",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا المكي، أخبرنا ابن جريج، قال أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اشترى غنما مصراة فاحتلبها، فإن رضيها أمسكها، وإن سخطها ففي حلبتها صاع من تمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever buys a sheep which has been kept unmilked for a long period, and milks it, can keep it if he is satisfied, and if he is not satisfied, he can return it, but he should pay one Sa of dates for the milk.\"",
      "chain": [
        "11220",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "2714",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن زياد بن علاقة، قال سمعت جريرا  رضى الله عنه  يقول بايعت رسول الله صلى الله عليه وسلم فاشترط على والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jarir:                     When I gave the pledge of allegiance to Allah's Apostle and he stipulated that I should give good advice to every Muslim.",
      "chain": [
        "20348",
        "20012",
        "11339",
        "4057"
      ]
    },
    {
      "hadith_no": "4885",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا زياد، أنه سمع المغيرة، يقول قام النبي صلى الله عليه وسلم حتى تورمت قدماه فقيل له غفر الله لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet used to offer night prayers till his feet became swollen. Somebody said, to him,\" \"Allah has forgiven you, your faults of the past and those to follow.\" On that, he said, \"Shouldn't I be a thankful slave of Allah)?\"",
      "chain": [
        "30343",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "6270",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا زائدة، حدثنا زياد بن علاقة، سمعت المغيرة بن شعبة، قال انكسفت الشمس يوم مات إبراهيم‏.‏ رواه أبو بكرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-Mughira bin Shuba:                     Solar eclipse occurred on the day of Ibrahim's death (the Prophet's son).",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166",
        "3229"
      ]
    },
    {
      "hadith_no": "6304",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد، أخبرنا مخلد، أخبرنا ابن جريج، قال أخبرني زياد، أنه سمع ثابتا، مولى عبد الرحمن بن زيد أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الراكب على الماشي، والماشي على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The riding one should greet the walking one, and the walking one should greet the sitting one, and the small number of persons should greet the large number of persons.\"",
      "chain": [
        "30213",
        "20462",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "6305",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا روح بن عبادة، حدثنا ابن جريج، قال أخبرني زياد، أن ثابتا، أخبره  وهو، مولى عبد الرحمن بن زيد  عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ يسلم الراكب على الماشي والماشي على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"The riding person should greet the walking one,     and the walking one should greet the sitting one, and the small number     of persons should greet the large number of persons.\"",
      "chain": [
        "30123",
        "20229",
        "11070",
        "11339",
        "11269",
        "13"
      ]
    },
    {
      "hadith_no": "6549",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مسعر، حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول كان النبي صلى الله عليه وسلم يصلي حتى ترم  أو تنتفخ  قدماه فيقال له، فيقول ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet used to pray so much that his feet used to become edematous or swollen, and when he was asked as to why he prays so much, he would say, \"Shall I not be a thankful slave (to Allah)?\"",
      "chain": [
        "20191",
        "20359",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "209",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير قالوا حدثنا سفيان، عن زياد بن علاقة، سمع جرير بن عبد الله، يقول بايعت النبي صلى الله عليه وسلم على النصح لكل مسلم ‏.‏",
      "text_en": " Sufyan narrated on the authority of Ziyad b. 'Ilaqa that he heard Jarir b. 'Abdullah saying:                      I pledged allegiance to the Apostle of Allah may peace and blessings be upon him) on sincerity and well-wishing for every Muslim.",
      "chain": [
        "30201",
        "30022",
        "30212",
        "20005",
        "11339",
        "4057"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو كامل الجحدري، فضيل بن حسين حدثنا أبو عوانة، عن زياد بن علاقة، عن قطبة بن مالك، قال صليت وصلى بنا رسول الله صلى الله عليه وسلم فقرأ ‏{‏ ق والقرآن المجيد‏}‏ حتى قرأ ‏{‏ والنخل باسقات‏}‏ قال فجعلت أرددها ولا أدري ما قال ‏.‏",
      "text_en": " Qutba b. Malik reported:                      I said prayer and the Messenger of Allah (may peace be upon him) led it and he recited\" Qaf. (I.). By the Glorious Qur'an,\" till he recited\" and the tall palm trees\" (l. 10). I wanted to repeat it but I could not follow its significance.",
      "chain": [
        "30559",
        "20469",
        "11339"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، وابن، عيينة ح وحدثني زهير بن حرب، حدثنا ابن عيينة، عن زياد بن علاقة، عن قطبة بن مالك، سمع النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ والنخل باسقات لها طلع نضيد‏}‏",
      "text_en": " Qutba b. Malik reported that he had heard the Messenger of Allah (may peace be upon him) reciting in the morning prayer this:                     \" And the tall palm trees having flower spikes piled one above another\" (l. 10).",
      "chain": [
        "30201",
        "20587",
        "20005",
        "30022",
        "20005",
        "11339"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن زياد بن علاقة، عن عمه، أنه صلى مع النبي صلى الله عليه وسلم الصبح فقرأ في أول ركعة ‏{‏ والنخل باسقات لها طلع نضيد‏}‏ وربما قال ‏{‏ ق‏}‏ ‏.‏",
      "text_en": " Ziyad b. 'Ilaqa reported it on the authority of his uncle that he said the morning prayer with the Apostle of Allah (may peace be upon him) and he recited in the first rak'ah:                     \" And the tall palm trees having flower spikes piled one above another (l. 10) or perhaps Sarah Qaf.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11339"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا مصعب، - وهو ابن المقدام - حدثنا زائدة، حدثنا زياد بن علاقة، - وفي رواية أبي بكر قال قال زياد بن علاقة - سمعت المغيرة بن شعبة، يقول انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا ينكسفان لموت أحد ولا لحياته فإذا رأيتموهما فادعوا الله وصلوا حتى ينكشف ‏\"‏ ‏.‏",
      "text_en": "  Ziyad b. 'Ilaqa reported:                      I heard Mughira b. Shu'ba saying that the sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him) on the day when Ibrahim died. Upon this the Messenger of Allah (may peace be upon him) said: Verily the sun and the moon are the two signs among the signs of Allah. They do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see them, supplicate Allah, and observe prayer till it is over.",
      "chain": [
        "30201",
        "30212",
        "20608",
        "20320",
        "11339",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2639",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبل في شهر الصوم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that the Messenger of Allah (may peace be upon him) used to kiss her during the month of fasting.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا أبو بكر النهشلي، حدثنا زياد، بن علاقة عن عمرو بن ميمون، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يقبل في رمضان وهو صائم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) kissed (his wives) during Ramadan while observing fast.",
      "chain": [
        "30514",
        "20214",
        "20619",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "4855",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا مكي بن إبراهيم، حدثنا ابن جريج، عن زياد، عن ابن شهاب، أن أبا سلمة بن عبد الرحمن، أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
      "chain": [
        "38487",
        "20202",
        "11070",
        "11339",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4903",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أحمد بن خراش، حدثنا حبان، حدثنا أبو عوانة، ح وحدثني القاسم بن، زكرياء حدثنا عبيد الله بن موسى، عن شيبان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا المصعب بن المقدام الخثعمي، حدثنا إسرائيل، ح وحدثني حجاج، حدثنا عارم بن الفضل، حدثنا حماد بن زيد، حدثنا عبد الله بن المختار، ورجل، سماه كلهم عن زياد بن علاقة، عن عرفجة، عن النبي صلى الله عليه وسلم بمثله غير أن في حديثهم جميعا ‏\"‏ فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " In another version of the tradition narrated on the same authority through a different chains of transmitters we have the words:                     \" Kill him.\"",
      "chain": [
        "20218",
        "20469",
        "20340",
        "20240",
        "30123",
        "20311",
        "20219",
        "20283",
        "20022",
        "24244",
        "11339"
      ]
    },
    {
      "hadith_no": "5772",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني عقبة بن مكرم، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن، مرزوق حدثنا روح، حدثنا ابن جريج، أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الراكب على الماشي والماشي على القاعد والقليل على الكثير ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The rider should first greet the pedestrian, and the pedestrian the one who is seated and a small group should greet a larger group (with as-Salam-u-'Alaikum).",
      "chain": [
        "30441",
        "20241",
        "11070",
        "34240",
        "20229",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "7302",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن زياد بن علاقة، عن المغيرة بن، شعبة أن النبي صلى الله عليه وسلم صلى حتى انتفخت قدماه فقيل له أتكلف هذا وقد غفر الله لك ما تقدم من ذنبك وما تأخر فقال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that Allah's Apostle (may peace be upon him) worshipped so much that his feet were swollen. It was said to him:                      (Why do you undergo so much hardship despite the fact that) Allah has pardoned for you your earlier and later sins? Thereupon he said: May I not (prove myself) to be a grateful servant (of Allah)?",
      "chain": [
        "30367",
        "20469",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "7303",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا سفيان، عن زياد بن علاقة، سمع المغيرة بن شعبة، يقول قام النبي صلى الله عليه وسلم حتى ورمت قدماه قالوا قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Mughira b. Shu'ba and the words are:                      Allah's Apostle (may peace be upon him) kept standing in prayer (for such long hours) that his feet were swollen. They (his Companions) said: Verily, Allah has pardoned for thee the earlier and the later of thine sins. Thereupon he said: Should I not prove myself to be a grateful servant (of Allah)?",
      "chain": [
        "30201",
        "30212",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباد بن موسى الختلي، وزياد بن أيوب، - وحديث عباد أتم - قالا حدثنا هشيم، عن أبي بشر، - قال زياد أخبرنا أبو بشر، - عن أبي عمير بن أنس، عن عمومة، له من الأنصار قال اهتم النبي صلى الله عليه وسلم للصلاة كيف يجمع الناس لها فقيل له انصب راية عند حضور الصلاة فإذا رأوها آذن بعضهم بعضا فلم يعجبه ذلك قال فذكر له القنع - يعني الشبور - وقال زياد شبور اليهود فلم يعجبه ذلك وقال ‏\"‏ هو من أمر اليهود ‏\"‏ ‏.‏ قال فذكر له الناقوس فقال ‏\"‏ هو من أمر النصارى ‏\"‏ ‏.‏ فانصرف عبد الله بن زيد بن عبد ربه وهو مهتم لهم رسول الله صلى الله عليه وسلم فأري الأذان في منامه - قال - فغدا على رسول الله صلى الله عليه وسلم فأخبره فقال له يا رسول الله إني لبين نائم ويقظان إذ أتاني آت فأراني الأذان ‏.‏ قال وكان عمر بن الخطاب - رضى الله عنه - قد رآه قبل ذلك فكتمه عشرين يوما - قال - ثم أخبر النبي صلى الله عليه وسلم فقال له ‏\"‏ ما منعك أن تخبرني ‏\"‏ ‏.‏ فقال سبقني عبد الله بن زيد فاستحييت فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فانظر ما يأمرك به عبد الله بن زيد فافعله ‏\"‏ ‏.‏ قال فأذن بلال ‏.‏ قال أبو بشر فأخبرني أبو عمير أن الأنصار تزعم أن عبد الله بن زيد لولا أنه كان يومئذ مريضا لجعله رسول الله صلى الله عليه وسلم مؤذنا ‏.‏",
      "text_en": " Narrated AbuUmayr ibn Anas:                     AbuUmayr reported on the authority of his uncle who was from the Ansar (the helpers of the Prophet): The Prophet (ﷺ) was anxious as to how to gather the people for prayer.  The people told him: Hoist a flag at the time of prayer; when they see it, they will inform one another. But he (the Prophet) did not like it. Then someone mentioned to him the horn.  Ziyad said: A horn of the Jews. He (the Prophet) did not like it. He said: This is the matter of the Jews. Then they mentioned to him the bell of the Christians.  He said: This is the matter of the Christians.  Abdullah ibn Zayd returned anxiously from there because of the anxiety of the Apostle (ﷺ). He was then taught the call to prayer in his dream. Next day he came to the Messenger of Allah (ﷺ) and informed him about it.  He said: Messenger of Allah, I was between sleep and wakefulness; all of a sudden a newcomer came (to me) and taught me the call to prayer. Umar ibn al-Khattab had also seen it in his dream before, but he kept it hidden for twenty days.  The Prophet (ﷺ) said to me (Umar): What did prevent you from saying it to me?  He said: Abdullah ibn Zayd had already told you about it before me: hence I was ashamed.  Then the Messenger of Allah (ﷺ) said: Bilal, stand up, see what Abdullah ibn Zayd tells you (to do), then do it. Bilal then called them to prayer.  AbuBishr reported on the authority of AbuUmayr: The Ansar thought that if Abdullah ibn Zayd had not been ill on that day, the Messenger of Allah (ﷺ) would have made him mu'adhdhin.",
      "chain": [
        "30255",
        "30249",
        "20468",
        "11419",
        "11339",
        "11419"
      ]
    },
    {
      "hadith_no": "989",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن الحسن المصيصي، حدثنا حجاج، عن ابن جريج، عن زياد، عن محمد بن عجلان، عن عامر بن عبد الله، عن عبد الله بن الزبير، أنه ذكر أن النبي صلى الله عليه وسلم كان يشير بأصبعه إذا دعا ولا يحركها ‏.‏ قال ابن جريج وزاد عمرو بن دينار قال أخبرني عامر عن أبيه أنه رأى النبي صلى الله عليه وسلم يدعو كذلك ويتحامل النبي صلى الله عليه وسلم بيده اليسرى على فخذه اليسرى ‏.‏",
      "text_en": " Narrated Abdullah ibn az-Zubayr:                     The Prophet (ﷺ) used to point with his finger (at the end of the tashahhud) and he would not move it.Ibn Juraij said: \"And 'Amr bin Dinar added: 'He (Ziyad) said: \"'Amir informed me from his father that he saw the Prophet (ﷺ) supplicating like that. And the Prophet (ﷺ) would brace himself with his left hand on his left knee.",
      "chain": [
        "20219",
        "11070",
        "11339",
        "10616",
        "106"
      ]
    },
    {
      "hadith_no": "1037",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر الجشمي، حدثنا يزيد بن هارون، أخبرنا المسعودي، عن زياد بن علاقة، قال صلى بنا المغيرة بن شعبة فنهض في الركعتين قلنا سبحان الله قال سبحان الله ومضى فلما أتم صلاته وسلم سجد سجدتى السهو فلما انصرف قال رأيت رسول الله صلى الله عليه وسلم يصنع كما صنعت ‏.‏ قال أبو داود وكذلك رواه ابن أبي ليلى عن الشعبي عن المغيرة بن شعبة ورفعه ورواه أبو عميس عن ثابت بن عبيد قال صلى بنا المغيرة بن شعبة مثل حديث زياد بن علاقة ‏.‏ قال أبو داود أبو عميس أخو المسعودي وفعل سعد بن أبي وقاص مثل ما فعل المغيرة وعمران بن حصين والضحاك بن قيس ومعاوية بن أبي سفيان وابن عباس أفتى بذلك وعمر بن عبد العزيز ‏.‏ قال أبو داود هذا فيمن قام من ثنتين ثم سجدوا بعد ما سلموا ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     Ziyad ibn Ilaqah said: Al-Mughirah ibn Shu'bah led us in prayer and he stood up at the end of two rak'ahs. We said: Glory be to Allah; he also said: Glory be to Allah, and he proceeded. When he finished the prayer and gave the salutation, he made two prostrations of forgetfulness. When he turned (to us) he said: I saw the Messenger of Allah (ﷺ) doing so as I did.Abu Dawud said: Ibn Abi Laila narrated this tradition in a similar manner from al-Shaibi from al-Mughirah b. Shu'bah. Abu 'Umais narrated it from Thabit b. 'Ubaid saying: \"Al-Mughirah b. Shu'bah led us in prayer, like the tradition reported by Ziyad b. 'Illaqah.Abu Dawud said: Abu 'Umais is the brother of al-Mas'udi. And Sa'd b. Abi Waqqas did the same as done by al-Mughirah, 'Imran b. Husain, Dahhak b. Qais and Mu'awiyah b. Abi Sufyan. Ibn 'Abbas and 'Umar b. 'Abd al-'Aziz issued legel verdict to the same effect.Abu Dawud said: This applies to a person who stands up at the end of two rak'ahs and males prostration after giving the salutation.",
      "chain": [
        "20472",
        "20724",
        "11339"
      ]
    },
    {
      "hadith_no": "2015",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الشيباني، عن زياد بن علاقة، عن أسامة بن شريك، قال خرجت مع النبي صلى الله عليه وسلم حاجا فكان الناس يأتونه فمن قال يا رسول الله سعيت قبل أن أطوف أو قدمت شيئا أو أخرت شيئا ‏.‏ فكان يقول ‏\"‏ لا حرج لا حرج إلا على رجل اقترض عرض رجل مسلم وهو ظالم فذلك الذي حرج وهلك ‏\"‏ ‏.‏",
      "text_en": " Usamah bin Sharik said “I went out with the Prophet (ﷺ) to perform Hajj, and the people were coming to him. One would say “Apostle of Allaah(ﷺ) I ran between Al Safa’ and Al Marwah before going round the Ka’bah or I did something before the its proper time or did something after its proper time. He would reply “No harm will come; no harm will come except to one who defames a Muslim acting wrongfully. That is the one who will be in trouble and will perish.",
      "chain": [
        "30203",
        "20028",
        "11352",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "2277",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا عبد الرزاق، وأبو عاصم عن ابن جريج، أخبرني زياد، عن هلال بن أسامة، أن أبا ميمونة، سلمى - مولى من أهل المدينة رجل صدق - قال بينما أنا جالس مع أبي هريرة جاءته امرأة فارسية معها ابن لها فادعياه وقد طلقها زوجها فقالت يا أبا هريرة - ورطنت له بالفارسية - زوجي يريد أن يذهب بابني فقال أبو هريرة استهما عليه ورطن لها بذلك فجاء زوجها فقال من يحاقني في ولدي فقال أبو هريرة اللهم إني لا أقول هذا إلا أني سمعت امرأة جاءت إلى رسول الله صلى الله عليه وسلم وأنا قاعد عنده فقالت يا رسول الله إن زوجي يريد أن يذهب بابني وقد سقاني من بئر أبي عنبة وقد نفعني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ استهما عليه ‏\"‏ ‏.‏ فقال زوجها من يحاقني في ولدي فقال النبي صلى الله عليه وسلم ‏\"‏ هذا أبوك وهذه أمك فخذ بيد أيهما شئت ‏\"‏ ‏.‏ فأخذ بيد أمه فانطلقت به ‏.‏",
      "text_en": " Hilal ibn Usamah quoted Abu Maimunah Salma, client of the people of Medina, as saying:                      While I was sitting with AbuHurayrah, a Persian woman came to him along with a son of hers. She had been divorced by her husband and they both claimed him.  She said: AbuHurayrah, speaking to him in Persian, my husband wishes to take my son away.  AbuHurayrah said: Cast lots for him, saying it to her in a foreign language.  Then her husband came and asked: Who is disputing with me about my son?  AbuHurayrah said: O Allah, I do not say this, except that I heard a woman who came to the Messenger of Allah (ﷺ) while I was sitting with him, and she said: My husband wishes to take away my son, Messenger of Allah, and he draws water for me from the well of AbuInabah, and he has been good to me.  The Messenger of Allah (ﷺ) said: Cast lots for him.  Her husband said: Who is disputing with me about my son?  The Prophet (ﷺ) said: This is your father and this your mother, so take whichever of them you wish by the hand. So he took his mother's hand and she went away with him.",
      "chain": [
        "30115",
        "20121",
        "20241",
        "11070",
        "11339",
        "11229"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقبل في شهر الصوم ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) used to kiss (me) during the month of fasting.",
      "chain": [
        "30335",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "3445",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن مخلد التميمي، حدثنا المكي، - يعني ابن إبراهيم - حدثنا ابن جريج، حدثني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اشترى غنما مصراة احتلبها فإن رضيها أمسكها وإن سخطها ففي حلبتها صاع من تمر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: If anyone buys sheep or goat whose udders have been tied up and he milked it, he may keep it if he is pleased with it, or he may return it if he is displeased with it. There is one sa' of dates (which he must give to the seller) for milking it.",
      "chain": [
        "38316",
        "20202",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن زياد بن علاقة، عن أسامة بن شريك، قال أتيت النبي صلى الله عليه وسلم وأصحابه كأنما على رءوسهم الطير فسلمت ثم قعدت فجاء الأعراب من ها هنا وها هنا فقالوا يا رسول الله أنتداوى فقال ‏\"‏ تداووا فإن الله عز وجل لم يضع داء إلا وضع له دواء غير داء واحد الهرم ‏\"‏ ‏.‏",
      "text_en": " Narrated Usamah ibn Sharik:                     I came to the Prophet (ﷺ) and his Companions were sitting as if they had birds on their heads. I saluted and sat down. The desert Arabs then came from here and there. They asked: Messenger of Allah, should we make use of medical treatment? He replied: Make use of medical treatment, for Allah has not made a disease without appointing a remedy for it, with the exception of one disease, namely old age.",
      "chain": [
        "30329",
        "20020",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "4762",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن زياد بن علاقة، عن عرفجة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ ستكون في أمتي هنات وهنات وهنات، فمن أراد أن يفرق أمر المسلمين وهم جميع فاضربوه بالسيف كائنا من كان ‏\"‏ ‏.‏",
      "text_en": " ‘Arfajah told that he heard the Messenger of Allah (May peace be upon him) as saying :                      various corruptions will arise in my community, so strike with sword the one who tries to cause separation in the matter of Muslims when they are united, whoever he be.",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11339"
      ]
    },
    {
      "hadith_no": "5199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، أخبرنا روح، حدثنا ابن جريج، قال أخبرنا زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الراكب على الماشي ‏\"‏ ‏.‏ ثم ذكر الحديث ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      one who is riding should salute one who is walking. He then mentioned the rest of the tradition.",
      "chain": [
        "30459",
        "20229",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن مسعر، وسفيان، عن زياد بن علاقة، عن عمه، قطبة بن مالك قال سمعت رسول الله صلى الله عليه وسلم يقرأ في الفجر ‏:‏ ‏(‏والنخل باسقات ‏)‏ في الركعة الأولى ‏.‏ قال وفي الباب عن عمرو بن حريث وجابر بن سمرة وعبد الله بن السائب وأبي برزة وأم سلمة ‏.‏ قال أبو عيسى حديث قطبة بن مالك حديث حسن صحيح ‏.‏ وروي عن النبي صلى الله عليه وسلم أنه قرأ في الصبح بالواقعة ‏.‏ وروي عنه أنه كان يقرأ في الفجر من ستين آية إلى مائة ‏.‏ وروي عنه أنه قرأ ‏:‏ ‏(‏إذا الشمس كورت ‏)‏ ‏.‏ وروي عن عمر أنه كتب إلى أبي موسى أن اقرأ في الصبح بطوال المفصل ‏.‏ قال أبو عيسى وعلى هذا العمل عند أهل العلم وبه قال سفيان الثوري وابن المبارك والشافعي ‏.‏",
      "text_en": " Qutbah bin Malik narrated:                     \"I heard Allah's Messenger reciting for Fajr: And tall date palms in the first Rak'ah.",
      "chain": [
        "30480",
        "20032",
        "20359",
        "20005",
        "11339"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، عن المسعودي، عن زياد بن علاقة، قال صلى بنا المغيرة بن شعبة فلما صلى ركعتين قام ولم يجلس فسبح به من خلفه فأشار إليهم أن قوموا فلما فرغ من صلاته سلم وسجد سجدتى السهو وسلم وقال هكذا صنع رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث من غير وجه عن المغيرة بن شعبة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ziyad bin Haqah narrated:                     \"Al-Mughirah bin Shu'bah les us in Salat. When he prayed two Rak'ah he stood without sitting. Those who were behind him said 'Subhan Allah' and he indicated to them that they should stand. He said the Taslim when he had finished his Salat and he performed two prostrations of As-Sahw, and said the Taslim. He said that Allah's Messenger did this.\"",
      "chain": [
        "30025",
        "20472",
        "20724",
        "11339"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، وبشر بن معاذ العقدي، قالا حدثنا أبو عوانة، عن زياد بن علاقة، عن المغيرة بن شعبة، قال صلى رسول الله صلى الله عليه وسلم حتى انتفخت قدماه فقيل له أتتكلف هذا وقد غفر لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث المغيرة بن شعبة حديث حسن صحيح ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated:                     \"Allah's Messenger (S) performed Salat until his feet were swollen, so it was said to him: 'You burden yourself like this, while your past and future sins have been forgiven?' He said: 'Shouldn't I be a grateful worshipper?'\"",
      "chain": [
        "30367",
        "34041",
        "20469",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "727",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، وقتيبة، قالا حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، أن النبي صلى الله عليه وسلم كان يقبل في شهر الصوم ‏.‏ قال وفي الباب عن عمر بن الخطاب وحفصة وأبي سعيد وأم سلمة وابن عباس وأنس وأبي هريرة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ واختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في القبلة للصائم فرخص بعض أصحاب النبي صلى الله عليه وسلم في القبلة للشيخ ولم يرخصوا للشاب مخافة أن لا يسلم له صومه والمباشرة عندهم أشد ‏.‏ وقد قال بعض أهل العلم القبلة تنقص الأجر ولا تفطر الصائم ‏.‏ ورأوا أن للصائم إذا ملك نفسه أن يقبل وإذا لم يأمن على نفسه ترك القبلة ليسلم له صومه ‏.‏ وهو قول سفيان الثوري والشافعي ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet would kiss during the month of fasting.\"",
      "chain": [
        "30480",
        "30367",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "1008",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عمرو بن عاصم، عن همام، عن منصور، وبكر الكوفي، وزياد، وسفيان، كلهم يذكر أنه سمعه من الزهري عن سالم بن عبد الله عن أبيه قال رأيت النبي صلى الله عليه وسلم وأبا بكر وعمر يمشون أمام الجنازة ‏.‏",
      "text_en": " Salim bin Abdullah narrated that his father said:                     \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"",
      "chain": [
        "30115",
        "20267",
        "20297",
        "11067",
        "11339",
        "20012",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات فتؤذوا الأحياء ‏\"‏ ‏.‏ قال أبو عيسى وقد اختلف أصحاب سفيان في هذا الحديث فروى بعضهم مثل رواية الحفري وروى بعضهم عن سفيان عن زياد بن علاقة قال سمعت رجلا يحدث عند المغيرة بن شعبة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " ' Al-Mughirah bin Shu'bah narrated that the Messenger of Allah said:                     \"Do not vilify the dead (and) by that harm the living.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2172",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا بشر بن معاذ العقدي، حدثنا أبو عوانة، عن زياد بن علاقة، عن أسامة بن شريك، قال قالت الأعراب يا رسول الله ألا نتداوى قال ‏\"‏ نعم يا عباد الله تداووا فإن الله لم يضع داء إلا وضع له شفاء أو قال دواء إلا داء واحدا ‏\"‏ ‏.‏ قالوا يا رسول الله وما هو قال ‏\"‏ الهرم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وأبي هريرة وأبي خزامة عن أبيه وابن عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Usamah bin Sharik said:                     \"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"",
      "chain": [
        "34041",
        "20469",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "3591",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أحمد بن بشير، وأبو أسامة عن مسعر، عن زياد بن علاقة، عن عمه، قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وعم زياد بن علاقة هو قطبة بن مالك صاحب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ziyad bin Ilaqah narrated from his uncle, that he said:                     “[The Prophet] used to say: ‘O Allah, I seek refuge inYou from evil character, evil actions, and evil desires (Allahumma Inni A’udhu Bika Min Munkaratil-Akhlaqi Wal-Amali Wal-Ahwa).’”",
      "chain": [
        "35047",
        "20318",
        "20359",
        "11339"
      ]
    },
    {
      "hadith_no": "3604d",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، أخبرنا أبو معاوية، أخبرنا الليث، وهو ابن أبي سليم عن زياد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل يدعو الله بدعاء إلا استجيب له فإما أن يعجل له في الدنيا وإما أن يدخر له في الآخرة وإما أن يكفر عنه من ذنوبه بقدر ما دعا ما لم يدع بإثم أو قطيعة رحم أو يستعجل ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف يستعجل قال ‏\"‏ يقول دعوت ربي فما استجاب لي ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “There is not a man who calls upon Allah with a supplication, except that he is answered. Either it shall be granted to him in the world, or reserved for him in the Hereafter, or, his sins shall be expiated for it according to the extent that he supplicated - as long as he does not supplicate for some sin, or for the severing of the ties of kinship, and he does not become hasty.” They said: “O Messenger of Allah, and how would he be hasty?” He said: “He says: ‘I called upon my Lord, but He did not answer me.’”",
      "chain": [
        "30221",
        "20354",
        "20023",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "804",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا حجاج، قال قال ابن جريج أخبرني زياد، أن قزعة، مولى لعبد قيس أخبره أنه، سمع عكرمة، مولى ابن عباس قال قال ابن عباس صليت إلى جنب النبي صلى الله عليه وسلم وعائشة خلفنا تصلي معنا وأنا إلى جنب النبي صلى الله عليه وسلم أصلي معه ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"I prayed beside the Prophet (ﷺ) and Ayesha was behind us praying with us, and I was beside the Prophet (ﷺ) praying with him.\"",
      "chain": [
        "34188",
        "20219",
        "11070",
        "11339",
        "11023"
      ]
    },
    {
      "hadith_no": "841",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا حجاج، قال ابن جريج أخبرني زياد، أن قزعة، مولى لعبد القيس أخبره أنه، سمع عكرمة، قال قال ابن عباس صليت إلى جنب النبي صلى الله عليه وسلم وعائشة خلفنا تصلي معنا وأنا إلى جنب النبي صلى الله عليه وسلم أصلي معه ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"I prayed beside the Prophet (ﷺ) and Aisha was behind us praying with us, and I was beside the Prophet (ﷺ) praying with him.\"",
      "chain": [
        "34188",
        "20219",
        "11070",
        "11339",
        "11023"
      ]
    },
    {
      "hadith_no": "950",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، - واللفظ له - قال حدثنا خالد، عن شعبة، عن زياد بن علاقة، قال سمعت عمي، يقول صليت مع رسول الله صلى الله عليه وسلم الصبح فقرأ في إحدى الركعتين ‏{‏ والنخل باسقات لها طلع نضيد ‏}‏ قال شعبة فلقيته في السوق في الزحام فقال ‏{‏ ق ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ziyad bin Ilaqah said:                     \"I heard my paternal uncle say: 'I prayed Subh with the Messenger of Allah (ﷺ), and in one of the rak'ahs he recited: \"And tall date palms, with ranged clusters.\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11339"
      ]
    },
    {
      "hadith_no": "1270",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا حجاج، قال ابن جريج أخبرني زياد، عن محمد بن عجلان، عن عامر بن عبد الله بن الزبير، عن عبد الله بن الزبير، أن النبي صلى الله عليه وسلم كان يشير بأصبعه إذا دعا ولا يحركها ‏.‏ قال ابن جريج وزاد عمرو قال أخبرني عامر بن عبد الله بن الزبير عن أبيه أنه رأى النبي صلى الله عليه وسلم يدعو كذلك ويتحامل بيده اليسرى على رجله اليسرى ‏.‏",
      "text_en": " It was narrated from Abdullah bin Az-Zubair:                     That the Prophet (ﷺ) used to point with his finger when he supplicated, but he did not move it. Ibn Jurayj said: \"And 'Amr added: 'Amir bin 'Abdullah bin Az-Zubair told me that his father saw the Prophet (ﷺ) supplicating like that, putting his weight on his left arm, leaning on his left leg.'\"",
      "chain": [
        "38120",
        "20219",
        "11070",
        "11339",
        "10616",
        "11178",
        "106"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، ومحمد بن منصور، - واللفظ له - عن سفيان، عن زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول قام النبي صلى الله عليه وسلم حتى تورمت قدماه فقيل له قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ziyad bin Ilaqah said:                     \"I heard Al-Mughirah bin Shu'bah say: 'The Prophet (ﷺ) stood (in prayer at night) until his feet swelled up, and it was said to him: Allah has forgiven your past and future sins. He said: \"Should I not be a thankful slave?'\"",
      "chain": [
        "30367",
        "36658",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا أبي قال، حدثنا همام، قال حدثنا سفيان، ومنصور، وزياد، وبكر، - هو ابن وائل - كلهم ذكروا أنهم سمعوا من الزهري، يحدث أن سالما، أخبره أن أباه أخبره أنه، رأى النبي صلى الله عليه وسلم وأبا بكر وعمر وعثمان يمشون بين يدى الجنازة ‏.‏ بكر وحده لم يذكر عثمان ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب مرسل ‏.‏",
      "text_en": " Salim narrated:                     That his father told him that he was the Prophet, Abu Bakr, 'Umar and 'Uthman walking in front of the Janazah.",
      "chain": [
        "11447",
        "20005",
        "11067",
        "11339",
        "20579",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، قال أخبرني زياد، عن هلال بن أسامة، عن أبي ميمونة، قال بينا أنا عند أبي هريرة، فقال إن امرأة جاءت رسول الله صلى الله عليه وسلم فقالت فداك أبي وأمي إن زوجي يريد أن يذهب بابني وقد نفعني وسقاني من بئر أبي عنبة ‏.‏ فجاء زوجها وقال من يخاصمني في ابني فقال ‏\"‏ يا غلام هذا أبوك وهذه أمك فخذ بيد أيهما شئت ‏\"‏ ‏.‏ فأخذ بيد أمه فانطلقت به ‏.‏",
      "text_en": " It was narrated that Abu Maimunah said:                      \"While I was with Abu Hurairah he said: 'A woman came to the Messenger of Allah and said: May my father and mother be ransomed for you! My husband wants to take my son away, but he helps me, and brings me water from the well of Abu 'Inabah. Her husband came and said: Who is going to take my son from me? The Messenger of Allah said: \"O boy, this is your father and this is your mother; take the hand of whichever of them you want.\" He took his mother's hand and she left with him.'\"",
      "chain": [
        "30449",
        "20423",
        "11070",
        "11339",
        "11229"
      ]
    },
    {
      "hadith_no": "4020",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني أحمد بن يحيى الصوفي، قال حدثنا أبو نعيم، قال حدثنا يزيد بن مردانبه، عن زياد بن علاقة، عن عرفجة بن شريح الأشجعي، قال رأيت النبي صلى الله عليه وسلم على المنبر يخطب الناس فقال ‏\"‏ إنه سيكون بعدي هنات وهنات فمن رأيتموه فارق الجماعة أو يريد تفريق أمر أمة محمد صلى الله عليه وسلم كائنا من كان فاقتلوه فإن يد الله على الجماعة فإن الشيطان مع من فارق الجماعة يركض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Arfajah bin Shuraih Al-Ashja'I said:                     \"I saw the Prophet [SAW] on the Minbar addressing the people. He said: 'After me there will be many calamities and much evil behavior. Whoever you see splitting away from the Jama'ah or trying to create division among the Ummah of Muhammad [SAW], then kill him, for the Hand of Allah is with the Jama'ah, and the Shaitan is with the one who splits away from the Ummah, running with him.'\"",
      "chain": [
        "20348",
        "11339",
        "5175"
      ]
    }
  ],
  "total_hadiths": 59
}