{
  "id": "11335",
  "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
  "full_name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "122",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Yami",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "21338",
      "name": "'Abdur Rahman bin Zubayd bin al-Harith عبد الرحمن بن زبيد اليامي",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "21797",
      "name": "'Abdullah bin Zubayd bin al-Harith عبد الله بن زبيد بن الحارث",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "11391",
      "name": "Murrah bin Shrahayl al-Hamdani مرة بن شراحيل الهمداني - الطيب - الخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11423",
      "name": "Dhar bin 'Abdullah al-Marhabi ذر بن عبد الله المرهبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11346",
      "name": "Sa'id bin 'Abdur Rahman bin Abza سعيد بن عبد الرحمن بن أبزي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "21338",
      "name": "'Abdur Rahman bin Zubayd bin al-Harith عبد الرحمن بن زبيد اليامي",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "21797",
      "name": "'Abdullah bin Zubayd bin al-Harith عبد الله بن زبيد بن الحارث",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "48",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن زبيد، قال سألت أبا وائل عن المرجئة،، فقال حدثني عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ سباب المسلم فسوق، وقتاله كفر ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          The Prophet said, \"Abusing a Muslim is Fusuq (an evil doing) and      killing him is Kufr (disbelief).\"",
      "chain": [
        "20282",
        "20020",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "951",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، عن البراء، قال سمعت النبي صلى الله عليه وسلم يخطب فقال ‏\"‏ إن أول ما نبدأ من يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل فقد أصاب سنتنا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first day of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the name of Allah) and whoever does so, he acted according to our Sunna (traditions).\"",
      "chain": [
        "20219",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا زبيد، قال سمعت الشعبي، عن البراء بن عازب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أول ما نبدأ في يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن نحر قبل الصلاة فإنما هو لحم قدمه لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقال رجل من الأنصار يقال له أبو بردة بن نيار يا رسول الله، ذبحت وعندي جذعة خير من مسنة‏.‏ فقال ‏\"‏ اجعله مكانه، ولن توفي أو تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then return to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), and whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his family and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin Niyyar said, \"O Allah's Apostle! I slaughtered the Nusuk (before the prayer) but I have a young shegoat which is better than an older sheep.\" The Prophet I said, \"Sacrifice it in lieu of the first, but it will be not sufficient (as a sacrifice) for anybody else after you.\"",
      "chain": [
        "20404",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "968",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن زبيد، عن الشعبي، عن البراء، قال خطبنا النبي صلى الله عليه وسلم يوم النحر قال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن ذبح قبل أن يصلي فإنما هو لحم عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام خالي أبو بردة بن نيار فقال يا رسول الله، أنا ذبحت قبل أن أصلي وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها  أو قال اذبحها  ولن تجزي جذعة عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     The Prophet delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we should do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who does so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just meat that he offered to his family and would not be considered as a sacrifice in any way. My uncle Abu Burda bin Niyyar got up and said, \"O, Allah's Apostle! I slaughtered the sacrifice before the prayer but I have a young she-goat which is better than an older sheep.\" The Prophet said, \"Slaughter it in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"",
      "chain": [
        "20193",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا محمد بن طلحة، عن زبيد، عن الشعبي، عن البراء، قال خرج النبي صلى الله عليه وسلم يوم أضحى إلى البقيع فصلى ركعتين، ثم أقبل علينا بوجهه وقال ‏\"‏ إن أول نسكنا في يومنا هذا أن نبدأ بالصلاة، ثم نرجع فننحر، فمن فعل ذلك فقد وافق سنتنا، ومن ذبح قبل ذلك فإنما هو شىء عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام رجل فقال يا رسول الله، إني ذبحت وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اذبحها، ولا تفي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     The Prophet went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a two-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of worship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does this concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) then that was a thing which he prepared earlier for his family and it would not be considered as a Nusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Apostle! I slaughtered (the animal before the prayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (p.b.u.h) said to him, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"",
      "chain": [
        "20348",
        "20604",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1294",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، حدثنا زبيد اليامي، عن إبراهيم، عن مسروق، عن عبد الله  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس منا من لطم الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     the Prophet said, \"He who slaps his cheeks, tears his clothes and follows the ways and traditions of the Days of Ignorance is not one of us.\"",
      "chain": [
        "20348",
        "20012",
        "11335",
        "11051",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "5504",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو نعيم، حدثنا محمد بن طلحة، عن زبيد، عن مجاهد، قال سمعت ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏من الشجر شجرة تكون مثل المسلم، وهى النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"There is a tree among the trees which is similar to a Muslim (in goodness), and that is the date palm tree.\"",
      "chain": [
        "20348",
        "20604",
        "11335",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "5619",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا حجاج بن المنهال، حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، عن البراء  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يخطب فقال ‏\"‏ إن أول ما نبدأ من يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل هذا فقد أصاب سنتنا، ومن نحر فإنما هو لحم يقدمه لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقال أبو بردة يا رسول الله ذبحت قبل أن أصلي، وعندي جذعة خير من مسنة‏.‏ فقال ‏\"‏ اجعلها مكانها، ولن تجزي أو توفي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     I heard the Prophet delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we will do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our sacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered his sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that was not a sacrifice.\" Abu Burda got up and said, \"O Allah's Apostle! I slaughtered the sacrifice before the prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet said, \"Slaughter it to make up for that, but it will not be sufficient for anybody else after you.\"",
      "chain": [
        "20219",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "7344",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن زبيد، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  أن النبي صلى الله عليه وسلم بعث جيشا وأمر عليهم رجلا، فأوقد نارا وقال ادخلوها‏.‏ فأرادوا أن يدخلوها، وقال آخرون إنما فررنا منها، فذكروا للنبي صلى الله عليه وسلم فقال للذين أرادوا أن يدخلوها ‏\"‏ لو دخلوها لم يزالوا فيها إلى يوم القيامة ‏\"‏‏.‏ وقال للآخرين ‏\"‏ لا طاعة في معصية، إنما الطاعة في المعروف ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet , sent an army and appointed some man their commander The man made a fire and then said (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have run away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the Prophet, and he said about people who had intended to enter the fire. ''If they had entered it, they would have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil deeds, obedience is required only in what is good .\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11335",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بكار بن الريان، وعون بن سلام، قالا حدثنا محمد بن طلحة، ح وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن زبيد، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال زبيد فقلت لأبي وائل أنت سمعته من عبد الله يرويه عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏ وليس في حديث شعبة قول زبيد لأبي وائل ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace and blessings be upon him) observed:                      Abusing a Muslim is an outrage and fighting against him is unbelief. Zubaid said: I asked Abu Wa'il: Did you hear it from Abdullah narrating if from the Messenger of Allah (may peace and blessings be upon him)? He replied: Yes. But there is mention of the talk between Zubaid and Abu Wa'il in the hadith narrated by Shu'ba.",
      "chain": [
        "30512",
        "30474",
        "20604",
        "30170",
        "20033",
        "20005",
        "30170",
        "20173",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عون بن سلام الكوفي، أخبرنا محمد بن طلحة اليامي، عن زبيد، عن مرة، عن عبد الله، قال حبس المشركون رسول الله صلى الله عليه وسلم عن صلاة العصر حتى احمرت الشمس أو اصفرت فقال رسول الله صلى الله عليه وسلم ‏\"‏ شغلونا عن الصلاة الوسطى صلاة العصر ملأ الله أجوافهم وقبورهم نارا ‏\"‏ ‏.‏ أو قال ‏\"‏ حشا الله أجوافهم وقبورهم نارا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported that the polytheists detained the Messenger of Allah (may peace be upon him) from observing the afternoon prayer till the sun became red or it became yellow. Upon this the Messenger of Allah (may peace be upon him) said:                      They have diverted us from (offering) the middle prayer. i. e. the 'Asr prayer. May Allah fill their bellies and their graves with fire, or he said: May Allah stuff their bellies and their graves with fire.",
      "chain": [
        "30474",
        "20604",
        "11335",
        "16"
      ]
    },
    {
      "hadith_no": "2306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن زبيد اليامي، عن محارب بن دثار، عن ابن بريدة، أراه عن أبيه، - الشك من أبي خيثمة - عن النبي صلى الله عليه وسلم ح . وحدثنا أبو بكر بن أبي شيبة، حدثنا قبيصة بن عقبة، عن سفيان، عن علقمة، بن مرثد عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم ح . وحدثنا ابن أبي عمر، ومحمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، عن معمر، عن عطاء الخراساني، قال حدثني عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم كلهم بمعنى حديث أبي سنان ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30399",
        "30022",
        "11335",
        "11389",
        "11432"
      ]
    },
    {
      "hadith_no": "2706",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ويحيى بن سعيد القطان، عن سفيان، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، حدثنا سفيان، حدثني زبيد اليامي، عن عمارة بن عمير، عن قيس بن سكن، أن الأشعث بن قيس، دخل على عبد الله يوم عاشوراء وهو يأكل فقال يا أبا محمد ادن فكل ‏.‏ قال إني صائم ‏.‏ قال كنا نصومه ثم ترك ‏.‏",
      "text_en": " Qais b Sakan reported that al-Ash'ath b. Qais went to 'Abdullah on the day of 'Ashura while he was eating. He said:                      Abu Muhammad, come near and dine. Upon this he said: I am fasting. Thereupon he said: We used to observe fast and then (this practice) was abandoned.",
      "chain": [
        "30201",
        "20032",
        "20031",
        "20012",
        "38487",
        "20031",
        "20012",
        "11335",
        "11378"
      ]
    },
    {
      "hadith_no": "3026",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن فضيل، عن زبيد، عن إبراهيم التيمي، عن أبيه، قال قال أبو ذر رضى الله عنه لا تصلح المتعتان إلا لنا خاصة ‏.‏ يعني متعة النساء ومتعة الحج ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said:                      Two are the Mut'as which were not permissible but only for us, i. e. temporary marriage with women and Tamattu' in Hajj.",
      "chain": [
        "30367",
        "20028",
        "20271",
        "11335",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "hadith_no": "4871",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن زبيد، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي، أنعليه وسلم بعث جيشا وأمر عليهم رجلا فأوقد نارا وقال ادخلوها ‏.‏ فأراد ناس أن يدخلوها وقال الآخرون إنا قد فررنا منها ‏.‏ فذكر ذلك لرسول الله صلى الله عليه وسلم فقال للذين أرادوا أن يدخلوها ‏\"‏ لو دخلتموها لم تزالوا فيها إلى يوم القيامة ‏\"‏ ‏.‏ وقال للآخرين قولا حسنا وقال ‏\"‏ لا طاعة في معصية الله إنما الطاعة في المعروف ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu 'Abd al-Rahman from 'Ali that the Messenger of Allah (may peace be upon him) sent a force (on a mission) and appointed over them a man. He kindled a fire and said:                      Enter it. Some people made up their minds to enter it (the fire), (carrying out the order of their commander), but the others said: We fled from the fire (that's why we have come into the fold of Islam). The matter was reported to the Messenger of Allah (may peace be upon him). He said to those who Contemplated entering (the fire at the order of their commander): If you had entered it, you would have remained there until the Day of Judgment. He commanded the act of the latter group and said: There is no submission in matters involving God's disobedience or displeasure. Submission is obligatory only in what is good (and reasonable).",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11335",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "5186",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن زبيد، سمع الشعبي، عن  البراء بن عازب، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of al-Bara' b. 'Azib through another chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1423",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، ح وحدثنا إبراهيم بن موسى، أخبرنا محمد بن أنس، - وهذا لفظه - عن الأعمش، عن طلحة، وزبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل للذين كفروا ‏}‏ والله الواحد الصمد ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Messenger of Allah (ﷺ) used to observe witr with (reciting) \"Glorify the name of thy Lord, the most High\" (Surah 87), \"Say O disbelievers\" (Surah 109), and \"Say, He is Allah, the One, Allah, the eternally besought of all\" (112).",
      "chain": [
        "30203",
        "25208",
        "30309",
        "11060",
        "11356",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "2625",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن مرزوق، أخبرنا شعبة، عن زبيد، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم بعث جيشا وأمر عليهم رجلا وأمرهم أن يسمعوا له ويطيعوا فأجج نارا وأمرهم أن يقتحموا فيها فأبى قوم أن يدخلوها وقالوا إنما فررنا من النار وأراد قوم أن يدخلوها فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ لو دخلوها - أو دخلوا فيها - لم يزالوا فيها ‏\"‏ ‏.‏ وقال ‏\"‏ لا طاعة في معصية الله إنما الطاعة في المعروف ‏\"‏ ‏.‏",
      "text_en": " ‘Ali (Allaah be pleased with him) said “The Messenger of Allah(ﷺ) sent an army and appointed a man as a commander for them and he commanded them to listen to him and obey. He kindled fire and ordered them to jump into it. A group refused to enter into it and said “We escaped from the fire; a group intended to enter into it. When the Prophet (ﷺ) was informed about it, he said “Had they entered into it, they would have remained into it. There is no obedience in matters involving disobedience to Allaah. Obedience is in matters which are good and universally recognized.",
      "chain": [
        "20268",
        "20020",
        "11335",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، وأبو النضر، عن محمد بن طلحة بن مصرف، عن زبيد، عن مرة الهمداني، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الوسطى صلاة العصر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     Allah's Messenger said: \"Salatul-Wusta is the Asr prayer.\"",
      "chain": [
        "30277",
        "20547",
        "20390",
        "20604",
        "11335",
        "9759",
        "16"
      ]
    },
    {
      "hadith_no": "651",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، حدثنا سفيان، عن حكيم بن جبير، بهذا الحديث ‏.‏ فقال له عبد الله بن عثمان صاحب شعبة لو غير حكيم حدث بهذا الحديث ‏.‏ فقال له سفيان وما لحكيم لا يحدث عنه شعبة قال نعم ‏.‏ قال سفيان سمعت زبيدا يحدث بهذا عن محمد بن عبد الرحمن بن يزيد ‏.‏ والعمل على هذا عند بعض أصحابنا وبه يقول الثوري وعبد الله بن المبارك وأحمد وإسحاق ‏.‏ قالوا إذا كان عند الرجل خمسون درهما لم تحل له الصدقة ‏.‏ قال ولم يذهب بعض أهل العلم إلى حديث حكيم بن جبير ووسعوا في هذا وقالوا إذا كان عنده خمسون درهما أو أكثر وهو محتاج فله أن يأخذ من الزكاة وهو قول الشافعي وغيره من أهل الفقه والعلم ‏.‏",
      "text_en": " Mahmud bin Ghaydin narrated to us:                     Yahya bin Adam narrated to us, Sufyan narrated this Hadith to us from Hakim bin Jubair. So Abdullah bin Uthman, the companion of Shu'bah said to him (Sufyan): \"If only someone besides Hakim had narrated this (Hadith).\" Sufyan said to him, \"So what is with Hakim; Shu'bah would not narrate from him?\" He said: \"Yes.\" So Sufyan said: \"I heard Zubaid narrating this from Muhammad bin Abdur-Rahman bin Yazid.\"",
      "chain": [
        "30277",
        "20364",
        "20012",
        "19866",
        "20012",
        "11335"
      ]
    },
    {
      "hadith_no": "2111",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن زبيد بن الحارث، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال زبيد قلت لأبي وائل أأنت سمعته من عبد الله قال نعم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Messenger of Allah said:                     \"Verbally abusing the Muslim is disobedience and fighting him is disbelief.\" Zubaid said:\"I said to Abu Wa'il: 'Did you hear it from 'Abdullah?' He said: 'Yes.'\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن زبيد، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى هذا الحديث قتاله كفر ليس به كفرا مثل الارتداد عن الإسلام والحجة في ذلك ما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من قتل متعمدا فأولياء المقتول بالخيار إن شاءوا قتلوا وإن شاءوا عفوا ‏\"‏ ‏.‏ ولو كان القتل كفرا لوجب القتل ولم يصح العفو وقد روي عن ابن عباس وطاوس وعطاء وغير واحد من أهل العلم قالوا كفر دون كفر وفسوق دون فسوق ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"Verbally abusing a Muslim is disobedience and fighting him is disbelief.\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3252",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو النضر، وأبو داود الطيالسي عن محمد بن طلحة بن مصرف، عن زبيد، عن مرة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الوسطى صلاة العصر ‏\"‏ ‏.‏ وفي الباب عن زيد بن ثابت وأبي هاشم بن عتبة وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"Salat Al-Wusta is Salat Al-'Asr.\"",
      "chain": [
        "30277",
        "20390",
        "20547",
        "20604",
        "11335",
        "16"
      ]
    },
    {
      "hadith_no": "4245",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن زبيد، عن شهر بن حوشب، عن أم سلمة، أن النبي صلى الله عليه وسلم جلل على الحسن والحسين وعلي وفاطمة كساء ثم قال ‏\"‏ اللهم هؤلاء أهل بيتي وخاصتي أذهب عنهم الرجس وطهرهم تطهيرا ‏\"‏ ‏.‏ فقالت أم سلمة وأنا معهم يا رسول الله قال ‏\"‏ إنك إلى خير ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح وهو أحسن شيء روي في هذا الباب ‏.‏ وفي الباب عن عمر بن أبي سلمة وأنس بن مالك وأبي الحمراء ومعقل بن يسار وعائشة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Prophet (ﷺ) put a garment over Al-Hasan, Al-Hussain, 'Ali and Fatimah, then he said: 'O Allah, these are the people of my house and the close ones, so remove the Rijs from them and purify them thoroughly.\" So Umm Salamah said: 'And am I with them, O Messenger of Allah?' He said: \"You are upon good.\"'",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11335",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن زبيد، عن عبد الرحمن بن أبي ليلى، قال قال عمر صلاة الجمعة ركعتان وصلاة الفطر ركعتان وصلاة الأضحى ركعتان وصلاة السفر ركعتان تمام غير قصر على لسان محمد صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن عبد الرحمن بن أبي ليلى لم يسمع من عمر ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Laila that 'Umar said:                     \"Jumu'ah prayer is two rak'ahs, the prayer of Al-Fitr is two rak'ahs, the prayer of Al-Adha is two rak'ahs, the prayer when traveling is two rak'ahs, complete and not shortened, on the tongue of Muhammad (ﷺ).\"",
      "chain": [
        "20387",
        "20587",
        "11335",
        "11196"
      ]
    },
    {
      "hadith_no": "1440",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن عمر، قال صلاة الجمعة ركعتان والفطر ركعتان والنحر ركعتان والسفر ركعتان تمام غير قصر على لسان النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"The prayer for jumu'ah is two rak'ahs, and for Al-Fitr is two rak'ahs, and for An-Nahr is two rak'ahs, and for traveling is two rak'ahs, complete and not shortened, on the tongue of the Prophet (ﷺ).\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "11335",
        "11196",
        "3"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا محمد بن عثمان، قال حدثنا بهز، قال حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، يقول حدثنا البراء بن عازب، عند سارية من سواري المسجد قال خطب النبي صلى الله عليه وسلم يوم النحر فقال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نذبح فمن فعل ذلك فقد أصاب سنتنا ومن ذبح قبل ذلك فإنما هو لحم يقدمه لأهله ‏\"‏ ‏.‏ فذبح أبو بردة بن نيار فقال يا رسول الله عندي جذعة خير من مسنة ‏.‏ قال ‏\"‏ اذبحها ولن توفي عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' bin 'Azib narrated to us by one of the pillars of the masjid:                     \"The Prophet (ﷺ) delivered a Khutbah on the day of An-Nahr and said: 'The first thing we start with on this day of ours is the prayer, then we offer sacrifice. Whoever does that, he has followed our sunnah, but whoever slaughtered (his sacrifice) before the (prayer), that is just meat that he gave to his family. Abu Burdah bin Niyar had slaughtered his sacrifice and he said: 'O Messenger of Allah (ﷺ), I have a Jadha'ah that is better than a Musinnah.' He said: 'Slaughter it (as a sacrifice), but that will not be sufficient for anyone else (as a sacrifice) after you.'\"",
      "chain": [
        "38549",
        "20214",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1699",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا علي بن ميمون، قال حدثنا مخلد بن يزيد، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان يوتر بثلاث ركعات كان يقرأ في الأولى ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ ويقنت قبل الركوع فإذا فرغ قال عند فراغه ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يطيل في آخرهن ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah (ﷺ) used to pray witr with three rak'ahs. In the first he would recite: \"Glorify the Name of Your Lord, the Most High\" in the second: \"Say: O you disbelievers!\", and in the third: \"Say: He is Allah, (the) One\". And he would say the Qunut before bowing, and when he finished he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the last time.",
      "chain": [
        "20462",
        "20012",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن موسى، قال حدثنا عبد الرحمن بن عبد الله بن سعد، قال حدثنا أبو جعفر الرازي، عن الأعمش، عن زبيد، وطلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ خالفهما حصين فرواه عن ذر عن ابن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Sa'eed bin Abdur-Rahman bin Abza narrated from his father, that:                     Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30221",
        "20746",
        "11060",
        "11335",
        "11356",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ويرفع صوته بالثالثة ‏.‏",
      "text_en": " Bahz bin Asad, said:                     \"Shu'bah narrated to us, from Salamah and Zubaid, from Dharr, from Ibn Abdur-Rahman bin Abza from his father that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice the third time.\"",
      "chain": [
        "20214",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1733",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن عبد الرحمن، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ثم يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ويرفع ب ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ صوته بالثالثة ‏.‏ رواه منصور عن سلمة بن كهيل ولم يذكر ذرا ‏.‏",
      "text_en": " Khalid said:                     \"Shu'bah narrated to us, he said: Salamah and Zubaid informed me, from Dharr, from Ibn 'Abdur-Rahman bn Abza from Abdur-Rahman, that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with Subhanal-Malikil-Quddus the third time.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "10530"
      ]
    },
    {
      "hadith_no": "1735",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا عبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ورواه محمد بن جحادة عن زبيد ولم يذكر ذرا ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman reported from Zubaid, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "38022",
        "30213",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1736",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا محمد بن جحادة، عن زبيد، عن ابن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا فرغ من الصلاة قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " Muhammad bin Juhadah reported from Zubaid, Sa'eed bin 'Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he had finished praying, he said: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times.\"",
      "chain": [
        "28454",
        "20258",
        "18897",
        "11335"
      ]
    },
    {
      "hadith_no": "1737",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن محمد بن عبيد الله، قال حدثنا شعيب بن حرب، عن مالك، عن زبيد، عن ابن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " Shu'aib bin Harb reported from Malik, from Zubaid, from Ibn Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30304",
        "20194",
        "20001",
        "11335"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، عن زبيد، عن ذر، عن ابن أبزى، مرسل ‏.‏ وقد رواه عطاء بن السائب عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، ‏.‏",
      "text_en": " Ahmad bin Sulaiman informed us, he said:                     \"Yahya bin Adam narrated to us, he said: \"Malik narrated to us from Zubaid, from Dharr, from Ibn Abza.'\"",
      "chain": [
        "38022",
        "20364",
        "20001",
        "11335",
        "11423",
        "11068",
        "11346"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن النبي صلى الله عليه وسلم أنه كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza from his father that:                     The Messenger of Allah (ﷺ) used to recite in witr: \"Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) raising his voice the third time.\"",
      "chain": [
        "38011",
        "20005",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1751",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن يحيى، قال حدثنا محمد بن عبيد، عن سفيان الثوري، وعبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏ خالفهما أبو نعيم فرواه عن سفيان عن زبيد عن ذر عن سعيد ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:                     His father said: \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it.\"",
      "chain": [
        "30213",
        "20012",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1752",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي نعيم، عن سفيان، عن زبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا أراد أن ينصرف قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا يرفع بها صوته ‏.‏ قال أبو عبد الرحمن أبو نعيم أثبت عندنا من محمد بن عبيد ومن قاسم بن يزيد وأثبت أصحاب سفيان عندنا والله أعلم يحيى بن سعيد القطان ثم عبد الله بن المبارك ثم وكيع بن الجراح ثم عبد الرحمن بن مهدي ثم أبو نعيم ثم الأسود في هذا الحديث ‏.‏ ورواه جرير بن حازم عن زبيد فقال يمد صوته في الثالثة ويرفع ‏.‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza that his father said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it.\"",
      "chain": [
        "34188",
        "20348",
        "20012",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1753",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا حرمي بن يونس بن محمد، قال حدثنا أبي قال، حدثنا جرير، قال سمعت زبيدا، يحدث عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وإذا سلم قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يمد صوته في الثالثة ثم يرفع ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that his father said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the third time, then raising it.\"",
      "chain": [
        "4057",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1862",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني زبيد، عن إبراهيم، عن مسروق، عن عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس منا من ضرب الخدود وشق الجيوب ودعا بدعوى الجاهلية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that the Prophet said:                     \"He is not one of us who strikes his cheeks, rends his garment, and calls the calls of the Jahiliyyah.\"",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11335",
        "11051",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1864",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن زبيد، عن إبراهيم، عن مسروق، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس منا من ضرب الخدود وشق الجيوب ودعا بدعوى الجاهلية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that the Prophet said:                     \"He is not one of us who strikes his cheeks, rends his garment, and calls the calls of the Jahiliyyah.\"",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11335",
        "11051",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "4110",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن زبيد، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قلت لأبي وائل سمعته من عبد الله قال نعم ‏.‏",
      "text_en": " It was narrated from Sufyan bin Zubaid, from Abu Wa'il, from 'Abdullah:                     \"The Messenger of Allah [SAW] said: 'Defaming a Muslim is evildoing and fighting him is Kufr.'\" I said to Abu Wa'il: \"Did you hear it from 'Abdullah?\" He said: \"Yes.\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4429",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن محمد، - وهو النفيلي - قال حدثنا زهير، ح وأنبأنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا زهير، قال حدثنا زبيد بن الحارث، عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن ثلاث عن زيارة القبور فزوروها ولتزدكم زيارتها خيرا ونهيتكم عن لحوم الأضاحي بعد ثلاث فكلوا منها وأمسكوا ما شئتم ونهيتكم عن الأشربة في الأوعية فاشربوا في أى وعاء شئتم ولا تشربوا مسكرا ‏\"‏ ‏.‏ ولم يذكر محمد ‏\"‏ وأمسكوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                     \" The Messenger of Allah said: 'I used to forbid you from doing three things: to visit graves, but now visit three, for you may benefit from that. And I used to forbid you (from eating) the meat of sacrificial animals after three days but now eat it, and keep whatever you want. A and I forbade you to drink form (certain kinds of) vessels, but now drink form whatever kind of vessel you want but do not drink any kind of intoxicant.\" (Sahih )Muhammad (one of the narrators) did not mention: \"kept (whatever you want).",
      "chain": [
        "38433",
        "30352",
        "20321",
        "38591",
        "20418",
        "20321",
        "11335",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5653",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى بن معدان الحراني، قال حدثنا الحسن بن أعين، قال حدثنا زهير، قال حدثنا زبيد، عن محارب، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن ثلاث زيارة القبور فزوروها ولتزدكم زيارتها خيرا ونهيتكم عن لحوم الأضاحي بعد ثلاث فكلوا منها ما شئتم ونهيتكم عن الأشربة في الأوعية فاشربوا في أى وعاء شئتم ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'I used to forbid three things to you: Visiting graves, but now visit them, and may visiting them increase you in goodness; and I forbade you (to store) the sacrificial meat for more than three days, but now eat whatever you wish of it. And I forbade to you drinks in (certain kinds of ) vessels, but now drink from whatever vessel you wish, but do not drink any intoxicant.'\"",
      "chain": [
        "20418",
        "20321",
        "11335",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "686",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمرو، حدثنا عبد الرحمن بن مهدي، ح وحدثنا يحيى بن حكيم، حدثنا يزيد بن هارون، قالا حدثنا محمد بن طلحة، عن زبيد، عن مرة، عن عبد الله، قال حبس المشركون النبي  صلى الله عليه وسلم  عن صلاة العصر حتى غابت الشمس فقال ‏\"‏ حبسونا عن صلاة الوسطى ملأ الله قبورهم وبيوتهم نارا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The idolaters kept the Prophet from the 'Asr prayer until the sun had set. He said: 'They kept us from performing the middle prayer; may Allah fill their graves and their houses with fire.'\"",
      "chain": [
        "20033",
        "34280",
        "20472",
        "20604",
        "11335",
        "16"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن عمر، قال صلاة السفر ركعتان والجمعة ركعتان والعيد ركعتان تمام غير قصر على لسان محمد  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that ‘Umar said:                      “The prayer while traveling is twoRak’ah, and Friday is two Rak’ah, and ‘Eid is two Rak’ah.They arecomplete and are not shortened, as told by Muhammad (ﷺ).”",
      "chain": [
        "30201",
        "20587",
        "11335",
        "11196",
        "3"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، أنبأنا يزيد بن زياد بن أبي الجعد، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن عمر، قال صلاة السفر ركعتان وصلاة الجمعة ركعتان والفطر والأضحى ركعتان تمام غير قصر على لسان محمد  صلى الله عليه وسلم  ‏.‏",
      "text_en": " ‘Umarsaid:                      “The prayer when traveling is two Rak’ah, and Friday istwoRak’ah, and Al-Fitr and Al-Adha are two Rak’ah, complete, notshortened, as told by Muhammad (ﷺ).”",
      "chain": [
        "30212",
        "20352",
        "25362",
        "11335",
        "11196",
        "4052",
        "3"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، حدثنا الأعمش، عن طلحة، وزبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله  صلى الله عليه وسلم  يوتر ب ‏{سبح اسم ربك الأعلى}‏ و ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد‏}‏ ‏.‏",
      "text_en": " It wasnarrated that Ubayy bin Ka’b said:                      “The Messenger of Allah(ﷺ)used to perform Witr and recite: ‘Glorify the Name of your LordtheMost High.’, [Al-A’la (87)] ‘Say: O you disbelievers!”[Al-Kafirun(109)] and ‘Say: Allah is One.”. [Al-Ikhlas (112)]",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11356",
        "11335",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن زبيد اليامي، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  كان يوتر فيقنت قبل الركوع ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that the Messenger of Allah (ﷺ)usedto pray Witr and he would recite Qunut before Ruku’.",
      "chain": [
        "38412",
        "20462",
        "20012",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1651",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن، جميعا عن سفيان، عن زبيد، عن إبراهيم، عن مسروق، ح وحدثنا علي بن محمد، وأبو بكر بن خلاد قالا حدثنا وكيع، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس منا من شق الجيوب وضرب الخدود ودعا بدعوى الجاهلية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                      “Heis not one of us who tears his garments, strikes his cheeks,andcries with the cry of the Days of Ignorance.’”",
      "chain": [
        "38409",
        "20032",
        "30160",
        "20031",
        "10530",
        "20012",
        "11335",
        "11051",
        "11018",
        "38409",
        "30357",
        "20032",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "2361",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن علي الصيرفي أبو حفص، حدثنا ابن أبي عدي، عن شعبة، عن زبيد، عن إبراهيم، عن مسروق، عن عبد الله، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الربا ثلاثة وسبعون بابا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that the Prophet (ﷺ) said:                     \"There are seventy-three degrees of usury.\"",
      "chain": [
        "30153",
        "20276",
        "20020",
        "11335",
        "11051",
        "11018",
        "16"
      ]
    }
  ],
  "total_hadiths": 51
}