{
  "id": "11330",
  "name": "al-Harith bin Suwayd al-Tymy الحارث بن سويد التيمي",
  "full_name": "al-Harith bin Suwayd al-Tymy الحارث بن سويد التيمي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "B.Taym",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18106",
      "name": "Thmamh bin 'Uqba ثمامة بن عقبة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5654",
      "hadith_no": "5654",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سليمان، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي  رضى الله عنه  نهى النبي صلى الله عليه وسلم عن الدباء والمزفت‏.‏ حدثنا عثمان حدثنا جرير عن الأعمش بهذا‏.‏",
      "text_en": " Narrated `Ali:                     the Prophet forbade the use of Ad-Dubba' and Al Muzaffat.",
      "usc_msa_ref": "498",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11060",
        "11322",
        "11330",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-5707",
      "hadith_no": "5707",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله  رضى الله عنه  أتيت النبي صلى الله عليه وسلم في مرضه وهو يوعك وعكا شديدا، وقلت إنك لتوعك وعكا شديدا‏.‏ قلت إن ذاك بأن لك أجرين‏.‏ قال ‏\"‏ أجل ما من مسلم يصيبه أذى، إلا حات الله عنه خطاياه، كما تحات ورق الشجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited the Prophet during his ailments and he was suffering from a high fever. I said, \"You have a high fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is afflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"",
      "usc_msa_ref": "550",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-5708",
      "hadith_no": "5708",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال دخلت على رسول الله صلى الله عليه وسلم وهو يوعك فقلت يا رسول الله إنك توعك وعكا شديدا‏.‏ قال ‏\"‏ أجل إني أوعك كما يوعك رجلان منكم ‏\"‏‏.‏ قلت ذلك أن لك أجرين قال ‏\"‏ أجل ذلك كذلك، ما من مسلم يصيبه أذى شوكة فما فوقها، إلا كفر الله بها سيئاته، كما تحط الشجرة ورقها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited Allah's Apostle while he was suffering from a high fever. I said, \"O Allah's Apostle! You have a high fever.\" He said, \"Yes, I have as much fever as two men of you.\" I said, \"Is it because you will have a double reward?\" He said, \"Yes, it is so. No Muslim is afflicted with any harm, even if it were the prick of a thorn, but that Allah expiates his sins because of that, as a tree sheds its leaves.\"",
      "usc_msa_ref": "551",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-5722",
      "hadith_no": "5722",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، قال قال عبد الله بن مسعود دخلت على رسول الله صلى الله عليه وسلم وهو يوعك فمسسته بيدي فقلت يا رسول الله إنك توعك وعكا شديدا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل إني أوعك كما يوعك رجلان منكم ‏\"‏‏.‏ فقلت ذلك أن لك أجرين‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يصيبه أذى مرض فما سواه إلا حط الله له سيئاته كما تحط الشجرة ورقها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     I visited Allah's Apostle while he was suffering from a high fever. I touched him with my hand and said, \"O Allah's Apostle! You have a high fever.\" Allah's Apostle said, \"Yes, I have as much fever as two men of you have.\" I said, \"Is it because you will get a double reward?\" Allah's Apostle said, \"Yes, no Muslim is afflicted with harm because of sickness or some other inconvenience, but that Allah will remove his sins for him as a tree sheds its leaves.\"",
      "usc_msa_ref": "564",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11322",
        "11330"
      ]
    },
    {
      "id": "sahih-bukhari-5723",
      "hadith_no": "5723",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله  رضى الله عنه  قال أتيت النبي صلى الله عليه وسلم في مرضه فمسسته وهو يوعك وعكا شديدا فقلت إنك لتوعك وعكا شديدا، وذلك أن لك أجرين‏.‏ قال ‏\"‏ أجل، وما من مسلم يصيبه أذى إلا حاتت عنه خطاياه كما تحات ورق الشجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited the Prophet during his illness and touched him while he was having a fever. I said to him, \"You have a high fever; is it because you will get a double reward?\" He said, \"Yes. No Muslim is afflicted with any harm, but that his sins will be annulled as the leave of a tree fall down.\"",
      "usc_msa_ref": "565",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-5729",
      "hadith_no": "5729",
      "source": "Sahih Bukhari",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا موسى، حدثنا عبد العزيز بن مسلم، حدثنا سليمان، عن إبراهيم التيمي، عن الحارث بن سويد، عن ابن مسعود  رضى الله عنه  قال دخلت على النبي صلى الله عليه وسلم وهو يوعك فمسسته فقلت إنك لتوعك وعكا شديدا‏.‏ قال ‏\"‏ أجل كما يوعك رجلان منكم ‏\"‏‏.‏ قال لك أجران قال ‏\"‏ نعم ما من مسلم يصيبه أذى مرض فما سواه إلا حط الله سيئاته كما تحط الشجرة ورقها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     I visited the Prophet while he was having a high fever. I touched him an said, \"You have a very high fever\" He said, \"Yes, as much fever as two me of you may have.\" I said. \"you will have a double reward?\" He said, \"Yes No Muslim is afflicted with hurt caused by disease or some other inconvenience, but that Allah will remove his sins as a tree sheds its leaves.\"",
      "usc_msa_ref": "571",
      "chain": [
        "20040",
        "20253",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-6381",
      "hadith_no": "6381",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الأعمش، عن عمارة بن عمير، عن الحارث بن سويد، حدثنا عبد الله، حديثين أحدهما عن النبي صلى الله عليه وسلم والآخر عن نفسه، قال ‏\"‏ إن المؤمن يرى ذنوبه كأنه قاعد تحت جبل يخاف أن يقع عليه، وإن الفاجر يرى ذنوبه كذباب مر على أنفه ‏\"‏‏.‏ فقال به هكذا قال أبو شهاب بيده فوق أنفه‏.‏ ثم قال ‏\"‏ لله أفرح بتوبة عبده من رجل نزل منزلا، وبه مهلكة، ومعه راحلته عليها طعامه وشرابه، فوضع رأسه فنام نومة، فاستيقظ وقد ذهبت راحلته، حتى اشتد عليه الحر والعطش أو ما شاء الله، قال أرجع إلى مكاني‏.‏ فرجع فنام نومة، ثم رفع رأسه، فإذا راحلته عنده ‏\"‏‏.‏ تابعه أبو عوانة وجرير عن الأعمش‏.‏ وقال أبو أسامة حدثنا الأعمش حدثنا عمارة سمعت الحارث‏.‏ وقال شعبة وأبو مسلم عن الأعمش عن إبراهيم التيمي عن الحارث بن سويد‏.‏ وقال أبو معاوية حدثنا الأعمش عن عمارة عن الأسود عن عبد الله وعن إبراهيم التيمي عن الحارث بن سويد عن عبد الله‏.‏",
      "text_en": " Narrated Al-Harith bin Suwaid:                     `Abdullah bin Mas`ud related to us two narrations: One from the Prophet and the other from himself, saying: A believer sees his sins as if he were sitting under a mountain which, he is afraid, may fall on him; whereas the wicked person considers his sins as flies passing over his nose and he just drives them away like this.\" Abu Shihab (the sub-narrator) moved his hand over his nose in illustration. (Ibn Mas`ud added): Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than a man who encamps at a place where his life is jeopardized, but he has his riding beast carrying his food and water. He then rests his head and sleeps for a short while and wakes to find his riding beast gone. (He starts looking for it) and suffers from severe heat and thirst or what Allah wished (him to suffer from). He then says, 'I will go back to my place.' He returns and sleeps again, and then (getting up), he raises his head to find his riding beast standing beside him.\"",
      "usc_msa_ref": "320",
      "chain": [
        "30184",
        "11613",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "id": "sahih-bukhari-6518",
      "hadith_no": "6518",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عمر بن حفص، حدثني أبي، حدثنا الأعمش، قال حدثني إبراهيم التيمي، عن الحارث بن سويد، قال عبد الله قال النبي صلى الله عليه وسلم ‏\"‏ أيكم مال وارثه أحب إليه من ماله ‏\"‏‏.‏ قالوا يا رسول الله ما منا أحد إلا ماله أحب إليه‏.‏ قال ‏\"‏ فإن ماله ما قدم، ومال وارثه ما أخر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Who among you considers the wealth of his heirs dearer to him than his own wealth?\" They replied, \"O Allah's Apostle! There is none among us but loves his own wealth more.\" The Prophet said, \"So his wealth is whatever he spends (in Allah's Cause) during his life (on good deeds) while the wealth of his heirs is whatever he leaves after his death.\"",
      "usc_msa_ref": "449",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-5286",
      "hadith_no": "5286",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني زهير بن حرب، حدثنا  جرير، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، كلهم عن  الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي، قال نهى رسول الله صلى الله عليه وسلم أن ينتبذ في الدباء والمزفت ‏.‏ هذا حديث جرير ‏.‏ وفي حديث عبثر وشعبة أن النبي صلى الله عليه وسلم نهى عن الدباء والمزفت ‏.‏",
      "text_en": " 'Ali reported that Allah's Messenger (may peace be upon him) forbade to prepare Nabidh in gourd and varnished jar. This hadith has been narrated through another chain of transmitters with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "30022",
        "20028",
        "30126",
        "20173",
        "11060",
        "11322",
        "11330",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-6724",
      "hadith_no": "6724",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال دخلت على رسول الله صلى الله عليه وسلم وهو يوعك فمسسته بيدي فقلت يا رسول الله إنك لتوعك وعكا شديدا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل إني أوعك كما يوعك رجلان منكم ‏\"‏ ‏.‏ قال فقلت ذلك أن لك أجرين فقال رسول الله صلى الله عليه وسلم ‏\"‏ أجل ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يصيبه أذى من مرض فما سواه إلا حط الله به سيئاته كما تحط الشجرة ورقها ‏\"‏ ‏.‏ وليس في حديث زهير فمسسته بيدي ‏.‏",
      "text_en": " 'Abdullah reported:                      I visited Allah's Messenger (may peace be upon him) as he was running a high temperature. I touched his body with my hand and said to him: Allah's Messenger, you are running a high temperature, whereupon Allah's Messenger (may peace be upon him) said: Yes, it is so. I comparatively have a more severe fever than any one of you. I said: Is it because there is a double reward in store for you? Thereupon Allah's Messenger (may peace be upon him) said: Yes, it is so. And Allah's Messenger (may peace be upon him) again said: When a Muslim falls ill, his compensation is that his minor sins are obliterated just as leaves fall (in autumn). In the hadith transmitted on the authority of Zubair there is (no mention of these words):\" I touched his body with my hands.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30022",
        "30123",
        "30312",
        "4057",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-6807",
      "hadith_no": "6807",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، - واللفظ لقتيبة - قالا حدثنا جرير، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تعدون الرقوب فيكم ‏\"‏ ‏.‏ قال قلنا الذي لا يولد له ‏.‏ قال ‏\"‏ ليس ذاك بالرقوب ولكنه الرجل الذي لم يقدم من ولده شيئا ‏\"‏ ‏.‏ قال ‏\"‏ فما تعدون الصرعة فيكم ‏\"‏ ‏.‏ قال قلنا الذي لا يصرعه الرجال ‏.‏ قال ‏\"‏ ليس بذلك ولكنه الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported Allah's Messenger (may peace be upon him) as saying:                      Whom do you count as\" Raqub\" amongst you? They (his Companions) said: One who has no children (the children are born unto him but they do not survive). Thereupon he (the Holy Prophet) said: He is not a Raqub but Raqub is one who does not find his child as the forerunner (in Paradise). He then said: Whom do you count as a wrestler amongst you? We said: He who wrestles with persons. He said: No, it is not he but one who controls himself when in a fit of rage.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7131",
      "hadith_no": "7131",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لعثمان - قال إسحاق أخبرنا وقال، عثمان حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن الحارث بن، سويد قال دخلت على عبد الله أعوده وهو مريض فحدثنا بحديثين حديثا عن نفسه وحديثا عن رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لله أشد فرحا بتوبة عبده المؤمن من رجل في أرض دوية مهلكة معه راحلته عليها طعامه وشرابه فنام فاستيقظ وقد ذهبت فطلبها حتى أدركه العطش ثم قال أرجع إلى مكاني الذي كنت فيه فأنام حتى أموت ‏.‏ فوضع رأسه على ساعده ليموت فاستيقظ وعنده راحلته وعليها زاده وطعامه وشرابه فالله أشد فرحا بتوبة العبد المؤمن من هذا براحلته وزاده ‏\"‏ ‏.‏",
      "text_en": " Harith b. Suwaid said:                      I went to see 'Abdullah to inquire about his health as he was sick and he narrated to us a hadith of Allahs Messenger (may peace be upon him). He heard Allah's Messenger (may peace be upon him) as saying: Allah is more pleased with the repentance of His believing servant than a person who loses his riding beast carrying food and drink. He sleeps (being disappointed of its recovery) and then gets up and goes in search for that, until he is stricken with thirst. then comes back to the place where he had been before and goes to sleep completely exhausted placing his head upon his hands waiting for death. And when he gets up, lot there is before him his riding beast and his provisions of food and drink. Allah is more pleased with the repentance of His servant than the recovery of this riding beast along with the provisions (of food and drink).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30123",
        "30312",
        "30203",
        "20028",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "id": "sahih-muslim-7133",
      "hadith_no": "7133",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا عمارة، بن عمير قال سمعت الحارث بن سويد، قال حدثني عبد الله، حديثين أحدهما عن رسول الله صلى الله عليه وسلم والآخر عن نفسه فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ لله أشد فرحا بتوبة عبده المؤمن ‏\"‏ ‏.‏ بمثل حديث جرير ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      Allah is more pleased with the repentance of a believing man. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20318",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "id": "sunan-abi-daud-4779",
      "hadith_no": "4779",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تعدون الصرعة فيكم ‏\"‏ ‏.‏ قالوا الذي لا يصرعه الرجال ‏.‏ قال ‏\"‏ لا ولكنه الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " ‘ABD ALLAH (B. MAS’UD) REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING:                      WHOM DO YOU CONSIDER A WRESTLER AMONG YOU? THE PEOPLE REPLIED: (THE MAN) WHOM THE MEN CANNOT DEFEAT IN WRESTLING. HE SAID: NO, IT IS HE WHO CONTROLS HIMSELF WHEN HE IS ANGRY.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2685",
      "hadith_no": "2685",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، أخبرنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن الحارث بن سويد، حدثنا عبد الله بن مسعود، بحديثين أحدهما عن نفسه، والآخر، عن النبي صلى الله عليه وسلم قال عبد الله إن المؤمن يرى ذنوبه كأنه في أصل جبل يخاف أن يقع عليه وإن الفاجر يرى ذنوبه كذباب وقع على أنفه قال به هكذا فطار ‏.‏",
      "text_en": " Al-Harith bin Suwaid said:                     \" 'Abdullah [bin Mas'ud] narrated two Ahadith to us, one of them from himself and the other from the Prophet (s.a.w). 'Abdullah said: 'The believer sees his sins as if he was at the base of a mountain, fearing that it was about to fall upon him. The wicked person sees his sins as if (they are) flies are hitting his nose\" he said: \"Like this\" - motioning with his hand - \"to get them to fly away.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "id": "sunan-an-nasai-3612",
      "hadith_no": "3612",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيكم مال وارثه أحب إليه من ماله ‏\"‏‏.‏ قالوا يا رسول الله ما منا من أحد إلا ماله أحب إليه من مال وارثه‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اعلموا أنه ليس منكم من أحد إلا مال وارثه أحب إليه من ماله مالك ما قدمت ومال وارثك ما أخرت ‏\"‏‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"The Messenger of Allah said: 'For whom among you is the wealth of his heirs dearer to him than his own wealth?' They said: 'O Messenger of Allah, there is no one among us for whom his own wealth is not dearer to him than the wealth of his heirs.' The Messenger of Allah said: 'Know that there is no one among you for whom the wealth of his heirs is not dearer than his own wealth. Your wealth is that which you have sent on ahead, and the wealth of your heirs is that which you have kept.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5627",
      "hadith_no": "5627",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، عن سفيان، عن سليمان، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي، كرم الله وجهه عن النبي صلى الله عليه وسلم أنه نهى عن الدباء والمزفت ‏.‏",
      "text_en": " It was narrated from 'Ali - may Allah honor his face - that:                     The Prophet [SAW] forbade Ad-Dubba' (gourds) and Al-Muzaffat.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11060",
        "11322",
        "11330"
      ]
    },
    {
      "id": "sunan-ibn-majah-597",
      "hadith_no": "597",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت إبراهيم التيمي، يحدث عن الحارث بن سويد، عن عمرو بن ميمون، عن خزيمة بن ثابت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة أيام - أحسبه قال - ولياليهن للمسافر في المسح على الخفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khuzaimah bin Thabit that:                     The Prophet said: \"Three days.\" I think he said, \"And three nights during which the traveler may wipe over his leather socks.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11350",
        "11322",
        "11330",
        "11382",
        "410"
      ]
    }
  ],
  "total_hadiths": 18
}