{
  "id": "11334",
  "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
  "full_name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
  "grade": "Follower(Tabi') [1st Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "101",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  مخضرم ]"
    ],
    "tags": [
      "al-'Absi",
      "B.Ghatafan",
      "Makhdaram",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "19571",
      "name": "Wife Of Rabi' bin Harash امرأة ربعي بن حراش",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "siblings": [
    {
      "id": "10759",
      "name": "Rafi' Abu al-Ja'd al-Ghatafani رافع أبو الجعد الغطفاني",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5100",
      "name": "Tarq bin 'Abdullah ( طارق بن عبد الله المحاربي الكوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1040",
      "name": "K'ab bin 'Amr bin 'Ubbad ( أبو اليسر , كعب بن عمرو بن عباد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4026",
      "name": "Kharsha bin al-Hurr al-Fazari ( خرشة بن الحر الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15165",
      "name": "Zayd bin Zbyan زيد بن ظبيان",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10973",
      "name": "N'ym bin Abi Hnd نعيم بن أبي هند",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10708",
      "name": "'Amr bin Hrm al-Azdy عمرو بن هرم الأزدي البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19120",
      "name": "Hilal Client of Rab'i bin Harash هلال مولى ربعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "106",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن الجعد، قال أخبرنا شعبة، قال أخبرني منصور، قال سمعت ربعي بن حراش، يقول سمعت عليا، يقول قال النبي صلى الله عليه وسلم ‏\"‏ لا تكذبوا على، فإنه من كذب على فليلج النار ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet said, \"Do not tell a lie against me for whoever tells a lie against me (intentionally) then he will surely enter the Hell-fire.\"",
      "chain": [
        "20386",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "2077",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، أن ربعي بن حراش، حدثه أن حذيفة  رضى الله عنه  حدثه قال قال النبي صلى الله عليه وسلم ‏\"‏ تلقت الملائكة روح رجل ممن كان قبلكم قالوا أعملت من الخير شيئا قال كنت آمر فتياني أن ينظروا ويتجاوزوا عن الموسر قال قال فتجاوزوا عنه ‏\"‏‏.‏ وقال أبو مالك عن ربعي ‏\"‏ كنت أيسر على الموسر وأنظر المعسر ‏\"‏‏.‏ وتابعه شعبة عن عبد الملك عن ربعي‏.‏ وقال أبو عوانة عن عبد الملك عن ربعي ‏\"‏ أنظر الموسر، وأتجاوز عن المعسر ‏\"‏‏.‏ وقال نعيم بن أبي هند عن ربعي ‏\"‏ فأقبل من الموسر، وأتجاوز عن المعسر ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"Before your time the angels received the soul of a man and asked him, 'Did you do any good deeds (in your life)?' He replied, 'I used to order my employees to grant time to the rich person to pay his debts at his convenience.' So Allah said to the angels; \"Excuse him.\" Rabi said that (the dead man said), 'I used to be easy to the rich and grant time to the poor.' Or, in another narration, 'grant time to the well-off and forgive the needy,' or, 'accept from the well-off and forgive the needy.'",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2391",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ مات رجل، فقيل له قال كنت أبايع الناس، فأتجوز عن الموسر، وأخفف عن المعسر، فغفر له ‏\"‏‏.‏ قال أبو مسعود سمعته من النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     I heard the Prophet saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your life time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and (used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I heard the same (Hadith) from the Prophet.\"",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "3450",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن ربعي بن حراش، قال قال عقبة بن عمرو لحذيفة ألا تحدثنا ما سمعت من رسول الله صلى الله عليه وسلم قال إني سمعته يقول ‏\"‏ إن مع الدجال إذا خرج ماء ونارا، فأما الذي يرى الناس أنها النار فماء بارد، وأما الذي يرى الناس أنه ماء بارد فنار تحرق، فمن أدرك منكم فليقع في الذي يرى أنها نار، فإنه عذب بارد ‏\"‏‏.‏   قال حذيفة وسمعته يقول ‏\"‏ إن رجلا كان فيمن كان قبلكم أتاه الملك ليقبض روحه فقيل له هل عملت من خير قال ما أعلم، قيل له انظر‏.‏ قال ما أعلم شيئا غير أني كنت أبايع الناس في الدنيا وأجازيهم، فأنظر الموسر، وأتجاوز عن المعسر‏.‏ فأدخله الله الجنة ‏\"‏‏.‏   فقال وسمعته يقول ‏\"‏ إن رجلا حضره الموت، فلما يئس من الحياة أوصى أهله إذا أنا مت فاجمعوا لي حطبا كثيرا وأوقدوا فيه نارا حتى إذا أكلت لحمي، وخلصت إلى عظمي، فامتحشت، فخذوها فاطحنوها، ثم انظروا يوما راحا فاذروه في اليم‏.‏ ففعلوا، فجمعه فقال له لم فعلت ذلك قال من خشيتك‏.‏ فغفر الله له ‏\"‏‏.‏ قال عقبة بن عمرو، وأنا سمعته يقول ذاك، وكان نباشا‏.‏",
      "text_en": " Narrated Rabi bin Hirash:                     `Uqba bin `Amr said to Hudhaifa, \"Won't you relate to us of what you have heard from Allah's Apostle ?\" He said, \"I heard him saying, \"When Al-Dajjal appears, he will have fire and water along with him. What the people will consider as cold water, will be fire that will burn (things). So, if anyone of you comes across this, he should fall in the thing which will appear to him as fire, for in reality, it will be fresh cold water.\" Hudhaifa added, \"I also heard him saying, 'From among the people preceding your generation, there was a man whom the angel of death visited to capture his soul. (So his soul was captured) and he was asked if he had done any good deed.' He replied, 'I don't remember any good deed.' He was asked to think it over. He said, 'I do not remember, except that I used to trade with the people in the world and I used to give a respite to the rich and forgive the poor (among my debtors). So Allah made him enter Paradise.\" Hudhaifa further said, \"I also heard him saying, 'Once there was a man on his death-bed, who, losing every hope of surviving said to his family: When I die, gather for me a large heap of wood and make a fire (to burn me). When the fire eats my meat and reaches my bones, and when the bones burn, take and crush them into powder and wait for a windy day to throw it (i.e. the powder) over the sea. They did so, but Allah collected his particles and asked him: Why did you do so? He replied: For fear of You. So Allah forgave him.\" `Uqba bin `Amr said, \"I heard him saying that the Israeli used to dig the grave of the dead (to steal their shrouds).",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "hadith_no": "3479",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن ربعي بن حراش، قال قال عقبة لحذيفة ألا تحدثنا ما سمعت من النبي صلى الله عليه وسلم‏.‏ قال سمعته يقول ‏\"‏ إن رجلا حضره الموت، لما أيس من الحياة، أوصى أهله إذا مت فاجمعوا لي حطبا كثيرا، ثم أوروا نارا حتى إذا أكلت لحمي، وخلصت إلى عظمي، فخذوها فاطحنوها، فذروني في اليم في يوم حار أو راح‏.‏ فجمعه الله، فقال لم فعلت قال خشيتك‏.‏ فغفر له ‏\"‏‏.‏ قال عقبة وأنا سمعته يقول‏.‏ حدثنا موسى حدثنا أبو عوانة حدثنا عبد الملك وقال ‏\"‏ في يوم راح ‏\"‏‏.‏",
      "text_en": " Narrated Rabi` bin Hirash:                     `Uqba said to Hudhaifa, \"Won't you narrate to us what you heard from Allah's Apostle ?\" Hudhaifa said, \"I heard him saying, 'Death approached a man and when he had no hope of surviving, he said to his family, 'When I die, gather for me much wood and build a fire (to burn me),. When the fire has eaten my flesh and reached my bones, take the bones and grind them and scatter the resulting powder in the sea on a hot (or windy) day.' (That was done.) But Allah collected his particles and asked (him), 'Why did you do so?' He replied, 'For fear of You.' So Allah forgave him.\"Narrated `Abdu Malik:As above, saying, \"On a windy day.\"",
      "chain": [
        "30175",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أحمد بن يونس، عن زهير، حدثنا منصور، عن ربعي بن حراش، حدثنا أبو مسعود، عقبة قال قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة، إذا لم تستحي فافعل ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud `Uqba:                     The Prophet said, \"One of the sayings of the prophets which the people have got, is. 'If you do not feel ashamed, then do whatever you like.\"",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "3484",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن منصور، قال سمعت ربعي بن حراش، يحدث عن أبي مسعود، قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة إذا لم تستحي فاصنع ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mus'ud:                     The Prophet said, \"One of the sayings of the prophets which the people have got is, 'If you do not feel ashamed, then do whatever you like.\"",
      "chain": [
        "20404",
        "20020",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "6188",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، عن ربعي بن حراش، حدثنا أبو مسعود، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة الأولى إذا لم تستحي فاصنع ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet said, 'One of the sayings of the early Prophets which the people have got is: If you don't feel ashamed (from Haya': pious shyness from committing religeous indiscretions) do whatever you like.\" (See Hadith No 690, 691, Vol 4)",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "6385",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الملك، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ باسمك أموت وأحيا ‏\"‏‏.‏ وإذا قام قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet went to bed, he would say: \"Bismika amutu wa ahya.\" and when he got up he would say:\" Al-hamdu li l-lahil-ladhi ahyana ba'da ma amatana wa ilaihin-nushur.\"",
      "chain": [
        "20351",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6387",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده ثم يقول ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet went to bed at night, he would put his hand under his cheek and then say, \"Allahumma bismika amutu wa ahya,\" and when he got up, he would say, \"Al-Hamdu lil-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi an-nushur.\"",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6397",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أراد أن ينام قال ‏\"‏ باسمك اللهم أموت وأحيا ‏\"‏‏.‏ وإذا استيقظ من منامه قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا، وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet intended to go to bed, he would recite: \"Bismika Allahumma amutu wa ahya (With Your name, O Allah, I die and I live).\" And when he woke up from his sleep, he would say: \"Al-hamdu lil-lahil-ladhi ahyana ba'da ma amatana; wa ilaihi an-nushur (All the Praises are for Allah Who has made us alive after He made us die (sleep) and unto Him is the Resurrection). \"",
      "chain": [
        "20348",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6398",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر  رضى الله عنه  قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏‏.‏ فإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Whenever the Prophet lay on his bed, he used to say: \"Allahumma bismika amutu wa ahya,\" and when he woke up he would say: \"Al-hamdu lil-lahilladhi ahyana ba'da ma an atana, wa ilaihi an-nushur.\"",
      "chain": [
        "30349",
        "20458",
        "11067",
        "11334",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "6558",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن ربعي، عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كان رجل ممن كان قبلكم يسيء الظن بعمله، فقال لأهله إذا أنا مت فخذوني فذروني، في البحر في يوم صائف، ففعلوا به، فجمعه الله ثم قال ما حملك على الذي صنعت قال ما حملني إلا مخافتك‏.‏ فغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"There was a man amongst the people who had suspicion as to the righteousness of his deeds. Therefore he said to his family, 'If I die, take me and burn my corpse and throw my ashes into the sea on a hot (or windy) day.' They did so, but Allah, collected his particles and asked (him), What made you do what you did?' He replied, 'The only thing that made me do it, was that I was afraid of You.' So Allah forgave him.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7172",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "وقال غندر حدثنا شعبة، عن منصور، عن ربعي بن حراش، عن أبي بكرة، عن النبي صلى الله عليه وسلم‏.‏ ولم يرفعه سفيان عن منصور‏.‏",
      "text_en": "",
      "chain": [
        "20278",
        "20020",
        "11067",
        "11334",
        "3229"
      ]
    },
    {
      "hadith_no": "7217",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبدان، أخبرني أبي، عن شعبة، عن عبد الملك، عن ربعي، عن حذيفة، عن النبي صلى الله عليه وسلم قال في الدجال ‏\"‏ إن معه ماء ونارا، فناره ماء بارد، وماؤه نار ‏\"‏‏.‏ قال أبو مسعود أنا سمعته من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said about Ad-Dajjal that he would have water and fire with him: (what would seem to be) fire, would be cold water and (what would seem to be) water, would be fire.",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7483",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏‏.‏ وإذا أصبح قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Juhaifa:                     When the Prophet went to bed, he used to say, \"Allhumma bismika ahya wa amut.\" And when he got Up in the mornings he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana wa ilaihi-nnushur.\"",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7484",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر، قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏\"‏ باسمك نموت ونحيا، فإذا استيقظ قال الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     When the Prophet went to bed at night, he used to say: \"Bismika namutu wa nahya.\" And when he got up in the morning, he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi-nnushur.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11334",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "2",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن ربعي بن حراش، أنه سمع عليا، - رضى الله عنه - يخطب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكذبوا على فإنه من يكذب على يلج النار ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا عبد الصمد، أخبرنا شعبة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن أبي موسى، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ غير أن في حديث عياض الأشعري قال ‏\"‏ ليس منا ‏\"‏ ‏.‏ ولم يقل ‏\"‏ بريء ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30115",
        "20250",
        "20020",
        "11368",
        "11334",
        "41"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن سعد بن طارق، عن ربعي، عن حذيفة، قال كنا عند عمر فقال أيكم سمع رسول الله صلى الله عليه وسلم يذكر الفتن فقال قوم نحن سمعناه ‏.‏ فقال لعلكم تعنون فتنة الرجل في أهله وجاره قالوا أجل ‏.‏ قال تلك تكفرها الصلاة والصيام والصدقة ولكن أيكم سمع النبي صلى الله عليه وسلم يذكر الفتن التي تموج موج البحر قال حذيفة فأسكت القوم فقلت أنا ‏.‏ قال أنت لله أبوك ‏.‏ قال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تعرض الفتن على القلوب كالحصير عودا عودا فأى قلب أشربها نكت فيه نكتة سوداء وأى قلب أنكرها نكت فيه نكتة بيضاء حتى تصير على قلبين على أبيض مثل الصفا فلا تضره فتنة ما دامت السموات والأرض والآخر أسود مربادا كالكوز مجخيا لا يعرف معروفا ولا ينكر منكرا إلا ما أشرب من هواه ‏\"‏ ‏.‏ قال حذيفة وحدثته أن بينك وبينها بابا مغلقا يوشك أن يكسر ‏.‏ قال عمر أكسرا لا أبا لك فلو أنه فتح لعله كان يعاد ‏.‏ قلت لا بل يكسر ‏.‏ وحدثته أن ذلك الباب رجل يقتل أو يموت ‏.‏ حديثا ليس بالأغاليط ‏.‏ قال أبو خالد فقلت لسعد يا أبا مالك ما أسود مربادا قال شدة البياض في سواد ‏.‏ قال قلت فما الكوز مجخيا قال منكوسا ‏.‏",
      "text_en": " It is narrated on the authority of Hudhaifa:                      We were sitting in the company of Umar and he said: Who amongst you has heard the Messenger of Allah (may peace be upon him) talking about the turmoil? Some people said: It is we who heard it. Upon this be remarked: Perhaps by turmoil you presume the unrest of man in regard to his household or neighbour, they replied: Yes. He ('Umar) observed: Such (an unrest) would be done away with by prayer, fasting and charity. But who amongst you has heard from the Apostle (may peace be upon him) describing that turmoil which would come like the wave of the ocean. Hudhaifa said: The people hushed into silence, I replied: It is I. He ('Umar) said: Ye, well, your father was also very pious. Hudhaifa said: I heard the Messenger of Allah (may peace be, upon him ) observing: Temptations will be presented to men's hearts as reed mat is woven stick by stick and any heart which is impregnated by them will have a black mark put into it, but any heart which rejects them will have a white mark put in it. The result is that there will become two types of hearts: one white like a white stone which will not be harmed by any turmoil or temptation, so long as the heavens and the earth endure; and the other black and dust-coloured like a vessel which is upset, not recognizing what is good or rejecting what is abominable, but being impregnated with passion. Hudhaifa said: I narrated to him ('Umar): There is between you and that (turmoil) a closed door, but there is every likelihood of its being broken. 'Umar said: Would it be broken? You have, been rendered fatherless. Had it been opened, it would have been perhaps closed also. I said: No, it would be broken, and I narrated to him: Verily that door implies a person who would be killed or die. There is no mistake in this hadith. Abu Khalid narrated: I said to Sa'd, O Abu Malik, what do you mean by the term\" Aswad Murbadda\"? He replied: High degree of whiteness in blackness. I said: What is meant by\" Alkoozu Mujakhiyyan\"? He replied: A vessel turned upside down.",
      "chain": [
        "30212",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "387",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا مروان الفزاري، حدثنا أبو مالك الأشجعي، عن ربعي، قال لما قدم حذيفة من عند عمر جلس فحدثنا فقال إن أمير المؤمنين أمس لما جلست إليه سأل أصحابه أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتن وساق الحديث بمثل حديث أبي خالد ولم يذكر تفسير أبي مالك لقوله ‏\"‏ مربادا مجخيا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Rib'i (b. Hirash). When Hudhaifa came from 'Umar he sat down to narrate to us and said:                      Verily yesterday when I was sitting with the Commander of the believers he asked his companions: When amongst you retains in his memory the utterance of the Messenger of Allah (may peace be upon him) with regard to the turmoil? -and he cited the hadith like the hadith narrated on the authority of Abu Khalid, but he did not mention the exposition of his words (Murbaddan) and (Mujakhiyyan).",
      "chain": [
        "30421",
        "10766",
        "11334"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن المثنى، وعمرو بن علي، وعقبة بن مكرم العمي، قالوا حدثنا محمد بن أبي عدي، عن سليمان التيمي، عن نعيم بن أبي هند، عن ربعي بن حراش، عن حذيفة، أن عمر، قال من يحدثنا أو قال أيكم يحدثنا - وفيهم حذيفة - ما قال رسول الله صلى الله عليه وسلم في الفتنة قال حذيفة أنا ‏.‏ وساق الحديث كنحو حديث أبي مالك عن ربعي وقال في الحديث قال حذيفة حدثته حديثا ليس بالأغاليط وقال يعني أنه عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is transmitted by Rib'i b. Hirash. who narrated it on the authority of Hudhaifa that verily 'Umar said:                      Who would narrate to us or who amongst you would narrate to us (and Hudhaifa was one amongst them) what the Messenger of Allah (may peace be upon him) had said about the turmoil? Hudhaifa said: I will, and recited the hadith like that transmitted by Abu Malik on the authority of Rib'i and he observed in connection with this hadith that Hudhaifa remarked: I am narrating to you a hadith and it has no mistake, and said: That it is transmitted from he Messenger of Allah (may peace be upon him).",
      "chain": [
        "30170",
        "30153",
        "30441",
        "20276",
        "11289",
        "10973",
        "11334",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن طريف بن خليفة البجلي، حدثنا محمد بن فضيل، حدثنا أبو مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وأبو مالك عن ربعي، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله تبارك وتعالى الناس فيقوم المؤمنون حتى تزلف لهم الجنة فيأتون آدم فيقولون يا أبانا استفتح لنا الجنة ‏.‏ فيقول وهل أخرجكم من الجنة إلا خطيئة أبيكم آدم لست بصاحب ذلك اذهبوا إلى ابني إبراهيم خليل الله - قال - فيقول إبراهيم لست بصاحب ذلك إنما كنت خليلا من وراء وراء اعمدوا إلى موسى صلى الله عليه وسلم الذي كلمه الله تكليما ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقول لست بصاحب ذلك اذهبوا إلى عيسى كلمة الله وروحه ‏.‏ فيقول عيسى صلى الله عليه وسلم لست بصاحب ذلك ‏.‏ فيأتون محمدا صلى الله عليه وسلم فيقوم فيؤذن له وترسل الأمانة والرحم فتقومان جنبتى الصراط يمينا وشمالا فيمر أولكم كالبرق ‏\"‏ ‏.‏ قال قلت بأبي أنت وأمي أى شىء كمر البرق قال ‏\"‏ ألم تروا إلى البرق كيف يمر ويرجع في طرفة ‎03:43 م ‎19/‎01/‎2003ين ثم كمر الريح ثم كمر الطير وشد الرجال تجري بهم أعمالهم ونبيكم قائم على الصراط يقول رب سلم سلم حتى تعجز أعمال العباد حتى يجيء الرجل فلا يستطيع السير إلا زحفا - قال - وفي حافتى الصراط كلاليب معلقة مأمورة بأخذ من أمرت به فمخدوش ناج ومكدوس في النار ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفا ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira and Hudhaifa that the Messenger of Allah (may peace be upon him) said:                      Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Mubammad (may peace be upon him). He would then be permitted (to open the door of Paradise). Trust worthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell.",
      "chain": [
        "30476",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا علي بن مسهر، عن سعد بن طارق، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن حوضي لأبعد من أيلة من عدن والذي نفسي بيده إني لأذود عنه الرجال كما يذود الرجل الإبل الغريبة عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله وتعرفنا قال ‏\"‏ نعم تردون على غرا محجلين من آثار الوضوء ليست لأحد غيركم ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allab, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).",
      "chain": [
        "30203",
        "20345",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي مالك الأشجعي، عن ربعي، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فضلنا على الناس بثلاث جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض كلها مسجدا وجعلت تربتها لنا طهورا إذا لم نجد الماء ‏\"‏ ‏.‏ وذكر خصلة أخرى ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be npon him) said: We have been made to excel (other) people in three (things): Our rows have been made like the rows of the angels and the whole earth has been made a mosque for us, and its dust has been made a purifier for us in case water is not available. And he mentioned another characteristic too",
      "chain": [
        "30201",
        "20356",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1194",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said like this.",
      "chain": [
        "30216",
        "20366",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبي مالك، الأشجعي عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏ وفي رواية واصل المقضي بينهم ‏.‏",
      "text_en": " It is narrated by Abu Huraira and Huraira that the Messenger of Allah (may peace be upon him) said:                      It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2020",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن، حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هدينا إلى الجمعة وأضل الله عنها من كان قبلنا ‏\"‏ ‏.‏ فذكر بمعنى حديث ابن فضيل ‏.‏",
      "text_en": " Huraira reported Allah's Messenger (may peace be upon him) as saying:                      We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.",
      "chain": [
        "30216",
        "20366",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2375",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، كلاهما عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، في حديث قتيبة قال قال نبيكم صلى الله عليه وسلم وقال ابن أبي شيبة عن النبي صلى الله عليه وسلم قال ‏\"‏ كل معروف صدقة ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa and Abu Shaiba reported Allah's Messenger (may peace be upon him) as saying:                      Every act of goodness is sadaqa.",
      "chain": [
        "30367",
        "20469",
        "30201",
        "20431",
        "10766",
        "11334"
      ]
    },
    {
      "hadith_no": "4076",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا منصور، عن ربعي بن، حراش أن حذيفة، حدثهم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تلقت الملائكة روح رجل ممن كان قبلكم فقالوا أعملت من الخير شيئا قال لا ‏.‏ قالوا تذكر ‏.‏ قال كنت أداين الناس فآمر فتياني أن ينظروا المعسر ويتجوزوا عن الموسر - قال - قال الله عز وجل تجوزوا عنه ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported Allah's Messenger (may peace be upon him) as saying The angels took away the soul of a person who had lived among people who were before you. They (the angels) said:                      Did you do anything good? He said: No. they said: Try to recall. He said: I used to lend to people and order my servants to give respite to one in straitened circumstances and give allowance to the solvent, for Allah, the Exalted and Majestic, said (to the angels): You should ignore (his failing).",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "4077",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن حجر، وإسحاق بن إبراهيم، - واللفظ لابن حجر - قالا حدثنا جرير، عن المغيرة، عن نعيم بن أبي هند، عن ربعي بن حراش، قال اجتمع حذيفة وأبو مسعود فقال حذيفة ‏\"‏ رجل لقي ربه فقال ما عملت قال ما عملت من الخير إلا أني كنت رجلا ذا مال فكنت أطالب به الناس فكنت أقبل الميسور وأتجاوز عن المعسور ‏.‏ فقال تجاوزوا عن عبدي ‏\"‏ ‏.‏ قال أبو مسعود هكذا سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏",
      "text_en": " Hudhaifa reported:                      A person met his Lord (after death) and He said: What (good) did you do? He said: I did no good except this that I was a rich man, and I demanded from the people (the repayment of debt that I advanced to them). I, however, accepted that which the solvent gave and remitted (the debt) of the insolvent, whereupon He (the Lord) said: You should ignore (the faults) of My servant. Abu Mas'ud (Allah be pleased with him) said: This is what I heard Allah's Messenger (may peace be upon him) as saying.",
      "chain": [
        "20387",
        "30123",
        "20028",
        "166",
        "10973",
        "11334"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير عن ربعي بن حراش، عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فدخل الجنة فقيل له ما كنت تعمل قال فإما ذكر وإما ذكر ‏.‏ فقال إني كنت أبايع الناس فكنت أنظر المعسر وأتجوز في السكة أو في النقد ‏.‏ فغفر له ‏\"‏ ‏.‏ فقال أبو مسعود وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A person died and he entered Paradise. It was said to him What (act) did you do? (Either he recalled it himself or he was made to recall), he said I used to enter into transactions with people and I gave respite to the insolvent and did not show any strictness in case of accepting a coin or demanding cash payment. (For these acts of his) he was granted pardon. Abu Mas'ud said: I heard this from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4079",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن سعد بن طارق، عن ربعي، بن حراش عن حذيفة، قال ‏\"‏ أتي الله بعبد من عباده آتاه الله مالا فقال له ماذا عملت في الدنيا - قال ولا يكتمون الله حديثا - قال يا رب آتيتني مالك فكنت أبايع الناس وكان من خلقي الجواز فكنت أتيسر على الموسر وأنظر المعسر ‏.‏ فقال الله أنا أحق بذا منك تجاوزوا عن عبدي ‏\"‏ ‏.‏ فقال عقبة بن عامر الجهني وأبو مسعود الأنصاري هكذا سمعناه من في رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported:                      A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba b. 'Amir al-Juhani and Abu Mas'ud said: This is what we heard from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30200",
        "20326",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7437",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن ربعي بن حراش، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا المسلمان حمل أحدهما على أخيه السلاح فهما في جرف جهنم فإذا قتل أحدهما صاحبه دخلاها جميعا ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported Allah's Messenger (may peace be upon him) as saying:                      When two Muslims (confront each other) and the one amongst them attacks his brother with a weapon, both of them are at the brink of Hell-Fire. And when one of them kills his companion, both of them get into Hell-Fire.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "20173",
        "20020",
        "11067",
        "11334",
        "3229"
      ]
    },
    {
      "hadith_no": "7552",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأنا أعلم بما مع الدجال منه معه نهران يجريان أحدهما رأى العين ماء أبيض والآخر رأى العين نار تأجج فإما أدركن أحد فليأت النهر الذي يراه نارا وليغمض ثم ليطأطئ رأسه فيشرب منه فإنه ماء بارد وإن الدجال ممسوح العين عليها ظفرة غليظة مكتوب بين عينيه كافر يقرؤه كل مؤمن كاتب وغير كاتب ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20472",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7553",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن ربعي بن، حراش عن حذيفة، عن النبي صلى الله عليه وسلم أنه قال في الدجال ‏\"‏ إن معه ماء ونارا فناره ماء بارد وماؤه نار فلا تهلكوا ‏\"‏ ‏.‏   قال أبو مسعود وأنا سمعته من، رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa reported Allah's Messenger (may peace be upon him) as saying:                      the Dajjal would have with him water and fire and his fire would bays the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7555",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا علي بن حجر، حدثنا شعيب بن صفوان، عن عبد الملك بن عمير، عن ربعي، بن حراش عن عقبة بن عمرو أبي مسعود الأنصاري، قال انطلقت معه إلى حذيفة بن اليمان فقال له عقبة حدثني ما سمعت من رسول الله صلى الله عليه وسلم في الدجال ‏.‏ قال ‏\"‏ إن الدجال يخرج وإن معه ماء ونارا فأما الذي يراه الناس ماء فنار تحرق وأما الذي يراه الناس نارا فماء بارد عذب فمن أدرك ذلك منكم فليقع في الذي يراه نارا فإنه ماء عذب طيب ‏\"‏ ‏.‏   فقال عقبة وأنا قد، سمعته تصديقا، لحذيفة ‏.‏",
      "text_en": " 'Uqba b. 'Amr Abu Mas'ud al-Ansari reported:                      I went to Hudhaifa b. Yaman and said to him: Narrate what you have heard from Allah's Messenger (may peace be upon him) pertaining to the Dajjal. He said that the Dajjal would appear and there would be along with him water ant fire and what the people would see as water that would be fire and that would burn and what would appear as fire that would be water and any one of you who would see that should plunge in that which he sees as fire for it would be sweet, pure water, and 'Uqba said: I also heard it, testifying Hudhaifa.",
      "chain": [
        "20387",
        "20588",
        "11368",
        "11334"
      ]
    },
    {
      "hadith_no": "7557",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، - واللفظ لابن حجر قال إسحاق أخبرنا وقال ابن حجر، حدثنا جرير، عن المغيرة، عن نعيم بن أبي هند، عن ربعي، بن حراش قال اجتمع حذيفة وأبو مسعود فقال حذيفة ‏\"‏ لأنا بما مع الدجال أعلم منه إن معه نهرا من ماء ونهرا من نار فأما الذي ترون أنه نار ماء وأما الذي ترون أنه ماء نار فمن أدرك ذلك منكم فأراد الماء فليشرب من الذي يراه أنه نار فإنه سيجده ماء ‏\"‏ ‏.‏ قال أبو مسعود هكذا سمعت النبي صلى الله عليه وسلم يقول ‏.‏",
      "text_en": " Hudhaifa and Ibn Mas'ud met together. Hudhaifa said:                      I know more than you as to what there would be along with the Dajjal. There would be along with him two canals (one flowing with water) and the other one (having) fire (within it), and what you would see as fire would be water and what you would see as water would be fire. So he who amongst you is able to see that and is desirous of water should drink out of that which he sees as fire.",
      "chain": [
        "20387",
        "30021",
        "20028",
        "11072",
        "10973",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن منصور، عن ربعي، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام الرجل إلى الصلاة - أو إذا صلى أحدكم فلا يبزق أمامه ولا عن يمينه ولكن عن تلقاء يساره إن كان فارغا أو تحت قدمه اليسرى ثم ليقل به ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah al-Muharibi:                     The Messenger of Allah (ﷺ) said: When a man stands with the intention of saying prayer, or if any of you says prayer, he should not spit before him, nor at his right side; but he should do so at his left side, if there is a place for it; or he should spit under his left foot and then rub it off.",
      "chain": [
        "30480",
        "20327",
        "11067",
        "11334",
        "5100"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا جرير بن عبد الحميد الضبي، عن منصور بن المعتمر، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا الشهر حتى تروا الهلال أو تكملوا العدة ثم صوموا حتى تروا الهلال أو تكملوا العدة ‏\"‏ ‏.‏ قال أبو داود ورواه سفيان وغيره عن منصور عن ربعي عن رجل من أصحاب النبي صلى الله عليه وسلم لم يسم حذيفة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     The Prophet (ﷺ) said: Do not fast (for Ramadan) before the coming of the month until you sight the moon or complete the number (of thirty days); then fast until you sight the moon or complete the number (of thirty days).",
      "chain": [
        "30269",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2339",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، وخلف بن هشام المقرئ، قالا حدثنا أبو عوانة، عن منصور، عن ربعي بن حراش، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال اختلف الناس في آخر يوم من رمضان فقدم أعرابيان فشهدا عند رسول الله صلى الله عليه وسلم بالله لأهلا الهلال أمس عشية فأمر رسول الله صلى الله عليه وسلم الناس أن يفطروا زاد خلف في حديثه وأن يغدوا إلى مصلاهم ‏.‏",
      "text_en": " Narrated Rib'i b. Hirash:                     On the authority of a man from the Companions of the Prophet (ﷺ): People differed among themselves on the last day of Ramadan (about the appearance of the moon of Shawwal). Then two bedouins came and witnessed before the Prophet (ﷺ) swearing by Allah that they had sighted moon the previous evening. So the Messenger of Allah (ﷺ) commanded the people to break the fast. The narrator Khalaf has added in his version: \"and that they should proceed to the place of prayer (for 'Id)\".",
      "chain": [
        "30175",
        "30503",
        "20469",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن أبان بن صالح، عن منصور بن المعتمر، عن ربعي بن حراش، عن علي بن أبي طالب، قال خرج عبدان إلى رسول الله صلى الله عليه وسلم - يعني يوم الحديبية - قبل الصلح فكتب إليه مواليهم فقالوا يا محمد والله ما خرجوا إليك رغبة في دينك وإنما خرجوا هربا من الرق فقال ناس صدقوا يا رسول الله ردهم إليهم ‏.‏ فغضب رسول الله صلى الله عليه وسلم وقال ‏\"‏ ما أراكم تنتهون يا معشر قريش حتى يبعث الله عليكم من يضرب رقابكم على هذا ‏\"‏ ‏.‏ وأبى أن يردهم وقال ‏\"‏ هم عتقاء الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Some slaves (of the unbelievers) went out to the Messenger of Allah (ﷺ) on the day of al-Hudaybiyyah before treaty. Their masters wrote to him saying: O Muhammad, they have not gone out to you with an interest in your religion, but they have gone out to escape from slavery. Some people said: They have spoken the truth, Messenger of Allah, send them back to them. The Messenger of Allah (ﷺ) became angry and said: I do not see your restraining yourself from this action), group of Quraysh, but that Allah send someone to you who strike your necks. He then refused to return them, and said: They are emancipated (slaves) of Allah, the Exalted.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19897",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "4237",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن منصور، عن ربعي بن حراش، عن امرأته، عن أخت، لحذيفة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا معشر النساء أما لكن في الفضة ما تحلين به أما إنه ليس منكن امرأة تحلى ذهبا تظهره إلا عذبت به ‏\"‏ ‏.‏",
      "text_en": " Narrated A sister of Hudhayfah:                     The Prophet (ﷺ) as saying : You women folk, have in silver something with which you adorn yourselves. I assure you that any woman of you who adorns herself with gold which she displays will be punished for it.",
      "chain": [
        "30175",
        "20469",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "4254",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الرحمن، عن سفيان، عن منصور، عن ربعي بن حراش، عن البراء بن ناجية، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ تدور رحى الإسلام لخمس وثلاثين أو ست وثلاثين أو سبع وثلاثين فإن يهلكوا فسبيل من هلك وإن يقم لهم دينهم يقم لهم سبعين عاما ‏\"‏ ‏.‏ قال قلت أمما بقي أو مما مضى قال ‏\"‏ مما مضى ‏\"‏ ‏.‏ قال أبو داود من قال خراش فقد أخطأ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: The mill of Islam will go round till the year thirty-five, or thirty-six, or thirty-seven; then if they perish, they will have followed the path of those who perished before them, but if their religion is maintained, it will be maintained for seventy years. I asked: Does it mean seventy years which remain or seventy years which are gone by? He replied: It means (seventy years) that are gone by.Abu Dawud said: Those who recorded Khirash, the name of a narrator, are wrong. (The correct name is Hirash)",
      "chain": [
        "31160",
        "20033",
        "20012",
        "11067",
        "11334",
        "16"
      ]
    },
    {
      "hadith_no": "4315",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا الحسن بن عمرو، حدثنا جرير، عن منصور، عن ربعي بن حراش، قال اجتمع حذيفة وأبو مسعود فقال حذيفة لأنا بما مع الدجال أعلم منه إن معه بحرا من ماء ونهرا من نار فالذي ترون أنه نار ماء والذي ترون أنه ماء نار فمن أدرك ذلك منكم فأراد الماء فليشرب من الذي يرى أنه نار فإنه سيجده ماء ‏.‏ قال أبو مسعود البدري هكذا سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏",
      "text_en": " Hudhaifa and Abu Mas’ud got together and Hudhaifah said:                      I know best what the Dajjal (Antichrist) will have with him. He will have with him a sea of water and a river of fire, and what you see as fire will be water and what you sea as water will be fire. If any of you who lives up to that time and desires water, he should drink from what he sees as fire, for he will find it water. Abu Mas’ud al-Badri said: I heard the Messenger of Allah (ﷺ) say in this way.",
      "chain": [
        "11624",
        "20028",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "4797",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا شعبة، عن منصور، عن ربعي بن حراش، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة الأولى إذا لم تستح فافعل ما شئت ‏\"‏ ‏.‏",
      "text_en": " ABU MASUD REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING :                      ONE OF THE THINGS PEOPLE HAVE LEARNT FROM THE WORDS OF THE EARLIEST PROPHECY IS : IF YOU HAVE NO SHAME, DO WHAT YOU LIKE.",
      "chain": [
        "20164",
        "20020",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "4947",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، قال قال نبيكم صلى الله عليه وسلم ‏\"‏ كل معروف صدقة ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah said :                      Your prophet (May peace be upon him) said : Every good act is a SADAQAH (almsgiving).",
      "chain": [
        "28531",
        "20012",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "5049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا نام قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah said :                      when the prophet (May peace be upon him) lay down on his bed (at night), he would say: O Allah! In Thy name I die and live. When he awoke, he said: praise be to Allah who has given us life after causing us to die and to whom we shall be resurrected.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "5177",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن منصور، عن ربعي، قال حدثنا رجل، من بني عامر أنه استأذن على النبي صلى الله عليه وسلم وهو في بيت فقال ألج فقال النبي صلى الله عليه وسلم لخادمه ‏\"‏ اخرج إلى هذا فعلمه الاستئذان فقل له قل السلام عليكم أأدخل ‏\"‏ ‏.‏ فسمعه الرجل فقال السلام عليكم أأدخل فأذن له النبي صلى الله عليه وسلم فدخل ‏.‏",
      "text_en": " Narrated Rib'i:                     A man of Banu Amir told that he asked the Prophet (ﷺ) for permission (to enter the house) when he was in the house, saying: May I enter ? The Prophet (ﷺ) said to his servant: Go out to this (man) and teach him how to ask permission to enter the house, and say to him: \"Say : Peace be upon you. May I enter?\" The man heard it and said: Peace be upon you! May I enter ? The Prophet (ﷺ) permitted him and he entered.",
      "chain": [
        "30201",
        "20327",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "5178",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن منصور، عن ربعي بن حراش، قال حدثت أن رجلا من بني عامر استأذن على النبي صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود وكذلك حدثنا مسدد حدثنا أبو عوانة عن منصور عن ربعي ولم يقل عن رجل من بني عامر ‏.‏",
      "text_en": " Rib’i b. Hirash said I was told that a man of Banu ‘Amir asked the prophet (May peace be upon him) for permission to enter the house. He then mentioned the rest of the tradition to the same effect.Abu Dawud said:                      Similarly, Musaddad transmitted it to us saying that Abu 'Awanah related it to us from Mansur. He did not say: \"a man of Banu 'Amir\".",
      "chain": [
        "30480",
        "20327",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن منصور، عن ربعي، عن رجل، من بني عامر أنه استأذن على النبي صلى الله عليه وسلم بمعناه ‏.‏ قال فسمعته فقلت السلام عليكم أأدخل",
      "text_en": " Rib’i said that a man of Banu Amir told him that he asked permission of the prophet (May peace be upon him) to enter the house. He related the tradition to the same effect, saying :                      I heard it and so I said: Peace be upon you. May I enter?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "571",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سفيان، عن منصور، عن ربعي بن حراش، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كنت في الصلاة فلا تبزق عن يمينك ولكن خلفك أو تلقاء شمالك أو تحت قدمك اليسرى ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وابن عمر وأنس وأبي هريرة ‏.‏ قال أبو عيسى وحديث طارق حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قال وسمعت الجارود يقول سمعت وكيعا يقول لم يكذب ربعي بن حراش في الإسلام كذبة ‏.‏ قال وقال عبد الرحمن بن مهدي أثبت أهل الكوفة منصور بن المعتمر ‏.‏",
      "text_en": " Tariq bin Abdullah Al-Muharibi narrated that :                     the Messenger of Allah said: \"When you are in Salat then do not spit on your right, but behind you or toward your left, or under your left foot.\"",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11067",
        "11334",
        "5100"
      ]
    },
    {
      "hadith_no": "2295",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن منصور، عن ربعي بن حراش، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يؤمن عبد حتى يؤمن بأربع يشهد أن لا إله إلا الله وأني محمد رسول الله بعثني بالحق ويؤمن بالموت وبالبعث بعد الموت ويؤمن بالقدر ‏\"‏ ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah (s.a.w) said:                     'A slave (of Allah) shall not believe until he believes in four: The testimony of La Ilaha Illallah, and that I am the Messenger of Allah whom He sent with the Truth, and he believes in the death, and he believes in the Resurrection after death, and he believes in Al-Qadar.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "2296",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا النضر بن شميل، عن شعبة، نحوه إلا أنه قال ربعي عن رجل، عن علي، ‏.‏ قال أبو عيسى حديث أبي داود عن شعبة، عندي أصح من حديث النضر وهكذا روى غير واحد عن منصور عن ربعي عن علي ‏.‏ حدثنا الجارود قال سمعت وكيعا يقول بلغنا أن ربعيا لم يكذب في الإسلام كذبة ‏.‏",
      "text_en": " The narration of Abu Dawud from Shu'bah is more authentic in my view than the narration of An-Nadr. This is how it was reported by  more than one narrator from Mansur, from Ribi, from 'Ali. Al-Jarud narrated to us, he said:                     'I heard Waki' saying: 'It has been conveyed to me that Rabi' bin Hirash did not utter even one lie in Islam (i.e., after he professed Islam).'\"",
      "chain": [
        "30277",
        "20291",
        "20020",
        "11334",
        "11067",
        "11334",
        "38130"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا يحيى بن آدم، عن أبي بكر بن عياش، عن الأعمش، عن منصور، عن ربعي بن حراش، عن عبد الله بن مسعود، يرفعه قال ‏\"‏ ثلاثة يحبهم الله رجل قام من الليل يتلو كتاب الله ورجل تصدق صدقة بيمينه يخفيها أراه قال من شماله ورجل كان في سرية فانهزم أصحابه فاستقبل العدو ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وهو غير محفوظ ‏.‏ والصحيح ما روى شعبة وغيره عن منصور عن ربعي بن حراش عن زيد بن ظبيان عن أبي ذر عن النبي صلى الله عليه وسلم ‏.‏ وأبو بكر بن عياش كثير الغلط ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated a Marfu'narration:                     \"There are three whom Allah, the Mighty and Glorious, loves: A man who stood at night reciting the Book of Allah; a man who spent in charity with his right hand, concealing it\"- it seems to me he said \"from his left hand\"- \"and a man who was in a small expedition while his companions were decimated, yet he faced enemy.\"",
      "chain": [
        "30216",
        "20364",
        "20373",
        "11060",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "2767",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور بن المعتمر، قال سمعت ربعي بن حراش، يحدث عن زيد بن ظبيان، يرفعه إلى أبي ذر عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة يحبهم الله وثلاثة يبغضهم الله فأما الذين يحبهم الله فرجل أتى قوما فسألهم بالله ولم يسألهم بقرابة بينه وبينهم فمنعوه فتخلف رجل بأعقابهم فأعطاه سرا لا يعلم بعطيته إلا الله والذي أعطاه وقوم ساروا ليلتهم حتى إذا كان النوم أحب إليهم مما يعدل به نزلوا فوضعوا رءوسهم فقام أحدهم يتملقني ويتلو آياتي ورجل كان في سرية فلقي العدو فهزموا وأقبل بصدره حتى يقتل أو يفتح له ‏.‏ والثلاثة الذين يبغضهم الله الشيخ الزاني والفقير المختال والغني الظلوم ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr narrated that the Prophet(s.a.w) said:                     \"There are three whom Allah loves and three whom Allah hates. As for those whom Allah loves: Then a man who came to a people and asked them by Allah, and he did not ask them due to any relation between him and them, but they did not give him. So a man stayed behind them and gave him secretly, none knew about what he gave except Allah and the one he gave. And, a group of people who traveled the night until when sleep became more beloved to them than all the things that equal it and they lay their heads down, but a man stoop up humbling himself to Me and reciting My Ayat. And a man who was in a small expedition and met the enemy and they were vanquished, yet he faced them until he was killed or victory was granted to him. And the three whom Allah hates are, the old man who commits adultery, the arrogant poor man, and the oppressive rich man.\"",
      "chain": [
        "30160",
        "30170",
        "20173",
        "20020",
        "11067",
        "11334",
        "15165"
      ]
    },
    {
      "hadith_no": "2660",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري ابن بنت السدي، حدثنا شريك بن عبد الله، عن منصور بن المعتمر، عن ربعي بن حراش، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكذبوا على فإنه من كذب على يلج في النار ‏\"‏ ‏.‏ وفي الباب عن أبي بكر وعمر وعثمان والزبير وسعيد بن زيد وعبد الله بن عمرو وأنس وجابر وابن عباس وأبي سعيد وعمرو بن عبسة وعقبة بن عامر ومعاوية وبريدة وأبي موسى الغافقي وأبي أمامة وعبد الله بن عمر والمنقع وأوس الثقفي ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ قال عبد الرحمن بن مهدي منصور بن المعتمر أثبت أهل الكوفة ‏.‏ وقال وكيع لم يكذب ربعي بن حراش في الإسلام كذبة",
      "text_en": " Narrated 'Ali bin Abi Talib:                     that the Messenger of Allah (ﷺ) said: \"Do not lie upon me, for indeed whoever lies upon me, he will be admitted into the Fire.\"",
      "chain": [
        "35016",
        "20587",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "3398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، رضى الله عنهما أن النبي صلى الله عليه وسلم كان إذا أراد أن ينام وضع يده تحت رأسه ثم قال ‏\"‏ اللهم قني عذابك يوم تجمع عبادك أو تبعث عبادك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman [may Allah be pleased with him] narrated that:                     When the Prophet would sleep, he would put his hand under his head then say: “O Allah, safeguard me from Your Punishment the Day You gather [Your slaves] (Allahumma Qini Adhabaka Yawma Tajma’u [Ibadak])” or “You resurrect Your slaves (Tab’athu Ibadak).”",
      "chain": [
        "30421",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن عبد الملك بن عمير، عن ربعي، عن حذيفة بن اليمان، رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا أراد أن ينام قال ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيا نفسي بعد ما أماتها وإليه النشور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman [may Allah be pleased with him] narrated that when the Prophet wanted to sleep, he would say:                     “O Allah, in Your Name I dies and I live (Allahumma Bismika Amutu Wa Ahya).” And when he would wake, he would say: “Allah praise is due to Allah who revived my soul after causing its death and to Him is the resurrection (Al-Hamdulillah, Alladhi Ahya Nafsi Ba’da Ma Amataha Wa Ilaihin-Nushur).”",
      "chain": [
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن الصباح البزار، حدثنا سفيان بن عيينة، عن زائدة، عن عبد الملك بن عمير، عن ربعي، هو ابن حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتدوا باللذين من بعدي أبي بكر وعمر ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that the Messenger of Allah (ﷺ) said: \"Stick to the two after me, Abu Bakr and 'Umar.\"",
      "chain": [
        "30244",
        "20005",
        "20320",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا وكيع، عن سالم أبي العلاء المرادي، عن عمرو بن هرم، عن ربعي بن حراش، عن حذيفة، رضى الله عنه قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ إني لا أدري ما بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " Narrated Hudhaifah [may Allah be pleased with him]:                     \"We were sitting with the Prophet (ﷺ) and he said: 'I do not know how long I will be with you, so stick to the two after me,' and he signaled towards Abu Bakr and 'Umar.\"",
      "chain": [
        "30254",
        "20032",
        "10708",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن شريك، عن منصور، عن ربعي بن حراش، حدثنا علي بن أبي طالب، بالرحبة قال لما كان يوم الحديبية خرج إلينا ناس من المشركين فيهم سهيل بن عمرو وأناس من رؤساء المشركين فقالوا يا رسول الله خرج إليك ناس من أبنائنا وإخواننا وأرقائنا وليس لهم فقه في الدين وإنما خرجوا فرارا من أموالنا وضياعنا فارددهم إلينا ‏.‏ ‏\"‏ فإن لم يكن لهم فقه في الدين سنفقههم ‏\"‏ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معشر قريش لتنتهن أو ليبعثن الله عليكم من يضرب رقابكم بالسيف على الدين قد امتحن الله قلبه على الإيمان ‏\"‏ ‏.‏ قالوا من هو يا رسول الله فقال له أبو بكر من هو يا رسول الله وقال عمر من هو يا رسول الله قال ‏\"‏ هو خاصف النعل ‏\"‏ ‏.‏ وكان أعطى عليا نعله يخصفها ثم التفت إلينا علي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث ربعي عن علي ‏.‏ قال وسمعت الجارود يقول سمعت وكيعا يقول لم يكذب ربعي بن حراش في الإسلام كذبة ‏.‏ وأخبرني محمد بن إسماعيل عن عبد الله بن أبي الأسود قال سمعت عبد الرحمن بن مهدي يقول منصور بن المعتمر أثبت أهل الكوفة ‏.‏",
      "text_en": " Narrated Rib'i bin Hirash:                     \"At Ar-Rahbah, 'Ali narrated us: 'On the Day of (the Pledge of) Hudaibiyah, some people from the idolaters came out to us. Among them was Suhail bin 'Amr, and some people among the heads of the idolaters. They said: \"O Messenger of Allah! People among our fathers, brothers, and slaves have come to you, and they have no knowledge of the religion, rather they came fleeing from our wealth and property, so return them to us. If they do not have knowledge of the religion, then we will teach them.\" So the Prophet (ﷺ) said: \"O people of Quraish, you will desist, or Allah will send upon you one who will chop your necks with the sword over the religion. Allah has tested their hearts regarding faith.\" They said: \"Who is he O Messenger of Allah?\" Abu Bakr said to him:  \"Who is he O Messenger of Allah?\" 'Umar said to him:  \"Who is he O Messenger of Allah?\" He said: \"He is the one repairing the sandals.\" - And he had given 'Ali his sandals to repair them. - He said: \"Then 'Ali turned to us and said: 'Indeed the Messenger of Allah (ﷺ) said: \"Whoever lies upon me intentionally, then let him take his seat in the Fire.\"",
      "chain": [
        "35047",
        "11858",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن هلال، مولى ربعي عن ربعي بن حراش، عن حذيفة، قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ إني لا أدري ما قدر بقائي فيكم فاقتدوا باللذين من بعدي وأشار إلى أبي بكر وعمر واهتدوا بهدى عمار وما حدثكم ابن مسعود فصدقوه ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏ وروى إبراهيم بن سعد هذا الحديث عن سفيان الثوري عن عبد الملك بن عمير عن هلال مولى ربعي عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقد روى سالم المرادي كوفي عن عمرو بن هرم عن ربعي بن حراش عن حذيفة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن منصور، عن ربعي بن حراش، عن أبي الأبيض، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يصلي بنا العصر والشمس بيضاء محلقة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah (ﷺ) used to lead us in 'Asr prayer when the sun was still bright and high.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11334",
        "19"
      ]
    },
    {
      "hadith_no": "726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثني منصور، عن ربعي، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كنت تصلي فلا تبزقن بين يديك ولا عن يمينك وابصق خلفك أو تلقاء شمالك إن كان فارغا وإلا فهكذا ‏\"‏ ‏.‏ وبزق تحت رجله ودلكه ‏.‏",
      "text_en": " It was narrated that Tariq bin 'Abdullah Al-Muharibi said:                      'When you are praying, do not spit to the front or to your right. Spit behind you or to your left if there is no one there, otherwise do this.' And he spat beneath his foot and rubbed it.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11067",
        "11334",
        "5100"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عز وجل عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله عز وجل بنا فهدانا ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم لنا تبع يوم القيامة ونحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah (SWT) sent astray from Friday those who came before us, so the Jews had Saturday and the Christians had Sunday. Then Allah (SWT), the Mighty and Sublime, brought us and guided us to Friday, so there is Friday, Saturday and Sunday, and thus they will follow us on the Day of Resurrection. We are the last of the people of this world but the first on the Day of Resurrection for whom judgment will be passed before all other creatures.'\"",
      "chain": [
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1615",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، قال سمعت ربعيا، عن زيد بن ظبيان، رفعه إلى أبي ذر عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة يحبهم الله عز وجل رجل أتى قوما فسألهم بالله ولم يسألهم بقرابة بينه وبينهم فمنعوه فتخلفهم رجل بأعقابهم فأعطاه سرا لا يعلم بعطيته إلا الله عز وجل والذي أعطاه وقوم ساروا ليلتهم حتى إذا كان النوم أحب إليهم مما يعدل به نزلوا فوضعوا رءوسهم فقام يتملقني ويتلو آياتي ورجل كان في سرية فلقوا العدو فانهزموا فأقبل بصدره حتى يقتل أو يفتح له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Zabyan who attributed it to Abu Dharr that:                     The Prophet (ﷺ) said: \"There are three whom Allah (SWT) loves: A man who comes to some people and asks (to be given something) for the sake of Allah and not for the sake of their relationship, but they do not give him, so a man stayed behind and gave it to him in secret, and no one knew of his giving except Allah (SWT) and the one to whom he gave it. People who travel all night until sleep becomes dearer to them than anything equated with it, so they lay down their heads (and slept), then a man among them got up and started praying to Me and beseeching Me, reciting My Verses. And a man who was on a campaign and met the enemy and they fled, but he went forward (pursuing them) until he was killed or victory was granted.\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11067",
        "11334",
        "15165"
      ]
    },
    {
      "hadith_no": "2080",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن منصور، عن ربعي، عن حذيفة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان رجل ممن كان قبلكم يسيء الظن بعمله فلما حضرته الوفاة قال لأهله إذا أنا مت فأحرقوني ثم اطحنوني ثم اذروني في البحر فإن الله إن يقدر على لم يغفر لي ‏.‏ قال فأمر الله عز وجل الملائكة فتلقت روحه قال له ما حملك على ما فعلت قال يا رب ما فعلت إلا من مخافتك ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Messenger of Allah said:                     \"There was a man among those who came before you who thought badly of his deeds, so when death was approaching he said to his family: 'When I am dead, burn my body and grind up my bones, then scatter me in the sea, for if Allah gets hold of me, He will never forgive me.' But Allah commanded the angles to seize his soul. He said to him: 'What made you do what you did?' He said:: 'O Lord, I only did it  because I feared You.' So Allah forgave him.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2126",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن ربعي بن حراش، عن حذيفة بن اليمان، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقدموا الشهر حتى تروا الهلال قبله أو تكملوا العدة ثم صوموا حتى تروا الهلال أو تكملوا العدة قبله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ribii bin Hirash, from Hudhaifah bin Al-Yaman, that the Messenger of Allah said:                     \"Do not anticipate the month until you see the crescent before it, or you complete the number of days. Then fast until you see the new moon, or you complete the number of days.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2127",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن منصور، عن ربعي، عن بعض، أصحاب النبي صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا الشهر حتى تكملوا العدة أو تروا الهلال ثم صوموا ولا تفطروا حتى تروا الهلال أو تكملوا العدة ثلاثين ‏\"‏ ‏.‏ أرسله الحجاج بن أرطاة ‏.‏",
      "text_en": " It was narrated from Ribi that one of the Companions of the Prophet said:                     \"The Messenger of Allah said: 'D not anticipate the month until you complete the number, or you see the crescent. Then fast, and do not stop fasting until you see the crescent, or your complete thirty days.\"' (Sahih) Al-Hajjaj bin Artah reported it in a Mursal from.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "2128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن الحجاج بن أرطاة، عن منصور، عن ربعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فأتموا شعبان ثلاثين إلا أن تروا الهلال قبل ذلك ثم صوموا رمضان ثلاثين إلا أن تروا الهلال قبل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ribi said;\"the Messenger of Allah said:                      \"The Messenger of Allah said: 'When you see the crescent then fast, and when you see it, then stop fasting. If it is too cloudy then complete Shaban as thirty days, unless you see the crescent before that, then fast Ramadan as thirty days, unless you see the new crescent before that.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20580",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "2570",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، قال سمعت ربعيا، يحدث عن زيد بن ظبيان، رفعه إلى أبي ذر عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة يحبهم الله عز وجل وثلاثة يبغضهم الله عز وجل أما الذين يحبهم الله عز وجل فرجل أتى قوما فسألهم بالله عز وجل ولم يسألهم بقرابة بينه وبينهم فمنعوه فتخلفه رجل بأعقابهم فأعطاه سرا لا يعلم بعطيته إلا الله عز وجل والذي أعطاه وقوم ساروا ليلتهم حتى إذا كان النوم أحب إليهم مما يعدل به نزلوا فوضعوا رءوسهم فقام يتملقني ويتلو آياتي ورجل كان في سرية فلقوا العدو فهزموا فأقبل بصدره حتى يقتل أو يفتح الله له والثلاثة الذين يبغضهم الله عز وجل الشيخ الزاني والفقير المختال والغني الظلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Zibyan, and attributed to Abu Dharr, that the Prophet said:                     \"There are three whom Allah, the Mighty and Sublime, loves, and three whom Allah, the Mighty and Sublime, hates. As for those whom Allah, the Mighty and Sublime, loves: A man who comes to some people and asks (to be given something) for the sake of Allah, the Mighty and Sublime, and not for the sake of their relationship, but they do not give him. So one man stayed behind and gave to him in secret, and no one knew of his giving except Allah, the Mighty and Sublime, and the one to whom he gave it. People who travel all night until sleep becomes dearer to them than anything that may be equivalent to it, so they lay down their heads (and slept). Then a man among them got up and started praying to Me and beseeching Me, reciting MY Ayat. And a man who was on a campaign and met the enemy and they fled, but he went forward (pursuing them) until he was killed or Allah, the Mighty and Sublime, granted victory to him. And three whom Allah hates are the old man who commits Zina, the poor man who shows off, and the rich man who is unjust.\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11067",
        "11334",
        "15165"
      ]
    },
    {
      "hadith_no": "4116",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، عن شعبة، قال أخبرني منصور، قال سمعت ربعيا، يحدث عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أشار المسلم على أخيه المسلم بالسلاح فهما على جرف جهنم فإذا قتله خرا جميعا فيها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"The Messenger of Allah [SAW] said: 'If a Muslim points a weapon at his fellow Muslim, then they are on the brink of Hell, and if he kills him, then they will both fall into it.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "11334",
        "3229"
      ]
    },
    {
      "hadith_no": "4117",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا سفيان، عن منصور، عن ربعي، عن أبي بكرة، قال إذا حمل الرجلان المسلمان السلاح أحدهما على الآخر فهما على جرف جهنم فإذا قتل أحدهما الآخر فهما في النار ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"If two Muslim men bear weapons against each other, then they are both on the brink of Hell. And if one of them kills the other, they will both be in Hell.\"",
      "chain": [
        "38022",
        "20372",
        "20012",
        "11067",
        "11334",
        "3229"
      ]
    },
    {
      "hadith_no": "5137",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا جرير، عن منصور، ح وأنبأنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن منصور، عن ربعي، عن امرأته، عن أخت، حذيفة قالت خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا معشر النساء أما لكن في الفضة ما تحلين أما إنه ليس من امرأة تحلت ذهبا تظهره إلا عذبت به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rib'i, from his wife, that the sister of Hudhaifah said:                     \"The Messenger of Allah [SAW] addressed us and said: 'O women, do you not have any silver to wear for adornment? For there is no woman among you who wears gold and shows it, but she will be punished because of it.'\"",
      "chain": [
        "20387",
        "20028",
        "11067",
        "30160",
        "20033",
        "20005",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "5138",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت منصورا، يحدث عن ربعي، عن امرأته، عن أخت، حذيفة قالت خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا معشر النساء أما لكن في الفضة ما تحلين أما إنه ليس منكن امرأة تحلى ذهبا تظهره إلا عذبت به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rib'i, from his wife, that the sister of Hudhaifah said:                     \"The Messenger of Allah [SAW] addressed us and said: 'O women, do you not have any silver to wear for adornment? For there is no woman among you who wears gold and shows it, but she will be punished because of it.'\"",
      "chain": [
        "30449",
        "20288",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، وإسماعيل بن موسى، قالا حدثنا شريك، عن منصور، عن ربعي بن حراش، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تكذبوا على فإن الكذب على يولج النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from that 'Ali said:                     \"The Messenger of Allah (ﷺ) said: 'Do not tell lies about me, for telling lies about me leads to Hell (Fire).\"",
      "chain": [
        "30467",
        "35016",
        "20587",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "85",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك، عن منصور، عن ربعي، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يؤمن عبد حتى يؤمن بأربع بالله وحده لا شريك له وأني رسول الله وبالبعث بعد الموت والقدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah (ﷺ) said: 'No slave truly believes until he believes in four things: in Allah alone with no partner; that I am the Messenger of Allah; in the resurrection after death; and in the Divine Decree (Qadar).'\"",
      "chain": [
        "30467",
        "20587",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا مؤمل، قالا حدثنا سفيان، عن عبد الملك بن عمير، عن مولى، لربعي بن حراش عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لا أدري قدر بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Yaman said:                     \"The Messenger of Allah said: 'I do not know howlong I will stay among you, so follow the example of these two after I am gone,' and he pointed to Abu Bakr and 'Umar.\"",
      "chain": [
        "38409",
        "20032",
        "30160",
        "30180",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن منصور، عن ربعي بن حراش، عن طارق بن عبد الله المحاربي، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ إذا صليت فلا تبزقن بين يديك ولا عن يمينك ولكن ابزق عن يسارك أو تحت قدمك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Tariq bin ‘Abdullah Al-Muharibi said:                      “TheProphet(ﷺ) said: ‘When you perform prayer, do not spit in front ofyouor to your right, but spit to your left or beneath your feet.’”",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11067",
        "11334",
        "5100"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن المنذر، حدثنا ابن فضيل، حدثنا أبو مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، وعن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أضل الله عن الجمعة من كان قبلنا كان لليهود يوم السبت والأحد للنصارى فهم لنا تبع إلى يوم القيامة نحن الآخرون من أهل الدنيا والأولون المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Allah led those who came before us astray from Friday.Saturdaywas for the Jews and Sunday was for the Christians. And theywill lagbehind us until the Day of Resurrection. We are the last ofthe peopleof this world but we will be the first to be judged amongall ofcreation.’”",
      "chain": [
        "20356",
        "10766",
        "11334",
        "145",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2198",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، أن رجلا، من المسلمين رأى في النوم أنه لقي رجلا من أهل الكتاب فقال نعم القوم أنتم لولا أنكم تشركون تقولون ما شاء الله وشاء محمد ‏.‏ وذكر ذلك للنبي  صلى الله عليه وسلم  فقال ‏\"‏ أما والله إن كنت لأعرفها لكم قولوا ما شاء الله ثم شاء محمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that :                     a Muslim man saw in a dream that he met a man from among the People of the Book, who said: \"What good people you would be if only you were not committing Shirk. For you say: 'What Allah  wills and Muhammad wills.\"' He mentioned that to the Prophet (ﷺ) and he said: \"By Allah, I am aware of that. Say: 'What Allah wills then what Muhammad wills.\"'Another chain from Tufail bin Sakhbarah, the brother of 'Aishah by her mother, from the Prophet (ﷺ), with similar wording.",
      "chain": [
        "30288",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2199",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك، عن ربعي بن حراش، عن الطفيل بن سخبرة، أخي عائشة لأمها عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "hadith_no": "2513",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت ربعي بن حراش، يحدث عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فقيل له ما عملت - فإما ذكر أو ذكر - قال إني كنت أتجوز في السكة والنقد وأنظر المعسر ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Prophet (ﷺ) said:                     “A man died and it was said to him: 'What did you do?' Either he remembered or was reminded and said: 'I used to be easy going in coins and cash collecting debts due, and I used to give respite to (the debtor) who was in difficulty. So, Allah (SWT) forgave him.' ” Abu Masud said: “I heard that from the Messenger of Allah (ﷺ).”",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "3880",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان رسول الله  صلى الله عليه وسلم  إذا انتبه من الليل قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      “Whenever the Messenger of Allah (ﷺ) woke up in the morning, he would say: ‘Al-hamdu lillahil-ladhi ahyana ba’dama amatana wa ilayhi’n-nushur (Praise is to Allah Who has given us life after taking it from us, and unto Him is the Resurrection).’”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4100",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن ربعي بن حراش، عن أبي بكرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا المسلمان حمل أحدهما على أخيه السلاح فهما على جرف جهنم فإذا قتل أحدهما صاحبه دخلاها جميعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakrah that the Prophet (ﷺ) said:                      “Whenone Muslim wields his weapon against his brother, both of them are atthe edge of Hell, and if one of them kills the other, they will bothenter it.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11067",
        "11334",
        "3229"
      ]
    },
    {
      "hadith_no": "4185",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يدرس الإسلام كما يدرس وشى الثوب حتى لا يدرى ما صيام ولا صلاة ولا نسك ولا صدقة وليسرى على كتاب الله عز وجل في ليلة فلا يبقى في الأرض منه آية وتبقى طوائف من الناس الشيخ الكبير والعجوز يقولون أدركنا آباءنا على هذه الكلمة لا إله إلا الله فنحن نقولها ‏\"‏ ‏.‏ فقال له صلة ما تغني عنهم لا إله إلا الله وهم لا يدرون ما صلاة ولا صيام ولا نسك ولا صدقة فأعرض عنه حذيفة ثم ردها عليه ثلاثا كل ذلك يعرض عنه حذيفة ثم أقبل عليه في الثالثة فقال يا صلة تنجيهم من النار ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “Islam will wear out as embroidery on a garment wearsout, until no one will know what fasting, prayer, (pilgrimage) ritesand charity are. The Book of Allah will be taken away at night, andnot one Verse of it will be left on earth. And there will be somepeople left, old men and old women, who will say: “We saw ourfathers saying these words: ‘La ilaha illallah’ so we say themtoo.” Silah said to him: “What good will (saying): La ilahaillallah do them, when they do not know what fasting, prayer,(pilgrimage) rites and charity are?” Hudhaifah turned away fromhis. He repeated his question three times, and Hudhaifah turned awayfrom him each time. Then he turned to him on the third time and said:“O Silah! It will save them from Hell,” three times.",
      "chain": [
        "38409",
        "20354",
        "10766",
        "11334",
        "145"
      ]
    }
  ],
  "total_hadiths": 87
}