{
  "id": "11345",
  "name": "Sa'id bin Abi Barda سعيد بن أبي بردة",
  "full_name": "Sa'id bin Abi Barda سعيد بن أبي بردة",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Kufa"
    },
    "death": {
      "date_hijri": "168",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Asha'ri",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "19951",
      "name": "Yusuf bin Abi Barda يوسف بن أبي بردة بن أبي موسى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14044",
      "name": "Bilal bin Abi Barda بلال بن أبي بردة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11180",
      "name": "'Abdullah/Abu Bakr bin Hafs bin 'Umar عبد الله بن حفص بن عمر - أبو بكر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10821",
      "name": "Mjm' bin Yahya bin Yazid مجمع بن يحيى بن يزيد بن جارية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1467",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، حدثنا سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل مسلم صدقة ‏\"‏‏.‏ فقالوا يا نبي الله فمن لم يجد قال ‏\"‏ يعمل بيده فينفع نفسه ويتصدق ‏\"‏‏.‏ قالوا فإن لم يجد قال ‏\"‏ يعين ذا الحاجة الملهوف ‏\"‏‏.‏ قالوا فإن لم يجد‏.‏ قال ‏\"‏ فليعمل بالمعروف، وليمسك عن الشر فإنها له صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     from his father from his grandfather that the Prophet said, \"Every Muslim has to give in charity.\" The people asked, \"O Allah's Prophet! If someone has nothing to give, what will he do?\" He said, \"He should work with his hands and benefit himself and also give in charity (from what he earns).\" The people further asked, \"If he cannot find even that?\" He replied, \"He should help the needy who appeal for help.\" Then the people asked, \"If he cannot do that?\" He replied, \"Then he should perform good deeds and keep away from evil deeds and this will be regarded as charitable deeds.\"",
      "chain": [
        "20285",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "3038",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن شعبة، عن سعيد بن أبي بردة، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعث معاذا وأبا موسى إلى اليمن قال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ولا تختلفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     That his father said, \"The Prophet sent Mu`adh and Abu Musa to Yemen telling them. 'Treat the people with ease and don't be hard on them; give them glad tidings and don't fill them with aversion; and love each other, and don't differ.\"",
      "chain": [
        "30020",
        "20032",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "3862",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سعيد بن أبي بردة، عن أبيه، أتيت المدينة فلقيت عبد الله بن سلام  رضى الله عنه  فقال ألا تجيء فأطعمك سويقا وتمرا، وتدخل في بيت ثم قال إنك بأرض الربا بها فاش، إذا كان لك على رجل حق فأهدى إليك حمل تبن، أو حمل شعير أو حمل قت، فلا تأخذه، فإنه ربا‏.‏ ولم يذكر النضر وأبو داود ووهب عن شعبة البيت‏.‏",
      "text_en": " Narrated Abu Burda:                     When I came to Medina. I met `Abdullah bin Salam. He said, \"Will you come to me so that I may serve you with Sawiq (i.e. powdered barley) and dates, and let you enter a (blessed) house that in which the Prophet entered?\" Then he added, \"You are In a country where the practice of Riba (i.e. usury) is prevalent; so if somebody owe you something and he sends you a present of a load of chopped straw or a load of barley or a load of provender then do not take it, as it is Riba.\"",
      "chain": [
        "20193",
        "20020",
        "11345",
        "11901",
        "103"
      ]
    },
    {
      "hadith_no": "4386",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا خالد، عن الشيباني، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى الأشعري  رضى الله عنه  أن النبي صلى الله عليه وسلم بعثه إلى اليمن، فسأله عن أشربة تصنع بها، فقال ‏\"‏ وما هي ‏\"‏‏.‏ قال البتع والمزر‏.‏ فقلت لأبي بردة ما البتع قال نبيذ العسل، والمزر نبيذ الشعير‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ رواه جرير وعبد الواحد عن الشيباني عن أبي بردة‏.‏",
      "text_en": " Narrated Abi Burda:                     That Abu Musa Al-Ash`ari said that the Prophet had sent him to Yemen and he asked the Prophet about certain (alcoholic) drink which used to be prepared there The Prophet said, \"What are they?\" Abu Musa said, \"Al-Bit' and Al-Mizr?\" He said, \"Al-Bit is an alcoholic drink made from honey; and Al-Mizr is an alcoholic drink made from barley.\" The Prophet said, \"All intoxicants are prohibited.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4387",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا سعيد بن أبي بردة، عن أبيه، قال بعث النبي صلى الله عليه وسلم جده أبا موسى، ومعاذا إلى اليمن فقال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ‏\"‏‏.‏ فقال أبو موسى يا نبي الله، إن أرضنا بها شراب من الشعير المزر، وشراب من العسل البتع‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ فانطلقا فقال معاذ لأبي موسى كيف تقرأ القرآن قال قائما وقاعدا وعلى راحلته وأتفوقه تفوقا‏.‏ قال أما أنا فأنام وأقوم، فأحتسب نومتي كما أحتسب قومتي، وضرب فسطاطا، فجعلا يتزاوران، فزار معاذ أبا موسى، فإذا رجل موثق، فقال ما هذا فقال أبو موسى يهودي أسلم ثم ارتد‏.‏ فقال معاذ لأضربن عنقه‏.‏ تابعه العقدي ووهب عن شعبة‏.‏",
      "text_en": " Narrated Abu Burda:                     That the Prophet sent his (i.e. Abu Burda's) grandfather, Abu Musa and Mu`adh to Yemen and said to both of them \"Facilitate things for the people (Be kind and lenient) and do not make things difficult (for people), and give them good tidings, and do not repulse them and both of you should obey each other.\" Abu Musa said, \"O Allah's Prophet! In our land there is an alcoholic drink (prepared) from barley called Al-Mizr, and another (prepared) from honey, called Al-Bit\"' The Prophet said, \"All intoxicants are prohibited.\" Then both of them proceeded and Mu`adh asked Abu Musa, \"How do you recite the Qur'an?\" Abu Musa replied, \"I recite it while I am standing, sitting or riding my riding animals, at intervals and piecemeal.\" Mu`adh said, \"But I sleep and then get up. I sleep and hope for Allah's Reward for my sleep as I seek His Reward for my night prayer.\" Then he (i.e. Mu`adh) pitched a tent and they started visiting each other. Once Mu`adh paid a visit to Abu Musa and saw a chained man. Mu`adh asked, \"What is this?\" Abu Musa said, \"(He was) a Jew who embraced Islam and has now turned apostate.\" Mu`adh said, \"I will surely chop off his neck!\"",
      "chain": [
        "20285",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "6091",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا سعيد بن أبي بردة بن أبي موسى الأشعري، عن أبيه، عن جده، قال قال النبي صلى الله عليه وسلم ‏\"‏ على كل مسلم صدقة ‏\"‏‏.‏ قالوا فإن لم يجد قال ‏\"‏ فيعمل بيديه فينفع نفسه ويتصدق ‏\"‏‏.‏ قالوا فإن لم يستطع أو لم يفعل قال ‏\"‏ فيعين ذا الحاجة الملهوف ‏\"‏‏.‏ قالوا فإن لم يفعل قال ‏\"‏ فيأمر بالخير ‏\"‏‏.‏ أو قال ‏\"‏ بالمعروف ‏\"‏‏.‏ قال فإن لم يفعل قال ‏\"‏ فيمسك عن الشر، فإنه له صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet said, \"On every Muslim there is enjoined (a compulsory) Sadaqa (alms).\" They (the people) said, \"If one has nothing?' He said, \"He should work with his hands so that he may benefit himself and give in charity.\" They said, \"If he cannot work or does not work?\" He said, \"Then he should help the oppressed unhappy person (by word or action or both).\" They said, \"If he does not do it?\" He said, \"Then he should enjoin what is good (or said what is reasonable).' They said, \"If he does not do that''' He said, \"Then he should refrain from doing evil, for that will be considered for Him as a Sadaqa (charity) . \"",
      "chain": [
        "20404",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "6192",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني إسحاق، حدثنا النضر، أخبرنا شعبة، عن سعيد بن أبي بردة، عن أبيه، عن جده، قال لما بعثه رسول الله صلى الله عليه وسلم ومعاذ بن جبل قال لهما ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ‏\"‏‏.‏ قال أبو موسى يا رسول الله إنا بأرض يصنع فيها شراب من العسل، يقال له البتع، وشراب من الشعير، يقال له المزر‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     that when Allah's Apostle sent him and Mu`adh bin Jabal to Yemen, he said to them, \"Facilitate things for the people (treat the people in the most agreeable way), and do not make things difficult for them, and give them glad tidings, and let them not have aversion (i.e. to make the people hate good deeds) and you should both work in cooperation and mutual understanding, obey each other.\" Abu Musa said, \"O Allah's Apostle! We are in a land in which a drink named Al Bit' is prepared from honey, and another drink named Al-Mizr is prepared from barley.\" On that, Allah's Apostle said, \"All intoxicants (i.e. all alcoholic drinks) are prohibited.\"",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "7260",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن بشار، حدثنا العقدي، حدثنا شعبة، عن سعيد بن أبي بردة، قال سمعت أبي قال، بعث النبي صلى الله عليه وسلم أبي ومعاذ بن جبل على اليمن فقال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا، وتطاوعا ‏\"‏‏.‏ فقال له أبو موسى إنه يصنع بأرضنا البتع‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ وقال النضر وأبو داود ويزيد بن هارون ووكيع عن شعبة عن سعيد عن أبيه عن جده عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Burda:                     The Prophet sent my father and Mu`adh bin Jabal to Yemen and said (to them), \"Make things easy for the people and do not put hurdles in their way, and give them glad tiding, and don't let them have aversion (i.e. to make people to hate good deeds) and you both should work in cooperation and mutual understanding\" Abu Musa said to Allah's Apostle, \"In our country a special alcoholic drink called Al- Bit', is prepared (for drinking).\" The Prophet said, \"Every intoxicant is prohibited. \"",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "2380",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن شعبة، عن سعيد بن أبي، بردة عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل مسلم صدقة ‏\"‏ ‏.‏ قيل أرأيت إن لم يجد قال ‏\"‏ يعتمل بيديه فينفع نفسه ويتصدق ‏\"‏ ‏.‏ قال قيل أرأيت إن لم يستطع قال ‏\"‏ يعين ذا الحاجة الملهوف ‏\"‏ ‏.‏ قال قيل له أرأيت إن لم يستطع قال ‏\"‏ يأمر بالمعروف أو الخير ‏\"‏ ‏.‏ قال أرأيت إن لم يفعل قال ‏\"‏ يمسك عن الشر فإنها صدقة ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Abu Burda reported on the authority of his grandfather that the Apostle of Allah (may peace be upon him) said:                      Giving of Sadaqa is essential for every Muslim. It was said (to him): What do you say of him who does not find (the means) to do so? He said: Let him work with both his hands, thus doing benefit to himself and give Sadaqa. It was said to him: What about him who does not have (the means) to do so? He said: Then let him assist the needy, the aggrieved. It was said: What do you say of one who cannot even do this? He said: Then he should enjoin what is reputable or what is good. He said: What about him if he cannot do that? He (the Holy Prophet) said: He should then abstain from evil, for verify that is Sadaqa on his behalf.",
      "chain": [
        "30201",
        "20318",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "4623",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن شعبة، عن سعيد بن أبي بردة، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعثه ومعاذا إلى اليمن فقال ‏\"‏ يسرا ولا تعسرا وبشرا ولا تنفرا وتطاوعا ولا تختلفا ‏\"‏ ‏.‏",
      "text_en": " It has also been narrated by Sa'd b. Abu Burda through his father through his grandfather that the Prophet of Allah (may peace be upon him) sent him and Mu'adh (on a mission) to the Yemen, and said (by way of advising them):                      Show leniency (to the people) ; don't be hard upon them; give them glad tidings (of Divine favours in this world and the Hereafter) ; and do not create aversion. Work in collaboration and don't be divided.",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "4624",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، ح وحدثنا إسحاق بن إبراهيم، وابن أبي خلف عن زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، كلاهما عن سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث شعبة وليس في حديث زيد بن أبي أنيسة ‏\"‏ وتطاوعا ولا تختلفا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Buraida but for the last two words.",
      "chain": [
        "30377",
        "20005",
        "11081",
        "30123",
        "30464",
        "11201",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "5332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، - واللفظ لقتيبة - قالا حدثنا  وكيع، عن شعبة، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال بعثني النبي صلى الله عليه وسلم أنا ومعاذ بن جبل إلى اليمن فقلت يا رسول الله إن شرابا يصنع بأرضنا يقال له المزر من الشعير وشراب يقال له البتع من العسل فقال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported:                      Allah's Apostle (may peace be upon him) sent me and Mu'adh b. Jabal to Yemen. I said: Allah's Messenger, there is prepared in our land a wine out of barley which is known as Mizr (beer of our times) and a wine from honey which is known as Bit, (are these also forbidden? ), whereupon he said: Every intoxicant is forbidden.",
      "chain": [
        "30367",
        "30123",
        "20032",
        "20020",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، - واللفظ لابن أبي خلف - قالا حدثنا زكرياء بن عدي، حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن، أبي أنيسة عن سعيد بن أبي بردة، حدثنا أبو بردة، عن أبيه، قال بعثني رسول الله صلى الله عليه وسلم ومعاذا إلى اليمن فقال ‏\"‏ ادعوا الناس وبشرا ولا تنفرا ويسرا ولا تعسرا ‏\"‏ ‏.‏ قال فقلت يا رسول الله أفتنا في شرابين كنا نصنعهما باليمن البتع وهو من العسل ينبذ حتى يشتد والمزر وهو من الذرة والشعير ينبذ حتى يشتد قال وكان رسول الله صلى الله عليه وسلم قد أعطي جوامع الكلم بخواتمه فقال ‏\"‏ أنهى عن كل مسكر أسكر عن الصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      Allah's Messenger (may peace be upon him) sent me and Mu'adh to Yemen saying: Call people (to the path of righteousness) and give good tidings to the (people), and do not repel them, make things easy for them and do not make things difficult. I (Burda) said: Allah's Messenger, give us a religious verdict about two kinds of drinks which we prepare in Yemen. One is Bit' which is prepared from honey; it is a fermented Nabidh and is strong and turns into wine, and (the second is) Mizr which is prepared from millet and barley. Thereupon, Allah's Messenger (may peace be upon him), who had been gifted with the most eloquent and pithy expressions, said: I forbid you from every intoxicant that keeps you away from prayer.",
      "chain": [
        "30123",
        "30464",
        "30024",
        "11340",
        "11345",
        "1820"
      ]
    },
    {
      "hadith_no": "6154",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سعيد، - وهو ابن أبي بردة - عن أنس، قال خدمت رسول الله صلى الله عليه وسلم تسع سنين فما أعلمه قال لي قط لم فعلت كذا وكذا ولا عاب على شيئا قط ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      I served the Messenger of Allah (may peace be upon him) for nine years, and I do not know (of any instance) when he said to me: Why you have done this and that, and he never found fault with me in anything.",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "11345",
        "19"
      ]
    },
    {
      "hadith_no": "6629",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وعبد الله بن عمر بن أبان، كلهم عن حسين، - قال أبو بكر حدثنا حسين بن علي الجعفي، - عن مجمع بن يحيى، عن سعيد بن أبي بردة، عن أبي بردة، عن أبيه، قال صلينا المغرب مع رسول الله صلى الله عليه وسلم ثم قلنا لو جلسنا حتى نصلي معه العشاء - قال - فجلسنا فخرج علينا فقال ‏\"‏ ما زلتم ها هنا ‏\"‏ ‏.‏ قلنا يا رسول الله صلينا معك المغرب ثم قلنا نجلس حتى نصلي معك العشاء قال ‏\"‏ أحسنتم أو أصبتم ‏\"‏ ‏.‏ قال فرفع رأسه إلى السماء وكان كثيرا مما يرفع رأسه إلى السماء فقال ‏\"‏ النجوم أمنة للسماء فإذا ذهبت النجوم أتى السماء ما توعد وأنا أمنة لأصحابي فإذا ذهبت أتى أصحابي ما يوعدون وأصحابي أمنة لأمتي فإذا ذهب أصحابي أتى أمتي ما يوعدون ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      We offered the sunset prayer along with Allah's Apostle (may peace be upon him). We then said: If we sit (along with Allah's Messenger) and observe night prayer with him it would be very good, so we sat down and he came to us and said: You are still sitting here. I said: Allah's Messenger, we observed evening prayer with you, then we said: Let us sit down and observe night prayer along with you, whereupon he said: You have done well or you have done right. He then lifted his head towards the sky and it often happened that as he lifted his head towards the sky, he said: The stars are a source of security for the sky and when the stars disappear there comes to the sky, i. e. (it meets the same fate) as it has been promised (it would plunge into darkness). And I am a source of safety and security to my Companions and when I would go away there would fall to the lot (of my Companions) as they have been promised with and my Companions are a source of security for the Umma and as they would go there would fall to the lot of my Umma as (its people) have been promised.",
      "chain": [
        "30201",
        "30123",
        "11278",
        "20436",
        "20315",
        "10821",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7108",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير - واللفظ لابن نمير - قالا حدثنا أبو أسامة ومحمد بن بشر عن زكرياء بن أبي زائدة، عن سعيد بن أبي بردة، عن أنس بن، مالك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ليرضى عن العبد أن يأكل الأكلة فيحمده عليها أو يشرب الشربة فيحمده عليها ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      Allah is pleased with His servant who says: Al-Hamdu lillah While taking a morsel of food tnd while drinking.",
      "chain": [
        "30201",
        "11338",
        "11345",
        "19"
      ]
    },
    {
      "hadith_no": "7188",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان بن مسلم، حدثنا همام، حدثنا قتادة، أن عونا، وسعيد بن أبي بردة، حدثاه أنهما، شهدا أبا بردة يحدث عمر بن عبد العزيز عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يموت رجل مسلم إلا أدخل الله مكانه النار يهوديا أو نصرانيا ‏\"‏ ‏.‏ قال فاستحلفه عمر بن عبد العزيز بالله الذي لا إله إلا هو ثلاث مرات أن أباه حدثه عن رسول الله صلى الله عليه وسلم قال فحلف له - قال - فلم يحدثني سعيد أنه استحلفه ولم ينكر على عون قوله ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father that Allah's Apostle (may peace be upon him) said:                      No Muslim would die but Allah would admit in his stead a Jew or a Christian in Hell-Fire. 'Umar b. Abd al-'Aziz took an oath: By One besides Whom there is no god but He, thrice that his father had narrated that to him from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30201",
        "30106",
        "20297",
        "11019",
        "11345",
        "11010",
        "16070"
      ]
    },
    {
      "hadith_no": "3613",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا ابن أبي عروبة، عن قتادة، عن سعيد بن أبي بردة، عن أبيه، عن جده أبي موسى الأشعري، أن رجلين، ادعيا بعيرا أو دابة إلى النبي صلى الله عليه وسلم ليست لواحد منهما بينة فجعله النبي صلى الله عليه وسلم بينهما ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     Two men claimed a camel or an animal and brought the case to the Holy Prophet (ﷺ). But as neither of them produced any proof, the Holy Prophet (ﷺ) declared that they should share it equally.",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4278",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا كثير بن هشام، حدثنا المسعودي، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمتي هذه أمة مرحومة ليس عليها عذاب في الآخرة عذابها في الدنيا الفتن والزلازل والقتل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa:                     The Prophet (ﷺ) said: This people of mine is one to which mercy is shown. It will have no punishment in the next world, but its punishment in this world will be trials, earthquakes and being killed.",
      "chain": [
        "30203",
        "20633",
        "20724",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد، ومحمود بن غيلان، قالا حدثنا أبو أسامة، عن زكريا بن أبي زائدة، عن سعيد بن أبي بردة، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله ليرضى عن العبد أن يأكل الأكلة أو يشرب الشربة فيحمده عليها ‏\"‏ ‏.‏ قال وفي الباب عن عقبة بن عامر وأبي سعيد وعائشة وأبي أيوب وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه غير واحد عن زكريا بن أبي زائدة نحوه ولا نعرفه إلا من حديث زكريا بن أبي زائدة ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That the Prophet (ﷺ) said: \"Indeed Allah is pleased with the slave who, upon eating his food or drinking his drink, he praises Him for it.\"He said: There are narrations on this topic from 'Uqbah bin 'Amir, Abu Sa'eed, 'Aishah, Abu Ayyub, and Abu Hurairah.[Abu 'Eisa said:] This Hadith is Hasan. More than one narrator has reported it from Zakariyya bin Abi Za'idah similarly, and we do not know of it except through the narration of Zakariyya bin Abi Za'idah.",
      "chain": [
        "30480",
        "30277",
        "20318",
        "11338",
        "11345",
        "19"
      ]
    },
    {
      "hadith_no": "5382",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا سليمان بن حرب، قال حدثنا عمر بن علي، عن أبي عميس، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال أتاني ناس من الأشعريين فقالوا اذهب معنا إلى رسول الله صلى الله عليه وسلم فإن لنا حاجة‏.‏ فذهبت معهم فقالوا يا رسول الله استعن بنا في عملك‏.‏ قال أبو موسى فاعتذرت مما قالوا وأخبرت أني لا أدري ما حاجتهم فصدقني وعذرني‏.‏ فقال ‏\"‏ إنا لا نستعين في عملنا بمن سألنا ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"Some people from among the Ash'aris came to me and said: 'Go with us to the Messenger of Allah [SAW], for we have something to ask him.' So I went with them, and they said: 'O Messenger of Allah, use us to do your work.'\" Abu Musa said: \"I apologized for what they said, and I told him that I did not know what they were going to ask. He believed me and excused me, and said: 'We do not appoint for our work anyone who asks for that.'\"",
      "chain": [
        "38433",
        "20193",
        "20265",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5424",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الأعلى، قال حدثنا سعيد، عن قتادة، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، أن رجلين، اختصما إلى النبي صلى الله عليه وسلم في دابة ليس لواحد منهما بينة فقضى بها بينهما نصفين ‏.‏",
      "text_en": " It was narrated from Abu Musa:                     That two men referred a dispute to the Prophet [SAW] concerning an animal, and neither of them had any evidence, so he ruled that it be shared equally between them.",
      "chain": [
        "30153",
        "20246",
        "11168",
        "11019",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5595",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن عبد الله بن سويد بن منجوف، وعبد الله بن الهيثم، عن أبي داود، عن شعبة، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah [SAW] said: 'Every intoxicant is unlawful.'\"",
      "chain": [
        "34121",
        "30002",
        "20020",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1015",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو بدر، شجاع بن الوليد عن زياد بن خيثمة، عن أبي إسحاق، عن دارم، عن سعيد بن أبي بردة، عن أبي بردة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني قد بدنت فإذا ركعت فاركعوا وإذا رفعت فارفعوا وإذا سجدت فاسجدوا ولا ألفين رجلا يسبقني إلى الركوع ولا إلى السجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Musa said:                      “The Messenger of Allah (ﷺ)said: ‘Ihave gained weight, so when I bow, then bow, and when I standup,then stand up, and when I prostrate, then prostrate. I shouldneverfind anyone preceding me in bowing or prostration.’”",
      "chain": [
        "30212",
        "20328",
        "20585",
        "11049",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا إسحاق بن منصور، ومحمد بن معمر، وزهير بن محمد، قالوا حدثنا روح بن عبادة، حدثنا سعيد، عن قتادة، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، أن رسول الله صلى الله عليه وسلم اختصم إليه رجلان بينهما دابة وليس لواحد منهما بينة فجعلها بينهما نصفين ‏.‏",
      "text_en": " It was narrated from Abu Musa that :                     two men referred a dispute to the Messenger of Allah (ﷺ) concerning an animal, and neither of them had proof, so he ruled that it should be divided in half.",
      "chain": [
        "30313",
        "30172",
        "20394",
        "20229",
        "11168",
        "11019",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3516",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا شعبة، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Musa that the Messenger of Allah (ﷺ) said:                     “Everyintoxicant is unlawful.”",
      "chain": [
        "30160",
        "20547",
        "20020",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3816",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن مغيرة بن أبي الحر، عن سعيد بن أبي بردة بن أبي موسى، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لأستغفر الله وأتوب إليه في اليوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abu Burdah bin Abu Musa, from his father, that :                     his grandfather said: \"The Messenger of Allah (saas) said: 'I seek the forgivenenss of Allah and repent to Him seventy times each day.'\"",
      "chain": [
        "38409",
        "20032",
        "11345",
        "11901"
      ]
    }
  ],
  "total_hadiths": 27
}