{
  "id": "11343",
  "name": "Sa'd bin Iyas, Abu 'Amr Shaybani سعد بن إياس أبو عمرو الشيباني",
  "full_name": "Sa'd bin Iyas, Abu 'Amr Shaybani سعد بن إياس أبو عمرو الشيباني",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "96",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Shaybani",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2280",
      "name": "Jabla bin Harithah ( جبلة بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11681",
      "name": "al-Harith bin Shabayl الحارث بن شبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11663",
      "name": "al-Walid bin al-Yzar bin Hryth الوليد بن العيزار بن حريث العبدي الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18838",
      "name": "'Isa bin 'Abdur Rahman عيسى بن عبد الرحمن السلمي ثم البجلي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1200",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى  هو ابن يونس  عن إسماعيل، عن الحارث بن شبيل، عن أبي عمرو الشيباني، قال قال لي زيد بن أرقم إن كنا لنتكلم في الصلاة على عهد النبي صلى الله عليه وسلم، يكلم أحدنا صاحبه بحاجته حتى نزلت ‏{‏حافظوا على الصلوات‏}‏ الآية، فأمرنا بالسكوت‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     In the lifetime of the Prophet we used to speak while praying, and one of us would tell his needs to his companions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were ordered to remain silent while praying.",
      "chain": [
        "30309",
        "20347",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "2782",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحسن بن صباح، حدثنا محمد بن سابق، حدثنا مالك بن مغول، قال سمعت الوليد بن العيزار، ذكر عن أبي عمرو الشيباني، قال قال عبد الله بن مسعود  رضى الله عنه  سألت رسول الله صلى الله عليه وسلم قلت يا رسول الله أى العمل أفضل قال ‏\"‏ الصلاة على ميقاتها ‏\"‏‏.‏ قلت ثم أى‏.‏ قال ‏\"‏ ثم بر الوالدين ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ الجهاد في سبيل الله ‏\"‏‏.‏ فسكت عن رسول الله صلى الله عليه وسلم ولو استزدته لزادني‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     I asked Allah's Apostle, \"O Allah's Apostle! What is the best deed?\" He replied, \"To offer the prayers at their early stated fixed times.\" I asked, \"What is next in goodness?\" He replied, \"To be good and dutiful to your parents.\" I further asked, what is next in goodness?\" He replied, \"To participate in Jihad in Allah's Cause.\" I did not ask Allah's Apostle anymore and if I had asked him more, he would have told me more.",
      "chain": [
        "30244",
        "30209",
        "20358",
        "11663",
        "11343",
        "16"
      ]
    },
    {
      "hadith_no": "4576",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم في الصلاة يكلم أحدنا أخاه في حاجته حتى نزلت هذه الآية ‏{‏حافظوا على الصلوات والصلاة الوسطى وقوموا لله قانتين‏}‏ فأمرنا بالسكوت‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     We used to speak while in prayer. One of us used to speak to his brother (while in prayer) about his need, till the Verse was revealed:-- \"Guard strictly the (five obligatory) prayers, especially the middle (the Best) (`Asr) Prayer and stand before Allah with obedience (and not to speak to others during the prayers).\" Then we were ordered not to speak in the prayers.",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "7628",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني سليمان، حدثنا شعبة، عن الوليد،‏.‏ وحدثني عباد بن يعقوب الأسدي، أخبرنا عباد بن العوام، عن الشيباني، عن الوليد بن العيزار، عن أبي عمرو الشيباني، عن ابن مسعود  رضى الله عنه  أن رجلا، سأل النبي صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ الصلاة لوقتها، وبر الوالدين، ثم الجهاد في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     A man asked the Prophet \"What deeds are the best?\" The Prophet said: (1) To perform the (daily compulsory) prayers at their (early) stated fixed times, (2) To be good and dutiful to one's own parents. (3) and to participate in Jihad in Allah's Cause.\"",
      "chain": [
        "20160",
        "20020",
        "30199",
        "20431",
        "11352",
        "11663",
        "11343",
        "16"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا مروان الفزاري، حدثنا أبو يعفور، عن الوليد بن العيزار، عن أبي عمرو الشيباني، عن عبد الله بن مسعود، قال قلت يا نبي الله أى الأعمال أقرب إلى الجنة قال ‏\"‏ الصلاة على مواقيتها ‏\"‏ ‏.‏ قلت وماذا يا نبي الله قال ‏\"‏ بر الوالدين ‏\"‏ ‏.‏ قلت وماذا يا نبي الله قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported:                      I said: Messenger of Allah, which of the deeds (takes one) nearer to Paradise? He (the Holy Prophet) replied: Prayer at its proper time, I said: What next, Messenger of Allah? He replied: Kindness to the parents. I said: What next? He replied: Jihad in the cause of Allah.",
      "chain": [
        "11663",
        "11343",
        "16"
      ]
    },
    {
      "hadith_no": "266",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الحسن بن عبيد الله، عن أبي عمرو الشيباني، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل الأعمال - أو العمل - الصلاة لوقتها وبر الوالدين ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Abdullah that the Apostle of Allah observed:                      The best of' the deeds or deed is the (observance of) prayer at its proper time and kindness to the parents.",
      "chain": [
        "30203",
        "20028",
        "10755",
        "11343",
        "16"
      ]
    },
    {
      "hadith_no": "1231",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم في الصلاة يكلم الرجل صاحبه وهو إلى جنبه في الصلاة حتى نزلت ‏{‏ وقوموا لله قانتين‏}‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏",
      "text_en": " Zaid b. Arqam reported:                      We used to talk while engaged in prayer and a person talked with a companion on his side in prayer till (this verse) was revealed:\" And stand before Allah in devout obedience\" (ii, 238) and we were commanded to observe silence (in prayer) and were forbidden to speak.",
      "chain": [
        "30399",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "5005",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن أبي عمرو، الشيباني عن أبي مسعود الأنصاري، قال جاء رجل بناقة مخطومة فقال هذه في سبيل الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لك بها يوم القيامة سبعمائة ناقة كلها مخطومة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Mas'ud al-Ansari who said A man brought a muzzled she-camel and said:                      It is (offered) in the way of Allah. The Messenger of Allah (may peace be upon him) said: For this you will have seven hundred she-camels on the Day of Judgment all of which will be muzzled.",
      "chain": [
        "30021",
        "20028",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "5007",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب وابن أبي عمر - واللفظ لأبي كريب - قالوا حدثنا أبو معاوية، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود الأنصاري، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أبدع بي فاحملني فقال ‏\"‏ ما عندي ‏\"‏ ‏.‏ فقال رجل يا رسول الله أنا أدله على من يحمله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من دل على خير فله مثل أجر فاعله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Mas'ud al-Ansari who said:                      A man came to the Messenger of Allah (may peace be upon him) and said: My riding beast has been killed, so give me some animal to ride upon. He (the Holy Prophet) said: I have none with me. A man said: Messenger of Allah, I can guide him to one who will provide him with a riding beast. The Messenger of Allah (may peace be upon him) said: One who guides to something good has a reward similar to that of its doer.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "949",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كان أحدنا يكلم الرجل إلى جنبه في الصلاة فنزلت ‏{‏ وقوموا لله قانتين ‏}‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏",
      "text_en": " Zaid b. Arqam said ; One of us used to speak to the man standing by his side during prayer. Then the Quranic verse “ And stand up with devotion to Allah”",
      "chain": [
        "31167",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "5129",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود الأنصاري، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني أبدع بي فاحملني ‏.‏ قال ‏\"‏ لا أجد ما أحملك عليه ولكن ائت فلانا فلعله أن يحملك ‏\"‏ ‏.‏ فأتاه فحمله فأتى رسول الله صلى الله عليه وسلم فأخبره فقال رسول الله صلى الله عليه وسلم ‏\"‏ من دل على خير فله مثل أجر فاعله ‏\"‏ ‏.‏",
      "text_en": " Abu Mas’ud al-Ansari said :                      A man came to the prophet (May peace be upon him) and said: Messenger of Allah! I have been left without a mount. So give me a mount. He replied: I have no mount to give, but go to so and so; he may perhaps give you a mount. He then went to him and he gave him a mount. He came to the Messenger of Allah (May peace be upon him) and informed him about it. Thereupon the Messenger of Allah (May peace be upon him) said: if anyone guides someone to a good (deed), he will get the reward like the reward of the one who does it.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا مروان بن معاوية الفزاري، عن أبي يعفور، عن الوليد بن العيزار، عن أبي عمرو الشيباني، أن رجلا، قال لابن مسعود أى العمل أفضل قال سألت عنه رسول الله صلى الله عليه وسلم فقال ‏\"‏ الصلاة على مواقيتها ‏\"‏ ‏.‏ قلت وماذا يا رسول الله قال ‏\"‏ وبر الوالدين ‏\"‏ ‏.‏ قلت وماذا يا رسول الله قال ‏\"‏ والجهاد في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وقد روى المسعودي وشعبة وسليمان هو أبو إسحاق الشيباني وغير واحد عن الوليد بن العيزار هذا الحديث ‏.‏",
      "text_en": " Abu Amr Ash-Shaibani narrated:                     \"A man said to Ibn Mas'ud: 'Which deed is most virtuous?' He said: 'I asked Allah's Messenger (that). He said: \"Salat at the beginning of its time.\" I asked him: \"What is after that O Messenger of Allah?\" He said: \"Being dutiful to one's parents.\" I said: \"What is after that [O Messenger of Allah]?\" He said: \"Jihad in the Way of Allah.\"",
      "chain": [
        "30367",
        "20201",
        "11403",
        "11663",
        "11343"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم خلف رسول الله صلى الله عليه وسلم في الصلاة يكلم الرجل منا صاحبه إلى جنبه حتى نزلت ‏:‏ ‏(‏وقوموا لله قانتين ‏)‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏ قال وفي الباب عن ابن مسعود ومعاوية بن الحكم ‏.‏ قال أبو عيسى حديث زيد بن أرقم حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم ‏.‏ قالوا إذا تكلم الرجل عامدا في الصلاة أو ناسيا أعاد الصلاة ‏.‏ وهو قول سفيان الثوري وابن المبارك وأهل الكوفة ‏.‏ وقال بعضهم إذا تكلم عامدا في الصلاة أعاد الصلاة وإن كان ناسيا أو جاهلا أجزأه ‏.‏ وبه يقول الشافعي ‏.‏",
      "text_en": " Zaid bin Arqam narrated:                     \"We used to talk behind Allah's Messenger (S) during the Salat, a man among us would talk to his companions next to him until (the following) was revealed: And stand before Allah with obedience. (2:238) So we were ordered to be silent and prohibited from talking.\"",
      "chain": [
        "30242",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن المسعودي، عن الوليد بن العيزار، عن أبي عمرو الشيباني، عن ابن مسعود، قال سألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله أى الأعمال أفضل قال ‏\"‏ الصلاة لميقاتها ‏\"‏ ‏.‏ قلت ثم ماذا يا رسول الله قال ‏\"‏ بر الوالدين ‏\"‏ ‏.‏ قلت ثم ماذا يا رسول الله قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏ ثم سكت عني رسول الله صلى الله عليه وسلم ولو استزدته لزادني ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ رواه الشيباني وشعبة وغير واحد عن الوليد بن العيزار وقد روي هذا الحديث من غير وجه عن أبي عمرو الشيباني عن ابن مسعود ‏.‏ وأبو عمرو الشيباني اسمه سعد بن إياس ‏.‏",
      "text_en": " Ibn Mas'ud said:                     \"I asked the Messenger of Allah: 'O Messenger of Allah! Which is the most virtuous of deeds?' He said: 'Salat during its appropriate time.'I said: 'Then what, O Messenger of Allah?' He said: 'Being dutiful to ones parents.' I said: 'Then what, O Messenger of Allah?' He said: 'Jihad in the cause of Allah.'Then the messenger of Allah was silent,  and if I had asked him more, he would have tol me more.'\"",
      "chain": [
        "30304",
        "20025",
        "20724",
        "11663",
        "11343",
        "16"
      ]
    },
    {
      "hadith_no": "3253",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، ويزيد بن هارون، ومحمد بن عبيد، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم على عهد رسول الله صلى الله عليه وسلم في الصلاة فنزلت ‏:‏ ‏(‏وقوموا لله قانتين ‏)‏ فأمرنا بالسكوت ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     \"During the time of the Messenger of Allah (ﷺ), we would talk during Salat, so 'And stand before Allah with obedience (2:238) was revealed, ordering us to be silent.\"",
      "chain": [
        "30242",
        "20201",
        "20472",
        "30213",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "4185",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الجراح بن مخلد البصري، وغير، واحد، قالوا حدثنا محمد بن عمر بن الرومي، حدثنا علي بن مسهر، عن إسماعيل بن أبي خالد، عن أبي عمرو الشيباني، قال أخبرني جبلة بن حارثة، أخو زيد قال قدمت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله ابعث معي أخي زيدا ‏.‏ قال ‏\"‏ هو ذا ‏\"‏ ‏.‏ قال ‏\"‏ فإن انطلق معك لم أمنعه ‏\"‏ ‏.‏ قال زيد يا رسول الله والله لا أختار عليك أحدا ‏.‏ قال فرأيت رأى أخي أفضل من رأيي ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث ابن الرومي عن علي بن مسهر ‏.‏",
      "text_en": " Narrated Jabalah bin Harithah, the brother of Zaid:                     \"I came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, send my brother Zaid with me.' He said: 'Here he is.' He said: \"'If he goes with you, I will not prevent him.' Zaid said: 'O Messenger of Allah, by Allah, I will not choose anyone over you.'\" He said: \"So I considered the view of my brother to be better than my own view.\"",
      "chain": [
        "34044",
        "20345",
        "11418",
        "11343",
        "2280"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يحيى بن سعيد، قال حدثنا إسماعيل بن أبي خالد، قال حدثني الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كان الرجل يكلم صاحبه في الصلاة بالحاجة على عهد رسول الله صلى الله عليه وسلم حتى نزلت هذه الآية ‏{‏ حافظوا على الصلوات والصلاة الوسطى وقوموا لله قانتين ‏}‏ فأمرنا بالسكوت ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                     \"We used to speak to each other during the prayer, saying whatever was necessary, at the time of the Messenger of Allah (ﷺ), until this verse was revealed: Guard strictly (five obligatory) As-Salawat (the prayers) especially the middle Salah (i.e. the best prayer- 'Asr). And stand before Allah with obedience (and do not speak to others during the Salah (prayers)), so we were commanded to be silent.\"",
      "chain": [
        "34033",
        "20031",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "3746",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، عن شريك، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that the Messenger of Allah(ﷺ) said:                     \"One who is consulted is entrusted.\"",
      "chain": [
        "30201",
        "20380",
        "20587",
        "11060",
        "11343",
        "402"
      ]
    }
  ],
  "total_hadiths": 18
}