{
  "id": "11349",
  "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
  "full_name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Ashja'i",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "31",
      "name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11658",
      "name": "Maysrah bin 'Ammar al-Ashja'i ميسرة بن عمار / تمام الأشجعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10845",
      "name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11429",
      "name": "Siyar Abu al-Hakam al-Anzi سيار أبو الحكم العنزي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11364",
      "name": "'Abdur Rahman bin 'Abd. bin al-Asbahani عبد الرحمن بن عبد الله بن الأصبهاني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11384",
      "name": "Farat bin Abi 'Abdur Rahman فرات بن أبي عبد الرحمن القزاز",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10973",
      "name": "N'ym bin Abi Hnd نعيم بن أبي هند",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20612",
      "name": "Harun bin Sa'd al-Jly هارون بن سعد العجلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "814",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن أبي حازم، عن سهل بن سعد، قال كان الناس يصلون مع النبي صلى الله عليه وسلم وهم عاقدو أزرهم من الصغر على رقابهم فقيل للنساء لا ترفعن رءوسكن حتى يستوي الرجال جلوسا‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The people used to pray with the Prophet tying their Izars around their necks because of their small sizes and the women were directed that they should not raise their heads from the prostrations till the men had sat straight.",
      "chain": [
        "28531",
        "20012",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "1215",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال كان الناس يصلون مع النبي صلى الله عليه وسلم وهم عاقدو أزرهم من الصغر على رقابهم، فقيل للنساء ‏\"‏ لا ترفعن رءوسكن حتى يستوي الرجال جلوسا ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The people used to offer the prayer with the Prophet with their waist-sheets tied round their necks because of the shortness of the sheets and the women were ordered not to lift their heads till the men had sat straight.",
      "chain": [
        "28531",
        "20012",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "1850",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن منصور، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حج هذا البيت، فلم يرفث ولم يفسق، رجع كما ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever performs Hajj to this House (Ka`ba) and does not approach his wife for sexual relations nor commits sins (while performing Hajj), he will come out as sinless as a newlyborn child. (Just delivered by his mother).",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1851",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من حج هذا البيت، فلم يرفث، ولم يفسق، رجع كيوم ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever performs Hajj to this Ka`ba and does not approach his wife for sexual relations nor commit sins (while performing Hajj), he will come out as sinless as a newborn child, (just delivered by his mother).",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2283",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن محمد بن جحادة، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن كسب الإماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet prohibited the earnings of slave girls (through prostitution).",
      "chain": [
        "20285",
        "20020",
        "18897",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2349",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أنه قال إنا كنا نفرح بيوم الجمعة، كانت لنا عجوز تأخذ من أصول سلق لنا كنا نغرسه في أربعائنا فتجعله في قدر لها فتجعل فيه حبات من شعير لا أعلم إلا أنه قال ليس فيه شحم ولا ودك، فإذا صلينا الجمعة زرناها فقربته، إلينا فكنا نفرح بيوم الجمعة من أجل ذلك وما كنا نتغدى ولا نقيل إلا بعد الجمعة‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     We used to be very happy on Friday as an old lady used to cut some roots of the Silq, which we used to plant on the banks of our small water streams, and cook them in a pot of her's, adding to them, some grains of barley. (Ya'qub, the sub-narrator said, \"I think the narrator mentioned that the food did not contain fat or melted fat (taken from meat).\") When we offered the Friday prayer we would go to her and she would serve us with the dish. So, we used to be happy on Fridays because of that. We used not to take our meals or the midday nap except after the Jumua prayer (i.e. Friday prayer).",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "2398",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك مالا فلورثته، ومن ترك كلا فإلينا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If someone leaves some property, it will be for the inheritors, and if he leaves some weak offspring, it will be for us to support them.\"",
      "chain": [
        "20296",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2568",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن أبي حازم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لو دعيت إلى ذراع أو كراع لأجبت، ولو أهدي إلى ذراع أو كراع لقبلت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I shall accept the invitation even if I were invited to a meal of a sheep's trotter, and I shall accept the gift even if it were an arm or a trotter of a sheep.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2570",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني محمد بن جعفر، عن أبي حازم، عن عبد الله بن أبي قتادة السلمي، عن أبيه  رضى الله عنه  قال كنت يوما جالسا مع رجال من أصحاب النبي صلى الله عليه وسلم في منزل في طريق مكة ورسول الله صلى الله عليه وسلم نازل أمامنا والقوم محرمون، وأنا غير محرم، فأبصروا حمارا وحشيا، وأنا مشغول أخصف نعلي، فلم يؤذنوني به، وأحبوا لو أني أبصرته، والتفت فأبصرته، فقمت إلى الفرس فأسرجته ثم ركبت ونسيت السوط والرمح فقلت لهم ناولوني السوط والرمح‏.‏ فقالوا لا والله، لا نعينك عليه بشىء‏.‏ فغضبت فنزلت فأخذتهما، ثم ركبت، فشددت على الحمار فعقرته، ثم جئت به وقد مات، فوقعوا فيه يأكلونه، ثم إنهم شكوا في أكلهم إياه، وهم حرم، فرحنا وخبأت العضد معي، فأدركنا رسول الله صلى الله عليه وسلم فسألناه عن ذلك فقال ‏\"‏ معكم منه شىء ‏\"‏‏.‏ فقلت نعم‏.‏ فناولته العضد فأكلها، حتى نفدها وهو محرم‏.‏ فحدثني به زيد بن أسلم عن عطاء بن يسار عن أبي قتادة ‏عن النبي صلى الله عليه وسلم.‏",
      "text_en": " Narrated `Abdullah bin Abu Qatada Al-Aslami:                     That his father said, \"One day I was sitting with some of the Prophet's companions on the way to Mecca. Allah's Apostle was ahead of us. All of my companions were in the state of Ihram while I was a non-Muhrim. They saw an onager while I was busy repairing my shoes, so they did not tell me about it but they wished I had seen it. By chance I looked up and saw it. So, I turned to the horse, saddled it and rode on it, forgetting to take the spear and the whip. I asked them if they could hand over to me the whip and the spear but they said, 'No, by Allah, we shall not help you in that in any way.' I became angry and got down from the horse, picked up both the things and rode the horse again. I attacked the onager and slaughtered it, and brought it (after it had been dead). They took it (cooked some of it) and started eating it, but they doubted whether it was allowed for them to eat it or not, as they were in the state of Ihram. So, we proceeded and I hid with me one of its fore-legs. When we met Allah's Apostle and asked him about the case, he asked, 'Do you have a portion of it with you?' I replied in the affirmative and gave him that fleshy foreleg which he ate completely while he was in the state of Ihram .",
      "chain": [
        "30105",
        "20173",
        "11349"
      ]
    },
    {
      "hadith_no": "2727",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال نهى رسول الله صلى الله عليه وسلم عن التلقي، وأن يبتاع المهاجر للأعرابي، وأن تشترط المرأة طلاق أختها، وأن يستام الرجل على سوم أخيه، ونهى عن النجش، وعن التصرية‏.‏ تابعه معاذ وعبد الصمد عن شعبة‏.‏ وقال غندر وعبد الرحمن نهي‏.‏ وقال آدم نهينا‏.‏ وقال النضر وحجاج بن منهال نهى‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade (1) the meeting of the caravan (of goods) on the way, (2) and that a residing person buys for a bedouin, (3) and that a woman stipulates the divorce of the wife of the would-be husband, (4) and that a man tries to cause the cancellation of a bargain concluded by another. He also forbade An-Najsh (see Hadith 824) and that one withholds the milk in the udder of the animal so that he may deceive people on selling it.",
      "chain": [
        "20282",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2794",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الروحة والغدوة في سبيل الله أفضل من الدنيا وما فيها ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"A single endeavor in Allah's Cause in the afternoon and in the forenoon is better than the world and whatever is in it.\"",
      "chain": [
        "20351",
        "20012",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "3237",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن الأعمش، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دعا الرجل امرأته إلى فراشه فأبت، فبات غضبان عليها، لعنتها الملائكة حتى تصبح ‏\"‏‏.‏ تابعه شعبة وأبو حمزة وابن داود وأبو معاوية عن الأعمش‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a husband calls his wife to his bed (i.e. to have sexual relation) and she refuses and causes him to sleep in anger, the angels will curse her till morning.\"",
      "chain": [
        "30175",
        "20469",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3604",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني علي بن الجعد، أخبرنا شعبة، عن الأعمش، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال ما عاب النبي صلى الله عليه وسلم طعاما قط، إن اشتهاه أكله، وإلا تركه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet never criticized any food (presented him), but he would eat it if he liked it; otherwise, he would leave it (without expressing his dislike).",
      "chain": [
        "20386",
        "20020",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3845",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة  رضى الله عنه  أن رجلا، أتى النبي صلى الله عليه وسلم فبعث إلى نسائه فقلن ما معنا إلا الماء‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يضم، أو يضيف هذا ‏\"‏‏.‏ فقال رجل من الأنصار أنا‏.‏ فانطلق به إلى امرأته، فقال أكرمي ضيف رسول الله صلى الله عليه وسلم فقالت ما عندنا إلا قوت صبياني‏.‏ فقال هيئي طعامك، وأصبحي سراجك، ونومي صبيانك إذا أرادوا عشاء‏.‏ فهيأت طعامها وأصبحت سراجها، ونومت صبيانها، ثم قامت كأنها تصلح سراجها فأطفأته، فجعلا يريانه أنهما يأكلان، فباتا طاويين، فلما أصبح، غدا إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ضحك الله الليلة  أو عجب  من فعالكما ‏\"‏ فأنزل الله ‏{‏ويؤثرون على أنفسهم ولو كان بهم خصاصة ومن يوق شح نفسه فأولئك هم المفلحون‏}‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet. The Prophet sent a messenger to his wives (to bring something for that man to eat) but they said that they had nothing except water. Then Allah's Apostle said, \"Who will take this (person) or entertain him as a guest?\" An Ansar man said, \"I.\" So he took him to his wife and said to her, \"Entertain generously the guest of Allah's Apostle \" She said, \"We have got nothing except the meals of my children.\" He said, \"Prepare your meal, light your lamp and let your children sleep if they ask for supper.\" So she prepared her meal, lighted her lamp and made her children sleep, and then stood up pretending to mend her lamp, but she put it off. Then both of them pretended to be eating, but they really went to bed hungry. In the morning the Ansari went to Allah's Apostle who said, \"Tonight Allah laughed or wondered at your action.\" Then Allah revealed: \"But give them (emigrants) preference over themselves even though they were in need of that And whosoever is saved from the covetousness Such are they who will be successful.\" (59.9)",
      "chain": [
        "30175",
        "20330",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4124",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، عن أبي حازم، أنه سمع سهل بن سعد، وهو يسأل عن جرح رسول الله صلى الله عليه وسلم فقال أما والله إني لأعرف من كان يغسل جرح رسول الله صلى الله عليه وسلم ومن كان يسكب الماء وبما دووي  قال كانت فاطمة  عليها السلام  بنت رسول الله صلى الله عليه وسلم تغسله وعلي يسكب الماء بالمجن، فلما رأت فاطمة أن الماء لا يزيد الدم إلا كثرة أخذت قطعة من حصير، فأحرقتها وألصقتها فاستمسك الدم، وكسرت رباعيته يومئذ، وجرح وجهه، وكسرت البيضة على رأسه‏.‏",
      "text_en": " Narrated Abu Hazim:                     That he heard Sahl bin Sa`d being asked about the wounds of Allah's Apostle saying, \"By Allah, I know who washed the wounds of Allah's Apostle and who poured water (for washing them), and with what he was treated.\" Sahl added, \"Fatima, the daughter of Allah's Apostle used to wash the wounds, and `Ali bin Abi Talib used to pour water from a shield. When Fatima saw that the water aggravated the bleeding, she took a piece of a mat, burnt it, and inserted its ashes into the wound so that the blood was congealed (and bleeding stopped). His canine tooth got broken on that day, and face was wounded, and his helmet was broken on his head.\"",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "4251",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب، عن أبي حازم، عن سهل بن سعد الساعدي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم التقى هو والمشركون فاقتتلوا، فلما مال رسول الله صلى الله عليه وسلم إلى عسكره، ومال الآخرون إلى عسكرهم، وفي أصحاب رسول الله صلى الله عليه وسلم رجل لا يدع لهم شاذة ولا فاذة إلا اتبعها، يضربها بسيفه، فقيل ما أجزأ منا اليوم أحد كما أجزأ فلان‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنه من أهل النار ‏\"‏‏.‏ فقال رجل من القوم أنا صاحبه‏.‏ قال فخرج معه كلما وقف وقف معه، وإذا أسرع أسرع معه  قال  فجرح الرجل جرحا شديدا، فاستعجل الموت، فوضع سيفه بالأرض وذبابه بين ثدييه، ثم تحامل على سيفه، فقتل نفسه، فخرج الرجل إلى رسول الله صلى الله عليه وسلم فقال أشهد أنك رسول الله قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال الرجل الذي ذكرت آنفا أنه من أهل النار، فأعظم الناس ذلك، فقلت أنا لكم به‏.‏ فخرجت في طلبه، ثم جرح جرحا شديدا، فاستعجل الموت، فوضع نصل سيفه في الأرض وذبابه بين ثدييه، ثم تحامل عليه، فقتل نفسه‏.‏ فقال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ إن الرجل ليعمل عمل أهل الجنة، فيما يبدو للناس، وهو من أهل النار، وإن الرجل ليعمل عمل أهل النار، فيما يبدو للناس، وهو من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As Saidi:                     Allah's Apostle (and his army) encountered the pagans and the two armies.,, fought and then Allah's Apostle returned to his army camps and the others (i.e. the enemy) returned to their army camps. Amongst the companions of the Prophet there was a man who could not help pursuing any single isolated pagan to strike him with his sword. Somebody said, \"None has benefited the Muslims today more than so-and-so.\" On that Allah's Apostle said, \"He is from the people of the Hell-Fire certainly.\" A man amongst the people (i.e. Muslims) said, \"I will accompany him (to know the fact).\" So he went along with him, and whenever he stopped he stopped with him, and whenever he hastened, he hastened with him. The (brave) man then got wounded severely, and seeking to die at once, he planted his sword into the ground and put its point against his chest in between his breasts, and then threw himself on it and committed suicide. On that the person (who was accompanying the deceased all the time) came to Allah's Apostle and said, \"I testify that you are the Apostle of Allah.\" The Prophet said, \"Why is that (what makes you say so)?\" He said \"It is concerning the man whom you have already mentioned as one of the dwellers of the Hell-Fire. The people were surprised by your statement, and I said to them, \"I will try to find out the truth about him for you.\" So I went out after him and he was then inflicted with a severe wound and because of that, he hurried to bring death upon himself by planting the handle of his sword into the ground and directing its tip towards his chest between his breasts, and then he threw himself over it and committed suicide.\" Allah's Apostle then said, \"A man may do what seem to the people as the deeds of the dwellers of Paradise but he is from the dwellers of the Hell-Fire and another may do what seem to the people as the deeds of the dwellers of the Hell- Fire, but he is from the dwellers of Paradise.\"",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "4599",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، عن سفيان، عن ميسرة، عن أبي حازم، عن أبي هريرة   رضى الله عنه  ‏{‏كنتم خير أمة أخرجت للناس‏}‏ قال خير الناس للناس، تأتون بهم في السلاسل في أعناقهم حتى يدخلوا في الإسلام‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Verse:--\"You (true Muslims) are the best of peoples ever raised up for mankind.\" means, the best of peoples for the people, as you bring them with chains on their necks till they embrace Islam.",
      "chain": [
        "30388",
        "20005",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5181",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب، عن أبي حازم، عن سهل بن سعد، أن امرأة، جاءت رسول الله صلى الله عليه وسلم فقالت يا رسول الله جئت لأهب لك نفسي‏.‏ فنظر إليها رسول الله صلى الله عليه وسلم فصعد النظر إليها وصوبه، ثم طأطأ رأسه، فلما رأت المرأة أنه لم يقض فيها شيئا جلست، فقام رجل من أصحابه فقال أى رسول الله إن لم تكن لك بها حاجة فزوجنيها‏.‏ فقال ‏\"‏ هل عندك من شىء ‏\"‏‏.‏ قال لا والله يا رسول الله‏.‏ قال ‏\"‏ اذهب إلى أهلك فانظر هل تجد شيئا ‏\"‏‏.‏ فذهب ثم رجع فقال لا والله يا رسول الله ما وجدت شيئا‏.‏ قال ‏\"‏ انظر ولو خاتما من حديد ‏\"‏‏.‏ فذهب ثم رجع فقال لا والله يا رسول الله ولا خاتما من حديد، ولكن هذا إزاري  قال سهل ما له رداء  فلها نصفه‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصنع بإزارك إن لبسته لم يكن عليها منه شىء، وإن لبسته لم يكن عليك شىء ‏\"‏‏.‏ فجلس الرجل حتى طال مجلسه ثم قام فرآه رسول الله صلى الله عليه وسلم موليا فأمر به فدعي فلما جاء قال ‏\"‏ ماذا معك من القرآن ‏\"‏‏.‏ قال معي سورة كذا وسورة كذا وسورة كذا‏.‏ عددها‏.‏ قال ‏\"‏ أتقرؤهن عن ظهر قلبك ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ اذهب فقد ملكتكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A woman came to Allah's Apostle and said, \"O Allah's Apostle! I have come to you to present myself to you (for marriage).\" Allah's Apostle glanced at her. He looked at her carefully and fixed his glance on her and then lowered his head. When the lady saw that he did not say anything, she sat down. A man from his companions got up and said, \"O Allah's Apostle! If you are not in need of her, then marry her to me.\" The Prophet said, \"Have you got anything to offer.\" The man said, 'No, by Allah, O Allah's Apostle!\" The Prophet said (to him), \"Go to your family and try to find something.\" So the man went and returned, saying, \"No, by Allah, O Allah's Apostle! I have not found anything.\" The Prophet said, \"Go again and look for something, even if it were an iron ring.\" He went and returned, saying, \"No, by Allah, O Allah's Apostle! I could not find even an iron ring, but this is my Izar (waist sheet).' He had no Rida (upper garment). He added, \"I give half of it to her.\" Allah's Apostle said \"What will she do with your Izar? If you wear it, she will have nothing over herself thereof (will be naked); and if she wears it, then you will have nothing over yourself thereof ' So the man sat for a long period and then got up (to leave). When Allah's Apostle saw him leaving, he ordered that he e called back. When he came, the Prophet asked (him), \"How much of the Qur'an do you know (by heart)?\" The man replied, I know such Sura and such Sura and such Sura,\" naming the suras. The Prophet said, \"Can you recite it by heart?\" He said, 'Yes.\" The Prophet said, \"Go I let you marry her for what you know of the Qur'an (as her Mahr).",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "5233",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو دعيت إلى كراع لأجبت، ولو أهدي إلى ذراع لقبلت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If I am invited to a meal of trotters I will accept it; and if I am given a trotter as a present I will accept it.\"",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
      "chain": [
        "30311",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5248",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن أبي حازم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعا الرجل امرأته إلى فراشه فأبت أن تجيء لعنتها الملائكة حتى تصبح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If a man Invites his wife to sleep with him and she refuses to come to him, then the angels send their curses on her till morning.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5402",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن محمد بن جحادة، عن أبي حازم، عن أبي هريرة، نهى النبي صلى الله عليه وسلم عن كسب الإماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade taking the earnings of a slave girl by prostitution.",
      "chain": [
        "20386",
        "20020",
        "18897",
        "11349"
      ]
    },
    {
      "hadith_no": "5452",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، أن رجلا، كان يأكل أكلا كثيرا، فأسلم فكان يأكل أكلا قليلا، فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ إن المؤمن يأكل في معى واحد، والكافر يأكل في سبعة أمعاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to the Prophet who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir eats in seven intestines (eats much). \"",
      "chain": [
        "20193",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5462",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا محمد بن جعفر، عن أبي حازم، عن عبد الله بن أبي قتادة السلمي، عن أبيه، أنه قال كنت يوما جالسا مع رجال من أصحاب النبي صلى الله عليه وسلم في منزل في طريق مكة، ورسول الله صلى الله عليه وسلم نازل أمامنا، والقوم محرمون وأنا غير محرم، فأبصروا حمارا وحشيا وأنا مشغول أخصف نعلي، فلم يؤذنوني له، وأحبوا لو أني أبصرته، فالتفت فأبصرته فقمت إلى الفرس فأسرجته‏.‏ ثم ركبت ونسيت السوط والرمح فقلت لهم ناولوني السوط والرمح‏.‏ فقالوا لا والله لا نعينك عليه بشىء‏.‏ فغضبت فنزلت فأخذتهما، ثم ركبت فشددت على الحمار فعقرته، ثم جئت به وقد مات فوقعوا فيه يأكلونه، ثم إنهم شكوا في أكلهم إياه وهم حرم، فرحنا وخبأت العضد معي، فأدركنا رسول الله صلى الله عليه وسلم فسألناه عن ذلك فقال ‏\"‏ معكم منه شىء ‏\"‏‏.‏ فناولته العضد فأكلها حتى تعرقها، وهو محرم‏.‏ قال ابن جعفر وحدثني زيد بن أسلم عن عطاء بن يسار عن أبي قتادة مثله‏.‏",
      "text_en": " Narrated Abu Qatada:                     Once, while I was sitting with the companions of the Prophet at a station on the road to Mecca and Allah's Apostle was stationing ahead of us and all the people were assuming Ihram while I was not. My companion, saw an onager while I was busy Mending my shoes. They did not Inform me of the onager but they wished that I would see it Suddenly I looked and saw the onager Then I headed towards my horse, saddled it and rode, but I forgot to take the lash and the spear. So I said to them my companions), \"Give me the lash and the spear.\" But they said, \"No, by Allah we will not help you in any way to hunt it ' I got angry, dismounted, took it the spear and the lash), rode (the horse chased the onager and wounded it Then I brought it when it had dyed. My companions started eating of its (cooked) meat, but they suspected that it might be unlawful to eat of its meat while they were in a state of Ihram Then I proceeded further and I kept one of its forelegs with me. When we met Allah's Apostle we asked him about that. He said, \"Have you some of its meat with you?\" I gave him that foreleg and he ate the meat till he stripped the bone of its flesh although he was in a state of Ihram.",
      "chain": [
        "30105",
        "20173",
        "11349"
      ]
    },
    {
      "hadith_no": "5464",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي حازم، عن أبي هريرة، قال ما عاب النبي صلى الله عليه وسلم طعاما قط، إن اشتهاه أكله، وإن كرهه تركه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet never criticized any food (he was invited to) but he used to eat if he liked the food, and leave it if he disliked it.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5468",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، عن أبي حازم، قال سألت سهل بن سعد فقلت هل أكل رسول الله صلى الله عليه وسلم النقي فقال سهل ما رأى رسول الله صلى الله عليه وسلم النقي من حين ابتعثه الله حتى قبضه الله‏.‏ قال فقلت هل كانت لكم في عهد رسول الله صلى الله عليه وسلم مناخل قال ما رأى رسول الله صلى الله عليه وسلم منخلا من حين ابتعثه الله حتى قبضه‏.‏ قال قلت كيف كنتم تأكلون الشعير غير منخول قال كنا نطحنه وننفخه، فيطير ما طار وما بقي ثريناه فأكلناه‏.‏",
      "text_en": " Narrated Abu Hazim:                     I asked Sahl bin Sa`d, \"Did Allah's Apostle ever eat white flour?\" Sahl said, \"Allah's Apostle never saw white flour since Allah sent him as an Apostle till He took him unto Him.\" I asked, \"Did the people have (use) sieves during the lifetime of Allah's Apostle?\" Sahl said, \"Allah's Apostle never saw (used) a sieve since Allah sent him as an Apostle until He took him unto Him,\" I said, \"How could you eat barley unsifted?\" he said, \"We used to grind it and then blow off its husk, and after the husk flew away, we used to prepare the dough (bake) and eat it.\"",
      "chain": [
        "30367",
        "20184",
        "11349"
      ]
    },
    {
      "hadith_no": "6353",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن أبي حازم، عن سهل بن سعد، قال كنا نقيل ونتغدى بعد الجمعة‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     We used to have a midday nap and take our meals after the Jumua (prayer).",
      "chain": [
        "28531",
        "20012",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "6849",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عدي، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك مالا فلورثته، ومن ترك كلا فإلينا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \" If somebody dies (among the Muslims) leaving some property, the property will go to his heirs; and if he leaves a debt or dependants, we will take care of them.\"",
      "chain": [
        "20296",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا يزيد بن كيسان، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ قال لولا أن تعيرني قريش يقولون إنما حمله على ذلك الجزع لأقررت بها عينك فأنزل الله ‏{‏ إنك لا تهدي من أحببت ولكن الله يهدي من يشاء‏}‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah said to his uncle (at the time of his death):                      Make a profession of it that there is no god but Allah and I will bear testimony (of your being a Muslim) on the Day of judgment. He (Abu Talib) said: Were it not the fear of the Quraysh blaming me (and) saying that it was the fear of (approaching death) that induced me to do so, I would have certainly delighted your eyes. It was then that Allah revealed: \" Verily thou canst not guide to the right path whom thou lovest. And it is Allah Who guideth whom He will and He knoweth best who are the guided\" (xxviii-56).",
      "chain": [
        "30514",
        "20031",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وأبو معاوية عن الأعمش، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا يزكيهم - قال أبو معاوية ولا ينظر إليهم - ولهم عذاب أليم شيخ زان وملك كذاب وعائل مستكبر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Three (are the persons) with whom Allah would neither speak, nor would He absolve them on the Day of Resurrection. Abu Mu'awiya added: He would not look at them and there is grievous torment for them: the aged adulterer, the liar king and the proud destitute.",
      "chain": [
        "30201",
        "20032",
        "20354",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن طريف بن خليفة البجلي، حدثنا محمد بن فضيل، حدثنا أبو مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وأبو مالك عن ربعي، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله تبارك وتعالى الناس فيقوم المؤمنون حتى تزلف لهم الجنة فيأتون آدم فيقولون يا أبانا استفتح لنا الجنة ‏.‏ فيقول وهل أخرجكم من الجنة إلا خطيئة أبيكم آدم لست بصاحب ذلك اذهبوا إلى ابني إبراهيم خليل الله - قال - فيقول إبراهيم لست بصاحب ذلك إنما كنت خليلا من وراء وراء اعمدوا إلى موسى صلى الله عليه وسلم الذي كلمه الله تكليما ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقول لست بصاحب ذلك اذهبوا إلى عيسى كلمة الله وروحه ‏.‏ فيقول عيسى صلى الله عليه وسلم لست بصاحب ذلك ‏.‏ فيأتون محمدا صلى الله عليه وسلم فيقوم فيؤذن له وترسل الأمانة والرحم فتقومان جنبتى الصراط يمينا وشمالا فيمر أولكم كالبرق ‏\"‏ ‏.‏ قال قلت بأبي أنت وأمي أى شىء كمر البرق قال ‏\"‏ ألم تروا إلى البرق كيف يمر ويرجع في طرفة ‎03:43 م ‎19/‎01/‎2003ين ثم كمر الريح ثم كمر الطير وشد الرجال تجري بهم أعمالهم ونبيكم قائم على الصراط يقول رب سلم سلم حتى تعجز أعمال العباد حتى يجيء الرجل فلا يستطيع السير إلا زحفا - قال - وفي حافتى الصراط كلاليب معلقة مأمورة بأخذ من أمرت به فمخدوش ناج ومكدوس في النار ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفا ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira and Hudhaifa that the Messenger of Allah (may peace be upon him) said:                      Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Mubammad (may peace be upon him). He would then be permitted (to open the door of Paradise). Trust worthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell.",
      "chain": [
        "30476",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سويد بن سعيد، وابن أبي عمر، جميعا عن مروان الفزاري، - قال ابن أبي عمر حدثنا مروان، - عن أبي مالك الأشجعي، سعد بن طارق عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن حوضي أبعد من أيلة من عدن لهو أشد بياضا من الثلج وأحلى من العسل باللبن ولآنيته أكثر من عدد النجوم وإني لأصد الناس عنه كما يصد الرجل إبل الناس عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله أتعرفنا يومئذ قال ‏\"‏ نعم لكم سيما ليست لأحد من الأمم تردون على غرا محجلين من أثر الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Verily Allah's Messenger (may peace be upon him) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.",
      "chain": [
        "30547",
        "30421",
        "30421",
        "20201",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، - واللفظ لواصل - قالا حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ترد على أمتي الحوض وأنا أذود الناس عنه كما يذود الرجل إبل الرجل عن إبله ‏\"‏ ‏.‏ قالوا يا نبي الله أتعرفنا قال ‏\"‏ نعم لكم سيما ليست لأحد غيركم تردون على غرا محجلين من آثار الوضوء وليصدن عني طائفة منكم فلا يصلون فأقول يا رب هؤلاء من أصحابي فيجيبني ملك فيقول وهل تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) said:                      My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "250",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا خلف، - يعني ابن خليفة - عن أبي مالك الأشجعي، عن أبي حازم، قال كنت خلف أبي هريرة وهو يتوضأ للصلاة فكان يمد يده حتى تبلغ إبطه فقلت له يا أبا هريرة ما هذا الوضوء فقال يا بني فروخ أنتم ها هنا لو علمت أنكم ها هنا ما توضأت هذا الوضوء سمعت خليلي صلى الله عليه وسلم يقول ‏\"‏ تبلغ الحلية من المؤمن حيث يبلغ الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Hazim reported:                      I was (standing) behind Abu Huraira and he was performing the ablution for prayer. He extended the (washing) of his hand that it went up to his armpit. I said to him: O Abu Huraira, what is this ablution? He said: O of the tribe of Faruukh, you are here; if I knew that you were here, I would have never performed ablution like this; I have heard my Friend (may peace be upon him) say. In a believer adornment would reach the places where ablution reaches.",
      "chain": [
        "30367",
        "20584",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - وقال قتيبة حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - كلاهما عن أبي حازم، عن سهل بن سعد، بمثل حديث مالك ‏.‏ وفي حديثهما فرفع أبو بكر يديه فحمد الله ورجع القهقرى وراءه حتى قام في الصف ‏.‏",
      "text_en": " This hadith is transmitted by Sahl b. Sa'd in the same way as narrated by Malik, with the exception of these words:                     \" Abu Bakr lifted his hands and praised Allah and retraced his (steps) till he stood in a row.\"",
      "chain": [
        "30367",
        "20165",
        "30367",
        "11349"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا زكرياء بن عدي، أخبرنا عبيد الله، - يعني ابن عمرو - عن زيد بن أبي أنيسة، عن عدي بن ثابت، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تطهر في بيته ثم مشى إلى بيت من بيوت الله ليقضي فريضة من فرائض الله كانت خطوتاه إحداهما تحط خطيئة والأخرى ترفع درجة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be' upon him) said: He who purified himself in his house, and then he walked to one of the houses of Allah for the sake of performing a Fard (obligatory act) out of the Fara'id (obligatory acts) of Allah, both his steps (would be significant) as one of them would obliterate his sin and the second one would raise his status.",
      "chain": [
        "30313",
        "30464",
        "30024",
        "11340",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبي مالك، الأشجعي عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏ وفي رواية واصل المقضي بينهم ‏.‏",
      "text_en": " It is narrated by Abu Huraira and Huraira that the Messenger of Allah (may peace be upon him) said:                      It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا فضيل بن مرزوق، حدثني عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيها الناس إن الله طيب لا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال ‏{‏ يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم‏}‏ وقال ‏{‏ يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم‏}‏ ‏\"‏ ‏.‏ ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء يا رب يا رب ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب لذلك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      0 people, Allah is Good and He therefore, accepts only that which is good. And Allah commanded the believers as He commanded the Messengers by saying:\" O Messengers, eat of the good things, and do good deeds; verily I am aware of what you do\" (xxiii. 51). And He said: ' 0 those who believe, eat of the good things that We gave you\" (ii. 172) He then made a mention of a person who travels widely, his hair dishevelled and covered with dust. He lifts his hand towards the sky (and thus makes the supplication):\" O Lord,0 Lord,\" whereas his diet is unlawful, his drink is unlawful, and his clothes are unlawful and his nourishment is unlawful. How can then his supplication be accepted?",
      "chain": [
        "30216",
        "20318",
        "20598",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن زيد، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى فذكر خصالا وقال ‏\"‏ من منح منيحة غدت بصدقة وراحت بصدقة صبوحها وغبوقها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) forbade (to do certain things) and then he made a mention of certain habits and said:                      He who gives a she-camel as a gift, for him is the reward (of the gift) both morn- ing and evening-a reward for drinking milk in the morning and a reward for drinking milk in the evening.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "15",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2421",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا مروان، - يعني الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصبح منكم اليوم صائما ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ قال ‏\"‏ فمن تبع منكم اليوم جنازة ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ قال ‏\"‏ فمن أطعم منكم اليوم مسكينا ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ قال ‏\"‏ فمن عاد منكم اليوم مريضا ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه أنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما اجتمعن في امرئ إلا دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      Who has observed fast among you today? Abu Bakr (Allah be pleased with him) replied: It is I. He (the Holy Prophet again) said: Who among you follow. ed the bier today? Abu Bakr (Allah be pleased with him) replied: It is I. He (the Holy Prophet again) said: Who among you led a poor man today? Abu Bakr (Allah he pleased with him) replied: It is I. He (again) said: Who among you visited an invalid today? Abu Bakr (Allah be pleased with him) said: It is I. Upon this the Messenger of Allah (may peace be upon him) said: Anyone in whom (these good deeds) are combined will certainly, enter paradise.",
      "chain": [
        "30421",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3357",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وزهير بن حرب، قال يحيى أخبرنا وقال، زهير حدثنا جرير، عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتى هذا البيت فلم يرفث ولم يفسق رجع كما ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying. He who came to this House (Ka'ba) (with the intention of performing Pilgrimage), and neither spoke indecently nor did he act wickedly. would return (free from sin) as on the (very first day) his mother bore him.",
      "chain": [
        "30399",
        "30022",
        "20031",
        "20321",
        "4057",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، عن سيار، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "chain": [
        "30116",
        "20468",
        "11429",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3554",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه خلف بن هشام، حدثنا حماد بن زيد، ح وحدثنيه زهير بن حرب، حدثنا سفيان بن عيينة، ح وحدثنا إسحاق بن إبراهيم، عن الدراوردي، ح وحدثنا أبو بكر بن، أبي شيبة حدثنا حسين بن علي، عن زائدة، كلهم عن أبي حازم، عن سهل بن سعد، بهذا الحديث يزيد بعضهم على بعض غير أن في حديث زائدة قال ‏\"‏ انطلق فقد زوجتكها فعلمها من القرآن ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sahl b. Sa'd with a minor alteration of words, but the hadith transmitted through Za'idah (the words are that the Holy Prophet) said:                      Go, I have married her to you, and you teach her something of the Qur'an.",
      "chain": [
        "30503",
        "20022",
        "20005",
        "30123",
        "20167",
        "30201",
        "20315",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "3614",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثني أبو سعيد الأشج، حدثنا وكيع، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا جرير، كلهم عن الأعمش، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دعا الرجل امرأته إلى فراشه فلم تأته فبات غضبان عليها لعنتها الملائكة حتى تصبح ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah he pleased with him) reported Allah's Messenger (may, peace be upon him) as saying:                      When a man invites his wife to his bed and she does not come, and he (the husband) spends the sight being angry with her, the angels curse her until morning.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30200",
        "20032",
        "30022",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فإذا شهد أمرا فليتكلم بخير أو ليسكت واستوصوا بالنساء فإن المرأة خلقت من ضلع وإن أعوج شىء في الضلع أعلاه إن ذهبت تقيمه كسرته وإن تركته لم يزل أعوج استوصوا بالنساء خيرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who believes in Allah and the Hereafter, if he witnesses any matter he should talk in good terms about it or keep quiet. Act kindly towards woman, for woman is created from a rib, and the most crooked part of the rib is its top. If you attempt to straighten it, you will break it, and if you leave it, its crookedness will remain there. So act kindly towards women.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن التلقي للركبان وأن يبيع حاضر لباد وأن تسأل المرأة طلاق أختها وعن النجش والتصرية وأن يستام الرجل على سوم أخيه ‏.‏",
      "text_en": "  Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade the (people) meeting the caravan (for entering into business transaction with them), and the selling of goods by a townsman on behalf of a man of the desert, and seeking by a woman the divorce of her sister (from her husband), and outbidding (against one another), and tying up the udders (of animals), and buying of (things) in opposition to one's brother.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4879",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فرات القزاز، عن أبي حازم، قال قاعدت أبا هريرة خمس سنين فسمعته يحدث، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت بنو إسرائيل تسوسهم الأنبياء كلما هلك نبي خلفه نبي وإنه لا نبي بعدي وستكون خلفاء فتكثر ‏\"‏ ‏.‏ قالوا فما تأمرنا قال ‏\"‏ فوا ببيعة الأول فالأول وأعطوهم حقهم فإن الله سائلهم عما استرعاهم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Abu Huraira that the Holy Prophet (may pceace be upon him) said:                      Banu Isra'il were ruled over by the Prophets. When one Prophet died, another succeeded him; but after me there is no prophet and there will be caliphs and they will be quite large in number. His Companions said: What do you order us to do (in case we come to have more than one Caliph)? He said: The one to whom allegiance is sworn first has a supremacy over the others. Concede to them their due rights (i. e. obey them). God (Himself) will question them about the subjects whom He had entrusted to them.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11384",
        "11349"
      ]
    },
    {
      "hadith_no": "5413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن أبي حازم، ح وحدثناه قتيبة بن، سعيد حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - كلاهما عن أبي حازم، عن سهل، بن سعد عن النبي صلى الله عليه وسلم ‏.‏ بمثله ولم يقولا فتله ‏.‏ ولكن في رواية يعقوب قال فأعطاه إياه ‏.‏",
      "text_en": " This hadith is reported on the authority of Sahl b. Sa'd with a slight variation of wording.",
      "chain": [
        "30399",
        "20165",
        "30367",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "5480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير بن عبد الحميد، عن فضيل بن غزوان، عن  أبي حازم الأشجعي، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إني مجهود ‏.‏ فأرسل إلى بعض نسائه فقالت والذي بعثك بالحق ما عندي إلا ماء ‏.‏ ثم أرسل إلى أخرى فقالت مثل ذلك حتى قلن كلهن مثل ذلك لا والذي بعثك بالحق ما عندي إلا ماء ‏.‏ فقال ‏\"‏ من يضيف هذا الليلة رحمه الله ‏\"‏ ‏.‏ فقام رجل من الأنصار فقال أنا يا رسول الله ‏.‏ فانطلق به إلى رحله فقال لامرأته هل عندك شىء ‏.‏ قالت لا إلا قوت صبياني ‏.‏ قال فعلليهم بشىء فإذا دخل ضيفنا فأطفئي السراج وأريه أنا نأكل فإذا أهوى ليأكل فقومي إلى السراج حتى تطفئيه ‏.‏ قال فقعدوا وأكل الضيف ‏.‏ فلما أصبح غدا على النبي صلى الله عليه وسلم فقال ‏\"‏ قد عجب الله من صنيعكما بضيفكما الليلة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that a person came to Allah's Messenger (may peace be upon him) and said:                      I am hard pressed by hunger. He sent (message) to one of his wives (to procure food for him). but she said: By Him Who has sent you with Truth, thrre is nothing with me (to serve him) but only water. He (the Holy Prophet) then sent the (same) message to another, and she gave the same reply, until all of them gave the same reply: By Him Who has sent thee with the Truth, there is nothing with me but only water, whereupon he (the Holy Prophet) said: Allah would show mercy to him who will entertain this guest tonight. A person from the Ansar stood up and said: Messenger of Allah, I (am ready to entertain). He took him to his house and said to his wife: Is there anything with you (to serve the gdest)? She said: No, but only a subsistence for our children. He said: Distract their attention with something, and when the guest enters extinguish the lamp and give him the impression that we are eating. So they sat down. and the guest had his meal. When it was morning he went to Allah's Apostle (may peace be upon him) who said: Allah was well pleased with what you both did for your guest this night.",
      "chain": [
        "30022",
        "20028",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5481",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، عن فضيل بن غزوان، عن أبي، حازم عن أبي هريرة، ‏.‏ أن رجلا، من الأنصار بات به ضيف فلم يكن عنده إلا قوته وقوت صبيانه فقال لامرأته نومي الصبية وأطفئي السراج وقربي للضيف ما عندك - قال - فنزلت هذه الآية ‏{‏ ويؤثرون على أنفسهم ولو كان بهم خصاصة‏}‏",
      "text_en": " Abu Huraira reported that a guest spent the night with a person from the Ansar who had nothing with him but food (sufficient) for his own self and his children. He said to his wife:                      (Lull) the children to sleep, and put out the lamp, and serve the guest with what you have with you. It was on this occasion that this verse was revealed:\" Those who prefer the needy to their own selves in spite of the fact that they are themselves in pressing need\" (Lix. 9).",
      "chain": [
        "30216",
        "20032",
        "20349",
        "11349"
      ]
    },
    {
      "hadith_no": "5501",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، وزهير بن حرب، وإسحاق بن إبراهيم، قال زهير حدثنا  وقال الآخران، أخبرنا جرير، عن الأعمش، عن أبي حازم، عن أبي هريرة، قال ما عاب رسول الله صلى الله عليه وسلم طعاما قط كان إذا اشتهى شيئا أكله وإن كرهه تركه ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) never found fault with food (served to him). If he liked anything, he ate it and if he did not like it he left it.",
      "chain": [
        "30399",
        "30022",
        "30123",
        "20321",
        "4057",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5505",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه أبو كريب، ومحمد بن المثنى، قالا حدثنا أبو معاوية، عن الأعمش، عن  أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through a different chain of transmitters.",
      "chain": [
        "30216",
        "30170",
        "20354",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "6333",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا مروان بن معاوية الفزاري، عن يزيد، - وهو ابن كيسان - عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصبح منكم اليوم صائما ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن تبع منكم اليوم جنازة ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن أطعم منكم اليوم مسكينا ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن عاد منكم اليوم مريضا ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما اجتمعن في امرئ إلا دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      Who amongst you is observing fastthis day? Abu Bake said: It is I. He (again) said: Who amongst you has followed the bier today? Abu Bakr said: It is I. He (the Holy Prophet) again said: Who amongst you has served food to the needy? Abu Bakr said: It is I. He (again) said: Who amongst you has today visited the sick? Abu Bakr said: It is I. Thereupon Allah's Messenger (may peace be upon him) said: He must get into Paradise who combines in himself (all these noble qualities and virtues).",
      "chain": [
        "20201",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "7243",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى القيسي، قالا حدثنا المعتمر، عن أبيه، حدثني نعيم بن أبي هند، عن أبي حازم، عن أبي هريرة، قال قال أبو جهل هل يعفر محمد وجهه بين أظهركم قال فقيل نعم ‏.‏ فقال واللات والعزى لئن رأيته يفعل ذلك لأطأن على رقبته أو لأعفرن وجهه في التراب - قال - فأتى رسول الله صلى الله عليه وسلم وهو يصلي زعم ليطأ على رقبته - قال - فما فجئهم منه إلا وهو ينكص على عقبيه ويتقي بيديه - قال - فقيل له ما لك فقال إن بيني وبينه لخندقا من نار وهولا وأجنحة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو دنا مني لاختطفته الملائكة عضوا عضوا ‏\"‏ ‏.‏ قال فأنزل الله عز وجل لا ندري في حديث أبي هريرة أو شىء بلغه ‏{‏ كلا إن الإنسان ليطغى * أن رآه استغنى * إن إلى ربك الرجعى * أرأيت الذي ينهى * عبدا إذا صلى * أرأيت إن كان على الهدى * أو أمر بالتقوى * أرأيت إن كذب وتولى‏}‏ - يعني أبا جهل - ‏{‏ ألم يعلم بأن الله يرى * كلا لئن لم ينته لنسفعا بالناصية * ناصية كاذبة خاطئة * فليدع ناديه * سندع الزبانية * كلا لا تطعه‏}‏ زاد عبيد الله في حديثه قال وأمره بما أمره به ‏.‏ وزاد ابن عبد الأعلى فليدع ناديه يعني قومه ‏.‏",
      "text_en": " Abu Huraira reported that Abu Jahl asked (people) whether Mubammad placed his face (on the ground) in their presence. It was said to him:                      Yes. He said: By Lit and Uzza. If I were to see him do that, I would trample his neck, or I would beamear his face with dust. He came to Allah's Messenger (may peace be upon him) as he was engaged in prayer and thought of trampling his neck (and the people say) that he came near him but turned upon his heels and tried to repulse something with his hands. It was said to him: What is the matter with you? He said: There is between me and him a ditch of fire and terror and wings. Thereupon Allah's Messenger (may peace he upon him) said: If he were to come near me the angels would have torn him to pieces. Then Allah, the Exalted and Glorious, revealed this verse- (the narrator) said: We do not whether it is the hadith transmitted te Abu Huraira or something conveyed to him from another source:\" Nay, man is surely inordinate, because he looks upon himself as self-sufficient. Surely to thy Lord is the return. Hast thou seen him who forbids a servant when he prays? Seest thou if he is on the right way, or enjoins observance of piety? Seest thou if he [Abu Jah]] denies and turns away? Knowest he not that Allah sees? Nay. if he desists not, We will seize him by the forelock-a lying, sinful forelock. Then let him summon his council. We will summon the guards of the Hell. Nay! Obey not thou him\" (Icvi. 6-19). (Rather prostrate thyself.) Ubaidullah made this addition: It was after this that (prostration) was enjoined upon and Ibn Abd al-Ala made this addition that by Nadia he meant his people.",
      "chain": [
        "30150",
        "20288",
        "11289",
        "10973",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "7364",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني سريج بن يونس، حدثنا حميد بن عبد الرحمن، عن الحسن بن صالح، عن هارون بن سعد، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ضرس الكافر أو ناب الكافر مثل أحد وغلظ جلده مسيرة ثلاث ‏\"‏ ‏.‏",
      "text_en": " It is transmitted on the authority of Abu Huraira that Allah's Messenger (may peace be upon him) said:                      The molar tooth of an unbeliever or the canine teeth of an unbeliever will be like Ubud and the thickness of his skin a three night's journey.",
      "chain": [
        "30251",
        "10561",
        "20647",
        "20612",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "928",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا غرار في صلاة ولا تسليم ‏\"‏ ‏.‏ قال أحمد يعني فيما أرى أن لا تسلم ولا يسلم عليك ويغرر الرجل بصلاته فينصرف وهو فيها شاك ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying:                      There is no loss in prayer nor in salutation. Ahmad(b. Hanbal) said: This means, I think, that you do not salute nor you are saluted by others. The loss of a man in his prayer is that a man remains doubtful about it when he finishes it.",
      "chain": [
        "30007",
        "20033",
        "20012",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا معاوية بن هشام، عن سفيان، عن أبي مالك، عن أبي حازم، عن أبي هريرة، قال - أراه رفعه - قال ‏\"‏ لا غرار في تسليم ولا صلاة ‏\"‏ ‏.‏ قال أبو داود ورواه ابن فضيل على لفظ ابن مهدي ولم يرفعه ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying :                      There is no loss in salutation and in prayer.Abu Dawud said: According to the version of Ibn Mahdi, this tradition has been narrated by Ibn Fudail as a statement of Abu Hurairah and not as a saying of the Prophet(ﷺ)",
      "chain": [
        "30216",
        "20609",
        "20012",
        "10766",
        "11349",
        "13",
        "30002"
      ]
    },
    {
      "hadith_no": "1086",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي حازم، عن سهل بن سعد، قال كنا نقيل ونتغدى بعد الجمعة ‏.‏",
      "text_en": " Sahl b. Sa'd said:                      We had a siesta or lunch after the Friday prayer.",
      "chain": [
        "28531",
        "20012",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "2141",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا جرير، عن الأعمش، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعا الرجل امرأته إلى فراشه فأبت فلم تأته فبات غضبان عليها لعنتها الملائكة حتى تصبح ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying “When a man calls his wife to come to his bed and she refuses and does not come to him and he spends the night angry, the angels curse her till the morning.”",
      "chain": [
        "11220",
        "20028",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2955",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك مالا فلورثته ومن ترك كلا فإلينا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: If anyone leaves property, it goes to his heirs. And if anyone leaves dependents (without resources), they come to us.",
      "chain": [
        "30329",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3763",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي حازم، عن أبي هريرة، قال ما عاب رسول الله صلى الله عليه وسلم طعاما قط إن اشتهاه أكله وإن كرهه تركه ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) never expressed disapproval of food; if he desired it, he ate it, and if he disliked it, he left it alone.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4914",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا يزيد بن هارون، أخبرنا سفيان الثوري، عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لمسلم أن يهجر أخاه فوق ثلاث فمن هجر فوق ثلاث فمات دخل النار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not allowable for a Muslim to keep apart from his brother for more than three days, for one who does so and dies will enter Hell.",
      "chain": [
        "30269",
        "20472",
        "20012",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "811",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حج فلم يرفث ولم يفسق غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وأبو حازم كوفي وهو الأشجعي واسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     The Messenger of Allah said: \"Whoever performs Hajj for Allah, and he does not have sexual relations nor commit any sin, then his previous sins will be forgiven.\"",
      "chain": [
        "30421",
        "20005",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1649",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم والحجاج عن الحكم، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ غدوة في سبيل الله أو روحة خير من الدنيا وما فيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو حازم الذي روى عن سهل بن سعد هو أبو حازم الزاهد وهو مدني واسمه سلمة بن دينار ‏.‏ وأبو حازم هذا الذي روى عن أبي هريرة هو أبو حازم الأشجعي الكوفي واسمه سلمان وهو مولى عزة الأشجعية ‏.‏",
      "text_en": " Narrated Abu Hurairah and Ibn 'Abbas:                     That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.",
      "chain": [
        "30200",
        "20326",
        "10616",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2163",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن سفيان، عن الأعمش، عن أبي حازم، عن أبي هريرة، قال ما عاب رسول الله صلى الله عليه وسلم طعاما قط كان إذا اشتهاه أكله وإلا تركه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حازم هو الأشجعي الكوفي واسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Messenger of Allah (s.a.w) never criticized any food. if he liked it, he would eat it, and if not, he would leave it.\"",
      "chain": [
        "30304",
        "20025",
        "20012",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2409",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وقاه الله شر ما بين لحييه وشر ما بين رجليه دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى أبو حازم الذي روى عن أبي هريرة اسمه سلمان مولى عزة الأشجعية وهو كوفي وأبو حازم الذي روى عن سهل بن سعد هو أبو حازم الزاهد مدني واسمه سلمة بن دينار ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"For whomever Allah protects against the evil of what is between his jaws and the evil of what is between his legs, he shall enter Paradise.\"",
      "chain": [
        "30200",
        "20326",
        "10616",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2780",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو كريب، حدثنا مصعب بن المقدام، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة، رفعه قال ‏\"‏ ضرس الكافر مثل أحد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وأبو حازم هو الأشجعي اسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Abu Hurairah narrated a Marfu' narration:                     \"The molar teeth of the disbeleiver will be like Uhud (mountain).\"",
      "chain": [
        "30216",
        "20608",
        "20349",
        "11349"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا أبو نعيم، حدثنا فضيل بن مرزوق، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أيها الناس إن الله طيب ولا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال ‏:‏ ‏(‏يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم ‏)‏ وقال أيها الذين آمنوا كلوا من طيبات ما رزقناكم ‏)‏ ‏\"‏ ‏.‏ قال وذكر الرجل يطيل السفر أشعث أغبر يمد يده إلى السماء يا رب يا رب ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب لذلك ‏.‏ قال أبو عيسى هذا حديث حسن غريب وإنما نعرفه من حديث فضيل بن مرزوق وأبو حازم هو الأشجعي اسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"O you people! Indeed Allah is Tayyib (good) and he does not accept but what is good. And indeed Allah ordered the believers with what He ordered the Messengers. He (ﷺ) said: 'O you Messengers! Eat of the good things and do righteous deeds. Verily I am well acquainted with what you do (23:51).' And He said: 'O you who believe! Eat from the good things We have provided you (2:172).' He said: \"And he mentioned a man: 'Who is undertaking a long journey, whose hair is dishevelled and he is covered with dust. He raises his hands to the heavens and says: \"O Lord! O Lord!\" Yet his food is from the unlawful, his drink is from the unlawful, his clothing is from the unlawful, and he was nourished by the unlawful. So how can that be accepted?'\"",
      "chain": [
        "30553",
        "20348",
        "20598",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يعلى بن عبيد، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث إذا خرجن ‏:‏ ‏(‏لم ينفع نفسا إيمانها لم تكن آمنت من قبل ‏)‏ الآية الدجال والدابة وطلوع الشمس من المغرب أو من مغربها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حازم هو الأشجعي الكوفي واسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"There are three, for which when they appear, a soul will not benefit by its faith, if it did not believe before the Signs: Ad-Dajjal, the Beast, and the rising of the sun from its setting place\" - or \"from the west.\"",
      "chain": [
        "30553",
        "20372",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3618",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة، أن رجلا، من الأنصار بات به ضيف فلم يكن عنده إلا قوته وقوت صبيانه فقال لامرأته نومي الصبية وأطفئي السراج وقربي للضيف ما عندك فنزلت هذه الآية ‏:‏ ‏(‏ ويؤثرون على أنفسهم ولو كان بهم خصاصة ‏)‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     That a man from the Ansar had a guest spend the night with him, but he did not have anything to eat but his meal and the meal for his children, so he said to his wife: ‘Put the children to sleep, extinguish the torches, and give me whatever you have with you for the guest.’ So this Ayah was revealed: And they give preference over themselves even though they were in need of that.”",
      "chain": [
        "30216",
        "20032",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن خلف، - وهو ابن خليفة - عن أبي مالك الأشجعي، عن أبي حازم، قال كنت خلف أبي هريرة وهو يتوضأ للصلاة وكان يغسل يديه حتى يبلغ إبطيه فقلت يا أبا هريرة ما هذا الوضوء فقال لي يا بني فروخ أنتم ها هنا لو علمت أنكم ها هنا ما توضأت هذا الوضوء سمعت خليلي صلى الله عليه وسلم يقول ‏\"‏ تبلغ حلية المؤمن حيث يبلغ الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hazim said:                      \"I was behind Abu Hurairah when he performed Wudu' for Salah. He washed his hand up to the armpit, and I said: 'O Abu Hurairah! What is this Wudu'?' He said to me: 'O Banu Farrukh! You are here! If I had known that you were here I would not have performed Wudu' like this. I heard my close friend (i.e., the Prophet (ﷺ)) says: \"The jewelry of the believer will reach as far as his Wudu reached.\"",
      "chain": [
        "30367",
        "20584",
        "10766",
        "11349"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عز وجل عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله عز وجل بنا فهدانا ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم لنا تبع يوم القيامة ونحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah (SWT) sent astray from Friday those who came before us, so the Jews had Saturday and the Christians had Sunday. Then Allah (SWT), the Mighty and Sublime, brought us and guided us to Friday, so there is Friday, Saturday and Sunday, and thus they will follow us on the Day of Resurrection. We are the last of the people of this world but the first on the Day of Resurrection for whom judgment will be passed before all other creatures.'\"",
      "chain": [
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا سعيد بن عبد الرحمن، عن أبي حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ للصائمين باب في الجنة يقال له الريان لا يدخل فيه أحد غيرهم فإذا دخل آخرهم أغلق من دخل فيه شرب ومن شرب لم يظمأ أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sahi bin Sad that the Prophet said:                     \"For those who fast there is a gate in Paradise called Ar-Rayyan, through which no one but they will enter. When the last of them has entered it, it will be closed. Whoever enters through it will drink, and whoever drinks will never thirst again.\"",
      "chain": [
        "20387",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا يعقوب، عن أبي حازم، قال حدثني سهل، أن في الجنة، بابا يقال له الريان يقال يوم القيامة أين الصائمون هل لكم إلى الريان من دخله لم يظمأ أبدا فإذا دخلوا أغلق عليهم فلم يدخل فيه أحد غيرهم ‏.‏",
      "text_en": " Sahi narrated that:                     in Paradise there is a gate called Ar'Rayyan, it will be said on the Day of Resurrection: \"Where are those who used to fast? Would you like to enter through Ar-Rayyan?\" whoever enters through it will never thirst again. Then when they have entered it will be closed behind them, and no one but they will enter through it.",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "2627",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو عمار الحسين بن حريث المروزي، قال حدثنا الفضيل، - وهو ابن عياض - عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حج هذا البيت فلم يرفث ولم يفسق رجع كما ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever performs pilgrimage to this House, and does not Yarfuth (utter any obscenity or commit sin), will go back as (on the day) his nother bore him.'''(sahih)",
      "chain": [
        "30325",
        "20200",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا قتيبة، قال حدثنا يعقوب، عن أبي حازم، عن سهل بن سعد، أن امرأة، جاءت رسول الله صلى الله عليه وسلم فقالت يا رسول الله جئت لأهب نفسي لك ‏.‏ فنظر إليها رسول الله صلى الله عليه وسلم فصعد النظر إليها وصوبه ثم طأطأ رأسه فلما رأت المرأة أنه لم يقض فيها شيئا جلست فقام رجل من أصحابه فقال أى رسول الله إن لم يكن لك بها حاجة فزوجنيها ‏.‏ قال ‏\"‏ هل عندك من شىء ‏\"‏ ‏.‏ فقال لا والله ما وجدت شيئا ‏.‏ فقال ‏\"‏ انظر ولو خاتما من حديد ‏\"‏ ‏.‏ فذهب ثم رجع فقال لا والله يا رسول الله ولا خاتما من حديد ولكن هذا إزاري - قال سهل ما له رداء - فلها نصفه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصنع بإزارك إن لبسته لم يكن عليها منه شىء وإن لبسته لم يكن عليك منه شىء ‏\"‏ ‏.‏ فجلس الرجل حتى طال مجلسه ثم قام فرآه رسول الله صلى الله عليه وسلم موليا فأمر به فدعي فلما جاء قال ‏\"‏ ماذا معك من القرآن ‏\"‏ ‏.‏ قال معي سورة كذا وسورة كذا ‏.‏ عددها ‏.‏ فقال ‏\"‏ هل تقرؤهن عن ظهر قلب ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ ملكتكها بما معك من القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sahl bin Sa'd that a woman came to the Messenger of Allah and said:                      \"O Messenger of Allah, I have come to offer myself to you (in marriage).\" The Messenger of Allah looked her up and down then lowered his head. When the woman saw that he was not saying anything about her, she sat down. A man among his Companions stood up and said: \"O Messenger of Allah, if you do not want to marry her, then marry me to her.\" He said: \"Do you have anything?\" He said: \"No, by Allah, I do not have anything.\" He said: \"Look, even if it is only an iron ring.\" He went, then he came back and said: \"No, by Allah, O Messenger of Allah, not even an iron ring, but this is my Izar (lower garment)\" - Sahl said: \"He did not have a Rida' (upper garment)\" - \"she can have half of it.\" The Messenger of Allah said: \"What could she do with your Izar? If you wear it, she will not have any of it, and if she wears it, you will not have any of it.\" The man sat down for a long time, then he got up, and the Messenger of Allah saw him leaving, so he ordered that he be called back. When he came, he said: \"What do you know of the Qur'an?\" He said: \"I know Surah such-and-such, and Surah such-and-such,\" and listed them. He said: \"Can you recite them by heart?\" He said: \"Yes.\" He said: \"Then I marry you to her on the basis of what you know of the Qur'an.\"",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "4155",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا يعقوب، عن أبي حازم، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عليك بالطاعة في منشطك ومكرهك وعسرك ويسرك وأثرة عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"You have to obey when you feel energetic and when you feel tired, during your ease and your hardship, and when others are preferred over you.\"",
      "chain": [
        "30367",
        "20184",
        "11349",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4491",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني عبد الله بن محمد بن تميم، قال حدثنا حجاج، قال حدثني شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن التلقي وأن يبيع مهاجر للأعرابي وعن التصرية والنجش وأن يستام الرجل على سوم أخيه وأن تسأل المرأة طلاق أختها ‏.‏",
      "text_en": " It was narrated  that Abu Hurairah said:                     \"The Messenger of Allah forbade meeting (the traders on the way) a Muhajhir selling for a Bedouin, keeping the milk in the udder of an animal (so as to increase its price), artificially inflating prices, a man to urge the cancellation of sale already agreed upon and a woman to ask that her sister (in faith) be divorced.\"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5321",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا يعقوب، عن أبي حازم، عن سهل بن سعد، قال جاءت امرأة ببردة - قال سهل - هل تدرون ما البردة قالوا نعم هذه الشملة منسوج في حاشيتها ‏.‏ فقالت يا رسول الله إني نسجت هذه بيدي أكسوكها فأخذها رسول الله صلى الله عليه وسلم محتاجا إليها فخرج إلينا وإنها لإزاره ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                     \"A woman brought a Burdah\" - Sahl said: \"Do you know what a Burdah is?\" They said: \"Yes, it is a cloak with two woven borders\" - and she said: 'O Messenger of Allah, I wove this with my own hands for you to wear.' The Messenger of Allah [SAW] took it as he had need of it, then he came out to us and he was wearing it as his Izar (lower garment).\"",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن المنذر، حدثنا ابن فضيل، حدثنا أبو مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، وعن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أضل الله عن الجمعة من كان قبلنا كان لليهود يوم السبت والأحد للنصارى فهم لنا تبع إلى يوم القيامة نحن الآخرون من أهل الدنيا والأولون المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Allah led those who came before us astray from Friday.Saturdaywas for the Jews and Sunday was for the Christians. And theywill lagbehind us until the Day of Resurrection. We are the last ofthe peopleof this world but we will be the first to be judged amongall ofcreation.’”",
      "chain": [
        "20356",
        "10766",
        "11334",
        "145",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1990",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، حدثنا عبد الملك بن حسين أبو مالك النخعي، عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الوليمة أول يوم حق والثاني معروف والثالث رياء وسمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     that the Messenger of Allah said: 'The wedding feast on the first day is an obligation, on the second day is a custom and on the third day is showing off.”",
      "chain": [
        "30378",
        "20472",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2244",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن طريف، قالا حدثنا محمد بن فضيل، حدثنا الأعمش، عن أبي حازم، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  عن ثمن الكلب وعسب الفحل‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) forbade the price of a dog and studding a stallion.\"",
      "chain": [
        "38409",
        "30476",
        "20356",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2860",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ غدوة أو روحة في سبيل الله خير من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Going out in the morning in the cause of Allah, or in theevening,is more virtuous than the world and what is in it.”",
      "chain": [
        "30201",
        "11184",
        "20326",
        "10616",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3001",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن مسعر، وسفيان، عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حج هذا البيت فلم يرفث ولم يفسق رجع كما ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever performs Hajj to this House, and does not have sexualrelations nor commit any disobedience, will go back like the day hismother bore him.”",
      "chain": [
        "30201",
        "20032",
        "20359",
        "20005",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤمن يأكل في معى واحد والكافر يأكل في سبعة أمعاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “The believer eats with one intestine and the disbeliever eatswithseven intestines.’”",
      "chain": [
        "30201",
        "30106",
        "30160",
        "20173",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3382",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن أبي حازم، عن أبي هريرة، قال ما عاب رسول الله  صلى الله عليه وسلم  طعاما قط إن رضيه أكله وإلا تركه ‏.‏",
      "text_en": " It wasnarrated from Abu Hazim that Abu Hurairah said:                      “The MessengerofAllah (ﷺ) never criticized any food. If it pleased him, he wouldeat it and if it did not he would leave it.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11349",
        "13"
      ]
    }
  ],
  "total_hadiths": 87
}