{
  "id": "11346",
  "name": "Sa'id bin 'Abdur Rahman bin Abza سعيد بن عبد الرحمن بن أبزي",
  "full_name": "Sa'id bin 'Abdur Rahman bin Abza سعيد بن عبد الرحمن بن أبزي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Khuza'i",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "4046",
      "name": "'Abdur Rahman bin Abza ( عبد الرحمن بن أبزى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "15288",
      "name": "'Abdullah bin 'Abdur Rahman bin Abza عبد الله بن عبد الرحمن بن أبزى",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "4046",
      "name": "'Abdur Rahman bin Abza ( عبد الرحمن بن أبزى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4049",
      "name": "Wathla bin al-'Asqa' ( واثلة بن الأسقع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18131",
      "name": "Ja'far bin Abi al-Mughira جعفر بن أبي المغيرة الخزاعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10799",
      "name": "Azrh bin 'Abdur Rahman عزرة بن عبد الرحمن بن زرارة الخزاعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10793",
      "name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "338",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، حدثنا الحكم، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال جاء رجل إلى عمر بن الخطاب فقال إني أجنبت فلم أصب الماء‏.‏ فقال عمار بن ياسر لعمر بن الخطاب أما تذكر أنا كنا في سفر أنا وأنت فأما أنت فلم تصل، وأما أنا فتمعكت فصليت، فذكرت للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إنما كان يكفيك هكذا ‏\"‏‏.‏ فضرب النبي صلى الله عليه وسلم بكفيه الأرض، ونفخ فيهما ثم مسح بهما وجهه وكفيه‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abza [??]:                     A man came to `Umar bin Al-Khattab and said, \"I became Junub but no water was available.\" `Ammar bin Yasir said to `Umar, \"Do you remember that you and I (became Junub while both of us) were together on a journey and you didn't pray but I rolled myself on the ground and prayed? I informed the Prophet about it and he said, 'It would have been sufficient for you to do like this.' The Prophet then stroked lightly the earth with his hands and then blew off the dust and passed his hands over his face and hands.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "339",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا حجاج، قال أخبرنا شعبة، أخبرني الحكم، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال عمار بهذا، وضرب شعبة بيديه الأرض، ثم أدناهما من فيه، ثم مسح وجهه وكفيه‏.‏ وقال النضر أخبرنا شعبة عن الحكم قال سمعت ذرا يقول عن ابن عبد الرحمن بن أبزى قال الحكم وقد سمعته من ابن عبد الرحمن عن أبيه قال قال عمار‏.‏",
      "text_en": " Narrated Sa`id bin `Abdur Rahman bin Abza:                     (on the authority of his father who said) `Ammar said so (the above Statement). And Shu`ba stroked lightly the earth with his hands and brought them close to his mouth (blew off the dust) and passed them over his face and then the backs of his hands. `Ammar said, \"Ablution (meaning Tayammum here) is sufficient for a Muslim if water is not available.\"",
      "chain": [
        "20219",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046",
        "20291",
        "20020",
        "11069",
        "11423",
        "11346"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أنه شهد عمر وقال له عمار كنا في سرية فأجنبنا، وقال تفل فيهما‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abza:                     that while he was in the company of `Umar, `Ammar said to `Umar, \"We were in a detachment and became Junub and I blew the dust off my hands (performed the rolling over the earth and prayed.)\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "341",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن عبد الرحمن، قال قال عمار لعمر تمعكت فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ يكفيك الوجه والكفان ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abza:                     `Ammar said to `Umar \"I rolled myself in the dust and came to the Prophet who said, 'Passing dusted hands over the face and the backs of the hands is sufficient for you.' \"",
      "chain": [
        "28531",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، قال قال عمار فضرب النبي صلى الله عليه وسلم بيده الأرض، فمسح وجهه وكفيه‏.‏",
      "text_en": " Narrated `Ammar:                     The Prophet stroked the earth with his hands and then passed them over his face and the backs of his hands (while demonstrating Tayammum).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني عبد الله بن هاشم العبدي، حدثنا يحيى، - يعني ابن سعيد القطان - عن شعبة، قال حدثني الحكم، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، أتى عمر فقال إني أجنبت فلم أجد ماء ‏.‏ فقال لا تصل ‏.‏ فقال عمار أما تذكر يا أمير المؤمنين إذ أنا وأنت في سرية فأجنبنا فلم نجد ماء فأما أنت فلم تصل وأما أنا فتمعكت في التراب وصليت ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنما كان يكفيك أن تضرب بيديك الأرض ثم تنفخ ثم تمسح بهما وجهك وكفيك ‏\"‏ ‏.‏ فقال عمر اتق الله يا عمار ‏.‏ قال إن شئت لم أحدث به ‏.‏ قال الحكم وحدثنيه ابن عبد الرحمن بن أبزى عن أبيه مثل حديث ذر قال وحدثني سلمة عن ذر في هذا الإسناد الذي ذكر الحكم فقال عمر نوليك ما توليت ‏.‏",
      "text_en": " Abd al-Rabmin b. Abza narrated It on the authority of his father that a man came to 'Umar and said:                      I am (at times) affected by seminal emission but find no water. He ('Umar) told him not to say prayer. 'Ammar then said. Do you remember,0 Commander of the Faithful, when I and you were in a military detachment and we had had a seminal emission and did not find water (for taking bath) and you did not say prayer, but as for myself I rolled in dust and said prayer, and (when it was mentioned before) the Apostle (may peace be upon him) said: It was enough for you to strike the ground with your hands and then blow (the dust) and then wipe your face and palms. Umar said: 'Ammar, fear Allah. He said: If you so like, I would not narrate it. A hadith like this has been transmitted with the same chain of transmitters but for the words: 'Umar said: We hold you responsible for what you claim.\"",
      "chain": [
        "30550",
        "20031",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا النضر بن شميل، أخبرنا شعبة، عن الحكم، قال سمعت ذرا، عن ابن عبد الرحمن بن أبزى، قال قال الحكم وقد سمعته من ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، أتى عمر فقال إني أجنبت فلم أجد ماء ‏.‏ وساق الحديث وزاد فيه قال عمار يا أمير المؤمنين إن شئت لما جعل الله على من حقك لا أحدث به أحدا ولم يذكر حدثني سلمة عن ذر ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abza mnated it on the authority of his father that a man came to Umar and said:                      I have had a seminal emission but I found no water, and the rest of the hadith is the same but with this addition: 'Amr said: 0 Commander of the Faithful, because of the right given to you by Allah over me, if you desire, I would not narrate this hadith to anyone.",
      "chain": [
        "30313",
        "20291",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - أخبرنا شعبة، عن سلمة، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، عن عمار، بهذه القصة فقال ‏\"‏ إنما كان يكفيك ‏\"‏ ‏.‏ وضرب النبي صلى الله عليه وسلم بيده إلى الأرض ثم نفخ فيها ومسح بها وجهه وكفيه شك سلمة وقال لا أدري فيه إلى المرفقين ‏.‏ يعني أو إلى الكفين ‏.‏",
      "text_en": " Ibn 'Abd al-Rahman b. Abza reported on the authority of his father this incident from 'Ammar. He said:                      This would have been enough for you, and the Prophet (ﷺ) struck the ground with his hand. He then blew it and wiped with it his face and hands. Being doubtful Salamah said: I do not know (whether he wiped) up to the elbows or the wrists.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثني الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، عن عمار، في هذا الحديث قال فقال يعني النبي صلى الله عليه وسلم ‏\"‏ إنما كان يكفيك أن تضرب بيديك إلى الأرض فتمسح بهما وجهك وكفيك ‏\"‏ ‏.‏ وساق الحديث ‏.‏ قال أبو داود ورواه شعبة عن حصين عن أبي مالك قال سمعت عمارا يخطب بمثله إلا أنه قال لم ينفخ ‏.‏ وذكر حسين بن محمد عن شعبة عن الحكم في هذا الحديث قال ضرب بكفيه إلى الأرض ونفخ ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis is also transmitted by Ibn 'Abd al-Rahman b. Abza on the authority of his father from 'Ammar. He reported the Prophet (ﷺ) as saying:                      It would have been enough for you to strike the ground with you hands and then wipe them your face and your hands (up to the wrists). He then narrated the rest of the tradition.Abu Dawud said: This is also transmitted by Shu'bah from Husain on the authority of Abu Malik. He said: I heard 'Ammar saying so him his speech, except that in this version he added the words: \"He blew.\" And Husain b. Muhammad narrated from Shu'bah on the authority of al-Hakam and in this version added the words:\"He (the Prophet) struck the earth with his plans and blew.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن عمار بن ياسر، قال سألت النبي صلى الله عليه وسلم عن التيمم فأمرني ضربة واحدة للوجه والكفين ‏.‏",
      "text_en": " 'Ammar b. Yasir said:                      I asked the Prophet (ﷺ) about tayammum. He commanded me to strike only one stroke (i.e. the strike the ground) for (wiping) the face and the hands.",
      "chain": [
        "30173",
        "20304",
        "11168",
        "11019",
        "10799",
        "11346",
        "4046",
        "25"
      ]
    },
    {
      "hadith_no": "837",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، وابن المثنى، قالا حدثنا أبو داود، حدثنا شعبة، عن الحسن بن عمران، - قال ابن بشار الشامي وقال أبو داود أبو عبد الله العسقلاني - عن ابن عبد الرحمن بن أبزى، عن أبيه، أنه صلى مع رسول الله صلى الله عليه وسلم وكان لا يتم التكبير ‏.‏ قال أبو داود معناه إذا رفع رأسه من الركوع وأراد أن يسجد لم يكبر وإذا قام من السجود لم يكبر ‏.‏",
      "text_en": " ‘Abd al Rahman b. Abza said that he offered prayer along with the Messenger of Allah(ﷺ) but he did not complete the takbir.Abu Dawud said:                      This means that when he raised his head after bowing and when he was about to prostrate, he did not utter the takbir, and when he stood up after prostration, he did not utter the takbir.",
      "chain": [
        "30160",
        "30170",
        "30002",
        "20020",
        "28103",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1423",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، ح وحدثنا إبراهيم بن موسى، أخبرنا محمد بن أنس، - وهذا لفظه - عن الأعمش، عن طلحة، وزبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل للذين كفروا ‏}‏ والله الواحد الصمد ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Messenger of Allah (ﷺ) used to observe witr with (reciting) \"Glorify the name of thy Lord, the most High\" (Surah 87), \"Say O disbelievers\" (Surah 109), and \"Say, He is Allah, the One, Allah, the eternally besought of all\" (112).",
      "chain": [
        "30203",
        "25208",
        "30309",
        "11060",
        "11356",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن أبي عبيدة، حدثنا أبي، عن الأعمش، عن طلحة الأيامي، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم إذا سلم في الوتر قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     When the Messenger of Allah (ﷺ) offered salutation in the witr prayer, he said: Glorify be to the king most holy.",
      "chain": [
        "30203",
        "25250",
        "11060",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "144",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي الفلاس حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن عمار بن ياسر، أن النبي صلى الله عليه وسلم أمره بالتيمم للوجه والكفين ‏.‏ قال وفي الباب عن عائشة وابن عباس ‏.‏ قال أبو عيسى حديث عمار حديث حسن صحيح ‏.‏ وقد روي عن عمار من غير وجه ‏.‏ وهو قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم علي وعمار وابن عباس وغير واحد من التابعين منهم الشعبي وعطاء ومكحول قالوا التيمم ضربة للوجه والكفين ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم منهم ابن عمر وجابر وإبراهيم والحسن قالوا التيمم ضربة للوجه وضربة لليدين إلى المرفقين ‏.‏ وبه يقول سفيان الثوري ومالك وابن المبارك والشافعي ‏.‏ وقد روي هذا الحديث عن عمار في التيمم أنه قال للوجه والكفين من غير وجه ‏.‏ وقد روي عن عمار أنه قال تيممنا مع النبي صلى الله عليه وسلم إلى المناكب والآباط ‏.‏ فضعف بعض أهل العلم حديث عمار عن النبي صلى الله عليه وسلم في التيمم للوجه والكفين لما روي عنه حديث المناكب والآباط ‏.‏ قال إسحاق بن إبراهيم بن مخلد الحنظلي حديث عمار في التيمم للوجه والكفين هو حديث حسن صحيح ‏.‏ وحديث عمار تيممنا مع النبي صلى الله عليه وسلم إلى المناكب والآباط ليس هو بمخالف لحديث الوجه والكفين لأن عمارا لم يذكر أن النبي صلى الله عليه وسلم أمرهم بذلك وإنما قال فعلنا كذا وكذا فلما سأل النبي صلى الله عليه وسلم أمره بالوجه والكفين فانتهى إلى ما علمه رسول الله صلى الله عليه وسلم الوجه والكفين والدليل على ذلك ما أفتى به عمار بعد النبي صلى الله عليه وسلم في التيمم أنه قال الوجه والكفين ففي هذا دلالة أنه انتهى إلى ما علمه النبي صلى الله عليه وسلم فعلمه إلى الوجه والكفين ‏.‏ قال وسمعت أبا زرعة عبيد الله بن عبد الكريم يقول لم أر بالبصرة أحفظ من هؤلاء الثلاثة علي بن المديني وابن الشاذكوني وعمرو بن علي الفلاس ‏.‏ قال أبو زرعة وروى عفان بن مسلم عن عمرو بن علي حديثا ‏.‏",
      "text_en": " Ammar bin Yasir narrated that :                     the Prophet ordered him to perform Tayammum by rubbing his face and two palms.",
      "chain": [
        "30286",
        "20304",
        "11168",
        "11019",
        "10799",
        "11346",
        "4046",
        "25"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب بن الشهيد البصري، حدثنا محمد بن فضيل، حدثنا الأعمش، عن حبيب بن أبي ثابت، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا الريح فإذا رأيتم ما تكرهون فقولوا اللهم إنا نسألك من خير هذه الريح وخير ما فيها وخير ما أمرت به ونعوذ بك من شر هذه الريح وشر ما فيها وشر ما أمرت به ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأبي هريرة وعثمان بن أبي العاصي وأنس وابن عباس وجابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that the Messenger of Allah(s.a.w) said:                     \"Do not curse the wind. When you see what you dislike, then say: 'Allahumma inna nas-aluka min khairi hadhihir-rih, wa khairi ma fiha wa khairi ma  umirat bihi wa na'udhu bika min sharri hadhihir-rih wa sharri ma fiha wa sharri ma umirat bihi' ('O Allah! Indeed we ask you of the good of this wind, and the good of what is in it, and the good of what it has been commanded. And we seek refuge in You from the evil of this wind, and the evil of what is in it, and the evil of what it has been commanded.)\"",
      "chain": [
        "30123",
        "20356",
        "11060",
        "11331",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن سلمة، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، أتى عمر فقال إني أجنبت فلم أجد الماء ‏.‏ قال عمر لا تصل ‏.‏ فقال عمار بن ياسر يا أمير المؤمنين أما تذكر إذ أنا وأنت في سرية فأجنبنا فلم نجد الماء فأما أنت فلم تصل وأما أنا فتمعكت في التراب فصليت فأتينا النبي صلى الله عليه وسلم فذكرنا ذلك له فقال ‏\"‏ إنما كان يكفيك ‏\"‏ ‏.‏ فضرب النبي صلى الله عليه وسلم يديه إلى الأرض ثم نفخ فيهما ثم مسح بهما وجهه وكفيه - وسلمة شك لا يدري فيه المرفقين أو إلى الكفين - فقال عمر نوليك ما توليت ‏.‏",
      "text_en": " It was narrated from Ibn 'Abdur-Rahman bin Abza from his father that a man came to 'Umar and said:                      \"I have become Junub and I do not have any water.\" 'Umar said: \"Do not pray.\" But 'Ammar bin Yasir said: \"O Commander of the Believers! Don't you remember when you and I were on a campaign and we became Junub and could not find water? You did not pray, but I rolled in the dust and prayed. Then we came to the Prophet (ﷺ) and told him about that, and he said: 'It would have been sufficient for you (to do this),' then the Prophet (ﷺ) struck his hands on the ground and blew on them, then wiped his face and hands with them'\" - (one of the narrators) Salamah was uncertain and did not know whether that was up to the elbows or just hands. And 'Umar said: \"We will let you bear the burden of what you took upon yourself.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "237",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "319",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز، قال حدثنا شعبة، قال حدثنا الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، سأل عمر بن الخطاب عن التيمم، فلم يدر ما يقول فقال عمار أتذكر حيث كنا في سرية فأجنبت فتمعكت في التراب فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ إنما يكفيك هكذا ‏\"‏ ‏.‏ وضرب شعبة بيديه على ركبتيه ونفخ في يديه ومسح بهما وجهه وكفيه مرة واحدة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abdur-Rahman bin Abza, from his father, that a man asked 'Umar bin Al-Khattab about Tayammum and he did not know what to say. 'Ammar said:                      \"Do you remember when we were on a campaign, and I became Junub and rolled in the dust, then I came to the Prophet (ﷺ) and he said: 'This would have been sufficient.'\" (One of the narrators) Shu'bah struck his hands on his knees and blew into his hands, then he wiped his face and palms with them once.",
      "chain": [
        "20214",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046",
        "3"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبد الله بن محمد بن تميم، قال حدثنا حجاج، قال حدثنا شعبة، عن الحكم، وسلمة، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، جاء إلى عمر - رضى الله عنه - فقال إني أجنبت فلم أجد الماء ‏.‏ فقال عمر لا تصل ‏.‏ فقال عمار أما تذكر يا أمير المؤمنين إذ أنا وأنت في سرية فأجنبنا فلم نجد ماء فأما أنت فلم تصل وأما أنا فتمعكت في التراب ثم صليت فلما أتينا رسول الله صلى الله عليه وسلم ذكرت ذلك له فقال ‏\"‏ إنما يكفيك ‏\"‏ ‏.‏ وضرب النبي صلى الله عليه وسلم بيديه إلى الأرض ثم نفخ فيهما فمسح بهما وجهه وكفيه - شك سلمة وقال لا أدري فيه إلى المرفقين أو إلى الكفين - قال عمر نوليك من ذلك ما توليت قال شعبة كان يقول الكفين والوجه والذراعين ‏.‏ فقال له منصور ما تقول فإنه لا يذكر الذراعين أحد غيرك ‏.‏ فشك سلمة فقال لا أدري ذكر الذراعين أم لا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abdur-Rahman bin Abza, from his father, that a man came to 'Umar, may Allah be please with him, and said:                      \"I have become Junub and I cannot find any water.\" 'Umar said: \"Do not pray.\" 'Ammar said: \"Do you not remember, O Commander of the Believers, when you and I were on a campaign and became Junub, and we could not find any water. You did not pray, but I rolled in the dust then prayed. When we came to the Messenger of Allah (ﷺ) I told him about that and he said: 'This would have been sufficient for you,' and then Prophet (ﷺ) struck the earth with his hands then blew on them and wiped his face and hands - (one of the narrators) Salamah was uncertain and said: \"I do not know if he said it should be up to the elbows or just the hands.\" - 'Umar said: \"We will let you bear the burden of what you took upon yourself.\" (One of the narrators) Shu'bah said: \"He used to say the hands, face and forearms.\" (Another) Mansur said to him: \"What are you saying? No one mentions the forearms except you.\" Salamah was not certain and said: \"I do not know whether he mentioned the forearms or not.\"",
      "chain": [
        "20219",
        "20020",
        "11069",
        "237",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1699",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا علي بن ميمون، قال حدثنا مخلد بن يزيد، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان يوتر بثلاث ركعات كان يقرأ في الأولى ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ ويقنت قبل الركوع فإذا فرغ قال عند فراغه ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يطيل في آخرهن ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah (ﷺ) used to pray witr with three rak'ahs. In the first he would recite: \"Glorify the Name of Your Lord, the Most High\" in the second: \"Say: O you disbelievers!\", and in the third: \"Say: He is Allah, (the) One\". And he would say the Qunut before bowing, and when he finished he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the last time.",
      "chain": [
        "20462",
        "20012",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1700",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، عن سعيد بن أبي عروبة، عن قتادة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الركعة الأولى من الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"In the first rak'ah of witr, the Messenger of Allah (ﷺ) used to recite: \"GLorify the Name of your Lord, the Most High;\" in the second; \"Say: O you disbelievers!\" and in the third; \"Say: He is Allah, (the) One.\"",
      "chain": [
        "30123",
        "20347",
        "11073",
        "11019",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1701",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن موسى، قال أنبأنا عبد العزيز بن خالد، قال حدثنا سعيد بن أبي عروبة، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الركعة الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ ولا يسلم إلا في آخرهن ويقول يعني بعد التسليم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah (ﷺ) used to recite: \"Glorify the Name of Your Lord, the Most High;\" in witr, in the second rak'ah he would recite: \"Say: O you disbelievers!\"; and in the third \"Say: He is Allah, (the) One\". And he only said the taslim at the end, and he would say- meaning after the taslim: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy)' three times.\"",
      "chain": [
        "30221",
        "11073",
        "11019",
        "10799",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1729",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن الحسين بن إبراهيم بن إشكاب النسائي، قال أنبأنا محمد بن أبي عبيدة، قال حدثنا أبي، عن الأعمش، عن طلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا سلم قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " Sa'eed bin 'Abdur-Rahman bin Abza narrated from his father, that:                     Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times.\"",
      "chain": [
        "11060",
        "11356",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن موسى، قال حدثنا عبد الرحمن بن عبد الله بن سعد، قال حدثنا أبو جعفر الرازي، عن الأعمش، عن زبيد، وطلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ خالفهما حصين فرواه عن ذر عن ابن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Sa'eed bin Abdur-Rahman bin Abza narrated from his father, that:                     Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30221",
        "20746",
        "11060",
        "11335",
        "11356",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1731",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسن بن قزعة، عن حصين بن نمير، عن حصين بن عبد الرحمن، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza from his father that:                     The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "34055",
        "18195",
        "15097",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ويرفع صوته بالثالثة ‏.‏",
      "text_en": " Bahz bin Asad, said:                     \"Shu'bah narrated to us, from Salamah and Zubaid, from Dharr, from Ibn Abdur-Rahman bin Abza from his father that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice the third time.\"",
      "chain": [
        "20214",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1733",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن عبد الرحمن، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ثم يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ويرفع ب ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ صوته بالثالثة ‏.‏ رواه منصور عن سلمة بن كهيل ولم يذكر ذرا ‏.‏",
      "text_en": " Khalid said:                     \"Shu'bah narrated to us, he said: Salamah and Zubaid informed me, from Dharr, from Ibn 'Abdur-Rahman bn Abza from Abdur-Rahman, that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with Subhanal-Malikil-Quddus the third time.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "10530"
      ]
    },
    {
      "hadith_no": "1734",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن قدامة، عن جرير، عن منصور، عن سلمة بن كهيل، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان إذا سلم وفرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا طول في الثالثة ‏.‏ ورواه عبد الملك بن أبي سليمان عن زبيد ولم يذكر ذرا ‏.‏",
      "text_en": " Mansur reported from Salamah bin Kuhail, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating his words the third time.\"",
      "chain": [
        "20028",
        "11067",
        "11350",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1735",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا عبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ورواه محمد بن جحادة عن زبيد ولم يذكر ذرا ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman reported from Zubaid, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "38022",
        "30213",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، عن زبيد، عن ذر، عن ابن أبزى، مرسل ‏.‏ وقد رواه عطاء بن السائب عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، ‏.‏",
      "text_en": " Ahmad bin Sulaiman informed us, he said:                     \"Yahya bin Adam narrated to us, he said: \"Malik narrated to us from Zubaid, from Dharr, from Ibn Abza.'\"",
      "chain": [
        "38022",
        "20364",
        "20001",
        "11335",
        "11423",
        "11068",
        "11346"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن الصباح، قال حدثنا الحسن بن حبيب، قال حدثنا روح بن القاسم، عن عطاء بن السائب، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " 'Ata bin As-Sa'ib reported from Sa'eed bin Abdur-Rahman bin Abza from his father:                     That the Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30142",
        "11586",
        "11068",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو داود، قال حدثنا شعبة، عن قتادة، قال سمعت عزرة، يحدث عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا فرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " Muhammad bin Bashshar informed us, he said:                      \"Abu Dawud narrated to us from Shu'bah, from Qatadah, who said: I heard 'Azarah narrating from Sa'eed bin 'Abdur-Rahman Ibn Abza, from his fatherThat the Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he had finished praying, he said: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times.\"",
      "chain": [
        "30160",
        "20547",
        "20020",
        "11019",
        "10799",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن النبي صلى الله عليه وسلم أنه كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza from his father that:                     The Messenger of Allah (ﷺ) used to recite in witr: \"Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) raising his voice the third time.\"",
      "chain": [
        "38011",
        "20005",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1751",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن يحيى، قال حدثنا محمد بن عبيد، عن سفيان الثوري، وعبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏ خالفهما أبو نعيم فرواه عن سفيان عن زبيد عن ذر عن سعيد ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:                     His father said: \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it.\"",
      "chain": [
        "30213",
        "20012",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1752",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي نعيم، عن سفيان، عن زبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا أراد أن ينصرف قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا يرفع بها صوته ‏.‏ قال أبو عبد الرحمن أبو نعيم أثبت عندنا من محمد بن عبيد ومن قاسم بن يزيد وأثبت أصحاب سفيان عندنا والله أعلم يحيى بن سعيد القطان ثم عبد الله بن المبارك ثم وكيع بن الجراح ثم عبد الرحمن بن مهدي ثم أبو نعيم ثم الأسود في هذا الحديث ‏.‏ ورواه جرير بن حازم عن زبيد فقال يمد صوته في الثالثة ويرفع ‏.‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza that his father said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it.\"",
      "chain": [
        "34188",
        "20348",
        "20012",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1753",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا حرمي بن يونس بن محمد، قال حدثنا أبي قال، حدثنا جرير، قال سمعت زبيدا، يحدث عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وإذا سلم قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يمد صوته في الثالثة ثم يرفع ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that his father said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the third time, then raising it.\"",
      "chain": [
        "4057",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1754",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عبد العزيز بن عبد الصمد، قال حدثنا سعيد، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وإذا فرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ أرسله هشام ‏.‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza from his father that:                     The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy).",
      "chain": [
        "30170",
        "20251",
        "11168",
        "11019",
        "10799",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي عامر، عن هشام، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، أن النبي صلى الله عليه وسلم كان يوتر ‏.‏ وساق الحديث ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:                     The Prophet (ﷺ) used to recite in witr and he quoted the same hadith.",
      "chain": [
        "34188",
        "20295",
        "11019",
        "10799",
        "11346"
      ]
    },
    {
      "hadith_no": "5754",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سفيان، عن سلمة بن كهيل، عن ذر بن عبد الله، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال سألت أبى بن كعب عن النبيذ، فقال اشرب الماء واشرب العسل واشرب السويق واشرب اللبن الذي نجعت به ‏.‏ فعاودته فقال الخمر تريد الخمر تريد ‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Abdur-Rahman bin Abza that his father said:                     \"I asked Ubayy bin Ka'b about Nabidh, and he said: 'Drink water, drink honey, drink Sawiq (barley gruel) and drink milk that you have been nourished with since childhood.' I repeated the question and he said: 'Is it wine you want? Is it wine you want?'\"",
      "chain": [
        "16",
        "20005",
        "11350",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "612",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، أتى عمر بن الخطاب فقال إني أجنبت فلم أجد الماء ‏.‏ فقال عمر لا تصل ‏.‏ فقال عمار بن ياسر أما تذكر يا أمير المؤمنين إذ أنا وأنت في سرية فأجنبنا فلم نجد الماء فأما أنت فلم تصل وأما أنا فتمعكت في التراب فصليت فلما أتيت النبي  صلى الله عليه وسلم  فذكرت ذلك له ‏.‏ فقال ‏\"‏ إنما كان يكفيك ‏\"‏ ‏.‏ وضرب النبي  صلى الله عليه وسلم  بيديه إلى الأرض ثم نفخ فيهما ومسح بهما وجهه وكفيه ‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Abdur-Rahman bin Abza from his father, that:                     A man came to 'Umar bin khattab and said: \"I became impure following sexual emission and cannot find any water.\" 'Umar said to him: \"Do not pray.\" But 'Ammar bin Yasir said: \"Do you not remember, O Commander of the Believers, when you and I were on a military expedition and we became sexually impure and could not find water? As for you, you did not pray, but I rolled in the dust and then prayed. When I came to the Prophet and told him what had happened, he said: 'It would have been enough for you (to do this).' (Then demonstrating) the Prophet struck the ground with his hands, then blew on hem, and wiped his face and palms with them.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، حدثنا الأعمش، عن طلحة، وزبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله  صلى الله عليه وسلم  يوتر ب ‏{سبح اسم ربك الأعلى}‏ و ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد‏}‏ ‏.‏",
      "text_en": " It wasnarrated that Ubayy bin Ka’b said:                      “The Messenger of Allah(ﷺ)used to perform Witr and recite: ‘Glorify the Name of your LordtheMost High.’, [Al-A’la (87)] ‘Say: O you disbelievers!”[Al-Kafirun(109)] and ‘Say: Allah is One.”. [Al-Ikhlas (112)]",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11356",
        "11335",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن زبيد اليامي، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  كان يوتر فيقنت قبل الركوع ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that the Messenger of Allah (ﷺ)usedto pray Witr and he would recite Qunut before Ruku’.",
      "chain": [
        "38412",
        "20462",
        "20012",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    }
  ],
  "total_hadiths": 41
}