{
  "id": "11358",
  "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
  "full_name": "'Asim bin Abu al-Najud (Bahdla) عاصم بن بهدلة / بن أبي النجود",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق له أوهام ]"
    ],
    "tags": [
      "B.Asad",
      "Client",
      "al-Kufi",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11337",
      "name": "Zar bin Habaysh bin Habasha زر بن حبيش بن حباشة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10826",
      "name": "Mas'ud bin Malik Abu Razayn al-Asadi مسعود بن مالك أبو رزين الأسدي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11394",
      "name": "al-Musayb bin Rafa'i al-Asadi المسيب بن رافع الأسدي الكاهلي أبو العلاء",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11396",
      "name": "Ma'bad bin Khalid al-Jadli معبد بن خالد الجدلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18400",
      "name": "Swa'a al-Khza'y Akhw Mghyth سواء الخزاعي أخو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25067",
      "name": "Hafs bin Sulaiman al-Asadi حفص بن سليمان الأسدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2834",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن حاتم، وابن أبي عمر، كلاهما عن ابن عيينة، - قال ابن حاتم حدثنا سفيان بن عيينة، - عن عبدة، وعاصم بن أبي النجود، سمعا زر بن حبيش، يقول سألت أبى بن كعب - رضى الله عنه - فقلت إن أخاك ابن مسعود يقول من يقم الحول يصب ليلة القدر ‏.‏ فقال رحمه الله أراد أن لا يتكل الناس أما إنه قد علم أنها في رمضان وأنها في العشر الأواخر وأنها ليلة سبع وعشرين ‏.‏ ثم حلف لا يستثني أنها ليلة سبع وعشرين فقلت بأى شىء تقول ذلك يا أبا المنذر قال بالعلامة أو بالآية التي أخبرنا رسول الله صلى الله عليه وسلم أنها تطلع يومئذ لا شعاع لها ‏.‏",
      "text_en": " Zirr b. Habaish reported:                      I thu asked Ubayy b. Ka'b (Allah be pleased with him): Your brother (in faith) Ibn Mas'ud says: He who stands (for the night prayer) throughout the year would find Lailat-ul-Qadr, whereupon he said: May Allah have mercy upon him; (he said these words) with the intention that people might not rely only (on one night), whereas he knew that it (Lailat-ul-Qadr) is in the month of Ramadan and it is the twenty-seventh night. He then took oath (without making any exception, i. e. without saying Innsha Allah) that it was the twenty-seventh night. I said to him: Abu Mundhir, on what ground do you say that? Thereupon he said: By the indication or by the sign which the Messenger of Allah (may peace be upon him) gave us, and that is that on that day (the sun) would rise without having any ray in it.",
      "chain": [
        "38487",
        "30421",
        "20005",
        "20005",
        "20337",
        "11358",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "552",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن أبي رزين، عن ابن أم مكتوم، أنه سأل النبي صلى الله عليه وسلم فقال يا رسول الله إني رجل ضرير البصر شاسع الدار ولي قائد لا يلائمني فهل لي رخصة أن أصلي في بيتي قال ‏\"‏ هل تسمع النداء ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ لا أجد لك رخصة ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Za'dah, Ibn Umm Maktum:                     Ibn Umm Maktum asked the Prophet (ﷺ) saying: Messenger of Allah, I am a blind man, my house is far away (from the mosque), and I have a guide who does not follow me. Is it possible that permission be granted to me for saying prayer in my house? He asked: Do you hear summons (adhan)? He said: Yes. He said: I do not find any permission for you.",
      "chain": [
        "20193",
        "20022",
        "11358",
        "10826"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني عاصم بن بهدلة، عن زر، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقال لصاحب القرآن اقرأ وارتق ورتل كما كنت ترتل في الدنيا فإن منزلك عند آخر آية تقرؤها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: One who was devoted to the Qur'an will be told to recite, ascend and recite carefully as he recited carefully when he was in the world, for he will reach his abode when he comes to the last verse he recites.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11358",
        "11337",
        "29"
      ]
    },
    {
      "hadith_no": "1657",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن عاصم بن أبي النجود، عن شقيق، عن عبد الله، قال كنا نعد الماعون على عهد رسول الله صلى الله عليه وسلم عارية الدلو والقدر ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     During the time of the Messenger of Allah (ﷺ) we used to consider ma'un (this of daily use) lending a bucket and cooking-pot.",
      "chain": [
        "30367",
        "20469",
        "11358",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2451",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عاصم بن بهدلة، عن سواء الخزاعي، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يصوم ثلاثة أيام من الشهر الاثنين والخميس والاثنين من الجمعة الأخرى ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The apostle of Allah (ﷺ) used to fast three days every month: Monday, Thursday and Monday in the next week.",
      "chain": [
        "20040",
        "20022",
        "11358",
        "18400",
        "54"
      ]
    },
    {
      "hadith_no": "5042",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عاصم بن بهدلة، عن شهر بن حوشب، عن أبي ظبية، عن معاذ بن جبل، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مسلم يبيت على ذكر طاهرا فيتعار من الليل فيسأل الله خيرا من الدنيا والآخرة إلا أعطاه إياه ‏\"‏ ‏.‏ قال ثابت البناني قدم علينا أبو ظبية فحدثنا بهذا الحديث عن معاذ بن جبل عن النبي صلى الله عليه وسلم قال ثابت قال فلان لقد جهدت أن أقولها حين أنبعث فما قدرت عليها ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: If a Muslim sleeps while remembering Allah, in the state of purification, is alarmed while asleep at night, and asks Allah for good in this world and in the Hereafter. He surely gives it to him. Thabit al-Bunani said: AbuZabyah came to visit us and he transmitted this tradition to us from Mu'adh ibn Jabal from the Prophet (ﷺ). Thabit said: So and so said: I tried my best to utter these (prayers) when I got up, but I could not do.",
      "chain": [
        "20040",
        "20022",
        "11358",
        "11044",
        "32"
      ]
    },
    {
      "hadith_no": "96",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عاصم بن أبي النجود، عن زر بن حبيش، عن صفوان بن عسال، قال كان رسول الله صلى الله عليه وسلم يأمرنا إذا كنا سفرا أن لا ننزع خفافنا ثلاثة أيام ولياليهن إلا من جنابة ولكن من غائط وبول ونوم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى الحكم بن عتيبة وحماد عن إبراهيم النخعي عن أبي عبد الله الجدلي عن خزيمة بن ثابت ولا يصح ‏.‏ قال علي بن المديني قال يحيى بن سعيد قال شعبة لم يسمع إبراهيم النخعي من أبي عبد الله الجدلي حديث المسح ‏.‏ وقال زائدة عن منصور كنا في حجرة إبراهيم التيمي ومعنا إبراهيم النخعي فحدثنا إبراهيم التيمي عن عمرو بن ميمون عن أبي عبد الله الجدلي عن خزيمة بن ثابت عن النبي صلى الله عليه وسلم في المسح على الخفين ‏.‏ قال محمد بن إسماعيل أحسن شيء في هذا الباب حديث صفوان بن عسال المرادي ‏.‏ قال أبو عيسى وهو قول أكثر العلماء من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم من الفقهاء مثل سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق قالوا يمسح المقيم يوما وليلة والمسافر ثلاثة أيام ولياليهن ‏.‏ قال أبو عيسى وقد روي عن بعض أهل العلم أنهم لم يوقتوا في المسح على الخفين وهو قول مالك بن أنس ‏.‏ قال أبو عيسى والتوقيت أصح ‏.‏ وقد روي هذا الحديث عن صفوان بن عسال أيضا من غير حديث عاصم ‏.‏",
      "text_en": " Safwan bin Assal narrated:                     'When we were traveling, Allah's Messenger would order us not to remove our Khuff for three days and nights, except for Janabah, but not for defecating, urinating, and sleep.\"",
      "chain": [
        "30480",
        "20327",
        "11358",
        "11337",
        "4143"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا بدل بن المحبر، حدثنا عبد الملك بن معدان، عن عاصم بن بهدلة، عن أبي وائل، عن عبد الله بن مسعود، أنه قال ما أحصي ما سمعت من، رسول الله صلى الله عليه وسلم يقرأ في الركعتين بعد المغرب وفي الركعتين قبل صلاة الفجر ب ‏:‏‏(‏قل يا أيها الكافرون ‏)‏ و ‏(‏قل هو الله أحد ‏)‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث ابن مسعود حديث غريب من حديث ابن مسعود لا نعرفه إلا من حديث عبد الملك بن معدان عن عاصم ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"I can not enumerate (how many times) I heard Allah's Messenger (S) reciting - in the two Rak'ah after Al-Maghrib and the two Rak'ah before Salatul-Fajr with: Say: \"O you disbelievers!\" and Say: \"He is Allah the One.\"",
      "chain": [
        "20210",
        "11358",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1444",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو بكر بن عياش، عن عاصم بن بهدلة، عن أبي صالح، عن معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب الخمر فاجلدوه فإن عاد في الرابعة فاقتلوه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة والشريد وشرحبيل بن أوس وجرير وأبي الرمد البلوي وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث معاوية هكذا روى الثوري أيضا عن عاصم عن أبي صالح عن معاوية عن النبي صلى الله عليه وسلم ‏.‏ وروى ابن جريج ومعمر عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ قال سمعت محمدا يقول حديث أبي صالح عن معاوية عن النبي صلى الله عليه وسلم في هذا أصح من حديث أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وإنما كان هذا في أول الأمر ثم نسخ بعد هكذا روى محمد بن إسحاق عن محمد بن المنكدر عن جابر بن عبد الله عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من شرب الخمر فاجلدوه فإن عاد في الرابعة فاقتلوه ‏\"‏ ‏.‏ قال ثم أتي النبي صلى الله عليه وسلم بعد ذلك برجل قد شرب الخمر في الرابعة فضربه ولم يقتله ‏.‏ وكذلك روى الزهري عن قبيصة بن ذؤيب عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ قال فرفع القتل وكانت رخصة ‏.‏ والعمل على هذا الحديث عند عامة أهل العلم لا نعلم بينهم اختلافا في ذلك في القديم والحديث ومما يقوي هذا ما روي عن النبي صلى الله عليه وسلم من أوجه كثيرة أنه قال ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث النفس بالنفس والثيب الزاني والتارك لدينه ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     That the Messenger of Allah (ﷺ) said: \"Whoever drinks wine, then lash him. If he returns to it, then on the fourth time kill him.\"",
      "chain": [
        "30216",
        "20373",
        "11358",
        "11161",
        "27"
      ]
    },
    {
      "hadith_no": "2230",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي الكوفي، قال حدثني أبي، حدثنا سفيان الثوري، عن عاصم بن بهدلة، عن زر، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تذهب الدنيا حتى يملك العرب رجل من أهل بيتي يواطئ اسمه اسمي ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وأبي سعيد وأم سلمة وأبي هريرة ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah narrated that the Messenger of Allah(s.a.w) said:                     \"The world shall not pass away until a man from the people of my family rules the Arabs whose name agrees with my name.\"",
      "chain": [
        "20012",
        "11358",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "2258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن الأعمش، وحماد، وعاصم بن بهدلة، سمعوا أبا وائل، عن حذيفة، قال قال عمر أيكم يحفظ ما قال رسول الله صلى الله عليه وسلم في الفتنة فقال حذيفة أنا ‏.‏ قال حذيفة فتنة الرجل في أهله وماله وولده وجاره يكفرها الصلاة والصوم والصدقة والأمر بالمعروف والنهى عن المنكر ‏.‏ فقال عمر لست عن هذا أسألك ولكن عن الفتنة التي تموج كموج البحر قال يا أمير المؤمنين إن بينك وبينها بابا مغلقا ‏.‏ قال عمر أيفتح أم يكسر قال بل يكسر ‏.‏ قال إذا لا يغلق إلى يوم القيامة ‏.‏ قال أبو وائل في حديث حماد فقلت لمسروق سل حذيفة عن الباب فسأله فقال عمر ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " Abu Wa'il narrated from Hudhaifah that 'Umar said:                     \"Which of you remembers what the Messenger of Allah(s.a.w) said about the Fitnah?\" So Hudhaifah said: \"I do.\" Hudhaifah said: \"A man's Fitnah is in his family, his wealth, his children, and his neighbors. It is atoned for by the Salat, fasting, charity, and by commanding good and forbidding evil.\" 'Umar said: \"I am not asking you about this. Rather, about the Fitnah that spreads like the waves of the sea.\" He said: \"O Commander of the Believers! Between you and it is a closed door.\" 'Umar said: \"Will it be opened or broken?\" He said: \"It will be broken.\" He said: \"Then it will never be closed until the Day of Judgement.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11060",
        "20022",
        "11358",
        "145"
      ]
    },
    {
      "hadith_no": "2398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال قلت يا رسول الله أى الناس أشد بلاء قال ‏\"‏ الأنبياء ثم الأمثل فالأمثل فيبتلى الرجل على حسب دينه فإن كان دينه صلبا اشتد بلاؤه وإن كان في دينه رقة ابتلي على حسب دينه فما يبرح البلاء بالعبد حتى يتركه يمشي على الأرض ما عليه خطيئة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة وأخت حذيفة بن اليمان ‏أن النبي صلى الله عليه وسلم سئل أي الناس أشد بلاء قال الأنبياء ثم الأمثل فالأمثل.",
      "text_en": " Mus'ab bin Sa'd narrated from his father that a man said:                      \"O Messenger of Allah(s.a.w)! Which of the people is tried most severely?\" He said:\"The Prophets, then those nearest to them, then those nearest to them. A man is tried according to his religion; if he is firm in his religion, then his trials are more severe, and if he is frail in his religion, then he is tried according to the strength of his religion. The servant shall continue to be tried until he is left walking upon the earth without any sins.\"",
      "chain": [
        "30367",
        "20022",
        "11358",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "2794",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس بن محمد الدوري البغدادي، حدثنا يحيى بن أبي بكير، حدثنا شريك، عن عاصم، هو ابن بهدلة عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أوقد على النار ألف سنة حتى احمرت ثم أوقد عليها ألف سنة حتى ابيضت ثم أوقد عليها ألف سنة حتى اسودت فهي سوداء مظلمة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"The Fire was kindled for one thousand years until it reddened, then it was kindled for one thousand years until it whitened, then it was kindled for one thousand years until it became blackened, so it is dark black.\"",
      "chain": [
        "20365",
        "20587",
        "11358",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2616",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا عبد الله بن معاذ الصنعاني، عن معمر، عن عاصم بن أبي النجود، عن أبي وائل، عن معاذ بن جبل، قال كنت مع النبي صلى الله عليه وسلم في سفر فأصبحت يوما قريبا منه ونحن نسير فقلت يا رسول الله أخبرني بعمل يدخلني الجنة ويباعدني من النار ‏.‏ قال ‏\"‏ لقد سألتني عن عظيم وإنه ليسير على من يسره الله عليه تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أدلك على أبواب الخير الصوم جنة والصدقة تطفئ الخطيئة كما يطفئ الماء النار وصلاة الرجل من جوف الليل ‏\"‏ ‏.‏ قال ثم تلا‏:‏ ‏(‏ تتجافى جنوبهم عن المضاجع ‏)‏ حتى بلغ‏:‏ ‏(‏يعملون‏)‏ ثم قال ‏\"‏ ألا أخبرك برأس الأمر كله وعموده وذروة سنامه ‏\"‏ ‏.‏ قلت بلى يا رسول الله ‏.‏ قال ‏\"‏ رأس الأمر الإسلام وعموده الصلاة وذروة سنامه الجهاد ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبرك بملاك ذلك كله ‏\"‏ ‏.‏ قلت بلى يا نبي الله قال فأخذ بلسانه قال ‏\"‏ كف عليك هذا ‏\"‏ ‏.‏ فقلت يا نبي الله وإنا لمؤاخذون بما نتكلم به فقال ‏\"‏ ثكلتك أمك يا معاذ وهل يكب الناس في النار على وجوههم أو على مناخرهم إلا حصائد ألسنتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     \"I accompanied the Prophet (ﷺ) on a journey. One day I was near him while we were moving so I said: 'O Messenger of Allah! Inform me about an action by which I will be admitted into Paradise, and which will keep me far from the Fire.' He said: 'You have asked me about something great, but it is easy for whomever Allah makes it easy: Worship Allah and do not associate any partners with Him, establish the Salat, give the Zakat, fast Ramadan and perform Hajj to the HOuse.' Then he said: 'Shall I not guide you to the doors of good? Fasting is a shield, and charity extinguishes sins like water extinguishes fire - and a man's praying in depths of the night.'\" He said: \"Then he recited: 'Their sides forsake their beds to call upon their Lord.' Until he reached: 'What they used to do.' [32:16-17]Then he said: 'Shall I not inform you about the head of the entire matter, and its pillar, and its hump?' I said: 'Of course O Messenger of Allah! He said: 'The head of the matter is Islam, and its pillar is the Salat, and its hump is Jihad.' Then he said: 'Shall I not inform you about what governs all of that?' I said: 'Of course O Messenger of Allah!'\" He (ﷺ) said: \"So he grabbed his tongue. He said 'Restrain this.' I said: 'O Prophet of Allah! Will we be taken to account for what we say?' He said: 'May your mother grieve your loss O Mu'adh! Are the people tossed into the Fire upon their faces, or upon their noses, except because of what their tongues have wrought'\"",
      "chain": [
        "30421",
        "28307",
        "20115",
        "11358",
        "11353",
        "32"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، وأبو نعيم عن سفيان، عن عاصم بن أبي النجود، عن زر، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقال لصاحب القرآن اقرأ وارتق ورتل كما كنت ترتل في الدنيا فإن منزلتك عند آخر آية تقرأ بها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Prophet (ﷺ) said: \"It shall be said - meaning to the one who memorized the Qur'an - 'Recite, and rise up, recite (melodiously) as you would recite in the world. For indeed your rank shall be at the last Ayah you recited.'\"",
      "chain": [
        "30277",
        "20668",
        "20348",
        "20012",
        "11358",
        "11337",
        "29"
      ]
    },
    {
      "hadith_no": "3165",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عاصم بن بهدلة، عن أبي صالح، عن أبي هريرة، نحوه ولم يرفعه ‏.‏ قال أبو عيسى وهذا أصح من حديث عبد الصمد عن شعبة ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11358",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3359",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو بكر بن عياش، عن عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال لما كان يوم بدر جئت بسيف فقلت يا رسول الله إن الله قد شفى صدري من المشركين أو نحو هذا هب لي هذا السيف ‏.‏ فقال ‏\"‏ هذا ليس لي ولا لك ‏\"‏ ‏.‏ فقلت عسى أن يعطى هذا من لا يبلي بلائي فجاءني الرسول فقال ‏\"‏ إنك سألتني وليس لي وقد صار لي وهو لك ‏\"‏ ‏.‏ قال فنزلت ‏:‏ ‏(‏ يسألونك عن الأنفال ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه سماك بن حرب عن مصعب بن سعد أيضا ‏.‏ وفي الباب عن عبادة بن الصامت ‏.‏",
      "text_en": " Narrated Mus'ab bin Sa'd:                     from his father who said: \"On the Day of Badr I brought a sword so I said: 'O Messenger of Allah! Indeed Allah has satisfied my breast (i.e. my desire) on the idolaters - or something like that - give me this sword.' So he said: 'This is not for me, nor is it for you.' I said: 'Perhaps he will give this to someone who did not go through some struggle I went through (fighting).' So the Messenger of Allah (ﷺ) came to me [and he said:] 'You asked me, but it was not up to me. But now it has occurred that it is up to me, so it is yours.'\" He said: \"So (the following) was revealed: They ask you about the spoils of war (8:1).\"",
      "chain": [
        "30216",
        "20373",
        "11358",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن أبي صالح، عن أبي الدرداء، عن النبي صلى الله عليه وسلم نحوه وليس فيه عن عطاء بن يسار ‏.‏ قال وفي الباب عن عبادة بن الصامت ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "20022",
        "11358",
        "11161",
        "37"
      ]
    },
    {
      "hadith_no": "3440",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مسعر، عن عاصم بن أبي النجود، عن زر بن حبيش، قال قلت لحذيفة بن اليمان أصلى رسول الله صلى الله عليه وسلم في بيت المقدس قال لا ‏.‏ قلت بلى ‏.‏ قال أنت تقول ذاك يا أصلع بما تقول ذلك قلت بالقرآن بيني وبينك القرآن ‏.‏ فقال حذيفة من احتج بالقرآن فقد أفلح قال سفيان يقول فقد احتج ‏.‏ وربما قال قد فلج فقال ‏:‏ ‏(‏سبحان الذي أسرى بعبده ليلا من المسجد الحرام إلى المسجد الأقصى ‏)‏ قال أفتراه صلى فيه قلت لا ‏.‏ قال لو صلى فيه لكتب عليكم فيه الصلاة كما كتبت الصلاة في المسجد الحرام قال حذيفة قد أتي رسول الله صلى الله عليه وسلم بدابة طويلة الظهر ممدودة هكذا خطوه مد بصره فما زايلا ظهر البراق حتى رأيا الجنة والنار ووعد الآخرة أجمع ثم رجعا عودهما على بدئهما قال ويتحدثون أنه ربطه لم أيفر منه وإنما سخره له عالم الغيب والشهادة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     \"I said to Hudhaifah bin Al-Yaman: 'Did the Messenger of Allah (ﷺ) perform Salat in Bait Al-Maqdis?' He said: 'No.' I said: 'But he did.' He said: 'You say that, O bald one! Based upon what do you say that?' I said: 'Based upon the Qur'an, (the Judge) between you and I is the Qur'an.' So Hudhaifah said: 'Whoever argues using the Qur'an, then he has indeed succeeded.'\" (One of the narrators) Sufyan said: \"He means: 'He has indeed proven'\" - and perhaps he (Sufyan) said: \"He triumphed.\" He (Zirr) said: \"Glorified is He Who took His slave for a journey by night from Al-Masjid Al-Haram to Al-Masjid Al-Aqsa (17:1).' He (Hudhaifah) said: 'Do you see (this proves that) he (ﷺ) performed Salat in it?' I said: 'No.' He said: 'If he had performed Salat in it, then it would have been required upon you that you perform Salat in it, just as it is required that you perform Salat in Al-Masjid Al-Haram.' Hudhaifah said: 'The Messenger of Allah (ﷺ) was brought a beast with a long back - stretching out like this - one stride of it, is as far as his vision. So, the two of them remained upon the back of Al-Buraq until they saw Paradise and the Fire, and all of what has been prepared for the Hereafter, then they returned back to where they began.' He said: 'They say that he was fettered, but for what? Because he might flee? The Knower of the unseen and the witness subdued him.'\"",
      "chain": [
        "30421",
        "20005",
        "20359",
        "11358",
        "11337"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن سلام، عن عاصم بن أبي النجود، عن أبي وائل، عن رجل، من ربيعة قال قدمت المدينة فدخلت على رسول الله صلى الله عليه وسلم فذكرت عنده وافد عاد فقلت أعوذ بالله أن أكون مثل وافد عاد ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وما وافد عاد ‏\"‏ ‏.‏ قال فقلت على الخبير سقطت إن عادا لما أقحطت بعثت قيلا فنزل على بكر بن معاوية فسقاه الخمر وغنته الجرادتان ثم خرج يريد جبال مهرة فقال اللهم إني لم آتك لمريض فأداويه ولا لأسير فأفاديه فاسق عبدك ما كنت مسقيه واسق معه بكر بن معاوية ‏.‏ يشكر له الخمر الذي سقاه فرفع له سحابات فقيل له اختر إحداهن فاختار السوداء منهن فقيل له خذها رمادا رمددا لا تذر من عاد أحدا وذكر أنه لم يرسل عليهم من الريح إلا قدر هذه الحلقة يعني حلقة الخاتم ‏.‏ ثم قرأ ‏:‏ ‏(‏إذ أرسلنا عليهم الريح العقيم * ما تذر من شيء أتت عليه إلا جعلته كالرميم ‏)‏ الآية ‏.‏ قال أبو عيسى وقد روى غير واحد هذا الحديث عن سلام أبي المنذر عن عاصم بن أبي النجود عن أبي وائل عن الحارث بن حسان ويقال له الحارث بن يزيد ‏.‏",
      "text_en": " Narrated Abu Wa'il:                     from a man of Rabi'ah who said: \"I arrived in Al-Madinah, entered upon the Messenger of Allah (ﷺ) and mentioned the emissary of 'Ad to him. I said: 'I seek refuge in Allah from being like the emissary of 'Ad.' So the Messenger of Allah (ﷺ) said: 'And what of the emissary of 'Ad?'\" He said: \"I said: You have got the one who is informed about it. When 'Ad suffered from famine they sent Qail and he stayed with Bakr bin Mu'awiyah. He gave him wine to drink and two slave girls to sing for him. Then he went out towards the mountains of Murrah and said: \"O Allah! I did not come to You to cure a sick person, nor to ransom a captive! So give water to Your slave as You used to do, and give water to Bakr bin Mu'awiyah along with him.\" He said that out of gratitude for the wine which he gave him to drink. So two clouds appeared and it was said to him: \"Choose one of them.\" So he chose the black one. It was said to him: \"Take it as ashes that will leave none in 'Ad.\" So he mentioned that the wind sent upon them was not more than this circle - meaning the circle of a ring - then he recited: \"...We sent against them the barren wind; it spared nothing that it reached, but blew it into broken spreads of rotten ruins. (51:41 & 42)\"",
      "chain": [
        "30421",
        "20005",
        "20237",
        "11358",
        "11353"
      ]
    },
    {
      "hadith_no": "3585",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا زيد بن حباب، حدثنا سلام بن سليمان النحوي أبو المنذر، حدثنا عاصم بن أبي النجود، عن أبي وائل، عن الحارث بن يزيد البكري، قال قدمت المدينة فدخلت المسجد فإذا هو غاص بالناس وإذا رايات سود تخفق وإذا بلال متقلد السيف بين يدى رسول الله صلى الله عليه وسلم قلت ما شأن الناس قالوا يريد أن يبعث عمرو بن العاص وجها فذكر الحديث بطوله نحوا من حديث سفيان بن عيينة بمعناه ‏.‏ قال ويقال له الحارث بن حسان أيضا ‏.‏",
      "text_en": " Narrated Abu Wa'il:                     that Al-Harith bin Yazid Al-Bakri said: \"I arrived in Al-Madinah and entered the Masjid and found it full with the people and I also noticed a black banner raised high, while Bilal was holding a sword before the Messenger of Allah (ﷺ). I said: 'What is the matter with the people?' They said: 'He intends to send 'Amr bin Al-'As somewhere.'\" So he mentioned the Hadith in its entirety, similar in meaning to the narration of Sufyan bin 'Uyainah (#3273). He said: He is also called Al-Harith bin Hassan.",
      "chain": [
        "30553",
        "20650",
        "11358",
        "11353"
      ]
    },
    {
      "hadith_no": "3674",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبدة بن أبي لبابة، وعاصم، هو ابن بهدلة سمعا زر بن حبيش، وزر بن حبيش يكنى أبا مريم يقول قلت لأبى بن كعب إن أخاك عبد الله بن مسعود يقول من يقم الحول يصب ليلة القدر فقال يغفر الله لأبي عبد الرحمن لقد علم أنها في العشرة الأواخر من رمضان وأنها ليلة سبع وعشرين ولكنه أراد أن لا يتكل الناس ثم حلف لا يستثني أنها ليلة سبع وعشرين ‏.‏ قلت له بأى شيء تقول ذلك يا أبا المنذر قال بالآية التي أخبرنا رسول الله صلى الله عليه وسلم أو بالعلامة أن الشمس تطلع يومئذ لا شعاع لها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا محمد بن العلاء حدثنا أبو بكر بن عياش عن عاصم بن بهدلة قال كان أبو وائل شقيق بن سلمة لا يتكلم ما دام زر بن حبيش جالسا ‏.‏ قال عاصم بن بهدلة وكان زر بن حبيش رجلا فصيحا وكان عبد الله بن مسعود يسأله عن العربية ‏.‏ حدثنا أحمد بن إبراهيم الدورقي حدثنا يزيد بن مهران الكوفي حدثنا أبو بكر بن عياش عن عاصم بن بهدلة قال مر رجل على زر بن حبيش وهو يؤذن فقال يا أبا مريم أتؤذن إني لأرغب بك عن الأذان ‏.‏ فقال زر أترغب عن الأذان والله لا أكلمك أبدا ‏.‏",
      "text_en": " Zirr bin Hubaish [and Zirr bin Hubaish’s Kunyah  is Abu Mariam] said:                     “I said to Ubayy bin Ka’b: ‘Your brother Abdullah bin Mas’ud says: “Whoever stands (in voluntary prayer) the whole year, then he will have reached the Night of Al-Qadr.’” So he said: ‘May Allah forgive Abu Abdur-Rahman. He knows that is during the last ten (nights) of Ramadan, and that it is the night of the twenty-seventh. But he wanted the people to not rely upon that.’ Then he uttered an oath, that without exception it is on the night of the twenty-seventh.” He said: “I said to him: ‘Why is it that you say that O Abu Al-Mindhir?’ He said: “By the sign or indication which the Messenger of Allah informed us of: ‘That the sun rises on that day having no beams with it.’”",
      "chain": [
        "30421",
        "20005",
        "10793",
        "11358",
        "11337",
        "11337"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عاصم بن أبي النجود، عن زر بن حبيش، قال أتيت صفوان بن عسال المرادي أسأله عن المسح، على الخفين فقال ما جاء بك يا زر فقلت ابتغاء العلم فقال إن الملائكة تضع أجنحتها لطالب العلم رضا بما يطلب ‏.‏ قلت إنه حك في صدري المسح على الخفين بعد الغائط والبول وكنت امرأ من أصحاب النبي صلى الله عليه وسلم فجئت أسألك هل سمعته يذكر في ذلك شيئا قال نعم كان يأمرنا إذا كنا سفرا أو مسافرين أن لا ننزع خفافنا ثلاثة أيام ولياليهن إلا من جنابة لكن من غائط وبول ونوم ‏.‏ فقلت هل سمعته يذكر في الهوى شيئا قال نعم كنا مع النبي صلى الله عليه وسلم في سفر فبينا نحن عنده إذ ناداه أعرابي بصوت له جهوري يا محمد ‏.‏ فأجابه رسول الله صلى الله عليه وسلم على نحو من صوته هاؤم وقلنا له ويحك اغضض من صوتك فإنك عند النبي صلى الله عليه وسلم وقد نهيت عن هذا ‏.‏ فقال والله لا أغضض ‏.‏ قال الأعرابي المرء يحب القوم ولما يلحق بهم ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ المرء مع من أحب يوم القيامة ‏\"‏ ‏.‏ فمازال يحدثنا حتى ذكر بابا من قبل المغرب مسيرة عرضه أو يسير الراكب في عرضه أربعين أو سبعين عاما قال سفيان قبل الشام خلقه الله يوم خلق السموات والأرض مفتوحا يعني للتوبة لا يغلق حتى تطلع الشمس منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zirr bin Hubaish said:                     “I came to Safwan bin Assal Al Muradi to ask him about wiping over the Khuff, so he said: ‘What has brought you, I Zirr?’ So I said: ‘The desire for knowledge.’ So he said: ‘Indeed, the angels lower their wings for the seeker of knowledge, out of pleasure with what he is seeking.’ So I said: ‘Indeed there is some doubt in my chest concerning wiping over the Khuff after defecation and urination, and you were a man from the Companions of the Prophet, so I came to you to ask you: Have you heard him (ﷺ) mention anything concerning that?’ He said: ‘Yes, he used to order us, that when we were travelers’  - or - ‘in travel, to not remove our Khuff for three days and nights except, from sexual impurity, but not from defecation, urination, and sleep.’” He said: “Have you heard him mention anything concerning love?” He said: “Yes. We were with the Messenger of Allah on a journey when a Bedouin with a loud voice called upon him (saying): ‘O Muhammad!’ So the Messenger of Allah responded to him with a voice similar to him (saying): ‘Come.’ So we said to him: ‘Lower your voice for you are with the Prophet, and you have been prohibited from this.’ He said: ‘By allah, I will not lower (my voice).’ The Bedouin said: ‘A man is with whomever he loves on the Day of Judgement.” So he did not cease talking with us, until he mentioned a gate in the direction of the west with the width of seventy years journey - or a rider would travel its width - for forty or seventy years.” Sufyan (one of the narrators) said: “In the direction of Ash-Sham, Allah created it the Day He created the heavens and the earth, open - that is, for repentance. It shall not be locked until the sun rises through it.”",
      "chain": [
        "30421",
        "20005",
        "11358",
        "11337"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا إسحاق، قال أنبأنا النضر، قال أنبأنا حماد، عن عاصم بن أبي النجود، عن سواء، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يصوم من كل شهر يوم الخميس ويوم الاثنين ومن الجمعة الثانية يوم الاثنين ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"The Messenger of Allah used to fast Thursday and Monday of each month, and Monday of the following week.\"",
      "chain": [
        "30021",
        "20291",
        "20022",
        "11358",
        "54"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا أبو كامل، قال حدثنا أبو عوانة، عن عاصم بن بهدلة، عن رجل، عن الأسود بن هلال، عن أبي هريرة، قال أمرني رسول الله صلى الله عليه وسلم بركعتى الضحى وأن لا أنام إلا على وتر وصيام ثلاثة أيام من الشهر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah commanded me to pray two Rakahs of Duha, and not to sleep until I had prayed witr, and to fast here days each month.\"",
      "chain": [
        "30559",
        "20469",
        "11358",
        "11620",
        "13"
      ]
    },
    {
      "hadith_no": "2406",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا أبو كامل، قال حدثنا أبو عوانة، عن عاصم بن بهدلة، عن رجل، عن الأسود بن هلال، عن أبي هريرة، قال أمرني رسول الله صلى الله عليه وسلم بركعتى الضحى وأن لا أنام إلا على وتر وصيام ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah commanded me to pray two Rakahs of Duah,nt to sleep until after praying Witr and to fast three days of each month. (Sahih).",
      "chain": [
        "30559",
        "20469",
        "11358",
        "11620",
        "13"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا يحيى بن أبي بكير، حدثنا زائدة بن قدامة، عن عاصم بن أبي النجود، عن زر بن حبيش، عن عبد الله بن مسعود، قال كان أول من أظهر إسلامه سبعة رسول الله  صلى الله عليه وسلم  وأبو بكر وعمار وأمه سمية وصهيب وبلال والمقداد فأما رسول الله  صلى الله عليه وسلم  فمنعه الله بعمه أبي طالب وأما أبو بكر فمنعه الله بقومه وأما سائرهم فأخذهم المشركون وألبسوهم أدراع الحديد وصهروهم في الشمس فما منهم من أحد إلا وقد واتاهم على ما أرادوا إلا بلالا فإنه قد هانت عليه نفسه في الله وهان على قومه فأخذوه فأعطوه الولدان فجعلوا يطوفون به في شعاب مكة وهو يقول أحد أحد ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The first people to declare their Islam publicly were seven: The Messenger of Allah, Abu Bakr, 'Ammar and his mother Sumayyah, Suhaib, Bilal and Miqdad. With regard to the Messenger of Allah, Allah protected him through his paternal uncle Abu Talib. With regard to Abu Bakr, Allah protected him through his people. As for the rest, the idolators seized them and made them wear coats of chain-mail and exposed them to the intense heat of the sun. There was none of them who did not do what they wanted them to do, except for Bilal. He did not care what happened to him for the sake of Allah, and his people did not care what happened to him. Then they gave him to the children who took him around in the streets of Makkah while he was saying, 'Ahad, Ahad (One, One).'\"",
      "chain": [
        "30296",
        "20365",
        "20320",
        "11358",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "218",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا الحارث بن نبهان، حدثنا عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خياركم من تعلم القرآن وعلمه ‏\"‏ ‏.‏ قال وأخذ بيدي فأقعدني مقعدي هذا أقرئ ‏.‏",
      "text_en": " Mus'ab bin Sa'd narrated that his father said:                     \"The Messenger of Allah said: 'The best of you is the one who learns the Qur'an and teaches it.' \" 'Then he (Mus'ab) took me (the narrator) by the hand and made me sit here, and I started to teach Qur'an.'\"",
      "chain": [
        "38091",
        "24061",
        "11358",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا معمر، عن عاصم بن أبي النجود، عن زر بن حبيش، قال أتيت صفوان بن عسال المرادي فقال ما جاء بك قلت أنبط العلم ‏.‏ قال فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من خارج خرج من بيته في طلب العلم إلا وضعت له الملائكة أجنحتها رضا بما يصنع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zirr bin Hubaish said:                     \"I went to Safwan bin 'Assal Al-Muradi and he said: 'What brought you here?' I said: 'I am seeking knowledge.' He said: 'I heard the Messenger of Allah say: \"There is no one who goes out of his house in order to seek knowledge, but the angels lower their wings in approval of his action.'\"",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11358",
        "11337"
      ]
    },
    {
      "hadith_no": "684",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن زر بن حبيش، عن علي بن أبي طالب، أن رسول الله  صلى الله عليه وسلم  قال يوم الخندق ‏\"‏ ملأ الله بيوتهم وقبورهم نارا كما شغلونا عن الصلاة الوسطى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abu Talib that,:                     On the Day of Khandaq, the Messenger of Allah said: \"May Allah fill their houses and graves with fire, just as they distracted us from the middle prayer.\"",
      "chain": [
        "30423",
        "20022",
        "11358",
        "11337",
        "5"
      ]
    },
    {
      "hadith_no": "871",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا الحارث بن نبهان، حدثنا عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يقرأ في صلاة الفجر يوم الجمعة ‏{الم * تنزيل}‏ و ‏{هل أتى على الإنسان}‏",
      "text_en": " It wasnarrated from Mus’ab bin Sa’d that his father said:                      “For theFajr prayer on Fridays, the Messenger of Allah (ﷺ) used to recite‘Alif-Lam-Mim. The revelation...’ [32:1] and ‘Has there notbeen overman...’” [76:1]",
      "chain": [
        "38091",
        "24061",
        "11358",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرحمن بن واقد، ح وحدثنا محمد بن المؤمل بن الصباح، حدثنا بدل بن المحبر، قالا حدثنا عبد الملك بن الوليد، حدثنا عاصم بن بهدلة، عن زر، وأبي، وائل، عن عبد الله بن مسعود، ‏.‏ أن النبي  صلى الله عليه وسلم  كان يقرأ في الركعتين بعد صلاة المغرب ‏{قل يا أيها الكافرون‏}‏ و ‏{قل هو الله أحد }‏ ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that for the two Rak’ahafter Maghrib, the Prophet (ﷺ) used to recite:                      “Say: O youdisbelievers!” [Al-Kafirun (109)] and “Say: He is Allah the One.”[Al-Ikhlas (112)]",
      "chain": [
        "38001",
        "34134",
        "34246",
        "20210",
        "11358",
        "11337"
      ]
    },
    {
      "hadith_no": "1890",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا الحسن بن علي بن عفان، حدثنا يحيى بن آدم، حدثنا أبو بكر بن عياش، عن عاصم بن أبي النجود، عن أبي وائل، عن مسروق، عن معاذ بن جبل، قال بعثني رسول الله  صلى الله عليه وسلم  إلى اليمن وأمرني أن آخذ مما سقت السماء أو سقي بعلا العشر وما سقي بالدوالي نصف العشر ‏.‏ قال يحيى بن آدم البعل والعثري والعذى هو الذي يسقى بماء السماء ‏.‏ والعثري ما يزرع للسحاب وللمطر خاصة ليس يصيبه إلا ماء المطر ‏.‏ والبعل ما كان من الكروم قد ذهبت عروقه في الأرض إلى الماء فلا يحتاج إلى السقى الخمس سنين أو الست يحتمل ترك السقى فهذا البعل ‏.‏ والسيل ماء الوادي إذا سال ‏.‏ والغيل سيل دون سيل ‏.‏",
      "text_en": " It was narrated that:                     Mu'adh bin Jabal said: “The Messenger of Allah (ﷺ) sent me to Yemen and commanded me to take one-tenth of that which was irrigated by deep roots, and to take one half of one-tenth of that which was irrigated by means of buckets.”",
      "chain": [
        "35029",
        "20364",
        "20373",
        "11358",
        "11353",
        "11018",
        "32"
      ]
    },
    {
      "hadith_no": "2670",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا شعيب بن إسحاق، حدثنا سعيد بن أبي عروبة، عن عاصم بن بهدلة، عن ذكوان أبي صالح، عن معاوية بن أبي سفيان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا شربوا الخمر فاجلدوهم ثم إذا شربوا فاجلدوهم ثم إذا شربوا فاجلدوهم ثم إذا شربوا فاقتلوهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu`awiyah bin Abu Sufyan that the Messenger of Allah (ﷺ) said:                     “If they drink (again), then whip them. If they drink (again), then whip them. If they drink (again), then whip them. If they drink (again), then kill them.”",
      "chain": [
        "30288",
        "20239",
        "11073",
        "11358",
        "11161",
        "27"
      ]
    },
    {
      "hadith_no": "3881",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو الحسين، عن حماد بن سلمة، عن عاصم بن أبي النجود، عن شهر بن حوشب، عن أبي ظبية، عن معاذ بن جبل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من عبد بات على طهور ثم تعار من الليل فسأل الله شيئا من أمر الدنيا أو من أمر الآخرة إلا أعطاه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu’adh bin Jabal that the Messenger of Allah (ﷺ) said:                      “There is no person who goes to bed in a state of purity, then wakes up at night, and asks Allah for something in this world or the Hereafter, but it will be given to him.”",
      "chain": [
        "38409",
        "20021",
        "11358",
        "11044",
        "32"
      ]
    },
    {
      "hadith_no": "3920",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى الأشيب، حدثنا حماد بن سلمة، عن عاصم بن بهدلة، عن المسيب بن رافع، عن خرشة بن الحر، قال قدمت المدينة فجلست إلى أشيخة في مسجد النبي  صلى الله عليه وسلم  فجاء شيخ يتوكأ على عصا له فقال القوم من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏.‏ فقام خلف سارية فصلى ركعتين فقمت إليه فقلت له قال بعض القوم كذا وكذا ‏.‏ قال الحمد لله الجنة لله يدخلها من يشاء وإني رأيت على عهد رسول الله  صلى الله عليه وسلم  رؤيا رأيت كأن رجلا أتاني فقال لي انطلق ‏.‏ فذهبت معه فسلك بي في منهج عظيم فعرضت على طريق على يساري فأردت أن أسلكها فقال إنك لست من أهلها ‏.‏ ثم عرضت على طريق عن يميني فسلكتها حتى إذا انتهيت إلى جبل زلق فأخذ بيدي فزجل بي فإذا أنا على ذروته فلم أتقار ولم أتماسك وإذا عمود من حديد في ذروته حلقة من ذهب فأخذ بيدي فزجل بي حتى أخذت بالعروة فقال استمسكت قلت نعم فضرب العمود برجله ‏.‏ فاستمسكت بالعروة ‏.‏ فقال قصصتها على النبي  صلى الله عليه وسلم  ‏.‏ قال ‏\"‏ رأيت خيرا أما المنهج العظيم فالمحشر وأما الطريق التي عرضت عن يسارك فطريق أهل النار ولست من أهلها وأما الطريق التي عرضت عن يمينك فطريق أهل الجنة وأما الجبل الزلق فمنزل الشهداء وأما العروة التي استمسكت بها فعروة الإسلام فاستمسك بها حتى تموت ‏\"‏ ‏.‏ فأنا أرجو أن أكون من أهل الجنة فإذا هو عبد الله بن سلام ‏.‏",
      "text_en": " It wasnarrated that Kharashah bin Hurr said:                      “I came to Al-Madinah andsat with some old men in the mosque of the Prophet (ﷺ). Then an oldman came, leaning on his stick, and the people said: ‘Whoever wouldlike to look at a man from among the people of Paradise, let him lookat this man.’ He stood behind a pillar and prayed two Rak’ah. Igot up and went to him, and said to him: ‘Some of the people saidsuch and such.’ He said: ‘Praise is to Allah. Paradise belongs toAllah and He admits whomsoever He wills to it. At the time of theMessenger of Allah (ﷺ) I saw a dream in which a man came to me andsaid: “Let’s go.” So I went with him and he took me along agreat road. A road was shown to me on the left and I wanted to followit, but he said: “You are not one of its people.” Then a road wasshown to me on the right, and I followed him until I reached aslippery mountain. He took me by the hand and helped me up. When Ireached the top I could not stand firm. There was an iron pillarthere with a golden ring at the top. He took my hand and helped me upuntil I reached the handhold, then he said: “Have you gotten a firmhold?” I said: “Yes.” Then he struck the pillar with his footand I held tight to the pillar. I told this to the Prophet (ﷺ) and he said: \"You have seen something good. The great road is the plain of gathering (on the Day of Resurrection). The road that you were shown on your left is the way of the people of Hell, and you are not one of its people. The road which you were shown on your right is the way of the people of Paradise. The slippery mountain is the place of the martyrs, and the handhold that you held on tight to is the handhold of Islam. Hold on tight to it until you die.\" I hope to be one of the people of Paradise,' and he was 'Abdullah bin Salam.\"",
      "chain": [
        "30201",
        "20383",
        "20021",
        "11358",
        "11394",
        "4026"
      ]
    },
    {
      "hadith_no": "4108",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن أبي عمر العدني، حدثنا عبد الله بن معاذ، عن معمر، عن عاصم بن أبي النجود، عن أبي وائل، عن معاذ بن جبل، قال كنت مع النبي  صلى الله عليه وسلم  في سفر فأصبحت يوما قريبا منه ونحن نسير فقلت يا رسول الله أخبرني بعمل يدخلني الجنة ويباعدني من النار ‏.‏ قال ‏\"‏ لقد سألت عظيما وإنه ليسير على من يسره الله عليه تعبد الله لا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أدلك على أبواب الجنة الصوم جنة والصدقة تطفئ الخطيئة كما يطفئ النار الماء وصلاة الرجل في جوف الليل ‏\"‏ ‏.‏ ثم قرأ ‏{تتجافى جنوبهم عن المضاجع‏}‏ حتى بلغ ‏{جزاء بما كانوا يعملون}‏ ثم قال ‏\"‏ ألا أخبرك برأس الأمر وعموده وذروة سنامه الجهاد ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبرك بملاك ذلك كله ‏\"‏ ‏.‏ قلت بلى ‏.‏ فأخذ بلسانه فقال ‏\"‏ تكف عليك هذا ‏\"‏ ‏.‏ قلت يا نبي الله وإنا لمؤاخذون بما نتكلم به قال ‏\"‏ ثكلتك أمك يا معاذ وهل يكب الناس على وجوههم في النار إلا حصائد ألسنتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu’adh bin Jabal said:                      “I was with theMessengerof Allah (ﷺ) on a journey. One morning I drew close tohim when wewere on the move and said: ‘O Messenger of Allah, tellme of an actionthat will gain me admittance to Paradise and keep mefar away fromHell.’ He said: ‘You have asked for somethinggreat, but it is easyfor the one for whom Allah makes it easy.Worship Allah and do notassociate anything in worship with Him,establish prayer, pay charity,fast Ramadan, and perform Hajj to theHouse.’ Then he said: ‘Shall Inot tell you of the means ofgoodness? Fasting is a shield, andcharity extinguishes sin as waterextinguishes fire, and a man’sprayer in the middle of the night.’Then he recited: “Their sidesforsake their beds” until hereached: “As a reward for what they usedto do.”[32:16-17] Thenhe said: ‘Shall I not tell you of the head ofthe matter, and itspillar and pinnacle? (It is) Jihad.’ Then he said:‘Shall I nottell you of the basis of all that?’ I said: ‘Yes.’ Hetook holdof his tongue then said: ‘Restrain this.’ I said: ‘O ProphetofAllah, will we be brought to account for what we say?’ He said:‘May your mother not found you, O Mu’adh! Are people thrown ontotheirfaces in Hell for anything other than the harvest of theirtongues?’”",
      "chain": [
        "28307",
        "20115",
        "11358",
        "11353",
        "32"
      ]
    }
  ],
  "total_hadiths": 37
}