{
  "id": "11364",
  "name": "'Abdur Rahman bin 'Abd. bin al-Asbahani عبد الرحمن بن عبد الله بن الأصبهاني",
  "full_name": "'Abdur Rahman bin 'Abd. bin al-Asbahani عبد الرحمن بن عبد الله بن الأصبهاني",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Juhni",
      "al-Qasri",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3119",
      "name": "'Abdullah bin Ma'qil al-Mazni ( عبد الله بن معقل بن مقرن ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "20705",
      "name": "Mjahd bin Wrdan al-Madni مجاهد بن وردان المدني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-101",
      "hadith_no": "101",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثني ابن الأصبهاني، قال سمعت أبا صالح، ذكوان يحدث عن أبي سعيد الخدري،‏.‏ قالت النساء للنبي صلى الله عليه وسلم غلبنا عليك الرجال، فاجعل لنا يوما من نفسك‏.‏ فوعدهن يوما لقيهن فيه، فوعظهن وأمرهن، فكان فيما قال لهن ‏\"‏ ما منكن امرأة تقدم ثلاثة من ولدها إلا كان لها حجابا من النار ‏\"‏‏.‏ فقالت امرأة واثنين فقال ‏\"‏ واثنين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some women requested the Prophet to fix a day for them as the men were taking all his time. On that he promised them one day for religious lessons and commandments. Once during such a lesson the Prophet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that a woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire).",
      "usc_msa_ref": "101",
      "chain": [
        "20404",
        "20020",
        "11364",
        "11161"
      ]
    },
    {
      "id": "sahih-bukhari-102",
      "hadith_no": "102",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏ وعن عبد الرحمن بن الأصبهاني، قال سمعت أبا حازم، عن أبي هريرة، قال ‏\"‏ ثلاثة لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the above mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
      "usc_msa_ref": "102",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1249",
      "hadith_no": "1249",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد، رضى الله عنه أن النساء، قلن للنبي صلى الله عليه وسلم اجعل لنا يوما‏.‏ فوعظهن، وقال ‏\"‏ أيما امرأة مات لها ثلاثة من الولد كانوا حجابا من النار ‏\"‏‏.‏ قالت امرأة واثنان‏.‏ قال ‏\"‏ واثنان ‏\"‏‏.‏   وقال شريك عن ابن الأصبهاني، حدثني أبو صالح، عن أبي سعيد، وأبي، هريرة  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال أبو هريرة ‏\"‏ لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The women requested the Prophet, \"Please fix a day for us.\" So the Prophet preached to them and said, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing that, a woman asked, \"If two died?\" The Prophet replied, \"Even two (would screen her from the (Hell) Fire. \" And Abu Huraira added, \"Those children should be below the age of puberty. \"",
      "usc_msa_ref": "341",
      "chain": [
        "20285",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1847",
      "hadith_no": "1847",
      "source": "Sahih Bukhari",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن عبد الله بن معقل، قال جلست إلى كعب بن عجرة  رضى الله عنه  فسألته عن الفدية، فقال نزلت في خاصة، وهى لكم عامة، حملت إلى رسول الله صلى الله عليه وسلم والقمل يتناثر على وجهي فقال ‏\"‏ ما كنت أرى الوجع بلغ بك ما أرى أو ما كنت أرى الجهد بلغ بك ما أرى، تجد شاة ‏\"‏‏.‏ فقلت لا‏.‏ فقال ‏\"‏ فصم ثلاثة أيام، أو أطعم ستة مساكين، لكل مسكين نصف صاع ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ma'qal:                     I sat with Ka`b bin 'Ujra and asked him about the Fidya. He replied, \"This revelation was revealed concerning my case especially, but it is also for you in general. I was carried to Allah's Apostle and the lice were falling in great number on my face. The Prophet said, \"I have never thought that your ailment (or struggle) has reached to such an extent as I see. Can you afford a sheep?\" I replied in the negative. He then said, \"Fast for three days, or feed six poor persons each with half a Sa of food.\" (1 Sa = 3 Kilograms approx.)",
      "usc_msa_ref": "43",
      "chain": [
        "20296",
        "20020",
        "11364",
        "18580"
      ]
    },
    {
      "id": "sahih-bukhari-4054",
      "hadith_no": "4054",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عباد، أخبرنا ابن عيينة، قال أنفذه لنا ابن الأصبهاني سمعه من ابن معقل، أن عليا  رضى الله عنه  كبر على سهل بن حنيف فقال إنه شهد بدرا‏.‏",
      "text_en": " Narrated Ibn Maqal:                     `Ali led the funeral prayer of Sahl bin Hunaif and said, \"He was one of the warriors of Badr.\"",
      "usc_msa_ref": "341",
      "chain": [
        "30377",
        "20005",
        "11364",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-4558",
      "hadith_no": "4558",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، قال سمعت عبد الله بن معقل، قال قعدت إلى كعب بن عجرة في هذا المسجد  يعني مسجد الكوفة  فسألته عن فدية من صيام فقال حملت إلى النبي صلى الله عليه وسلم والقمل يتناثر على وجهي فقال ‏\"‏ ما كنت أرى أن الجهد قد بلغ بك هذا، أما تجد شاة ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ صم ثلاثة أيام، أو أطعم ستة مساكين، لكل مسكين نصف صاع من طعام، واحلق رأسك ‏\"‏‏.‏ فنزلت في خاصة وهى لكم عامة‏.‏",
      "text_en": " Narrated `Abdullah bin Maqal:                     I sat with Ka`b bin Ujra in this mosque, i.e. Kufa Mosque, and asked him about the meaning of: \"Pay a ransom (i.e. Fidya) of either fasting or . . . . (2.196)\" He said, \"I was taken to the Prophet while lice were falling on my face. The Prophet said, 'I did not think that your trouble reached to such an extent. Can you afford to slaughter a sheep (as a ransom for shaving your head)?' I said, 'No.' He said, 'Then fast for three days, or feed six poor persons by giving half a Sa of food for each and shave your head.' So the above Verse was revealed especially for me and generally for all of you.\"",
      "usc_msa_ref": "42",
      "chain": [
        "20404",
        "20020",
        "11364",
        "18580"
      ]
    },
    {
      "id": "sahih-bukhari-7396",
      "hadith_no": "7396",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن عبد الرحمن بن الأصبهاني، عن أبي صالح، ذكوان عن أبي سعيد، جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله ذهب الرجال بحديثك، فاجعل لنا من نفسك، يوما نأتيك فيه تعلمنا مما علمك الله‏.‏ فقال ‏\"‏ اجتمعن في يوم كذا وكذا في مكان كذا وكذا ‏\"‏‏.‏ فاجتمعن فأتاهن رسول الله صلى الله عليه وسلم فعلمهن مما علمه الله ثم قال ‏\"‏ ما منكن امرأة تقدم بين يديها من ولدها ثلاثة، إلا كان لها حجابا من النار ‏\"‏‏.‏ فقالت امرأة منهن يا رسول الله اثنين قال فأعادتها مرتين ثم قال ‏\"‏ واثنين واثنين واثنين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     A woman came to Allah's Apostle and said, \"O Allah's Apostle! Men (only) benefit by your teachings, so please devote to us from (some of) your time, a day on which we may come to you so that you may teach us of what Allah has taught you.\" Allah's Apostle said, \"Gather on such-and-such a day at suchand- such a place.\" They gathered and Allah's Apostle came to them and taught them of what Allah had taught him. He then said, \"No woman among you who has lost her three children (died) but that they will screen her from the Fire.\" A woman among them said, \"O Allah's Apostle! If she lost two children?\" She repeated her question twice, whereupon the Prophet said, \"Even two, even two, even two!\" (See Hadith No. 341, Vol. 2)",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11364",
        "11161"
      ]
    },
    {
      "id": "sahih-muslim-2940",
      "hadith_no": "2940",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن عبد الله بن معقل، قال قعدت إلى كعب - رضى الله عنه - وهو في المسجد فسألته عن هذه الآية ‏{‏ ففدية من صيام أو صدقة أو نسك‏}‏ فقال كعب رضى الله عنه نزلت في كان بي أذى من رأسي فحملت إلى رسول الله صلى الله عليه وسلم والقمل يتناثر على وجهي فقال ‏\"‏ ما كنت أرى أن الجهد بلغ منك ما أرى أتجد شاة ‏\"‏ ‏.‏ فقلت لا فنزلت هذه الآية ‏{‏ ففدية من صيام أو صدقة أو نسك‏}‏ قال صوم ثلاثة أيام أو إطعام ستة مساكين نصف صاع طعاما لكل مسكين - قال - فنزلت في خاصة وهى لكم عامة ‏.‏",
      "text_en": " Abdullah b. Ma'qil said:                      I sat with Ka'b (Allah be pleased with him) and he was in the mosque. I asked him about this verse:\" Compensation in (the form of) fasting, or Sadaqa or sacrifice.\" Ka'b (Allah be pleased with him) said: It was reveal- ed In my case. There was some trouble in my head. I was taken to the Messenger of Allah (may peace be upon him) and lice were creeping upon my face. Thereupon he said: I did not think that your trouble had become so unbearable as I see. Would you be able to afford (the sacrificing) of a goat? I (Ka'b) said: Then this verse was revealed:\" Com- pensation (in the form of) fasting or alms or a sacrifice.\" He (the Holy Prophet) said: (It Implies) fasting for three days, or feeding six needy perscins, half sa' of food for every needy person. This verse was revealed particularly for me and (now) Its applica- tion is general for all of you.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11364",
        "18580"
      ]
    },
    {
      "id": "sahih-muslim-2941",
      "hadith_no": "2941",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن زكرياء بن أبي زائدة، حدثنا عبد الرحمن بن الأصبهاني، حدثني عبد الله بن معقل، حدثني كعب بن عجرة، - رضى الله عنه - أنه خرج مع النبي صلى الله عليه وسلم محرما فقمل رأسه ولحيته فبلغ ذلك النبي صلى الله عليه وسلم فأرسل إليه فدعا الحلاق فحلق رأسه ثم قال له ‏\"‏ هل عندك نسك ‏\"‏ ‏.‏ قال ما أقدر عليه ‏.‏ فأمره أن يصوم ثلاثة أيام أو يطعم ستة مساكين لكل مسكينين صاع فأنزل الله عز وجل فيه خاصة ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه‏}‏ ثم كانت للمسلمين عامة ‏.‏",
      "text_en": " Ka'b b. Ujra (Allah be pleased with him) reported that he went out with the Apostle of Allah (may peace be upon him) in the state of Ihram, and his (Ka'b's) head and beard were infested with lice. This was conveyed to the Apostle of Allah (may peace be upon him). He sent for him (Ka'b) and called a barber (who) shaved his head. He (the Holy Prophet) said. Is there any sacrificial animal with you? He (Kalb) said:                      I cannot afford it. He then commanded him to observe fasts for three days or feed six needy persons, one sa' for every two needy persons. And Allah the Exalted and Majestic revealed this (verse) particular with regard to him:\" So whosoever among you is sick and has an ailment of the head..\" ; then (its application) became general for the Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "11338",
        "11364",
        "18580",
        "4052"
      ]
    },
    {
      "id": "sahih-muslim-6868",
      "hadith_no": "6868",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كامل الجحدري، فضيل بن حسين حدثنا أبو عوانة، عن عبد الرحمن، بن الأصبهاني عن أبي صالح، ذكوان عن أبي سعيد الخدري، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله ذهب الرجال بحديثك فاجعل لنا من نفسك يوما نأتيك فيه تعلمنا مما علمك الله ‏.‏ قال ‏\"‏ اجتمعن يوم كذا وكذا ‏\"‏ ‏.‏ فاجتمعن فأتاهن رسول الله صلى الله عليه وسلم فعلمهن مما علمه الله ثم قال ‏\"‏ ما منكن من امرأة تقدم بين يديها من ولدها ثلاثة إلا كانوا لها حجابا من النار ‏\"‏ ‏.‏ فقالت امرأة واثنين واثنين واثنين فقال رسول الله صلى الله عليه وسلم ‏\"‏ واثنين واثنين واثنين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that a woman came to Allah's Messenger (may peace be upon him) and said:                      Allah's Messenger, men receive your instructions; kindly allocate at your convenience a day for us also, on which we would come to you and you would teach us what Allah has taught you. He said: You assemble on such and such a day. They assembled and Allah's Messenger (may peace be upon him) came to them and taught them what Allah had taught him and he then said: No woman amongst you who sends her three children as her forerunners (in the Hereafter) but they would serve him as a protection against Hell-Fire. A woman said: What about two and two and two? Thereupon Allah's Messenger (may peace be upon him) said: Even if they are two and two and two.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6869",
      "hadith_no": "6869",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد، الله بن معاذ حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، في هذا الإسناد ‏.‏ بمثل معناه وزادا جميعا عن شعبة عن عبد الرحمن بن الأصبهاني قال سمعت أبا حازم يحدث عن أبي هريرة قال ‏\"‏ ثلاثة لم يبلغوا الحنث ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he (the Holy Prophet) said:                      Three (children) who die in childhood.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "20020",
        "20020",
        "11364",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1232",
      "hadith_no": "1232",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبي، حدثنا شريك، عن ابن الأصبهاني، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام بمكة سبع عشرة يصلي ركعتين ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) stayed in Mecca seventeen days and prayed two rak'ahs (at each time of prayer).",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20587",
        "11364",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2902",
      "hadith_no": "2902",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا شعبة، ح وحدثنا عثمان بن أبي شيبة، حدثنا وكيع بن الجراح، عن سفيان، جميعا عن ابن الأصبهاني، عن مجاهد بن وردان، عن عروة، عن عائشة، رضى الله عنها أن مولى، للنبي صلى الله عليه وسلم مات وترك شيئا ولم يدع ولدا ولا حميما فقال النبي صلى الله عليه وسلم ‏\"‏ أعطوا ميراثه رجلا من أهل قريته ‏\"‏ ‏.‏ قال أبو داود وحديث سفيان أتم وقال مسدد قال فقال النبي صلى الله عليه وسلم ‏\"‏ ها هنا أحد من أهل أرضه ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ فأعطوه ميراثه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     A client of the Prophet (ﷺ) died and left some property, but he left no child or relative. The Messenger of Allah (ﷺ) said: Give what he has left to a man belonging to his village.Abu Dawud said: The tradition of Sufyan is more perfect. Musaddad said: Thereupon the Prophet (ﷺ) said: Is there anyone belonging to his land ? They replied: Yes. He said: Then give him what he has left.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20020",
        "30203",
        "20032",
        "20012",
        "11364",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2251",
      "hadith_no": "2251",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا بندار، حدثنا يزيد بن هارون، أخبرنا سفيان، عن عبد الرحمن بن الأصبهاني، عن مجاهد، وهو ابن وردان عن عروة، عن عائشة، أن مولى، للنبي صلى الله عليه وسلم وقع من عذق نخلة فمات فقال النبي صلى الله عليه وسلم ‏\"‏ انظروا هل له من وارث ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فادفعوه إلى بعض أهل القرية ‏\"‏ ‏.‏ وهذا حديث حسن ‏.‏",
      "text_en": " Aishah narrated that a freed slave of the Prophet (s.a.w) fell from foliage on a date-palm and died. So the Prophet (S.A.W) said:                     \"See if he has any heirs.\" They said: \"No.\" He said: 'Pay it to someone among the people of the town.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20472",
        "20012",
        "11364",
        "11028",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2838",
      "hadith_no": "2838",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا سفيان، عن عبد الرحمن بن الأصبهاني، عن مجاهد بن وردان، عن عروة بن الزبير، عن عائشة، أن مولى، للنبي صلى الله عليه وسلم وقع من نخلة فمات وترك مالا ولم يترك ولدا ولا حميما فقال النبي صلى الله عليه وسلم ‏\"‏ أعطوا ميراثه رجلا من أهل قريته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the freed slave of the Prophet(ﷺ)fell from a palm tree and died. He left behind wealth but he hadnochild or close relative. The Prophet (ﷺ) said:                      “Give his legacyto a man from his village.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11364",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3197",
      "hadith_no": "3197",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن الوليد، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن عبد الله بن معقل، قال قعدت إلى كعب بن عجرة في المسجد فسألته عن هذه الآية، ‏{ففدية من صيام أو صدقة أو نسك}‏ ‏.‏ قال كعب في أنزلت كان بي أذى من رأسي فحملت إلى رسول الله  صلى الله عليه وسلم  والقمل يتناثر على وجهي فقال ‏\"‏ ما كنت أرى الجهد بلغ منك ما أرى أتجد شاة ‏\"‏ ‏.‏ قلت لا ‏.‏ قال فنزلت هذه الآية ‏{ففدية من صيام أو صدقة أو نسك}‏ ‏.‏ قال فالصوم ثلاثة أيام والصدقة على ستة مساكين لكل مسكين نصف صاع من طعام والنسك شاة ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Ma’qil said:                      “I sat with Ka’b bin‘Ujrah in the mosque and asked him about this Verse: ‘He must payacompensation of either fasting (three days) or giving charity(feedingsix poor persons) or offering sacrifice (one sheep).’[2:196] Ka’bsaid: it was revealed concerning me. I had troublewith my head, so Iwas carried to the Messenger of Allah (ﷺ), withlice crawling on myface. He said: ‘I did not think that you weresuffering as much as Isee. Do you have a sheep?’ I said: ‘No.’Then this Verse was revealed:“He must pay a Fidyah (ransom) ofeither fasting (three days) orgiving Sadaqah (charity – feedingsix poor persons) or offeringsacrifice (one sheep).” [2:196] Hesaid: ‘Fasting is three days,charity is to be given to six poorpersons, giving each one half of aSa’ of food, and the sacrificeis a sheep.’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30174",
        "20173",
        "20020",
        "11364",
        "18580"
      ]
    }
  ],
  "total_hadiths": 16
}