{
  "id": "11361",
  "name": "'Abdullah bin 'Isa bin 'Abdur Rahman عبد الله بن عيسى بن عبد الرحمن",
  "full_name": "'Abdullah bin 'Isa bin 'Abdur Rahman عبد الله بن عيسى بن عبد الرحمن",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "19878",
      "name": "'Isa bin 'Abdur Rahman bin Abi Layla عيسى بن عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19878",
      "name": "'Isa bin 'Abdur Rahman bin Abi Layla عيسى بن عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "13501",
      "name": "Umayya bin Hind al-Mazni أمية بن هند المزني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18508",
      "name": "'Abdullah bin Abi al-Ja'd عبد الله بن أبي الجعد الأشجعي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10832",
      "name": "Musa bin 'Abdullah موسى بن عبد الله بن يزيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20595",
      "name": "'Ammar bin Razayq عمار بن رزيق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1997",
      "hadith_no": "1997",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، سمعت عبد الله بن عيسى، عن الزهري، عن عروة، عن عائشة،‏.‏ وعن سالم، عن ابن عمر  رضى الله عنهم  قالا لم يرخص في أيام التشريق أن يصمن، إلا لمن لم يجد الهدى‏.‏",
      "text_en": " Narrated `Aisha and Ibn `Umar:                     Nobody was allowed to fast on the days of Tashriq except those who could not afford the Hadi (Sacrifice).",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11361",
        "11013",
        "10511",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3370",
      "hadith_no": "3370",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قيس بن حفص، وموسى بن إسماعيل، قالا حدثنا عبد الواحد بن زياد، حدثنا أبو قرة، مسلم بن سالم الهمداني قال حدثني عبد الله بن عيسى، سمع عبد الرحمن بن أبي ليلى، قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية سمعتها من النبي، صلى الله عليه وسلم فقلت بلى، فأهدها لي‏.‏ فقال سألنا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله كيف الصلاة عليكم أهل البيت فإن الله قد علمنا كيف نسلم‏.‏ قال ‏\"‏ قولوا اللهم صل على محمد، وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Laila:                     Ka`b bin Ujrah met me and said, \"Shall I not give you a present I got from the Prophet?\" `Abdur- Rahman said, \"Yes, give it to me.\" I said, \"We asked Allah's Apostle saying, 'O Allah's Apostle! How should one (ask Allah to) send blessings on you, the members of the family, for Allah has taught us how to salute you (in the prayer)?' He said, 'Say: O Allah! Send Your Mercy on Muhammad and on the family of Muhammad, as You sent Your Mercy on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious. O Allah! Send Your Blessings on Muhammad and the family of Muhammad, as You sent your Blessings on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious.' \"",
      "usc_msa_ref": "",
      "chain": [
        "30158",
        "20040",
        "20256",
        "11653",
        "11361",
        "11196"
      ]
    },
    {
      "id": "sahih-muslim-1913",
      "hadith_no": "1913",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا حسن بن الربيع، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما جبريل قاعد عند النبي صلى الله عليه وسلم سمع نقيضا من فوقه فرفع رأسه فقال هذا باب من السماء فتح اليوم لم يفتح قط إلا اليوم فنزل منه ملك فقال هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم فسلم وقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لن تقرأ بحرف منهما إلا أعطيته ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid reported:                      I met Abu Mas'ud near the House (Ka'ba) and said to him: A hadith has been conveyed to me on your authority about the two (concluding verses of Surah al-Baqara. He said: Yes. The Messenger of Allah (may peace be upon him) (in fact) said: Anyone who recites the two verses at the end of Surah al-Baqara at night, they would suffice for him.",
      "usc_msa_ref": "",
      "chain": [
        "30461",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1942",
      "hadith_no": "1942",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثني إسماعيل بن أبي، خالد حدثني عبد الله بن عيسى، عن عبد الرحمن بن أبي ليلى، أخبرني أبى بن كعب، أنه كان جالسا في المسجد إذ دخل رجل فصلى فقرأ قراءة واقتص الحديث بمثل حديث ابن نمير ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that the Apostle of Allah (may peace be upon him) was near the tank of Banu Ghifar that Gabriel came to him and said:                      Allah has commanded you to recite to your people the Qur'an in one dialect. Upon this he said: I ask from Allah pardon and forgiveness. My people are not capable of doing it. He then came for the second time and said: Allah has commanded you that you should recite the Qur'an to your people in two dialects. Upon this he (the Holy prophet) again said: I seek pardon and forgiveness from Allah, my people would not be able to do so. He (Gabriel) came for the third time and said: Allah has commanded you to recite the Qur'an to your people in three dialects. Upon this he said: I ask pardon and forgiveness from Allah. My people would not be able to do it. He then came to him for the fourth time and said: Allah has commanded you to recite the Qur'an to your people in seven dialects, and in whichever dialect they would recite, they would be right.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11418",
        "11361",
        "11196",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-384",
      "hadith_no": "384",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، وأحمد بن يونس، قالا حدثنا زهير، حدثنا عبد الله بن عيسى، عن موسى بن عبد الله بن يزيد، عن امرأة، من بني عبد الأشهل قالت قلت يا رسول الله إن لنا طريقا إلى المسجد منتنة فكيف نفعل إذا مطرنا قال ‏\"‏ أليس بعدها طريق هي أطيب منها ‏\"‏ ‏.‏ قالت قلت بلى ‏.‏ قال ‏\"‏ فهذه بهذه ‏\"‏ ‏.‏",
      "text_en": " Narrated A woman of the Banu AbdulAshhal:                     She reported: I said Messenger of Allah, our road to the mosque has an unpleasant stench; what should we do when it is raining? He asked: Is there not a cleaner part after the filthy part of the road? She replied: Why not (there is one)! He said: It makes up for the other.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "30184",
        "20321",
        "11361",
        "10832"
      ]
    },
    {
      "id": "sunan-abi-daud-735",
      "hadith_no": "735",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني عتبة، حدثني عبد الله بن عيسى، عن العباس بن سهل الساعدي، عن أبي حميد، بهذا الحديث قال وإذا سجد فرج بين فخذيه غير حامل بطنه على شىء من فخذيه ‏.‏ قال أبو داود رواه ابن المبارك أخبرنا فليح سمعت عباس بن سهل يحدث فلم أحفظه فحدثنيه أراه ذكر عيسى بن عبد الله أنه سمعه من عباس بن سهل قال حضرت أبا حميد الساعدي بهذا الحديث ‏.‏",
      "text_en": " Abu Humaid reported to the same effect. He said:                      When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b. Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b. Sahl and Abu Humaid al-Sa’idi.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11361",
        "1457",
        "30002",
        "20025",
        "20169",
        "11697"
      ]
    },
    {
      "id": "sunan-abi-daud-2175",
      "hadith_no": "2175",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن عكرمة، عن يحيى بن يعمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من خبب امرأة على زوجها أو عبدا على سيده ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Anyone who incites a woman against her husband or a slave against his master is not one of us.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20595",
        "11361",
        "11023",
        "11316",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5170",
      "hadith_no": "5170",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، عن عمار بن رزيق، عن عبد الله بن عيسى، عن عكرمة، عن يحيى بن يعمر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خبب زوجة امرئ أو مملوكه فليس منا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone corrupts (instigates) the wife of a man or his slave (against him), he is not from us.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20650",
        "20595",
        "11361",
        "11023",
        "11316",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-496",
      "hadith_no": "496",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، وأبو جناب يحيى بن أبي حية عن عبد الله بن عيسى، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة وغسل وبكر وابتكر ودنا واستمع وأنصت كان له بكل خطوة يخطوها أجر سنة صيامها وقيامها ‏\"‏ ‏.‏ قال محمود قال وكيع اغتسل هو وغسل امرأته ‏.‏ قال ويروى عن عبد الله بن المبارك أنه قال في هذا الحديث ‏\"‏ من غسل واغتسل ‏\"‏ ‏.‏ يعني غسل رأسه واغتسل ‏.‏ قال وفي الباب عن أبي بكر وعمران بن حصين وسلمان وأبي ذر وأبي سعيد وابن عمر وأبي أيوب ‏.‏ قال أبو عيسى حديث أوس بن أوس حديث حسن ‏.‏ وأبو الأشعث الصنعاني اسمه شراحيل بن آدة ‏.‏ وأبو جناب يحيى بن حبيب القصاب الكوفي ‏.‏",
      "text_en": " Aws bin Aws narrated:                     \"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11361",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "id": "jami-al-tirmidhi-609",
      "hadith_no": "609",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن شريك، عن عبد الله بن عيسى، عن ابن جبر، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يجزئ في الوضوء رطلان من ماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك على هذا اللفظ ‏.‏ وروى شعبة عن عبد الله بن عبد الله بن جبر عن أنس بن مالك أن النبي صلى الله عليه وسلم كان يتوضأ بالمكوك ويغتسل بخمسة مكاكي ‏.‏ وروي عن سفيان الثوري عن عبد الله بن عيسى عن عبد الله بن جبر عن أنس أن النبي صلى الله عليه وسلم كان يتوضأ بالمد ويغتسل بالصاع ‏.‏ وهذا أصح من حديث شريك ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     the Messenger of Allah said: The acceptable Wudu is with two Ratils of water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20587",
        "11361",
        "11185",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1852",
      "hadith_no": "1852",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وأبو نعيم قالا حدثنا سفيان، عن عبد الله بن عيسى، عن رجل، يقال له عطاء من أهل الشام عن أبي أسيد قال قال النبي صلى الله عليه وسلم ‏\"‏ كلوا الزيت وادهنوا به فإنه من شجرة مباركة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه إنما نعرفه من حديث سفيان الثوري عن عبد الله بن عيسى ‏.‏",
      "text_en": " Narrated Abu Asid:                     \"The Prophet (ﷺ) said: Eat of its oil and use it (the olives), for indeed it is from a blessed tree.\"[Abu 'Eisa said:] This Hadith is Gharib from this route. We only know of it from the narration of Sufyan At-Thawri, from 'Abdullah bin 'Eisa.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20348",
        "20012",
        "11361",
        "113"
      ]
    },
    {
      "id": "sunan-an-nasai-912",
      "hadith_no": "912",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا يحيى بن آدم، قال حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما رسول الله صلى الله عليه وسلم وعنده جبريل عليه السلام إذ سمع نقيضا فوقه فرفع جبريل عليه السلام بصره إلى السماء فقال هذا باب قد فتح من السماء ما فتح قط ‏.‏ قال فنزل منه ملك فأتى النبي صلى الله عليه وسلم فقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لم تقرأ حرفا منهما إلا أعطيته ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"When Jibril was with the Messenger of Allah (ﷺ), he heard a sound from above like a door opening. Jibril, peace be upon him, looked up toward the sky and said: 'This is a gate in Heaven that has been opened, but it was never opened before.\" He said: \"An Angel came down from it and came to the Prophet (ﷺ) and said: 'Receive the glad tidings of two lights that have been given to you and were never given to any prophet before you: The Opening of the Book (Al-Fatihah) and the last verses of Surat Al-Baqarah. You will never recite a single letter of them but you will be granted it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30271",
        "20364",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-95",
      "hadith_no": "95",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن عيسى، عن عبد الله بن أبي الجعد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يزيد في العمر إلا البر ولا يرد القدر إلا الدعاء وإن الرجل ليحرم الرزق للخطيئة يعملها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Thawban said:                     \"The Messenger of Allah (ﷺ) said: 'Nothing extends one's life span but righteousness, nothing averts the Divine Decree but supplication, and nothing deprives a man of provision but the sin that he commits.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11361",
        "130"
      ]
    },
    {
      "id": "sunan-ibn-majah-576",
      "hadith_no": "576",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عبد الله بن عيسى، عن موسى بن عبد الله بن يزيد، عن امرأة، من بني عبد الأشهل قالت سألت النبي  صلى الله عليه وسلم  فقلت إن بيني وبين المسجد طريقا قذرة ‏.‏ قال ‏\"‏ فبعدها طريق أنظف منها ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فهذه بهذه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that a woman from (the tribe of) Banu 'Abdul-Ashhal said:                     \"I said to the prophet: 'Between the mosque and I there is a filthy path.' He said: 'After that is there a cleaner path?' I said: 'Yes.' He said: 'This is (a remedy) for that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11361",
        "10832"
      ]
    },
    {
      "id": "sunan-ibn-majah-2157",
      "hadith_no": "2157",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن طريف، وإبراهيم بن سعيد الجوهري، قالا حدثنا عمر بن شبيب المسلي، عن عبد الله بن عيسى، عن عطية، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ طلاق الأمة اثنتان وعدتها حيضتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Urnar that the Messenger of Allah (ﷺ), said:                     \"The divorce of a  slave woman is twice, and her waiting period is two menstrual cycles. \"",
      "usc_msa_ref": "",
      "chain": [
        "30476",
        "30498",
        "25206",
        "11361",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3635",
      "hadith_no": "3635",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا معاوية بن هشام، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن أمية بن هند، عن عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from hisfather,that the Prophet (ﷺ) said:                      “The evil eye is real.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20609",
        "20595",
        "11361",
        "13501",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-4158",
      "hadith_no": "4158",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن عيسى، عن عبد الله بن أبي الجعد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يزيد في العمر إلا البر ولا يرد القدر إلا الدعاء وإن الرجل ليحرم الرزق بالذنب يصيبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Nothing increases one’s life span except righteousness andnothingrepels the Divine decree except supplication, and a man maybedeprived of provision by a sin that he commits.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11361",
        "130"
      ]
    }
  ],
  "total_hadiths": 17
}