{
  "id": "11369",
  "name": "'Abdul Malik bin Mysrh عبد الملك بن ميسرة الزراد",
  "full_name": "'Abdul Malik bin Mysrh عبد الملك بن ميسرة الزراد",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hilali",
      "B.'Amir",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11659",
      "name": "al-Nazal bin Sabra النزال بن سبرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11264",
      "name": "Yusuf bin Mahk يوسف بن ماهك الفارسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10646",
      "name": "'Abdur Rahman bin 'Abdullah bin Sabit عبد الرحمن بن عبد الله بن سابط",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25321",
      "name": "Musa bin Muslim al-Tahan موسى بن مسلم الصغير الطحان أبو عيسى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2410",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، قال عبد الملك بن ميسرة أخبرني قال سمعت النزال، سمعت عبد الله، يقول سمعت رجلا، قرأ آية سمعت من النبي، صلى الله عليه وسلم خلافها، فأخذت بيده، فأتيت به رسول الله صلى الله عليه وسلم فقال ‏\"‏ كلاكما محسن ‏\"‏‏.‏ قال شعبة أظنه قال ‏\"‏ لا تختلفوا فإن من كان قبلكم اختلفوا فهلكوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I heard a man reciting a verse (of the Holy Qur'an) but I had heard the Prophet reciting it differently. So, I caught hold of the man by the hand and took him to Allah's Apostle who said, \"Both of you are right.\" Shu`ba, the sub-narrator said, \"I think he said to them, \"Don't differ, for the nations before you differed and perished (because of their differences). \"",
      "chain": [
        "20296",
        "20020",
        "11369",
        "18"
      ]
    },
    {
      "hadith_no": "2614",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عبد الملك بن ميسرة، قال سمعت زيد بن وهب، عن علي  رضى الله عنه  قال أهدى إلى النبي صلى الله عليه وسلم حلة سيراء فلبستها، فرأيت الغضب في وجهه، فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I cut it into pieces and distributed it among my wives.\"",
      "chain": [
        "20219",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "3476",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الملك بن ميسرة، قال سمعت النزال بن سبرة الهلالي، عن ابن مسعود  رضى الله عنه  قال سمعت رجلا، قرأ، وسمعت النبي صلى الله عليه وسلم يقرأ خلافها فجئت به النبي صلى الله عليه وسلم فأخبرته فعرفت في وجهه الكراهية وقال ‏\"‏ كلاكما محسن، ولا تختلفوا، فإن من كان قبلكم اختلفوا فهلكوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     I heard a person reciting a (Qur'anic) Verse in a certain way, and I had heard the Prophet reciting the same Verse in a different way. So I took him to the Prophet and informed him of that but I noticed the sign of disapproval on his face, and then he said, \"Both of you are correct, so don't differ, for the nations before you differed, so they were destroyed.\"",
      "chain": [
        "20404",
        "20020",
        "11369",
        "11659",
        "16"
      ]
    },
    {
      "hadith_no": "4867",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن ميسرة، قال سمعت طاوسا، عن ابن عباس  رضى الله عنهما ‏.‏ أنه سئل عن قوله ‏{‏إلا المودة في القربى‏}‏ فقال سعيد بن جبير قربى آل محمد صلى الله عليه وسلم فقال ابن عباس عجلت إن النبي صلى الله عليه وسلم لم يكن بطن من قريش إلا كان له فيهم قرابة فقال إلا أن تصلوا ما بيني وبينكم من القرابة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That he was asked (regarding): \"Except to be kind to me for my Kinship with you.' (42.23) Sa`id bin Zubair (who was present then) said, \"It means here (to show what is due for) the relatives of Muhammad.\" On that Ibn `Abbas said: you have hurried in giving the answer! There was no branch of the tribe of Quraish but the Prophet had relatives therein. The Prophet said, \"I do not want anything from (you ) except to be Kind to me for my Kinship with you.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11369",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "5117",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الملك بن ميسرة، عن النزال بن سبرة، عن عبد الله، أنه سمع رجلا، يقرأ آية، سمع النبي صلى الله عليه وسلم خلافها، فأخذت بيده فانطلقت به إلى النبي صلى الله عليه وسلم فقال ‏\"‏ كلاكما محسن فاقرآ  أكبر علمي قال  فإن من كان قبلكم اختلفوا فأهلكهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That he heard a man reciting a Quranic Verse which he had heard the Prophet reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"",
      "chain": [
        "20193",
        "20020",
        "11369",
        "11659",
        "16"
      ]
    },
    {
      "hadith_no": "5420",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عبد الملك بن ميسرة، قال سمعت زيد بن وهب، عن علي  رضى الله عنه  قال آتى إلى النبي صلى الله عليه وسلم حلة سيراء فلبستها، فرأيت الغضب في وجهه فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and distributed it among my women-folk.",
      "chain": [
        "20219",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "5675",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن عبد الملك بن ميسرة، عن النزال، قال أتى علي  رضى الله عنه  على باب الرحبة، فشرب قائما فقال إن ناسا يكره أحدهم أن يشرب وهو قائم، وإني رأيت النبي صلى الله عليه وسلم فعل كما رأيتموني فعلت‏.‏",
      "text_en": " Narrated An-Nazzal:                     All came to the gate of the courtyard (of the Mosque) and drank (water) while he was standing and said, \"Some people dislike to drink while standing, but I saw the Prophet doing (drinking water) as you have seen me doing now.\"",
      "chain": [
        "20348",
        "20359",
        "11369"
      ]
    },
    {
      "hadith_no": "5676",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الملك بن ميسرة، سمعت النزال بن سبرة، يحدث عن علي  رضى الله عنه  أنه صلى الظهر ثم قعد في حوائج الناس في رحبة الكوفة حتى حضرت صلاة العصر، ثم أتي بماء فشرب وغسل وجهه ويديه وذكر رأسه ورجليه، ثم قام فشرب فضله وهو قائم ثم قال إن ناسا يكرهون الشرب قائما وإن النبي صلى الله عليه وسلم صنع مثل ما صنعت‏.‏",
      "text_en": " Narrated An-Nazzal bin Sabra:                     `Ali offered the Zuhr prayer and then sat down in the wide courtyard (of the Mosque) of Kufa in order to deal with the affairs of the people till the `Asr prayer became due. Then water was brought to him and he drank of it, washed his face, hands, head and feet. Then he stood up and drank the remaining water while he was standing. and said, \"Some people dislike to drink water while standing thought the Prophet did as I have just done.\"",
      "chain": [
        "20404",
        "20020",
        "11369",
        "11659",
        "5"
      ]
    },
    {
      "hadith_no": "5901",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، ح وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الملك بن ميسرة، عن زيد بن وهب، عن علي  رضى الله عنه  قال كساني النبي صلى الله عليه وسلم حلة سيراء، فخرجت فيها، فرأيت الغضب في وجهه، فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     The Prophet gave me a silk suit. I went out wearing it, but seeing the signs of anger on his face, I tore it and distributed it among my wives.",
      "chain": [
        "20193",
        "20020",
        "30160",
        "20278",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "5544",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن عبد الملك بن ميسرة، عن زيد بن وهب، عن علي بن أبي طالب، قال كساني رسول الله صلى الله عليه وسلم حلة سيراء فخرجت فيها فرأيت الغضب في وجهه - قال - فشققتها بين نسائي ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported that Allah's Messenger (may peace be upon him) gave me to wear a garment in the form of silk cloak. I went out wearing it, but saw signs of anger on his face, so I tore it and distributed it amongst my women.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "3718",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مسعر بن كدام، عن عبد الملك بن ميسرة، عن النزال بن سبرة، أن عليا، دعا بماء فشربه وهو قائم ثم قال إن رجالا يكره أحدهم أن يفعل هذا وقد رأيت رسول الله صلى الله عليه وسلم يفعل مثل ما رأيتموني أفعله ‏.‏",
      "text_en": " Nazzal b. Samurah said :                      ‘Ali asked for water and he drank it while standing. He then said: some people disapprove of doing this (drinking while standing ), but I saw the Messenger of Allah (ﷺ) doing as I have done.",
      "chain": [
        "30175",
        "20031",
        "20359",
        "11369",
        "11659"
      ]
    },
    {
      "hadith_no": "4059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، - يعني الزبيري - حدثنا مسعر، عن عبد الملك بن ميسرة، عن عمرو بن دينار، عن جابر، قال كنا ننزعه عن الغلمان، ونتركه، على الجواري ‏.‏ قال مسعر فسألت عمرو بن دينار عنه فلم يعرفه ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We used to take it away (i.e. silk) from boys, and leave it for girls. Mis'ar said: I asked Amr ibn Dinar about it, but he did not know it.",
      "chain": [
        "30395",
        "20355",
        "20359",
        "11369",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "3560",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن ميسرة، قال سمعت طاوسا، قال سئل ابن عباس عن هذه الآية ‏:‏ ‏(‏قل لا أسألكم عليه أجرا إلا المودة في القربى ‏)‏ فقال سعيد بن جبير قربى آل محمد صلى الله عليه وسلم ‏.‏ فقال ابن عباس أعلمت أن رسول الله صلى الله عليه وسلم لم يكن بطن من قريش إلا كان له فيهم قرابة فقال إلا أن تصلوا ما بيني وبينكم من القرابة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن ابن عباس ‏.‏",
      "text_en": " Narrated Tawus:                     Ibn 'Abbas was asked about this Ayah: Say: \"No reward do I ask of you for this except to be kind for my kinship with you (42:23).\" So Sa'eed bin Jubair said: 'To be kind to the family of Muhammad.' Ibn 'Abbas replied: 'You know that there was no family of the Quraish except that the Messenger of Allah (ﷺ) had some relatives among them.' He said: 'Except that you should uphold ties of kinship that exist between me and you.'\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11369",
        "11053"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن عبد الملك بن ميسرة، قال سمعت النزال بن سبرة، قال رأيت عليا - رضى الله عنه - صلى الظهر ثم قعد لحوائج الناس فلما حضرت العصر أتي بتور من ماء فأخذ منه كفا فمسح به وجهه وذراعيه ورأسه ورجليه ثم أخذ فضله فشرب قائما وقال إن ناسا يكرهون هذا وقد رأيت رسول الله صلى الله عليه وسلم يفعله وهذا وضوء من لم يحدث ‏.‏",
      "text_en": " An-Nazzal bin Sabrah said:                      \"I saw 'Ali (may Allah be please with him) praying Zuhr, then he sat to tend to the people's needs, and when the time for 'Asr came, a vessel of water was brought to him. He took a handful of it and wiped his face, forearms, head and feet with it, then he took what was left and drank standing up. He said: 'People dislike this, but I saw the Messenger of Allah (ﷺ) doing it. This is the Wudu' of one who has not committed Hadath.\"",
      "chain": [
        "20214",
        "20020",
        "11369",
        "11659"
      ]
    },
    {
      "hadith_no": "4302",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الملك بن ميسرة، عن سعيد بن جبير، عن عدي بن حاتم، قال قلت يا رسول الله أرمي الصيد فأطلب أثره بعد ليلة ‏.‏ قال ‏\"‏ إذا وجدت فيه سهمك ولم يأكل منه سبع فكل ‏\"‏ ‏.‏",
      "text_en": " it was narrated that 'Adiyy bin Hatim said:                     \"I said: 'O Messenger of Allah, I shoot game and I follow its tracks after of night. He said: 'If you find your arrow in it, and no predator has eaten from it, then eat it.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11369",
        "11050",
        "212"
      ]
    },
    {
      "hadith_no": "3091",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن مسعر، عن عبد الملك بن ميسرة، عن طاوس، عن سراقة بن جعشم، قال قام رسول الله  صلى الله عليه وسلم  خطيبا في هذا الوادي فقال ‏\"‏ ألا إن العمرة قد دخلت في الحج إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Suraqah bin Ju’shum said:                      “The Messenger ofAllah(ﷺ) stood up to deliver a speech in this valley, and said:‘Lo!‘Umrah has been included in Hajj until the Day of Resurrection.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20359",
        "11369",
        "11053"
      ]
    }
  ],
  "total_hadiths": 16
}