{
  "id": "11368",
  "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
  "full_name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "33",
      "date_gregorian": "NA",
      "date_display": [
        "33 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ally B.'Adi",
      "al-Lakhmi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "21180",
      "name": "Musa bin 'Abdul Malik bin 'Umayr موسى بن عبد الملك",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "485",
      "name": "Ash'uth bin Qays ( الأشعث بن قيس بن معدي كرب الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4057",
      "name": "Jarir bin 'Abdullah al-Bajli ( جرير بن عبد الله البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5202",
      "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5184",
      "name": "Atyh al-Qrzy Bdm ( عطية القرظي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "71",
      "name": "Umm Atiyyah Ansariyah ( أم عطية الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1294",
      "name": "Umm al-'Ala' al-Ansariyya ( أم العلاء الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1730",
      "name": "Jabir bin 'Atik ( جبر بن عتيك بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4070",
      "name": "Usayd bin Safwan ( أسيد بن صفوان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10801",
      "name": "'Alqama bin Wa'il bin Hjr علقمة بن وائل بن حجر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11302",
      "name": "Qaz'a bin Yahya قزعة بن يحيى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11388",
      "name": "Muhammad bin al-Muntashir bin al-Ajda' محمد بن المنتشر بن الأجدع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10831",
      "name": "al-Mndhr bin Jryr bin Abd المنذر بن جرير بن عبد الله البجلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11402",
      "name": "Wrad al-Thqfy Abu Sa'id وراد الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "21180",
      "name": "Musa bin 'Abdul Malik bin 'Umayr موسى بن عبد الملك",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20588",
      "name": "Suh'aib bin Safwan bin al-Rabi' شعيب بن صفوان بن الربيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20322",
      "name": "Ziyad bin 'Abdullah زياد بن عبد الله بن الطفيل",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20341",
      "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10714",
      "name": "Muhammad bin Shbyb al-Zhrany محمد بن شبيب الزهراني البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "27362",
      "name": "al-Walid bin Abi Thwr Sm' الوليد بن أبي ثور",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20346",
      "name": "'Umar bin 'Ubaid bin Abi Umayya عمر بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-678",
      "hadith_no": "678",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا حسين، عن زائدة، عن عبد الملك بن عمير، قال حدثني أبو بردة، عن أبي موسى، قال مرض النبي صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إنه رجل رقيق، إذا قام مقامك لم يستطع أن يصلي بالناس‏.‏ قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ فعادت فقال ‏\"‏ مري أبا بكر فليصل بالناس، فإنكن صواحب يوسف ‏\"‏‏.‏ فأتاه الرسول فصلى بالناس في حياة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     \"The Prophet became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
      "usc_msa_ref": "646",
      "chain": [
        "30311",
        "11278",
        "20320",
        "11368",
        "1820",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-755",
      "hadith_no": "755",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، قال حدثنا أبو عوانة، قال حدثنا عبد الملك بن عمير، عن جابر بن سمرة، قال شكا أهل الكوفة سعدا إلى عمر  رضى الله عنه  فعزله واستعمل عليهم عمارا، فشكوا حتى ذكروا أنه لا يحسن يصلي، فأرسل إليه فقال يا أبا إسحاق إن هؤلاء يزعمون أنك لا تحسن تصلي قال أبو إسحاق أما أنا والله فإني كنت أصلي بهم صلاة رسول الله صلى الله عليه وسلم ما أخرم عنها، أصلي صلاة العشاء فأركد في الأوليين وأخف في الأخريين‏.‏ قال ذاك الظن بك يا أبا إسحاق‏.‏ فأرسل معه رجلا أو رجالا إلى الكوفة، فسأل عنه أهل الكوفة، ولم يدع مسجدا إلا سأل عنه، ويثنون معروفا، حتى دخل مسجدا لبني عبس، فقام رجل منهم يقال له أسامة بن قتادة يكنى أبا سعدة قال أما إذ نشدتنا فإن سعدا كان لا يسير بالسرية، ولا يقسم بالسوية، ولا يعدل في القضية‏.‏ قال سعد أما والله لأدعون بثلاث، اللهم إن كان عبدك هذا كاذبا، قام رياء وسمعة فأطل عمره، وأطل فقره، وعرضه بالفتن، وكان بعد إذا سئل يقول شيخ كبير مفتون، أصابتني دعوة سعد‏.‏ قال عبد الملك فأنا رأيته بعد قد سقط حاجباه على عينيه من الكبر، وإنه ليتعرض للجواري في الطرق يغمزهن‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     The People of Kufa complained against Sa`d to `Umar and the latter dismissed him and appointed `Ammar as their chief . They lodged many complaints against Sa`d and even they alleged that he did not pray properly. `Umar sent for him and said, \"O Aba 'Is-haq! These people claim that you do not pray properly.\" Abu 'Is-haq said, \"By Allah, I used to pray with them a prayer similar to that of Allah's Apostle and I never reduced anything of it. I used to prolong the first two rak`at of `Isha prayer and shorten the last two rak`at.\" `Umar said, \"O Aba 'Is-haq, this was what I thought about you.\" And then he sent one or more persons with him to Kufa so as to ask the people about him. So they went there and did not leave any mosque without asking about him. All the people praised him till they came to the mosque of the tribe of Bani `Abs; one of the men called Usama bin Qatada with a surname of Aba Sa`da stood up and said, \"As you have put us under an oath; I am bound to tell you that Sa`d never went himself with the army and never distributed (the war booty) equally and never did justice in legal verdicts.\" (On hearing it) Sa`d said, \"I pray to Allah for three things: O Allah! If this slave of yours is a liar and got up for showing off, give him a long life, increase his poverty and put him to trials.\" (And so it happened). Later on when that person was asked how he was, he used to reply that he was an old man in trial as the result of Sa`d's curse. `Abdul Malik, the sub narrator, said that he had seen him afterwards and his eyebrows were overhanging his eyes owing to old age and he used to tease and assault the small girls in the way.",
      "usc_msa_ref": "722",
      "chain": [
        "20040",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-bukhari-758",
      "hadith_no": "758",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن جابر بن سمرة، قال قال سعد كنت أصلي بهم صلاة رسول الله صلى الله عليه وسلم صلاتى العشي لا أخرم عنها، أركد في الأوليين وأحذف في الأخريين‏.‏ فقال عمر  رضى الله عنه  ذلك الظن بك‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Sa`d said, \"I used to pray with them a prayer similar to that of Allah's Apostle (the prayer of Zuhr and `Asr) reducing nothing from them. I used to prolong the first two rak`at and shorten the last two rak`at.\" `Umar said to Sa`d \"This was what we thought about you.\"",
      "usc_msa_ref": "725",
      "chain": [
        "20283",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-bukhari-844",
      "hadith_no": "844",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عبد الملك بن عمير، عن وراد، كاتب المغيرة بن شعبة قال أملى على المغيرة بن شعبة في كتاب إلى معاوية أن النبي صلى الله عليه وسلم كان يقول في دبر كل صلاة مكتوبة ‏\"‏ لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ‏\"‏‏.‏ وقال شعبة عن عبد الملك بهذا، وعن الحكم عن القاسم بن مخيمرة عن وراد بهذا‏.‏ وقال الحسن الجد غنى‏.‏",
      "text_en": " Narrated Warrad:                     (the clerk of Al-Mughira bin Shu`ba) Once Al-Mughira dictated to me in a letter addressed to Muawiya that the Prophet used to say after every compulsory prayer, \"La ilaha illa l-lahu wahdahu la sharika lahu, lahu l-mulku wa lahu l-hamdu, wa huwa `ala kulli shay'in qadir. Allahumma la mani`a lima a`taita, wa la mu`tiya lima mana`ta, wa la yanfa`u dhal-jaddi minka l-jadd. [There is no Deity but Allah, Alone, no Partner to Him. His is the Kingdom and all praise, and Omnipotent is he. O Allah! Nobody can hold back what you gave, nobody can give what You held back, and no struggler's effort can benefit against You].\" And Al-Hasan said, \"Al-jadd' means prosperity [??].\"",
      "usc_msa_ref": "",
      "chain": [
        "30388",
        "20005",
        "11368",
        "11402"
      ]
    },
    {
      "id": "sahih-bukhari-1188",
      "hadith_no": "1188",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني عبد الملك بن عمير، عن قزعة، قال سمعت أبا سعيد  رضى الله عنه  أربعا قال سمعت من النبي، صلى الله عليه وسلم وكان غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة ح‏.‏",
      "text_en": "      Narrated Quza'a:                          I heard Abu Said saying four words. He said, \"I heard the Prophet      (saying the following narrative).\" He had participated in twelve holy      battles with the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11368",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1197",
      "hadith_no": "1197",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عبد الملك، سمعت قزعة، مولى زياد قال سمعت أبا سعيد الخدري  رضى الله عنه  يحدث بأربع عن النبي صلى الله عليه وسلم فأعجبنني وآنقنني قال ‏\"‏ لا تسافر المرأة يومين إلا معها زوجها أو ذو محرم‏.‏ ولا صوم في يومين الفطر والأضحى، ولا صلاة بعد صلاتين بعد الصبح حتى تطلع الشمس، وبعد العصر حتى تغرب، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام ومسجد الأقصى ومسجدي ‏\"‏‏.‏",
      "text_en": " Narrated Qaza'a Maula:                     (freed slave of) Ziyad: I heard Abu Sa`id Al-khudri narrating four things from the Prophet and I appreciated them very much. He said, conveying the words of the Prophet. (1) \"A woman should not go on a two day journey except with her husband or a Dhi-Mahram. (2) No fasting is permissible on two days: `Id-ul-Fitr and `Id-ul-Adha. (3) No prayer after two prayers, i.e. after the Fajr prayer till the sunrises and after the `Asr prayer till the sun sets. (4) Do not prepare yourself for a journey except to three Mosques, i.e. Al-Masjid-AI-Haram, the Mosque of Aqsa (Jerusalem) and my Mosque.\"",
      "usc_msa_ref": "288",
      "chain": [
        "20296",
        "20020",
        "11368",
        "11302",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1895",
      "hadith_no": "1895",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الملك بن عمير، عن قزعة، مولى زياد قال سمعت أبا سعيد  وقد غزا مع النبي صلى الله عليه وسلم ثنتى عشرة  غزوة  قال أربع سمعتهن من رسول الله صلى الله عليه وسلم أو قال يحدثهن عن النبي صلى الله عليه وسلم  فأعجبنني وآنقنني ‏\"‏ أن لا تسافر امرأة مسيرة يومين ليس معها زوجها أو ذو محرم، ولا صوم يومين الفطر والأضحى، ولا صلاة بعد صلاتين بعد العصر حتى تغرب الشمس، وبعد الصبح حتى تطلع الشمس، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام، ومسجدي، ومسجد الأقصى ‏\"‏‏.‏",
      "text_en": " Narrated Qaza'a the slave of Ziyad:                     Abu Sa`id who participated in twelve Ghazawat with the Prophet said, \"I heard four things from Allah's Apostle (or I narrate them from the Prophet ) which won my admiration and appreciation. They are: -1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. -2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. -3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the morning prayer till the sun rises. -4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in Medina), and Masjid-al-Aqsa (in Jerusalem).",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20020",
        "11368",
        "11302"
      ]
    },
    {
      "id": "sahih-bukhari-1995",
      "hadith_no": "1995",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، حدثنا عبد الملك بن عمير، قال سمعت قزعة، قال سمعت أبا سعيد الخدري  رضى الله عنه  وكان غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة قال سمعت أربعا من النبي صلى الله عليه وسلم فأعجبنني قال ‏\"‏ لا تسافر المرأة مسيرة يومين إلا ومعها زوجها أو ذو محرم، ولا صوم في يومين الفطر والأضحى، ولا صلاة بعد الصبح حتى تطلع الشمس، ولا بعد العصر حتى تغرب، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام، ومسجد الأقصى، ومسجدي هذا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     (who fought in twelve Ghazawat in the company of the Prophet). I heard four things from the Prophet and they won my admiration. He said; -1. \"No lady should travel on a journey of two days except with her husband or a Dhi-Mahram; -2. \"No fasting is permissible on the two days of Id-ul-Fitr and `Id-ul-Adha; -3. \"No prayer (may be offered) after the morning compulsory prayer until the sun rises; and no prayer after the `Asr prayer till the sun sets; -4. \"One should travel only for visiting three Masjid (Mosques): Masjid-al-Haram (Mecca), Masjid-al- Aqsa (Jerusalem), and this (my) Mosque (at Medina).",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "20020",
        "11368",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-2391",
      "hadith_no": "2391",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ مات رجل، فقيل له قال كنت أبايع الناس، فأتجوز عن الموسر، وأخفف عن المعسر، فغفر له ‏\"‏‏.‏ قال أبو مسعود سمعته من النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     I heard the Prophet saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your life time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and (used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I heard the same (Hadith) from the Prophet.\"",
      "usc_msa_ref": "576",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-2822",
      "hadith_no": "2822",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك بن عمير، سمعت عمرو بن ميمون الأودي، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المعلم الغلمان الكتابة، ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ منهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وأعوذ بك من عذاب القبر ‏\"‏‏.‏ فحدثت به مصعبا فصدقه‏.‏",
      "text_en": " Narrated `Amr bin Maimun Al-Audi:                     Sa`d used to teach his sons the following words as a teacher teaches his students the skill of writing and used to say that Allah's Apostle used to seek Refuge with Allah from them (i.e. the evils) at the end of every prayer. The words are: 'O Allah! I seek refuge with You from cowardice, and seek refuge with You from being brought back to a bad stage of old life and seek refuge with You from the afflictions of the world, and seek refuge with You from the punishments in the grave.'",
      "usc_msa_ref": "76",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-3121",
      "hadith_no": "3121",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق، سمع جريرا، عن عبد الملك، عن جابر بن سمرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفسي بيده، لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Allah's Apostle said, \"When Khosrau is ruined, there will be no Khosrau after him; and when Caesar is ruined, their will be no Caesar after him. By Him in Whose Hands my life is, you will spend their treasures in Allah's Cause.\"",
      "usc_msa_ref": "350",
      "chain": [
        "30312",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-bukhari-3385",
      "hadith_no": "3385",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الربيع بن يحيى البصري، حدثنا زائدة، عن عبد الملك بن عمير، عن أبي بردة بن أبي موسى، عن أبيه، قال مرض النبي صلى الله عليه وسلم فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فقالت إن أبا بكر رجل‏.‏ فقال مثله فقالت مثله‏.‏ فقال ‏\"‏ مروه فإنكن صواحب يوسف ‏\"‏‏.‏ فأم أبو بكر في حياة رسول الله صلى الله عليه وسلم‏.‏ فقال حسين عن زائدة رجل رقيق‏.‏",
      "text_en": " Narrated Abu Musa:                     When the Prophet fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha said, \"Abu Bakr is a soft-hearted person. The Prophet gave the same order again and she again gave the same reply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of Joseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet.",
      "usc_msa_ref": "599",
      "chain": [
        "30133",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-3450",
      "hadith_no": "3450",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن ربعي بن حراش، قال قال عقبة بن عمرو لحذيفة ألا تحدثنا ما سمعت من رسول الله صلى الله عليه وسلم قال إني سمعته يقول ‏\"‏ إن مع الدجال إذا خرج ماء ونارا، فأما الذي يرى الناس أنها النار فماء بارد، وأما الذي يرى الناس أنه ماء بارد فنار تحرق، فمن أدرك منكم فليقع في الذي يرى أنها نار، فإنه عذب بارد ‏\"‏‏.‏   قال حذيفة وسمعته يقول ‏\"‏ إن رجلا كان فيمن كان قبلكم أتاه الملك ليقبض روحه فقيل له هل عملت من خير قال ما أعلم، قيل له انظر‏.‏ قال ما أعلم شيئا غير أني كنت أبايع الناس في الدنيا وأجازيهم، فأنظر الموسر، وأتجاوز عن المعسر‏.‏ فأدخله الله الجنة ‏\"‏‏.‏   فقال وسمعته يقول ‏\"‏ إن رجلا حضره الموت، فلما يئس من الحياة أوصى أهله إذا أنا مت فاجمعوا لي حطبا كثيرا وأوقدوا فيه نارا حتى إذا أكلت لحمي، وخلصت إلى عظمي، فامتحشت، فخذوها فاطحنوها، ثم انظروا يوما راحا فاذروه في اليم‏.‏ ففعلوا، فجمعه فقال له لم فعلت ذلك قال من خشيتك‏.‏ فغفر الله له ‏\"‏‏.‏ قال عقبة بن عمرو، وأنا سمعته يقول ذاك، وكان نباشا‏.‏",
      "text_en": " Narrated Rabi bin Hirash:                     `Uqba bin `Amr said to Hudhaifa, \"Won't you relate to us of what you have heard from Allah's Apostle ?\" He said, \"I heard him saying, \"When Al-Dajjal appears, he will have fire and water along with him. What the people will consider as cold water, will be fire that will burn (things). So, if anyone of you comes across this, he should fall in the thing which will appear to him as fire, for in reality, it will be fresh cold water.\" Hudhaifa added, \"I also heard him saying, 'From among the people preceding your generation, there was a man whom the angel of death visited to capture his soul. (So his soul was captured) and he was asked if he had done any good deed.' He replied, 'I don't remember any good deed.' He was asked to think it over. He said, 'I do not remember, except that I used to trade with the people in the world and I used to give a respite to the rich and forgive the poor (among my debtors). So Allah made him enter Paradise.\" Hudhaifa further said, \"I also heard him saying, 'Once there was a man on his death-bed, who, losing every hope of surviving said to his family: When I die, gather for me a large heap of wood and make a fire (to burn me). When the fire eats my meat and reaches my bones, and when the bones burn, take and crush them into powder and wait for a windy day to throw it (i.e. the powder) over the sea. They did so, but Allah collected his particles and asked him: Why did you do so? He replied: For fear of You. So Allah forgave him.\" `Uqba bin `Amr said, \"I heard him saying that the Israeli used to dig the grave of the dead (to steal their shrouds).",
      "usc_msa_ref": "659",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "id": "sahih-bukhari-3479",
      "hadith_no": "3479",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن ربعي بن حراش، قال قال عقبة لحذيفة ألا تحدثنا ما سمعت من النبي صلى الله عليه وسلم‏.‏ قال سمعته يقول ‏\"‏ إن رجلا حضره الموت، لما أيس من الحياة، أوصى أهله إذا مت فاجمعوا لي حطبا كثيرا، ثم أوروا نارا حتى إذا أكلت لحمي، وخلصت إلى عظمي، فخذوها فاطحنوها، فذروني في اليم في يوم حار أو راح‏.‏ فجمعه الله، فقال لم فعلت قال خشيتك‏.‏ فغفر له ‏\"‏‏.‏ قال عقبة وأنا سمعته يقول‏.‏ حدثنا موسى حدثنا أبو عوانة حدثنا عبد الملك وقال ‏\"‏ في يوم راح ‏\"‏‏.‏",
      "text_en": " Narrated Rabi` bin Hirash:                     `Uqba said to Hudhaifa, \"Won't you narrate to us what you heard from Allah's Apostle ?\" Hudhaifa said, \"I heard him saying, 'Death approached a man and when he had no hope of surviving, he said to his family, 'When I die, gather for me much wood and build a fire (to burn me),. When the fire has eaten my flesh and reached my bones, take the bones and grind them and scatter the resulting powder in the sea on a hot (or windy) day.' (That was done.) But Allah collected his particles and asked (him), 'Why did you do so?' He replied, 'For fear of You.' So Allah forgave him.\"Narrated `Abdu Malik:As above, saying, \"On a windy day.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "id": "sahih-bukhari-3537",
      "hadith_no": "3537",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثني عبد الملك، عن طاوس، عن ابن عباس  رضى الله عنهما – ‏{‏إلا المودة في القربى‏}‏ قال فقال سعيد بن جبير قربى محمد صلى الله عليه وسلم‏.‏ فقال إن النبي صلى الله عليه وسلم لم يكن بطن من قريش إلا وله فيه قرابة، فنزلت عليه إلا أن تصلوا قرابة بيني وبينكم‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas recited the Qur'anic Verse:--'Except to be kind to me for my kin-ship to you--\" (42.23) Sa`id bin Jubair said, \"(The Verse implies) the kinship of Muhammad.\" Ibn `Abbas said, \"There was not a single house (i.e. sub-tribe) of Quraish but had a kinship to the Prophet and so the above Verse was revealed in this connection, and its interpretation is: 'O Quraish! You should keep good relation between me (i.e. Muhammad) and you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11368",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3555",
      "hadith_no": "3555",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان،‏.‏ حدثني محمد بن بشار، حدثنا ابن مهدي، عن سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال النبي صلى الله عليه وسلم ‏\"‏ أرأيتم إن كان جهينة ومزينة وأسلم وغفار خيرا من بني تميم وبني أسد، ومن بني عبد الله بن غطفان ومن بني عامر بن صعصعة ‏\"‏‏.‏ فقال رجل خابوا وخسروا‏.‏ فقال ‏\"‏ هم خير من بني تميم ومن بني أسد، ومن بني عبد الله بن غطفان، ومن بني عامر بن صعصعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Do you think that the tribes of Juhaina, Muzaina, Aslam and Ghifar are better than the tribes of Bani Tamim, Bani Asad, Bam `Abdullah bin Ghatafan and Bani Amir bin Sasaa?\" A man said, \"They were unsuccessful and losers.\" The Prophet added,\" (Yes), they are better than the tribes of Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa.\"",
      "usc_msa_ref": "718",
      "chain": [
        "20351",
        "30160",
        "20033",
        "20005",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-3662",
      "hadith_no": "3662",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الملك بن عمير، عن جابر بن سمرة، رفعه قال ‏\"‏ إذا هلك كسرى فلا كسرى بعده  وذكر وقال  لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     The Prophet said, \"When Khosrau perishes, there will be no more Khosrau a after him, and when Caesar perishes, there will be no more Caesar after him,\" The Prophet also said, \"You will spend the treasures of both of them in Allah's Cause.\"",
      "usc_msa_ref": "816",
      "chain": [
        "20351",
        "20012",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-bukhari-3889",
      "hadith_no": "3889",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أصدق كلمة قالها الشاعر كلمة لبيد ألا كل شىء ما خلا الله باطل وكاد أمية بن أبي الصلت أن يسلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The most true words said by a poet was the words of Labid.\" He said, Verily, Everything except Allah is perishable and Umaiya bin As-Salt was about to be a Muslim (but he did not embrace Islam).",
      "usc_msa_ref": "181",
      "chain": [
        "20348",
        "20012",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3931",
      "hadith_no": "3931",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثنا عبد الملك، حدثنا عبد الله بن الحارث، حدثنا العباس بن عبد المطلب  رضى الله عنه  قال للنبي صلى الله عليه وسلم ما أغنيت عن عمك فإنه كان يحوطك ويغضب لك‏.‏ قال ‏\"‏ هو في ضحضاح من نار، ولولا أنا لكان في الدرك الأسفل من النار ‏\"‏‏.‏",
      "text_en": " Narrated Al-Abbas bin `Abdul Muttalib:                     That he said to the Prophet \"You have not been of any avail to your uncle (Abu Talib) (though) by Allah, he used to protect you and used to become angry on your behalf.\" The Prophet said, \"He is in a shallow fire, and had It not been for me, he would have been in the bottom of the (Hell) Fire.\"",
      "usc_msa_ref": "222",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11368",
        "912",
        "100"
      ]
    },
    {
      "id": "sahih-bukhari-4385",
      "hadith_no": "4385",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، حدثنا عبد الملك، عن أبي بردة، قال بعث رسول الله صلى الله عليه وسلم أبا موسى ومعاذ بن جبل إلى اليمن، قال وبعث كل واحد منهما على مخلاف قال واليمن مخلافان ثم قال ‏\"‏ يسرا ولا تعسرا، وبشرا ولا تنفرا ‏\"‏‏.‏ فانطلق كل واحد منهما إلى عمله، وكان كل واحد منهما إذا سار في أرضه كان قريبا من صاحبه أحدث به عهدا، فسلم عليه، فسار معاذ في أرضه قريبا من صاحبه أبي موسى، فجاء يسير على بغلته حتى انتهى إليه، وإذا هو جالس، وقد اجتمع إليه الناس، وإذا رجل عنده قد جمعت يداه إلى عنقه فقال له معاذ يا عبد الله بن قيس، أيم هذا قال هذا رجل كفر بعد إسلامه‏.‏ قال لا أنزل حتى يقتل‏.‏ قال إنما جيء به لذلك فانزل‏.‏ قال ما أنزل حتى يقتل فأمر به فقتل ثم نزل فقال يا عبد الله، كيف تقرأ القرآن قال أتفوقه تفوقا‏.‏ قال فكيف تقرأ أنت يا معاذ قال أنام أول الليل فأقوم وقد قضيت جزئي من النوم، فأقرأ ما كتب الله لي، فأحتسب نومتي كما أحتسب قومتي‏.‏",
      "text_en": " Narrated Abu Burda:                     Allah's Apostle sent Abu Musa and Mu`adh bin Jabal to Yemen. He sent each of them to administer a province as Yemen consisted of two provinces. The Prophet said (to them), \"Facilitate things for the people and do not make things difficult for them (Be kind and lenient (both of you) with the people, and do not be hard on them) and give the people good tidings and do not repulse them. So each of them went to carry on his job. So when any one of them toured his province and happened to come near (the border of the province of) his companion, he would visit him and greet him. Once Mu`adh toured that part of his state which was near (the border of the province of) his companion Abu Musa. Mu`adh came riding his mule till he reached Abu Musa and saw him sitting, and the people had gathered around him. Behold! There was a man tied with his hands behind his neck. Mu`adh said to Abu Musa, \"O `Abdullah bin Qais! What is this?\" Abu Musa replied. \"This man has reverted to Heathenism after embracing Islam.\" Mu`adh said, \"I will not dismount till he is killed.\" Abu Musa replied, \"He has been brought for this purpose, so come down.\" Mu`adh said, \"I will not dismount till he is killed.\" So Abu Musa ordered that he be killed, and he was killed. Then Mu`adh dismounted and said, \"O `Abdullah (bin Qais)! How do you recite the Qur'an ?\" Abu Musa said, \"I recite the Qur'an regularly at intervals and piecemeal. How do you recite it O Mu`adh?\" Mu`adh said, \"I sleep in the first part of the night and then get up after having slept for the time devoted for my sleep and then recite as much as Allah has written for me. So I seek Allah's Reward for both my sleep as well as my prayer (at night).",
      "usc_msa_ref": "630",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11901"
      ]
    },
    {
      "id": "sahih-bukhari-4438",
      "hadith_no": "4438",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن عمرو بن حريث، عن عدي بن حاتم، قال أتينا عمر في وفد، فجعل يدعو رجلا رجلا ويسميهم فقلت أما تعرفني يا أمير المؤمنين قال بلى، أسلمت إذ كفروا، وأقبلت إذ أدبروا، ووفيت إذ غدروا، وعرفت إذ أنكروا‏.‏ فقال عدي فلا أبالي إذا‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     We came to `Umar in a delegation (during his rule). He started calling the men one by one, calling each by his name. (As he did not call me early) I said to him. \"Don't you know me, O chief of the Believers?\" He said, \"Yes, you embraced Islam when they (i.e. your people) disbelieved; you have come (to the Truth) when they ran away; you fulfilled your promises when they broke theirs; and you recognized it (i.e. the Truth of Islam) when they denied it.\" On that, `Adi said, \"I therefore don't care.\"",
      "usc_msa_ref": "677",
      "chain": [
        "20040",
        "20469",
        "11368",
        "5202",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-4518",
      "hadith_no": "4518",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك، عن عمرو بن حريث، عن سعيد بن زيد  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن، وماؤها شفاء للعين ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Zaid:                     Allah's Apostle said, \"The Kam'a (i.e. a kind of edible fungus) is like the Manna (in that it is obtained without effort) and its water is a (medicine) cure for eye trouble.\"",
      "usc_msa_ref": "5",
      "chain": [
        "20348",
        "20012",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-4684",
      "hadith_no": "4684",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن وماؤها شفاء العين ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id Ibn Zaid:                     The Prophet said, \"Al-Kam'a is like the Mann (sweet resin or gum) (in that it grows naturally without human care) and its water is a cure for the eye diseases.\"",
      "usc_msa_ref": "163",
      "chain": [
        "20285",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-5770",
      "hadith_no": "5770",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن عبد الملك، سمعت عمرو بن حريث، قال سمعت سعيد بن زيد، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الكمأة من المن، وماؤها شفاء للعين ‏\"‏‏.‏ قال شعبة وأخبرني الحكم بن عتيبة عن الحسن العرني عن عمرو بن حريث عن سعيد بن زيد عن النبي صلى الله عليه وسلم‏.‏ قال شعبة لما حدثني به الحكم لم أنكره من حديث عبد الملك‏.‏",
      "text_en": " Narrated Sa`id bin Zaid:                     I heard the Prophet saying, \"Truffles are like Manna (i.e. they grow naturally without man's care) and their water heals eye diseases.\"",
      "usc_msa_ref": "609",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-bukhari-6217",
      "hadith_no": "6217",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن بشار، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الملك، حدثنا أبو سلمة، عن أبي هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أصدق كلمة قالها الشاعر كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏‏.‏ وكاد أمية بن أبي الصلت أن يسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The most true words said by a poet were the words of Labid. He said, i.e. 'Verily, everything except Allah is perishable and Umaiya bin Abi As-Salt was about to embrace Islam .",
      "usc_msa_ref": "168",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6279",
      "hadith_no": "6279",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن عبد الله بن الحارث بن نوفل، عن عباس بن عبد المطلب، قال يا رسول الله هل نفعت أبا طالب بشىء، فإنه كان يحوطك ويغضب لك قال ‏\"‏ نعم هو في ضحضاح من نار، لولا أنا لكان في الدرك الأسفل من النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Al-Harith bin Naufal:                     `Abbas bin `Abdul Muttalib said, \"O Allah's Apostle! Did you benefit Abu Talib with anything as he used to protect and take care of you, and used to become angry for you?\" The Prophet said, \"Yes, he is in a shallow place of Fire. But for me he would have been in the lowest part of the Fire.\"",
      "usc_msa_ref": "227",
      "chain": [
        "20040",
        "20469",
        "11368",
        "912"
      ]
    },
    {
      "id": "sahih-bukhari-6385",
      "hadith_no": "6385",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الملك، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ باسمك أموت وأحيا ‏\"‏‏.‏ وإذا قام قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet went to bed, he would say: \"Bismika amutu wa ahya.\" and when he got up he would say:\" Al-hamdu li l-lahil-ladhi ahyana ba'da ma amatana wa ilaihin-nushur.\"",
      "usc_msa_ref": "",
      "chain": [
        "20351",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-6387",
      "hadith_no": "6387",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده ثم يقول ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet went to bed at night, he would put his hand under his cheek and then say, \"Allahumma bismika amutu wa ahya,\" and when he got up, he would say, \"Al-Hamdu lil-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi an-nushur.\"",
      "usc_msa_ref": "326",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-6397",
      "hadith_no": "6397",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أراد أن ينام قال ‏\"‏ باسمك اللهم أموت وأحيا ‏\"‏‏.‏ وإذا استيقظ من منامه قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا، وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet intended to go to bed, he would recite: \"Bismika Allahumma amutu wa ahya (With Your name, O Allah, I die and I live).\" And when he woke up from his sleep, he would say: \"Al-hamdu lil-lahil-ladhi ahyana ba'da ma amatana; wa ilaihi an-nushur (All the Praises are for Allah Who has made us alive after He made us die (sleep) and unto Him is the Resurrection). \"",
      "usc_msa_ref": "336",
      "chain": [
        "20348",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-6439",
      "hadith_no": "6439",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الملك، عن مصعب، كان سعد يأمر بخمس ويذكرهن عن النبي صلى الله عليه وسلم أنه كان يأمر بهن ‏\"‏ اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا يعني فتنة الدجال وأعوذ بك من عذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Mus`ab:                     Sa`d used to recommend five (statements) and mentioned that the Prophet I used to recommend it. (It was) \"O Allah! I seek refuge with You from miserliness; and seek refuge with You from cowardice; and seek refuge with You from being sent back to geriatric old age; and I seek refuge with You from the affliction of this world (i.e., the affliction of Ad-Dajjal etc.); and seek refuge with You from the punishment of the grave.\"",
      "usc_msa_ref": "376",
      "chain": [
        "20404",
        "20020",
        "11368",
        "10556"
      ]
    },
    {
      "id": "sahih-bukhari-6444",
      "hadith_no": "6444",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن المثنى، حدثني غندر، حدثنا شعبة، عن عبد الملك بن عمير، عن مصعب بن سعد، عن سعد بن أبي وقاص  رضى الله عنه  كان يأمر بهؤلاء الخمس، ويحدثهن عن النبي صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وأعوذ بك من عذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Mus`ab bin Sa`d:                     Sa`d bin Abi Waqqas used to recommend these five (statements) and say that the Prophet said so (and they are): \"O Allah! I seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to geriatric old age, and seek refuge with You from the afflictions of the world, and seek refuge with You from the punishment of the grave.\"",
      "usc_msa_ref": "381",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-6448",
      "hadith_no": "6448",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الحسين، عن زائدة، عن عبد الملك، عن مصعب، عن أبيه، قال تعوذوا بكلمات كان النبي صلى الله عليه وسلم يتعوذ بهن ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Seek refuge with Allah by saying the words which the Prophet used to say while seeking refuge with Allah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, and seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from the afflictions of the world and from the punishment in the grave.\"",
      "usc_msa_ref": "385",
      "chain": [
        "30123",
        "11278",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-6463",
      "hadith_no": "6463",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا عبيدة بن حميد، عن عبد الملك بن عمير، عن مصعب بن سعد بن أبي وقاص، عن أبيه  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعلمنا هؤلاء الكلمات كما تعلم الكتابة ‏\"‏ اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن نرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     The Prophet used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to (senile) geriatric old age, and seek refuge with You from the affliction of the world and from the punishment in the Hereafter.\"",
      "usc_msa_ref": "399",
      "chain": [
        "30207",
        "20341",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-6568",
      "hadith_no": "6568",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أصدق بيت قاله الشاعر ألا كل شىء ما خلا الله باطل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The truest poetic verse ever said by a poet, is: Indeed! Everything except Allah, is perishable.\"",
      "usc_msa_ref": "496",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6652",
      "hadith_no": "6652",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن عبد الملك، عن عبد الله بن الحارث بن نوفل، عن العباس  رضى الله عنه  أنه قال للنبي صلى الله عليه وسلم هل نفعت أبا طالب بشىء‏.‏",
      "text_en": " Narrated `Abbas:                     that he said to the Prophet \"Did you benefit Abu Talib with anything?\"",
      "usc_msa_ref": "576",
      "chain": [
        "30175",
        "20469",
        "11368",
        "912",
        "100"
      ]
    },
    {
      "id": "sahih-bukhari-6669",
      "hadith_no": "6669",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبدان، أخبرني أبي، عن شعبة، عن عبد الملك، قال سمعت جندبا، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أنا فرطكم، على الحوض ‏\"‏‏.‏",
      "text_en": " Narrated Jundab:                     I heard the Prophet, saying, \"I am your predecessor at the Lake-Fount. (Al-Kauthar) .",
      "usc_msa_ref": "589",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11368",
        "4053"
      ]
    },
    {
      "id": "sahih-bukhari-6711",
      "hadith_no": "6711",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، عن عبد الملك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا هلك قيصر فلا قيصر بعده، وإذا هلك كسرى فلا كسرى بعده، والذي نفسي بيده لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     The Prophet said, \"If Caesar is ruined, there will be no Caesar after him; and if Khosrau is ruined, there will be no Khosrau, after him; and, by Him in Whose Hand my soul is, surely you will spend their treasures in Allah's Cause.\"",
      "usc_msa_ref": "625",
      "chain": [
        "20040",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-bukhari-6931",
      "hadith_no": "6931",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، حدثنا عبد الملك، عن وراد، كاتب المغيرة عن المغيرة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح‏.‏ فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ أتعجبون من غيرة سعد، لأنا أغير منه، والله أغير مني ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Sa`d bin Ubada said, \"If I found a man with my wife, I would kill him with the sharp side of my sword.\" When the Prophet heard that he said, \"Do you wonder at Sa`d's sense of ghira (self-respect)? Verily, I have more sense of ghira than Sa`d, and Allah has more sense of ghira than I.\"",
      "usc_msa_ref": "829",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-7217",
      "hadith_no": "7217",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبدان، أخبرني أبي، عن شعبة، عن عبد الملك، عن ربعي، عن حذيفة، عن النبي صلى الله عليه وسلم قال في الدجال ‏\"‏ إن معه ماء ونارا، فناره ماء بارد، وماؤه نار ‏\"‏‏.‏ قال أبو مسعود أنا سمعته من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said about Ad-Dajjal that he would have water and fire with him: (what would seem to be) fire, would be cold water and (what would seem to be) water, would be fire.",
      "usc_msa_ref": "244",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-7246",
      "hadith_no": "7246",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد الملك بن عمير، سمعت عبد الرحمن بن أبي بكرة، قال كتب أبو بكرة إلى ابنه وكان بسجستان بأن لا تقضي بين اثنين وأنت غضبان، فإني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يقضين حكم بين اثنين وهو غضبان ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Bakra:                     Abu Bakra wrote to his son who was in Sijistan: 'Do not judge between two persons when you are angry, for I heard the Prophet saying, \"A judge should not judge between two persons while he is in an angry mood.\"",
      "usc_msa_ref": "272",
      "chain": [
        "20404",
        "20020",
        "11368",
        "11294"
      ]
    },
    {
      "id": "sahih-bukhari-7308",
      "hadith_no": "7308",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثني محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن عبد الملك، سمعت جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يكون اثنا عشر أميرا  فقال كلمة لم أسمعها فقال أبي إنه قال  كلهم من قريش ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     I heard the Prophet saying, \"There will be twelve Muslim rulers (who will rule all the Islamic world).\" He then said a sentence which I did not hear. My father said, \"All of them (those rulers) will be from Quraish.\"",
      "usc_msa_ref": "329",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-bukhari-7378",
      "hadith_no": "7378",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، حدثنا عبد الملك، عن وراد، كاتب المغيرة قال كتب معاوية إلى المغيرة اكتب إلى ما سمعت من رسول الله صلى الله عليه وسلم‏.‏ فكتب إليه إن نبي الله صلى الله عليه وسلم كان يقول في دبر كل صلاة ‏\"‏ لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد، وهو على كل شىء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ‏\"‏‏.‏ وكتب إليه إنه كان ينهى عن قيل وقال، وكثرة السؤال، وإضاعة المال، وكان ينهى عن عقوق الأمهات ووأد البنات ومنع وهات‏.‏",
      "text_en": " Narrated Warrad:                     (The clerk of Al-Mughira) Muawiya wrote to Al-Mughira 'Write to me what you have heard from Allah's Apostle.' So he (Al-Mughira) wrote to him: Allah's Prophet used to say at the end of each prayer: \"La ilaha illalla-h wahdahu la sharika lahu, lahul Mulku, wa lahul Hamdu wa hula ala kulli shai'in qadir. 'Allahumma la mani' a lima a'taita, wala mu'tiya lima mana'ta, wala yanfa'u dhuljadd minkal-jadd.\" He also wrote to him that the Prophet used to forbid (1) Qil and Qal (idle useless talk or that you talk too much about others), (2) Asking too many questions (in disputed Religious matters); (3) And wasting one's wealth by extravagance; (4) and to be undutiful to one's mother (5) and to bury the daughters alive (6) and to prevent your favors (benevolence to others (i.e. not to pay the rights of others (7) And asking others for something (except when it is unavoidable).",
      "usc_msa_ref": "395",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11402"
      ]
    },
    {
      "id": "sahih-bukhari-7483",
      "hadith_no": "7483",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏‏.‏ وإذا أصبح قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Juhaifa:                     When the Prophet went to bed, he used to say, \"Allhumma bismika ahya wa amut.\" And when he got Up in the mornings he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana wa ilaihi-nnushur.\"",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-bukhari-7505",
      "hadith_no": "7505",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن وراد، كاتب المغيرة عن المغيرة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ تعجبون من غيرة سعد، والله لأنا أغير منه، والله أغير مني، ومن أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن، ولا أحد أحب إليه العذر من الله، ومن أجل ذلك بعث المبشرين والمنذرين ولا أحد أحب إليه المدحة من الله ومن أجل ذلك وعد الله الجنة ‏\"‏‏.‏ وقال عبيد الله بن عمرو عن عبد الملك ‏\"‏ لا شخص أغير من الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Sa`d bin 'Ubada said, \"If I saw a man with my wife, I would strike him (behead him) with the blade of my sword.\" This news reached Allah's Apostle who then said, \"You people are astonished at Sa`d's Ghira. By Allah, I have more Ghira than he, and Allah has more Ghira than I, and because of Allah's Ghira, He has made unlawful Shameful deeds and sins (illegal sexual intercourse etc.) done in open and in secret. And there is none who likes that the people should repent to Him and beg His pardon than Allah, and for this reason He sent the warners and the givers of good news. And there is none who likes to be praised more than Allah does, and for this reason, Allah promised to grant Paradise (to the doers of good).\" `Abdul Malik said, \"No person has more Ghira than Allah.\"",
      "usc_msa_ref": "512",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-302",
      "hadith_no": "302",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا عبد الصمد، أخبرنا شعبة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن أبي موسى، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ غير أن في حديث عياض الأشعري قال ‏\"‏ ليس منا ‏\"‏ ‏.‏ ولم يقل ‏\"‏ بريء ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20250",
        "20020",
        "11368",
        "11334",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-376",
      "hadith_no": "376",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي الوليد، قال زهير حدثنا هشام بن عبد الملك، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن علقمة بن وائل، عن وائل بن حجر، قال كنت عند رسول الله صلى الله عليه وسلم فأتاه رجلان يختصمان في أرض فقال أحدهما إن هذا انتزى على أرضي يا رسول الله في الجاهلية - وهو امرؤ القيس بن عابس الكندي وخصمه ربيعة بن عبدان - قال ‏\"‏ بينتك ‏\"‏ ‏.‏ قال ليس لي بينة ‏.‏ قال ‏\"‏ يمينه ‏\"‏ ‏.‏ قال إذا يذهب بها ‏.‏ قال ‏\"‏ ليس لك إلا ذاك ‏\"‏ ‏.‏ قال فلما قام ليحلف قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتطع أرضا ظالما لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ قال إسحاق في روايته ربيعة بن عيدان ‏.‏",
      "text_en": " Wa'il reported it on the authority of his father Hujr:                      I was with the Messenger of Allah (may peace be upon him) that two men came there disputing over a piece of land. One of them said: Messenger of Allah, this man appropriated my land without justification in the days of ignorance. The (claimant) was Imru'l-Qais b. 'Abis al-Kindi and his opponent was Rabi'a b. 'Iban He (the Holy Prophet) said (to the claimant): Have you evidence (to substantiate your claim)? He replied: I have no evidence. Upon this he (the Messenger of Allah) remarked: Then his (that is of the defendant) is the oath. He (the claimant) said: In this case he (the defendant) would appropriate this (the property). He (the Holy Prophet) said: There is than no other way left for you but this. He (the narrator) said: When he (the defendant) stood up to take oath, the Messenger of Allah (may peace be upon him) said: He who appropriated the land wrongfully would meet Allah in a state that He would be angry with him. Ishaq in his narration mentions Rabi'a b. 'Aidan (instead of Rabi'a b. 'Ibdan).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30123",
        "20321",
        "20469",
        "11368",
        "10801",
        "3045"
      ]
    },
    {
      "id": "sahih-muslim-453",
      "hadith_no": "453",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبد الملك، عن عطاء، عن أبي هريرة، ‏{‏ ولقد رآه نزلة أخرى‏}‏ قال رأى جبريل ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the (words of Allah):                     \" And certainly he saw him in another descent\" (al-Qur'an, Iiii. 13) imply that he saw Gabriel.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11368",
        "11029"
      ]
    },
    {
      "id": "sahih-muslim-454",
      "hadith_no": "454",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، عن عبد الملك، عن عطاء، عن ابن عباس، قال رآه بقلبه ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that he (the Holy Prophet) saw (Allah) with, his heart.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11368",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-522",
      "hadith_no": "522",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وزهير بن حرب، قالا حدثنا جرير، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال لما أنزلت هذه الآية ‏{‏ وأنذر عشيرتك الأقربين‏}‏ دعا رسول الله صلى الله عليه وسلم قريشا فاجتمعوا فعم وخص فقال ‏\"‏ يا بني كعب بن لؤى أنقذوا أنفسكم من النار يا بني مرة بن كعب أنقذوا أنفسكم من النار يا بني عبد شمس أنقذوا أنفسكم من النار يا بني عبد مناف أنقذوا أنفسكم من النار يا بني هاشم أنقذوا أنفسكم من النار يا بني عبد المطلب أنقذوا أنفسكم من النار يا فاطمة أنقذي نفسك من النار فإني لا أملك لكم من الله شيئا غير أن لكم رحما سأبلها ببلالها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      When this verse was revealed:\" And warn thy nearest kindred (al-Qur'an, xxvi. 214), the Messenger of Allah (may peace be upon him) called the Quraish; so they gathered and he gave them a general warning. Then he made a particular (reference to certain tribes) and said: O sons of Ka'b b. Luwayy, rescue yourselves from the Fire; O sons of Murra b. Ka'b, rescue yourselves from the Fire: O sons of Abd Shams, rescue yourselves from the Fire; 0 sons of Abd Manaf rescue yourselves from the Fire; O sons of Hashim, rescue yourselves from the Fire; 0 sons of Abd al-Muttalib, rescue yourselves from the Fire; O Fatimah, rescue thyself from the Fire, for I have no power (to protect you) from Allah in anything except this that I would sustain relationship with you.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30022",
        "20028",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-531",
      "hadith_no": "531",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، ومحمد بن أبي بكر المقدمي، ومحمد بن عبد الملك الأموي، قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الله بن الحارث بن نوفل، عن العباس بن عبد المطلب، أنه قال يا رسول الله هل نفعت أبا طالب بشىء فإنه كان يحوطك ويغضب لك قال ‏\"‏ نعم هو في ضحضاح من نار ولولا أنا لكان في الدرك الأسفل من النار ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Abbas b. Abd al-Muttalib that he said:                      Messenger of Allah, have you benefited Abu Talib in any way for he defended you and was fervent in your defence? The Messenger of Allah (may peace he upon him) said: Yes; he would be in the most shallow part of the Fire: and but for me he would have been in the lowest part of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30161",
        "20469",
        "11368",
        "912",
        "100"
      ]
    },
    {
      "id": "sahih-muslim-532",
      "hadith_no": "532",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الله بن الحارث، قال سمعت العباس، يقول قلت يا رسول الله إن أبا طالب كان يحوطك وينصرك فهل نفعه ذلك قال ‏\"‏ نعم وجدته في غمرات من النار فأخرجته إلى ضحضاح ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. al-Harith reported:                      I heard Abbas say: I said: Messenger of Allah, verily Abu Talib defended you and helped you; would it be beneficial for him? He (the Holy Prophet) said: Yes; I found him in the lowest part of the Fire and I brought him to the shallow part.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11368",
        "912",
        "100"
      ]
    },
    {
      "id": "sahih-muslim-533",
      "hadith_no": "533",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه محمد بن حاتم، حدثنا يحيى بن سعيد، عن سفيان، قال حدثني عبد الملك بن عمير، قال حدثني عبد الله بن الحارث، قال أخبرني العباس بن عبد المطلب، ح",
      "text_en": " This hadith is narrated from the Apostle (may peace be upon him) like one narrated by Abu 'Uwana on the authority of the chain of transmitters like Muhammad b. Hatim, Yahya b. Sa'id, Abu Sufyan, 'Abbas b. 'Abd al-Muttalib and others.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "20012",
        "11368",
        "912"
      ]
    },
    {
      "id": "sahih-muslim-420-2",
      "hadith_no": "420",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن أبي بردة، عن أبي موسى، قال مرض رسول الله صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة يا رسول الله إن أبا بكر رجل رقيق متى يقم مقامك لا يستطع أن يصلي بالناس فقال ‏\"‏ مري أبا بكر فليصل بالناس فإنكن صواحب يوسف ‏\"‏ ‏.‏ قال فصلى بهم أبو بكر حياة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      When the Messenger of Allah (may peace be upon him) became ill and illness became serious he ordered Abu Bakr to lead the people in prayer. Upon this 'A'isha said: Messenger of Allah, Abd Bakr is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr led the prayer (during this period of illness) in the life of the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-453-2",
      "hadith_no": "453",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن عبد الملك بن عمير، عن جابر بن سمرة، أن أهل الكوفة، شكوا سعدا إلى عمر بن الخطاب فذكروا من صلاته فأرسل إليه عمر فقدم عليه فذكر له ما عابوه به من أمر الصلاة فقال إني لأصلي بهم صلاة رسول الله صلى الله عليه وسلم ما أخرم عنها إني لأركد بهم في الأوليين وأحذف في الأخريين ‏.‏ فقال ذاك الظن بك أبا إسحاق ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The people of Kufa complained to Umar b. Khattab about Sa'id and they made a mention of his prayer. 'Umar sent for him. He came to him. He ('Umar) totd him that the people had found fault with his prayer. He said: I lead them in prayer in accorance with the prayer of the Messenger of Allah (may peace be upon him). I make no decrease in it. I make them stand for a longer time in the first two (rak'ahs) and shorten it in the last two. Upon this 'Umar remarked: This is what I deemed of thee, O Abu Ishaq",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-453-5",
      "hadith_no": "453",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو كريب، حدثنا ابن بشر، عن مسعر، عن عبد الملك، وأبي، عون عن جابر بن سمرة، بمعنى حديثهم وزاد فقال تعلمني الأعراب بالصلاة",
      "text_en": " This hadith is narrated by Jabir b. Samura but with the addition of these words:                     \" (Sa'd said): These bedouins presume to teach me prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20359",
        "11368",
        "11649"
      ]
    },
    {
      "id": "sahih-muslim-1370",
      "hadith_no": "1370",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن أبي عمر المكي، حدثنا سفيان، حدثنا عبدة بن أبي لبابة، وعبد الملك بن عمير، سمعا ورادا، كاتب المغيرة بن شعبة يقول كتب معاوية إلى المغيرة اكتب إلى بشىء سمعته من رسول الله صلى الله عليه وسلم ‏.‏ قال فكتب إليه سمعت رسول الله صلى الله عليه وسلم يقول إذا قضى الصلاة ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Warrad, the scribe of Mughira b. Shu'ba, reported:                      Mu'awiya wrote to Mughira: Write to me anything which you heard from the Messenger of Allah (may peace be upon him). So he (Mughira) wrote to him (Mu'awiya): I heard the Messenger of Allah (may peace be upon him) uttering (these words) at the completion of prayer:\" There is no god but Allah. He is alone and there is no partner with Him. Sovereignty belongs to Him and to Him is praise due and He is Potent over everything. O Allah! no one can withhold what Thou givest, or give what Thou withholdest, and riches cannot avail a wealthy person with Thee.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "10793",
        "11368"
      ]
    },
    {
      "id": "sahih-muslim-1469",
      "hadith_no": "1469",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا شيبان، عن عبد الملك بن عمير، عن ابن عمارة بن رؤيبة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار من صلى قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ وعنده رجل من أهل البصرة فقال آنت سمعت هذا من النبي صلى الله عليه وسلم قال نعم أشهد به عليه ‏.‏ قال وأنا أشهد لقد سمعت النبي صلى الله عليه وسلم يقوله بالمكان الذي سمعته منه ‏.‏",
      "text_en": " Umara b. Ruwaiba reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      He who said prayer before the rising of the sun and its setting would not enter the fire (of Hell), and there was a man from Basra (sitting) beside him who said: Did you hear it from the Apostle of Allah (way peace be upon him)? He said: Yes, I bear witness to it. The man from Basra said: I bear witness that I did hear from the Apostle of Allah (may peace be upon him) saying it from the place that you heard from him.",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "20365",
        "20240",
        "11368"
      ]
    },
    {
      "id": "sahih-muslim-1519",
      "hadith_no": "1519",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا زكرياء بن أبي زائدة، حدثنا عبد الملك بن عمير، عن أبي الأحوص، قال قال عبد الله لقد رأيتنا وما يتخلف عن الصلاة إلا منافق قد علم نفاقه أو مريض إن كان المريض ليمشي بين رجلين حتى يأتي الصلاة - وقال - إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى وإن من سنن الهدى الصلاة في المسجد الذي يؤذن فيه ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      I have seen the time when no one stayed away from prayer except a hypocrite, whose hypocrisy was well known, or a sick man, but it a sick man could walk between two persons (i. e. with the help of two persons with one on each side) he would come to prayer. And (further) said: The Messenger of Allah (may peace be upon him) taught us the paths of right guidance. among which is prayer in the mosque in which the Adzan is called.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11338",
        "11368",
        "20327"
      ]
    },
    {
      "id": "sahih-muslim-1838",
      "hadith_no": "1838",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن ابن عباس، قال بت عند خالتي ميمونة ‏.‏ نحو حديث ابن جريج وقيس بن سعد ‏.‏",
      "text_en": " Abu Jamra reported:                      I heard Ibn 'Abbas saying that the Messenger of Allah (may peace be upon him) observed thirteen rak'ahs at night.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11368",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2140",
      "hadith_no": "2140",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا محمد بن عبد، الله بن نمير - وتقاربا في اللفظ - قال حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن جابر، قال انكسفت الشمس في عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم ابن رسول الله صلى الله عليه وسلم فقال الناس إنما انكسفت لموت إبراهيم ‏.‏ فقام النبي صلى الله عليه وسلم فصلى بالناس ست ركعات بأربع سجدات بدأ فكبر ثم قرأ فأطال القراءة ثم ركع نحوا مما قام ثم رفع رأسه من الركوع فقرأ قراءة دون القراءة الأولى ثم ركع نحوا مما قام ثم رفع رأسه من الركوع فقرأ قراءة دون القراءة الثانية ثم ركع نحوا مما قام ثم رفع رأسه من الركوع ثم انحدر بالسجود فسجد سجدتين ثم قام فركع أيضا ثلاث ركعات ليس فيها ركعة إلا التي قبلها أطول من التي بعدها وركوعه نحوا من سجوده ثم تأخر وتأخرت الصفوف خلفه حتى انتهينا - وقال أبو بكر حتى انتهى إلى النساء - ثم تقدم وتقدم الناس معه حتى قام في مقامه فانصرف حين انصرف وقد آضت الشمس فقال ‏\"‏ يا أيها الناس إنما الشمس والقمر آيتان من آيات الله وإنهما لا ينكسفان لموت أحد من الناس - وقال أبو بكر لموت بشر - فإذا رأيتم شيئا من ذلك فصلوا حتى تنجلي ما من شىء توعدونه إلا قد رأيته في صلاتي هذه لقد جيء بالنار وذلكم حين رأيتموني تأخرت مخافة أن يصيبني من لفحها وحتى رأيت فيها صاحب المحجن يجر قصبه في النار كان يسرق الحاج بمحجنه فإن فطن له قال إنما تعلق بمحجني ‏.‏ وإن غفل عنه ذهب به وحتى رأيت فيها صاحبة الهرة التي ربطتها فلم تطعمها ولم تدعها تأكل من خشاش الأرض حتى ماتت جوعا ثم جيء بالجنة وذلكم حين رأيتموني تقدمت حتى قمت في مقامي ولقد مددت يدي وأنا أريد أن أتناول من ثمرها لتنظروا إليه ثم بدا لي أن لا أفعل فما من شىء توعدونه إلا قد رأيته في صلاتي هذه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that the sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him) on that very day when Ibrahim (the Prophet's son) died. The Apostle of Allah (may peace be upon him) stood up and led people in (two rak'ahs of) prayer with six ruku's and four prostrations. He commenced (the prayer) with takbir (Allah-o-Akbar) and then recited and prolonged his recital. He then bowed nearly the (length of time) that he stood up. He then raised his head from the ruku' and recited but less than the first recital. He then bowed (to the length of time) that he stood up. He then raised his head from the ruku' and again recited but less than the second recital. He then bowed (to the length of time) that he stood up. He then lifted his head from the ruku'. He then fell in prostration and observed two prostrations. He stood up and then bowed, observing six ruku's like it, without (completing) the rak'ah in them, except (this difference) that the first (qiyam of ruku') was longer than the later one, and the ruku' was nearly (of the same length) as prostration. He then moved backward and the rows behind him also moved backward till we reached the extreme (Abu Bakr said:                      till he reached near the women) He then moved forward and the people also moved forward along with him till he stood at his (original) place (of worship). He then completed the prayer as it was required to complete and the sun brightened and he said: O people! verily the sun and the moon are among the signs of Allah and they do not eclipse at the death of anyone among people (Abu Bakr said: On the death of any human being). So when you see anything like it (of the nature of eclipse), pray till it is bright. There is nothing which you have been promised (in the next world) but I have seen it in this prayer of mine. Hell was brought to me as you saw me moving back on account of fear lest its heat might affect me; and I saw the owner of the curved staff who dragged his intestines in the fire, and he used to steal (the belongings) of the pilgrims with his curved staff. If he (the owner of the staff) became aware, he would say: It got (accidentally) entangled in my curved staff, but if he was unaware of that, he would take that away. I also saw in it (in Hell) the owner of a cat whom she had tied and did not feed her nor set her free so that she could eat the creatures of the earth, till the cat died of starvation. Paradise was brought to me, and it was on that occasion that you saw me moving forward till I stood at my place (of worship). I stretched my hand as I wanted to catch hold of its fruits so that you may see them. Then I thought of not doing it. Nothing which you have been promised was there that I did not see in this prayer of mine.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2186",
      "hadith_no": "2186",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر، أخبرنا شعيب بن صفوان أبو يحيى، عن عبد الملك بن، عمير عن أبي بردة بن أبي موسى، عن أبي موسى، قال لما أصيب عمر أقبل صهيب من منزله حتى دخل على عمر فقام بحياله يبكي فقال عمر علام تبكي أعلى تبكي قال إي والله لعليك أبكي يا أمير المؤمنين ‏.‏ قال والله لقد علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبكى عليه يعذب ‏\"‏ ‏.‏ قال فذكرت ذلك لموسى بن طلحة فقال كانت عائشة تقول إنما كان أولئك اليهود ‏.‏",
      "text_en": " Abu Musa reported that when 'Umar was wounded, there came Suhaib from his house and went to 'Umar and stood by his side, and began to wail. Upon this 'Umar said:                      What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (may peace be upon him) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20588",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-2344",
      "hadith_no": "2344",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الملك، عن أبي الزبير، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من صاحب إبل ولا بقر ولا غنم لا يؤدي حقها إلا أقعد لها يوم القيامة بقاع قرقر تطؤه ذات الظلف بظلفها وتنطحه ذات القرن بقرنها ليس فيها يومئذ جماء ولا مكسورة القرن ‏\"‏ ‏.‏ قلنا يا رسول الله وما حقها قال ‏\"‏ إطراق فحلها وإعارة دلوها ومنيحتها وحلبها على الماء وحمل عليها في سبيل الله ولا من صاحب مال لا يؤدي زكاته إلا تحول يوم القيامة شجاعا أقرع يتبع صاحبه حيثما ذهب وهو يفر منه ويقال هذا مالك الذي كنت تبخل به فإذا رأى أنه لا بد منه أدخل يده في فيه فجعل يقضمها كما يقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported the Apostle of Allah (may peace be upon him) as saying:                      No owner of camels or cattle or flock of sheep or goats who does not pay his due (would be spared punishment) but would be made to sit on the Day of Resurrection on a soft sandy ground and the hoofed animals would trample him with their hoofs and gore him with their horns. And none of them on that day would be without horns, or with broken horns. We said: Messenger of. Allab, but what is due on them? He said: Lending of the male (for use) and lending of the bucket (used for drawing water for them) and for mating and milking them near water and providing them as a ride for the sake of Allah. And no owner of the property who does not pay Zakat (would be spared punishment) but it (his property) would turn into a bald snake and would follow its owner wherever he would go, and he would run away from it, and it would be said to him: That is your property about which you were stingy. And when he would find no other way out he would thrust his hand in its mouth and it would gnaw it like a male camel.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11368",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2400",
      "hadith_no": "2400",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل ومحمد بن عبد الملك الأموي قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، قال كنت جالسا عند النبي صلى الله عليه وسلم فأتاه قوم مجتابي النمار وساقوا الحديث بقصته وفيه فصلى الظهر ثم صعد منبرا صغيرا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فإن الله أنزل في كتابه ‏{‏ يا أيها الناس اتقوا ربكم‏}‏ الآية ‏\"‏ ‏.‏",
      "text_en": " Mundhir b. Jarir narrated on the authority of his father:                      When we were sitting in the company of the Apostle of Allah (may peace be upon him). There came people dressed in striped woollen clothes, and the rest of the hadith in the same, and there (it is also mentioned):\" He observed the Zuhr prayer and then climbed up a small pulpit, praised Allah, lauded Him, and then said: Verily Allah in His Book has revealed: 'O people, fear your Lord, ' etc.\" (iv. 1).",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20469",
        "11368",
        "10831"
      ]
    },
    {
      "id": "sahih-muslim-2560",
      "hadith_no": "2560",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا سهل بن عثمان، حدثنا زياد بن عبد الله البكائي، عن عبد الملك بن عمير، عن موسى بن طلحة، عن عبد الله بن عمر، - رضى الله عنهما - عن النبي صلى الله عليه وسلم قال ‏\"‏ الشهر هكذا وهكذا وهكذا عشرا وعشرا وتسعا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The mouth (of Ramadan) is thus and thus, and thus. i. e. ten, ten and-nine.",
      "usc_msa_ref": "",
      "chain": [
        "30546",
        "20322",
        "11368",
        "579",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2729",
      "hadith_no": "2729",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد الملك، - وهو ابن عمير - عن قزعة، عن أبي سعيد، - رضى الله عنه - قال سمعت منه، حديثا فأعجبني فقلت له آنت سمعت هذا، من رسول الله صلى الله عليه وسلم قال فأقول على رسول الله صلى الله عليه وسلم ما لم أسمع قال سمعته يقول ‏\"‏ لا يصلح الصيام في يومين يوم الأضحى ويوم الفطر من رمضان ‏\"‏ ‏.‏",
      "text_en": " Qaza'a related from Abu Sa'id. He said:                      I heard from him (Abu Sa'id) a hadith which impressed me, and I said to him: Did you hear it from the Messenger of Allah (may peace be upon him)? Thereupon he said: (Is it possible) that (I should) say about the Messenger of Allah (may peace be upon him) that which I have not heard? I heard him saying: It is not proper to fast on two days, Adha and Fitr (at the end) of Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11368",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2813",
      "hadith_no": "2813",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، عن عبد الملك بن عمير، عن محمد بن، المنتشر عن حميد بن عبد الرحمن، عن أبي هريرة، - رضى الله عنه - يرفعه قال سئل أى الصلاة أفضل بعد المكتوبة وأى الصيام أفضل بعد شهر رمضان فقال ‏\"‏ أفضل الصلاة بعد الصلاة المكتوبة الصلاة في جوف الليل وأفضل الصيام بعد شهر رمضان صيام شهر الله المحرم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that he (the Messenger of Allah) was asked as to which prayer was most excellent after the prescribed prayer, and which fast was most excellent after the month of Ramadan. He said:                      Prayer offered in the middle of the night and the most excellent fast after (fasting) in the month of Ramadan is the fast in God's month al-Muharram.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11368",
        "11388",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3252",
      "hadith_no": "3252",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن عبد الملك، عن عطاء، عن جابر بن، عبد الله قال كنا نتمتع مع رسول الله صلى الله عليه وسلم بالعمرة فنذبح البقرة عن سبعة نشترك فيها ‏.‏",
      "text_en": " Jaibir b. 'Abdullah (Allah be pleased with them) reported:                      We performed Hajj Tamattu' along with Allah's Messenger (may peace be upon him) and we slaughtered a cow on behalf of seven persons sharing in it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3325",
      "hadith_no": "3325",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، جميعا عن جرير، - قال قتيبة حدثنا جرير، عن عبد الملك، - وهو ابن عمير - عن قزعة، عن أبي سعيد، قال سمعت منه، حديثا فأعجبني فقلت له أنت سمعت هذا، من رسول الله صلى الله عليه وسلم قال فأقول على رسول الله صلى الله عليه وسلم ما لم أسمع قال سمعته يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تشدوا الرحال إلا إلى ثلاثة مساجد مسجدي هذا والمسجد الحرام والمسجد الأقصى ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ لا تسافر المرأة يومين من الدهر إلا ومعها ذو محرم منها أو زوجها ‏\"‏ ‏.‏",
      "text_en": " Qaza'ah reported:                      I heard a hadith from Abu Sa'id (Allah be pleased with him) and it impressed me (very much), so I said to him: Did you hear it (yourself) from Allah's Messenger (may peace be upon him)? Thereupon he said: (Can) I speak of anything about Allah's Messenger (may peace be upon him) which I did not bear? He said: I heard Allah's Messenger (may peace be upon him) saying: Do not set out on a journey (for religious devotion) but for the three mosques-for this mosque of mine (at Medina) the Sacred Mosque (at Mecca), and the Mosque al-Aqsa (Bait al-Maqdis), and I heard him saying also: A woman should not travel for two days duration, but only when there is a Mahram with her or her husband.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "30367",
        "20028",
        "11368",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3326",
      "hadith_no": "3326",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير قال سمعت قزعة، قال سمعت أبا سعيد الخدري، قال سمعت من، رسول الله صلى الله عليه وسلم أربعا فأعجبنني وآنقنني نهى أن تسافر المرأة مسيرة يومين إلا ومعها زوجها أو ذو محرم ‏.‏ واقتص باقي الحديث ‏.‏",
      "text_en": " Qaza'ah reported:                      I heard Abu Sa'id al-Khudri (Allah be pleased with him) saying: I heard four things from Allah's Messenger (may peace be upon him) which impressed me and captivated me (and one out of these is this), that he forbade a woman to undertake journey extending over two days but with her husband, or with a Mahram; and he then narrated the rest of the hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3739",
      "hadith_no": "3739",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن عبد الملك، عن أنس بن، سيرين قال سألت ابن عمر عن امرأته التي، طلق فقال طلقتها وهى حائض فذكر ذلك لعمر فذكره للنبي صلى الله عليه وسلم فقال ‏\"‏ مره فليراجعها فإذا طهرت فليطلقها لطهرها ‏\"‏ ‏.‏ قال فراجعتها ثم طلقتها لطهرها ‏.‏ قلت فاعتددت بتلك التطليقة التي طلقت وهى حائض قال ما لي لا أعتد بها وإن كنت عجزت واستحمقت ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I asked Ibn 'Umar (Allah be pleased with them) about the woman whom he had divorced. He said: I divorced her while she was in the state of menses. It was mentioned to 'Umar (Allah be pleased with him) and he then made a mention of that to Allah's Apostle (may peace be upon him), whereupon he said: Command him to take her back and when the period of menses is over, then (he may divorce her in the state of her purity. He (Ibn Umar) said: So I took her back, then divorced her in her purity. I (the narrator) said: Did you count that divorce which you pronounced in the state of menses? He said: Why should I not have counted that? Was I helpless or foolish?",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "11368",
        "11038",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3837",
      "hadith_no": "3837",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن وراد، - كاتب المغيرة - عن المغيرة بن شعبة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح عنه ‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ أتعجبون من غيرة سعد فوالله لأنا أغير منه والله أغير مني من أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن ولا شخص أغير من الله ولا شخص أحب إليه العذر من الله من أجل ذلك بعث الله المرسلين مبشرين ومنذرين ولا شخص أحب إليه المدحة من الله من أجل ذلك وعد الله الجنة ‏\"‏ ‏.‏",
      "text_en": " AI-Mughira b. Shu'ba (Allah be pleased with him) reported that Sa'd b. 'Ubada (Allah be pleased with him) said:                      If I were to see a man with my wife, I would have struck him with the sword, and not with the flat part (side) of it. When Allah's Messenger (may peace be upon him) heard of that, he said: Are you surprised at Sa'd's jealousy of his honour? By Allah, I am more jealous of my honour than he, and Allah is more jealous than I. Because of His jealousy Allah has prohibited abomination, both open and secret And no person is more jealous of his honour than Allah, and no persons, is more fond of accepting an excuse than Allah, on account of which He has sent messengers, announcers of glad tidings and warners; and no one is more fond of praise than Allah on account of which Allah has promised Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-4001",
      "hadith_no": "4001",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها فإن لم يستطع أن يزرعها وعجز عنها فليمنحها أخاه المسلم ولا يؤاجرها إياه ‏\"‏ ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who has land should cultivate it, but if he does not find it possible to cultivate it, or finds himself helpless to do so, he should lend it to his Muslim brother, but he should not accept rent from him.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4050",
      "hadith_no": "4050",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يغرس غرسا إلا كان ما أكل منه له صدقة وما سرق منه له صدقة وما أكل السبع منه فهو له صدقة وما أكلت الطير فهو له صدقة ولا يرزؤه أحد إلا كان له صدقة ‏\"‏ ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Never a Muslim plants a tree, but he has the reward of charity for him, for what is eaten out of that is charity; what is stolen out of that, what the beasts eat out of that, what the birds eat out of that is charity for him. (In short) none incurs a los! k to him but it becomes a charity on his part.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4078",
      "hadith_no": "4078",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير عن ربعي بن حراش، عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فدخل الجنة فقيل له ما كنت تعمل قال فإما ذكر وإما ذكر ‏.‏ فقال إني كنت أبايع الناس فكنت أنظر المعسر وأتجوز في السكة أو في النقد ‏.‏ فغفر له ‏\"‏ ‏.‏ فقال أبو مسعود وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A person died and he entered Paradise. It was said to him What (act) did you do? (Either he recalled it himself or he was made to recall), he said I used to enter into transactions with people and I gave respite to the insolvent and did not show any strictness in case of accepting a coin or demanding cash payment. (For these acts of his) he was granted pardon. Abu Mas'ud said: I heard this from Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-4301",
      "hadith_no": "4301",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير عن مصعب بن سعد، عن أبيه، قال عادني النبي صلى الله عليه وسلم فقلت أوصي بمالي كله ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ قلت فالنصف ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت أبالثلث فقال ‏\"‏ نعم والثلث كثير ‏\"‏ ‏.‏",
      "text_en": " Ibn Sa'd reported his father as saying:                      Allah's Apostle (may peace be upon him) visited me during my illness. I said: I am willing away the whole of my property. He said: No. I said: Then half? He said: No. I said: Should I will away one-third? He said: Yes, and even one-third is enough.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-4587",
      "hadith_no": "4587",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الرحمن، بن أبي بكرة ‏.‏ قال كتب أبي - وكتبت له - إلى عبيد الله بن أبي بكرة وهو قاض بسجستان أن لا، تحكم بين اثنين وأنت غضبان فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحكم أحد بين اثنين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rabmin b. Abu Bakra reported:                      My father dictated (and I wrote for him) to Ubaidullah b. Abu Bakra while he was the judge of Sijistan: Do not judge between two persons when you are angry, for I have heard Allah's Messenger (may peace be upon him) as saying: None of you should judge between two persons when he is angry.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11368"
      ]
    },
    {
      "id": "sahih-muslim-4810",
      "hadith_no": "4810",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال أمر الناس ماضيا ما وليهم اثنا عشر رجلا ‏\"‏ ‏.‏ ثم تكلم النبي صلى الله عليه وسلم بكلمة خفيت على فسألت أبي ماذا قال رسول الله صلى الله عليه وسلم فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Jabir b. Samura who said:                      I heard the Messenger of Allah (may peace be upon him) say: The affairs of the people will continue to be conducted (well) as long as they are governed by twelve men. Then the Holy Prophet (may peace be upon him) said words which were obscure to me. I asked my father: What did the Messenger of Allah (may peace be upon him) say? He said: All of the (twelve men) will be from the Quraish.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-5440",
      "hadith_no": "5440",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني عمرو الناقد، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله بن عمرو، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن أنس بن مالك، قال أمر أبو طلحة أم سليم أن تصنع، للنبي صلى الله عليه وسلم طعاما لنفسه خاصة ثم أرسلني إليه ‏.‏ وساق الحديث وقال فيه فوضع النبي صلى الله عليه وسلم يده وسمى عليه ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فدخلوا فقال ‏\"‏ كلوا وسموا الله ‏\"‏ ‏.‏ فأكلوا حتى فعل ذلك بثمانين رجلا ‏.‏ ثم أكل النبي صلى الله عليه وسلم بعد ذلك وأهل البيت وتركوا سؤرا ‏.‏",
      "text_en": " Anas b. Malik reported:                      Abu Talha ordered Umm Sulaim to prepare a meal specially for Allah's Apostle (may peace be upon him). He then sent me to him (to the Holy Prophet) ; the rest of the hadith is the same (but there is a slight variation of wording):\" Allah's Messenger (may peace be upon him) placed his hand and mentioned the name of Allah upon that, and then said: Admit ten men. He (Abu Talha) admitted them and they got in. He (the Holy Prophet) said: Eat while mentioning the name of Allah upon it (the meal). They ate until eighty persons had taken the food. Then Allah's Apostle (may peace be upon him) had his meal and so the members of the household, and still they left some food.\"",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30346",
        "30024",
        "11368",
        "11196",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5463",
      "hadith_no": "5463",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، وعمر بن عبيد عن عبد الملك بن عمير، عن عمرو بن حريث، عن سعيد بن زيد بن عمرو، بن نفيل قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail reported:                      I heard Allah's Apostle (may peace be upon him) as saying: Truffles are a kind of 'Manna' and their juice is a medicine for the eyes.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "30123",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-muslim-5464",
      "hadith_no": "5464",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير قال سمعت عمرو بن حريث، قال سمعت سعيد بن زيد، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-muslim-5468",
      "hadith_no": "5468",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، قال سمعت عمرو، بن حريث يقول قال سمعت سعيد بن زيد، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن الذي أنزل الله عز وجل على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid reported Allah's Messenger (may peace be upon him) as saying:                      Truffles are 'Manna' which Allah, the Exalted the Majestic, sent to the people of Israil, and its juice is a medicine for the eyes.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-muslim-5530",
      "hadith_no": "5530",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن عبد الملك، عن عبد الله، مولى أسماء بنت أبي بكر وكان خال ولد عطاء قال أرسلتني أسماء إلى عبد الله بن عمر فقالت بلغني أنك تحرم أشياء ثلاثة العلم في الثوب وميثرة الأرجوان وصوم رجب كله ‏.‏ فقال لي عبد الله أما ما ذكرت من رجب فكيف بمن يصوم الأبد وأما ما ذكرت من العلم في الثوب فإني سمعت عمر بن الخطاب يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما يلبس الحرير من لا خلاق له ‏\"‏ ‏.‏ فخفت أن يكون العلم منه وأما ميثرة الأرجوان فهذه ميثرة عبد الله فإذا هي أرجوان ‏.‏ فرجعت إلى أسماء فخبرتها فقالت هذه جبة رسول الله صلى الله عليه وسلم ‏.‏ فأخرجت إلى جبة طيالسة كسروانية لها لبنة ديباج وفرجيها مكفوفين بالديباج فقالت هذه كانت عند عائشة حتى قبضت فلما قبضت قبضتها وكان النبي صلى الله عليه وسلم يلبسها فنحن نغسلها للمرضى يستشفى بها ‏.‏",
      "text_en": " Abdullah. the freed slave of Asma' (the daughter of Abu Bakr). the maternal uncle of the son of 'Ata, reported:                      Asma' sent me to 'Abdullah b. 'Umar saying: The news has reached me that you prohibit the use of three things: the striped robe. saddle cloth made of red silk. and the fasting in the holy month of Rajab. 'Abdullah said to me: So far as what you say about fasting in the month of Rajab, how about one who observes continuous fasting? -and so far as what you say about the striped garment, I heard Umar b. Khatab say that he had heard from Allah's Messenger (may peace be upon him): He who wears silk garment has no share for him (in the Hereafter), and I am afraid it may not be that striped garment; and so far as the red saddle clotb is concerned that is the saddle cloth of Abdullah and it is red. I went back to Asma' and informed her. whereupon she said: Here is the cloak of Allah's Messenger (may peace be upon him). and she brought out to me that cloak made of Persian cloth with a hem of brocade, and its sleeves bordered with brocade and said: This wall Allah's Messenger's cloak with 'A'isha until she died, and when she died. I got possession of it. The Apostle of Allah (may peace be upon him) used to wear that, and we waslied it for the sick and sought cure thereby.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "11368",
        "11188"
      ]
    },
    {
      "id": "sahih-muslim-6025",
      "hadith_no": "6025",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثني أبو جعفر، محمد بن الصباح وعلي بن حجر السعدي جميعا عن شريك، قال ابن حجر أخبرنا شريك، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ أشعر كلمة تكلمت بها العرب كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest word spoken by an Arab (pre-Islamic) in poetry is this verse of Labid:\" Behold! apart from Allah everything is vain.\"",
      "usc_msa_ref": "",
      "chain": [
        "20587",
        "11858",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6026",
      "hadith_no": "6026",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا ابن مهدي، عن سفيان، عن عبد الملك، بن عمير حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق كلمة قالها شاعر كلمة لبيد ألا كل شىء ما خلا الله باطل وكاد أمية بن أبي الصلت أن يسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest word uttered by a poet is this verse of Labid:\" Behold! apart from Allah everything is vain,\" and Umayya b. Abu Salt was almost a Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20033",
        "20012",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6027",
      "hadith_no": "6027",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا سفيان، عن زائدة، عن عبد الملك بن عمير، عن  أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أصدق بيت قاله الشاعر ألا كل شىء ما خلا الله باطل وكاد ابن أبي الصلت أن يسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest verse recited by a poet is: Beliold! apart from Allah everything is vain,\" and Ibn Abu Salt was almost a Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "20320",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6028",
      "hadith_no": "6028",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أصدق بيت قالته الشعراء ألا كل شىء ما خلا الله باطل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      The truest couplet recited by a poet is:\" Behold! apart from Allah everything is vain,\" and he made no addition to it.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6029",
      "hadith_no": "6029",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يحيى بن زكرياء، عن إسرائيل، عن عبد الملك، بن عمير عن أبي سلمة بن عبد الرحمن، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أصدق كلمة قالها شاعر كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏ ‏.‏ ما زاد على ذلك ‏.‏",
      "text_en": " Abu Huraira reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The truest word which the poet stated is the word of Labid:\" Behold! apart from Allah everything is vain.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20311",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6106",
      "hadith_no": "6106",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني أحمد بن عبد الله بن يونس، حدثنا زائدة، حدثنا عبد الملك بن عمير، قال سمعت جندبا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أنا فرطكم، على الحوض ‏\"‏ ‏.‏",
      "text_en": " Jundab reported:                      I heard Allah's Messenger (may peace be upon him) as saying: I shall be there at the Cistern before you.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20320",
        "11368",
        "4053"
      ]
    },
    {
      "id": "sahih-muslim-6107",
      "hadith_no": "6107",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا ابن بشر، جميعا عن مسعر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، قالا حدثنا شعبة، كلاهما عن عبد الملك بن عمير، عن جندب، عن  النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jundab through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "30216",
        "20359",
        "30150",
        "20286",
        "30170",
        "20173",
        "11368",
        "4053"
      ]
    },
    {
      "id": "sahih-muslim-6609",
      "hadith_no": "6609",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قالا حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيتم إن كان جهينة وأسلم وغفار خيرا من بني تميم وبني عبد الله بن غطفان وعامر بن صعصعة ‏\"‏ ‏.‏ ومد بها صوته فقالوا يا رسول الله فقد خابوا وخسروا ‏.‏ قال ‏\"‏ فإنهم خير ‏\"‏ ‏.‏ وفي رواية أبي كريب ‏\"‏ أرأيتم إن كان جهينة ومزينة وأسلم وغفار ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      What is your view if Juhaina, Aslam, Ghifar were better than Banu Tamim, Banu 'Abdullah b. Ghatfan and 'Amir b. Sa'sa'a' respectively (then what would be status of the latter one)? He said this in a loud voice. They said: Allah's Messenger, they would be definitely at a loss and disadvantage. Thereupon he said: They (the first group) are decidedly better than the others; and in the hadith transmitted on the authority of Abu Kuraib the words are: It you were to find that Juhaina, Muzaina and Aslam and Ghifar (are better than...).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-6978",
      "hadith_no": "6978",
      "source": "Sahih Muslim",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل ومحمد بن عبد الملك الأموي قالوا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، عن النبي صلى الله عليه وسلم ح",
      "text_en": " Jarir transmitted this hadith from his father through another chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20469",
        "11368",
        "10831"
      ]
    },
    {
      "id": "sahih-muslim-7092",
      "hadith_no": "7092",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثني زهير بن حرب، حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن مجاهد، عن ابن أبي ليلى، عن علي بن أبي طالب، ح  وحدثنا محمد بن عبد الله بن نمير، وعبيد بن يعيش، عن عبد الله بن نمير، حدثنا  عبد الملك، عن عطاء بن أبي رباح، عن مجاهد، عن ابن أبي ليلى، عن علي، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديث الحكم عن ابن أبي ليلى، وزاد، في الحديث قال علي ما تركته منذ سمعته من النبي صلى الله عليه وسلم ‏.‏ قيل له ولا ليلة صفين قال ولا ليلة صفين ‏.‏ وفي حديث عطاء عن مجاهد عن ابن أبي ليلى قال قلت له ولا ليلة صفين",
      "text_en": " This hadith has been transmitted on the authority of Ibn Abi Laili but with this addition:                     \" Ali said: Ever since I heard this (supplication) from Allah's Apostle (may peace be upon him), I never abandoned it. It was said to him, Not even in the night of Siffin (battle of Siffin)? He sad: Yes, not even in the night of Siffin,\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20005",
        "11258",
        "11028",
        "11196",
        "5",
        "30212",
        "30469",
        "20331",
        "11368",
        "11029",
        "11028",
        "11196"
      ]
    },
    {
      "id": "sahih-muslim-7150",
      "hadith_no": "7150",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبد الملك، عن عطاء، عن  أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن لله مائة رحمة أنزل منها رحمة واحدة بين الجن والإنس والبهائم والهوام فبها يتعاطفون وبها يتراحمون وبها تعطف الوحش على ولدها وأخر الله تسعا وتسعين رحمة يرحم بها عباده يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There are one hundred (parts of) mercy for Allah and He has sent down out of these one part of mercy upon the jinn and human beings and the insects and it is because of this (one part) that they love one another, show kindness to one another and even the beast treats its young one with affection, and Allah has reserved ninetynine parts of mercy with which He would treat His servants on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11368",
        "11029",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7466",
      "hadith_no": "7466",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد الملك بن عمير، عن جابر بن سمرة، عن نافع بن عتبة، قال كنا مع رسول الله صلى الله عليه وسلم في غزوة - قال - فأتى النبي صلى الله عليه وسلم قوم من قبل المغرب عليهم ثياب الصوف فوافقوه عند أكمة فإنهم لقيام ورسول الله صلى الله عليه وسلم قاعد - قال - فقالت لي نفسي ائتهم فقم بينهم وبينه لا يغتالونه - قال - ثم قلت لعله نجي معهم ‏.‏ فأتيتهم فقمت بينهم وبينه - قال - فحفظت منه أربع كلمات أعدهن في يدي قال ‏\"‏ تغزون جزيرة العرب فيفتحها الله ثم فارس فيفتحها الله ثم تغزون الروم فيفتحها الله ثم تغزون الدجال فيفتحه الله ‏\"‏ ‏.‏ قال فقال نافع يا جابر لا نرى الدجال يخرج حتى تفتح الروم ‏.‏",
      "text_en": " Nafi' b. Utba reported:                      We were with Allah's Messenger (may peace be upon him) in an expedition that there came a people to Allah's Apostle (may peace be upon him) from the direction of the west. They were dressed in woollen clothes and they stood near a hillock and they met him as Allah's Messenger (may peace be upon him) was sitting. I said to myself: Better go to them and stand between him and them that they may not attack him. Then I thought that perhaps there had been going on secret negotiation amongst them. I however, went to them and btood between them and him and I remember four of the words (on that occasion) which I repeat (on the fingers of my hand) that he (Allah's Messenger) said: You will attack Arabia and Allah will enable you to conquer it, then you would attack Persia and He would make you to Conquer it. Then you would attack Rome and AllgLh will enable you to conquer it, then you would attack the Dajjal and Allah will enable you to conquer him. Nafi' said: Jabir, we thought that the Dajjal would appear after Rome (Syrian territory) would be conquered.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-7514",
      "hadith_no": "7514",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد الملك بن عمير، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا هلك كسرى فلا كسرى بعده ‏\"‏ ‏.‏ فذكر بمثل حديث أبي هريرة سواء ‏.‏",
      "text_en": " Jabir b. Samura reported that Allah's Messenger (may peace be upon him) said:                      When Kisra would die there would be no Kisra after him; the rest of the hadith is the same as Abu Huraira reported.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-7553",
      "hadith_no": "7553",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن ربعي بن، حراش عن حذيفة، عن النبي صلى الله عليه وسلم أنه قال في الدجال ‏\"‏ إن معه ماء ونارا فناره ماء بارد وماؤه نار فلا تهلكوا ‏\"‏ ‏.‏   قال أبو مسعود وأنا سمعته من، رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa reported Allah's Messenger (may peace be upon him) as saying:                      the Dajjal would have with him water and fire and his fire would bays the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-7555",
      "hadith_no": "7555",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا علي بن حجر، حدثنا شعيب بن صفوان، عن عبد الملك بن عمير، عن ربعي، بن حراش عن عقبة بن عمرو أبي مسعود الأنصاري، قال انطلقت معه إلى حذيفة بن اليمان فقال له عقبة حدثني ما سمعت من رسول الله صلى الله عليه وسلم في الدجال ‏.‏ قال ‏\"‏ إن الدجال يخرج وإن معه ماء ونارا فأما الذي يراه الناس ماء فنار تحرق وأما الذي يراه الناس نارا فماء بارد عذب فمن أدرك ذلك منكم فليقع في الذي يراه نارا فإنه ماء عذب طيب ‏\"‏ ‏.‏   فقال عقبة وأنا قد، سمعته تصديقا، لحذيفة ‏.‏",
      "text_en": " 'Uqba b. 'Amr Abu Mas'ud al-Ansari reported:                      I went to Hudhaifa b. Yaman and said to him: Narrate what you have heard from Allah's Messenger (may peace be upon him) pertaining to the Dajjal. He said that the Dajjal would appear and there would be along with him water ant fire and what the people would see as water that would be fire and that would burn and what would appear as fire that would be water and any one of you who would see that should plunge in that which he sees as fire for it would be sweet, pure water, and 'Uqba said: I also heard it, testifying Hudhaifa.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20588",
        "11368",
        "11334"
      ]
    },
    {
      "id": "sunan-abi-daud-381",
      "hadith_no": "381",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير، - يعني ابن حازم - قال سمعت عبد الملك، - يعني ابن عمير - يحدث عن عبد الله بن معقل بن مقرن، قال صلى أعرابي مع النبي صلى الله عليه وسلم بهذه القصة قال فيه وقال يعني النبي صلى الله عليه وسلم ‏\"‏ خذوا ما بال عليه من التراب فألقوه وأهريقوا على مكانه ماء ‏\"‏ ‏.‏ قال أبو داود وهو مرسل ابن معقل لم يدرك النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Ma'qil ibn Muqarrin:                     A bedouin prayed with the Prophet (ﷺ). He then narrated the tradition (No 0380) about urinating of that bedouin. This version adds: The Prophet (ﷺ) said: Remove the earth where he urinated and throw it away and pour water upon the place.Abu Dawud said: This is a mursal tradition (i.e. the narrator quotes the Prophet (ﷺ) directly, although he did not see him). Ibn Ma'qil did not see the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "11272",
        "11368",
        "3119"
      ]
    },
    {
      "id": "sunan-abi-daud-1639",
      "hadith_no": "1639",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن عبد الملك بن عمير، عن زيد بن عقبة الفزاري، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المسائل كدوح يكدح بها الرجل وجهه فمن شاء أبقى على وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو في أمر لا يجد منه بدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: Acts of begging are lacerations with which a man disfigures his face, so he who wishes may preserve his self-respect, and he who wishes may abandon it; but this does not apply to one who begs from a ruler, or in a situation which makes it necessary.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-1688",
      "hadith_no": "1688",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سوار المصري، حدثنا عبدة، عن عبد الملك، عن عطاء، عن أبي هريرة، في المرأة تصدق من بيت زوجها قال لا إلا من قوتها والأجر بينهما ولا يحل لها أن تصدق من مال زوجها إلا بإذنه ‏.‏ قال أبو داود هذا يضعف حديث همام ‏.‏",
      "text_en": " ‘Ata said Abu Hurairah was asked Whether a woman could give sadaqah from the house (property) of her husband.  He replied `No’. She can give it from her maintenance. The reward will be divided between them. It is not lawful for her to give sadaqah from her husband’s property without his permission.Abu Dawud said This version weakens the version narrated by Hammam (bin Munabbih).",
      "usc_msa_ref": "",
      "chain": [
        "35127",
        "20337",
        "11368",
        "11029",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-2807",
      "hadith_no": "2807",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، حدثنا عبد الملك، عن عطاء، عن جابر بن عبد الله، قال كنا نتمتع في عهد رسول الله صلى الله عليه وسلم نذبح البقرة عن سبعة والجزور عن سبعة نشترك فيها ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     We performed tamattu' during the lifetime of the Messenger of Allah (ﷺ), sacrificed a cow for seven and a camel for seven people. We shared them.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20468",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3092",
      "hadith_no": "3092",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سهل بن بكار، عن أبي عوانة، عن عبد الملك بن عمير، عن أم العلاء، قالت عادني رسول الله صلى الله عليه وسلم وأنا مريضة فقال ‏\"‏ أبشري يا أم العلاء فإن مرض المسلم يذهب الله به خطاياه كما تذهب النار خبث الذهب والفضة ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm al-Ala:                     The Messenger of Allah (ﷺ) visited me while I was sick. He said: Be glad, Umm al-Ala' for Allah removes the sins of a Muslim for his illness as fire removes the dross of gold and silver.",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20469",
        "11368"
      ]
    },
    {
      "id": "sunan-abi-daud-3518",
      "hadith_no": "3518",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا عبد الملك، عن عطاء، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بشفعة جاره ينتظر بها وإن كان غائبا إذا كان طريقهما واحدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: The neighbour is most entitled to the right of pre-emption, and he should wait for its exercise even if he is absent, when the two properties have one road.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20468",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3589",
      "hadith_no": "3589",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عبد الملك بن عمير، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه، أنه كتب إلى ابنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقضي الحكم بين اثنين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman bin Abi Bakrah reported on the authority of his father that he wrote to his son:                      The Messenger of Allah (ﷺ) said: A judge should not decide between the two while he is in anger.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-4356",
      "hadith_no": "4356",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا الشيباني، عن أبي بردة، بهذه القصة قال فأتي أبو موسى برجل قد ارتد عن الإسلام، فدعاه عشرين ليلة أو قريبا منها فجاء معاذ فدعاه فأبى فضرب عنقه ‏.‏ قال أبو داود ورواه عبد الملك بن عمير عن أبي بردة لم يذكر الاستتابة ورواه ابن فضيل عن الشيباني عن سعيد بن أبي بردة عن أبيه عن أبي موسى ولم يذكر فيه الاستتابة ‏.‏",
      "text_en": " Abu Burdah said:                      A man who turned back from Islam was brought to Abu Musa. He invited him to repent for twenty days or about so. Muadh then came and invited him (to embrace Islam) but he refused. So he was beheaded.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20317",
        "11352",
        "30002",
        "11368",
        "20356",
        "11352"
      ]
    },
    {
      "id": "sunan-abi-daud-4404",
      "hadith_no": "4404",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، أخبرنا عبد الملك بن عمير، حدثني عطية القرظي، قال كنت من سبى بني قريظة فكانوا ينظرون فمن أنبت الشعر قتل ومن لم ينبت لم يقتل فكنت فيمن لم ينبت ‏.‏",
      "text_en": " Narrated Atiyyah al-Qurazi:                     I was among the captives of Banu Qurayzah. They (the Companions) examined us, and those who had begun to grow hair (pubes) were killed, and those who had not were not killed. I was among those who had not grown hair.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-abi-daud-4405",
      "hadith_no": "4405",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن عبد الملك بن عمير، بهذا الحديث قال فكشفوا عانتي فوجدوها لم تنبت فجعلوني في السبى ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Abd al- Malik b. ‘Umar through a different chain of narrators. This version has:                      They uncovered my private parts, and when they found that the hair had not begun to grow they put me among the captives.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11368"
      ]
    },
    {
      "id": "sunan-abi-daud-4585",
      "hadith_no": "4585",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا زياد بن أيوب، أخبرنا هشيم، حدثنا حجاج، وعبد الملك، عن عطاء، عن يعلى بن أمية، بهذا زاد ثم قال يعني النبي صلى الله عليه وسلم للعاض ‏\"‏ إن شئت أن تمكنه من يدك فيعضها ثم تنزعها من فيه ‏\"‏ ‏.‏ وأبطل دية أسنانه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ya'la b. Umayyah through a different chain of narrators. This version has:                      The Prophet (ﷺ) said to the man bit him: If you wish that you give him control over your hand and he bites it, and then you drive it away from his mouth (you may do it). He imposed no retaliation for his teeth.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "20219",
        "11368",
        "11029"
      ]
    },
    {
      "id": "sunan-abi-daud-4780",
      "hadith_no": "4780",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا جرير بن عبد الحميد، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن معاذ بن جبل، قال استب رجلان عند النبي صلى الله عليه وسلم فغضب أحدهما غضبا شديدا حتى خيل إلى أن أنفه يتمزع من شدة غضبه فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأعلم كلمة لو قالها لذهب عنه ما يجده من الغضب ‏\"‏ ‏.‏ فقال ما هي يا رسول الله قال ‏\"‏ يقول اللهم إني أعوذ بك من الشيطان الرجيم ‏\"‏ ‏.‏ قال فجعل معاذ يأمره فأبى ومحك وجعل يزداد غضبا ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     Two men reviled each other in the presence of the Prophet (ﷺ) and one of them became excessively angry so much so that I thought that his nose will break up on account of excess of anger. The Prophet (ﷺ) said: I know a phrase which, if he repeated, he could get rid of this angry feeling. They asked: What is it, Messenger of Allah? He replied: He should say: I seek refuge in Thee from the accursed devil. Mu'adh then began to ask him to do so, but he refused and persisted in quarrelling, and began to enhance his anger.",
      "usc_msa_ref": "",
      "chain": [
        "30224",
        "20028",
        "11368",
        "11196",
        "32"
      ]
    },
    {
      "id": "sunan-abi-daud-5049",
      "hadith_no": "5049",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا نام قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah said :                      when the prophet (May peace be upon him) lay down on his bed (at night), he would say: O Allah! In Thy name I die and live. When he awoke, he said: praise be to Allah who has given us life after causing us to die and to whom we shall be resurrected.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-abi-daud-5128",
      "hadith_no": "5128",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المثنى، حدثنا يحيى بن أبي بكير، حدثنا شيبان، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He who is consulted is trustworthy.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20365",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5271",
      "hadith_no": "5271",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن عبد الرحمن الدمشقي، وعبد الوهاب بن عبد الرحيم الأشجعي، قالا حدثنا مروان، حدثنا محمد بن حسان، - قال عبد الوهاب الكوفي - عن عبد الملك بن عمير، عن أم عطية الأنصارية، أن امرأة، كانت تختن بالمدينة فقال لها النبي صلى الله عليه وسلم ‏\"‏ لا تنهكي فإن ذلك أحظى للمرأة وأحب إلى البعل ‏\"‏ ‏.‏ قال أبو داود روي عن عبيد الله بن عمرو عن عبد الملك بمعناه وإسناده ‏.‏ قال أبو داود ليس هو بالقوي وقد روي مرسلا ‏.‏ قال أبو داود ومحمد بن حسان مجهول وهذا الحديث ضعيف ‏.‏",
      "text_en": " Narrated Umm Atiyyah al-Ansariyyah:                     A woman used to perform circumcision in Medina. The Prophet (ﷺ) said to her: Do not cut severely as that is better for a woman and more desirable for a husband.Abu Dawud said: It has been transmitted by 'Ubaid Allah b. 'Amr from 'Abd al-Malik to the same effect through a different chain.Abu Dawud said: It is not a strong tradition. It has been transmitted in mursal form (missing the link of the Companions)Abu Dawud said: Muhammad b. Hasan is obscure, and this tradition is weak.",
      "usc_msa_ref": "",
      "chain": [
        "30587",
        "37522",
        "20201",
        "18899",
        "11368",
        "71"
      ]
    },
    {
      "id": "jami-al-tirmidhi-326",
      "hadith_no": "326",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، عن قزعة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام ومسجدي هذا ومسجد الأقصى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     Allah's Messenger said: \"A mount is not saddled (for a journey) except t three Masajid: Al-Masjid Al-Haram, this Masjid of mine, and Masjid Al-Aqsa.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11368",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-681",
      "hadith_no": "681",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسألة كد يكد بها الرجل وجهه إلا أن يسأل الرجل سلطانا أو في أمر لا بد منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Samurah bin Jundub narrated that :                     the Messenger of Allah said: \"Asking is a labor that toils on a man's face, except if a man asks for something from the Sultan (ruler), or he asks for something that he cannot do without.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1322",
      "hadith_no": "1322",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، قال سمعت عبد الملك، يحدث عن عبد الله بن موهب، أن عثمان، قال لابن عمر اذهب فاقض بين الناس ‏.‏ قال أوتعافيني يا أمير المؤمنين ‏.‏ قال وما تكره من ذلك وقد كان أبوك يقضي قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كان قاضيا فقضى بالعدل فبالحري أن ينقلب منه كفافا ‏\"‏ ‏.‏ فما أرجو بعد ذلك وفي الحديث قصة ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث غريب وليس إسناده عندي بمتصل ‏.‏ وعبد الملك الذي روى عنه المعتمر هذا هو عبد الملك بن أبي جميلة ‏.‏",
      "text_en": " 'Abdullah bin Mawhab narrated that 'Uthman said to Ibn 'Umar:                      \"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11368",
        "19811",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1334",
      "hadith_no": "1334",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، قال كتب أبي إلى عبيد الله بن أبي بكرة وهو قاض أن لا، تحكم بين اثنين وأنت غضبان ‏.‏ فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحكم الحاكم بين اثنين وهو غضبان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو بكرة اسمه نفيع ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated:                      \"My father wrote to 'Ubaidullah bin Abi Bakrah who was a judge: \"Do not pass a judgement between two people while you are angry, for indeed I heard the Messenger of Allah (ﷺ) saying: 'The judge should not judge between two people while he is angry.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11368",
        "11294"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1584",
      "hadith_no": "1584",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن عطية القرظي، قال عرضنا على النبي صلى الله عليه وسلم يوم قريظة فكان من أنبت قتل ومن لم ينبت خلي سبيله فكنت ممن لم ينبت فخلي سبيلي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم أنهم يرون الإنبات بلوغا إن لم يعرف احتلامه ولا سنه وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Narrated 'Atiyyah Al-Qurazi:                     \"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11368",
        "5184"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2126",
      "hadith_no": "2126",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا المحاربي، عن الليث، وهو ابن أبي سليم عن عبد الملك، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تمار أخاك ولا تمازحه ولا تعده موعدة فتخلفه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وعبد الملك عندي هو ابن أبي بشير ‏.‏",
      "text_en": " Ibn Abbas narrated that the Messenger of Allah said:                     \"Do not argue with your brother, do not joke with him, and do not make a promise, only to not fulfill it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20333",
        "20023",
        "11368",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2209",
      "hadith_no": "2209",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا عمر بن عبيد الطنافسي، عن عبد الملك بن عمير، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " \"Sa'eed bin Zaid narrated that the Prophet (S.A.W) said:                     \"Truffles are a form of manna, and its liquid is a cure for the eye.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20346",
        "11368",
        "30170",
        "20173",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2369",
      "hadith_no": "2369",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا آدم بن أبي إياس، حدثنا شيبان أبو معاوية، حدثنا عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال خرج النبي صلى الله عليه وسلم في ساعة لا يخرج فيها ولا يلقاه فيها أحد فأتاه أبو بكر فقال ‏\"‏ ما جاء بك يا أبا بكر ‏\"‏ ‏.‏ فقال خرجت ألقى رسول الله صلى الله عليه وسلم وأنظر في وجهه والتسليم عليه ‏.‏ فلم يلبث أن جاء عمر فقال ‏\"‏ ما جاء بك يا عمر ‏\"‏ ‏.‏ قال الجوع يا رسول الله قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأنا قد وجدت بعض ذلك ‏\"‏ ‏.‏ فانطلقوا إلى منزل أبي الهيثم بن التيهان الأنصاري وكان رجلا كثير النخل والشاء ولم يكن له خدم فلم يجدوه فقالوا لامرأته أين صاحبك فقالت انطلق يستعذب لنا الماء ‏.‏ فلم يلبثوا أن جاء أبو الهيثم بقربة يزعبها فوضعها ثم جاء يلتزم النبي صلى الله عليه وسلم ويفديه بأبيه وأمه ثم انطلق بهم إلى حديقته فبسط لهم بساطا ثم انطلق إلى نخلة فجاء بقنو فوضعه فقال النبي صلى الله عليه وسلم ‏\"‏ أفلا تنقيت لنا من رطبه ‏\"‏ ‏.‏ فقال يا رسول الله إني أردت أن تختاروا أو قال تخيروا من رطبه وبسره ‏.‏ فأكلوا وشربوا من ذلك الماء فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا والذي نفسي بيده من النعيم الذي تسألون عنه يوم القيامة ظل بارد ورطب طيب وماء بارد ‏\"‏ ‏.‏ فانطلق أبو الهيثم ليصنع لهم طعاما فقال النبي صلى الله عليه وسلم ‏\"‏ لا تذبحن ذات در ‏\"‏ ‏.‏ قال فذبح لهم عناقا أو جديا فأتاهم بها فأكلوا فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك خادم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أتانا سبى فائتنا ‏\"‏ ‏.‏ فأتي النبي صلى الله عليه وسلم برأسين ليس معهما ثالث فأتاه أبو الهيثم فقال النبي صلى الله عليه وسلم ‏\"‏ اختر منهما ‏\"‏ ‏.‏ فقال يا نبي الله اختر لي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن المستشار مؤتمن خذ هذا فإني رأيته يصلي واستوص به معروفا ‏\"‏ ‏.‏ فانطلق أبو الهيثم إلى امرأته فأخبرها بقول رسول الله صلى الله عليه وسلم فقالت امرأته ما أنت ببالغ ما قال فيه النبي صلى الله عليه وسلم إلا أن تعتقه قال فهو عتيق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لم يبعث نبيا ولا خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا ومن يوق بطانة السوء فقد وقي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abu Hurairah narrated :                     \"The Prophet (s.a.w) went out during an hour in which he would normally not go out, nor meet with anyone. Then Abu Bakr came to him. So he said:\"What brought you O Abu Bakr?\" He said: \"I came to meet the Messenger of Allah (s.a.w) and to look at his face, and to make sure he was safe. It was not long before 'Umar came. He said: \"What has brought you O 'Umar ?\" He said: \"Hunger  O  Messenger of Allah!\"He said: \"I also experienced some of that\" So they went to the home of Abu Al-Haitham At-Taiyyihan Al-Ansari. He was a man with many date-palms and sheep, but he had no servants so they did not find him there. They said to his wife: \"Where is your companion?\" She said: \"He has gone to fetch us some good water.\" It was not long before Abu Al-Haitham came along hauling to a large water-skin which he put down. Then he came to hug the Prophet (s.a.w) and uttered that his father and mother should be ransomed for him. Then he went to grove of his and he spread out a mat for them. Then he went to a date-palm and returned with a cluster of dates which he put down. The prophet (s.a.w) said: \"Why don't you select some ripe dates for us?\" He said:  \"O Messenger of Allah(s.a.w)! I wanted you to select from the ripe dates and the unripe dates.\" So they ate and they drank from that water. The Messenger of Allah(s.a.w) said: \"By the One in Whose Hand is my soul! This is among the favors which you shall be asked about on the Day of Judgement. Cool shade, tasty ripe dates, and cool water.\" Abu Al-Haitham left to prepare some food for them. The Prophet (s.a.w) said: \"Do not slaughter one with milk.\" So he Slaughtered a small female or male goat and brought it to them so they could eat it. The Prophet (s.a.w) said: \"Do you have any servants?\" He said: \"No.\" So he said: \"Then if we get some captives we shall bring them for you.\" So (later) the Prophet (s.a.w) came with 2 males, there was no third among them and he brought them to Abu Al-Haitham. The Prophet (s.a.w) said: \"Choose from them.\" He said: \"O Prophet of Allah! Choose for me.\" So the Prophet (s.a.w) said: \"Indeed the one consulted is entrusted. Take this one for I have seen him praying, and encourage him to do well.\" So Abu Al-Haitham went to his wife and informed her of what the Messenger of Allah (s.a.w) said. So his wife said: \"You will not fulfill what the Prophet (s.a.w) said until you have freed him.\" So he said: \"He is free.\" So the Prophet (s.a.w) said: \"Indeed Allah has not send a Prophet nor made a Khalifah except that he has two groups of supporters, group ordering him to do good, and prohibiting him from evil and a group that never ceases spoiling his affairs. So whoever protected.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20404",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2370",
      "hadith_no": "2370",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا صالح بن عبد الله، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، أن رسول الله صلى الله عليه وسلم خرج يوما وأبو بكر وعمر فذكر نحو هذا الحديث ولم يذكر فيه عن أبي هريرة وحديث شيبان أتم من حديث أبي عوانة وأطول ‏.‏ وشيبان ثقة عندهم صاحب كتاب ‏.‏ وقد روي عن أبي هريرة هذا الحديث من غير هذا الوجه وروي عن ابن عباس أيضا ‏.‏",
      "text_en": " Abu Salamah bin 'Abdur-Rahman narrated that:                     the Messenger of Allah(s.a.w) went out one day accompained by Abu Bakr  and 'Umar. And he mentioned similar to Hadith( no 2369) in meaning, but he did not mention \"from Abu Hurairah\" in it.",
      "usc_msa_ref": "",
      "chain": [
        "20469",
        "11368",
        "10567"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2634-2",
      "hadith_no": "2634",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا عبد الحكيم بن منصور الواسطي، عن عبد الملك بن عمير، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قتال المسلم أخاه كفر وسبابه فسوق ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح ‏.‏ وقد روي عن عبد الله بن مسعود من غير وجه ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"A Muslim's fighting his brother is disbelief, and verbally abusing him is disobedience.\"",
      "usc_msa_ref": "",
      "chain": [
        "30448",
        "11368",
        "11363",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2658-2",
      "hadith_no": "2658",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن عبد الله بن مسعود، يحدث عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ نضر الله امرأ سمع مقالتي فوعاها وحفظها وبلغها فرب حامل فقه إلى من هو أفقه منه ‏.‏ ثلاث لا يغل عليهن قلب مسلم إخلاص العمل لله ومناصحة أئمة المسلمين ولزوم جماعتهم فإن الدعوة تحيط من ورائهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdul-Malik bin 'Umair:                     from 'Abdur-Rahman bin 'Abdullah bin Mas'ud that he narrated from his father, from the Prophet (ﷺ) who said: \"May Allah beautify a man who hears a saying of mine, so he understands it, remembers it, and conveys it. Perhaps he carries the Fiqh to one who has more understanding than him. There are three with which the heart of a Muslim shall not be deceived. Sincerity in deeds for Allah, giving Nasihah to the A'immah of Muslims, and sticking to the Jama'ah. For indeed the call is protected from behind them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11368",
        "11363",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2675-2",
      "hadith_no": "2675",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا المسعودي، عن عبد الملك بن عمير، عن ابن جرير بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سن سنة خير فاتبع عليها فله أجره ومثل أجور من اتبعه غير منقوص من أجورهم شيئا ومن سن سنة شر فاتبع عليها كان عليه وزره ومثل أوزار من اتبعه غير منقوص من أوزارهم شيئا ‏\"‏ ‏.‏ وفي الباب عن حذيفة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن جرير بن عبد الله عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وقد روي هذا الحديث عن المنذر بن جرير بن عبد الله عن أبيه عن النبي صلى الله عليه وسلم ‏.‏ وقد روي عن عبيد الله بن جرير عن أبيه عن النبي صلى الله عليه وسلم أيضا ‏.‏",
      "text_en": " Narrated Ibn Jarir bin 'Abdullah:                     from his father that the Messenger of Allah (ﷺ) said: \"Whoever starts a good tradition which is followed, then for him is a reward, and the likes of their rewards of whoever follows him, there being nothing diminished from their rewards. And whoever starts a bad tradition which is followed, then for him is the sin, and the likes of the sins of whoever follows him, there being nothing diminished from their sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "20724",
        "11368"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3054",
      "hadith_no": "3054",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روى غير واحد عن شيبان بن عبد الرحمن النحوي وشيبان هو صاحب كتاب وهو صحيح الحديث ويكنى أبا معاوية ‏.‏ حدثنا عبد الجبار بن العلاء العطار عن سفيان بن عيينة قال قال عبد الملك بن عمير إني لأحدث الحديث فما أدع منه حرفا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20383",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3086",
      "hadith_no": "3086",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أشعر كلمة تكلمت بها العرب كلمة لبيد ألا كل شيء ما خلا الله باطل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه الثوري وغيره عن عبد الملك بن عمير ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3401",
      "hadith_no": "3401",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن معاذ بن جبل، قال أتى النبي صلى الله عليه وسلم رجل فقال يا رسول الله أرأيت رجلا لقي امرأة وليس بينهما معرفة فليس يأتي الرجل شيئا إلى امرأته إلا قد أتى هو إليها إلا أنه لم يجامعها ‏.‏ قال فأنزل الله ‏:‏ ‏(‏ أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين ‏)‏ فأمره أن يتوضأ ويصلي ‏.‏ قال معاذ فقلت يا رسول الله أهي له خاصة أم للمؤمنين عامة قال ‏\"‏ بل للمؤمنين عامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل عبد الرحمن بن أبي ليلى لم يسمع من معاذ ومعاذ بن جبل مات في خلافة عمر وقتل عمر وعبد الرحمن بن أبي ليلى غلام صغير ابن ست سنين وقد روى عن عمر ورآه ‏.‏ وروى شعبة هذا الحديث عن عبد الملك بن عمير عن عبد الرحمن بن أبي ليلى عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     \"A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah! What do you say about a man who meets a woman and there is no acquaintance between them. So there is nothing that a man who would do with his wife but he does it with her, except that he does not have intercourse with her?'\" He said: \"So Allah revealed: And perform the Salat, at the two ends of the day and in some hours of the night. Verily, the good deeds remove the evil deeds. That is a reminder for the mindful (11:114). So he ordered him to perform Wudu and Salat.\" Then Mu'adh said: \"I said: 'O Messenger of Allah! Is that specifically for him, or for the believers in general?' He said: 'Rather it is for the believers in general.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11368",
        "11196",
        "32"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3487",
      "hadith_no": "3487",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا زكريا بن عدي، حدثنا عبيد الله بن عمرو الرقي، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال لما نزلت  ‏:‏ ‏(‏ وأنذر عشيرتك الأقربين ‏)‏ جمع رسول الله صلى الله عليه وسلم قريشا فخص وعم فقال ‏\"‏ يا معشر قريش أنقذوا أنفسكم من النار فإني لا أملك لكم من الله ضرا ولا نفعا يا معشر بني عبد مناف أنقذوا أنفسكم من النار فإني لا أملك لكم من الله ضرا ولا نفعا يا معشر بني قصى أنقذوا أنفسكم من النار فإني لا أملك لكم ضرا ولا نفعا يا معشر بني عبد المطلب أنقذوا أنفسكم من النار فإني لا أملك لكم ضرا ولا نفعا يا فاطمة بنت محمد أنقذي نفسك من النار فإني لا أملك لك ضرا ولا نفعا إن لك رحما سأبلها ببلالها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه يعرف من حديث موسى بن طلحة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"When (the following) was revealed: 'And warn your tribe of near kindred (26:214)' the Messenger of Allah (ﷺ) gathered the (families) of the Quraish (calling them) one and all, he said: 'O people of the Quraish! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you before Allah! O people of Banu 'Abd Manaf! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you before Allah! O people of Banu Qusayy! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you! O people of Banu 'Abdul-Muttalib! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you! O Fatimah bint Muhammad! Ransom yourself from the Fire! I have no power to prevent harm or bring benefit to you before Allah! All you have is the womb, and the kind relations that shall come of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "30464",
        "20445",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3488",
      "hadith_no": "3488",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا شعيب بن صفوان، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20588",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3502",
      "hadith_no": "3502",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مطرف بن طريف، وعبد الملك، وهو ابن أبجر سمعا الشعبي، يقول سمعت المغيرة بن شعبة، على المنبر يرفعه إلى رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى عليه السلام سأل ربه فقال أى رب أى أهل الجنة أدنى منزلة قال رجل يأتي بعد ما يدخل أهل الجنة الجنة فيقال له ادخل الجنة ‏.‏ فيقول كيف أدخل وقد نزلوا منازلهم وأخذوا أخذاتهم ‏.‏ قال فيقال له أترضى أن يكون لك ما كان لملك من ملوك الدنيا فيقول نعم أى رب قد رضيت ‏.‏ فيقال له فإن لك هذا ومثله ومثله ومثله فيقول رضيت أى رب ‏.‏ فيقال له فإن لك هذا وعشرة أمثاله فيقول رضيت أى رب ‏.‏ فيقال له فإن لك مع هذا ما اشتهت نفسك ولذت عينك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى بعضهم هذا الحديث عن الشعبي عن المغيرة ولم يرفعه والمرفوع أصح ‏.‏",
      "text_en": " Narrated Ash-Sha'bi:                     \"While he was on the Minbar, I heard Al-Mughirah bin Shu'bah saying - and he attributed it to the Prophet (ﷺ) - 'Indeed Musa [peace be upon him] asked his Lord: \"O Lord! Who is the lowest in rank among the people of Paradise?\" He said: \"A man who comes after the people of Paradise have been admitted to Paradise, and he is told to enter. He says: 'How can I enter when they have gotten all of their abodes, and all that is to be had?'\" He said: \"So it is said to him: 'Would you accept if you were to have what a king in the world?' He says: 'Yes, O Lord! I accept.' So it is said to him: 'Then for you is this and its like, and its like again, and its like again.' So he says: 'I accept, O Lord!' So it is said to him: 'Then for you is this and ten the like thereof.' So he says: 'I accept, O Lord!' So it is said: 'Indeed you shall have this, and whatever your soul desires, and whatever delights your eyes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11395",
        "11368",
        "10792",
        "11052"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3565",
      "hadith_no": "3565",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا أبو محياة، عن عبد الملك بن عمير، عن ابن أخي عبد الله بن سلام، لما أريد عثمان جاء عبد الله بن سلام فقال له عثمان ما جاء بك قال جئت في نصرك قال اخرج إلى الناس فاطردهم عني فإنك خارج خير لي منك داخل ‏.‏ فخرج عبد الله إلى الناس فقال أيها الناس إنه كان اسمي في الجاهلية فلان فسماني رسول الله صلى الله عليه وسلم عبد الله ونزل في آيات من كتاب الله نزلت في ‏:‏ ‏(‏ وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ‏)‏ ونزلت في ‏:‏ ‏(‏قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب ‏)‏ إن لله سيفا مغمودا عنكم وإن الملائكة قد جاورتكم في بلدكم هذا الذي نزل فيه نبيكم فالله الله في هذا الرجل أن تقتلوه فوالله إن قتلتموه لتطردن جيرانكم الملائكة ولتسلن سيف الله المغمود عنكم فلا يغمد إلى يوم القيامة قال فقالوا اقتلوا اليهودي واقتلوا عثمان ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد رواه شعيب بن صفوان عن عبد الملك بن عمير عن ابن محمد بن عبد الله بن سلام عن جده عبد الله بن سلام ‏.‏",
      "text_en": " Narrated 'Abdul-Malik bin 'Umair:                     from the nephew of 'Abdullah bin Salam who said: \"When they were after 'Uthman, 'Abdullah bin Salam came, and 'Uthman said to him: 'What did you come for?' He said: 'I came to assist you.' He said: 'Go to the people to repel their advances against me. For verily your going is better to me than your entering here.'\" He said: \"So 'Abdullah bin Salam went to the people and said: 'O you people! During Jahiliyyah I was named so-and-so, then the Messenger of Allah (ﷺ) named me 'Abdullah, and some Ayat from the Book of Allah were revealed about me. (The following) was revealed about me: 'A witness from among the Children of Isra'il has testified to something similar, and believed while you rejected. Verily, Allah does not guide the wrongdoing people. (46:10)\" And (the following) was revealed about me: 'Sufficient as a witness between me and you is Allah, and those too who have knowledge of the Scripture. (13:43)\" Allah has sheathed the sword from you and the angels are your neighbors in this city of yours, the one in which the Revelation came to your Prophet. But by Allah! (Fear) Allah regarding this man; if you kill him, then by Allah! If you kill him, then you will cause the angels to remove your goodness from you, and to raise Allah's sheathed sword against you, such that it will never be sheathed again until the Day of Resurrection.'\" He said: \"They said: 'Kill the Jew and kill 'Uthman.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "11368"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3398-2",
      "hadith_no": "3398",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، رضى الله عنهما أن النبي صلى الله عليه وسلم كان إذا أراد أن ينام وضع يده تحت رأسه ثم قال ‏\"‏ اللهم قني عذابك يوم تجمع عبادك أو تبعث عبادك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman [may Allah be pleased with him] narrated that:                     When the Prophet would sleep, he would put his hand under his head then say: “O Allah, safeguard me from Your Punishment the Day You gather [Your slaves] (Allahumma Qini Adhabaka Yawma Tajma’u [Ibadak])” or “You resurrect Your slaves (Tab’athu Ibadak).”",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3417-2",
      "hadith_no": "3417",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن عبد الملك بن عمير، عن ربعي، عن حذيفة بن اليمان، رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا أراد أن ينام قال ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيا نفسي بعد ما أماتها وإليه النشور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman [may Allah be pleased with him] narrated that when the Prophet wanted to sleep, he would say:                     “O Allah, in Your Name I dies and I live (Allahumma Bismika Amutu Wa Ahya).” And when he would wake, he would say: “Allah praise is due to Allah who revived my soul after causing its death and to Him is the resurrection (Al-Hamdulillah, Alladhi Ahya Nafsi Ba’da Ma Amataha Wa Ilaihin-Nushur).”",
      "usc_msa_ref": "",
      "chain": [
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3452-2",
      "hadith_no": "3452",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا قبيصة، أخبرنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن معاذ بن جبل، رضى الله عنه قال استب رجلان عند النبي صلى الله عليه وسلم حتى عرف الغضب في وجه أحدهما فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأعلم كلمة لو قالها لذهب غضبه أعوذ بالله من الشيطان الرجيم ‏\"‏ ‏.‏  حدثنا بندار، حدثنا عبد الرحمن، عن سفيان، بهذا الإسناد نحوه ‏.‏ قال وفي الباب عن سليمان بن صرد قال وهذا حديث مرسل ‏.‏ عبد الرحمن بن أبي ليلى لم يسمع من معاذ بن جبل مات معاذ في خلافة عمر بن الخطاب وقتل عمر بن الخطاب وعبد الرحمن بن أبي ليلى غلام ابن ست سنين وهكذا روى شعبة عن الحكم عن عبد الرحمن بن أبي ليلى وقد روى عبد الرحمن بن أبي ليلى عن عمر بن الخطاب ورآه وعبد الرحمن بن أبي ليلى يكنى أبا عيسى وأبو ليلى اسمه يسار وروي عن عبد الرحمن بن أبي ليلى قال أدركت عشرين ومائة من الأنصار من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Mu’adh bin Jabal narrated :                     that one of the two men cursed the other next to the Prophet, until anger could be recognized in the face of one of them. So the Prophet said: “Verily, I know a statement, that is he were to say it, his anger would leave: ‘I seek refuge in Allah from Shaitan, the rejected (A’udhu Billahi Minash-Shaitanir-Rajim).’”",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20351",
        "20012",
        "11368",
        "11196",
        "32"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3567-2",
      "hadith_no": "3567",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا زكريا بن عدي، حدثنا عبيد الله، هو ابن عمرو الرقي عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من الجبن وأعوذ بك من البخل وأعوذ بك من أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن أبو إسحاق الهمداني مضطرب في هذا الحديث يقول عن عمرو بن ميمون عن عمر ويقول عن غيره ويضطرب فيه قال أبو عيسى هذا حديث حسن صحيح من هذا الوجه ‏.‏",
      "text_en": " Mus’ab bin Sa’d and Amr bin Maimun narrated:                     “Sa’d used to teach his children these words just as the Muktib teaches children, he would say: ‘Indeed, the Messenger of Allah used to seek refuge by saying them at the end of (every) Salat: O Allah I seek refuge in You from miserliness, I seek refuge in You from feeble old age, and I seek refuge in You from the trial of the world, and the punishment of the grave (Allahumma Inni A’udhu Bika Minal-Jubn, Wa A’udhu Bika Minal-Bukhl, Wa A’udhu Bika Min Ardhalil-Umur, Wa A’udhu Bika Min Fitnatid-Dunya Wa Adhabil Qabr).’”",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30464",
        "20445",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4020",
      "hadith_no": "4020",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن ابن أبي المعلى، عن أبيه، أن رسول الله صلى الله عليه وسلم خطب يوما فقال ‏\"‏ إن رجلا خيره ربه بين أن يعيش في الدنيا ما شاء أن يعيش ويأكل في الدنيا ما شاء أن يأكل وبين لقاء ربه فاختار لقاء ربه ‏\"‏ ‏.‏ قال فبكى أبو بكر فقال أصحاب النبي صلى الله عليه وسلم ألا تعجبون من هذا الشيخ إذ ذكر رسول الله صلى الله عليه وسلم رجلا صالحا خيره ربه بين الدنيا وبين لقاء ربه فاختار لقاء ربه ‏.‏ قال فكان أبو بكر أعلمهم بما قال رسول الله صلى الله عليه وسلم فقال أبو بكر بل نفديك بآبائنا وأموالنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما من الناس أحد أمن إلينا في صحبته وذات يده من ابن أبي قحافة ولو كنت متخذا خليلا لاتخذت ابن أبي قحافة خليلا ولكن ود وإخاء إيمان ود وإخاء إيمان مرتين أو ثلاثا وإن صاحبكم خليل الله ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وهذا حديث حسن غريب ‏.‏ وقد روي هذا الحديث عن أبي عوانة عن عبد الملك بن عمير بإسناد غير هذا ‏.‏ ومعنى قوله أمن إلينا يعني أمن علينا ‏.‏",
      "text_en": " Narrated Ibn Abi Mu'alla:                     from his father: \"The Messenger of Allah (ﷺ) gave a Khutbah one day and said: 'Indeed there is a man whose Lord has given him the choice between living in this life as long as he wishes to live, and eating from this life as much as he wishes to eat, and between meeting his Lord.'\" He said: \"So Abu Bakr cried. The Companions of the Prophet (ﷺ) said: 'Are you not amazed at this old man, when the Messenger of Allah (ﷺ) mentioned a righteous man whose Lord gave him the choice between this life or meeting his Lord, and he chose meeting his Lord.'\" He said: \"But Abu Bakr was the most knowledgeable one of them regarding what the Messenger of Allah (ﷺ) had said. So Abu Bakr said: 'Rather we will ransom our fathers and wealth for you.; So the Messenger of Allah (ﷺ) said: 'There is no one among people more beneficial to us (Amanna Ilaina) in his companionship, or generous with his wealth than Ibn Abi Quhafah. And, if I were to take a Khalil, I would have taken Ibn Abi Quhafah as a Khalil. But rather love and the brotherhood of faith' - saying that two or three times - 'Indeed your companion is the Khalil of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4023",
      "hadith_no": "4023",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن الصباح البزار، حدثنا سفيان بن عيينة، عن زائدة، عن عبد الملك بن عمير، عن ربعي، هو ابن حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتدوا باللذين من بعدي أبي بكر وعمر ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that the Messenger of Allah (ﷺ) said: \"Stick to the two after me, Abu Bakr and 'Umar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30244",
        "20005",
        "20320",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4024",
      "hadith_no": "4024",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، وغير، واحد، قالوا حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، نحوه وكان سفيان بن عيينة يدلس في هذا الحديث فربما ذكره عن زائدة عن عبد الملك بن عمير وربما لم يذكر فيه عن زائدة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفيه عن ابن مسعود ‏.‏ وروى سفيان الثوري هذا الحديث عن عبد الملك بن عمير عن مولى لربعي عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير هذا الوجه أيضا عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏ ورواه سالم الأنعمي كوفي عن ربعي بن حراش عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20005",
        "11368",
        "20005",
        "20320"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4169",
      "hadith_no": "4169",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن هلال، مولى ربعي عن ربعي بن حراش، عن حذيفة، قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ إني لا أدري ما قدر بقائي فيكم فاقتدوا باللذين من بعدي وأشار إلى أبي بكر وعمر واهتدوا بهدى عمار وما حدثكم ابن مسعود فصدقوه ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏ وروى إبراهيم بن سعد هذا الحديث عن سفيان الثوري عن عبد الملك بن عمير عن هلال مولى ربعي عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقد روى سالم المرادي كوفي عن عمرو بن هرم عن ربعي بن حراش عن حذيفة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4173",
      "hadith_no": "4173",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا أبو محياة، يحيى بن يعلى بن عطاء عن عبد الملك بن عمير، عن ابن أخي عبد الله بن سلام، قال لما أريد قتل عثمان جاء عبد الله بن سلام فقال له عثمان ما جاء بك قال جئت في نصرك ‏.‏ قال اخرج إلى الناس فاطردهم عني فإنك خارجا خير لي منك داخلا ‏.‏ فخرج عبد الله إلى الناس فقال أيها الناس إنه كان اسمي في الجاهلية فلان فسماني رسول الله صلى الله عليه وسلم عبد الله ونزلت في آيات من كتاب الله فنزلت في ‏:‏ ‏(‏ وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ‏)‏ ونزلت في ‏:‏ ‏(‏ قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب ‏)‏ إن لله سيفا مغمودا عنكم وإن الملائكة قد جاورتكم في بلدكم هذا الذي نزل فيه رسول الله صلى الله عليه وسلم فالله الله في هذا الرجل أن تقتلوه فوالله لئن قتلتموه لتطردن جيرانكم الملائكة ولتسلن سيف الله المغمود عنكم فلا يغمد عنكم إلى يوم القيامة ‏.‏ قالوا اقتلوا اليهودي واقتلوا عثمان ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث عبد الملك بن عمير ‏.‏ وقد روى شعيب بن صفوان هذا الحديث عن عبد الملك بن عمير فقال عن عمر بن محمد بن عبد الله بن سلام عن جده عبد الله بن سلام ‏.‏",
      "text_en": " Narrated 'Abdul-Malik bin 'Umair:                     from the nephew of 'Abdullah bin Salam who said: \"When they were about to kill 'Uthman, 'Abdullah bin Salam came and 'Uthman said to him: 'What did you come for?' He said: 'I came to assist you.' He said: 'Go to the people to repel their advances against me. For verily your going is better to me than your entering here.' So 'Abdullah went to the people and said: 'O you people! During Jahiliyyah I was named so-and-so, then the Messenger of Allah (ﷺ) named me 'Abdullah, and some Ayat from the Book of Allah were revealed about me. (The following) was revealed about me: \"A witness from among the Children of Isra'il has testified to something similar and believed while you rejected. Verily, Allah does not guide the wrongdoing people. (46:10)\" [And (the following) was revealed about me:] \"Sufficient as a witness between me and you is Allah, and those too who have knowledge of the Scripture. (13:43)\" Allah has sheathed the sword from you and the angels are your neighbors in this city of yours, the one in which the Revelation came to the Messenger of Allah (ﷺ). But by Allah! (Fear) Allah regarding this man; if you kill him, then by Allah! If you kill him, then you will cause the angels to remove your goodness from you, and to raise Allah's sheathed sword against you, such that it will never be sheathed again until the Day of Resurrection.'\" He said: \"They said: 'Kill the Jew and kill 'Uthman.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "11368"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4258",
      "hadith_no": "4258",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا معاوية بن عمرو، عن زائدة، عن عبد الملك بن عمير، عن موسى بن طلحة، قال ما رأيت أحدا أفصح من عائشة ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Musa bin Talhah:                     \"I have not seen anyone clearer (in speech) than 'Aishah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20389",
        "20320",
        "11368",
        "579"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4333",
      "hadith_no": "4333",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة خير من تميم وأسد وغطفان وبني عامر بن صعصعة ‏\"‏ ‏.‏ يمد بها صوته فقال القوم قد خابوا وخسروا ‏.‏ قال ‏\"‏ فهم خير منهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Bakrah:                     that the Messenger of Allah (ﷺ) said: \"Aslam, Ghifar, and Muzainah are better than Tamim, Asad, Ghatafan, and Banu 'Amir bin Sa'sa'ah,\" prolonging his voice when saying it. So the people said: \"They have been treacherous and have lost.\" He said: \"So these are better than them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-406",
      "hadith_no": "406",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا النفيلي، قال حدثنا زهير، قال حدثنا عبد الملك، عن عطاء، عن يعلى، أن رسول الله صلى الله عليه وسلم رأى رجلا يغتسل بالبراز فصعد المنبر فحمد الله وأثنى عليه وقال ‏‏\"‏‏ إن الله عز وجل حليم حيي ستير يحب الحياء والستر فإذا اغتسل أحدكم فليستتر ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Ya'la that the Messenger of Allah (ﷺ) saw a man performing Ghusl in an open place, so he ascended the Minbar and praised and glorified Allah, then he said:                      'Allah, the Mighty and Sublime, is forbearing, modest and concealing, and He loves modesty and concealment. When any one of you performs Ghusl, let him conceal himself.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30352",
        "20321",
        "11368",
        "11029",
        "20372"
      ]
    },
    {
      "id": "sunan-an-nasai-491",
      "hadith_no": "491",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، عن يحيى، عن عبد الملك، قال حدثنا سعيد بن جبير، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يصلي على دابته وهو مقبل من مكة إلى المدينة وفيه أنزلت ‏{‏ فأينما تولوا فثم وجه الله ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah (ﷺ) used to pray while on his animal when he was coming back from Makkah to Madinah. Concerning this, the verse was revealed: So wherever you turn (yourselves or your faces) there is the Face of Allah.'\" [1][1] Al-Baqarah 2:115.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30170",
        "20031",
        "11368",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-947",
      "hadith_no": "947",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال أنبأنا سفيان، عن عبد الملك بن عمير، عن شبيب أبي روح، عن رجل، من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه صلى صلاة الصبح فقرأ الروم فالتبس عليه فلما صلى قال ‏\"‏ ما بال أقوام يصلون معنا لا يحسنون الطهور فإنما يلبس علينا القرآن أولئك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shabib Abi Rawh, from a man among the companions of the Prophet (ﷺ), that:                     He prayed Subh and recited Ar-Rum, but he stumbled in his recitation. When he had finished praying he said: 'What is the matter with people who pray with us without purifying themselves properly? Those people make us stumble in reciting Quran.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11368"
      ]
    },
    {
      "id": "sunan-an-nasai-1003",
      "hadith_no": "1003",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا حماد بن إسماعيل بن إبراهيم ابن علية أبو الحسن، قال حدثنا أبي، عن داود الطائي، عن عبد الملك بن عمير، عن جابر بن سمرة، قال وقع ناس من أهل الكوفة في سعد عند عمر فقالوا والله ما يحسن الصلاة ‏.‏ فقال أما أنا فأصلي بهم صلاة رسول الله صلى الله عليه وسلم لا أخرم عنها أركد في الأوليين وأحذف في الأخريين ‏.‏ قال ذاك الظن بك ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"Some of the peole of Al-Khufah complained about Sa'd to 'Umar. They said: 'By Allah, he does not pray properly.' He said: 'I lead them in prayer as the Messenger of Allah (ﷺ) did, and I do not deviate from that. I take my time in the first two rak'ahs and make the other two shorter.' He (Umar) said: 'That is what I thought about you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "25086",
        "11368",
        "393"
      ]
    },
    {
      "id": "sunan-an-nasai-2421",
      "hadith_no": "2421",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم بأرنب قد شواها فوضعها بين يديه فأمسك رسول الله صلى الله عليه وسلم فلم يأكل وأمر القوم أن يأكلوا وأمسك الأعرابي فقال له النبي صلى الله عليه وسلم ‏\"‏ ما يمنعك أن تأكل ‏\"‏ ‏.‏ قال إني أصوم ثلاثة أيام من الشهر ‏.‏ قال ‏\"‏ إن كنت صائما فصم الغر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A Bedouin came to the Prophet with a rabbit that he had grilled it and placed it in front of him. The Messenger of Allah refrained from eating, but he told the people to eat. The Bedouin also refrained, and the Prophet said to him: 'What is keeping you from eating?' He said: 'I fast three days of the month.' He said: 'If you was to fast, fast the shining days.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20218",
        "20469",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2599",
      "hadith_no": "2599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال أنبأنا شعبة، عن عبد الملك، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسائل كدوح يكدح بها الرجل وجهه فمن شاء كدح وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو شيئا لا يجد منه بدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Samurah bin Jundab said:                     \"The Messenger of Allah said: \"Every time a man begs, it will turn into lacerations on his face (on the Day of Resurrection). So whoever wants his face to be lacerated (let him ask), and whoever does not want that (let him not ask): except in the case of a man who asks a Sultan, or he asks when he can find no alternative.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20020",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-2600",
      "hadith_no": "2600",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن عبد الملك، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المسألة كد يكد بها الرجل وجهه إلا أن يسأل الرجل سلطانا أو في أمر لا بد منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Samurah bin Jundab said:                     \"The Messenger of Allah said: 'Begging will be but lacerations on a man's face (on the Day of Resurrection). Unless he asks a man in authority or when he has no alternative.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-2806",
      "hadith_no": "2806",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عبد الملك، عن طاوس، عن سراقة بن مالك بن جعشم، أنه قال يا رسول الله أرأيت عمرتنا هذه لعامنا أم لأبد قال رسول الله صلى الله عليه وسلم ‏\"‏ هي لأبد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Surqah bin Malik bin Jushum said :                     \"O Messenger of Allah, do you think that this Umrah of ours is for this year only, or for all time?\" The Messenger of Allah said: \"It is for all time.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11368",
        "11053",
        "471"
      ]
    },
    {
      "id": "sunan-an-nasai-2915",
      "hadith_no": "2915",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا عبد الملك، عن عطاء، عن أسامة بن زيد، قال دخلت مع رسول الله صلى الله عليه وسلم البيت فجلس فحمد الله وأثنى عليه وكبر وهلل ثم مال إلى ما بين يديه من البيت فوضع صدره عليه وخده ويديه ثم كبر وهلل ودعا فعل ذلك بالأركان كلها ثم خرج فأقبل على القبلة وهو على الباب فقال ‏\"‏ هذه القبلة هذه القبلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated the Usmah bin Zaid said:                     \"I entered the House with the Messenger of Allah. He sat and praised Allah, and recited the Takbir, and the Tahlil. Then he went to the wall of the House that was in front of him, and placed his chest, cheek and hands on it, then he recited the Takbir, and the Tahlil, and supplicated. And he did that in all the corners, then he came out, and turned to face the Qiblah while he was in front of the door, and he said: 'This is the Qiblah, this is the Qiblah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11368",
        "11029",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-2916",
      "hadith_no": "2916",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن عبد الملك، عن عطاء، عن أسامة، قال خرج رسول الله صلى الله عليه وسلم من البيت صلى ركعتين في قبل الكعبة ثم قال ‏\"‏ هذه القبلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usmah said:                     \"The Messenger of Allah came out of the House and prayed two Rakahs in front of the Kabah, then he said: 'This is the Qiblah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11368",
        "11029",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-2994",
      "hadith_no": "2994",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا عبد الملك، عن عطاء، عن جابر، قال قدمنا مع رسول الله صلى الله عليه وسلم لأربع مضين من ذي الحجة فقال النبي صلى الله عليه وسلم ‏\"‏ أحلوا واجعلوها عمرة ‏\"‏ ‏.‏ فضاقت بذلك صدورنا وكبر علينا فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ يا أيها الناس أحلوا فلولا الهدى الذي معي لفعلت مثل الذي تفعلون ‏\"‏ ‏.‏ فأحللنا حتى وطئنا النساء وفعلنا ما يفعل الحلال حتى إذا كان يوم التروية وجعلنا مكة بظهر لبينا بالحج ‏.‏",
      "text_en": " It was narrated that Jabir said:                      \"We came with the Messenger of Allah on the fourth day of Dhul-Hijjah. The prophet said: 'Exit Ihram and make it Umrah.' We were distressed and upset by that. News of that reached the Messenger of Allah and he said: 'O people, exit Ihram. Were if not for the Hadi that I brought with me, I would have done what you are doing.' So we exited Ihram, and had intercourse with our wives, ad we did everything that the non-Muhrim does until the day of At-Tarwiyah, when we put Makkah behind us (When we headed for Mina) and entered Ihram for Hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3011",
      "hadith_no": "3011",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن هشيم، قال حدثنا عبد الملك، عن عطاء، قال قال أسامة بن زيد كنت رديف النبي صلى الله عليه وسلم بعرفات فرفع يديه يدعو فمالت به ناقته فسقط خطامها فتناول الخطام بإحدى يديه وهو رافع يده الأخرى ‏.‏",
      "text_en": " It was narrated that Usmah bin Zaid said:                     \"I was a companion rider with the Prophet at Arafat. He raised his hands in supplication, so his she-camel began leaning and he dropped he halter, so he tool the halter while one of his hand while he was raising the other hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11368",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-3195",
      "hadith_no": "3195",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن يحيى، قال حدثنا إسحاق بن منصور، قال حدثنا داود، - يعني الطائي - عن عبد الملك بن عمير، عن جبر، أنه دخل مع رسول الله صلى الله عليه وسلم على ميت فبكى النساء فقال جبر أتبكين ما دام رسول الله صلى الله عليه وسلم جالسا قال ‏\"‏ دعهن يبكين ما دام بينهن فإذا وجب فلا تبكين باكية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabr that he entered with the Messenger of Allah (ﷺ) upon someone who was dying, and the women were weeping. Jabr said:                      \"Are you weeping when the Messenger of Allah (ﷺ) is sitting here?\" He said: \"Let them weep so long as he is among them, but if he dies no one should weep for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "25086",
        "11368"
      ]
    },
    {
      "id": "sunan-an-nasai-3226",
      "hadith_no": "3226",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن عبد الملك، عن عطاء، عن جابر، أنه تزوج امرأة على عهد رسول الله صلى الله عليه وسلم فلقيه النبي صلى الله عليه وسلم فقال ‏\"‏ أتزوجت يا جابر ‏\"‏ ‏.‏ قال قلت نعم قال ‏\"‏ بكرا أم ثيبا ‏\"‏ ‏.‏ قال قلت بل ثيبا ‏.‏ قال ‏\"‏ فهلا بكرا تلاعبك ‏\"‏ ‏.‏ قال قلت يا رسول الله كن لي أخوات فخشيت أن تدخل بيني وبينهن ‏.‏ قال ‏\"‏ فذاك إذا إن المرأة تنكح على دينها ومالها وجمالها فعليك بذات الدين تربت يداك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     It was narrated from Jabir that he married a woman at the time of the Messenger of Allah, and the Prophet met him and said: \"Have you got married, O Jabir?\" He said: 'Yes.' He said: 'A virgin or a previously-married woman?' I said: 'A previously-married woman.' He said: 'Why not a virgin who would play with you?' I said: 'O Messenger of Allah, I have sisters, and I did not want her to come between them and I.' He said: 'That's better then. A woman may be married for her religious commitment, her wealth or her beauty. You should choose the one who is religiously committed, may your hands be rubbed with dust (may you prosper).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3430",
      "hadith_no": "3430",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عبد الملك بن عمير، عن عطية القرظي، قال كنت يوم حكم سعد في بني قريظة غلاما فشكوا في فلم يجدوني أنبت فاستبقيت فها أنا ذا بين أظهركم ‏.‏",
      "text_en": " It was narrated that 'Atiyyah Al-Qurazi said:                      \"On the day that Sa'd passed judgment on Banu Quraizah I was a young boy and they were not sure about me, but they did not find any pubic hair, so they let me live, and here I am among you.\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-an-nasai-3644",
      "hadith_no": "3644",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ دعا رسول الله صلى الله عليه وسلم قريشا فاجتمعوا فعم وخص فقال ‏\"‏ يا بني كعب بن لؤى يا بني مرة بن كعب يا بني عبد شمس ويا بني عبد مناف ويا بني هاشم ويا بني عبد المطلب أنقذوا أنفسكم من النار ويا فاطمة أنقذي نفسك من النار إني لا أملك لكم من الله شيئا غير أن لكم رحما سأبلها ببلالها ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"When the following was revealed: 'And warn your tribe (O Muhammad) of near kindred,' the Messenger of Allah called the Quraish and they gathered, and he spoke in general and specific terms, then he said: 'O Banu Ka'b bin Lu'ayy! O Banu Murrah bin Ka'b! O Banu 'Abd Shams! O Banu 'Abd Manaf! O Banu Hisham! O Banu 'Abdul-Muttalib! Save yourselves from the Fire! O Fatimah! Save yourself from the Fire. I cannot avail you anything before Allah, but I will uphold the ties of kinship with you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3797",
      "hadith_no": "3797",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، عن عبد الملك، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا نسمى السماسرة فأتانا رسول الله صلى الله عليه وسلم ونحن نبيع فسمانا باسم هو خير من اسمنا فقال ‏\"‏ يا معشر التجار إن هذا البيع يحضره الحلف والكذب فشوبوا بيعكم بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"At the time of the Messenger of Allah we used to be called Samasir (brokers). The Messenger of Allah came to us when we were selling and called us by a name that was better than that. He said: 'O merchants (Tujjar), this selling involves lies and (false) oaths, so mix some charity with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11368",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-3798",
      "hadith_no": "3798",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، عن سفيان، عن عبد الملك، وعاصم، وجامع، عن أبي وائل، عن قيس بن أبي غرزة، قال كنا نبيع بالبقيع فأتانا رسول الله صلى الله عليه وسلم وكنا نسمى السماسرة فقال ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فسمانا باسم هو خير من اسمنا ثم قال ‏\"‏ إن هذا البيع يحضره الحلف والكذب فشوبوه بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin Abi Gharazah said:                      \"We used to sell in Al-Baqi, and the Messenger of Allah came to us. We used to be called Samasir (brokers) but he said: 'O merchants!' And called us by a name that was better than our name. Then he said: 'This selling involves (false) oaths and lies, so mix some charity with it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11368",
        "11080",
        "11327",
        "11353",
        "11046"
      ]
    },
    {
      "id": "sunan-an-nasai-3871",
      "hadith_no": "3871",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، عن خالد، - وهو ابن الحارث - قال حدثنا شعبة، عن عبد الملك، عن مجاهد، قال حدث رافع بن خديج، قال خرج إلينا رسول الله صلى الله عليه وسلم فنهانا عن أمر كان لنا نافعا فقال ‏‏\"‏‏ من كان له أرض فليزرعها أو يمنحها أو يذرها ‏‏\"‏‏‏.‏‏",
      "text_en": " Rafi' bin Khadij said:                      \"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us. He said: 'Whoever has land, let him cultivate it or give it to someone else (to cultivate), or leave it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20226",
        "20020",
        "11368",
        "11028",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-3872",
      "hadith_no": "3872",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الرحمن بن خالد، قال حدثنا حجاج، قال حدثني شعبة، عن عبد الملك، عن عطاء، وطاوس، ومجاهد، عن رافع بن خديج، قال خرج إلينا رسول الله صلى الله عليه وسلم فنهانا عن أمر كان لنا نافعا وأمر رسول الله صلى الله عليه وسلم خير لنا قال ‏‏\"‏‏ من كان له أرض فليزرعها أو ليذرها أو ليمنحها ‏‏\"‏‏‏.‏‏ ومما يدل على أن طاوسا لم يسمع هذا الحديث",
      "text_en": " It was narrated from Tawus and Mujahid, that Rafi' bin Khadij said:                      \"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us, but the command of Messenger of Allah is better for us. He said: 'Whoever has land, let him cultivate it or leave it or give it (to someone else to cultivate).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20376",
        "20219",
        "20020",
        "11368",
        "11029",
        "11053",
        "11028",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-3874",
      "hadith_no": "3874",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "حدثنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، عن عطاء، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏‏\"‏‏ من كان له أرض فليزرعها فإن عجز أن يزرعها فليمنحها أخاه المسلم ولا يزرعها إياه ‏‏\"‏‏‏.‏‏",
      "text_en": " It was narrated from 'Ata' from Jabir, that the Messenger of Allah said:                      \"Whoever has land, let him cultivate it. If he is unable to cultivate it, let him give it to his Muslim brother and not share-crop it with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3875",
      "hadith_no": "3875",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا عبد الملك، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ من كانت له أرض فليزرعها أو ليمنحها أخاه ولا يكريها ‏‏\"‏‏‏.‏‏ تابعه عبد الرحمن بن عمرو الأوزاعي‏.‏‏",
      "text_en": " Jabir said:                      The Messenger of Allah said: \"Whoever has land, let him cultivate it or give it to his brother, and not lease it to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4310",
      "hadith_no": "4310",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن معمر البحراني، قال حدثنا حبان، - وهو ابن هلال قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال جاء أعرابي إلى النبي صلى الله عليه وسلم بأرنب قد شواها فوضعها بين يديه فأمسك رسول الله صلى الله عليه وسلم فلم يأكل وأمر القوم أن يأكلوا وأمسك الأعرابي فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما يمنعك أن تأكل ‏\"‏ ‏.‏ قال إني أصوم ثلاثة أيام من كل شهر ‏.‏ قال ‏\"‏ إن كنت صائما فصم الغر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A Bedouin brought a rabbit to the Messenger of Allah that he had grilled and placed it before him. The me4ssenger of Allah refrained form eating but he told the people to eat. The Bedouin also refrained from eating, and the Mesenger of Allah said to him: 'What is keeping you from eating?\" He said: 'I fast three days of e4ach month.\" He Said: 'If you are going to fast, then fast the bright days (Al-Ghurr).\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20218",
        "20469",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4393",
      "hadith_no": "4393",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى، عن عبد الملك، عن عطاء، عن جابر، قال كنا نتمتع مع النبي صلى الله عليه وسلم فنذبح البقرة عن سبعة ونشترك فيها ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"We would make Tamattu' when the Prophet was with us, and we would sacrifice a cow on behalf of seven people, sharing it among ourselves.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4954",
      "hadith_no": "4954",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "حدثنا سوار بن عبد الله بن سوار، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، ح وأنبأنا عبد الرحمن بن محمد بن سلام، قال أنبأنا إسحاق، - هو الأزرق - قال حدثنا به عبد الملك، عن عطاء، عن أيمن، مولى ابن الزبير - وقال خالد في حديثه مولى الزبير - عن تبيع عن كعب قال من توضأ فأحسن الوضوء ثم صلى - وقال عبد الرحمن فصلى العشاء الآخرة - ثم صلى بعدها أربع ركعات فأتم - وقال سوار يتم - ركوعهن وسجودهن ويعلم ما يقترئ - وقال سوار يقرأ - فيهن كن له بمنزلة ليلة القدر ‏.‏",
      "text_en": " It was narrated that Ka'b said:                     \"Whoever performs wudu and performs wudu, well, then prays ('Abdur-Rahman said: and prays Isha), then prays after that four Rakahs and does them well (Sawwar said: and understands what he is reciting (Sawwar said: and recites therein), they will be equivalent to (praying) Lailat Al-Qadr for him\". (Hasan Maqtu)",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "11368",
        "36587",
        "20411",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-4981",
      "hadith_no": "4981",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الملك بن عمير، عن عطية، أنه أخبره قال كنت في سبى قريظة وكان ينظر فمن خرج شعرته قتل ومن لم تخرج استحيي ولم يقتل ‏.‏",
      "text_en": " It was narrated that 'Atiyyah said:                     'I was among the prisoners of Quraizah; we were examined, and whoever had grown (pubic) hair was killed, and whoever had not grown hair, he was allowed to live and was not killed.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11368"
      ]
    },
    {
      "id": "sunan-an-nasai-5107",
      "hadith_no": "5107",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو علي، محمد بن يحيى المروزي قال حدثنا عبد الله بن عثمان، عن أبي حمزة، عن عبد الملك بن عمير، عن العريان بن الهيثم، عن قبيصة بن جابر، عن ابن مسعود، قال سمعت رسول الله صلى الله عليه وسلم يلعن المتنمصات والمتفلجات والموتشمات اللاتي يغيرن خلق الله عز وجل ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"I heard the Messenger of Allah [SAW] cursing Al-Mutanammisat, women who have their teeth separated, and women who have tattoos done, those who change the creation of Allah, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "20458",
        "11368",
        "15367",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5108",
      "hadith_no": "5108",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يحيى بن حماد، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن العريان بن الهيثم، عن قبيصة بن جابر، عن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يلعن المتنمصات والمتفلجات والموتشمات اللاتي يغيرن خلق الله عز وجل ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I heard the Messenger of Allah [SAW] cursing Al-Mutanammisat, women who have their teeth separated, and women who have tattoos done, those who change the creation of Allah, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20574",
        "20469",
        "11368",
        "15367",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5109",
      "hadith_no": "5109",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا علي بن الحسن بن شقيق، قال أنبأنا الحسين بن واقد، قال حدثنا عبد الملك بن عمير، عن العريان بن الهيثم، عن قبيصة بن جابر، عن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لعن الله المتنمصات والموتشمات والمتفلجات اللاتي يغيرن خلق الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I heard the Messenger of Allah [SAW] say: 'May Allah curse Al-Mutanammisat, women who have tattoos done and women who have their teeth separated, those who change the creation of Allah, Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30362",
        "20648",
        "11368",
        "15367",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5319",
      "hadith_no": "5319",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا العباس بن محمد، قال أنبأنا أبو نوح، قال حدثنا جرير بن حازم، عن عبد الملك بن عمير، عن إياد بن لقيط، عن أبي رمثة، قال خرج علينا رسول الله صلى الله عليه وسلم وعليه ثوبان أخضران ‏.‏",
      "text_en": " It was narrated that Abu Rimthah said:                     \"The Messenger of Allah [SAW] came out to us wearing two green garments.\"",
      "usc_msa_ref": "",
      "chain": [
        "11272",
        "11368",
        "10892"
      ]
    },
    {
      "id": "sunan-an-nasai-5406",
      "hadith_no": "5406",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، قال كتب أبي وكتبت له إلى عبيد الله بن أبي بكرة وهو قاضي سجستان أن لا، تحكم بين اثنين وأنت غضبان فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحكم أحد بين اثنين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abi Bakrah said:                     \"My father wrote to 'Ubaidullah bin Abi Bakrah - who was the judge of Sijistan - saying: 'Do not pass judgment between two people when you are angry, for I heard the Messenger of Allah [SAW] say: No one should pass judgment between two people when he is angry.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11368",
        "11294"
      ]
    },
    {
      "id": "sunan-an-nasai-5445",
      "hadith_no": "5445",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت مصعب بن سعد، عن أبيه، قال كان يعلمنا خمسا كان يقول كان رسول الله صلى الله عليه وسلم يدعو بهن ويقولهن ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abudl-Malik bin 'Umair said:                     \"I heard Mus'ab bin Sa'd (narrate) about his father: 'He used to tech us five things, which he said that the Messenger of Allah [SAW] used to recite in his supplication: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge in You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-5447",
      "hadith_no": "5447",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يحيى بن محمد، قال حدثنا حبان بن هلال، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عمرو بن ميمون الأودي، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المعلم الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏ فحدثت بها مصعبا فصدقه ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he said that the Messenger of Allah [SAW] used to seek refuge by means of them at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave.) So I narrated that to Mus'ab and he said that he told the truth.\"",
      "usc_msa_ref": "",
      "chain": [
        "20218",
        "20469",
        "11368",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5478",
      "hadith_no": "5478",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت مصعب بن سعد، قال كان سعد يعلمه هؤلاء الكلمات ويرويهن عن النبي صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " Mus'ab bin Sa'd said that :                     Sa'd used to teach him these words, narrating from the Prophet [SAW]: \"Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya wa 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge in You from the trials of this world and the torment of the grave.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11368",
        "10556"
      ]
    },
    {
      "id": "sunan-an-nasai-5479",
      "hadith_no": "5479",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن إسرائيل، عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون الأودي، قالا كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن في دبر كل صلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mus'ab bin Sa'd and 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he would say that the Messenger of Allah [SAW] used to seek refuge (with Allah) with these words at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika mnal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge with You from the trials of this life and the torment of the grave.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "28464",
        "11201",
        "20311",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5496",
      "hadith_no": "5496",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، عن عبد الملك بن عمير، قال سمعت مصعب بن سعد، عن أبيه، قال كان يعلمنا خمسا كان رسول الله صلى الله عليه وسلم يدعو بهن ويقول ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin 'Umair said:                     \"I heard Mus'ab bin Sa'd say, concerning his father: 'He used to teach us five things that the Messenger of Allah [SAW] used to recite in his supplication, and say: \"Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge in You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the torment of the grave.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-5649",
      "hadith_no": "5649",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سوار بن عبد الله بن سوار، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، قال حدثنا أبو الزبير، عن جابر، رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن الدباء والنقير والجر والمزفت ‏.‏",
      "text_en": " It was narrated from Jabir that:                     The Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), An-Naqir, earthenware jars, and Al-Muzaffat.",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "11368",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-5733",
      "hadith_no": "5733",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن عبد الملك، عن عطاء، في العصير قال اشربه حتى يغلي ‏.‏",
      "text_en": " It was narrated from 'Ata' that :                     He said, concerning juice: \"Drink it unless it is bubbling.\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "11368"
      ]
    },
    {
      "id": "sunan-ibn-majah-102",
      "hadith_no": "102",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا مؤمل، قالا حدثنا سفيان، عن عبد الملك بن عمير، عن مولى، لربعي بن حراش عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لا أدري قدر بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Yaman said:                     \"The Messenger of Allah said: 'I do not know howlong I will stay among you, so follow the example of these two after I am gone,' and he pointed to Abu Bakr and 'Umar.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "30160",
        "30180",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-208",
      "hadith_no": "208",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، حدثنا عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من سن سنة حسنة فعمل بها كان له أجرها ومثل أجر من عمل بها لا ينقص من أجورهم شيئا ومن سن سنة سيئة فعمل بها كان عليه وزرها ووزر من عمل بها من بعده لا ينقص من أوزارهم شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mundhir bin Jarir that his father said:                     \"The Messenger of Allah said: 'Whoever introduces a good practice that is followed, he will receive its reward and a reward equivalent to that of those who follow it, without that detracting from their reward in their slightest. And whoever introduces a bad practice that is followed, he will receive its sin and a burden of sin equivalent to that of those who follow it, without that detracting from their burden in the slightest.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "10831"
      ]
    },
    {
      "id": "sunan-ibn-majah-585",
      "hadith_no": "585",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يحيى بن يوسف الزمي، ح وحدثنا أحمد بن عثمان بن حكيم، حدثنا سليمان بن عبيد الله الرقي، قالا حدثنا عبيد الله بن عمرو، عن عبد الملك بن عمير، عن جابر بن سمرة، قال سأل رجل النبي  صلى الله عليه وسلم  يصلي في الثوب الذي يأتي فيه أهله قال ‏\"‏ نعم إلا أن يرى فيه شيئا فيغسله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"A man asked the Prophet whether he could perform prayer in a garment in which he had intercourse with his wife. He said: 'Yes, unless he sees something on it, in which case he should wash it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30282",
        "30185",
        "30024",
        "11368",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-1307",
      "hadith_no": "1307",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن يعلى التيمي، عن عبد الملك بن عمير، عن قزعة، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا صلاة بعد العصر حتى تغرب الشمس ولا صلاة بعد الفجر حتى تطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)said:                     “There is no prayer after the ‘Asr until the sun has set, andthere is no prayer after the Fajr until the sun has risen.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11368",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1792",
      "hadith_no": "1792",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن يعلى التيمي، عن عبد الملك بن عمير، عن قزعة، عن أبي سعيد، عن رسول الله  صلى الله عليه وسلم  أنه نهى عن صوم يوم الفطر ويوم الأضحى ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that:                      The Messenger of Allah (ﷺ)forbadefasting on the Day of Fitr and the Day of Adha.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11368",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1814",
      "hadith_no": "1814",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن محمد بن المنتشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال أى الصيام أفضل بعد شهر رمضان قال ‏\"‏ شهر الله الذي تدعونه المحرم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A man came to the Prophet(ﷺ)and said: ‘Which fasting is better after the month of Ramadan?’He said: ‘The month of Allah which is called Muharram.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11388",
        "11280",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1818",
      "hadith_no": "1818",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن ابن أبي ليلى، وخالي، يعلى عن عبد الملك، وأبو معاوية عن حجاج، كلهم عن عطاء، عن زيد بن خالد الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من فطر صائما كان له مثل أجرهم من غير أن ينقص من أجورهم شيئا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Zaid bin Khalid Al-Juhani that the Messenger ofAllah(ﷺ) said:                      “Whoever gives food for a fasting person to breakhisfast, he will have a reward like theirs, without that detractingfromtheir reward in the slightest.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11196",
        "11368",
        "20354",
        "20219",
        "11029",
        "3625"
      ]
    },
    {
      "id": "sunan-ibn-majah-1933",
      "hadith_no": "1933",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة بن سليمان، عن عبد الملك، عن عطاء، عن جابر بن عبد الله، قال تزوجت امرأة على عهد رسول الله  صلى الله عليه وسلم  فلقيت رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ أتزوجت يا جابر ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ أبكرا أو ثيبا ‏\"‏ ‏.‏ قلت ثيبا ‏.‏ قال ‏\"‏ فهلا بكرا تلاعبها ‏\"‏ ‏.‏ قلت كن لي أخوات فخشيت أن تدخل بيني وبينهن ‏.‏ قال ‏\"‏ فذاك إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Jabir bin Abdullah said: “I married a woman during the time of the Prophet and he said: 'Have you got married, O Jabir?' I said: 'Yes'. He said: 'To a virgin or to a previously-married woman?' I said: 'A previously married woman.' He said: 'Why not a virgin so you could play with her?' I said: 'I have sisters and did not want her to create trouble between them and me.' He said: 'That is better then.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2198",
      "hadith_no": "2198",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، أن رجلا، من المسلمين رأى في النوم أنه لقي رجلا من أهل الكتاب فقال نعم القوم أنتم لولا أنكم تشركون تقولون ما شاء الله وشاء محمد ‏.‏ وذكر ذلك للنبي  صلى الله عليه وسلم  فقال ‏\"‏ أما والله إن كنت لأعرفها لكم قولوا ما شاء الله ثم شاء محمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that :                     a Muslim man saw in a dream that he met a man from among the People of the Book, who said: \"What good people you would be if only you were not committing Shirk. For you say: 'What Allah  wills and Muhammad wills.\"' He mentioned that to the Prophet (ﷺ) and he said: \"By Allah, I am aware of that. Say: 'What Allah wills then what Muhammad wills.\"'Another chain from Tufail bin Sakhbarah, the brother of 'Aishah by her mother, from the Prophet (ﷺ), with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-2199",
      "hadith_no": "2199",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك، عن ربعي بن حراش، عن الطفيل بن سخبرة، أخي عائشة لأمها عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "id": "sunan-ibn-majah-2316-2",
      "hadith_no": "2316",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن عبد الله بن يزيد، وأحمد بن ثابت الجحدري، قالوا حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، أنه سمع عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقضي القاضي بين اثنين وهو غضبان ‏\"‏ ‏.‏ قال هشام لا ينبغي للحاكم أن يقضي بين اثنين وهو غضبان ‏.‏",
      "text_en": " It was narrated from 'Abdul-Malik bin 'Umair that he heard 'Abdur-Rahman bin Abu Bakrah (narrate) from his father that the Messenger of Allah (ﷺ) said:                     “Let the judge (Qadi) not pass a judgment when he is angry.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "34002",
        "20005",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-ibn-majah-2363-2",
      "hadith_no": "2363",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا جرير، عن عبد الملك بن عمير، عن جابر بن سمرة، قال خطبنا عمر بن الخطاب بالجابية فقال إن رسول الله صلى الله عليه وسلم قام فينا مثل مقامي فيكم فقال ‏\"‏ احفظوني في أصحابي ثم الذين يلونهم ثم الذين يلونهم ثم يفشو الكذب حتى يشهد الرجل وما يستشهد ويحلف وما يستحلف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     'Umar bin Khattab addressed us at Jabiyah and said: “The Messenger of Allah (ﷺ)  stood up among us as I stand among you, and said: 'Honor my Companions for my sake, then those who come after them, then those who come after them. Then lying will prevail until a man will give testimony without being asked to do so, and he will swear an oath without being asked to do so.' ”",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-2513",
      "hadith_no": "2513",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت ربعي بن حراش، يحدث عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فقيل له ما عملت - فإما ذكر أو ذكر - قال إني كنت أتجوز في السكة والنقد وأنظر المعسر ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Prophet (ﷺ) said:                     “A man died and it was said to him: 'What did you do?' Either he remembered or was reminded and said: 'I used to be easy going in coins and cash collecting debts due, and I used to give respite to (the debtor) who was in difficulty. So, Allah (SWT) forgave him.' ” Abu Masud said: “I heard that from the Messenger of Allah (ﷺ).”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-2584",
      "hadith_no": "2584",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا إسماعيل بن إبراهيم بن مهاجر، عن عبد الملك بن عمير، عن سعيد بن حريث، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من باع دارا أو عقارا فلم يجعل ثمنه في مثله كان قمنا أن لا يبارك فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Huraith  said:                     “I heard the Messenger of Allah (ﷺ) said: 'Whoever sells a house or property and does not use the money for something similar, deserves not to be blessed therein.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20208",
        "11368"
      ]
    },
    {
      "id": "sunan-ibn-majah-2585",
      "hadith_no": "2585",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبيد الله بن عبد المجيد، حدثني إسماعيل بن إبراهيم بن مهاجر، عن عبد الملك بن عمير، عن عمرو بن حريث، عن أخيه، سعيد بن حريث عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20208",
        "11368",
        "5202",
        "5061"
      ]
    },
    {
      "id": "sunan-ibn-majah-2589",
      "hadith_no": "2589",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أنبأنا عبد الملك، عن عطاء، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بشفعة جاره ينتظر بها إن كان غائبا إذا كان طريقهما واحدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that the Messenger of Allah (ﷺ) said:                     “The neighbor has more right to preemption of his neighbor, so let him wait for him even if he is absent, if they share a path.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20468",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2638",
      "hadith_no": "2638",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، قال سمعت عطية القرظي، يقول عرضنا على رسول الله صلى الله عليه وسلم يوم قريظة فكان من أنبت قتل ومن لم ينبت خلي سبيله فكنت فيمن لم ينبت فخلي سبيلي ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin`Umair said:                     “I heard 'Atiyyah Al-Quazi say: 'We were presented to the Messenger of Allah (ﷺ) on the Day of Quraizah. Those whose public hair had grown were killed, and those whose public hair had not yet grown were let go. I was one of those whose pubic hair had not yet grown, so I was let go.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-ibn-majah-2639",
      "hadith_no": "2639",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن عبد الملك بن عمير، قال سمعت عطية القرظي، يقول فها أنا ذا، بين أظهركم ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin 'Umair said:                     “I heard 'Atiyyah Al-Qurazi say: Here I am still among you,' ”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-ibn-majah-2790",
      "hadith_no": "2790",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن رفاعة بن شداد القتباني، قال لولا كلمة سمعتها من، عمرو بن الحمق الخزاعي لمشيت فيما بين رأس المختار وجسده سمعته يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أمن رجلا على دمه فقتله فإنه يحمل لواء غدر يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Shaddad Al-Qitbani said:                     “Were it not for a word that I heard from 'Amr bin Hamiq Khuza'i, I would have separated the head of Al-Mukhtar from his body. I heard him saying: “The Messenger of Allah (ﷺ) said: 'If a man trusts someone with his life then he kills him, he will carry a banner of treachery on the day of Resurrection.'”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "15146"
      ]
    },
    {
      "id": "sunan-ibn-majah-3483",
      "hadith_no": "3483",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا عثمان بن عبد الرحمن، عن علي بن عروة، عن عبد الملك، عن عطاء، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من السنة أن يخرج الرجل مع ضيفه إلى باب الدار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “It is the Sunnah for a man to go out with his guest to the doorofthe house.’”",
      "usc_msa_ref": "",
      "chain": [
        "38412",
        "28389",
        "11368",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3581",
      "hadith_no": "3581",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن عبد الملك بن عمير، سمع عمرو بن حريث، يقول سمعت سعيد بن زيد بن عمرو بن نفيل، يحدث عن النبي  صلى الله عليه وسلم  أن ‏\"‏ الكمأة من المن الذي أنزل الله على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " ‘Amrbin Huraith said:                      “I heard Sa’eed bin Zaid bin ‘Amr bin Nufailnarrating from the Prophet (ﷺ) that: ‘Truffles are a type ofmannathat Allah sent down to the Children of Israel, and their wateris ahealing for eye (diseases).’”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "sunan-ibn-majah-3705",
      "hadith_no": "3705",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شريك، عن عبد الملك بن عمير، عن حصين بن قبيصة، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا سفيان بن سهل لا تسبل فإن الله لا يحب المسبلين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Mughirah bin Shu’bah that the Messenger of Allah(ﷺ) said:                      “O Sufyan bin Sahl, do not let your garment hang, forAllah does not like those who let their garments hang below theankles.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20587",
        "11368",
        "15100",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-3745-2",
      "hadith_no": "3745",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن شيبان، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"One who is consulted is entrusted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20365",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3757-2",
      "hadith_no": "3757",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أصدق كلمة قالها الشاعر كلمة لبيد ألا كل شىء ما خلا الله باطل وكاد أمية بن أبي الصلت أن يسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"The truest of wods spoken by the poet are the words of Labid: Everything except Allah is false.' And Abu Umayyah bin Abu Salt nearly accepted Islam.\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3771-2",
      "hadith_no": "3771",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن عبد الملك، عن أبي الزبير، عن جابر، قال أمرنا رسول الله  صلى الله عليه وسلم  ونهانا فأمرنا أن نطفئ سراجنا ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah(ﷺ) commanded us (to do some things) and forbade us (to do some things), and he commanded us to extinguish our lamps.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "11368",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3880",
      "hadith_no": "3880",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان رسول الله  صلى الله عليه وسلم  إذا انتبه من الليل قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      “Whenever the Messenger of Allah (ﷺ) woke up in the morning, he would say: ‘Al-hamdu lillahil-ladhi ahyana ba’dama amatana wa ilayhi’n-nushur (Praise is to Allah Who has given us life after taking it from us, and unto Him is the Resurrection).’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-4230",
      "hadith_no": "4230",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن جابر بن سمرة، عن نافع بن عتبة بن أبي وقاص، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ستقاتلون جزيرة العرب فيفتحها الله ثم تقاتلون الروم فيفتحها الله ثم تقاتلون الدجال فيفتحها الله ‏\"‏ ‏.‏ قال جابر فما يخرج الدجال حتى تفتح الروم ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah, that Nafi' bin 'Utbah bin AbuWaqqas narrated that the Prophet (ﷺ) said:                      \"You will fight theArabian Peninsula and victory will be granted by Allah. Then you willfight the Romans and victory will be granted (by Allah). Then youwill fight Dajjal and victory will be granted (by Allah).\"Jabir said: \"Dajjal will not appear until you have fought the Romans.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "393"
      ]
    }
  ],
  "total_hadiths": 207
}