{
  "id": "11363",
  "name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
  "full_name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "79",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hadhli",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [
    {
      "id": "11648",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20360",
      "name": "Ma'n bin 'Abdur Rahman bin 'Abdullah معن بن عبد الرحمن بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "485",
      "name": "Ash'uth bin Qays ( الأشعث بن قيس بن معدي كرب الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1820",
      "name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11648",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20360",
      "name": "Ma'n bin 'Abdur Rahman bin 'Abdullah معن بن عبد الرحمن بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10754",
      "name": "al-Hasan bin Sa'd bin Ma'bad الحسن بن سعد بن معبد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "24397",
      "name": "Muhammad bin Dhkwan محمد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3333",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا سماك، حدثني عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال لعن رسول الله صلى الله عليه وسلم آكل الربا وموكله وشاهده وكاتبه ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) cursed the one who accepted usury, the one who paid it, the witness to it, and the one who recorded it.",
      "chain": [
        "30184",
        "20321",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "5117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا سماك بن حرب، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال من نصر قومه على غير الحق فهو كالبعير الذي ردي فهو ينزع بذنبه ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     If anyone helps  his people in an unrighteous cause, he is like  a camel which falls into a well and is pulled out by its tail.",
      "chain": [
        "30352",
        "20321",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "1206",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن سماك بن حرب، عن عبد الرحمن بن عبد الله بن مسعود، عن ابن مسعود، قال لعن رسول الله صلى الله عليه وسلم آكل الربا وموكله وشاهديه وكاتبه ‏.‏ قال وفي الباب عن عمر وعلي وجابر وأبي جحيفة ‏.‏ قال أبو عيسى حديث عبد الله حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Mas'ud narrated:                      \"The Messenger of Allah (ﷺ) cursed the one who consumed Riba, and the one who charged it, those who witnessed it, and the one who recorded it.\"He said: There are narrations on this topic from 'Umar, 'Ali, Jabir [and Abu Juhaifah].The Hadith of 'Abdullah (bin Mas'ud) is a Hasan Sahih Hadith.",
      "chain": [
        "30367",
        "20469",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "2190",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن بديل بن قريش اليامي الكوفي، حدثنا محمد بن فضيل، حدثنا عبد الرحمن بن إسحاق، عن القاسم بن عبد الرحمن، هو ابن عبد الله بن مسعود عن أبيه، عن ابن مسعود، قال حدث رسول الله صلى الله عليه وسلم عن ليلة، أسري به أنه لم يمر على ملإ من الملائكة إلا أمروه أن مر أمتك بالحجامة ‏.‏ قال أبو عيسى وهذا حديث حسن غريب من حديث ابن مسعود ‏.‏",
      "text_en": " Ibn Mas'ud said:                     \"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"",
      "chain": [
        "35000",
        "20356",
        "11876",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "2257",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن سماك بن حرب، قال سمعت عبد الرحمن بن عبد الله بن مسعود، يحدث عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنكم منصورون ومصيبون ومفتوح لكم فمن أدرك ذلك منكم فليتق الله وليأمر بالمعروف ولينه عن المنكر ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Mas'ud narrated from his father, that he heard the Messenger of Allah(s.a.w) said:                     \"Indeed you shall be aided, capturing, and victorious; so whoever among you sees that, then let him have Taqwa of Allah, and let him command the good and forbid the evil, and whoever lies about me on purpose, then let him take his seat in the Fire.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "2634",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا عبد الحكيم بن منصور الواسطي، عن عبد الملك بن عمير، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قتال المسلم أخاه كفر وسبابه فسوق ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح ‏.‏ وقد روي عن عبد الله بن مسعود من غير وجه ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"A Muslim's fighting his brother is disbelief, and verbally abusing him is disobedience.\"",
      "chain": [
        "30448",
        "11368",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "2657",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن سماك بن حرب، قال سمعت عبد الرحمن بن عبد الله بن مسعود، يحدث عن أبيه، قال قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ نضر الله امرأ سمع منا شيئا فبلغه كما سمع فرب مبلغ أوعى من سامع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه عبد الملك بن عمير عن عبد الرحمن بن عبد الله ‏.‏",
      "text_en": " Narrated Simak bin Hard:                     \"I heard 'Abdur-Rahman bin 'Abdullah bin Mas'ud narrating from his father who said: 'I heard the Messenger of Allah (ﷺ) saying: 'May Allah gladden a man who hears something from us, so he conveys it as he heard it. Perhaps the one it is conveyed to is more understanding than the one who heard it.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "2658",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن عبد الله بن مسعود، يحدث عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ نضر الله امرأ سمع مقالتي فوعاها وحفظها وبلغها فرب حامل فقه إلى من هو أفقه منه ‏.‏ ثلاث لا يغل عليهن قلب مسلم إخلاص العمل لله ومناصحة أئمة المسلمين ولزوم جماعتهم فإن الدعوة تحيط من ورائهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdul-Malik bin 'Umair:                     from 'Abdur-Rahman bin 'Abdullah bin Mas'ud that he narrated from his father, from the Prophet (ﷺ) who said: \"May Allah beautify a man who hears a saying of mine, so he understands it, remembers it, and conveys it. Perhaps he carries the Fiqh to one who has more understanding than him. There are three with which the heart of a Muslim shall not be deceived. Sincerity in deeds for Allah, giving Nasihah to the A'immah of Muslims, and sticking to the Jama'ah. For indeed the call is protected from behind them.\"",
      "chain": [
        "30421",
        "20005",
        "11368",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "31",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وعبد الله بن عامر بن زرارة، وإسماعيل بن موسى، قالوا حدثنا شريك، عن سماك، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Abdullah bin Mas'ud that his father said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever tells lies about me deliberately, let him take his place in Hell.\"",
      "chain": [
        "30201",
        "30547",
        "30467",
        "35016",
        "20587",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "2975",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا عبد الله بن عثمان بن خثيم، عن القاسم بن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، عن جده عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ سيلي أموركم بعدي رجال يطفئون السنة ويعملون بالبدعة ويؤخرون الصلاة عن مواقيتها ‏\"‏ فقلت يا رسول الله إن أدركتهم كيف أفعل قال ‏\"‏ تسألني يا ابن أم عبد كيف تفعل لا طاعة لمن عصى الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Among those in charge of you, after I am gone, will be men whoextinguish the Sunnah and follow innovation. They will delay theprayer from its proper time.” I said: “O Messenger of Allah, if Iliveto see them, what should I do?” He said: “You ask me, O Ibn‘Abd, whatyou should do? There is no obedience to one who disobeysAllah.”",
      "chain": [
        "30547",
        "20204",
        "30288",
        "20736",
        "10644",
        "11648",
        "11363",
        "16"
      ]
    }
  ],
  "total_hadiths": 10
}