{
  "id": "11360",
  "name": "'Abdullah bin Sakhbara al-Azdi عبد الله بن سخبرة الأزدي أبو معمر",
  "full_name": "'Abdullah bin Sakhbara al-Azdi عبد الله بن سخبرة الأزدي أبو معمر",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "149",
      "name": "Khabbab ibn al-Aratt ( خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10750",
      "name": "Tmym bin Salmah تميم بن سلمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11405",
      "name": "Yazid bin Sharayk bin Tariq يزيد بن شريك بن طارق التيمي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "746",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلنا لخباب أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا بم كنتم تعرفون ذاك قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     We asked Khabbab whether Allah's Apostle used to recite (the Qur'an) in the Zuhr and the `Asr prayers. He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "760",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، حدثني عمارة، عن أبي معمر، قال سألنا خبابا أكان النبي صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا بأى شىء كنتم تعرفون قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     I asked Khabbab whether the Prophet used to recite the Qur'an in the Zuhr and the `Asr prayers. He replied in the affirmative. We said, \"How did you come to know that?\" He said, \"From the movement of his beard.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11379",
        "11360"
      ]
    },
    {
      "hadith_no": "761",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلت لخباب بن الأرت أكان النبي صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قال قلت بأى شىء كنتم تعلمون قراءته قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     I asked Khabbab bin Al-Art whether the Prophet used to recite the Qur'an in the Zuhr and the `Asr prayers. He replied in the affirmative. I said, \"How did you come to know that?\" He replied, \"From the movement of his beard.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "777",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قلت لخباب أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا من أين علمت قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     We said to Khabbab \"Did Allah's Apostle used to recite in Zuhr and `Asr prayers?\" He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة، وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود في يده وجعل يقول ‏{‏جاء الحق وزهق الباطل‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet entered Mecca and (at that time) there were three hundred-and-sixty idols around the Ka`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has come and Falsehood (disbelief) has vanished.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال انشق القمر على عهد رسول الله صلى الله عليه وسلم شقتين فقال النبي صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     During the lifetime of the Prophet the moon was split into two parts and on that the Prophet said, \"Bear witness (to thus).",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3917",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن إبراهيم، عن أبي معمر، عن عبد الله  رضى الله عنه  قال انشق القمر ونحن مع النبي صلى الله عليه وسلم بمنى فقال ‏\"‏ اشهدوا ‏\"‏‏.‏ وذهبت فرقة نحو الجبل وقال أبو الضحى عن مسروق عن عبد الله انشق بمكة‏.‏ وتابعه محمد بن مسلم عن ابن أبي نجيح عن مجاهد عن أبي معمر عن عبد الله‏.‏",
      "text_en": " Narrated `Abdullah:                     The moon was split ( into two pieces ) while we were with the Prophet in Mina. He said, \"Be witnesses.\" Then a Piece of the moon went towards the mountain.",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3919",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا إبراهيم، عن أبي معمر، عن عبد الله  رضى الله عنه  قال انشق القمر‏.‏",
      "text_en": " Narrated `Abdullah:                     The moon was split (into two pieces).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة يوم الفتح وحول البيت ستون وثلاثمائة نصب، فجعل يطعنها بعود في يده ويقول ‏\"‏ جاء الحق وزهق الباطل، جاء الحق، وما يبدئ الباطل وما يعيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Prophet entered Mecca on the day of the Conquest, there were 360 idols around the Ka`ba. The Prophet started striking them with a stick he had in his hand and was saying, \"Truth has come and Falsehood will neither start nor will it reappear.",
      "chain": [
        "30343",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4761",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عمرو بن علي، حدثنا يحيى، حدثنا سفيان، حدثني سليمان، عن إبراهيم، عن أبي معمر، عن عبد الله، ‏{‏إلى ربهم الوسيلة‏}‏ قال كان ناس من الإنس يعبدون ناسا من الجن، فأسلم الجن، وتمسك هؤلاء بدينهم‏.‏ زاد الأشجعي عن سفيان عن الأعمش‏.‏ ‏{‏قل ادعوا الذين زعمتم‏}‏",
      "text_en": " Narrated `Abdullah:                     Regarding the explanation of the Verse: 'Those whom they call upon (worship) (like Jesus the Son of Mary, angels etc.) desire (for themselves) means of access to their Lord (Allah) as to which of them should be the nearer and they hope for His Mercy and fear His torment.' (17.57) They themselves (e.g. Angels, saints, Apostles, Jesus, etc.,) worshipped Allah, Those Jinns who were worshipped by some Arabs became Muslims (embraced Islam), but those human beings stuck to their (old) religion. Al- A`mash said extra: 'Say, (O Muhammad): Call unto those besides Him whom you assume (to be gods).' (17.56)",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11060",
        "11051",
        "11360",
        "20012"
      ]
    },
    {
      "hadith_no": "4762",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن أبي معمر، عن عبد الله  رضى الله عنه  في هذه الآية ‏{‏الذين يدعون يبتغون إلى ربهم الوسيلة‏}‏ قال ناس من الجن ‏{‏كانوا‏}‏ يعبدون فأسلموا‏.‏",
      "text_en": " Narrated `Abdullah:                     Regarding the Verse: 'Those whom they call upon (worship) (like Jesus the Son of Mary or angels etc.) desire (for themselves) means of access, to their Lord....' (17.57) (It was revealed regarding) some Jinns who used to be worshipped (by human beings). They later embraced Islam (while those people kept on worshipping them).",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4767",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة وحول البيت ستون وثلاثمائة نصب فجعل يطعنها بعود في يده ويقول ‏{‏جاء الحق وزهق الباطل إن الباطل كان زهوقا‏}‏ ‏{‏جاء الحق وما يبدئ الباطل وما يعيد‏}‏",
      "text_en": " Narrated `Abdullah bin Masud:                     Allah's Apostle entered Mecca (in the year of the Conquest) and there were three-hundred and sixty idols around the Ka`ba. He then started hitting them with a stick in his hand and say: 'Truth (i.e. Islam) has come and falsehood (disbelief) vanished. Truly falsehood (disbelief) is ever bound to vanish.' (17.81) 'Truth has come and falsehood (Iblis) can not create anything.' (34.49)",
      "chain": [
        "30418",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4864",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا يزيد بن زريع، عن روح بن القاسم، عن منصور، عن مجاهد، عن أبي معمر، عن ابن مسعود، ‏{‏وما كنتم تستترون أن يشهد، عليكم سمعكم‏}‏ الآية كان رجلان من قريش وختن لهما من ثقيف، أو رجلان من ثقيف وختن لهما من قريش في بيت فقال بعضهم لبعض أترون أن الله يسمع حديثنا قال بعضهم يسمع بعضه‏.‏ وقال بعضهم لئن كان يسمع بعضه لقد يسمع كله‏.‏ فأنزلت ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم‏}‏ الآية ‏{‏وذلكم ظنكم‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     (regarding) the Verse: 'And you have not been screening against yourself lest your ears, and your eyes and your skins should testify against you..' (41.22) While two persons from Quraish and their brotherin- law from Thaqif (or two persons from Thaqif and their brother-in-law from Quraish) were in a house, they said to each other, \"Do you think that Allah hears our talks?\" Some said, \"He hears a portion thereof\" Others said, \"If He can hear a portion of it, He can hear all of it.\" Then the following Verse was revealed: 'And you have not been screening against yourself lest your ears, and your eyes and your skins should testify against you...' (41.22)",
      "chain": [
        "30140",
        "20304",
        "11586",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "4865",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا منصور، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال اجتمع عند البيت قرشيان وثقفي  أو ثقفيان وقرشي  كثيرة شحم بطونهم قليلة فقه قلوبهم فقال أحدهم أترون أن الله يسمع ما نقول قال الآخر يسمع إن جهرنا ولا يسمع إن أخفينا‏.‏ وقال الآخر إن كان يسمع إذا جهرنا فإنه يسمع إذا أخفينا فأنزل الله عز وجل ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم‏}‏ الآية‏.‏ وكان سفيان يحدثنا بهذا فيقول حدثنا منصور أو ابن أبي نجيح أو حميد أحدهم أو اثنان منهم، ثم ثبت على منصور، وترك ذلك مرارا غير واحدة‏.‏",
      "text_en": " Narrated `Abdullah:                     There gathered near the House (i.e. the Ka`ba) two Quraishi persons and a person from Thaqif (or two persons from Thaqif and one from Quraish), and all of them with very fat bellies but very little intelligence. One of them said, \"Do you think that Allah hears what we say?\" Another said, \"He hears us when we talk in a loud voice, but He doesn't hear us when we talk in a low tone.\" The third said, \"If He can hear when we talk in a loud tone, then He can also hear when we speak in a low tone.\" Then Allah, the Honorable, the Majestic revealed: 'And you have not been screening against yourself lest your ears, and eyes and your skins should testify against you....' (41.22-23)",
      "chain": [
        "30418",
        "20005",
        "11067",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4866",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان الثوري، قال حدثني منصور، عن مجاهد، عن أبي معمر، عن عبد الله، بنحوه‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     (As above, Hadith No. 341).",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "4913",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، وسفيان، عن الأعمش، عن إبراهيم، عن أبي معمر، عن ابن مسعود، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم فرقتين، فرقة فوق الجبل وفرقة دونه فقال رسول الله صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Masud:                     During the lifetime of Allah's Apostle the moon was split into two parts; one part remained over the mountain, and the other part went beyond the mountain. On that, Allah's Apostle said, \"Witness this miracle.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "20005",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4914",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي، حدثنا سفيان، أخبرنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله، قال انشق القمر ونحن مع النبي صلى الله عليه وسلم فصار فرقتين، فقال لنا ‏\"‏ اشهدوا، اشهدوا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The moon was cleft asunder while we were in the company of the Prophet, and it became two parts. The Prophet said, Witness, witness (this miracle).",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7615",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا منصور، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال اجتمع عند البيت ثقفيان وقرشي، أو قرشيان وثقفي، كثيرة شحم بطونهم قليلة فقه قلوبهم فقال أحدهم أترون أن الله يسمع ما نقول قال الآخر يسمع إن جهرنا ولا يسمع إن أخفينا وقال الآخر إن كان يسمع إذا جهرنا فإنه يسمع إذا أخفينا‏.‏ فأنزل الله تعالى ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah:                     Two person of Bani Thaqif and one from Quarish (or two persons from Quraish and one from Bani Thaqif) who had fat bellies but little wisdom, met near the Ka`ba. One of them said, \"Did you see that Allah hears what we say? \" The other said, \"He hears us if we speak aloud, but He does not hear if we speak in stealthy quietness (softly).\" The third fellow said, \"If He hears when we speak aloud, then He surely hears us if we speak in stealthy quietness (softly).\" So Allah revealed the Verse:-- 'And you have not been screening against yourselves, lest your ears, and your eyes and your skins should testify against you...\" (41.22)",
      "chain": [
        "30418",
        "20005",
        "11067",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو نعيم، حدثنا سيف بن سليمان، قال سمعت مجاهدا، يقول حدثني عبد الله بن سخبرة، قال سمعت ابن مسعود، يقول علمني رسول الله صلى الله عليه وسلم التشهد كفي بين كفيه كما يعلمني السورة من القرآن ‏.‏ واقتص التشهد بمثل ما اقتصوا ‏.‏",
      "text_en": " Ibn Mas'ud is reported to have said:                      The Messenger of Allah (may peace be upon him) taught me tashahhud taking my hand within his palms, in the same way as he taught me a Sura of the Qur'an, and he narrated it as narrated above.",
      "chain": [
        "30201",
        "20348",
        "11558",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وأبو معاوية ووكيع عن الأعمش، عن عمارة بن عمير التيمي، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال أبو مسعود فأنتم اليوم أشد اختلافا ‏.‏",
      "text_en": " Abu Mas'ud reported:                      The Messenger of Allah (may peace he upon him) used to touch our shoulders in prayer and say: Keep straight, don't be irregular, for there would be dissension in your hearts. Let those of you who are sedate and prudent be near me, then those who are next to them, then those who are next to them. Abu Mas'ud said: Now-a-days there is much dissension amongst you.",
      "chain": [
        "30201",
        "20102",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1341",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يحيى بن سعيد، عن شعبة، عن الحكم، ومنصور، عن مجاهد، عن أبي معمر، أن أميرا، كان بمكة يسلم تسليمتين فقال عبد الله أنى علقها قال الحكم في حديثه إن رسول الله صلى الله عليه وسلم كان يفعله ‏.‏",
      "text_en": " Abu Ma'mar reported:                      There was an Amir in Mecca who pronounced taslim twice. Abdullah said: Where did he get this sunnah? Al-Hakam said: There is a hadith to the effect that the Messenger of Allah (may peace be upon him) did like It.",
      "chain": [
        "30022",
        "20031",
        "20020",
        "11069",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، عن الحكم، عن مجاهد، عن أبي معمر، عن عبد الله، - قال شعبة - رفعه مرة - أن أميرا أو رجلا سلم تسليمتين فقال عبد الله أنى علقها",
      "text_en": " 'Abdullah reported:                      An Amir or a person pronounced taslim twice. 'Abdullah said: Where did he get this sunnah?",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11069",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4725",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وابن أبي عمر، - واللفظ لابن أبي شيبة - قالوا حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله، قال دخل النبي صلى الله عليه وسلم مكة وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود كان بيده ويقول ‏\"‏ ‏{‏ جاء الحق وزهق الباطل إن الباطل كان زهوقا‏}‏ ‏{‏ جاء الحق وما يبدئ الباطل وما يعيد‏}‏ زاد ابن أبي عمر يوم الفتح ‏.‏",
      "text_en": " It has been narrated by Ibn Abdullah who said:                      The Holy Prophet (may peace be upon him) entered Mecca. There were three hundred and sixty idols around the Ka'ba. He began to thrust them with the stick that was in his hand saying:\" Truth has come and falsehood has vanished. Lo! falsehood was destined to vanish\" (xvii. 8). Truth has arrived, and falsehood can neither create anything from the beginning nor can It restore to life",
      "chain": [
        "30201",
        "30263",
        "30421",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7205",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، عن منصور، عن مجاهد، عن أبي، معمر عن ابن مسعود، قال اجتمع عند البيت ثلاثة نفر قرشيان وثقفي أو ثقفيان وقرشي قليل فقه قلوبهم كثير شحم بطونهم فقال أحدهم أترون الله يسمع ما نقول وقال الآخر يسمع إن جهرنا ولا يسمع إن أخفينا وقال الآخر إن كان يسمع إذا جهرنا فهو يسمع إذا أخفينا ‏.‏ فأنزل الله عز وجل ‏{‏ وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم‏}‏ الآية ‏.‏",
      "text_en": " Ibn Mas'ud reported that there gathered near the House three persons amongst whom two were Quraishi and one was a Thaqafi or two were Thaqafis and one was a Quraishi. They lacked understanding but wore more flesh. One of them said:                      Do you think that Allah hears as we speak? The other one said: He does hear when we speak loudly and He does not hear when we speak in undertones, and still the other one said: If He listens when we speak loudly, He also listens when we speak in undertones. It was on this occasion that this verse was revealed:\" You did not conceal yourselves lest your ears, your eyes and your skins would stand witness against you\" (xli. 22).",
      "chain": [
        "20012",
        "11067",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7207",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "وقال حدثنا يحيى، حدثنا سفيان، حدثني منصور، عن مجاهد، عن أبي معمر، عن عبد الله، بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30020",
        "20005",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "7249",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، عن ابن أبي، نجيح عن مجاهد، عن أبي معمر، عن عبد الله، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم بشقتين فقال رسول الله صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏",
      "text_en": " Abu Ma'mar reported on the authority of Abdullah that the moon was split up during lifetime by Allah's Messenger (may peace be upon him) in two parts and Allah's Messenger (may peace be upon him) said:                      Bear testimony to this.",
      "chain": [
        "30263",
        "30022",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7250",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن أبي، معاوية ح وحدثنا عمر بن حفص بن غياث، حدثنا أبي كلاهما، عن الأعمش، ح وحدثنا  منجاب بن الحارث التميمي، - واللفظ له - أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن أبي معمر، عن عبد الله بن مسعود، قال بينما نحن مع رسول الله صلى الله عليه وسلم بمنى إذا انفلق القمر فلقتين فكانت فلقة وراء الجبل وفلقة دونه فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abdullah b. Mas'ud (who said):                      We were along with Allah's Messenger (may peace be upon him) at Mina, that moon was split up into two. One of its parts was behind the mountain and the other one was on this side of the mountain. Allah's Messenger (may peace be upbn him) said to us: Bear witness to this.",
      "chain": [
        "30201",
        "20354",
        "30204",
        "11060",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7251",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن الأعمش، عن  إبراهيم، عن أبي معمر، عن عبد الله بن مسعود، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم فلقتين فستر الجبل فلقة وكانت فلقة فوق الجبل فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported that the moon was split up in two parts during the lifetime of Allah's Messenger (may peace be upon him). The mountain covered one of its parts and one part of it was above the mountain and Allah's Messenger (may peace be upon him) said:                      Bear witness to this.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "7697",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، جميعا عن ابن مهدي، - واللفظ لابن المثنى قالا حدثنا عبد الرحمن، عن سفيان، عن حبيب، عن مجاهد، عن أبي معمر، قال قام رجل يثني على أمير من الأمراء فجعل المقداد يحثي عليه التراب وقال أمرنا رسول الله صلى الله عليه وسلم أن نحثي في وجوه المداحين التراب ‏.‏",
      "text_en": " Abu Ma'mar reported that a person lauded a ruler amongst the rulers and Miqdad began to throw dust upon him and he said:                      Allah's Messenger (may peace be upon him) commanded us that we should throw dust upon the faces of those who shower too much praise.",
      "chain": [
        "30201",
        "30170",
        "20033",
        "20005",
        "11276",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "7739",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن الأعمش، عن إبراهيم، عن أبي معمر، عن عبد الله، في قوله عز وجل ‏{‏ أولئك الذين يدعون يبتغون إلى ربهم الوسيلة أيهم أقرب‏}‏ قال كان نفر من الجن أسلموا وكانوا يعبدون فبقي الذين كانوا يعبدون على عبادتهم وقد أسلم النفر من الجن ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported in connection with the words of Allah, the Exalted and Glorious:                     \" Those to whom they call upon, themselves seek the means or access to their Lord as to whoever of them becomes nearest\" (xvii. 57) that it related to a party of Jinn who were being worshipped and they embraced Islam but those who worshipped them kept on worshipping them (though the Jinn whom the misguided people worshipped had become Muslims). It was then that this verse was revealed.",
      "chain": [
        "30201",
        "20102",
        "11060",
        "11051",
        "11360"
      ]
    },
    {
      "hadith_no": "7740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثني أبو بكر بن نافع العبدي، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن أبي معمر، عن عبد الله، ‏{‏ أولئك الذين يدعون يبتغون إلى ربهم الوسيلة‏}‏ قال كان نفر من الإنس يعبدون نفرا من الجن فأسلم النفر من الجن ‏.‏ واستمسك الإنس بعبادتهم فنزلت ‏{‏ أولئك الذين يدعون يبتغون إلى ربهم الوسيلة‏}‏ وحدثنيه بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، عن سليمان، بهذا الإسناد ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported in connection with the verse:                     \" Those whom they call upon, themselves seek the means of access to their Lord,\" that it related to a group of people who worshipped a party amongst the Jinn. The group from amongst the Jinn embraced Islam, but the people kept worshipping them as they did before, and it was (on this occasion) that the verse was revealed:\" Those whom they call upon, themselves seek the means of access to their Lord.\" This hadith has been narrated on the authority of Sulaiman with the same chain of transmitters.",
      "chain": [
        "20033",
        "20012",
        "11060",
        "11051",
        "11360"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن كثير، أخبرني سفيان، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " Abu Ma’sud reported the Messenger of Allah (ﷺ) as saying:                      let those of your who are sedate and prudent be near me, then those who are next to them, then those who are next to them.",
      "chain": [
        "30169",
        "20012",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "801",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلنا لخباب هل كان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم ‏.‏ قلنا بم كنتم تعرفون ذاك قال باضطراب لحيته ‏.‏",
      "text_en": " Abu Ma’mar said:                      We asked Khabbab: Did the Messenger of Allah (ﷺ) recit (the Quran) in the noon and afternoon prayers? He replied: Yes. We then asked: How did you know this? He said: By the shaking of his beard, may peace be upon him.",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة الرجل حتى يقيم ظهره في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMas'ud al-Badri:                     The Prophet (ﷺ) said: A man's prayer does not avail him unless he keeps his back steady when bowing and prostrating.",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم فيها الرجل يعني صلبه في الركوع والسجود ‏\"‏ ‏.‏ قال وفي الباب عن علي بن شيبان وأنس وأبي هريرة ورفاعة الزرقي ‏.‏ قال أبو عيسى حديث أبي مسعود الأنصاري حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم يرون أن يقيم الرجل صلبه في الركوع والسجود ‏.‏ وقال الشافعي وأحمد وإسحاق من لم يقم صلبه في الركوع والسجود فصلاته فاسدة لحديث النبي صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏ وأبو معمر اسمه عبد الله بن سخبرة ‏.‏ وأبو مسعود الأنصاري البدري اسمه عقبة بن عمرو ‏.‏",
      "text_en": " Abu Mas'ud Al-Ansari [Al-Badri] narrated that :                     Allah's Messenger said: \"The Salat is not acceptable if a man is not at rest - meaning his back - while bowing and prostrating.\"",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "2393",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن مجاهد، عن أبي معمر، قال قام رجل فأثنى على أمير من الأمراء فجعل المقداد يحثو في وجهه التراب وقال أمرنا رسول الله صلى الله عليه وسلم أن نحثو في وجوه المداحين التراب ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى زائدة عن يزيد بن أبي زياد عن مجاهد عن ابن عباس وحديث مجاهد عن أبي معمر أصح ‏.‏ وأبو معمر اسمه عبد الله بن سخبرة والمقداد بن الأسود هو المقداد بن عمرو الكندي ويكنى أبا معبد وإنما نسب إلى الأسود بن عبد يغوث لأنه كان قد تبناه وهو صغير ‏.‏",
      "text_en": " Abu Ma'mar said:                     \"A man stood and praised one of the 'Amirs so Al-Miqdad bin Al-Aswad threw dust in his face and said: 'The Messenger of Allah (s.a.w) ordered us to throw dust in the faces of those who praise others.'\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11331",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "2648",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا محمد بن المعلى، حدثنا زياد بن خيثمة، عن أبي داود، عن عبد الله بن سخبرة، عن سخبرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من طلب العلم كان كفارة لما مضى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ضعيف الإسناد ‏.‏ أبو داود يضعف ولا نعرف لعبد الله بن سخبرة كبير شيء ولا لأبيه واسم أبي داود نفيع الأعمى تكلم فيه قتادة وغير واحد من أهل العلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Sakhbarah:                     narrated that the Prophet (ﷺ) said: \"Whoever seeks knowledge, he is atoning for what has passed (of sins while doing so).\"",
      "chain": [
        "38495",
        "20585",
        "30002",
        "11360"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن ابن مسعود، قال دخل رسول الله صلى الله عليه وسلم مكة عام الفتح وحول الكعبة ثلاثمائة وستون نصبا فجعل النبي صلى الله عليه وسلم يطعنها بمخصرة في يده وربما قال بعود ويقول ‏:‏ ‏(‏جاء الحق وزهق الباطل إن الباطل كان زهوقا ‏)‏ ‏:‏ ‏(‏جاء الحق وما يبدئ الباطل وما يعيد ‏)‏ ‏.‏ قال هذا حديث حسن صحيح وفيه عن ابن عمر ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The Messenger of Allah (ﷺ) entered Makkah during the year of the Conquest, and there were three hundred and sixty Nusb (Altars to sacrifice to idols) around the Ka'bah. So the Prophet (ﷺ) started hitting them with a stick he had in his hand\" - or perhaps he said: \"With a piece of wood, and he was saying: The truth has come and falsehood has vanished. Surely falsehood is ever bound to vanish (17:81). The truth has come and falsehood can neither originate anything nor resurrect (anything) (34:49).\"",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3556",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن منصور، عن مجاهد، عن أبي معمر، عن ابن مسعود، قال اختصم عند البيت ثلاثة نفر قرشيان وثقفي أو ثقفيان وقرشي قليلا فقه قلوبهم كثيرا شحم بطونهم فقال أحدهم أترون أن الله يسمع ما نقول فقال الآخر يسمع إذا جهرنا ولا يسمع إذا أخفينا ‏.‏ وقال الآخر إن كان يسمع إذا جهرنا فإنه يسمع إذا أخفينا ‏.‏ فأنزل الله ‏:‏ ‏(‏ وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"Three men whose bellies were fat, but whose hearts had little understanding, were arguing at the House. Two of them were from Quraish and one was from Thaqif - or two from Thaqif, and one from Quraish. One of them said: 'Do you think that Allah can hear what we are saying?' Another said: 'He can hear if we are loud, but He can not hear when we are quiet.' Another said: 'If He can hear when we are loud then He can hear when we are quiet.' So Allah, the Mighty and Sublime revealed: And you have not been hiding yourselves, lest your ears and your eyes and your skins should testify against you (41:22).\"",
      "chain": [
        "30421",
        "20005",
        "11067",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "3596",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن أبي معمر، عن ابن مسعود، رضي الله عنه قال بينما نحن مع رسول الله صلى الله عليه وسلم بمنى فانشق القمر فلقتين فلقة من وراء الجبل وفلقة دونه فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏ يعني ‏:‏ ‏(‏اقتربت الساعة وانشق القمر ‏)‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Mas'ud, may Allah be pleased with him:                     \"We were with the Messenger of Allah (ﷺ) in Mina, when the moon was cleft asunder into two parts. Part of it was behind the mountain, and part of it before it. The Messenger of Allah (ﷺ) said to us: 'Bear witness' meaning: The house has drawn near, and the moon has been cleft asunder (54:1).\"",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11051",
        "11360"
      ]
    },
    {
      "hadith_no": "3598",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن ابن مسعود، قال انشق القمر على عهد رسول الله صلى الله عليه وسلم فقال لنا النبي صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The moon was cleft asunder during the time of the Messenger of Allah (ﷺ), so the Prophet (ﷺ) said to us: 'Bear witness.'\"",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "807",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال أبو مسعود فأنتم اليوم أشد اختلافا ‏.‏ قال أبو عبد الرحمن أبو معمر اسمه عبد الله بن سخبرة ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansiri said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he-would say:'Keep (the rows) straight; do not differ from one another lest your hearts would be afflicted with discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"' Abu Mas'ud said: Today, there is much disharmony among you. ,Abu 'Abdur-Rabin (An-Nasai)said: (One of the narrators) Abu Ma'mar's name is 'Abdullah bin Sakhbarah.",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "812",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا غندر، عن شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح عواتقنا ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم وليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ad Al-Ansari said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he would say: 'Keep (the rows) straight; do not differ from one another lest your hearts should suffer from discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"'",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: 'The prayer is not valid if a man does not bring his backbone to rest while bowing and prostrating.'\"",
      "chain": [
        "30367",
        "20271",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1111",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا علي بن خشرم المروزي، قال أنبأنا عيسى، - وهو ابن يونس - عن الأعمش، عن عمارة، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: 'No prayer is valid in which a man does not maintain his back (at ease) when bowing and prostrating.'\"",
      "chain": [
        "30556",
        "20347",
        "11060",
        "11379",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، قال كنا عند علي فمرت جنازة فقاموا لها فقال علي ما هذا قالوا أمر أبي موسى ‏.‏ فقال إنما قام رسول الله صلى الله عليه وسلم لجنازة يهودية ولم يعد بعد ذلك ‏.‏",
      "text_en": " It was narrated that Abu Ma'mar said:                     \"We were with 'Ali and a funeral passed by him, and they stood up for it. 'Ali said: \"What is this?' They said: 'The command of Abu Musa.' He said: 'Rather the Messenger of Allah stood up for a Jewish funeral but he did not do it again.\"'",
      "chain": [
        "36658",
        "20005",
        "11254",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلت لخباب بأى شىء كنتم تعرفون قراءة رسول الله  صلى الله عليه وسلم  في الظهر والعصر قال باضطراب لحيته ‏.‏",
      "text_en": " It wasnarrated that Abu Ma’mar said:                      “I said to Khabbab: ‘How didyourecognize that the Messenger of Allah (ﷺ) was reciting in theZuhrand the ‘Asr?’ He said: ‘From the movement of his beard.’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "919",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، عن الأعمش، عن عمارة، عن أبي معمر، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      “The Messenger of Allah (ﷺ)said: ‘No prayer is acceptable in which a man does not settle hisspine when bowing and when prostrating.’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11379",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري، قال كان رسول الله  صلى الله عليه وسلم  يمسح مناكبنا في الصلاة ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud Al-Ansari said:                      “The Messenger ofAllah(ﷺ) used to gently pat our shoulders (to make sure the row wasstraight) at the time of prayer, saying: ‘Keep (the rows) straight,donot differ from one another lest your hearts should suffer fromdiscord. Let those who are forbearing and wise stand closest to me,then those who are next to them, then those who are next to them.’”",
      "chain": [
        "30269",
        "20005",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "3742",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن حبيب بن أبي ثابت، عن مجاهد، عن أبي معمر، عن المقداد بن عمرو، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نحثو في وجوه المداحين التراب ‏.‏",
      "text_en": " It was narrated that Miqdad bin 'Amr said:                     \"The Messenger of Allah(ﷺ) commanded us to throw dust in the faces of those who praise others.\"",
      "chain": [
        "20436",
        "20033",
        "20012",
        "11331",
        "11028",
        "11360"
      ]
    }
  ],
  "total_hadiths": 50
}