{
  "id": "11366",
  "name": "'Abdur Rahman bin Abi Na'm عبد الرحمن بن أبي نعم",
  "full_name": "'Abdur Rahman bin Abi Na'm عبد الرحمن بن أبي نعم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Kufi",
      "'Abid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "25071",
      "name": "al-Hakam bin 'Abdur Rahman bin Abi Na'm الحكم بن عبد الرحمن بن أبي نعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "438",
      "name": "Safinah ( سفينة مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "11076",
      "name": "Muhammad bin 'Abdullah bin Abi Ya'qub محمد بن عبد الله بن أبي يعقوب التميمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3344",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال وقال ابن كثير عن سفيان، عن أبيه، عن ابن أبي نعم، عن أبي سعيد  رضى الله عنه  قال بعث علي  رضى الله عنه  إلى النبي صلى الله عليه وسلم بذهيبة فقسمها بين الأربعة الأقرع بن حابس الحنظلي ثم المجاشعي، وعيينة بن بدر الفزاري، وزيد الطائي ثم أحد بني نبهان، وعلقمة بن علاثة العامري ثم أحد بني كلاب، فغضبت قريش والأنصار، قالوا يعطي صناديد أهل نجد ويدعنا‏.‏ قال ‏\"‏ إنما أتألفهم ‏\"‏‏.‏ فأقبل رجل غائر العينين مشرف الوجنتين، ناتئ الجبين، كث اللحية، محلوق فقال اتق الله يا محمد‏.‏ فقال ‏\"‏ من يطع الله إذا عصيت، أيأمنني الله على أهل الأرض فلا تأمنوني ‏\"‏‏.‏ فسأله رجل قتله  أحسبه خالد بن الوليد  فمنعه، فلما ولى قال ‏\"‏ إن من ضئضئ هذا  أو في عقب هذا  قوم يقرءون القرآن، لا يجاوز حناجرهم، يمرقون من الدين مروق السهم من الرمية، يقتلون أهل الإسلام، ويدعون أهل الأوثان، لئن أنا أدركتهم لأقتلنهم قتل عاد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                      `Ali sent a piece of gold to the Prophet who distributed it among four persons: Al-Aqra' bin H`Abis Al-Hanzali from the tribe of Mujashi, 'Uyaina bin Badr Al-Fazari, Zaid at-Ta'i who belonged to (the tribe of) Bani Nahban, and 'Alqama bin Ulatha Al-`Amir who belonged to (the tribe of) Bani Kilab. So the Quraish and the Ansar became angry and said, \"He (i.e. the Prophet, ) gives the chief of Najd and does not give us.\" The Prophet said, \"I give them) so as to attract their hearts (to Islam).\" Then a man with sunken eyes, prominent checks, a raised forehead, a thick beard and a shaven head, came (in front of the Prophet ) and said, \"Be afraid of Allah, O Muhammad!\" The Prophet ' said \"Who would obey Allah if I disobeyed Him? (Is it fair that) Allah has trusted all the people of the earth to me while, you do not trust me?\" Somebody who, I think was Khalid bin Al-Walid, requested the Prophet to let him chop that man's head off, but he prevented him. When the man left, the Prophet said, \"Among the off-spring of this man will be some who will recite the Qur'an but the Qur'an will not reach beyond their throats (i.e. they will recite like parrots and will not understand it nor act on it), and they will renegade from the religion as an arrow goes through the game's body. They will kill the Muslims but will not disturb the idolaters. If I should live up to their time' I will kill them as the people of 'Ad were killed (i.e. I will kill all of them).\"",
      "chain": [
        "30169",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "3798",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن أبي يعقوب، سمعت ابن أبي نعم، سمعت عبد الله بن عمر، وسأله، عن المحرم،، قال شعبة أحسبه يقتل الذباب فقال أهل العراق يسألون عن الذباب وقد قتلوا ابن ابنة رسول الله صلى الله عليه وسلم، وقال النبي صلى الله عليه وسلم ‏\"‏ هما ريحانتاى من الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Nu'm:                     A person asked `Abdullah bin `Umar whether a Muslim could kill flies. I heard him saying (in reply). \"The people of Iraq are asking about the killing of flies while they themselves murdered the son of the daughter of Allah's Apostle . The Prophet said, They (i.e. Hasan and Husain) are my two sweet basils in this world.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11366",
        "18"
      ]
    },
    {
      "hadith_no": "4394",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الواحد، عن عمارة بن القعقاع بن شبرمة، حدثنا عبد الرحمن بن أبي نعم، قال سمعت أبا سعيد الخدري، يقول بعث علي بن أبي طالب  رضى الله عنه  إلى رسول الله صلى الله عليه وسلم من اليمن بذهيبة في أديم مقروظ لم تحصل من ترابها، قال فقسمها بين أربعة نفر بين عيينة بن بدر، وأقرع بن حابس وزيد الخيل، والرابع إما علقمة وإما عامر بن الطفيل، فقال رجل من أصحابه كنا نحن أحق بهذا من هؤلاء‏.‏ قال فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ ألا تأمنوني وأنا أمين من في السماء، يأتيني خبر السماء صباحا ومساء ‏\"‏‏.‏ قال فقام رجل غائر العينين، مشرف الوجنتين، ناشز الجبهة، كث اللحية، محلوق الرأس، مشمر الإزار، فقال يا رسول الله، اتق الله‏.‏ قال ‏\"‏ ويلك أولست أحق أهل الأرض أن يتقي الله ‏\"‏‏.‏ قال ثم ولى الرجل، قال خالد بن الوليد يا رسول الله، ألا أضرب عنقه قال ‏\"‏ لا، لعله أن يكون يصلي ‏\"‏‏.‏ فقال خالد وكم من مصل يقول بلسانه ما ليس في قلبه‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لم أومر أن أنقب قلوب الناس، ولا أشق بطونهم ‏\"‏ قال ثم نظر إليه وهو مقف فقال ‏\"‏ إنه يخرج من ضئضئ هذا قوم يتلون كتاب الله رطبا، لا يجاوز حناجرهم، يمرقون من الدين كما يمرق السهم من الرمية ‏\"‏‏.‏ وأظنه قال ‏\"‏ لئن أدركتهم لأقتلنهم قتل ثمود ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     `Ali bin Abi Talib sent a piece of gold not yet taken out of its ore, in a tanned leather container to Allah's Apostle . Allah's Apostle distributed that amongst four Persons: 'Uyaina bin Badr, Aqra bin H`Abis, Zaid Al-Khail and the fourth was either Alqama or Amir bin at-Tufail. On that, one of his companions said, \"We are more deserving of this (gold) than these (persons).\" When that news reached the Prophet , he said, \"Don't you trust me though I am the truth worthy man of the One in the Heavens, and I receive the news of Heaven (i.e. Divine Inspiration) both in the morning and in the evening?\" There got up a man with sunken eyes, raised cheek bones, raised forehead, a thick beard, a shaven head and a waist sheet that was tucked up and he said, \"O Allah's Apostle! Be afraid of Allah.\" The Prophet said, \"Woe to you! Am I not of all the people of the earth the most entitled to fear Allah?\" Then that man went away. Khalid bin Al-Wahd said, \"O Allah's Apostle! Shall I chop his neck off?\" The Prophet said, \"No, for he may offer prayers.\" Khalid said, \"Numerous are those who offer prayers and say by their tongues (i.e. mouths) what is not in their hearts.\" Allah's Apostle said, \"I have not been ordered (by Allah) to search the hearts of the people or cut open their bellies.\" Then the Prophet looked at him (i.e. that man) while the latter was going away and said, \"From the offspring of this (man there will come out (people) who will recite the Qur'an continuously and elegantly but it will not exceed their throats. (They will neither understand it nor act upon it). They would go out of the religion (i.e. Islam) as an arrow goes through a game's body.\" I think he also said, \"If I should be present at their time I would kill them as the nations a Thamud were killed.\"",
      "chain": [
        "30367",
        "20256",
        "11379",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "4713",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبيه، عن ابن أبي نعم، عن أبي سعيد   رضى الله عنه  قال بعث إلى النبي صلى الله عليه وسلم بشىء، فقسمه بين أربعة وقال ‏\"‏ أتألفهم ‏\"‏‏.‏ فقال رجل ما عدلت‏.‏ فقال ‏\"‏ يخرج من ضئضئ هذا قوم يمرقون من الدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Something was sent to the Prophet and he distributed it amongst four (men) and said, \"I want to attract their hearts,(to Islam thereby),\" A man said (to the Prophet ), \"You have not done justice.\" Thereupon the Prophet said, \"There will emerge from the offspring of this (man) some people who will renounce the religion.\"",
      "chain": [
        "28531",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "6060",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا مهدي، حدثنا ابن أبي يعقوب، عن ابن أبي نعم، قال كنت شاهدا لابن عمر وسأله رجل عن دم البعوض‏.‏ فقال ممن أنت فقال من أهل العراق‏.‏ قال انظروا إلى هذا، يسألني عن دم البعوض وقد قتلوا ابن النبي صلى الله عليه وسلم وسمعت النبي صلى الله عليه وسلم يقول ‏\"‏ هما ريحانتاى من الدنيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Na'm:                     I was present when a man asked Ibn `Umar about the blood of mosquitoes. Ibn `Umar said, \"From where are you?\" The man replied. \"From Iraq.\" Ibn `Umar said, \"Look at that! he is asking me about the blood of Mosquitoes while they (the Iraqis ) have killed the (grand) son of the Prophet. I have heard the Prophet saying, \"They (Hasan and Husain) are my two sweet-smelling flowers in this world.\"",
      "chain": [
        "20040",
        "11307",
        "11366"
      ]
    },
    {
      "hadith_no": "6943",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن فضيل بن غزوان، عن ابن أبي نعم، عن أبي هريرة  رضى الله عنه  قال سمعت أبا القاسم، صلى الله عليه وسلم يقول ‏\"‏ من قذف مملوكه وهو بريء مما قال، جلد يوم القيامة، إلا أن يكون كما قال ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Abu-l-Qasim (the Prophet) saying, \"If somebody slanders his slave and the slave is free from what he says, he will be flogged on the Day of Resurrection unless the slave is really as he has described him.\"",
      "chain": [
        "30175",
        "20031",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "7522",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن ابن أبي نعم  أو أبي نعم شك قبيصة  عن أبي سعيد، قال بعث إلى النبي صلى الله عليه وسلم بذهيبة فقسمها بين أربعة‏.‏ وحدثني إسحاق بن نصر حدثنا عبد الرزاق أخبرنا سفيان عن أبيه عن ابن أبي نعم عن أبي سعيد الخدري قال بعث علي وهو باليمن إلى النبي صلى الله عليه وسلم بذهيبة في تربتها، فقسمها بين الأقرع بن حابس الحنظلي ثم أحد بني مجاشع، وبين عيينة بن بدر الفزاري، وبين علقمة بن علاثة العامري ثم أحد بني كلاب، وبين زيد الخيل الطائي ثم أحد بني نبهان، فتغضبت قريش والأنصار فقالوا يعطيه صناديد أهل نجد ويدعنا قال ‏\"‏ إنما أتألفهم ‏\"‏‏.‏ فأقبل رجل غائر العينين، ناتئ الجبين، كث اللحية، مشرف الوجنتين، محلوق الرأس فقال يا محمد اتق الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فمن يطيع الله إذا عصيته فيأمني على أهل الأرض، ولا تأمنوني ‏\"‏‏.‏ فسأل رجل من القوم  قتله أراه خالد بن الوليد  فمنعه النبي صلى الله عليه وسلم فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم، يمرقون من الإسلام مروق السهم من الرمية، يقتلون أهل الإسلام ويدعون أهل الأوثان، لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     When `Ali was in Yemen, he sent some gold in its ore to the Prophet. The Prophet distributed it among Al-Aqra' bin H`Abis Al-Hanzali who belonged to Bani Mujashi, 'Uyaina bin Badr Al-Fazari, 'Alqama bin 'Ulatha Al-`Amiri, who belonged to the Bani Kilab tribe and Zaid AI-Khail at-Ta'i who belonged to Bani Nabhan. So the Quraish and the Ansar became angry and said, \"He gives to the chiefs of Najd and leaves us!\" The Prophet said, \"I just wanted to attract and unite their hearts (make them firm in Islam).\" Then there came a man with sunken eyes, bulging forehead, thick beard, fat raised cheeks, and clean-shaven head, and said, \"O Muhammad! Be afraid of Allah! \" The Prophet said, \"Who would obey Allah if I disobeyed Him? (Allah). He trusts me over the people of the earth, but you do not trust me?\" A man from the people (present then), who, I think, was Khalid bin Al- Walid, asked for permission to kill him, but the Prophet prevented him. When the man went away, the Prophet said, \"Out of the offspring of this man, there will be people who will recite the Qur'an but it will not go beyond their throats, and they will go out of Islam as an arrow goes out through the game, and they will kill the Muslims and leave the idolators. Should I live till they appear, I would kill them as the Killing of the nation of 'Ad.\"",
      "chain": [
        "20351",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عبد الرحمن، بن أبي نعم عن أبي سعيد الخدري، قال بعث علي - رضى الله عنه - وهو باليمن بذهبة في تربتها إلى رسول الله صلى الله عليه وسلم فقسمها رسول الله صلى الله عليه وسلم بين أربعة نفر الأقرع بن حابس الحنظلي وعيينة بن بدر الفزاري وعلقمة بن علاثة العامري ثم أحد بني كلاب وزيد الخير الطائي ثم أحد بني نبهان - قال - فغضبت قريش فقالوا أتعطي صناديد نجد وتدعنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني إنما فعلت ذلك لأتألفهم ‏\"‏ فجاء رجل كث اللحية مشرف الوجنتين غائر العينين ناتئ الجبين محلوق الرأس فقال اتق الله يا محمد ‏.‏ - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن يطع الله إن عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ قال ثم أدبر الرجل فاستأذن رجل من القوم في قتله - يرون أنه خالد بن الوليد - فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم يقتلون أهل الإسلام ويدعون أهل الأوثان يمرقون من الإسلام كما يمرق السهم من الرمية لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " Abu Said Khudri reported that 'Ali (Allah be pleased with him) sent some gold alloyed with dust to the Messenger of Allah (may peace be upon him), and the Messenger of Allah (may peace be upon him) distributed that among four men, al-Aqra b. Habis Hanzali and Uyaina b. Badr al-Fazari and 'Alqama b. 'Ulatha al-'Amiri, then to one person of the tribe of Kilab and to Zaid al-Khair al-Ta'l, and then to one person of the tribe of Nabhan. Upon this the people of Quraish felt angry and said:                      He (the Holy Prophet) gave to the chiefs of Najd and ignored us. Upon this the Messenger of Allah (may peace be upon him) said: I have done it with a view to con- cillating them. Then there came a person with thick beard, prominent cheeks, deep sunken eyes and protruding forehead and shaven head. He said: Muhammad, fear Allah. Upon this the Messenger of Allah (may peace be upon him) said: If I disobey Allah, who would then obey Him? Have I not been (sent as the) most trustworthy among the people of the-world? -but you do not repose trust in me. That person then went back. A person among the people then sought permission (from the Holy Prophet) for his murder. According to some, it was Khalid b. Walid who sought the permission. Upon this the Messenger of Allah (may peace be upon him), said: From this very person's posterity there would arise people who would recite the Qur'an, but it would not go beyond their throat; they would kill the followers of Islam and would spare the idol-worshippers. They would glance through the teachings of Islam so hurriedly just as the arrow passes through the pray. If I were to ever find them I would kill them like 'Ad.",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "2500",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد، عن عمارة بن القعقاع، حدثنا عبد، الرحمن بن أبي نعم قال سمعت أبا سعيد الخدري، يقول بعث علي بن أبي طالب إلى رسول الله صلى الله عليه وسلم من اليمن بذهبة في أديم مقروظ لم تحصل من ترابها - قال - فقسمها بين أربعة نفر بين عيينة بن حصن والأقرع بن حابس وزيد الخيل والرابع إما علقمة بن علاثة وإما عامر بن الطفيل فقال رجل من أصحابه كنا نحن أحق بهذا من هؤلاء - قال - فبلغ ذلك النبي صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ ألا تأمنوني وأنا أمين من في السماء يأتيني خبر السماء صباحا ومساء ‏\"‏ ‏.‏ قال فقام رجل غائر العينين مشرف الوجنتين ناشز الجبهة كث اللحية محلوق الرأس مشمر الإزار فقال يا رسول الله اتق الله ‏.‏ فقال ‏\"‏ ويلك أولست أحق أهل الأرض أن يتقي الله ‏\"‏ ‏.‏ قال ثم ولى الرجل فقال خالد بن الوليد يا رسول الله ألا أضرب عنقه فقال ‏\"‏ لا لعله أن يكون يصلي ‏\"‏ ‏.‏ قال خالد وكم من مصل يقول بلسانه ما ليس في قلبه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لم أومر أن أنقب عن قلوب الناس ولا أشق بطونهم ‏\"‏ ‏.‏ قال ثم نظر إليه وهو مقف فقال ‏\"‏ إنه يخرج من ضئضئ هذا قوم يتلون كتاب الله رطبا لا يجاوز حناجرهم يمرقون من الدين كما يمرق السهم من الرمية - قال أظنه قال - لئن أدركتهم لأقتلنهم قتل ثمود ‏\"‏ ‏.‏",
      "text_en": " Abu Said al-Khudri reported:                      'Ali b. Abu Talib sent to the Messenger of Allah (may peace be upon him) from Yemen some gold alloyed with clay in a leather bag dyed in the leaves of Mimosa flava. He distributed it among four men. 'Uyaina b. Hisna, Aqra' b. Habis and Zaid al-Khail, and the fourth one was either Alqama b. 'Ulatha or 'Amir b. Tufail. A person from among his (Prophet's) Companions said: We had a better claim to this (wealth) than these (persons). This (remark) reached the Apostle of Allah (may peace be upon him) upon which he said: Will you not trust me, whereas I am a trustee of Him Who is in the heaven? The news come to me from the heaven morning and evening. Then there stood up a person with deep snnken eyes, prominent cheek bones, and elevated forehead, thick beard, shaven head, tucked up loin cloth, and he said: Messenger of Allah, fear Allah. He (the Holy Prophet) said: Woe to thee. do I not deserve most to fear Allah amongst the people of the earth? That man then returned. Khalid b. Walid then said: Messenger of Allah, should I not strike his neck? Upon this he (the Holy Prophet) said: Perhaps he may be observing the prayer. Khalid said: How many observers of prayer are there who profess with their tongue what is not in their heart? Upon this the Messenger of Allah (may peace be upon him) said: I have not been commanded to pierce through the hearts of people, nor to split their bellies (insides). He again looked at him and he was going back. Upon this he (the Holy Prophet) said: There would arise a people from the progeny of this (man) who would recite the Qur'an glibly, but it would not go beyond their throats; they would (hurriedly) pass through (the teachings of their) religion just as the arrow passes through the prey. I conceive that he (the Holy Prophet) also said this: If I find them I would certainly kill them as were killed the (people of) Thamud.",
      "chain": [
        "30367",
        "20256",
        "11379",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "3954",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا محمد بن فضيل، عن أبيه، عن ابن أبي، نعم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبتاعوا الثمار حتى يبدو صلاحها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Do not sell the fruits until their good condition becomes evident.\"",
      "chain": [
        "30216",
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4152",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبيه، عن ابن أبي نعم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب وزنا بوزن مثلا بمثل والفضة بالفضة وزنا بوزن مثلا بمثل فمن زاد أو استزاد فهو ربا‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Mess-., nger (may peace be upon him) as saying:                      Gold is to be paid for by gold with equal weight, like for like, and silver is to be paid for by silver with equal weight, like for like. He who made an addition to it or demanded an addition dealt in usury.",
      "chain": [
        "30216",
        "30481",
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4401",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، ح وحدثنا محمد بن عبد الله بن، نمير حدثنا أبي، حدثنا فضيل بن غزوان، قال سمعت عبد الرحمن بن أبي نعم، حدثني أبو هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ من قذف مملوكه بالزنا يقام عليه الحد يوم القيامة إلا أن يكون كما قال ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Abu'l-Qasim (one of the names of Allah's Messenger [may peace be upon him]) said:                      He who accused his slave of adultery, punishment would be imposed upon him on the Day of Resurrection, except in case the accusation was as he had said.",
      "chain": [
        "30201",
        "30212",
        "30212",
        "20331",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن حى، - هو الحسن بن صالح - عن بكير بن عامر البجلي، عن عبد الرحمن بن أبي نعم، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم مسح على الخفين ‏.‏ فقلت يا رسول الله أنسيت قال ‏\"‏ بل أنت نسيت بهذا أمرني ربي عز وجل ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah said:                      The Messenger of Allah (ﷺ) wiped over the socks and I said: Messenger of Allah, have you forgotten ? He said: My Lord has commanded me to do this.",
      "chain": [
        "30184",
        "11366",
        "166"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، حدثنا يزيد بن أبي زياد، حدثنا عبد الرحمن بن أبي نعم البجلي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم سئل عما يقتل المحرم قال ‏\"‏ الحية والعقرب والفويسقة ويرمي الغراب ولا يقتله والكلب العقور والحدأة والسبع العادي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) was asked which of the creatures a pilgrim in sacred state could kill. He replied: The snake, the scorpion, the rat; he should drive away the pied crow, but should not kill it; the biting dog, the kite, and any wild animal which attacks (man).",
      "chain": [
        "30007",
        "20468",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "3402",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا الفضل بن دكين، حدثنا بكير، - يعني ابن عامر - عن ابن أبي نعم، حدثني رافع بن خديج، أنه زرع أرضا فمر به النبي صلى الله عليه وسلم وهو يسقيها فسأله ‏\"‏ لمن الزرع ولمن الأرض ‏\"‏ ‏.‏ فقال زرعي ببذري وعملي لي الشطر ولبني فلان الشطر ‏.‏ فقال ‏\"‏ أربيتما فرد الأرض على أهلها وخذ نفقتك ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     Rafi' had cultivated a land. The Prophet (ﷺ) passed him when he was watering it. So he asked him: To whom does the crop belong, and to whom does the land belong? He replied: The crop is mine for my seed and labour. The half (of the crop) is mine and the half for so-and-so. He said: You conducted usurious transaction. Return the land to its owner and take your wages and cost.",
      "chain": [
        "30524",
        "20348",
        "11366",
        "1986"
      ]
    },
    {
      "hadith_no": "4764",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبيه، عن ابن أبي نعم، عن أبي سعيد الخدري، قال ‏:‏ بعث علي عليه السلام إلى النبي صلى الله عليه وسلم بذهيبة في تربتها، فقسمها بين أربعة بين ‏:‏ الأقرع بن حابس الحنظلي ثم المجاشعي، وبين عيينة بن بدر الفزاري وبين زيد الخيل الطائي ثم أحد بني نبهان وبين علقمة بن علاثة العامري ثم أحد بني كلاب قال فغضبت قريش والأنصار وقالت ‏:‏ يعطي صناديد أهل نجد ويدعنا ‏.‏ فقال ‏:‏ ‏\"‏ إنما أتألفهم ‏\"‏ ‏.‏ قال ‏:‏ فأقبل رجل غائر العينين مشرف الوجنتين ناتئ الجبين كث اللحية محلوق قال ‏:‏ اتق الله يا محمد ‏.‏ فقال ‏:‏ ‏\"‏ من يطع الله إذا عصيته أيأمنني الله على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ قال ‏:‏ فسأل رجل قتله أحسبه خالد بن الوليد - قال - فمنعه ‏.‏ قال ‏:‏ فلما ولى قال ‏:‏ ‏\"‏ إن من ضئضئ هذا أو في عقب هذا قوما يقرءون القرآن لا يجاوز حناجرهم يمرقون من الإسلام مروق السهم من الرمية، يقتلون أهل الإسلام ويدعون أهل الأوثان لئن أنا أدركتهم قتلتهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-khudri said :                      ‘Ali sent some gold-mixed dust to the prophet (May peace be upon him). He divided it among the four : al-Aqra b. Habis al-Hanzall and then al-Mujashi, uyainah b. Badr al-fazari, zaid al-khail al-Ta’l, next to one of Banu nabhan, and ‘Alqamah b. ‘Ulathat al-Amiri (in general), next to one of Banu kulaib. The Quraish and the ansar became angry and said : He is giving to the chiefs of the people of Najd and leaving us. He said : I am giving them for reconciliation of their hearts. Then a man with deep-seated eyes, high cheek-bones, a projecting brow, a thick beard and a shaven head came forward and said: For Allah, Muhammad! He said : Who will obey Allah if I disobey Him? Allah entrusts me with power over the inhabitants of the earth, but you do not. A man asked to be allowed to kill him and I think he was Khalid b. al-Walid but he prevented him. Then when the man turned away, he said: From this one’s stock there will be people who recite the Quran, but it will not pass down their throats. They will sever from Islam and leave the worshippers of Idols alone; but if I live up to their time I shall certainly kill them as 'Ad were killed.",
      "chain": [
        "28531",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "5165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، قال أخبرنا ح، وحدثنا مؤمل بن الفضل الحراني، قال أخبرنا عيسى، حدثنا فضيل، - يعني ابن غزوان - عن ابن أبي نعم، عن أبي هريرة، قال حدثني أبو القاسم، نبي التوبة صلى الله عليه وسلم قال ‏\"‏ من قذف مملوكه وهو بريء مما قال جلد له يوم القيامة حدا ‏\"‏ ‏.‏ قال مؤمل حدثنا عيسى عن الفضيل يعني ابن غزوان ‏.‏",
      "text_en": " Abu Hurairah said:                      Abu al-Qasim, the Prophet of Atonement (ﷺ) said to me: If anyone reviles his slave when he is innocent of what he said, he will be beaten on the Day of Resurrection.The transmitter Mu'ammal said: 'Isa narrated it to us from al-Fudial, that is, Ibn Ghazwan.",
      "chain": [
        "30309",
        "38659",
        "20347",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "838",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقتل المحرم السبع العادي والكلب العقور والفأرة والعقرب والحدأة والغراب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا المحرم يقتل السبع العادي ‏.‏ وهو قول سفيان الثوري والشافعي ‏.‏ وقال الشافعي كل سبع عدا على الناس أو على دوابهم فللمحرم قتله ‏.‏",
      "text_en": " Abu Sa'eed narrated that:                     The Prophet said: \"The Muhrim may kill the wild beast of prey, the rabid dog, the mouse, the scorpion, the kite, and the crow.\"",
      "chain": [
        "30242",
        "20468",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "2073",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن فضيل بن غزوان، عن ابن أبي نعم، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم نبي التوبة ‏\"‏ من قذف مملوكه بريئا مما قال له أقام عليه الحد يوم القيامة إلا أن يكون كما قال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وابن أبي نعم هو عبد الرحمن بن أبي نعم البجلي يكنى أبا الحكم ‏.‏ وفي الباب عن سويد بن مقرن وعبد الله بن عمر ‏.‏",
      "text_en": " Abu Hurairah narrated that Abul-Qasim, the Prophet of Repentance, said :                     \"If somebody slanders his slave (by accusing him of committing illegal sexual intercourse) and the slave is innocent from what he says, Allah will impose the punishment upon him on the Day of Resurrection, unless it is as he said about him.\"",
      "chain": [
        "30304",
        "20025",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4136",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد الخدري، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     that the Messenger of Allah (ﷺ) said: \"Al-Hasan and Al-Husain are the chiefs of the youth of Paradise.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "10844",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "4139",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عقبة بن مكرم العمي، حدثنا وهب بن جرير بن حازم، حدثنا أبي، عن محمد بن أبي يعقوب، عن عبد الرحمن بن أبي نعم، أن رجلا، من أهل العراق سأل ابن عمر عن دم البعوض يصيب الثوب فقال ابن عمر انظروا إلى هذا يسأل عن دم البعوض وقد قتلوا ابن رسول الله صلى الله عليه وسلم وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحسن والحسين هما ريحانتاى من الدنيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وقد رواه شعبة ومهدي بن ميمون عن محمد بن أبي يعقوب ‏.‏ وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abu Nu'm:                     that a man from the people of Al-'Iraq asked Ibn 'Umar about the blood of a gnat that gets on the clothes. Ibn 'Umar said \"Look at this one, he asks about the blood of a gnat while they killed the son of the Messenger of Allah (ﷺ)! And I heard the Messenger of Allah (ﷺ) said: 'Indeed Al-Hasan and Al-Husain - they are my two sweet basils in the world.'\"",
      "chain": [
        "30441",
        "20298",
        "11272",
        "11366",
        "18"
      ]
    },
    {
      "hadith_no": "2578",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن عبد الرحمن بن أبي نعم، عن أبي سعيد الخدري، قال بعث علي وهو باليمن بذهيبة بتربتها إلى رسول الله صلى الله عليه وسلم فقسمها رسول الله صلى الله عليه وسلم بين أربعة نفر الأقرع بن حابس الحنظلي وعيينة بن بدر الفزاري وعلقمة بن علاثة العامري ثم أحد بني كلاب وزيد الطائي ثم أحد بني نبهان فغضبت قريش وقال مرة أخرى صناديد قريش فقالوا تعطي صناديد نجد وتدعنا ‏.‏ قال ‏\"‏ إنما فعلت ذلك لأتألفهم ‏\"‏ ‏.‏ فجاء رجل كث اللحية مشرف الوجنتين غائر العينين ناتئ الجبين محلوق الرأس فقال اتق الله يا محمد ‏.‏ قال ‏\"‏ فمن يطع الله عز وجل إن عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ ثم أدبر الرجل فاستأذن رجل من القوم في قتله يرون أنه خالد بن الوليد فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم يقتلون أهل الإسلام ويدعون أهل الأوثان يمرقون من الإسلام كما يمرق السهم من الرمية لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"When he was in Yemen, Ali sent a piece of gold that was still mixed with sediment to the Messenger of Allah, and the Messenger of Allah distributed it among four people: Al-Aqra' bin Habis Al-Hanzali, 'Uyaynah bin Badr Al-Fazari, 'Alqamah bin 'Ulathah Al- 'Amiri, who was from Banu Kilab and Zaid Al-Ta'I who was from Banu Nabhan. The Quraish\" - he said one time: became angry and said: 'You give to the chiefs of  Najdand that, so as to soften their hearts toward Islam.' Then a man with a thick beard, prominent cheeks, and a shaven head came and said: 'Fear Allah. O Muhammad! He said: 'Who would obey Allah if I disobeyed Him? (Is it fair that) He has entrusted me with all the people of the Earth but you do not trust me?' Then the man went away, and a man from among the people, whom they (the narrators) think was Khalid bin Al-Walid, asked for permission to kill him. The Messenger of Allah said: 'Among the offspring of this man will be some people who will recite the Qur'an but it will not go any further than their throats. They will kill the Muslims but leave the idol worshippers alone, and they will passes through Islam as an arrow passes through the body of the target. If I live to see them. I will kill them all, as the people of 'Ad were killed.\"'",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا عبد الرزاق، قال أنبأنا الثوري، عن أبيه، عن ابن أبي نعم، عن أبي سعيد الخدري، قال بعث علي إلى النبي صلى الله عليه وسلم وهو باليمن بذهيبة في تربتها فقسمها بين الأقرع بن حابس الحنظلي ثم أحد بني مجاشع وبين عيينة بن بدر الفزاري وبين علقمة بن علاثة العامري ثم أحد بني كلاب وبين زيد الخيل الطائي ثم أحد بني نبهان - قال - فغضبت قريش والأنصار وقالوا يعطي صناديد أهل نجد ويدعنا فقال ‏\"‏ إنما أتألفهم ‏\"‏ ‏.‏ فأقبل رجل غائر العينين ناتئ الوجنتين كث اللحية محلوق الرأس فقال يا محمد اتق الله قال ‏\"‏ من يطع الله إذا عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ فسأل رجل من القوم قتله فمنعه فلما ولى قال ‏\"‏ إن من ضئضئ هذا قوما يخرجون يقرءون القرآن لا يجاوز حناجرهم يمرقون من الدين مروق السهم من الرمية يقتلون أهل الإسلام ويدعون أهل الأوثان لئن أنا أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"When 'Ali was in Yemen, he sent some gold that was still enclosed in rock to the Prophet [SAW], who distributed it among Al-Aqra' bin Habis Al-Hanzali, who belonged to Banu Mujashi', 'Uyaynah bin Badr Al-Fazari, 'Alqamah bin 'Ulathah Al-'Amiri, who belonged to Banu Kilab and Zaid Al-Khail At-Ta'I, who belonged to Banu Nabhan. The Quraish and the Ansar became angry and said: 'He gives to the chiefs of Najd and ignores us!' He said: 'I am seeking to win them over (firmly to Islam).' Then a man with sunken eyes, a bulging forehead, a thick beard and a shaven head came and said: 'O Muhammad, fear Allah!' He said: 'Who will obey Allah if I do not? He trusts me with the people of this Earth but you do not trust me.' A man among the people asked for permission to kill him, but he did not let him do that. When (the man) went away, he (the Prophet [SAW]) said: 'Among the offspring of this man there will be people who will recite the Qur'an but it will not go beyond their throats, and they will go out of Islam as an arrow goes through the target. They will kill the Muslims and leave the idol-worshippers alone. If I live to see them, I will kill them as the killing of 'Ad.'\"",
      "chain": [
        "30277",
        "20121",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "4569",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا محمد بن فضيل، عن أبيه، عن ابن أبي نعم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب وزنا بوزن مثلا بمثل والفضة بالفضة وزنا بوزن مثلا بمثل فمن زاد أو ازداد فقد أربى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Gold for god, weight for weight, like for like; and silver for silver, weight for weight, like for like. Whoever gives more or takes more has engaged in Riba.\"'",
      "chain": [
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن المغيرة، قال سمعت ابن أبي نعم، قال سمعت أبا هريرة، يقول نهى رسول الله صلى الله عليه وسلم عن كسب الحجام وعن ثمن الكلب وعن عسب الفحل ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah forbade the earnings of a cupper, the price of a dog and stud fees for a stallion.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "166",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4674",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثنا محمد، قال حدثنا سفيان، عن هشام، عن ابن أبي نعم، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن عسب الفحل ‏.‏",
      "text_en": " It was narrated that (Abu Hurairah) said:                     \"The Messenger of Allah forbade the price of a dog and stud fees for a stallion.\"",
      "chain": [
        "38556",
        "30213",
        "20012",
        "11065",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "5661",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن مغيرة، عن عبد الرحمن بن أبي نعم، عن ابن عمر، ونفر، من أصحاب محمد صلى الله عليه وسلم قالوا قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب الخمر فاجلدوه ثم إن شرب فاجلدوه ثم إن شرب فاجلدوه ثم إن شرب فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar and a number of the Companions of Muhammad [SAW] said:                     \"The Messenger of Allah [SAW] said: 'Whoever drinks Khamr, whip him; then if he drinks (again), whip him; then if he drinks (again), whip him; then if he drinks (again), kill him.'\"",
      "chain": [
        "30123",
        "20028",
        "11072",
        "11366",
        "18"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يعلى بن عبيد، حدثنا فضيل بن غزوان، عن ابن أبي نعم، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الفضة بالفضة والذهب بالذهب والشعير بالشعير والحنطة بالحنطة مثلا بمثل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     '(Sell) silver for silver, gold for gold, barley for barley, wheat for wheat, like for like.\"",
      "chain": [
        "30201",
        "20372",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "3208",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن فضيل، عن يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ يقتل المحرم الحية والعقرب والسبع العادي والكلب العقور والفأرة الفويسقة ‏\"‏ ‏.‏ فقيل له لم قيل لها الفويسقة قال لأن رسول الله  صلى الله عليه وسلم  استيقظ لها وقد أخذت الفتيلة لتحرق بها البيت ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that the Prophet (ﷺ) said:                      ‘The oneinIhram may kill the snake, the scorpion, the aggressive predator,thevicious dog and the harmful mouse.” It was said to him: “Why isitsaid that they are harmful?” He said:* “Because the Messengerof Allah(ﷺ) woke up because of one, and it had taken the wick (ofthe lamp)to burn down the house.”",
      "chain": [
        "30216",
        "20356",
        "10844",
        "11366",
        "38"
      ]
    }
  ],
  "total_hadiths": 29
}