{
  "id": "11377",
  "name": "'Ali bin Mdrk al-Nkh'y علي بن مدرك النخعي",
  "full_name": "'Ali bin Mdrk al-Nkh'y علي بن مدرك النخعي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11406",
      "name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10894",
      "name": "Tmym bin Trfh تميم بن طرفة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15112",
      "name": "Hnsh bin al-Harith bin Lqyt حنش بن الحارث بن لقيط",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10891",
      "name": "Ash'th bin Swar al-Kndy أشعث بن سوار الكندي النجار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "121",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني علي بن مدرك، عن أبي زرعة، عن جرير، أن النبي صلى الله عليه وسلم قال له في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet said to me during Hajjat-al-Wida`: Let the people keep quiet and listen. Then he said (addressing the people), \"Do not (become infidels) revert to disbelief after me by striking the necks (cutting the throats) of one another (killing each other).",
      "chain": [
        "20219",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "4449",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن جرير، أن النبي صلى الله عليه وسلم قال في حجة الوداع لجرير ‏\"‏ استنصت الناس ‏\"‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet ordered me during Hajjatul-Wada`. \"Ask the people to listen.\" He then said, \"Do not become infidels after me by cutting the necks (throats) of one another. \"",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "6953",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، عن جرير، قال قال النبي صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس، لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏ رواه أبو بكرة وابن عباس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Zur'a bin `Amr bin Jarir:                     The Prophet said during Hajjat-al-Wada`, \"Let the people be quiet and listen to me. After me, do not become disbelievers, by striking (cutting) the necks of one another.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "7167",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن علي بن مدرك، سمعت أبا زرعة بن عمرو بن جرير، عن جده، جرير قال قال لي رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet said to me during Hajjat-al-Wada`, \"Let the people keep quiet and listen.\" Then he said (addressing the people), \"Beware! Do not renegade as disbelievers after me by striking (cutting) the necks of one another.\"",
      "chain": [
        "20193",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد بن جعفر، عن شعبة، ح وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، حدثنا شعبة، عن علي بن مدرك، سمع أبا زرعة، يحدث عن جده، جرير قال قال لي النبي صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jarir b. 'Abdullah that the Apostle of Allah (may peace and blessings be upon him) asked him on the occasion of the Farewell Pilgrimage to make the people silent and then said:                      Do not return to unbelief after me by striking the necks of one another.",
      "chain": [
        "30201",
        "30170",
        "20173",
        "20020",
        "13898",
        "20020",
        "11377",
        "30554",
        "4057"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد بن جعفر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ قال فقرأها رسول الله صلى الله عليه وسلم ثلاث مرار ‏.‏ قال أبو ذر خابوا وخسروا من هم يا رسول الله قال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It is narrated o the authority of Abu Dharr that the Messenger of Allah (may ace he upon him) observed:                      Three are the (persons) with whom Allah would neither speak on the Day of Resurrection, nor would look at them nor would absolve the and there is a painful chastisement for them. The Messenger of Allah (may peace be upon him) repeated it three times. Abu Dharr remarked: They failed and they lost; who are these persons, Messenger of Allah? Upon this he (the Holy) Prophet) observed: They are: the dragger of lower garment, the recounter of obligation the seller of goods by false oath.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "227",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: Angels do not enter the house where there is a picture, or a dog, or a person who is sexually defiled.",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "4087",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ثلاثة لا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ قلت من هم يا رسول الله قد خابوا وخسروا أعادها ثلاثا ‏.‏ قلت من هم يا رسول الله خابوا وخسروا فقال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏ أو ‏\"‏ الفاجر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet (ﷺ) as saying: There are three to whom Allah will not speak and at whom He will not look on the Day of Resurrection, and whom He will not declare pure, and they will have a painful punishment. I asked: Who are they, Messenger of Allah, they are losers and disappointed ? He repeated it three times. I asked: Who are they. Messenger of Allah, they are losers and disappointed ? He replied: The one who wears a trailing robe, the one who takes account of what he gives, and the one who produces a ready sale of a commodity by false swearing.",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "4152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن عبد الله بن نجى، عن أبيه، عن علي، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: The angels do not enter a house which contains a picture, a dog, or a man who is impure by sexual defilement.",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "1211",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، قال أخبرني علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ قلت من هم يا رسول الله فقد خابوا وخسروا فقال ‏\"‏ المنان والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وأبي هريرة وأبي أمامة بن ثعلبة وعمران بن حصين ومعقل بن يسار ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Prophet (ﷺ) said: \"There are three whom Allah will not look at on the Day of Judgement, nor will He purify them, and theirs is a painful punishment.\" We said: \"Who are they O Messenger of Allah ? For they have indeed failed and are lost!\" He sai: \"The Mannan, the one whose Izar hangs (below the ankels) and the one who promotes his merchandise with false oath.\" [He said:] There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Umamah bin Tha'labah, 'Imran bin Husain, and Ma'qil bin Yasar[Abu 'Eisa said:] The Hadith of Abu Dharr is a Hasan Sahih Hadith.",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "2221",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن الفضيل، عن الأعمش، عن علي بن مدرك، عن هلال بن يساف، عن عمران بن حصين، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ثم يأتي من بعدهم قوم يتسمنون ويحبون السمن يعطون الشهادة قبل أن يسألوها ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى محمد بن فضيل هذا الحديث عن الأعمش عن علي بن مدرك عن هلال بن يساف وروى غير واحد من الحفاظ هذا الحديث عن الأعمش عن هلال بن يساف ولم يذكروا فيه علي بن مدرك ‏.‏ قال وحدثنا الحسين بن حريث، حدثنا وكيع، عن الأعمش، حدثنا هلال بن يساف، عن عمران بن حصين، عن النبي صلى الله عليه وسلم فذكر نحوه ‏.‏ وهذا أصح عندي من حديث محمد بن فضيل وقد روي من غير وجه عن عمران بن حصين عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Imran bin Husain narrated that the Messenger of Allah(s.a.w) said:                     \"The best of people are my generation, then those who follow them. Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it.\"",
      "chain": [
        "11060",
        "11377",
        "10835",
        "123"
      ]
    },
    {
      "hadith_no": "2471",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن الأعمش، عن علي بن مدرك، عن هلال بن يساف، عن عمران بن حصين، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ثم الذين يلونهم ثلاثا ثم يجيء قوم من بعدهم يتسمنون ويحبون السمن يعطون الشهادة قبل أن يسألوها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب من حديث الأعمش عن علي بن مدرك وأصحاب الأعمش إنما رووا عن الأعمش عن هلال بن يساف عن عمران بن حصين ‏.‏",
      "text_en": " 'Imran bin Husain narrated that the Messenger of Allah(s.a.w)said:                     \"The best of people are my generation, then those who follow them,then those who follow them, then those who follow them.\"(He(s.a.w)said that) three times. \"Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it.\"",
      "chain": [
        "20356",
        "11060",
        "11377",
        "10835",
        "123"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا هشام بن عبد الملك، قال أنبأنا شعبة، ح وأنبأنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، - واللفظ له - عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali that the Prophet (ﷺ) said:                      \"The angels do not enter a house where there is an image, a dog or a Junub person.\"",
      "chain": [
        "30123",
        "20020",
        "30359",
        "20031",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "4131",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، وعبد الرحمن، قالا حدثنا شعبة، عن علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، عن جرير، أن رسول الله صلى الله عليه وسلم في حجة الوداع استنصت الناس قال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jarir that :                     During the Farewell Pilgrimage, the Messenger of Allah [SAW] asked the people to be quiet and listen, and said: \"Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another).\"",
      "chain": [
        "30160",
        "20278",
        "20033",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "4281",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، ويحيى بن سعيد، قالا حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الملائكة لا تدخل بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that the Prophet said:                     \"The angels do not enter a house in which there is a picture, a dog or a person who is Junub.\"",
      "chain": [
        "30160",
        "20278",
        "20031",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "4458",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقرأها رسول الله صلى الله عليه وسلم قال أبو ذر خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنفق سلعته بالحلف الكاذب والمنان عطاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three to whom Allah will not speak on the Day of Resurrection, or will He look at them, or sanctify them, and theirs will be a painful torment: Abu Dharr said:\" May they be lost and doomed: He said: \"The one who drags his Izar (below the ankles) the one who sells his product by means of false oaths, and the one who reminds others (Al-Mannan) of what he has given to them\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن المسعودي، عن علي بن مدرك، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقلت من هم يا رسول الله فقد خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنان عطاءه والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet (ﷺ) said:                     \"There are three to whom Allah will not speak on the Day of Resurrection nor will He look at them or purify them, and theirs will be a painful torment.\" I said: \"Who are they, O Messenger of Allah? For they are indeed losers.\" He said: \"The one who lets his garment hang beneath his ankles, the one who reminds another of what he has given him, and the one who sells his product by means of false oaths.\"",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20724",
        "11377",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "3781",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا غندر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali bin Abu Talib that the Prophet (ﷺ) said:                     “Theangels do not enter a house in which there is a dog or an image.”",
      "chain": [
        "20436",
        "20278",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "4077",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، وعبد الرحمن بن مهدي، قالا حدثنا شعبة، عن علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن جرير بن عبد الله، أن رسول الله  صلى الله عليه وسلم  قال في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jarir bin ‘Abdullah that the Messenger ofAllah(ﷺ) said, during the Farewell Pilgrimage:                      “Make the peoplepayattention.” Then he said: “Do not turn back into disbelieversafter Iam gone, striking one another’s necks.”",
      "chain": [
        "30160",
        "20173",
        "20033",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    }
  ],
  "total_hadiths": 19
}