{
  "id": "11371",
  "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
  "full_name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين  أبو حصين",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "127",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "B.Asad",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11620",
      "name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11174",
      "name": "Suwayd bin Ghaflah bin Awsajah سويد بن غفلة بن عوسجة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11646",
      "name": "'Umayr bin Sa'id al-Nakha'i عمير بن سعيد النخعي الصهباني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11392",
      "name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11664",
      "name": "Yahya bin Wathab يحيى بن وثاب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-110",
      "hadith_no": "110",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى، قال حدثنا أبو عوانة، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تسموا باسمي ولا تكتنوا بكنيتي، ومن رآني في المنام فقد رآني، فإن الشيطان لا يتمثل في صورتي، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Name yourselves with my name (use my name) but do not name yourselves with my Kunya name (i.e. Abul Qasim). And whoever sees me in a dream then surely he has seen me for Satan cannot impersonate me. And whoever tells a lie against me (intentionally), then (surely) let him occupy his seat in Hell-fire.\"",
      "usc_msa_ref": "110",
      "chain": [
        "20040",
        "20469",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-269",
      "hadith_no": "269",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، عن أبي حصين، عن أبي عبد الرحمن، عن علي، قال كنت رجلا مذاء فأمرت رجلا أن يسأل النبي صلى الله عليه وسلم لمكان ابنته فسأل فقال ‏\"‏ توضأ واغسل ذكرك ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet I requested a man to ask him about it. So the man asked the Prophet about it. The Prophet replied, \"Perform ablution after washing your organ (penis).",
      "usc_msa_ref": "269",
      "chain": [
        "20296",
        "20320",
        "11371",
        "11359",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-1139",
      "hadith_no": "1139",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق، قال حدثنا عبيد الله، قال أخبرنا إسرائيل، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، قال سألت عائشة  رضى الله عنها  عن صلاة رسول الله صلى الله عليه وسلم بالليل‏.‏ فقالت سبع وتسع وإحدى عشرة سوى ركعتى الفجر‏.‏",
      "text_en": " Narrated Masruq:                     I asked Aisha about the night prayer of Allah's Apostle and she said, \"It was seven, nine or eleven rak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"",
      "usc_msa_ref": "240",
      "chain": [
        "30313",
        "20260",
        "20311",
        "11371",
        "11664",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2044",
      "hadith_no": "2044",
      "source": "Sahih Bukhari",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعتكف في كل رمضان عشرة أيام، فلما كان العام الذي قبض فيه اعتكف عشرين يوما‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.",
      "usc_msa_ref": "260",
      "chain": [
        "30201",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2355",
      "hadith_no": "2355",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود، أخبرنا عبيد الله، عن إسرائيل، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المعدن جبار، والبئر جبار، والعجماء جبار، وفي الركاز الخمس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"No bloodmoney will be charged if somebody dies in a mine or in a well or is killed by an animal; and if somebody finds a treasure in his land he has to give one-fifth of it to the Government.\"",
      "usc_msa_ref": "545",
      "chain": [
        "30277",
        "11201",
        "20311",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2785",
      "hadith_no": "2785",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عفان، حدثنا همام، حدثنا محمد بن جحادة، قال أخبرني أبو حصين، أن ذكوان، حدثه أن أبا هريرة  رضى الله عنه  حدثه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال دلني على عمل يعدل الجهاد‏.‏ قال ‏\"‏ لا أجده  قال  هل تستطيع إذا خرج المجاهد أن تدخل مسجدك فتقوم ولا تفتر وتصوم ولا تفطر ‏\"‏‏.‏ قال ومن يستطيع ذلك قال أبو هريرة إن فرس المجاهد ليستن في طوله فيكتب له حسنات‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"Instruct me as to such a deed as equals Jihad (in reward).\" He replied, \"I do not find such a deed.\" Then he added, \"Can you, while the Muslim fighter is in the battle-field, enter your mosque to perform prayers without cease and fast and never break your fast?\" The man said, \"But who can do that?\" Abu- Huraira added, \"The Mujahid (i.e. Muslim fighter) is rewarded even for the footsteps of his horse while it wanders bout (for grazing) tied in a long rope.\"",
      "usc_msa_ref": "44",
      "chain": [
        "30313",
        "30106",
        "20297",
        "18897",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2886",
      "hadith_no": "2886",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏ لم يرفعه إسرائيل عن أبي حصين‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Let the slave of Dinar and Dirham of Quantify and      Khamisa (i.e. money and luxurious clothes) perish for he is pleased if     these things are given to him, and if not, he is displeased!\"",
      "usc_msa_ref": "",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3529",
      "hadith_no": "3529",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا خالد بن يزيد الكاهلي، حدثنا أبو بكر، عن أبي حصين، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما‏.‏ ‏{‏وجعلناكم شعوبا وقبائل‏}‏ قال الشعوب القبائل العظام، والقبائل البطون‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: 'And (We) made you into Shu'ub and Qabail-- (49.13) that Shu'uib means the big Qabail (i.e. nations) while the Qabail (i.e. tribes) means the branch tribes.",
      "usc_msa_ref": "695",
      "chain": [
        "30191",
        "20436",
        "11371",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3560",
      "hadith_no": "3560",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إسحاق بن إبراهيم، حدثنا يحيى بن آدم، أخبرنا إسرائيل، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عمرو بن لحى بن قمعة بن خندف أبو خزاعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"`Amr bin Luhai bin Qam'a bin Khindif was the father of Khuza`a.'",
      "usc_msa_ref": "722",
      "chain": [
        "30123",
        "20364",
        "20311",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3751",
      "hadith_no": "3751",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن رافع، حدثنا حسين، عن زائدة، عن أبي حصين، عن سعد بن عبيدة، قال جاء رجل إلى ابن عمر، فسأله عن عثمان،، فذكر عن محاسن، عمله، قال لعل ذاك يسوؤك‏.‏ قال نعم‏.‏ قال فأرغم الله بأنفك‏.‏ ثم سأله عن علي، فذكر محاسن عمله قال هو ذاك، بيته أوسط بيوت النبي صلى الله عليه وسلم‏.‏ ثم قال لعل ذاك يسوؤك‏.‏ قال أجل‏.‏ قال فأرغم الله بأنفك، انطلق فاجهد على جهدك‏.‏",
      "text_en": " Narrated Sa`d bin 'Ubaida:                     A man came to Ibn `Umar and asked about `Uthman and Ibn `Umar mentioned his good deeds and said to the questioner. \"Perhaps these facts annoy you?\" The other said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you)!' Then the man asked him about `Ali. Ibn `Umar mentioned his good deeds and said, \"It is all true, and that is his house in the midst of the houses of the Prophet. Perhaps these facts have hurt you?\" The questioner said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you or make you do things which you hate) ! Go away and do whatever you can against me.\"",
      "usc_msa_ref": "54",
      "chain": [
        "30375",
        "11278",
        "20320",
        "11371",
        "11344"
      ]
    },
    {
      "id": "sahih-bukhari-4238",
      "hadith_no": "4238",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن إسحاق، حدثنا محمد بن سابق، حدثنا مالك بن مغول، قال سمعت أبا حصين، قال قال أبو وائل لما قدم سهل بن حنيف من صفين أتيناه نستخبره فقال اتهموا الرأى، فلقد رأيتني يوم أبي جندل ولو أستطيع أن أرد على رسول الله صلى الله عليه وسلم أمره لرددت، والله ورسوله أعلم، وما وضعنا أسيافنا على عواتقنا لأمر يفظعنا إلا أسهلن بنا إلى أمر نعرفه قبل هذا الأمر، ما نسد منها خصما إلا انفجر علينا خصم ما ندري كيف نأتي له‏.‏",
      "text_en": " Narrated Abu Wail:                     When Sahl bin Hunaif returned from (the battle of) Siffin, we went to ask him (as to why he had come back). He replied, \"(You should not consider me a coward) but blame your opinions. I saw myself on the day of Abu Jandal (inclined to fight), and if I had the power of refusing the order of Allah's Apostle then, I would have refused it (and fought the infidels bravely). Allah and His Apostle know (what is convenient) better. Whenever we put our swords on our shoulders for any matter that terrified us, our swords led us to an easy agreeable solution before the present situation (of disagreement and dispute between the Muslims). When we mend the breach in one side, it opened in another, and we do not know what to do about it.\"",
      "usc_msa_ref": "502",
      "chain": [
        "30323",
        "30209",
        "20358",
        "11371"
      ]
    },
    {
      "id": "sahih-bukhari-4605",
      "hadith_no": "4605",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس  أراه قال  حدثنا أبو بكر، عن أبي حصين، عن أبي الضحى، عن ابن عباس، ‏{‏حسبنا الله ونعم الوكيل‏}‏ قالها إبراهيم عليه السلام حين ألقي في النار، وقالها محمد صلى الله عليه وسلم حين قالوا ‏{‏إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     'Allah is Sufficient for us and He Is the Best Disposer of affairs,\" was said by Abraham when he was thrown into the fire; and it was said by Muhammad when they (i.e. hypocrites) said, \"A great army is gathering against you, therefore, fear them,\" but it only increased their faith and they said: \"Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).\" (3.173)",
      "usc_msa_ref": "86",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11392"
      ]
    },
    {
      "id": "sahih-bukhari-4606",
      "hadith_no": "4606",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي حصين، عن أبي الضحى، عن ابن عباس، قال كان آخر قول إبراهيم حين ألقي في النار حسبي الله ونعم الوكيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The last statement of Abraham when he was thrown into the fire was:--\"Allah is Sufficient for us and He is the Best Disposer (of affairs for us).\" (3.173)",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20311",
        "11371",
        "11392",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4789",
      "hadith_no": "4789",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن الحارث، حدثنا يحيى بن أبي بكير، حدثنا إسرائيل، عن أبي حصين، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال ‏{‏ومن الناس من يعبد الله على حرف‏}‏ قال كان الرجل يقدم المدينة، فإن ولدت امرأته غلاما، ونتجت خيله قال هذا دين صالح‏.‏ وإن لم تلد امرأته ولم تنتج خيله قال هذا دين سوء‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"And among men is he who worships Allah's as it were on the very edge.\" (22.11). A man used to come to Medina as if his wife brought a son and his mares produces offspring. He would say, \"This religion (Islam) is good,\" but if his wife did not give birth to a child and his mares produced no offspring, he would say, \"This religion is bad.\"",
      "usc_msa_ref": "266",
      "chain": [
        "30243",
        "20365",
        "20311",
        "11371",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4966",
      "hadith_no": "4966",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمود، حدثنا عبيد الله، عن إسرائيل، عن أبي حصين، عن مجاهد، عن ابن عباس  رضى الله عنهما  ‏{‏عتل بعد ذلك زنيم‏}‏ قال رجل من قريش له زنمة مثل زنمة الشاة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding the Verse):-- 'Cruel after all that, base-born (of illegitimate birth).' (68.13) It was revealed in connection with a man from Quaraish who had a notable sign (Zanamah) similar to the notable sign which usually-hung on the neck of a sheep (to recognize it).",
      "usc_msa_ref": "439",
      "chain": [
        "30277",
        "11201",
        "20311",
        "11371",
        "11028",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5049",
      "hadith_no": "5049",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا خالد بن يزيد، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال كان يعرض على النبي صلى الله عليه وسلم القرآن كل عام مرة، فعرض عليه مرتين في العام الذي قبض، وكان يعتكف كل عام عشرا فاعتكف عشرين في العام الذي قبض ‏{‏فيه‏}‏",
      "text_en": " Narrated Abu-Huraira:                     Gabriel used to repeat the recitation of the Qur'an with the Prophet once a year, but he repeated it twice with him in the year he died. The Prophet used to stay in I`tikaf for ten days every year (in the month of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.",
      "usc_msa_ref": "520",
      "chain": [
        "11408",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5816",
      "hadith_no": "5816",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن الحكم، حدثنا النضر، أخبرنا إسرائيل، أخبرنا أبو حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا عدوى، ولا طيرة، ولا هامة، ولا صفر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no 'Adha, nor Tiyara, nor Hama, nor Safar.\"",
      "usc_msa_ref": "653",
      "chain": [
        "20291",
        "20311",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6087",
      "hadith_no": "6087",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anybody who believes in Allah and the Last Day should not harm his neighbor, and anybody who believes in Allah and the Last Day should entertain his guest generously and anybody who believes in Allah and the Last Day should talk what is good or keep quiet. (i.e. abstain from all kinds of evil and dirty talk).",
      "usc_msa_ref": "47",
      "chain": [
        "30367",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6184",
      "hadith_no": "6184",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني يحيى بن يوسف، أخبرنا أبو بكر  هو ابن عياش  عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رجلا، قال للنبي صلى الله عليه وسلم أوصني‏.‏ قال ‏\"‏ لا تغضب ‏\"‏‏.‏ فردد مرارا، قال ‏\"‏ لا تغضب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man said to the Prophet , \"Advise me! \"The Prophet said, \"Do not become angry and furious.\" The man asked (the same) again and again, and the Prophet said in each case, \"Do not become angry and furious.\"",
      "usc_msa_ref": "137",
      "chain": [
        "30282",
        "20373",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6206",
      "hadith_no": "6206",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن مهدي، حدثنا سفيان، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day, should not hurt his neighbor and whoever believes in Allah and the Last Day, should serve his guest generously and whoever believes in Allah and the Last Day, should talk what is good or keep quiet.\"",
      "usc_msa_ref": "158",
      "chain": [
        "30351",
        "20033",
        "20012",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6268",
      "hadith_no": "6268",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ سموا باسمي ولا تكتنوا بكنيتي، ومن رآني في المنام فقد رآني، فإن الشيطان لا يتمثل صورتي، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Name yourselves after me (by my name), but do not call yourselves by my Kuniya, and whoever sees me in a dream, he surely sees me, for Satan cannot impersonate me (appear in my figure). And whoever intentionally ascribes something to me falsely, he will surely take his place in the (Hell) Fire.",
      "usc_msa_ref": "217",
      "chain": [
        "20040",
        "20469",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6511",
      "hadith_no": "6511",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Perish the slave of Dinar, Dirham, Qatifa (thick soft cloth), and Khamisa (a garment), for if he is given, he is pleased; otherwise he is dissatisfied.\"",
      "usc_msa_ref": "443",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6523",
      "hadith_no": "6523",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس الغنى عن كثرة العرض، ولكن الغنى غنى النفس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Riches does not mean, having a great amount of property, but riches is selfcontentment.\"",
      "usc_msa_ref": "453",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6584",
      "hadith_no": "6584",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏‏.‏ يعني إصبعين‏.‏ تابعه إسرائيل عن أبي حصين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
      "usc_msa_ref": "512",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6831",
      "hadith_no": "6831",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا محمود، أخبرنا عبيد الله، عن إسرائيل، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى بالمؤمنين من أنفسهم، فمن مات وترك مالا فماله لموالي العصبة، ومن ترك كلا أو ضياعا، فأنا وليه فلأدعى له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"I am more closer to the believers than their ownselves, so whoever (among them) dies leaving some inheritance, his inheritance will be given to his 'Asaba, and whoever dies leaving a debt or dependants or destitute children, then I am their supporter.\"",
      "usc_msa_ref": "737",
      "chain": [
        "30277",
        "11201",
        "20311",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6865",
      "hadith_no": "6865",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا أبو حصين، سمعت عمير بن سعيد النخعي، قال سمعت علي بن أبي طالب  رضى الله عنه  قال ما كنت لأقيم حدا على أحد فيموت، فأجد في نفسي، إلا صاحب الخمر، فإنه لو مات وديته، وذلك أن رسول الله صلى الله عليه وسلم لم يسنه‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Apostle for the drunk.",
      "usc_msa_ref": "769",
      "chain": [
        "30143",
        "20226",
        "20012",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-7189",
      "hadith_no": "7189",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يحيى بن آدم، حدثنا أبو بكر بن عياش، حدثنا أبو حصين، حدثنا أبو مريم عبد الله بن زياد الأسدي، قال لما سار طلحة والزبير وعائشة إلى البصرة بعث علي عمار بن ياسر وحسن بن علي، فقدما علينا الكوفة فصعدا المنبر، فكان الحسن بن علي فوق المنبر في أعلاه، وقام عمار أسفل من الحسن، فاجتمعنا إليه فسمعت عمارا يقول إن عائشة قد سارت إلى البصرة، ووالله إنها لزوجة نبيكم صلى الله عليه وسلم في الدنيا والآخرة، ولكن الله تبارك وتعالى ابتلاكم، ليعلم إياه تطيعون أم هي‏.‏",
      "text_en": " Narrated Abu Maryam `Abdullah bin Ziyad Al-Aasadi:                     When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir and Hasan bin `Ali who came to us at Kufa and ascended the pulpit. Al-Hasan bin `Ali was at the top of the pulpit and `Ammar was below Al-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has moved to Al-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But Allah has put you to test whether you obey Him (Allah) or her (`Aisha).",
      "usc_msa_ref": "220",
      "chain": [
        "30351",
        "20364",
        "20373",
        "11371"
      ]
    },
    {
      "id": "sahih-bukhari-7461",
      "hadith_no": "7461",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، سمعا الأسود بن هلال، عن معاذ بن جبل، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن يعبدوه ولا يشركوا به شيئا، أتدري ما حقهم عليه ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     The Prophet said, \"O Mu`adh! Do you know what Allah's Right upon His slaves is?\" I said, \"Allah and His Apostle know best.\" The Prophet said, \"To worship Him (Allah) Alone and to join none in worship with Him (Allah). Do you know what their right upon Him is?\" I replied, \"Allah and His Apostle know best.\" The Prophet said, \"Not to punish them (if they do so).",
      "usc_msa_ref": "470",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "id": "sahih-muslim-4",
      "hadith_no": "4",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا محمد بن عبيد الغبري، حدثنا أبو عوانة، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20469",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-154",
      "hadith_no": "154",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، أنهما سمعا الأسود بن هلال، يحدث عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن يعبد الله ولا يشرك به شىء - قال - أتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ فقال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that the Messenger of Allah (may peace be upon him) said:                      Mu'adh, do you know the right of Allah over His bondsmen? He (Mu'adh) said: Allah and His Apostle know best. He (the Messenger of Allah) said: That Allah alone should be worshipped and nothing should be associated with Him. He (the Holy Prophet) said: What right have they (bondsmen) upon Him in case they do it? He (Mu'adh) said: Allah and His Apostle know best. He (the Holy Prophet) said: That He would not punish them.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "id": "sahih-muslim-155",
      "hadith_no": "155",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏\"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It is narrated on the authority of Aswad b. Hilal that he heard Mu'adh say this:                      The Messenger of Allah (may peace be upon him) called, me and I replied to him. He (the Holy Prophet) said: Do you know the right of Allah upon the people? and then followed the hadith (mentioned above).",
      "usc_msa_ref": "",
      "chain": [
        "11278",
        "20320",
        "11371",
        "11620",
        "32"
      ]
    },
    {
      "id": "sahih-muslim-183",
      "hadith_no": "183",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      He who believes in Allah and the Last Day does not harm is neighbour, and he who believes in Allah and the Last Day shows hospitality to his guest and he who believes in Allah and the Last Day speaks good or remains silent.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1771",
      "hadith_no": "1771",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، عن سفيان، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، عن عائشة، قالت من كل الليل قد أوتر رسول الله صلى الله عليه وسلم من أول الليل وأوسطه وآخره فانتهى وتره إلى السحر ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) used to observe Witr every night, and he would (at times) complete his Witr at the end of the night.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20012",
        "11371",
        "11664",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4555",
      "hadith_no": "4555",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني محمد بن منهال الضرير، حدثنا يزيد بن زريع، حدثنا سفيان الثوري، عن أبي حصين، عن عمير بن سعيد، عن علي، قال ما كنت أقيم على أحد حدا فيموت فيه فأجد منه في نفسي إلا صاحب الخمر لأنه إن مات وديته لأن رسول الله صلى الله عليه وسلم لم يسنه ‏.‏",
      "text_en": " Ali reported:                      If I impose Hadd on anyone, and he (in course of punish ment) dies, I would not mind except in case of a drunkard. If he dies. I would pay indemnity for him because the Messenger of Allah (may peace be upon him) has laid down no rule for it.",
      "usc_msa_ref": "",
      "chain": [
        "30173",
        "20304",
        "20012",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-4736",
      "hadith_no": "4736",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني إبراهيم بن سعيد الجوهري، حدثنا أبو أسامة، عن مالك بن مغول، عن أبي حصين، عن أبي وائل، قال سمعت سهل بن حنيف، بصفين يقول اتهموا رأيكم على دينكم فلقد رأيتني يوم أبي جندل ولو أستطيع أن أرد أمر رسول الله صلى الله عليه وسلم - ما فتحنا منه في خصم إلا انفجر علينا منه خصم ‏.‏",
      "text_en": " It has been narrated through a different chain of transmitters on the authority of Abu Wa'il who said:                      I heard Sahl b. Hunaif say at Siffin: Blame (the hollowness) of your views about your religion. I thought to myself on the day of Abu Jandal that if I could turn down the order of the Messenger of Allah (may peace be upon him), I would. The situation was so difficult that if we mended it at one place, it was rent at another.",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20318",
        "20358",
        "11371",
        "11353",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-460",
      "hadith_no": "460",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسحاق أبو بكر، - يعني الصاغاني - حدثنا أبو بدر، شجاع بن الوليد حدثنا شريك، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، - قال أبو بدر - أراه قد رفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ إن الحصاة لتناشد الذي يخرجها من المسجد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported (Abu Bakr said that in his opinion he narrated this tradition from the Prophet):                      The gravels adjure the person when removes them from the mosque.",
      "usc_msa_ref": "",
      "chain": [
        "11107",
        "20328",
        "20587",
        "11371",
        "11161",
        "13",
        "36577"
      ]
    },
    {
      "id": "sunan-abi-daud-631",
      "hadith_no": "631",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا زائدة، عن أبي حصين، عن أبي صالح، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم صلى في ثوب واحد بعضه على ‏.‏",
      "text_en": " ‘A’ishah said; the prophet (ﷺ) prayed in a single (piece of) cloth whose one part was upon me.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20320",
        "11371",
        "11161",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2401",
      "hadith_no": "2401",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي حصين، عن سعيد بن جبير، عن ابن عباس، قال إذا مرض الرجل في رمضان ثم مات ولم يصم أطعم عنه ولم يكن عليه قضاء وإن كان عليه نذر قضى عنه وليه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     If a man falls ill during Ramadan and he dies, while he could not keep the fast, food will be provided (for the poor men) on his behalf ; there is no atonement (for his fasts) due from him. If there is some vow which he could not fulfill, his heir must atone on his behalf.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11371",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2466",
      "hadith_no": "2466",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، عن أبي بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يعتكف كل رمضان عشرة أيام فلما كان العام الذي قبض فيه اعتكف عشرين يوما ‏.‏",
      "text_en": " Abu Hurairah said:                      The Prophet (ﷺ) used to observe I'tikaf during ten days of Ramadan every year. But when the year in which he died, he observed I'tikaf for twenty days.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "2",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3386",
      "hadith_no": "3386",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن كثير العبدي، أخبرنا سفيان، حدثني أبو حصين، عن شيخ، من أهل المدينة عن حكيم بن حزام، أن رسول الله صلى الله عليه وسلم بعث معه بدينار يشتري له أضحية فاشتراها بدينار وباعها بدينارين فرجع فاشترى له أضحية بدينار وجاء بدينار إلى النبي صلى الله عليه وسلم فتصدق به النبي صلى الله عليه وسلم ودعا له أن يبارك له في تجارته ‏.‏",
      "text_en": " Narrated Hakim ibn Hizam:                     The Messenger of Allah (ﷺ) sent with him a dinar to buy a sacrificial animal for him. He bought a sheep for a dinar, sold it for two and then returned and bought a sacrificial animal for a dinar for him and brought the (extra) dinar to the Prophet (ﷺ). The Prophet (ﷺ) gave it as alms (sadaqah) and invoked blessing on him in his trading.",
      "usc_msa_ref": "",
      "chain": [
        "30169",
        "20012",
        "11371",
        "423"
      ]
    },
    {
      "id": "sunan-abi-daud-3535",
      "hadith_no": "3535",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، وأحمد بن إبراهيم، قالا حدثنا طلق بن غنام، عن شريك، - قال ابن العلاء وقيس - عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Pay the deposit to him who deposited it with you, and do not betray him who betrayed you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30494",
        "30197",
        "20587",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4486",
      "hadith_no": "4486",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا شريك، عن أبي حصين، عن عمير بن سعيد، عن علي، رضى الله عنه قال لا أدي - أو ما كنت لأدي - من أقمت عليه حدا إلا شارب الخمر فإن رسول الله صلى الله عليه وسلم لم يسن فيه شيئا إنما هو شىء قلناه نحن ‏.‏",
      "text_en": " ’Ali said:                      I shall not pay blood-money or (he said) : I am not going to pay blood-money for him on whom I inflicted the prescribed punishment except for the one who drank wine, for the Messenger of Allah (ﷺ) did not prescribe anything definite. It is a thing which we have decided (by agreement) ourselves.",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-258",
      "hadith_no": "258",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثنا أبو حصين، عن أبي عبد الرحمن السلمي، قال قال لنا عمر بن الخطاب رضى الله عنه إن الركب سنت لكم فخذوا بالركب ‏.‏ قال وفي الباب عن سعد وأنس وأبي حميد وأبي أسيد وسهل بن سعد ومحمد بن مسلمة وأبي مسعود ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم لا اختلاف بينهم في ذلك إلا ما روي عن ابن مسعود وبعض أصحابه أنهم كانوا يطبقون ‏.‏ والتطبيق منسوخ عند أهل العلم ‏.‏",
      "text_en": " Abu Abdur-Rahman As-Sulami said:                     \"Umar bin Al-Khattab [may Allah be pleased with him] said to us: 'The knees are the Sunnah for you, so hold the knees.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20373",
        "11371",
        "11359",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-349",
      "hadith_no": "349",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا يحيى بن آدم، عن أبي بكر بن عياش، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله أو بنحوه ‏.‏ قال وفي الباب عن جابر بن سمرة والبراء وسبرة بن معبد الجهني وعبد الله بن مغفل وابن عمر وأنس ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وعليه العمل عند أصحابنا وبه يقول أحمد وإسحاق ‏.‏ وحديث أبي حصين عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم حديث غريب ‏.‏ ورواه إسرائيل عن أبي حصين عن أبي صالح عن أبي هريرة موقوفا ولم يرفعه ‏.‏ واسم أبي حصين عثمان بن عاصم الأسدي ‏.‏",
      "text_en": " (Another chain) from Abu Hurairah, :                     from the Prophet and it is the same or similar.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20364",
        "20373",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-457",
      "hadith_no": "457",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثنا أبو حصين، عن يحيى بن وثاب، عن مسروق، أنه سأل عائشة عن وتر، رسول الله صلى الله عليه وسلم فقالت من كل الليل قد أوتر أوله وأوسطه وآخره فانتهى وتره حين مات إلى السحر ‏.‏ قال أبو عيسى أبو حصين اسمه عثمان بن عاصم الأسدي ‏.‏ قال وفي الباب عن علي وجابر وأبي مسعود الأنصاري وأبي قتادة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وهو الذي اختاره بعض أهل العلم الوتر من آخر الليل ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Prophet would perform Witr with thirteen [Rak'ah]. When he was older and became weak he performed Witr with seven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20373",
        "11371",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1257",
      "hadith_no": "1257",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو بكر بن عياش، عن أبي حصين، عن حبيب بن أبي ثابت، عن حكيم بن حزام، أن رسول الله صلى الله عليه وسلم بعث حكيم بن حزام يشتري له أضحية بدينار فاشترى أضحية فأربح فيها دينارا فاشترى أخرى مكانها فجاء بالأضحية والدينار إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح بالشاة وتصدق بالدينار ‏\"‏ ‏.‏ قال أبو عيسى حديث حكيم بن حزام لا نعرفه إلا من هذا الوجه ‏.‏ وحبيب بن أبي ثابت لم يسمع عندي من حكيم بن حزام ‏.‏",
      "text_en": " Narrated Habib bin Abi Thabit:                     From Hakim bin Hizam, that the Messenger of Allah (ﷺ) sent Hakim bin Hizam with a Dinar to buy an animal for Udhiyyah (an animal for sacrifice) for him. He purchases an Udhiyyah which he sold and profited a Dinar from, so he purchased another in its place. And he returned to the Messenger of Allah (ﷺ) with Udhiyyah and the Dinar, so he said: 'The sheep is for sacrifice and Dinar is for charity.'\"[Abu 'Eisa said:] We do not know of the Hadith of Hakim bin Hizam except through this route, and Habib bin Abi Thabit did not hear from Hakim bin Hizam - in my view.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20373",
        "11371",
        "11331",
        "423"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1264",
      "hadith_no": "1264",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا طلق بن غنام، عن شريك، وقيس، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ أد الأمانة إلى من ائتمنك ولا تخن من خانك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا إذا كان للرجل على آخر شيء فذهب به فوقع له عنده شيء فليس له أن يحبس عنه بقدر ما ذهب له عليه ‏.‏ ورخص فيه بعض أهل العلم من التابعين ‏.‏ وهو قول الثوري وقال إن كان له عليه دراهم فوقع له عنده دنانير فليس له أن يحبس بمكان دراهمه إلا أن يقع عنده له دراهم فله حينئذ أن يحبس من دراهمه بقدر ما له عليه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"Fulfill the trust for the one who entrusted you, and do not cheat the one who cheated you.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge followed this Hadith, they said that when something belonging to a man is with another and he leaves (with it), then he has something that belongs to him, he may not withhold from him an equivalent to what the other took of his.Some of the people of knowledge among the Tabi'in allowed that. This is the view of Sufyan Ath-Thawri, he said: \"If one man has some Dirham that belong to another, and the second has some Dinar belonging to the first, he may not withhold any in place of his Dirham, unless it so happens that he has some Dirham of his, then in that case he can withhold some of his Dirham equal to what he is owed by the first.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30197",
        "20587",
        "11046",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1384",
      "hadith_no": "1384",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد، حدثنا أبو بكر بن عياش، عن أبي حصين، عن مجاهد، عن رافع بن خديج، قال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا إذا كانت لأحدنا أرض أن يعطيها ببعض خراجها أو بدراهم وقال ‏\"‏ إذا كانت لأحدكم أرض فليمنحها أخاه أو ليزرعها ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20373",
        "11371",
        "11028",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2152",
      "hadith_no": "2152",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو بكر بن عياش، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم قال علمني شيئا ولا تكثر على لعلي أعيه ‏.‏ قال ‏\"‏ لا تغضب ‏\"‏ ‏.‏ فردد ذلك مرارا كل ذلك يقول ‏\"‏ لا تغضب ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وسليمان بن صرد ‏.‏ وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وأبو حصين اسمه عثمان بن عاصم الأسدي ‏.‏",
      "text_en": " Abu Hurairah narrated that a man came to the Messenger of Allah and said:                     \"Teach me something that is not too much for me so that, perhaps, I may abide by it.\" He (S.A.W) said: \"Do not get angry.\" He repeated that (the request) a number of times, each time he replied: 'Do not get angry.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20373",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2259-2",
      "hadith_no": "2259",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثني محمد بن عبد الوهاب، عن مسعر، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج إلينا رسول الله صلى الله عليه وسلم ونحن تسعة خمسة وأربعة أحد العددين من العرب والآخر من العجم فقال ‏\"‏ اسمعوا هل سمعتم أنه سيكون بعدي أمراء فمن دخل عليهم فصدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس بوارد على الحوض ومن لم يدخل عليهم ولم يعنهم على ظلمهم ولم يصدقهم بكذبهم فهو مني وأنا منه وهو وارد على الحوض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب لا نعرفه من حديث مسعر إلا من هذا الوجه ‏.‏ قال هارون فحدثني محمد بن عبد الوهاب، عن سفيان، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏قال هارون وحدثني محمد، عن سفيان، عن زبيد، عن إبراهيم، وليس، بالنخعي عن كعب بن عجرة، عن النبي صلى الله عليه وسلم نحو حديث مسعر ‏.‏ قال وفي الباب عن حذيفة ‏.‏",
      "text_en": " It was narrated from Ka'b bin 'Ujrah who said:                     \"The Messenger of Allah(s.a.w) came out to us, we were made up of nine; five and four. The first of the numbers for the Arabs, and the latter for the non-Arabs. He said: 'Listen, have you heard that after me there will leaders, whoever enters upon them and condones to their lies, and supports them in their oppression, then he is not from me and I am not from him, and he shall not drink with me from the Hawd. And whoever does not enter upon them, nor help them in their oppression, nor condones to their lies, then he is from me, and I am from him, and he shall drink with me at the Hawd.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20359",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2373",
      "hadith_no": "2373",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن بديل بن قريش اليامي الكوفي، حدثنا أبو بكر بن عياش، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس الغنى عن كثرة العرض ولكن الغنى غنى النفس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حصين اسمه عثمان بن عاصم الأسدي ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Richness is not having many possessions, but richness is being content with oneself.\"",
      "usc_msa_ref": "",
      "chain": [
        "35000",
        "20373",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4263",
      "hadith_no": "4263",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا أبو بكر بن عياش، عن أبي حصين، عن عبد الله بن زياد الأسدي، قال سمعت عمار بن ياسر، يقول هي زوجته في الدنيا والآخرة ‏.‏ يعني عائشة رضى الله عنها ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وفي الباب عن علي بن أبي طالب ‏.‏",
      "text_en": " Narrated 'Ammar bin Yasir:                     \"She is his wife in the world and in the Hereafter.\" - meaning: 'Aishah [may Allah be pleased with her].",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20373",
        "11371",
        "25"
      ]
    },
    {
      "id": "sunan-an-nasai-153",
      "hadith_no": "153",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هناد بن السري، عن أبي بكر بن عياش، عن أبي حصين، عن أبي عبد الرحمن، قال قال علي كنت رجلا مذاء وكانت ابنة النبي صلى الله عليه وسلم تحتي فاستحييت أن أسأله فقلت لرجل جالس إلى جنبي سله ‏.‏ فسأله فقال ‏\"‏ فيه الوضوء ‏\"‏ ‏.‏",
      "text_en": " 'Ali said:                      \"I was a man who had a lot of prostatic discharge, and the daughter of the Prophet (ﷺ) was married to me, so I felt shy to ask him (about that). I said to a man who was sitting beside me: 'Ask him,' so he asked him and he said: 'Perform Wudu' for that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20373",
        "11371",
        "11359"
      ]
    },
    {
      "id": "sunan-an-nasai-1006",
      "hadith_no": "1006",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن رجاء، قال أنبأنا إسرائيل، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، عن عبد الله، وأتاه، رجل فقال إني قرأت الليلة المفصل في ركعة ‏.‏ فقال هذا كهذ الشعر لكن رسول الله صلى الله عليه وسلم كان يقرأ النظائر عشرين سورة من المفصل من آل حم ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     A man came to him and said: \"Last night I recited Al-Mufassal in one rak'ah.\" He said: \"That is like reciting poetry. But the Messenger of Allah (ﷺ) used to recite similar surahs, twenty surahs from Al-Mufassal, those that start with Ha-Mim.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20245",
        "20311",
        "11371",
        "11018",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1035",
      "hadith_no": "1035",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن سفيان، عن أبي حصين، عن أبي عبد الرحمن السلمي، قال قال عمر إنما السنة الأخذ بالركب ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman As-Sulami said:                     \" 'Umar said: 'The Sunnah is to hold the knees.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20012",
        "11371",
        "11359"
      ]
    },
    {
      "id": "sunan-an-nasai-1623",
      "hadith_no": "1623",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن سعيد، عن إسحاق بن سليمان، عن أبي سنان، عن أبي حصين، عن شقيق، عن حذيفة، قال كنا نؤمر بالسواك إذا قمنا من الليل ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"We were commanded to use the siwak when we got up to pray at night.\"",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20310",
        "11371",
        "11353",
        "145"
      ]
    },
    {
      "id": "sunan-an-nasai-1624",
      "hadith_no": "1624",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال أنبأنا إسرائيل، عن أبي حصين، عن شقيق، قال كنا نؤمر إذا قمنا من الليل أن نشوص أفواهنا بالسواك ‏.‏",
      "text_en": " It was narrated that Shaqiq said:                     \"We were commanded, when we got up to pray at night, to clean our mouths with the siwak.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11371",
        "11353"
      ]
    },
    {
      "id": "sunan-an-nasai-1681",
      "hadith_no": "1681",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، عن سفيان، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، عن عائشة، قالت أوتر رسول الله صلى الله عليه وسلم من أوله وآخره وأوسطه وانتهى وتره إلى السحر ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Messenger of Allah (ﷺ) prayed witr at the beginning (of the night) and at the end, and in the middle. And toward the end of his life, he settled on performing witr at the end of the night.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11371",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2597",
      "hadith_no": "2597",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هناد بن السري، عن أبي بكر، عن أبي حصين، عن سالم، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'It is not permissible to give charity to a rich man (or one who is independent of means) or to one who is strong and healthy.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "2",
        "11371",
        "11011",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3128",
      "hadith_no": "3128",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عفان، قال حدثنا همام، قال حدثنا محمد بن جحادة، قال حدثني أبو حصين، أن ذكوان، حدثه أن أبا هريرة حدثه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال دلني على عمل يعدل الجهاد قال ‏\"‏ لا أجده هل تستطيع إذا خرج المجاهد تدخل مسجدا فتقوم لا تفتر وتصوم لا تفطر ‏\"‏ ‏.‏ قال من يستطيع ذلك",
      "text_en": " Abu Hurairah said:                      \"A man came to the Messenger of Allah (ﷺ) and said: 'Tell me of an action that is equal to Jihad.' He said: 'I cannot. When the Mujahid goes out, can you enter the Masjid and stand in prayer and never rest, and fast and never break your fast?' He said: 'Who can do that?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "30106",
        "20297",
        "18897",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3868",
      "hadith_no": "3868",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي حصين، عن مجاهد، قال قال رافع بن خديج نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وأمر رسول الله صلى الله عليه وسلم على الرأس والعين نهانا أن نتقبل الأرض ببعض خرجها‏.‏‏ تابعه إبراهيم بن مهاجر‏.‏‏",
      "text_en": " (The previously mentioned chain) from Mujahid who said:                      \"Rafi' bin Khadij said: 'The Messenger of Allah forbade us to do something that was beneficial for us, (but we respect and obey the command of the Messenger of Allah). He forbade us to lease land in return for some of its produce.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11371",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-4207",
      "hadith_no": "4207",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن تسعة فقال ‏\"‏ إنه ستكون بعدي أمراء من صدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس بوارد على الحوض ومن لم يصدقهم بكذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وهو وارد على الحوض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"The Messenger of Allah came out to us, and there were nine of us. He said; 'After me there will be rulers, whoever believes in their lies and helps them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern. Whoever does not believe their lies and does not help them in their wrongdoing, he is of me, and I am of hi, and he will come to me at the Cistern.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "id": "sunan-an-nasai-4208",
      "hadith_no": "4208",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا محمد، - يعني ابن عبد الوهاب - قال حدثنا مسعر، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج إلينا رسول الله صلى الله عليه وسلم ونحن تسعة خمسة وأربعة أحد العددين من العرب والآخر من العجم فقال ‏\"‏ اسمعوا هل سمعتم أنه ستكون بعدي أمراء من دخل عليهم فصدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس يرد على الحوض ومن لم يدخل عليهم ولم يصدقهم بكذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وسيرد على الحوض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"The Messenger of Allah came out to us and we were nine, fie and four, some 'Arabs and some non- 'Arabs. He said: 'Listen. Have you heard that after me there will be rulers, whoever enters upon them and believes their lies and help them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern? Whoever does not enter upon them or belive their lies or help them in their wrongdoing is of me and I am of him, and he will come to me at the Cistern.\"'",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20359",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "id": "sunan-an-nasai-5313",
      "hadith_no": "5313",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الحميد بن محمد، قال حدثنا مخلد، قال حدثنا مسعر، عن وبرة، عن الشعبي، عن سويد بن غفلة، ح وأخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال حدثنا إسرائيل، عن أبي حصين، عن إبراهيم، عن سويد بن غفلة، عن عمر، أنه لم يرخص في الديباج إلا موضع أربع أصابع ‏.‏",
      "text_en": " It was narrated from 'Umar that:                     He did not allow the wearing of silk except (something) the width of four fingers.",
      "usc_msa_ref": "",
      "chain": [
        "20462",
        "20359",
        "11052",
        "11174",
        "38022",
        "11201",
        "20311",
        "11371",
        "11051",
        "11174",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-5577",
      "hadith_no": "5577",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سفيان، عن أبي حصين، عن سعيد بن جبير، قال السكر حرام والرزق الحسن حلال ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jubair said:                     \"Strong drink is unlawful, and a 'goodly provision' (is lawful).\"",
      "usc_msa_ref": "",
      "chain": [
        "18",
        "20005",
        "11371",
        "11050"
      ]
    },
    {
      "id": "sunan-an-nasai-5580",
      "hadith_no": "5580",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، عن إسرائيل، عن أبي حصين، عن عامر، عن ابن عمر، قال الخمر من خمسة من التمر والحنطة والشعير والعسل والعنب ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Khamr is made from five things: From dates, wheat, barley, honey and grapes.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11371",
        "11052",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1241",
      "hadith_no": "1241",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو بكر بن عياش، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، قال سألت عائشة عن وتر، رسول الله  صلى الله عليه وسلم  فقالت من كل الليل قد أوتر من أوله وأوسطه وانتهى وتره حين مات في السحر ‏.‏",
      "text_en": " It wasnarrated that Masruq said:                      “I asked ‘Aishah about the Witr oftheMessenger of Allah (ﷺ). She said: ‘He prayed Witr at every partof the night, at the beginning, in the middle and at the end, when hedied (he would perform it) just before dawn.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20373",
        "11371",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1841",
      "hadith_no": "1841",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو بكر بن عياش، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال كان النبي  صلى الله عليه وسلم  يعتكف كل عام عشرة أيام فلما كان العام الذي قبض فيه اعتكف عشرين يوما وكان يعرض عليه القرآن في كل عام مرة فلما كان العام الذي قبض فيه عرض عليه مرتين ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) used toobserveI’tikaf for ten days every year. In the year in which hepassedaway, he observed I’tikaf for twenty days. And the Qur’an wouldbe reviewed with him once every year, but in the year in which hepassed away, it was reviewed with him twice.”",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20373",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1912",
      "hadith_no": "1912",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا أبو بكر بن عياش، عن أبي حصين، عن سالم بن أبي الجعد، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     the Messenger of Allah said: “Charity is not permissible for a rich person, or for one who is strong and healthy. ”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20373",
        "11371",
        "11342",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2666",
      "hadith_no": "2666",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن أبي حصين، عن عمير بن سعيد، ح وحدثنا عبد الله بن محمد الزهري، حدثنا سفيان بن عيينة، حدثنا مطرف، سمعته عن عمير بن سعيد، قال قال علي بن أبي طالب ما كنت أدي من أقمت عليه الحد إلا شارب الخمر فإن رسول الله صلى الله عليه وسلم لم يسن فيه شيئا إنما هو شىء جعلناه نحن ‏.‏",
      "text_en": " Ali bin Abi Talib said:                     “I would not pay the blood money (Diyah) for those on whom I carried out the legal punishment, except for the wine-drinker. The Messenger of Allah did not institute anything in that case, rather it is something that we would do.”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11371",
        "11646",
        "20005",
        "11646"
      ]
    },
    {
      "id": "sunan-ibn-majah-2884",
      "hadith_no": "2884",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو داود، ح وحدثنا محمد بن عبد الملك الواسطي، حدثنا يزيد بن هارون، ح وحدثنا علي بن المنذر، حدثنا إسحاق بن منصور، كلهم عن قيس، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو لم يبق من الدنيا إلا يوم لطوله الله عز وجل حتى يملك رجل من أهل بيتي يملك جبل الديلم والقسطنطينية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Even if there was only one day left of this world, Allah wouldmake it last until a man from my household took possession of (themountain of) Dailam and Constantinople.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20547",
        "20472",
        "30313",
        "11046",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4106",
      "hadith_no": "4106",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Whoever believes in Allah and the Last Day, let him saysomething good, or else remain silent.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4176",
      "hadith_no": "4176",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد بن السري، وأبو هشام الرفاعي محمد بن يزيد قالا حدثنا أبو بكر بن عياش، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏ ‏.‏ وجمع بين إصبعيه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “I and the Hour have been sent like these two,” and he helduphis two fingers together.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30478",
        "20373",
        "11371",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 73
}