{
  "id": "11373",
  "name": "'Urwa bin al-Mughira bin Shu'ba عروة بن المغيرة بن شعبة الثقفي",
  "full_name": "'Urwa bin al-Mughira bin Shu'ba عروة بن المغيرة بن شعبة الثقفي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "90",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10903",
      "name": "Hamza bin al-Mughira bin Shu'ba حمزة بن المغيرة بن شعبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13371",
      "name": "Ya'fur bin al-Mughira bin Shu'ba يعفور بن المغيرة بن شعبة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "15374",
      "name": "'Aqqar bin al-Mughira bin Shu'ba عقار بن المغيرة بن شعبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10927",
      "name": "'Aabad bin Ziyad عباد بن زياد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "182",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني سعد بن إبراهيم، أن نافع بن جبير بن مطعم، أخبره أنه، سمع عروة بن المغيرة بن شعبة، يحدث عن المغيرة بن شعبة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر، وأنه ذهب لحاجة له، وأن مغيرة جعل يصب الماء عليه، وهو يتوضأ، فغسل وجهه ويديه ومسح برأسه ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I was in the company of Allah's Apostle on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
      "chain": [
        "30153",
        "20259",
        "11062",
        "11063",
        "11059",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد الحراني، قال حدثنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء، فصب عليه حين فرغ من حاجته، فتوضأ ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Once Allah's Apostle went out to answer the call of nature and I followed him with a tumbler containing water, and when he finished, I poured water and he performed ablution and passed wet hands over his Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30237",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم في سفر، فأهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين ‏\"‏‏.‏ فمسح عليهما‏.‏",
      "text_en": " Narrated `Urwa bin Al-Mughira:                     My father said, \"Once I was in the company of the Prophet on a journey and I dashed to take off his Khuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them after performing ablution. So he passed wet hands over them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "4465",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، عن الليث، عن عبد العزيز بن أبي سلمة، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، قال ذهب النبي صلى الله عليه وسلم لبعض حاجته، فقمت أسكب عليه الماء  لا أعلمه إلا قال في غزوة تبوك  فغسل وجهه، وذهب يغسل ذراعيه فضاق عليه كم الجبة، فأخرجهما من تحت جبته فغسلهما ثم مسح على خفيه‏.‏",
      "text_en": " Narrated `Urwa bin Al-Mughira:                     Al-Mughira bin Shu`ba, said, \"The Prophet went out to answer the call of nature and (when he had finished) I got up to pour water for him.\" I think that he said that the event had taken place during the Ghazwa of Tabuk. Al-Mughira added. \"The Prophet washed his face, and when he wanted to wash his forearms, the sleeves of his cloak became tight over them, so he took them out from underneath the cloak and then he washed them (i.e. his forearms) and passed wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "30399",
        "20023",
        "32017",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "5859",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في سفر فقال ‏\"‏ أمعك ماء ‏\"‏‏.‏ قلت نعم‏.‏ فنزل عن راحلته، فمشى حتى توارى عني في سواد الليل، ثم جاء فأفرغت عليه الإداوة، فغسل وجهه ويديه، وعليه جبة من صوف، فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة، فغسل ذراعيه، ثم مسح برأسه، ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين، فمسح عليهما ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     One night I was with the Prophet on a journey. He asked (me), \"Have you got water with you?\" I replied, \"Yes\" So he got down from his she-camel and went away till he disappeared in the darkness of the night. Then he came back and I poured water for him from the pot (for the ablution). He washed his face and hands while he was wearing a woollen cloak (the sleeves of which were narrow), so he could not take his arms out of it. So he took them out from underneath the cloak. Then he washed his forearms and passed his wet hands over his head. Then I tried to take off his Khuffs (socks made from thick fabric or leather), but he said, \"Leave them, for I have performed ablution before putting them on.\" And so he passed his wet hands over them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء فصب عليه حين فرغ من حاجته فتوضأ ومسح على الخفين ‏.‏ وفي رواية ابن رمح مكان حين حتى ‏.‏",
      "text_en": " The son of Mughira b. Shu'ba reported:                      The Messenger of Allah (may peace be upon him) went out for relieving himself. Mughira went with him carrying a jug full of water. When he (the Holy Prophet) came back after relieving himself, he poured water over him and he performed ablution and wiped over his socks; and in the narration of Ibn Rumh there is\" till\" instead of\" when\".",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، قال أخبرني عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في مسير فقال لي ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ قلت نعم ‏.‏ فنزل عن راحلته فمشى حتى توارى في سواد الليل ثم جاء فأفرغت عليه من الإداوة فغسل وجهه وعليه جبة من صوف فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة فغسل ذراعيه ومسح برأسه ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما فإني أدخلتهما طاهرتين ‏\"‏ ‏.‏ ومسح عليهما ‏.‏",
      "text_en": " 'Urwa b. Mughira reported his father having said:                      I was one night with the Apostle of Allah (may peace be upon him) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا عمر بن أبي زائدة، عن الشعبي، عن عروة بن المغيرة، عن أبيه، أنه وضأ النبي صلى الله عليه وسلم فتوضأ ومسح على خفيه فقال له فقال ‏\"‏ إني أدخلتهما طاهرتين ‏\"‏ ‏.‏",
      "text_en": " 'Urwah al Mughira reported it from his father:                      He (Mughira) helped the Apostle (may peace be upon him) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.",
      "chain": [
        "30514",
        "30313",
        "11643",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن عبد الله بن بزيع، حدثنا يزيد، - يعني ابن زريع - حدثنا حميد الطويل، حدثنا بكر بن عبد الله المزني، عن عروة بن المغيرة بن شعبة، عن أبيه، قال تخلف رسول الله صلى الله عليه وسلم وتخلفت معه فلما قضى حاجته قال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ فأتيته بمطهرة فغسل كفيه ووجهه ثم ذهب يحسر عن ذراعيه فضاق كم الجبة فأخرج يده من تحت الجبة وألقى الجبة على منكبيه وغسل ذراعيه ومسح بناصيته وعلى العمامة وعلى خفيه ثم ركب وركبت فانتهينا إلى القوم وقد قاموا في الصلاة يصلي بهم عبد الرحمن بن عوف وقد ركع بهم ركعة فلما أحس بالنبي صلى الله عليه وسلم ذهب يتأخر فأومأ إليه فصلى بهم فلما سلم قام النبي صلى الله عليه وسلم وقمت فركعنا الركعة التي سبقتنا ‏.‏",
      "text_en": " 'Urwa b. al Mughira b. Shu'ba reported it on the authority of his father that he said:                      The Messenger of Allah (may peace be upon him) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin b. 'Anf leading them and had completed a rak'a. When he perceived the presence of the Apostle of Allah (may peace be upon him) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle (may peace be upon him) got up and I also got up with him, and we offered the rak'a which had been finished before we came.",
      "chain": [
        "30448",
        "20304",
        "11279",
        "11267",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن بشار، ومحمد بن حاتم، جميعا عن يحيى القطان، قال ابن حاتم حدثنا يحيى بن سعيد، عن التيمي، عن بكر بن عبد الله، عن الحسن، عن ابن المغيرة بن شعبة، عن أبيه، قال بكر وقد سمعت من ابن المغيرة، أن النبي صلى الله عليه وسلم توضأ فمسح بناصيته وعلى العمامة وعلى الخفين ‏.‏",
      "text_en": " Bakr reported that he had heard from the son of Mughira that verily the Apostle of Allah (may peace be upon him) performed ablution and wiped over his forehead and wiped over his turban and over his socks.",
      "chain": [
        "30160",
        "38487",
        "20031",
        "11289",
        "11267",
        "11016",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، وحسن بن علي الحلواني، جميعا عن عبد الرزاق، قال ابن رافع حدثنا عبد الرزاق، أخبرنا ابن جريج، حدثني ابن شهاب، عن حديث، عباد بن زياد أن عروة بن المغيرة بن شعبة، أخبره أن المغيرة بن شعبة أخبره أنه، غزا مع رسول الله صلى الله عليه وسلم تبوك - قال المغيرة - فتبرز رسول الله صلى الله عليه وسلم قبل الغائط فحملت معه إداوة قبل صلاة الفجر فلما رجع رسول الله صلى الله عليه وسلم إلى أخذت أهريق على يديه من الإداوة وغسل يديه ثلاث مرات ثم غسل وجهه ثم ذهب يخرج جبته عن ذراعيه فضاق كما جبته فأدخل يديه في الجبة حتى أخرج ذراعيه من أسفل الجبة ‏.‏ وغسل ذراعيه إلى المرفقين ثم توضأ على خفيه ثم أقبل - قال المغيرة - فأقبلت معه حتى نجد الناس قد قدموا عبد الرحمن بن عوف فصلى لهم فأدرك رسول الله صلى الله عليه وسلم إحدى الركعتين فصلى مع الناس الركعة الآخرة فلما سلم عبد الرحمن بن عوف قام رسول الله صلى الله عليه وسلم يتم صلاته فأفزع ذلك المسلمين فأكثروا التسبيح فلما قضى النبي صلى الله عليه وسلم صلاته أقبل عليهم ثم قال ‏\"‏ أحسنتم ‏\"‏ ‏.‏ أو قال ‏\"‏ قد أصبتم ‏\"‏ ‏.‏ يغبطهم أن صلوا الصلاة لوقتها ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that he participated In the expedition of Tabuk along with the Messenger of Allah (may peace be upon him). The Messenger of Allah (may peace be upon him) went out to answer the call of nature before the morning prayer. and I carried along with him a jar (full of water). When the Messenger of Allah (may peace be upon him) came back to me (after relieving himself). I began to pour water upon his hands out of the jar and he washed his hands three times, then washed his face three times. He then tried to tuck up the sleeves of his cloak upon his forearms but since the sleeves were tight he inserted his hands in the cloak and then brought out his forearms up to the elbow below the cloak, and then wiped over his shoes and then moved on. Mughira said:                      I also moved along with him till he came to the people and (he found) that they had been saying their prayer under the Imamah of 'Abd al-Rahman b. 'Auf. The Messenger of Allah (may peace be upon him) could get one rak ah out of two and said (this) last rak'ah along with the people. When Abd al-Rahman b. 'Auf pronounced the salutation, the Messenger of Allah (may peace be upon him) got up to complete the prayer. This made the Muslims terrified and most of them began to recite the glory of the Lord. When the Apostle of Allah (may peace be upon him) finished his prayer, he turned towards them and then said: You did well, or said with a sense of joy: You did the right thing that you said prayer at the appointed hour.",
      "chain": [
        "30375",
        "20121",
        "20121",
        "11070",
        "11013",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، حدثني عباد بن زياد، أن عروة بن المغيرة بن شعبة، أخبره أنه، سمع أباه المغيرة، يقول عدل رسول الله صلى الله عليه وسلم وأنا معه في غزوة تبوك قبل الفجر فعدلت معه فأناخ النبي صلى الله عليه وسلم فتبرز ثم جاء فسكبت على يده من الإداوة فغسل كفيه ثم غسل وجهه ثم حسر عن ذراعيه فضاق كما جبته فأدخل يديه فأخرجهما من تحت الجبة فغسلهما إلى المرفق ومسح برأسه ثم توضأ على خفيه ثم ركب فأقبلنا نسير حتى نجد الناس في الصلاة قد قدموا عبد الرحمن بن عوف فصلى بهم حين كان وقت الصلاة ووجدنا عبد الرحمن وقد ركع بهم ركعة من صلاة الفجر فقام رسول الله صلى الله عليه وسلم فصف مع المسلمين فصلى وراء عبد الرحمن بن عوف الركعة الثانية ثم سلم عبد الرحمن فقام رسول الله صلى الله عليه وسلم في صلاته ‏.‏ ففزع المسلمون فأكثروا التسبيح لأنهم سبقوا النبي صلى الله عليه وسلم بالصلاة فلما سلم رسول الله صلى الله عليه وسلم قال لهم ‏\"‏ قد أصبتم ‏\"‏ ‏.‏ أو ‏\"‏ قد أحسنتم ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah reported:                      I was in the company of the Messenger of Allah (ﷺ) in the expedition of Tabuk. He abandoned the main road before the dawn prayer, and I also did the same along with him. The Prophet (ﷺ) made his camel kneel down and (went to ) relieve himself. He then came back and I poured water upon his hands from the skin-vessel. He then washed his hands and face. He tried to get his forearms out (of the gown), but the sleeves of the gown were too narrow, so he entered back both his hands, and brought them out from beneath the gown. He washed his forearms up to the elbows and wiped his head and wiped over his socks.80 He then mounted (his camel) and we began to proceed until we found people  offering the prayer. They brought forward ‘Abd al-Rahman b. ‘Awf who was leading them in prayer. The Prophet(ﷺ) stood in the row side by side with other Muslims. He performed the second rak’ah of the prayer behind ‘Abd al-Rahman b. ‘Awf. Then ‘Abd al-Rahman uttered salutation. The Prophet(ﷺ) stood to perform the remaining rak’ah of the prayer. The Muslims were alarmed. They began to utter tasbih (Subhan Allah) presuming that they had offered prayer before the Prophet (ﷺ) had done. When he uttered the salutation (i.e. finished his prayer), he said: You were right, or (he said) you did well.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10927",
        "11373"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى يعني ابن سعيد، ح حدثنا مسدد، حدثنا المعتمر، عن التيمي، حدثنا بكر، عن الحسن، عن ابن المغيرة بن شعبة، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم توضأ ومسح ناصيته ‏.‏ وذكر فوق العمامة - قال عن المعتمر - سمعت أبي يحدث عن بكر بن عبد الله عن الحسن عن ابن المغيرة بن شعبة عن المغيرة أن رسول الله صلى الله عليه وسلم كان يمسح على الخفين وعلى ناصيته وعلى عمامته ‏.‏ قال بكر وقد سمعته من ابن المغيرة ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah said:                      The Messenger of Allah (ﷺ) performed ablution and wiped his forelock and turban. Another version says : The Messenger of Allah (ﷺ) wiped his socks and his forelock and his turban. Bakr said: I heard it from Ibn al-Mughirah.",
      "chain": [
        "30175",
        "20031",
        "30175",
        "20288",
        "11289",
        "11267",
        "11016",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثني أبي، عن الشعبي، قال سمعت عروة بن المغيرة بن شعبة، يذكر عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في ركبه ومعي إداوة فخرج لحاجته ثم أقبل فتلقيته بالإداوة فأفرغت عليه فغسل كفيه ووجهه ثم أراد أن يخرج ذراعيه وعليه جبة من صوف من جباب الروم ضيقة الكمين فضاقت فادرعهما ادراعا ثم أهويت إلى الخفين لأنزعهما فقال لي ‏\"‏ دع الخفين فإني أدخلت القدمين الخفين وهما طاهرتان ‏\"‏ ‏.‏ فمسح عليهما ‏.‏ قال أبي قال الشعبي شهد لي عروة على أبيه وشهد أبوه على رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Urwah b. al-Mughirah reported his father as saying :                      We accompanied the Messenger of Allah (ﷺ) to a caravan, and I had a jug of water. He went to relieve himself and came back. I came to him with the jug of water and poured upon him. He washed his hands and face. He had a tight-sleeved Syrian woolen gown. He tried to get his forearms out, but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I then bent down to take off his socks. But he said to me : Leave them, for my feet were clean when I put them in, and he only wiped over them. Yunus said on the authority of al-Sha’bi that ‘Urwah narrated his tradition from his father before him, and his father reported it from the Messenger of Allah (ﷺ).",
      "chain": [
        "30175",
        "20347",
        "10846",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "3489",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا ابن إدريس، ووكيع، عن طعمة بن عمرو الجعفري، عن عمر بن بيان التغلبي، عن عروة بن المغيرة بن شعبة، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من باع الخمر فليشقص الخنازير ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: He who sold wine should shear the flesh of swine.",
      "chain": [
        "30203",
        "20102",
        "20032",
        "25132",
        "15394",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا يونس بن أبي إسحاق، عن الشعبي، عن عروة بن المغيرة بن شعبة، عن أبيه، أن النبي صلى الله عليه وسلم لبس جبة رومية ضيقة الكمين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Urwah bin Al-Mugirah bin Shu'bah:                     From this father: \"The Prophet (ﷺ) wore a Roman Jubbah with tight sleeves.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30401",
        "20032",
        "10846",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن مالك، ويونس، وعمرو بن الحارث، أن ابن شهاب، أخبرهم عن عباد بن زياد، عن عروة بن المغيرة، أنه سمع أباه، يقول سكبت على رسول الله صلى الله عليه وسلم حين توضأ في غزوة تبوك فمسح على الخفين ‏.‏ قال أبو عبد الرحمن لم يذكر مالك عروة بن المغيرة ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Al-Mughirah that he heard his father say:                      \"I poured water for the Messenger of Allah (ﷺ) when he performed Wudu' during the battle of Tabuk, and he wiped over his Khuff.\"",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20001",
        "20475",
        "20377",
        "11013",
        "10927",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، عن بشر بن المفضل، عن ابن عون، عن عامر الشعبي، عن عروة بن المغيرة، عن المغيرة، وعن محمد بن سيرين، عن رجل، حتى رده إلى المغيرة - قال ابن عون ولا أحفظ حديث ذا من حديث ذا - أن المغيرة قال كنا مع رسول الله صلى الله عليه وسلم في سفر فقرع ظهري بعصا كانت معه فعدل وعدلت معه حتى أتى كذا وكذا من الأرض فأناخ ثم انطلق ‏.‏ قال فذهب حتى توارى عني ثم جاء فقال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ ومعي سطيحة لي فأتيته بها فأفرغت عليه فغسل يديه ووجهه وذهب ليغسل ذراعيه وعليه جبة شامية ضيقة الكمين فأخرج يده من تحت الجبة فغسل وجهه وذراعيه وذكر من ناصيته شيئا وعمامته شيئا - قال ابن عون لا أحفظ كما أريد ثم مسح على خفيه - ثم قال ‏\"‏ حاجتك ‏\"‏ ‏.‏ قلت يا رسول الله ليست لي حاجة فجئنا وقد أم الناس عبد الرحمن بن عوف وقد صلى بهم ركعة من صلاة الصبح فذهبت لأوذنه فنهاني فصلينا ما أدركنا وقضينا ما سبقنا ‏.‏",
      "text_en": " Al-Mughirah said:                      \"We were with the Prophet (ﷺ) on a journey, and he tapped me on the back with a stick he had with him, then he turned off (route) and I turned off with him until he came to such and such an area. Then he made his camel stop and went away until he disappeared from me, then he came back and said: 'Do you have water with you?' I had a water skin with me, so I brought it out and poured it for him. He washed his hands and face and began to wash his arms, but he was wearing a Syrian Jubbah[1] that had narrow sleeves, so he brought his arms out from beneath the Jubbah and washed his hands and arms, and wiped his forelock a little and his turban a little.\" - Ibn 'Awn said: \"I cannot remember it well - then he wiped over his Khuffs.\" Then he said: 'What do you need?' I said: 'O Messenger of Allah, I do not need anything.' Then we came and 'Abdur-Rahman bin 'Awf was leading the people in Salah, and he had led them in one Rak'ah of the Subh (Fajr) prayer. I wanted to tell him that the Prophet (ﷺ) had arrived but he did not let me, so we prayed what we had caught up with and made up what we had missed.'\"[1] It is a type of cloak.",
      "chain": [
        "11213",
        "20212",
        "11071",
        "11052",
        "11373",
        "166",
        "11035",
        "166"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث بن سعد، عن يحيى، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة، عن أبيه المغيرة، عن رسول الله صلى الله عليه وسلم أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء فصب عليه حتى فرغ من حاجته فتوضأ ومسح على الخفين ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that the Messenger of Allah (ﷺ) went out to relieve himself, and Al-Mughirah followed him, (carrying) a vessel of water. He poured water for him when he had finished relieving himself, and he performed Wudu' and wiped over his Khuffs.",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11063",
        "11059",
        "11373"
      ]
    },
    {
      "hadith_no": "588",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يحيى بن سعيد، عن سعد بن إبراهيم، عن نافع بن جبير، عن عروة بن المغيرة بن شعبة، عن أبيه المغيرة بن شعبة، عن رسول الله  صلى الله عليه وسلم  أنه خرج لحاجته فاتبعه المغيرة بإداوة فيها ماء حتى فرغ من حاجته فتوضأ ومسح على الخفين ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Mughirah bin Shu'bah from his father Mughirah bin Shu'bah, that:                     The Messenger of Allah went out to relieve himself, and Mughirah followed him with a vessel of water. When he finished relieving himself, he performed ablution and wiped over his leather socks.",
      "chain": [
        "30490",
        "20023",
        "11062",
        "11063",
        "11059",
        "11373"
      ]
    }
  ],
  "total_hadiths": 20
}