{
  "id": "11370",
  "name": "'Ubaida bin 'Amr al-Salamani عبيدة بن عمرو",
  "full_name": "'Ubaida bin 'Amr al-Salamani عبيدة بن عمرو",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "72",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  مخضرم ]"
    ],
    "tags": [
      "al-Salamani",
      "al-Muradi",
      "Makhdaram",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "15840",
      "name": "'Abdullah bin Salmah al-Jmly عبد الله بن سلمة الجملي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10730",
      "name": "Abu Hsan al-A'rj أبو حسان الأعرج",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11347",
      "name": "Sa'id bin Fyrwz Abu al-Bakhtari al-Tai'i سعيد بن فيروز أبو البختري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2652",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خير الناس قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء أقوام تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكانوا يضربوننا على الشهادة والعهد‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"The people of my generation are the best, then those who follow them, and then whose who follow the latter. After that there will come some people whose witness will go ahead of their oaths, and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"We used to be beaten for taking oaths by saying, 'I bear witness by the Name of Allah or by the Covenant of Allah.\"",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  قال لما كان يوم الأحزاب قال رسول الله صلى الله عليه وسلم ‏\"‏ ملأ الله بيوتهم وقبورهم نارا، شغلونا عن الصلاة الوسطى حين غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     When it was the day of the battle of Al-Ahzab (i.e. the clans), Allah's Apostle said, \"O Allah! Fill their (i.e. the infidels') houses and graves with fire as they busied us so much that we did not perform the prayer (i.e. `Asr) till the sun set.\"",
      "chain": [
        "30309",
        "20347",
        "11065",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ خير الناس قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادة أحدهم يمينه ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكانوا يضربونا على الشهادة والعهد ونحن صغار‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"The best people are those living in my generation, and then those who will follow them, and then those who will follow the latter. Then there will come some people who will bear witness before taking oaths, and take oaths before bearing witness.\" (Ibrahim, a sub-narrator said, \"They used to beat us for witnesses and covenants when we were still children.\")",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أيوب، عن ابن سيرين، عن عبيدة، عن علي  رضى الله عنه  قال اقضوا كما كنتم تقضون، فإني أكره الاختلاف حتى يكون للناس جماعة، أو أموت كما مات أصحابي‏.‏ فكان ابن سيرين يرى أن عامة ما يروى على علي الكذب‏.‏",
      "text_en": "  Narrated Ubaida:                       Ali said (to the people of 'Iraq), \"Judge as you used to judge, for I hate differences (and I do my best ) till the people unite as one group, or I die as my companions have died.\"",
      "chain": [
        "20386",
        "20020",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4161",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قال يوم الخندق ‏\"‏ ملأ الله عليهم بيوتهم وقبورهم نارا كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (i.e. Trench), the Prophet said '(Let) Allah fill their (i.e. the infidels') houses and graves with fire just as they have prevented us from offering the Middle Prayer (i.e. `Asr prayer) till the sun had set.\"",
      "chain": [
        "30021",
        "20229",
        "20295",
        "11263",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4575",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يزيد، أخبرنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  قال النبي صلى الله عليه وسلم‏.‏ حدثني عبد الرحمن حدثنا يحيى بن سعيد قال هشام حدثنا قال حدثنا محمد عن عبيدة عن علي  رضى الله عنه  أن النبي صلى الله عليه وسلم قال يوم الخندق ‏\"‏ حبسونا عن صلاة الوسطى حتى غابت الشمس ملأ الله قبورهم وبيوتهم أو أجوافهم  شك يحيى  نارا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (the battle of the Trench). the Prophet said, \"They (i.e. pagans prevented us from offering the middle (the Best) Prayer till the sun had set. May Allah fill their graves, their houses (or their bodies) with fire.\"",
      "chain": [
        "30351",
        "20472",
        "20295",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4625",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة، أخبرنا يحيى، عن سفيان، عن سليمان، عن إبراهيم، عن عبيدة، عن عبد الله، قال يحيى بعض الحديث عن عمرو بن مرة، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏‏.‏ قلت آقرأ عليك وعليك أنزل قال ‏\"‏ فإني أحب أن أسمعه من غيري ‏\"‏‏.‏ فقرأت عليه سورة النساء حتى بلغت ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ قال ‏\"‏ أمسك ‏\"‏‏.‏ فإذا عيناه تذرفان‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     Allah's Apostle said to me, \"Recite (of the Qur'an) for me,\" I said, \"Shall I recite it to you although it had been revealed to you?\" He said, \"I like to hear (the Qur'an) from others.\" So I recited Surat-an- Nisa' till I reached: \"How (will it be) then when We bring from each nation a witness, and We bring you (O Muhammad) as a witness against these people?\" (4.41) Then he said, \"Stop!\" And behold, his eyes were overflowing with tears.\"",
      "chain": [
        "30343",
        "20031",
        "20012",
        "11060",
        "11051",
        "11370",
        "16",
        "11381"
      ]
    },
    {
      "hadith_no": "4859",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  قال جاء حبر من الأحبار إلى رسول الله صلى الله عليه وسلم فقال يا محمد، إنا نجد أن الله يجعل السموات على إصبع والأرضين على إصبع، والشجر على إصبع، والماء والثرى على إصبع، وسائر الخلائق على إصبع، فيقول أنا الملك‏.‏ فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه تصديقا لقول الحبر ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه سبحانه وتعالى عما يشركون‏}‏",
      "text_en": " Narrated `Abdullah:                     A (Jewish) Rabbi came to Allah's Apostle and he said, \"O Muhammad! We learn that Allah will put all the heavens on one finger, and the earths on one finger, and the trees on one finger, and the water and the dust on one finger, and all the other created beings on one finger. Then He will say, 'I am the King.' Thereupon the Prophet smiled so that his pre-molar teeth became visible, and that was the confirmation of the Rabbi. Then Allah's Apostle recited: 'No just estimate have they made of Allah such as due to Him.' (39.67)",
      "chain": [
        "20404",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5103",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الأعمش، قال حدثني إبراهيم، عن عبيدة، عن عبد الله، رضى الله عنه قال قال لي النبي صلى الله عليه وسلم ‏\"‏ اقرأ على القرآن ‏\"‏‏.‏ قلت آقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That the Prophet said to him, \"Recite the Qur'an to me.\" `Abdullah said, \"Shall I recite (the Qur'an) to you while it has been revealed to you?\" He said, \"I like to hear it from others.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5104",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله بن مسعود، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏‏.‏ قلت يا رسول الله آقرأ عليك وعليك أنزل قال ‏\"‏ نعم ‏\"‏‏.‏ فقرأت سورة النساء حتى أتيت إلى هذه الآية ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ قال ‏\"‏ حسبك الآن ‏\"‏‏.‏ فالتفت إليه فإذا عيناه تذرفان‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said to me, \"Recite (the Qur'an) to me.\" I said, \"O Allah's Apostle Shall I recite (the Qur'an) to you while it has been revealed to you?\" He said, \"Yes.\" So I recited Surat-An-Nisa' (The Women), but when I recited the Verse: 'How (will it be) then when We bring from each nation a witness and We bring you (O Muhammad) as a witness against these people.' (4.41) He said, \"Enough for the present,\" I looked at him and behold! His eyes were overflowing with tears",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5110",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا صدقة، أخبرنا يحيى، عن سفيان، عن سليمان، عن إبراهيم، عن عبيدة، عن عبد الله، قال يحيى بعض الحديث عن عمرو بن مرة، قال لي النبي صلى الله عليه وسلم‏.‏  حدثنا مسدد عن يحيى عن سفيان عن الأعمش عن إبراهيم عن عبيدة عن عبد الله قال الأعمش وبعض الحديث حدثني عمرو بن مرة عن إبراهيم وعن أبيه عن أبي الضحى عن عبد الله قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏‏.‏ قال قلت أقرأ عليك وعليك أنزل قال ‏\"‏ إني أشتهي أن أسمعه من غيري ‏\"‏‏.‏ قال فقرأت النساء حتى إذا بلغت ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏‏.‏ قال لي ‏\"‏ كف  أو أمسك  ‏\"‏‏.‏ فرأيت عينيه تذرفان‏.‏",
      "text_en": " Narrated `Abdullah (bin Mas`ud):                     Allah's Apostle said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has been revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa (The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a witness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to me, \"Stop!\" Thereupon I saw his eyes overflowing with tears.",
      "chain": [
        "30343",
        "20031",
        "20012",
        "11060",
        "11051",
        "11370",
        "16",
        "11381"
      ]
    },
    {
      "hadith_no": "6469",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الأنصاري، حدثنا هشام بن حسان، حدثنا محمد بن سيرين، حدثنا عبيدة، حدثنا علي بن أبي طالب  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم يوم الخندق، فقال ‏\"‏ ملأ الله قبورهم وبيوتهم نارا، كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏ وهى صلاة العصر‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     We were in the company of the Prophet on the day (of the battle) of Al-Khandaq (the Trench). The Prophet said, \"May Allah fill their (the infidels') graves and houses with fire, as they have kept us so busy that we could not offer the middle prayer till the sun had set; and that prayer was the `Asr prayer.\"",
      "chain": [
        "30170",
        "20280",
        "11311",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "6505",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خير الناس قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء من بعدهم قوم تسبق شهادتهم أيمانهم وأيمانهم شهادتهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"The best people are those of my generation, and then those who will come after them (the next generation), and then those who will come after them (i.e. the next generation), and then after them, there will come people whose witness will precede their oaths, and whose oaths will precede their witness.\"",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "6651",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ إني لأعلم آخر أهل النار خروجا منها، وآخر أهل الجنة دخولا رجل يخرج من النار كبوا، فيقول الله اذهب فادخل الجنة‏.‏ فيأتيها فيخيل إليه أنها ملأى، فيرجع فيقول يا رب وجدتها ملأى، فيقول اذهب فادخل الجنة‏.‏ فيأتيها فيخيل إليه أنها ملأى‏.‏ فيقول يا رب وجدتها ملأى، فيقول اذهب فادخل الجنة، فإن لك مثل الدنيا وعشرة أمثالها‏.‏ أو إن لك مثل عشرة أمثال الدنيا‏.‏ فيقول تسخر مني، أو تضحك مني وأنت الملك ‏\"‏‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه، وكان يقال ذلك أدنى أهل الجنة منزلة‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"I know the person who will be the last to come out of the (Hell) Fire, and the last to enter Paradise. He will be a man who will come out of the (Hell) Fire crawling, and Allah will say to him, 'Go and enter Paradise.' He will go to it, but he will imagine that it had been filled, and then he will return and say, 'O Lord, I have found it full.' Allah will say, 'Go and enter Paradise, and you will have what equals the world and ten times as much (or, you will have as much as ten times the like of the world).' On that, the man will say, 'Do you mock at me (or laugh at me) though You are the King?\" I saw Allah's Apostle (while saying that) smiling that his premolar teeth became visible. It is said that will be the lowest in degree amongst the people of Paradise.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "6739",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكان أصحابنا ينهونا ونحن غلمان أن نحلف بالشهادة والعهد‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet was asked, \"Who are the best people?\" He replied: The people of my generation, and then those who will follow (come after) them, and then those who will come after the later; after that there will come some people whose witness will precede their oaths and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"When we were young, our elder friends used to prohibit us from taking oaths by saying, 'I bear witness swearing by Allah, or by Allah's Covenant.\"'",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "7503",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، سمع يحيى بن سعيد، عن سفيان، حدثني منصور، وسليمان، عن إبراهيم، عن عبيدة، عن عبد الله، أن يهوديا، جاء إلى النبي صلى الله عليه وسلم فقال يا محمد إن الله يمسك السموات على إصبع والأرضين على إصبع، والجبال على إصبع، والشجر على إصبع، والخلائق على إصبع، ثم يقول أنا الملك‏.‏ فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه ثم قرأ ‏{‏وما قدروا الله حق قدره‏}‏‏.‏ قال يحيى بن سعيد وزاد فيه فضيل بن عياض عن منصور عن إبراهيم عن عبيدة عن عبد الله فضحك رسول الله صلى الله عليه وسلم تعجبا وتصديقا له‏.‏",
      "text_en": " Narrated `Abdullah:                     A Jew came to the Prophet and said, \"O Muhammad! Allah will hold the heavens on a Finger, and the mountains on a Finger, and the trees on a Finger, and all the creation on a Finger, and then He will say, 'I am the King.' \" On that Allah's Apostle smiled till his premolar teeth became visible, and then recited:-- 'No just estimate have they made of Allah such as due to him....(39.67) `Abdullah added: Allah's Apostle smiled (at the Jew's statement) expressing his wonder and believe in what was said.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "11005",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "7604",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن خالد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن آخر أهل الجنة دخولا الجنة، وآخر أهل النار خروجا من النار رجل يخرج حبوا فيقول له ربه ادخل الجنة‏.‏ فيقول رب الجنة ملأى‏.‏ فيقول له ذلك ثلاث مرات فكل ذلك يعيد عليه الجنة ملأى‏.‏ فيقول إن لك مثل الدنيا عشر مرار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"The person who will be the last one to enter Paradise and the last to come out of Hell (Fire) will be a man who will come out crawling, and his Lord will say to him, 'Enter Paradise.' He will reply, 'O Lord, Paradise is full.' Allah will give him the same order thrice, and each time the man will give Him the same reply, i.e., 'Paradise is full.' Thereupon Allah will say (to him), 'Ten times of the world is for you.' \"",
      "chain": [
        "38496",
        "20340",
        "20311",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "7606",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  قال جاء حبر من اليهود فقال إنه إذا كان يوم القيامة جعل الله السموات على إصبع، والأرضين على إصبع، والماء والثرى على إصبع، والخلائق على إصبع، ثم يهزهن ثم يقول أنا الملك أنا الملك‏.‏ فلقد رأيت النبي صلى الله عليه وسلم يضحك حتى بدت نواجذه تعجبا وتصديقا، لقوله ثم قال النبي صلى الله عليه وسلم ‏{‏وما قدروا الله حق قدره‏}‏ إلى قوله ‏{‏يشركون‏}‏",
      "text_en": " Narrated `Abdullah:                     A priest from the Jews came (to the Prophet) and said, \"On the Day of Resurrection, Allah will place all the heavens on one finger, and the Earth on one finger, and the waters and the land on one finger, and all the creation on one finger, and then He will shake them and say. 'I am the King! I am the King!'\" I saw the Prophet smiling till his premolar teeth became visible expressing his amazement and his belief in what he had said. Then the Prophet recited: 'No just estimate have they made of Allah such as due to Him (up to)...; High is He above the partners they attribute to Him.' (39.67)",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم الحنظلي، كلاهما عن جرير، قال عثمان حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعلم آخر أهل النار خروجا منها وآخر أهل الجنة دخولا الجنة رجل يخرج من النار حبوا فيقول الله تبارك وتعالى له اذهب فادخل الجنة فيأتيها فيخيل إليه أنها ملأى فيرجع فيقول يا رب وجدتها ملأى ‏.‏ فيقول الله تبارك وتعالى له اذهب فادخل الجنة - قال - فيأتيها فيخيل إليه أنها ملأى فيرجع فيقول يا رب وجدتها ملأى فيقول الله له اذهب فادخل الجنة فإن لك مثل الدنيا وعشرة أمثالها أو إن لك عشرة أمثال الدنيا - قال - فيقول أتسخر بي - أو أتضحك بي - وأنت الملك ‏\"‏ قال لقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏ قال فكان يقال ذاك أدنى أهل الجنة منزلة ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported that the Messenger of Allah (may peace be upon him) said:                      I know the last of the inhabitants of Fire to be taken out therefrom, and the last of the inhabitants of Paradise to enter it. A man will come out of the Fire crawling. Then Allah, the Blessed and Exalted will say to him: Go and enter Paradise. So he would come to it and it would appear to him as if it were full. He would go back and say: O my Lord! I found it full. Allah, the Blessed and Exalted, would say to him: Go and enter Paradise. He would come and perceive as if it were full. He would return and say: O my Lord! I found it full. Allah would say to him: Go and enter Paradise, for there is for you the like of the world and ten times like it, or for you is ten times the like of this world. He (the narrator) said. He (that man) would say: Art Thou making a fun of me? or Art Thou laughing at me. though Thou art the King? He (the narrator) said: I saw the Messenger of Allah laugh till his front teeth were visible. And it was said: That would be the lowest rank among the inhabitants of Paradise.",
      "chain": [
        "30203",
        "30123",
        "20028",
        "30203",
        "20028",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف آخر أهل النار خروجا من النار رجل يخرج منها زحفا فيقال له انطلق فادخل الجنة - قال - فيذهب فيدخل الجنة فيجد الناس قد أخذوا المنازل فيقال له أتذكر الزمان الذي كنت فيه فيقول نعم ‏.‏ فيقال له تمن ‏.‏ فيتمنى فيقال له لك الذي تمنيت وعشرة أضعاف الدنيا - قال - فيقول أتسخر بي وأنت الملك ‏\"‏ قال فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏",
      "text_en": " It is narrated on the authority of Abdullah b. Mas'ud that the Messenger of Allah (may peace be upon him said:                      I recognise the last of the inhabitants of Fire to be taken out thereof. A man will come out of it crawling. It will be said to him: Go and enter Paradise. He (the Holy Prophet) said: He would go there to enter Paradise, but would find persons who have already occupied all its apartments. It would be said to him: Do you recall the time when you were in it (in the Hell)? He would say: Yes. It would be said to him: Express any desire. And he would express the desire. It would be said to him: For thee is that which thou desireth and ten times the world (worldly resources). He (the Holy Prophet) said: He would say: Art Thou making a fun of me, though Thou art the King? I saw the Messenger of Allah laugh till his front teeth were visible.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "1451",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن هشام، عن محمد، عن عبيدة، عن علي، قال لما كان يوم الأحزاب قال رسول الله صلى الله عليه وسلم ‏\"‏ ملأ الله قبورهم وبيوتهم نارا كما حبسونا وشغلونا عن الصلاة الوسطى حتى غابت الشمس ‏\"‏ ‏.‏",
      "text_en": " 'Ali reported:                      When it was the day (of the Battle) of Ahzab, the Messenger of Allah (may peace be upon him) said: May Allah fill their graves and houses with fire, as they detained us and diverted us from the middle prayer, till the sun set.",
      "chain": [
        "30201",
        "20318",
        "11065",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أبي حسان، عن عبيدة، عن علي، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏\"‏ شغلونا عن صلاة الوسطى حتى آبت الشمس ملأ الله قبورهم نارا أو بيوتهم أو بطونهم ‏\"‏ ‏.‏ شك شعبة في البيوت والبطون ‏.‏",
      "text_en": " 'Ali reported:                      The Messenger of Allah (may peace be upon him) said: On the day (of the Battle) of Ahzab we were diverted from the middle prayer, till the sun set. May Allah fill their graves or their houses, or their stomachs with fire. The narrator is in doubt about\" houses\" and\" stomachs\".",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن حفص، - قال أبو بكر حدثنا حفص بن غياث، - عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على القرآن ‏\"‏ ‏.‏ قال فقلت يا رسول الله أقرأ عليك وعليك أنزل قال ‏\"‏ إني أشتهي أن أسمعه من غيري ‏\"‏ ‏.‏ فقرأت النساء حتى إذا بلغت ‏{‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ رفعت رأسي أو غمزني رجل إلى جنبي فرفعت رأسي فرأيت دموعه تسيل ‏.‏",
      "text_en": " This hadith has been narratted by A'mash with the same chain of transmitters but with this addition:                     \" The Messenger of Allah (may peace be upon him) was on the pulpit when he asked me to recite to him.\"",
      "chain": [
        "30201",
        "20436",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "2514",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا ابن علية، وحماد بن زيد، ح وحدثنا قتيبة بن سعيد، حدثنا حماد بن زيد، ح وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لهما - قالا حدثنا إسماعيل ابن علية، عن أيوب، عن محمد، عن عبيدة، عن علي، قال ذكر الخوارج فقال فيهم رجل مخدج اليد - أو مودن اليد أو مثدون اليد - لولا أن تبطروا لحدثتكم بما وعد الله الذين يقتلونهم على لسان محمد صلى الله عليه وسلم - قال - قلت آنت سمعته من محمد صلى الله عليه وسلم قال إي ورب الكعبة إي ورب الكعبة إي ورب الكعبة ‏.‏",
      "text_en": " 'Abida narrated from 'Ali that he made a mention of the Khwarij (and in this connection) said that there would be a person among them with a defective hand. (or with a short hand) or a fleshy hand. If you were to exercise restraint, I would tell you what Allah has promised to those who would kill them on the order of Mubarrmad (may peace be upon him). I (the narrator) said to him:                      Did you hear it from Muhammad: (may peace be upon him)? He (Hadrat 'Ali) said: Yes, by the Lord of the Ka'ba; Yes, by the Lord of the Ka'ba; yes, by the Lord of the Ka'ba.",
      "chain": [
        "30161",
        "20208",
        "20022",
        "30367",
        "20022",
        "30201",
        "30022",
        "20208",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن عبيدة، قال لا أحدثكم إلا ما سمعت منه، ‏.‏ فذكر عن علي، نحو حديث أيوب مرفوعا ‏.‏",
      "text_en": " 'Abida said:                      I will not narrate to you except what I heard from him (Hadrat 'Ali), and then he narrated from him.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035",
        "11370"
      ]
    },
    {
      "hadith_no": "6633",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم الحنظلي، قال إسحاق أخبرنا  وقال، عثمان حدثنا جرير، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل رسول الله صلى الله عليه وسلم أى الناس خير قال ‏\"‏ قرني ثم الذين يلونهم ثم الذين يلونهم ثم يجيء قوم تبدر شهادة أحدهم يمينه وتبدر يمينه شهادته ‏\"‏ ‏.‏ قال إبراهيم كانوا ينهوننا ونحن غلمان عن العهد والشهادات ‏.‏",
      "text_en": " Abdullah reported:                      It was asked from Allah's Apostle (may peace be upon him) who amongst the people were the best. He said: (People) of my generation, then those next to them, then those next to them, then there would come a people whose evidence would precede their oath and their oath would precede their evidence. Ibrahim said: They forbade us to make vows and bear witness when we were too young.",
      "chain": [
        "30203",
        "30021",
        "30312",
        "30203",
        "20028",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "6635",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا أزهر بن سعد السمان، عن ابن عون، عن إبراهيم، عن عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ فلا أدري في الثالثة أو في الرابعة قال ‏\"‏ ثم يتخلف من بعدهم خلف تسبق شهادة أحدهم يمينه ويمينه شهادته ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported Allah's Apostle (may peace be upon him) as saying:                      The best among people are of my generation, then those next to them. (The narrator said): I do not know whether (he said) it three times or four times. Then there would fellow after them such persons whose evidence would precede the oath, and in case of some others, the oath (would precede) the evidence.",
      "chain": [
        "30115",
        "20206",
        "11071",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "409",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن زكريا بن أبي زائدة، ويزيد بن هارون، عن هشام بن حسان، عن محمد بن سيرين، عن عبيدة، عن علي، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال يوم الخندق ‏\"‏ حبسونا عن صلاة الوسطى صلاة العصر ملأ الله بيوتهم وقبورهم نارا ‏\"‏ ‏.‏",
      "text_en": " 'Ali (may Allah be pleased with him) reported the Messenger of Allah (ﷺ) as saying on the day of Battle of Khandaq (Trench). They (the unbelievers) prevented is from offering the middle prayer i.e. 'Asr prayer. May Allah fill their houses and their graves with Hell-fire.",
      "chain": [
        "30203",
        "20366",
        "20472",
        "11311",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1270",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبيدة، يحدث عن إبراهيم، عن ابن منجاب، عن قرثع، عن أبي أيوب، عن النبي صلى الله عليه وسلم قال ‏\"‏ أربع قبل الظهر ليس فيهن تسليم تفتح لهن أبواب السماء ‏\"‏ ‏.‏ قال أبو داود بلغني عن يحيى بن سعيد القطان قال لو حدثت عن عبيدة بشىء لحدثت عنه بهذا الحديث ‏.‏ قال أبو داود عبيدة ضعيف ‏.‏ قال أبو داود ابن منجاب هو سهم ‏.‏",
      "text_en": " Narrated AbuAyyub:                     The Prophet (ﷺ) said: The gates of heaven are opened for four rak'ahs containing no taslim (salutation) before the noon prayer.Abu Dawud said: Yahya b. Sa'id al-Qattan said: If I were to narrate any tradition from 'Ubaidah, I would narrate this tradition.Abu Dawud said: 'Ubaidah is weak.Abu Dawud said: The name of the narrator Ibn Minjab is Sahm.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11370",
        "11051",
        "33"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن الأعمش، ح وحدثنا وهب بن بيان، حدثنا عبيدة، حدثنا سليمان الأعمش، - المعنى - عن الحكم، عن مقسم، عن ابن عباس، قال أفاض رسول الله صلى الله عليه وسلم من عرفة وعليه السكينة ورديفه أسامة وقال ‏\"‏ أيها الناس عليكم بالسكينة فإن البر ليس بإيجاف الخيل والإبل ‏\"‏ ‏.‏ قال فما رأيتها رافعة يديها عادية حتى أتى جمعا ‏.‏ زاد وهب ثم أردف الفضل بن العباس ‏.‏ وقال ‏\"‏ أيها الناس إن البر ليس بإيجاف الخيل والإبل فعليكم بالسكينة ‏\"‏ ‏.‏ قال فما رأيتها رافعة يديها حتى أتى منى ‏.‏",
      "text_en": " Ibn ‘Abbas said The Apostle of Allaah(ﷺ) returned from ‘Arafah preserving a quiet demeanor and he took Usamah up behind him (on the Camel). He said “O people preserve a quiet demeanor for piety does not consist in exciting the Horses and the Camels (i.e., in driving them quickly).” He (Ibn ‘Abbas) said “Thereafter I did not see them raising their hands running quickly till he came to Al Muzdalifah.” The narrator Wahb added He took Al Fadl bin ‘Abbas up behind him (on the Camel) and said O people piety does not consist in exciting the Horses and the Camels (i.e., in driving them quickly), you must preserve a quiet demeanor”. He (Ibn ‘Abbas) said “Thereafter I did not see them raising their hands till he came to Mina.”",
      "chain": [
        "28531",
        "20012",
        "11060",
        "36063",
        "11370",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو ثور، إبراهيم بن خالد ووهب بن بيان قالا حدثنا عبيدة، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت رسول الله صلى الله عليه وسلم عند جمرة العقبة راكبا ورأيت بين أصابعه حجرا فرمى ورمى الناس ‏.‏",
      "text_en": " Sulaiman b. 'Amr b. Ahwas reported on the authority of his mother:                      I saw the Messenger of Allah (ﷺ) near the Jamrat al-Aqabah (the third or last pillar) riding (on a camel) and I saw a pebble between his fingers. He threw the pebbles and the people also threw (stones at the Jamrah).",
      "chain": [
        "11370",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3668",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على سورة النساء ‏\"‏ ‏.‏ قال قلت أقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏ ‏.‏ قال فقرأت عليه حتى إذا انتهيت إلى قوله ‏{‏ فكيف إذا جئنا من كل أمة بشهيد ‏}‏ الآية فرفعت رأسي فإذا عيناه تهملان ‏.‏",
      "text_en": " ’Abd  Allah (b. Mas’ud) said:                      The Messenger of Allah (ﷺ)said to me: recite Surat al-Nisa’. I asked: Shail I recite to you  what was sent down to you ? He replied : I like to here it from someone else. So I recite (it) until I reached this verse “How then shall it be when We bring from every people a witness ?”. Then raised my head and saw tears falling from his eyes.",
      "chain": [
        "30203",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "4050",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي، - رضى الله عنه - أنه قال نهى عن مياثر الأرجوان ‏.‏",
      "text_en": " 'Ali said:                      It is forbidden to use purple saddle-clothes.",
      "chain": [
        "30459",
        "20229",
        "20295",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن عبيدة، عن إبراهيم، عن الأسود، عن عائشة، قالت كنا نحيض على عهد رسول الله صلى الله عليه وسلم ثم نطهر فيأمرنا بقضاء الصيام ولا يأمرنا بقضاء الصلاة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي عن معاذة عن عائشة أيضا ‏.‏ والعمل على هذا عند أهل العلم لا نعلم بينهم اختلافا أن الحائض تقضي الصيام ولا تقضي الصلاة ‏.‏ قال أبو عيسى وعبيدة هو ابن معتب الضبي الكوفي يكنى أبا عبد الكريم ‏.‏",
      "text_en": " Aishah narrated:                     \"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"",
      "chain": [
        "20387",
        "20345",
        "11370",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1567",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - واسمه أحمد بن عبد الله الهمداني ومحمود بن غيلان قالا حدثنا أبو داود الحفري، حدثنا يحيى بن زكريا بن أبي زائدة، عن سفيان بن سعيد، عن هشام، عن ابن سيرين، عن عبيدة، عن علي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن جبرائيل هبط عليه فقال له خيرهم يعني أصحابك في أسارى بدر القتل أو الفداء على أن يقتل منهم قابلا مثلهم ‏.‏ قالوا الفداء ويقتل منا ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وأنس وأبي برزة وجبير بن مطعم ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الثوري لا نعرفه إلا من حديث ابن أبي زائدة ‏.‏ وروى أبو أسامة عن هشام عن ابن سيرين عن عبيدة عن علي عن النبي صلى الله عليه وسلم نحوه ‏.‏ وروى ابن عون عن ابن سيرين عن عبيدة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وأبو داود الحفري اسمه عمر بن سعد ‏.‏",
      "text_en": " Narrated 'Ali:                     That the Messenger of Allah (ﷺ) said that Jibra'il had indeed descended upon him to say to him: \"Tell them - meaning your Companions - to choose regarding the captives of Badr, between either killing them or ransoming the, so that the amount killed by them will correspond similarly to them.\" So they said: \"Ranson, even though some of us may be killed.\"There are narrations on this topic from Ibn Mas'ud, Anas, Abu Barzah, and Jubair bin Mut'im.[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Ath-Thawri. We do not know of it except through the report of Za'idah.Abu Usamah reported similar to this from Hisham, from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ)Ibn 'Awn reported it from Ibn Sirin, from 'Abidah, from 'Ali, from the Prophet (ﷺ) in Mursal form.Abu Dawud Al-Hafiri's ( a narrator in this chain) name is 'Umar bin Sa'd.",
      "chain": [
        "20668",
        "20366",
        "20012",
        "11065",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3298",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا معاوية بن هشام، حدثنا سفيان الثوري، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏ ‏.‏ فقلت يا رسول الله أقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏ ‏.‏ فقرأت سورة النساء حتى إذا بلغت ‏:‏ ‏(‏جئنا بك على هؤلاء شهيدا ‏)‏ قال فرأيت عينى النبي صلى الله عليه وسلم تهملان ‏.‏ قال أبو عيسى هذا أصح من حديث أبي الأحوص ‏.‏",
      "text_en": " Narrated Ibrahim:                     from 'Abidah that 'Abdullah said: \"The Messenger of Allah (ﷺ) said to me: 'Recite for me.' I said: 'O Messenger of Allah! Shall I recite for you while it is to you whom it was revealed?' He said: 'I love to hear it from other than me.'\" So I recited Surat An-Nisa until I reached: \"...And We bring you (Muhammad) as a witness against these people? (4:41)\" He said: \"So I saw the eyes of the Prophet (ﷺ) overflowing with tears.\"",
      "chain": [
        "30277",
        "20609",
        "20012",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سفيان، حدثني منصور، وسليمان الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال جاء يهودي إلى النبي صلى الله عليه وسلم فقال يا محمد إن الله يمسك السموات على إصبع والأرضين على إصبع والجبال على إصبع والخلائق على إصبع ثم يقول أنا الملك ‏.‏ قال فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه قال ‏:‏ ‏(‏وما قدروا الله حق قدره ‏)‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"A Jew came to the Prophet (ﷺ) and said: 'O Muhammad! Allah will seize the heavens upon a finger, the mountains upon a finger, the earths upon a finger, and the rest of creation upon a finger. Then He says: 'I am the King.'\" He said: 'So the Messenger of Allah (ﷺ) laughed until his molars were visible. He said: \"They made not a just estimate of Allah such as is due to Him (39:67).\"",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11067",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا فضيل بن عياض، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال فضحك النبي صلى الله عليه وسلم تعجبا وتصديقا ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"So the Prophet (ﷺ) laughed in amazement and approval.\"",
      "chain": [
        "30160",
        "20031",
        "20200",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3408",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا أزهر السمان، عن ابن عون، عن ابن سيرين، عن عبيدة، عن علي، رضى الله عنه قال شكت إلى فاطمة مجل يديها من الطحين فقلت لو أتيت أباك فسألتيه خادما فقال ‏\"‏ ألا أدلكما على ما هو خير لكما من الخادم إذا أخذتما مضجعكما تقولان ثلاثا وثلاثين وثلاثا وثلاثين وأربعا وثلاثين من تحميد وتسبيح وتكبير ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عون وقد روي هذا الحديث من غير وجه عن علي ‏.‏",
      "text_en": " Ali [may Allah be pleased with him] said:                     “Fatimah complained to me about her hands blistering from grinding flour. So I said: ‘If you were to approach your father and ask him for a servant?’ So he (the Prophet) said: ‘Should I not direct the two of you, to that which is better for you than a servant? When the two of you lay down to sleep, say thirty-three, thirty-three, thirty-four, or At-Tahmid, At-Tasbih, and At-Takbir.”",
      "chain": [
        "20206",
        "11071",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3409",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أزهر السمان، عن ابن عون، عن محمد، عن عبيدة، عن علي، رضى الله عنه قال جاءت فاطمة إلى النبي صلى الله عليه وسلم تشكو مجلا بيديها فأمرها بالتسبيح والتكبير والتحميد ‏.‏",
      "text_en": " Ali [may Allah be pleased with him] said:                     “Fatimah went to the Prophet complaining of her hands blistering, so he ordered her to say At-Tasbih, At-Takbir, and At-Tahmid.”",
      "chain": [
        "11222",
        "20206",
        "11071",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبيدة، عن يحيى بن سعيد، عن أنس، قال بال أعرابي في المسجد فأمر النبي صلى الله عليه وسلم بدلو من ماء فصب عليه ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"A Bedouin urinated in the Masjid, and the Prophet (ﷺ) ordered that a bucket (be brought) and poured over it.\"",
      "chain": [
        "30367",
        "11370",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "273",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن عبيدة، عن الأعمش، ح وأخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن الأعمش، عن ثابت بن عبيد، عن القاسم بن محمد، عن عائشة، - رضى الله عنها - قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ناوليني الخمرة من المسجد ‏\"‏ ‏.‏ قالت إني حائض ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليست حيضتك في يدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) said: 'Give me the mat from the Masjid.'\" She said: \"I am menstruating.\" The Messenger of Allah (ﷺ) said: \"Your menstruation is not in you hand.\"",
      "chain": [
        "30367",
        "11370",
        "11060",
        "30123",
        "4057",
        "11060",
        "10751",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا قتيبة، عن عبيدة، عن الأعمش، ح وأخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن الأعمش، عن ثابت بن عبيد، عن القاسم بن محمد، قال قالت عائشة قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ناوليني الخمرة من المسجد ‏\"‏ ‏.‏ فقلت إني حائض ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليست حيضتك في يدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) said: 'Give me the mat from the MAsjid.' She said: 'I am menstruating.' The Messenger of Allah (ﷺ) said: 'Your menstruation is not in your hand.'\"",
      "chain": [
        "30367",
        "11370",
        "11060",
        "30123",
        "4057",
        "11060",
        "10751",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "408",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبيدة، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، عن ميمونة، قالت وضعت لرسول الله صلى الله عليه وسلم ماء - قالت - فسترته فذكرت الغسل قالت ثم أتيته بخرقة فلم يردها ‏‏.‏‏",
      "text_en": " It was narrated that Maimunah said:                      \"I put some water out for the Messenger of Allah (ﷺ), then I concealed him\" - and she mentioned how he performed Ghusl, then she said: \"Then I brought him a cloth (a towel) but he did not want it.\"",
      "chain": [
        "30367",
        "11370",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني قتادة، عن أبي حسان، عن عبيدة، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ شغلونا عن الصلاة الوسطى حتى غربت الشمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali (ﷺ) that the Prophet (ﷺ) said:                      \"They distracted us from Salatul-Wusta (the middle prayer) until the sun went down.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11019",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد، حدثنا حماد بن مسعدة، عن أشعث، عن محمد، عن عبيدة، عن علي، قال نهاني النبي صلى الله عليه وسلم عن القسي والحرير وخاتم الذهب وأن أقرأ وأنا راكع وقال مرة أخرى وأن أقرأ راكعا ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet (ﷺ) forbade me from wearing A-Qassi and silk, and gold rings, and from reciting Qur'an when bowing.\"",
      "chain": [
        "30359",
        "20224",
        "11324",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "2779",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا الحسن بن محمد الزعفراني، عن عبيدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت لقد رأيتني أفتل قلائد الغنم لهدى رسول الله صلى الله عليه وسلم ثم يمكث حلالا ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I remember twisting the garlands for the sheep, the Hadi of the Messenger of Allah, then he stayed as a non-Muhrim.\"",
      "chain": [
        "30245",
        "11370",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3523",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا الحسن، وهو ابن أعين قال حدثنا زهير، ح وأخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى، قال حدثنا زهير بن معاوية، قال حدثنا أبو إسحاق، عن الأسود، ومسروق، وعبيدة، عن عبد الله، أن سورة النساء القصرى، نزلت بعد البقرة ‏.‏",
      "text_en": " It was narrated from 'Abdullah that the shorter Surah, that speaks of women (At-Talaq), was revealed after Al-Baqarah.",
      "chain": [
        "11016",
        "20321",
        "34188",
        "20031",
        "20321",
        "11049",
        "11054",
        "11018",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5183",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا حماد بن مسعدة، عن أشعث، عن محمد، عن عبيدة، عن علي، قال نهاني النبي صلى الله عليه وسلم عن القسي والحرير وخاتم الذهب وأن أقرأ راكعا ‏.‏ خالفه هشام ولم يرفعه ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet [SAW] forbade me from Al-Qassi, silk, gold rings, and that I recite Qur'an while bowing.\" Hisham contradicted him, he did not narrate it in Marfu' form.",
      "chain": [
        "30359",
        "20224",
        "11324",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "5184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا هشام، عن محمد، عن عبيدة، عن علي، قال نهى عن مياثر الأرجوان، ولبس القسي، وخاتم الذهب، ‏.‏",
      "text_en": " It was narrated from 'Abidah, from 'Ali, he said:                     \"He forbade red Al-Mayathir, wearing Al-Qassi, and gold rings.\"",
      "chain": [
        "38022",
        "20472",
        "20295",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "5185",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال أخبرنا حماد، عن أيوب، عن محمد، عن عبيدة، قال نهى عن مياثر الأرجوان، وخواتيم الذهب، ‏.‏",
      "text_en": " It was narrated that 'Abidah said:                     \"He forbade red Al-Mayathir, and gold rings.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "20278",
        "11370"
      ]
    },
    {
      "hadith_no": "5755",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن علي بن سعيد بن إبراهيم، قال حدثنا القواريري، قال حدثنا معتمر بن سليمان، عن أبيه، عن محمد، عن عبيدة، عن ابن مسعود، قال أحدث الناس أشربة ما أدري ما هي فما لي شراب منذ عشرين سنة أو قال أربعين سنة إلا الماء والسويق غير أنه لم يذكر النبيذ ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"The people have invented new drinks and I do not know what they are. I have not drunk anything for 20 years (or he said: 40 years) except water and Sawiq (barley gruel), and he did not mention Nabidh.\"",
      "chain": [
        "28001",
        "30024",
        "20288",
        "11289",
        "11035",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5756",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن ابن عون، عن محمد بن سيرين، عن عبيدة، قال أحدث الناس أشربة ما أدري ما هي وما لي شراب منذ عشرين سنة إلا الماء واللبن والعسل ‏.‏",
      "text_en": " It was narrated that 'Abidah said:                     \"The people have invented drinks and I do not know what they are. I have not drunk anything for 20 years except water, milk and honey.\"",
      "chain": [
        "20025",
        "11071",
        "11035",
        "11370"
      ]
    },
    {
      "hadith_no": "172",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن أيوب، عن محمد بن سيرين، عن عبيدة، عن علي بن أبي طالب، قال وذكر الخوارج فقال فيهم رجل مخدج اليد أو مودن اليد أو مثدن اليد ولولا أن تبطروا لحدثتكم بما وعد الله الذين يقتلونهم على لسان محمد  صلى الله عليه وسلم  ‏.‏ قلت أنت سمعته من محمد  صلى الله عليه وسلم  قال إي ورب الكعبة ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " 'Ubaidah narrated from 'Ali bin Abu Talib,:                     That he mentioned the Khawarij, and said: \"Among them there will be a man with a defective hand, or a short hand, or small hand. If you were to exercise restraint (i.e., not become overjoyed), I would tell you of what Allah has promised upon the lips of Muhammed for those who kill them.\" I ('Ubaidah) said: \"Did you hear that from Muhammed?\" He said: \"Yes, by the Lord of the Ka'bah!' - three times.\"",
      "chain": [
        "30201",
        "20208",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن نمير، عن عبيدة، عن إبراهيم، عن الأسود، عن عائشة، قالت كنا نحيض عند النبي  صلى الله عليه وسلم  فيأمرنا بقضاء الصوم ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We used to menstruate at the timeofthe Prophet (ﷺ), and he would order us to make up for the(missed)fasts.’”",
      "chain": [
        "38409",
        "20331",
        "11370",
        "11051",
        "11054",
        "53"
      ]
    }
  ],
  "total_hadiths": 55
}