{
  "id": "11378",
  "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
  "full_name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "B.Taym",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11330",
      "name": "al-Harith bin Suwayd al-Tymy الحارث بن سويد التيمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "409",
      "name": "Ibrahim bin Abi Musa al-Asha'ari ( إبراهيم بن أبي موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11360",
      "name": "'Abdullah bin Sakhbara al-Azdi عبد الله بن سخبرة الأزدي أبو معمر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10838",
      "name": "Wahb bin Rabi'ya al-Kwfy وهب بن ربيعة الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15086",
      "name": "Hryth bin Zuhyr حريث بن ظهير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10761",
      "name": "al-Rabi' bin 'Amila الربيع بن عميلة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10814",
      "name": "Qays bin al-Skn al-Asady قيس بن السكن الأسدي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10839",
      "name": "Yahya bin al-Jazar al-Arni يحيى بن الجزار",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "746",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلنا لخباب أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا بم كنتم تعرفون ذاك قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     We asked Khabbab whether Allah's Apostle used to recite (the Qur'an) in the Zuhr and the `Asr prayers. He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "761",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلت لخباب بن الأرت أكان النبي صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قال قلت بأى شىء كنتم تعلمون قراءته قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     I asked Khabbab bin Al-Art whether the Prophet used to recite the Qur'an in the Zuhr and the `Asr prayers. He replied in the affirmative. I said, \"How did you come to know that?\" He replied, \"From the movement of his beard.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "777",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قلت لخباب أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا من أين علمت قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     We said to Khabbab \"Did Allah's Apostle used to recite in Zuhr and `Asr prayers?\" He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن الأسود، قال قال عبد الله لا يجعل أحدكم للشيطان شيئا من صلاته، يرى أن حقا عليه أن لا ينصرف إلا عن يمينه، لقد رأيت النبي صلى الله عليه وسلم كثيرا ينصرف عن يساره‏.‏",
      "text_en": " Narrated `Abdullah:                     You should not give away a part of your prayer to Satan by thinking that it is necessary to depart (after finishing the prayer) from one's right side only; I have seen the Prophet often leave from the left side.",
      "chain": [
        "20296",
        "20020",
        "20160",
        "11378",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن، عن عبد الله  رضى الله عنه  قال ما رأيت النبي صلى الله عليه وسلم صلى صلاة بغير ميقاتها إلا صلاتين جمع بين المغرب والعشاء، وصلى الفجر قبل ميقاتها‏.‏",
      "text_en": " Narrated `Abdullah:                     I never saw the Prophet offering any prayer not at its stated time except two; he prayed the Maghrib and the `Isha' together and he offered the morning prayer before its usual time.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "6381",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الأعمش، عن عمارة بن عمير، عن الحارث بن سويد، حدثنا عبد الله، حديثين أحدهما عن النبي صلى الله عليه وسلم والآخر عن نفسه، قال ‏\"‏ إن المؤمن يرى ذنوبه كأنه قاعد تحت جبل يخاف أن يقع عليه، وإن الفاجر يرى ذنوبه كذباب مر على أنفه ‏\"‏‏.‏ فقال به هكذا قال أبو شهاب بيده فوق أنفه‏.‏ ثم قال ‏\"‏ لله أفرح بتوبة عبده من رجل نزل منزلا، وبه مهلكة، ومعه راحلته عليها طعامه وشرابه، فوضع رأسه فنام نومة، فاستيقظ وقد ذهبت راحلته، حتى اشتد عليه الحر والعطش أو ما شاء الله، قال أرجع إلى مكاني‏.‏ فرجع فنام نومة، ثم رفع رأسه، فإذا راحلته عنده ‏\"‏‏.‏ تابعه أبو عوانة وجرير عن الأعمش‏.‏ وقال أبو أسامة حدثنا الأعمش حدثنا عمارة سمعت الحارث‏.‏ وقال شعبة وأبو مسلم عن الأعمش عن إبراهيم التيمي عن الحارث بن سويد‏.‏ وقال أبو معاوية حدثنا الأعمش عن عمارة عن الأسود عن عبد الله وعن إبراهيم التيمي عن الحارث بن سويد عن عبد الله‏.‏",
      "text_en": " Narrated Al-Harith bin Suwaid:                     `Abdullah bin Mas`ud related to us two narrations: One from the Prophet and the other from himself, saying: A believer sees his sins as if he were sitting under a mountain which, he is afraid, may fall on him; whereas the wicked person considers his sins as flies passing over his nose and he just drives them away like this.\" Abu Shihab (the sub-narrator) moved his hand over his nose in illustration. (Ibn Mas`ud added): Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than a man who encamps at a place where his life is jeopardized, but he has his riding beast carrying his food and water. He then rests his head and sleeps for a short while and wakes to find his riding beast gone. (He starts looking for it) and suffers from severe heat and thirst or what Allah wished (him to suffer from). He then says, 'I will go back to my place.' He returns and sleeps again, and then (getting up), he raises his head to find his riding beast standing beside him.\"",
      "chain": [
        "30184",
        "11613",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وأبو معاوية ووكيع عن الأعمش، عن عمارة بن عمير التيمي، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال أبو مسعود فأنتم اليوم أشد اختلافا ‏.‏",
      "text_en": " Abu Mas'ud reported:                      The Messenger of Allah (may peace he upon him) used to touch our shoulders in prayer and say: Keep straight, don't be irregular, for there would be dissension in your hearts. Let those of you who are sedate and prudent be near me, then those who are next to them, then those who are next to them. Abu Mas'ud said: Now-a-days there is much dissension amongst you.",
      "chain": [
        "30201",
        "20102",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "2610",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو كريب محمد بن العلاء قالا أخبرنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي عطية، قال دخلت أنا ومسروق، على عائشة فقلنا يا أم المؤمنين رجلان من أصحاب محمد صلى الله عليه وسلم أحدهما يعجل الإفطار ويعجل الصلاة والآخر يؤخر الإفطار ويؤخر الصلاة ‏.‏ قالت أيهما الذي يعجل الإفطار ويعجل الصلاة قال قلنا عبد الله يعني ابن مسعود ‏.‏ قالت كذلك كان يصنع رسول الله صلى الله عليه وسلم ‏.‏ زاد أبو كريب والآخر أبو موسى ‏.‏",
      "text_en": " Abu 'Atiyya reported:                      I and Masruq went to 'A'isha and said to her: Mother of the Believers, there are two persons among the Companions of Muhammad (may peace be upon him) one among whom hastens in breaking the fast and in observing prayer, and the other delays breaking the fast and delays observing prayer. She said: Who among the two hastens in breaking fast and observing prayers? We said, It is 'Abdullah. i. e. son of Mas'ud. whereupon she said: This is how the Messenger of Allah (may peace be upon him) did. Abu Kuraib added: The second one was Abu Musa.",
      "chain": [
        "30399",
        "30216",
        "20354",
        "11060",
        "11378"
      ]
    },
    {
      "hadith_no": "2706",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ويحيى بن سعيد القطان، عن سفيان، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، حدثنا سفيان، حدثني زبيد اليامي، عن عمارة بن عمير، عن قيس بن سكن، أن الأشعث بن قيس، دخل على عبد الله يوم عاشوراء وهو يأكل فقال يا أبا محمد ادن فكل ‏.‏ قال إني صائم ‏.‏ قال كنا نصومه ثم ترك ‏.‏",
      "text_en": " Qais b Sakan reported that al-Ash'ath b. Qais went to 'Abdullah on the day of 'Ashura while he was eating. He said:                      Abu Muhammad, come near and dine. Upon this he said: I am fasting. Thereupon he said: We used to observe fast and then (this practice) was abandoned.",
      "chain": [
        "30201",
        "20032",
        "20031",
        "20012",
        "38487",
        "20031",
        "20012",
        "11335",
        "11378"
      ]
    },
    {
      "hadith_no": "3020",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن عمارة بن عمير، عن إبراهيم بن أبي موسى، عن أبي موسى، أنه كان يفتي بالمتعة فقال له رجل رويدك ببعض فتياك فإنك لا تدري ما أحدث أمير المؤمنين في النسك بعد حتى لقيه بعد فسأله فقال عمر قد علمت أن النبي صلى الله عليه وسلم قد فعله وأصحابه ولكن كرهت أن يظلوا معرسين بهن في الأراك ثم يروحون في الحج تقطر رءوسهم ‏.‏",
      "text_en": " Abu Musa, (Allah be pleased with him) reported that he used to deliver religious verdict in favor of Hajj Tamattu'. A person said to him:                      Exercise restraint in delivering some of your religious verdicts, for you do not know what the Commander of Believers has introduced in the rites (of Hajj) after you (when you were away in Yemen). He (Abu Musa, ) met him (Hadrat Umar) subsequently and asked him (about it), whereupon 'Umar said: I know that Allah's Apostle (May peace be upon him) and also his Companions did that (observed Tamattu'), but I do not approve that the married persons should have intercourse with their wives under the shade of the trees, and then set out for Hajj with water trickling down from their heads.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11069",
        "11378",
        "41"
      ]
    },
    {
      "hadith_no": "3466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " Abdullah (b. Mas'ud) (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) said to us:                      0 young men, those among you who can support a wife should marry, for it restrains eyes (from casting evil glances) and preserves one from immorality; but he who cannot afford It should observe fast for it is a means of controlling the sexual desire.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11378",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، قال دخلت أنا وعمي، علقمة والأسود على عبد الله بن مسعود قال وأنا شاب، يومئذ فذكر حديثا رئيت أنه حدث به، من أجلي قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث أبي معاوية وزاد قال فلم ألبث حتى تزوجت ‏.‏",
      "text_en": " Abu al-Rahman b. Yazid said:                      I and my uncle 'Alqama and al-Aswad went to 'Abdullah b. Mas'ud (Allah be pleased with him). He (the narrator further) said: I was at that time young, and he narrated a hadith which it seemed he narrated for me that Allah's Messenger (may peace be upon him) said like one transmitted by Mu'awiya, and further added: I lost no time in marrying.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11378",
        "20395"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني عبد الله بن سعيد الأشج، حدثنا وكيع، حدثنا الأعمش، عن عمارة بن، عمير عن عبد الرحمن بن يزيد، عن عبد الله، قال دخلنا عليه وأنا أحدث القوم، بمثل حديثهم ولم يذكر فلم ألبث حتى تزوجت ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid reported on the authority of Abdullah:                      We went to him, and I was the youngest of all (of us), but he did not mention:\" I lost no time in marrying.\"",
      "chain": [
        "20032",
        "11060",
        "11378",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "7131",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لعثمان - قال إسحاق أخبرنا وقال، عثمان حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن الحارث بن، سويد قال دخلت على عبد الله أعوده وهو مريض فحدثنا بحديثين حديثا عن نفسه وحديثا عن رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لله أشد فرحا بتوبة عبده المؤمن من رجل في أرض دوية مهلكة معه راحلته عليها طعامه وشرابه فنام فاستيقظ وقد ذهبت فطلبها حتى أدركه العطش ثم قال أرجع إلى مكاني الذي كنت فيه فأنام حتى أموت ‏.‏ فوضع رأسه على ساعده ليموت فاستيقظ وعنده راحلته وعليها زاده وطعامه وشرابه فالله أشد فرحا بتوبة العبد المؤمن من هذا براحلته وزاده ‏\"‏ ‏.‏",
      "text_en": " Harith b. Suwaid said:                      I went to see 'Abdullah to inquire about his health as he was sick and he narrated to us a hadith of Allahs Messenger (may peace be upon him). He heard Allah's Messenger (may peace be upon him) as saying: Allah is more pleased with the repentance of His believing servant than a person who loses his riding beast carrying food and drink. He sleeps (being disappointed of its recovery) and then gets up and goes in search for that, until he is stricken with thirst. then comes back to the place where he had been before and goes to sleep completely exhausted placing his head upon his hands waiting for death. And when he gets up, lot there is before him his riding beast and his provisions of food and drink. Allah is more pleased with the repentance of His servant than the recovery of this riding beast along with the provisions (of food and drink).",
      "chain": [
        "30203",
        "30123",
        "30312",
        "30203",
        "20028",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "hadith_no": "7133",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا عمارة، بن عمير قال سمعت الحارث بن سويد، قال حدثني عبد الله، حديثين أحدهما عن رسول الله صلى الله عليه وسلم والآخر عن نفسه فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ لله أشد فرحا بتوبة عبده المؤمن ‏\"‏ ‏.‏ بمثل حديث جرير ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      Allah is more pleased with the repentance of a believing man. The rest of the hadith is the same.",
      "chain": [
        "30313",
        "20318",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "hadith_no": "7206",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "وحدثني أبو بكر بن خلاد الباهلي، حدثنا يحيى، - يعني ابن سعيد - حدثنا  سفيان، حدثني سليمان، عن عمارة بن عمير، عن وهب بن ربيعة، عن عبد الله، ح",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters.",
      "chain": [
        "30357",
        "20031",
        "20012",
        "11060",
        "11378",
        "10838"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن كثير، أخبرني سفيان، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " Abu Ma’sud reported the Messenger of Allah (ﷺ) as saying:                      let those of your who are sedate and prudent be near me, then those who are next to them, then those who are next to them.",
      "chain": [
        "30169",
        "20012",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "801",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلنا لخباب هل كان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم ‏.‏ قلنا بم كنتم تعرفون ذاك قال باضطراب لحيته ‏.‏",
      "text_en": " Abu Ma’mar said:                      We asked Khabbab: Did the Messenger of Allah (ﷺ) recit (the Quran) in the noon and afternoon prayers? He replied: Yes. We then asked: How did you know this? He said: By the shaking of his beard, may peace be upon him.",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة الرجل حتى يقيم ظهره في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMas'ud al-Badri:                     The Prophet (ﷺ) said: A man's prayer does not avail him unless he keeps his back steady when bowing and prostrating.",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1042",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن الأسود بن يزيد، عن عبد الله، قال لا يجعل أحدكم نصيبا للشيطان من صلاته أن لا ينصرف إلا عن يمينه وقد رأيت رسول الله صلى الله عليه وسلم أكثر ما ينصرف عن شماله ‏.‏ قال عمارة أتيت المدينة بعد فرأيت منازل النبي صلى الله عليه وسلم عن يساره ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said; One of you should not give a share from his prayer to the devil, that he does not turn away expect to his right side. I saw the Messenger of Allah (ﷺ) often turning away to his left side. the narrator ‘Umarah said:                      I came to medina afterwards and saw that the houses of the prophet (ﷺ) were (built) in the left.",
      "chain": [
        "20285",
        "20020",
        "20160",
        "11378",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "2354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي عطية، قال دخلت على عائشة - رضى الله عنها - أنا ومسروق فقلنا يا أم المؤمنين رجلان من أصحاب محمد صلى الله عليه وسلم أحدهما يعجل الإفطار ويعجل الصلاة والآخر يؤخر الإفطار ويؤخر الصلاة قالت أيهما يعجل الإفطار ويعجل الصلاة قلنا عبد الله ‏.‏ قالت كذلك كان يصنع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu 'Atiyyah:                     I and Masruq entered upon 'Aishah and we said: Mother of believers, there are two persons from the Companions of the Muhammad (ﷺ). One of them hastens to break the fast and hastens to pray while the other delays to break the fast and delays praying. She asked: Which of them hastens to break the fast and hasten to pray ? We replied: 'Abd Allah (b. Mas'ud). She said: Thus did the Messenger of Allah (ﷺ) do.",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11378"
      ]
    },
    {
      "hadith_no": "2396",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، ح وحدثنا محمد بن كثير، قال أخبرنا شعبة، عن حبيب بن أبي ثابت، عن عمارة بن عمير، عن ابن مطوس، عن أبيه، - قال ابن كثير عن أبي المطوس، عن أبيه، - عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أفطر يوما من رمضان من غير رخصة رخصها الله له لم يقض عنه صيام الدهر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone breaks his fast one day in Ramadan without a concession granted to him by Allah, a perpetual fast will not atone for it.",
      "chain": [
        "20193",
        "20020",
        "28531",
        "20020",
        "11331",
        "11378",
        "30169",
        "19956",
        "13"
      ]
    },
    {
      "hadith_no": "3528",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن عمارة بن عمير، عن عمته، أنها سألت عائشة رضى الله عنها في حجري يتيم أفآكل من ماله فقالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أطيب ما أكل الرجل من كسبه وولده من كسبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The aunt of Umarah ibn Umayr asked Aisha: I have an orphan in my guardianship. May I enjoy from his property? She said: The Messenger of Allah (ﷺ) said: The pleasantest things a man enjoys come from what he earns, and his child comes from what he earns.",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11051",
        "11378",
        "53"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وعثمان بن أبي شيبة، - المعنى - قالا حدثنا محمد بن جعفر، عن شعبة، عن الحكم، عن عمارة بن عمير، عن أمه، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ولد الرجل من كسبه من أطيب كسبه فكلوا من أموالهم ‏\"‏ ‏.‏ قال أبو داود حماد بن أبي سليمان زاد فيه ‏\"‏ إذا احتجتم ‏\"‏ ‏.‏ وهو منكر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) Said: The children of a man come from what he earns, rather they are his pleasantest earning; so enjoy from their property.Abu Dawud said: Hammad b. Abi Sulaiman added in his version: \"When you need.\" But this (addition) is munkar (not authoritative).",
      "chain": [
        "30024",
        "20173",
        "20020",
        "11069",
        "11378",
        "53"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم فيها الرجل يعني صلبه في الركوع والسجود ‏\"‏ ‏.‏ قال وفي الباب عن علي بن شيبان وأنس وأبي هريرة ورفاعة الزرقي ‏.‏ قال أبو عيسى حديث أبي مسعود الأنصاري حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم يرون أن يقيم الرجل صلبه في الركوع والسجود ‏.‏ وقال الشافعي وأحمد وإسحاق من لم يقم صلبه في الركوع والسجود فصلاته فاسدة لحديث النبي صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏ وأبو معمر اسمه عبد الله بن سخبرة ‏.‏ وأبو مسعود الأنصاري البدري اسمه عقبة بن عمرو ‏.‏",
      "text_en": " Abu Mas'ud Al-Ansari [Al-Badri] narrated that :                     Allah's Messenger said: \"The Salat is not acceptable if a man is not at rest - meaning his back - while bowing and prostrating.\"",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي عطية، قال دخلت أنا ومسروق، على عائشة فقلنا يا أم المؤمنين رجلان من أصحاب النبي صلى الله عليه وسلم أحدهما يعجل الإفطار ويعجل الصلاة والآخر يؤخر الإفطار ويؤخر الصلاة ‏.‏ قالت أيهما يعجل الإفطار ويعجل الصلاة قلنا عبد الله بن مسعود ‏.‏ قالت هكذا صنع رسول الله صلى الله عليه وسلم ‏.‏ والآخر أبو موسى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو عطية اسمه مالك بن أبي عامر الهمداني ويقال مالك بن عامر الهمداني وابن عامر أصح ‏.‏",
      "text_en": " Abu Atiyyah said:                     \"Masruq and I entered upon Aishah and we said: 'O Mother of the Beleivers! There are two men from the Companins of Muhammad, one of them hastens t break the fasts and he hastens to perform Salat. The other delays breaking the fast and he delays the Salat.' She said: 'Which of them hastens to break the fast and hastens to perform the Salat?' We said that it was Abdullah bin Mas'ud. She said: 'This is how the Messenger of Allah did it.' And the other was Abu Musa.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378"
      ]
    },
    {
      "hadith_no": "1081",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال خرجنا مع النبي صلى الله عليه وسلم ونحن شباب لا نقدر على شيء فقال ‏\"‏ يا معشر الشباب عليكم بالباءة فإنه أغض للبصر وأحصن للفرج فمن لم يستطع منكم الباءة فعليه بالصوم فإن الصوم له وجاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا عبد الله بن نمير، حدثنا الأعمش، عن عمارة، نحوه ‏.‏ قال أبو عيسى وقد روى غير، واحد، عن الأعمش، بهذا الإسناد مثل هذا ‏.‏ وروى أبو معاوية، والمحاربي، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى كلاهما صحيح ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1358",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، حدثنا الأعمش، عن عمارة بن عمير، عن عمته، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أطيب ما أكلتم من كسبكم وإن أولادكم من كسبكم ‏\"‏ ‏.‏ قال وفي الباب عن جابر وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى بعضهم هذا عن عمارة بن عمير عن أمه عن عائشة ‏.‏ وأكثرهم قالوا عن عمته عن عائشة ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا إن يد الوالد مبسوطة في مال ولده يأخذ ما شاء ‏.‏ وقال بعضهم لا يأخذ من ماله إلا عند الحاجة إليه ‏.‏",
      "text_en": " 'Aishah narrated that the Messenger of Allah (ﷺ) said:                      \"Indeed the most wholesome of what you consume is from your earnings, and indeed your children are from your earnings.\"",
      "chain": [
        "30242",
        "20366",
        "11060",
        "11378",
        "53"
      ]
    },
    {
      "hadith_no": "2685",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، أخبرنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن الحارث بن سويد، حدثنا عبد الله بن مسعود، بحديثين أحدهما عن نفسه، والآخر، عن النبي صلى الله عليه وسلم قال عبد الله إن المؤمن يرى ذنوبه كأنه في أصل جبل يخاف أن يقع عليه وإن الفاجر يرى ذنوبه كذباب وقع على أنفه قال به هكذا فطار ‏.‏",
      "text_en": " Al-Harith bin Suwaid said:                     \" 'Abdullah [bin Mas'ud] narrated two Ahadith to us, one of them from himself and the other from the Prophet (s.a.w). 'Abdullah said: 'The believer sees his sins as if he was at the base of a mountain, fearing that it was about to fall upon him. The wicked person sees his sins as if (they are) flies are hitting his nose\" he said: \"Like this\" - motioning with his hand - \"to get them to fly away.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "hadith_no": "3557",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، قال قال عبد الله كنت مستترا بأستار الكعبة فجاء ثلاثة نفر كثير شحم بطونهم قليل فقه قلوبهم قرشي وختناه ثقفيان أو ثقفي وختناه قرشيان فتكلموا بكلام لم أفهمه فقال أحدهم أترون أن الله يسمع كلامنا هذا فقال الآخر إنا إذا رفعنا أصواتنا سمعه وإذا لم نرفع أصواتنا لم يسمعه فقال الآخر إن سمع منه شيئا سمعه كله فقال عبد الله فذكرت ذلك للنبي صلى الله عليه وسلم فأنزل الله ‏:‏ ‏(‏ وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ‏)‏ إلى قوله ‏:‏ ‏(‏أصبحتم من الخاسرين ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"I was hiding beneath the covering of the Ka'bah, and three men came along - a man from the Quraish, and two of his brothers-in-law from Thaqif, or a man from Thaqif and two of his brothers-in-law from Quraish. Their bellies were fat, and they did not have much understanding. They said something that I could not understand, then one of them said: 'Do you think that Allah can hear what we are talking about?' Another said: 'If we raise our voices, He will hear it, but if we do not raise our voices, He will not hear it.' The other one said: 'If He can hear something from us, then He can hear all of it.'\" 'Abdullah said: \"I mentioned that to the Prophet (ﷺ), so Allah revealed: 'And you have not been hiding yourselves, lest your ears and your eyes and your skin should testify against you...' up to His saying: '...and you have become of those utterly lost! (42:22 & 23)\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11055"
      ]
    },
    {
      "hadith_no": "3558",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن وهب بن ربيعة، عن عبد الله، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11060",
        "11378",
        "10838",
        "16"
      ]
    },
    {
      "hadith_no": "4149",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، قال لما جيء برأس عبيد الله بن زياد وأصحابه نضدت في المسجد في الرحبة فانتهيت إليهم وهم يقولون قد جاءت قد جاءت ‏.‏ فإذا حية قد جاءت تخلل الرءوس حتى دخلت في منخرى عبيد الله بن زياد فمكثت هنيهة ثم خرجت فذهبت حتى تغيبت ثم قالوا قد جاءت قد جاءت ‏.‏ ففعلت ذلك مرتين أو ثلاثا ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Umarah bin 'Umair:                     \"When the heads of 'Ubaidullah bin Ziyad and his companions were brought, they were stacked in the Masjid at Ar-Rahbah. So I came to them and they were saying: 'It has come, it has come.\" And behold, there was a snake going between the heads, until it entered the nostrils of 'Ubaidullah bin Ziyad, and it remained there momentarily, then left and went until it had disappeared. Then they said: 'It has come, it has come.' So it did that two or three times.\"",
      "chain": [
        "20354",
        "11060",
        "11378"
      ]
    },
    {
      "hadith_no": "807",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال أبو مسعود فأنتم اليوم أشد اختلافا ‏.‏ قال أبو عبد الرحمن أبو معمر اسمه عبد الله بن سخبرة ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansiri said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he-would say:'Keep (the rows) straight; do not differ from one another lest your hearts would be afflicted with discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"' Abu Mas'ud said: Today, there is much disharmony among you. ,Abu 'Abdur-Rabin (An-Nasai)said: (One of the narrators) Abu Ma'mar's name is 'Abdullah bin Sakhbarah.",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "812",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا غندر، عن شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح عواتقنا ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم وليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ad Al-Ansari said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he would say: 'Keep (the rows) straight; do not differ from one another lest your hearts should suffer from discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"'",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: 'The prayer is not valid if a man does not bring his backbone to rest while bowing and prostrating.'\"",
      "chain": [
        "30367",
        "20271",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن سليمان، عن عمارة بن عمير، عن يحيى بن الجزار، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسعا فلما أسن وثقل صلى سبعا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) used to pray nine (rak'ahs) at night, then when he grew older and put on weight he prayed seven.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11378",
        "10839",
        "53"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال خرجنا مع رسول الله صلى الله عليه وسلم ونحن شباب لا نقدر على شىء قال ‏\"‏ يا معشر الشباب عليكم بالباءة فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"We went out with the Messenger of Allah and we were young men who could not afford anything. He said: 'O young men, you should get married, for it is more effective in lowering the gaze and protecting one's chastity. Whoever cannot afford it should fast, for it will be a restraint Wija, for him.\"'",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، - واللفظ له - قالا حدثنا محمد، قال حدثنا شعبة، عن الحكم، عن عمارة بن عمير، عن إبراهيم بن أبي موسى، عن أبي موسى، أنه كان يفتي بالمتعة فقال له رجل رويدك ببعض فتياك فإنك لا تدري ما أحدث أمير المؤمنين في النسك بعد ‏.‏ حتى لقيته فسألته فقال عمر قد علمت أن النبي صلى الله عليه وسلم قد فعله ولكن كرهت أن يظلوا معرسين بهن في الأراك ثم يروحوا بالحج تقطر رءوسهم ‏.‏",
      "text_en": " It was narrated that Abu Musa said that:                     he used to issue Fatwas concerning Tamattu' Then a man said to him: \"Withhold some of your Fatwas ,for you do not know what the commander of the Believers introduced into the rites subsequently.\" Then when I met him, I asked him. 'Umar said: \"I know that the Messenger of Allah and his companions did it, but I did  not like that people should lay with their wives in the shade of the Arak trees, and then go out for Hajj with their heads dripping.\"",
      "chain": [
        "30170",
        "30160",
        "20278",
        "20020",
        "11069",
        "11378",
        "41"
      ]
    },
    {
      "hadith_no": "3010",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، عن شعبة، عن سليمان، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصلي الصلاة لوقتها إلا بجمع وعرفات ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah used to offer prayers at their proper time except in Jam (Al-Muzdalifah) and Arafat.\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3209",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فلينكح فإنه أغض للبصر وأحصن للفرج ومن لا فليصم فإن الصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdullah:                     It was narrated that 'Abdullah said: \"The Messenger of Allah said to us: 'O young men, whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding chastity, and whoever cannot then he should fast, for it will be a restraint (wija') for him.'\"",
      "chain": [
        "36658",
        "20005",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "4244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر النيسابوري، قال حدثنا الحسين بن محمد، قال حدثنا شريك، عن الأعمش، عن عمارة بن عمير، عن الأسود، عن عائشة، قالت سئل النبي صلى الله عليه وسلم عن جلود الميتة فقال ‏\"‏ دباغها طهورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"",
      "chain": [
        "38181",
        "20587",
        "11060",
        "11378",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4449",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد أبو قدامة السرخسي، قال حدثنا يحيى بن سعيد، عن سفيان، عن منصور، عن عمارة بن عمير، عن عمته، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أطيب ما أكل الرجل من كسبه وإن ولد الرجل من كسبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: \"The best (most Pure) food that a man eats is that which he has earned himself, and a man's child (and his child's wealth) is part of his earnings\" (Sahih )",
      "chain": [
        "20031",
        "20012",
        "11067",
        "11378",
        "53"
      ]
    },
    {
      "hadith_no": "4450",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا الأعمش، عن إبراهيم، عن عمارة بن عمير، عن عمة، له عن عائشة، أن النبي صلى الله عليه وسلم ‏\"‏ قال إن أولادكم من أطيب كسبكم فكلوا من كسب أولادكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                     \"Your children are part of the best of your earnings, so eat form what your children earn.\"",
      "chain": [
        "36658",
        "20005",
        "11060",
        "11051",
        "11378",
        "53"
      ]
    },
    {
      "hadith_no": "5397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن عمارة، هو ابن عمير عن عبد الرحمن بن يزيد، قال أكثروا على عبد الله ذات يوم فقال عبد الله إنه قد أتى علينا زمان ولسنا نقضي ولسنا هنالك ثم إن الله عز وجل قدر علينا أن بلغنا ما ترون فمن عرض له منكم قضاء بعد اليوم فليقض بما في كتاب الله فإن جاء أمر ليس في كتاب الله فليقض بما قضى به نبيه صلى الله عليه وسلم فإن جاء أمر ليس في كتاب الله ولا قضى به نبيه صلى الله عليه وسلم فليقض بما قضى به الصالحون فإن جاء أمر ليس في كتاب الله ولا قضى به نبيه صلى الله عليه وسلم ولا قضى به الصالحون فليجتهد رأيه ولا يقول إني أخاف وإني أخاف فإن الحلال بين والحرام بين وبين ذلك أمور مشتبهات فدع ما يريبك إلى ما لا يريبك‏.‏ قال أبو عبد الرحمن هذا الحديث جيد جيد‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Yazid said:                     \"The people asked 'Abdullah too many questions one day, and 'Abdullah said: 'There was a time when we did not pass so many judgments, but now that time is over. Now Allah, the Mighty and Sublime, has decreed that we reach a time when, as you see, (we are asked to pass many judgments). Whoever among you is asked to pass a judgment after this day, let him pass judgment according to what is in the Book of Allah. If he is faced with a matter that is not mentioned in the Book of Allah, let him pass judgment according to the way His Prophet [SAW] passed judgment. If he is faced with a matter that is not mentioned in the Book of Allah and concerning which His Prophet did not pass judgment, then let him pass judgment according to the way the righteous passed judgment. If he is faced with a matter that is not mentioned in the Book of Allah, and concerning which His Prophet and the righteous did not pass judgment, then let him strive to work it out, and let him not say 'I am afraid, I am afraid.' For that which is lawful is clear and that which is unlawful is clear, and between them are matters which are not as clear. Leave that which makes you doubt for that which does not make you doubt.'\"",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11378",
        "11055"
      ]
    },
    {
      "hadith_no": "5398",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثنا الفريابي، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن حريث بن ظهير، عن عبد الله بن مسعود، قال أتى علينا حين ولسنا نقضي ولسنا هنالك وإن الله عز وجل قدر أن بلغنا ما ترون فمن عرض له قضاء بعد اليوم فليقض فيه بما في كتاب الله فإن جاء أمر ليس في كتاب الله فليقض بما قضى به نبيه فإن جاء أمر ليس في كتاب الله ولم يقض به نبيه صلى الله عليه وسلم فليقض بما قضى به الصالحون ولا يقول أحدكم إني أخاف وإني أخاف فإن الحلال بين والحرام بين وبين ذلك أمور مشتبهة فدع ما يريبك إلى ما لا يريبك‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"There was a time when we did not pass so many judgments, but now that time is over. Now Allah, the Mighty and Sublime, has decreed that we reach a time when, as you see, (we are asked to pass many judgments). Whoever among you is asked to pass a judgment after this day, let him pass judgment according to what is in the Book of Allah. If he is faced with a matter that is not mentioned in the Book of Allah, let him pass judgment according to the way His Prophet [SAW] passed judgment. If he is faced with a matter that is not mentioned in the Book of Allah, and concerning which His Prophet did not pass judgment, then let him pass judgment according to the way the righteous passed judgment. And let him not say 'I am afraid, I am afraid.' For that which is lawful is clear and that which is unlawful is clear, and between them are matters which are not as clear. Leave that which makes you doubt for that which does not make you doubt.\"",
      "chain": [
        "38556",
        "20034",
        "20012",
        "11060",
        "11378",
        "15086",
        "16"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلت لخباب بأى شىء كنتم تعرفون قراءة رسول الله  صلى الله عليه وسلم  في الظهر والعصر قال باضطراب لحيته ‏.‏",
      "text_en": " It wasnarrated that Abu Ma’mar said:                      “I said to Khabbab: ‘How didyourecognize that the Messenger of Allah (ﷺ) was reciting in theZuhrand the ‘Asr?’ He said: ‘From the movement of his beard.’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري، قال كان رسول الله  صلى الله عليه وسلم  يمسح مناكبنا في الصلاة ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud Al-Ansari said:                      “The Messenger ofAllah(ﷺ) used to gently pat our shoulders (to make sure the row wasstraight) at the time of prayer, saying: ‘Keep (the rows) straight,donot differ from one another lest your hearts should suffer fromdiscord. Let those who are forbearing and wise stand closest to me,then those who are next to them, then those who are next to them.’”",
      "chain": [
        "30269",
        "20005",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن أبي زائدة، عن الأعمش، عن عمارة بن عمير، عن عمته، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أطيب ما أكلتم من كسبكم وإن أولادكم من كسبكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:                     \"The best of your provision is what you earn, and your children are part of what you earn. \"",
      "chain": [
        "30201",
        "20366",
        "11060",
        "11378",
        "53"
      ]
    },
    {
      "hadith_no": "3093",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، ح وحدثنا نصر بن علي الجهضمي، حدثني أبي قالا، حدثنا شعبة، عن الحكم، عن عمارة بن عمير، عن إبراهيم بن أبي موسى، عن أبي موسى الأشعري، أنه كان يفتي بالمتعة فقال له رجل رويدك بعض فتياك فإنك لا تدري ما أحدث أمير المؤمنين في النسك بعدك ‏.‏ حتى لقيته بعد فسألته فقال عمر قد علمت أن رسول الله  صلى الله عليه وسلم  فعله وأصحابه ولكني كرهت أن يظلوا بهن معرسين تحت الأراك ثم يروحون بالحج تقطر رءوسهم ‏.‏",
      "text_en": " It wasnarrated from Ibrahim bin Abu Musa:                      “Abu Musa Al-Ash’ari usedtoissue rulings concerning Tamattu’. Then a man said to him:‘Withhold some of your rulings, for you do not know what theCommanderof the Believers has introduced into the rites after you.’(Abu Musasaid:) ‘Then when I met him later on, I asked him.’‘Umar said: ‘Iknow that the Messenger of Allah (ﷺ) and hisCompanions did it, butI did not like that people should lie withtheir wives in the shade ofthe Arak trees and then go out for Hajjwith their heads dripping,’(i.e. due to the bath after sexualrelations).”",
      "chain": [
        "30201",
        "30160",
        "20173",
        "30395",
        "20264",
        "20020",
        "11069",
        "11378",
        "41"
      ]
    }
  ],
  "total_hadiths": 49
}