{
  "id": "11375",
  "name": "'Ali bin al-Aqmar bin 'Amr علي بن الأقمر بن عمرو",
  "full_name": "'Ali bin al-Aqmar bin 'Amr علي بن الأقمر بن عمرو",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "71",
      "name": "Umm Atiyyah Ansariyah ( أم عطية الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4047",
      "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4000",
      "name": "Usama bin Sharek al-Tha'labi ( أسامة بن شريك الثعلبي العامري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10914",
      "name": "Salmah bin S'hyb سلمة بن صهيب ويقال بن صهيبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5453",
      "hadith_no": "5453",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن علي بن الأقمر، سمعت أبا جحيفة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا آكل متكئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle said, \"I do not take my meals while leaning (against something).",
      "usc_msa_ref": "310",
      "chain": [
        "20348",
        "20359",
        "11375",
        "4047"
      ]
    },
    {
      "id": "sahih-bukhari-5454",
      "hadith_no": "5454",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عثمان بن أبي شيبة، أخبرنا جرير، عن منصور، عن علي بن الأقمر، عن أبي جحيفة، قال كنت عند النبي صلى الله عليه وسلم فقال لرجل عنده ‏\"‏ لا آكل وأنا متكئ ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     While I was with the Prophet he said to a man who was with him, \"I do not take my meals while leaning.\"",
      "usc_msa_ref": "311",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11375",
        "4047"
      ]
    },
    {
      "id": "sahih-muslim-1520",
      "hadith_no": "1520",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن أبي العميس، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله، قال من سره أن يلقى الله غدا مسلما فليحافظ على هؤلاء الصلوات حيث ينادى بهن فإن الله شرع لنبيكم صلى الله عليه وسلم سنن الهدى وإنهن من سنن الهدى ولو أنكم صليتم في بيوتكم كما يصلي هذا المتخلف في بيته لتركتم سنة نبيكم ولو تركتم سنة نبيكم لضللتم وما من رجل يتطهر فيحسن الطهور ثم يعمد إلى مسجد من هذه المساجد إلا كتب الله له بكل خطوة يخطوها حسنة ويرفعه بها درجة ويحط عنه بها سيئة ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم النفاق ولقد كان الرجل يؤتى به يهادى بين الرجلين حتى يقام في الصف ‏.‏",
      "text_en": " Abdullah (b. Mas'ud) reported:                      He who likes to meet Allah tomorrow as Muslim, he should persevere in observing these prayers, when a call is announced for them, for Allah has laid down for your Prophet the paths of right guidance, and these (prayers) are among the paths of right guidance. If you were to pray in your houses as this man why stays away (from the mosque) prays in his house, you would abandon the practice of your Prophet, and if you were to abandon the practice of your Prophet, you would go astray. No man purifies himself, doing it well, then makes for one of those mosques without Allah recording a blessing for him for every step he takes raising him a degree for it, and effacing a sin from him for it. I have seen the time when no one stayed away from it, except a hypocrite, who was well known for his hypocrisy, whereas a man would be brought swaying (due to weakness) between two men till he was set up in a row.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20348",
        "20342",
        "11375",
        "20327",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7590",
      "hadith_no": "7590",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا شعبة، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة إلا على شرار الناس ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported Allah's Apostle (may peace be upon him) as saying:                      The Last Hour would affect (most terribly) the wicked persons.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20033",
        "20020",
        "11375",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-550",
      "hadith_no": "550",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عباد الأزدي، حدثنا وكيع، عن المسعودي، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله بن مسعود، قال حافظوا على هؤلاء الصلوات الخمس حيث ينادى بهن فإنهن من سنن الهدى وإن الله شرع لنبيه صلى الله عليه وسلم سنن الهدى ولقد رأيتنا وما يتخلف عنها إلا منافق بين النفاق ولقد رأيتنا وإن الرجل ليهادى بين الرجلين حتى يقام في الصف وما منكم من أحد إلا وله مسجد في بيته ولو صليتم في بيوتكم وتركتم مساجدكم تركتم سنة نبيكم صلى الله عليه وسلم ولو تركتم سنة نبيكم صلى الله عليه وسلم لكفرتم ‏.‏",
      "text_en": " Abd Allah b. Mas’ud said:                      Persevere in observing these five times of prayer where the announcement for them is made, because they are from the paths of right guidance. And Allah, the Might, the Majestic, has laid down for his prophet (ﷺ) the paths of right guidance. I have seen the time when no one stayed away from prayer except a hypocrite whose hypocrite was well known. I witnessed the time when a man would be brought swaying between two men till he was set up in the row (of the prayer). Every one of us has a mosque of his in his house. If you were to pray in your houses and stay from your mosques. You would abandon the Sunnah (practice) of your prophet, and if you were Abandon the Sunnah (Practice) of your Prophet, you would become an unbeliever.",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20724",
        "11375",
        "20327",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-1309",
      "hadith_no": "1309",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن كثير، حدثنا سفيان، عن مسعر، عن علي بن الأقمر، ح وحدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، - المعنى - عن الأغر، عن أبي سعيد، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أيقظ الرجل أهله من الليل فصليا أو صلى ركعتين جميعا كتبا في الذاكرين والذاكرات ‏\"‏ ‏.‏ ولم يرفعه ابن كثير ولا ذكر أبا هريرة جعله كلام أبي سعيد ‏.‏ قال أبو داود رواه ابن مهدي عن سفيان قال وأراه ذكر أبا هريرة ‏.‏ قال أبو داود وحديث سفيان موقوف ‏.‏",
      "text_en": " Narrated AbuSa'id and AbuHurayrah:                     The Prophet (ﷺ) said: If a man awakens his wife at night, and then both pray or both offer two rak'ahs together, the (name of the )man will be recorded among those who mention the name of Allah, and the (name of the) woman will be recorded among those who mention the name of Allah. Ibn Kathir did not narrate this tradition as a statement of the Prophet (ﷺ), but he reported it as a statement of Abu Sa'id.Abu Dawud said: This tradition has been narrated by Ibn Mahdi from Sufyan and I think he mentioned the name of Sufyan. He also said: The tradition transmitted by Sufyan is a statement of the Companion (and not that of the Prophet).",
      "usc_msa_ref": "",
      "chain": [
        "30169",
        "20012",
        "20359",
        "11375",
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1451",
      "hadith_no": "1451",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، عن الأغر أبي مسلم، عن أبي سعيد الخدري، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ من استيقظ من الليل وأيقظ امرأته فصليا ركعتين جميعا كتبا من الذاكرين الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id ; AbuHurayrah:                     The Prophet (ﷺ) said: When a man himself wakes at night and wakens his wife and they pray two rak'ahs together, they are recorded among the men and women who make much mention of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "38",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3769",
      "hadith_no": "3769",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن علي بن الأقمر، قال سمعت أبا جحيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا آكل متكئا ‏\"‏ ‏.‏",
      "text_en": " Abu Juhaifah reported the Prophet (ﷺ) as sayings:                      I do not eat while reclining.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11375",
        "4047"
      ]
    },
    {
      "id": "sunan-abi-daud-4875",
      "hadith_no": "4875",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني علي بن الأقمر، عن أبي حذيفة، عن عائشة، قالت قلت للنبي صلى الله عليه وسلم حسبك من صفية كذا وكذا قال غير مسدد تعني قصيرة ‏.‏ فقال ‏\"‏ لقد قلت كلمة لو مزجت بماء البحر لمزجته ‏\"‏ ‏.‏ قالت وحكيت له إنسانا فقال ‏\"‏ ما أحب أني حكيت إنسانا وأن لي كذا وكذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I said to the Prophet (ﷺ): It is enough for you in Safiyyah that she is such and such (the other version than Musaddad's has:) meaning that she was short-statured. He replied; You have said a word which would change the sea if it were mixed in it. She said: I imitated a man before him (out of disgrace). He said: I do not like that I imitate anyone even if I should get such and such.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11375",
        "20290",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1830",
      "hadith_no": "1830",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا شريك، عن علي بن الأقمر، عن أبي جحيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فلا آكل متكئا ‏\"‏ ‏.‏ قال وفي الباب عن علي وعبد الله بن عمرو وعبد الله بن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث علي بن الأقمر ‏.‏ وروى زكريا بن أبي زائدة وسفيان الثوري وغير واحد عن علي بن الأقمر هذا الحديث وروى شعبة عن سفيان الثوري هذا الحديث عن علي بن الأقمر ‏.‏",
      "text_en": " Narrated Abu Juhaidah:                     That the Messenger of Allah (ﷺ) said: \"As for me, I do not eat while reclining.\"He said: There are narrations on this topic from 'Ali, 'Abdullah bin 'Amr, and 'Abdullah bin Al-'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of 'Ali bin Al-Aqmar. Zakariyya bin Abi Za'idah,  Sufyan bin Sa'eed, and other reported this Hadith from 'Ali bin Al-Aqmar. And Shu'bah reported this Hadith from Sufyan Ath-Thawri from 'Ali bin Al-Aqmar.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20587",
        "11375",
        "4047"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2690",
      "hadith_no": "2690",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا حدثنا سفيان، عن علي بن الأقمر، عن أبي حذيفة، وكان، من أصحاب ابن مسعود عن عائشة، قالت حكيت للنبي صلى الله عليه وسلم رجلا فقال ‏\"‏ ما يسرني أني حكيت رجلا وأن لي كذا وكذا ‏\"‏ ‏.‏ قالت فقلت يا رسول الله إن صفية امرأة وقالت بيدها هكذا كأنها تعني قصيرة ‏.‏ فقال ‏\"‏ لقد مزجت بكلمة لو مزجت بها ماء البحر لمزج ‏\"‏ ‏.‏",
      "text_en": " Abu Hudhaifah narrated - and he was one of the companions of 'Abdullãh bin Mas'üd - from'Aishah who said:                      \"I told theProphet (ﷺ) about a man, so hesaid: 'I do not like to talk about aman, even if I were to get this orthat (for doing so).\" She said: \"Isaid: 'O Messenger of Allah!Safiyyah is a woman who is ...\" andshe used her hand as if to indicatethat she is short - \"So he said:'You have said a statement which,if it were mixed in with the waterof the sea, it would pollute it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20012",
        "11375",
        "20290",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2691",
      "hadith_no": "2691",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن علي بن الأقمر، عن أبي حذيفة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحب أني حكيت أحدا وأن لي كذا وكذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حذيفة هو كوفي من أصحاب ابن مسعود ويقال اسمه سلمة بن صهيبة ‏.‏",
      "text_en": " 'Aishah narrated that the Messenger of Allah (s.a.w) said:                     \"I do not like to talk about anyone, even if I were to get this or that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11375",
        "20290",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-849",
      "hadith_no": "849",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن المسعودي، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله، أنه كان يقول من سره أن يلقى الله عز وجل غدا مسلما فليحافظ على هؤلاء الصلوات الخمس حيث ينادى بهن فإن الله عز وجل شرع لنبيه صلى الله عليه وسلم سنن الهدى وإنهن من سنن الهدى وإني لا أحسب منكم أحدا إلا له مسجد يصلي فيه في بيته فلو صليتم في بيوتكم وتركتم مساجدكم لتركتم سنة نبيكم ولو تركتم سنة نبيكم لضللتم وما من عبد مسلم يتوضأ فيحسن الوضوء ثم يمشي إلى صلاة إلا كتب الله عز وجل له بكل خطوة يخطوها حسنة أو يرفع له بها درجة أو يكفر عنه بها خطيئة ولقد رأيتنا نقارب بين الخطا ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم نفاقه ولقد رأيت الرجل يهادى بين الرجلين حتى يقام في الصف ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"Whoever would like to meet Allah tomorrow as a Muslim, let  him regularly attend these five (daily) prayers  whenever the call for them is given (that in the mosques), for Allah prescribed forHis Prophet the ways of guidance, and they (the prayers) are part of those ways of guidance. I do not think that there is anyone among you who does not have a place where he prays in his house. But if you were to pray in your houses and forsake the Masjids, you would be forsaking the Sunnah of your Prophet, and if you were to forsake the Sunnah of yourProphet you would go astray. There is no Muslim slave who performs Wudu and does it well, then walks to the prayer, but Allah will record one Hasanah (gooddeed) for each step he takes, or raise' him one level by it or erase one sin from him. I remember how we used to take short steps, and I remember (a time) when no one stayed behind from the prayer excepta hypocrite whose hypocrisy was well known. And I have seen a man coming Supported by two others until he would be made to stand in the row.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20724",
        "11375",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1396",
      "hadith_no": "1396",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، حدثنا شيبان أبو معاوية، عن الأعمش، عن علي بن الأقمر، عن الأغر، عن أبي سعيد، وأبي، هريرة عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا استيقظ الرجل من الليل وأيقظ امرأته فصليا ركعتين كتبا من الذاكرين الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed and Abu Hurairah said that theProphet(ﷺ) said:                      ‘When a man wakes up at night and wakes his wife,andthey pray two Rak’ah, they will be recorded among the men andwomenwho remember Allah much.”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3386",
      "hadith_no": "3386",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان بن عيينة، عن مسعر، عن علي بن الأقمر، عن أبي جحيفة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا آكل متكئا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Juhaifah that the Messenger of Allah (ﷺ)said:                      “Ido not eat while reclining.”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "20359",
        "11375",
        "4047"
      ]
    }
  ],
  "total_hadiths": 15
}