{
  "id": "11385",
  "name": "Faras bin Yahya al-Hamdani al-Kharfi فراس بن يحيى",
  "full_name": "Faras bin Yahya al-Hamdani al-Kharfi فراس بن يحيى",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15373",
      "name": "Atyh bin Sa'd bin Jnad'h عطية بن سعد بن جنادة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25053",
      "name": "al-Hasan bin Amarh الحسن بن عمارة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1441",
      "hadith_no": "1441",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن فراس، عن الشعبي، عن مسروق، عن عائشة، رضى الله عنها أن بعض، أزواج النبي صلى الله عليه وسلم قلن للنبي صلى الله عليه وسلم أينا أسرع بك لحوقا قال ‏\"‏ أطولكن يدا ‏\"‏‏.‏ فأخذوا قصبة يذرعونها، فكانت سودة أطولهن يدا، فعلمنا بعد أنما كانت طول يدها الصدقة، وكانت أسرعنا لحوقا به وكانت تحب الصدقة‏.‏",
      "text_en": " Narrated `Aisha:                     Some of the wives of the Prophet asked him, \"Who amongst us will be the first to follow you (i.e. die after you)?\" He said, \"Whoever has the longest hand.\" So they started measuring their hands with a stick and Sauda's hand turned out to be the longest. (When Zainab bint Jahsh died first of all in the caliphate of `Umar), we came to know that the long hand was a symbol of practicing charity, so she was the first to follow the Prophet and she used to love to practice charity. (Sauda died later in the caliphate of Muawiya).",
      "usc_msa_ref": "501",
      "chain": [
        "20040",
        "20469",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2781",
      "hadith_no": "2781",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن سابق، أو الفضل بن يعقوب عنه حدثنا شيبان أبو معاوية، عن فراس، قال قال الشعبي حدثني جابر بن عبد الله الأنصاري  رضى الله عنهما  أن أباه استشهد يوم أحد، وترك ست بنات، وترك عليه دينا، فلما حضر جداد النخل أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد علمت أن والدي استشهد يوم أحد وترك عليه دينا كثيرا، وإني أحب أن يراك الغرماء قال ‏\"‏ اذهب فبيدر كل تمر على ناحيته ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات ثم جلس عليه ثم قال ‏\"‏ ادع أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله أمانة والدي، وأنا والله راض أن يؤدي الله أمانة والدي ولا أرجع إلى أخواتي بتمرة، فسلم والله البيادر كلها حتى أني أنظر إلى البيدر الذي عليه رسول الله صلى الله عليه وسلم كأنه لم ينقص تمرة واحدة‏.‏   قال أبو عبد الله أغروا بي يعني هيجوا بي  فأغرينا بينهم العداوة والبغضاء",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to be paid. When the time of plucking the date-fruits came, I went to Allah's Apostle and said, \"O Allah's Apostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that the creditors would see you.\" The Prophet said, \"Go and collect the various kinds of dates and place them separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started claiming their rights pressingly at that time. When the Prophet saw how they behaved, he went round the biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" Then he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would have pleased me that Allah would clear the debts of my father even though I had not taken a single date to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap where Allah's Apostle was sitting and noticed as if not a single date had been taken thereof.",
      "usc_msa_ref": "40",
      "chain": [
        "30209",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-3666",
      "hadith_no": "3666",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن فراس، عن عامر، عن مسروق، عن عائشة  رضى الله عنها  قالت أقبلت فاطمة تمشي، كأن مشيتها مشى النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ مرحبا بابنتي ‏\"‏‏.‏ ثم أجلسها عن يمينه أو عن شماله، ثم أسر إليها حديثا، فبكت فقلت لها لم تبكين ثم أسر إليها حديثا فضحكت فقلت ما رأيت كاليوم فرحا أقرب من حزن، فسألتها عما قال‏.‏   فقالت ما كنت لأفشي سر رسول الله صلى الله عليه وسلم حتى قبض النبي صلى الله عليه وسلم فسألتها فقالت أسر إلى ‏\"‏ إن جبريل كان يعارضني القرآن كل سنة مرة، وإنه عارضني العام مرتين، ولا أراه إلا حضر أجلي، وإنك أول أهل بيتي لحاقا بي ‏\"‏‏.‏ فبكيت فقال ‏\"‏ أما ترضين أن تكوني سيدة نساء أهل الجنة  أو نساء المؤمنين ‏\"‏‏.‏ فضحكت لذلك‏.‏",
      "text_en": " Narrated `Aisha:                     Once Fatima came walking and her gait resembled the gait of the Prophet . The Prophet said, \"Welcome, O my daughter!\" Then he made her sit on his right or on his left side, and then he told her a secret and she started weeping. I asked her, \"Why are you weeping?\" He again told her a secret and she started laughing. I said, \"I never saw happiness so near to sadness as I saw today.\" I asked her what the Prophet had told her. She said, \"I would never disclose the secret of Allah's Apostle .\" When the Prophet died, I asked her about it. She replied. \"The Prophet said.) 'Every year Gabriel used to revise the Qur'an with me once only, but this year he has done so twice. I think this portends my death, and you will be the first of my family to follow me.' So I started weeping. Then he said. 'Don't you like to be the mistress of all the ladies of Paradise or the mistress of all the lady believers? So I laughed for that.\"",
      "usc_msa_ref": "819",
      "chain": [
        "20348",
        "11338",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4103",
      "hadith_no": "4103",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن أبي سريج، أخبرنا عبيد الله بن موسى، حدثنا شيبان، عن فراس، عن الشعبي، قال حدثني جابر بن عبد الله  رضى الله عنهما أن أباه، استشهد يوم أحد وترك عليه دينا، وترك ست بنات، فلما حضر جذاذ النخل قال أتيت رسول الله صلى الله عليه وسلم فقلت قد علمت أن والدي قد استشهد يوم أحد، وترك دينا كثيرا، وإني أحب أن يراك الغرماء‏.‏ فقال ‏\"‏ اذهب فبيدر كل تمر على ناحية ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه كأنهم أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات، ثم جلس عليه، ثم قال ‏\"‏ ادع لك أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله عن والدي أمانته، وأنا أرضى أن يؤدي الله أمانة والدي، ولا أرجع إلى أخواتي بتمرة، فسلم الله البيادر كلها وحتى إني أنظر إلى البيدر الذي كان عليه النبي صلى الله عليه وسلم كأنها لم تنقص تمرة واحدة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That his father was martyred on the day of the battle of Uhud and was in debt and left six (orphan) daughters. Jabir, added, \"When the season of plucking the dates came, I went to Allah's Apostle and said, \"You know that my father was martyred on the day of Uhud, and he was heavily in debt, and I would like that the creditors should see you.\" The Prophet said, \"Go and pile every kind of dates apart.\" I did so and called him (i.e. the Prophet ). When the creditors saw him, they started claiming their debts from me then in such a harsh manner (as they had never done before). So when he saw their attitude, he went round the biggest heap of dates thrice, and then sat over it and said, 'O Jabir), call your companions (i.e. the creditors).' Then he kept on measuring (and giving) to the creditors (their due) till Allah paid all the debt of my father. I would have been satisfied to retain nothing of those dates for my sisters after Allah had paid the debts of my father. But Allah saved all the heaps (of dates), so that when I looked at the heap where the Prophet had been sitting, it seemed as if a single date had not been taken away thereof.\"",
      "usc_msa_ref": "383",
      "chain": [
        "30298",
        "20340",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5622",
      "hadith_no": "5622",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن فراس، عن عامر، عن البراء، قال صلى رسول الله صلى الله عليه وسلم ذات يوم، فقال ‏\"‏ من صلى صلاتنا واستقبل قبلتنا، فلا يذبح حتى ينصرف ‏\"‏‏.‏ فقام أبو بردة بن نيار فقال يا رسول الله فعلت‏.‏ فقال ‏\"‏ هو شىء عجلته ‏\"‏‏.‏ قال فإن عندي جذعة هي خير من مسنتين آذبحها قال ‏\"‏ نعم، ثم لا تجزي عن أحد بعدك ‏\"‏‏.‏ قال عامر هي خير نسيكته‏.‏",
      "text_en": " Narrated Al-Bara':                     One day Allah's Apostle offered the `Id prayer and said, \"Whoever offers our prayer and faces our Qibla should not slaughter the sacrifice till he finishes the `Id prayer.\" Abu Burda bin Niyar got up and said, \"O Allah's Apostle! I have already done it. The Prophet said, \"That is something you have done before its due time.\" Abu Burda said, \"I have a Jadha'a which is better than two old sheep; shall I slaughter it?\" The Prophet said, \"Yes, but it will not be sufficient for anyone after you.\"",
      "usc_msa_ref": "470",
      "chain": [
        "20040",
        "20469",
        "11385",
        "11052",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-6358",
      "hadith_no": "6358",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا موسى، عن أبي عوانة، حدثنا فراس، عن عامر، عن مسروق، حدثتني عائشة أم المؤمنين، قالت إنا كنا أزواج النبي صلى الله عليه وسلم عنده جميعا، لم تغادر منا واحدة، فأقبلت فاطمة  عليها السلام  تمشي، لا والله ما تخفى مشيتها من مشية رسول الله صلى الله عليه وسلم فلما رآها رحب قال ‏\"‏ مرحبا بابنتي ‏\"‏‏.‏ ثم أجلسها عن يمينه أو عن شماله، ثم سارها فبكت بكاء شديدا، فلما رأى حزنها سارها الثانية إذا هي تضحك‏.‏ فقلت لها أنا من بين نسائه خصك رسول الله صلى الله عليه وسلم بالسر من بيننا، ثم أنت تبكين، فلما قام رسول الله صلى الله عليه وسلم سألتها عما سارك",
      "text_en": " Narrated `Aisha:                     Mother of the Believers: We, the wives of the Prophet were all sitting with the Prophet and none of us had left when Fatima came walking, and by Allah, her gait was very similar to that of Allah's Apostle .' When he saw her, he welcomed her, saying, \"Welcome, O my daughter!\" Then he made her sit on his right or his left, confided something to her, whereupon she wept bitterly. When he noticed her sorrow, he confided something else to her for the second time, and she started laughing. Only I from among the Prophet's wives said to her, \"(O Fatima), Allah's Apostle selected you from among us for the secret talk and still you weep?\" When Allah's Apostle got up (and went away), I asked her, \"What did he confide to you?\" She said, \"I wouldn't disclose the secrets of Allah's Apostle\" But when he died I asked her, \"I beseech you earnestly by what right I have on you, to tell me (that secret talk which the Prophet had with you)\" She said, \"As you ask me now, yes, (I will tell you).\" She informed me, saying, \"When he talked to me secretly the first time, he said that Gabriel used to review the Qur'an with him once every year. He added, 'But this year he reviewed it with me twice, and therefore I think that my time of death has approached. So, be afraid of Allah, and be patient, for I am the best predecessor for you (in the Hereafter).' \" Fatima added, \"So I wept as you (`Aisha) witnessed. And when the Prophet saw me in this sorrowful state, he confided the second secret to me saying, 'O Fatima! Will you not be pleased that you will be chief of all the believing women (or chief of the women of this nation i.e. my followers?\")",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20469",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6756",
      "hadith_no": "6756",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا النضر، أخبرنا شعبة، حدثنا فراس، قال سمعت الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الإشراك بالله، وعقوق الوالدين، وقتل النفس، واليمين الغموس ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"The biggest sins are: To join others in worship with Allah; to be undutiful to one's parents; to kill somebody unlawfully; and to take an oath Al-Ghamus.",
      "usc_msa_ref": "667",
      "chain": [
        "30118",
        "20291",
        "20020",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-6954",
      "hadith_no": "6954",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فراس، عن الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ أو قال ‏\"‏ اليمين الغموس ‏\"‏‏.‏ شك شعبة‏.‏ وقال معاذ حدثنا شعبة قال ‏\"‏ الكبائر الإشراك بالله، واليمين الغموس، وعقوق الوالدين ‏\"‏‏.‏ أو قال ‏\"‏ وقتل النفس ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Al-Ka`ba'ir (the biggest sins) are: To join others (as partners) in worship with Allah, to be undutiful to one's parents,\" or said, \"to take a false oath.\" (The sub-narrator, Shu`ba is not sure) Mu`adh said: Shu`ba said, \"Al-Ka`ba'ir (the biggest sins) are: (1) Joining others as partners in worship with Allah, (2) to take a false oath (3) and to be undutiful to one's parents,\" or said, \"to murder (someone unlawfully).",
      "usc_msa_ref": "9",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-7006",
      "hadith_no": "7006",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثني محمد بن الحسين بن إبراهيم، أخبرنا عبيد الله، أخبرنا شيبان، عن فراس، عن الشعبي، عن عبد الله بن عمرو  رضى الله عنهما  قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما الكبائر قال ‏\"‏ الإشراك بالله ‏\"‏‏.‏ قال ثم ماذا قال ‏\"‏ ثم عقوق الوالدين ‏\"‏‏.‏ قال ثم ماذا قال ‏\"‏ اليمين الغموس ‏\"‏‏.‏ قلت وما اليمين الغموس قال ‏\"‏ الذي يقتطع مال امرئ مسلم هو فيها كاذب ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     A bedouin came to the Prophet and said, \"O Allah's Apostle! What are the biggest sins?: The Prophet said, \"To join others in worship with Allah.\" The bedouin said, \"What is next?\" The Prophet said, \"To be undutiful to one's parents.\" The bedouin said \"What is next?\" The Prophet said \"To take an oath 'Al-Ghamus.\" The bedouin said, \"What is an oath 'Al-Ghamus'?\" The Prophet said, \"The false oath through which one deprives a Muslim of his property (unjustly).",
      "usc_msa_ref": "55",
      "chain": [
        "30267",
        "11201",
        "20240",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-4388",
      "hadith_no": "4388",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن فراس، عن ذكوان أبي صالح، عن زاذان أبي عمر، قال أتيت ابن عمر وقد أعتق مملوكا - قال - فأخذ من الأرض عودا أو شيئا فقال ما فيه من الأجر ما يسوى هذا إلا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لطم مملوكه أو ضربه فكفارته أن يعتقه ‏\"‏.",
      "text_en": " Zadhan Abl Umar reported:                      I came to Ibn 'Umar as he had granted freedom to a stave. He (the narrator further) said: He took hold of a wood or something like it from the earth and said: It (freedom of a slave) has not the reward evert equal to it, but the fact that I heard Allah's Messenger (way peace be upon him) say: He who slaps his slave or beats him, the expiation for it is that he should set him free.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11385",
        "11161",
        "14457"
      ]
    },
    {
      "id": "sahih-muslim-4389",
      "hadith_no": "4389",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن فراس، قال سمعت ذكوان، يحدث عن زاذان، أن ابن عمر، دعا بغلام له فرأى بظهره أثرا فقال له أوجعتك قال لا ‏.‏ قال فأنت عتيق ‏.‏ قال ثم أخذ شيئا من الأرض فقال ما لي فيه من الأجر ما يزن هذا إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من ضرب غلاما له حدا لم يأته أو لطمه فإن كفارته أن يعتقه ‏\"‏ ‏.‏",
      "text_en": " Zadhan reported that Ibn Umar called his slave and he found the marks (of beating) upon his back. He said to him:                      I have caused you pain. He said: No. But he (Ibn Umar) said: You are free. He then took hold of something from the earth and said: There is no reward for me even to the weight equal to it. I heard Allah's Messenger (may peace be upon him) as saying: He who beats a slave without cognizable offence of his or slaps him (without any serious fault), then expiation for it is that he should set him free.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11385",
        "11161"
      ]
    },
    {
      "id": "sahih-muslim-5184",
      "hadith_no": "5184",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا  أبي، حدثنا زكرياء، عن فراس، عن عامر، عن البراء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاتنا ووجه قبلتنا ونسك نسكنا فلا يذبح حتى يصلي ‏\"‏ ‏.‏ فقال خالي يا رسول الله قد نسكت عن ابن لي ‏.‏ فقال ‏\"‏ ذاك شىء عجلته لأهلك ‏\"‏ ‏.‏ فقال إن عندي شاة خير من شاتين قال ‏\"‏ ضح بها فإنها خير نسيكة ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' reported Allah's Messenger (may peace be upon him) having said:                      He who observes prayer like our prayer and turns his face towards our Qibla (in prayer) and who offers sacrifices (of animals) as we do, he must not slaughter the (animal as a sacrifice) until he has completed the prayer. Thereupon my maternal uncle said: Messenger of Allah, I have sacrificed the animal on behalf of my son. The Messenger of Allah (may peace be upon him) said: This is the thing in which you have made haste for your family. He said: I have a goat with me better than two goats. Thereupon he said: Sacrifice it for that is the best.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "30212",
        "20331",
        "11338",
        "11385",
        "11052",
        "400"
      ]
    },
    {
      "id": "sahih-muslim-6467",
      "hadith_no": "6467",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو كامل الجحدري، فضيل بن حسين حدثنا أبو عوانة، عن فراس، عن  عامر، عن مسروق، عن عائشة، قالت كن أزواج النبي صلى الله عليه وسلم عنده لم يغادر منهن واحدة فأقبلت فاطمة تمشي ما تخطئ مشيتها من مشية رسول الله صلى الله عليه وسلم شيئا فلما رآها رحب بها فقال ‏\"‏ مرحبا بابنتي ‏\"‏ ‏.‏ ثم أجلسها عن يمينه أو عن شماله ثم سارها فبكت بكاء شديدا فلما رأى جزعها سارها الثانية فضحكت ‏.‏ فقلت لها خصك رسول الله صلى الله عليه وسلم من بين نسائه بالسرار ثم أنت تبكين فلما قام رسول الله صلى الله عليه وسلم سألتها ما قال لك رسول الله صلى الله عليه وسلم قالت ما كنت أفشي على رسول الله صلى الله عليه وسلم سره ‏.‏ قالت فلما توفي رسول الله صلى الله عليه وسلم قلت عزمت عليك بما لي عليك من الحق لما حدثتني ما قال لك رسول الله صلى الله عليه وسلم فقالت أما الآن فنعم أما حين سارني في المرة الأولى فأخبرني ‏\"‏ أن جبريل كان يعارضه القرآن في كل سنة مرة أو مرتين وإنه عارضه الآن مرتين وإني لا أرى الأجل إلا قد اقترب فاتقي الله واصبري فإنه نعم السلف أنا لك ‏\"‏ ‏.‏ قالت فبكيت بكائي الذي رأيت فلما رأى جزعي سارني الثانية فقال ‏\"‏ يا فاطمة أما ترضى أن تكوني سيدة نساء المؤمنين أو سيدة نساء هذه الأمة ‏\"‏ ‏.‏ قالت فضحكت ضحكي الذي رأيت ‏.‏",
      "text_en": " 'A'isha reported:                      We, the wives of Allah's Apostle (may peace be upon him), were with him (during his last illness) and none was absent therefrom that Fatima, who walked after the style of Allah's Messenger (may peace be upon him), came there, and when he saw her he welcomed her saying: You are welcome, my daughter. He their made her sit on his right side or on his left side. Then he said something secretly to her and she wept bitterly and when he found her (plunged) in grief he said to her something secretly for the second time and she laughed. I ('A'isha) said to her: Allah's Messenger has singled you amongst the women (of the family) for talking (to you something secretly) and you wept. When Allah's Messenger (may peace be upon him) recovered from illness, I said to her. What did Allah's Messenger (may peace be upon him) say to you? Thereupon she said: I am not going to disclose the secret of Allah's Messenger (may peace be upon him). When Allah's Messenger (may peace be upon him) died, I said to her: I adjure you by the right that I have upon you that you should narrate to me what Allah's Messenger (may peace be upon him) said to you. She said: Yes, now I can do that (so listen to it). When he talked to me secretly for the first time he informed me that Gabirel was in the habit of reciting the Qur'an along with him once or twice every year, but this year it had been twice and so he perceived his death quite near, so fear Allah and be patient (and he told me) that he would be a befitting forerunner for me and so I wept as you saw me. And when he saw me in grief he talked to me secretly for the second time and said: Fatima, are you not pleased that you should be at the head of the believing women or the head of this Umma? I laughed and it was that laughter which you saw.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6468",
      "hadith_no": "6468",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحدثنا عبد الله بن نمير، عن زكرياء، ح وحدثنا  ابن نمير، حدثنا أبي، حدثنا زكرياء، عن فراس، عن عامر، عن مسروق، عن عائشة، قالت اجتمع نساء النبي صلى الله عليه وسلم فلم يغادر منهن امرأة فجاءت فاطمة تمشي كأن مشيتها مشية رسول الله صلى الله عليه وسلم فقال ‏\"‏ مرحبا بابنتي ‏\"‏ ‏.‏ فأجلسها عن يمينه أو عن شماله ثم إنه أسر إليها حديثا فبكت فاطمة ثم إنه سارها فضحكت أيضا فقلت لها ما يبكيك فقالت ما كنت لأفشي سر رسول الله صلى الله عليه وسلم ‏.‏ فقلت ما رأيت كاليوم فرحا أقرب من حزن ‏.‏ فقلت لها حين بكت أخصك رسول الله صلى الله عليه وسلم بحديثه دوننا ثم تبكين وسألتها عما قال فقالت ما كنت لأفشي سر رسول الله صلى الله عليه وسلم ‏.‏ حتى إذا قبض سألتها فقالت إنه كان حدثني ‏\"‏ أن جبريل كان يعارضه بالقرآن كل عام مرة وإنه عارضه به في العام مرتين ولا أراني إلا قد حضر أجلي وإنك أول أهلي لحوقا بي ونعم السلف أنا لك ‏\"‏ ‏.‏ فبكيت لذلك ثم إنه سارني فقال ‏\"‏ ألا ترضين أن تكوني سيدة نساء المؤمنين أو سيدة نساء هذه الأمة ‏\"‏ ‏.‏ فضحكت لذلك ‏.‏",
      "text_en": " 'A'isha reported that all the wives of Allah's Apostle (may peace be upon him) had gathered (in her apartment) during the days of his (Prophet's) last illness and no woman was left behind that Fatima, who walked after the style of Allah's Messenger (may peace be upon him), came there. He welcomed her by saying:                      You are welcome, my daughter, and made her sit on his right side or on his left side, and then talked something secretly to her and Fitima wept. Then he talked something secretly to her and she laughed. I said to her: What makes you weep? She said; I am not going to divulge the secret of Allah's Messenger (may peace be upon him). I ('A'isha) said: I have not seen (anything happening) like today, the happiness being more close to grief (as I see today) when she wept. I said to her: Has Allah's Messenger (may peace be upon him) singled you out for saying something leaving us aside? She then wept and I asked her what he said, and she said: I am not going to divulge the secrets of Allah's Messenger (may peace be upon him). And when he died I again asked her and she said that he (the Holy Prophet) told her: Gabriel used to recite the Qur'an to me once a year and for this year it was twice and so I perceived that my death had drawn near, and that I ('A'isha) would be the first amongst the members of his family who would meet him (in the Hereafter). He shall be my good forerunner and it made me weep. He again talked to me secretly (saying): Arn't you pleased that you should be the sovereign amongst the believing women or the head of women of this Umma? And this made me laugh.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "11338",
        "30212",
        "20331",
        "11338",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-452",
      "hadith_no": "452",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن ابن عمر، أن مسجد النبي، صلى الله عليه وسلم كانت سواريه على عهد رسول الله صلى الله عليه وسلم من جذوع النخل أعلاه مظلل بجريد النخل ثم إنها نخرت في خلافة أبي بكر فبناها بجذوع النخل وبجريد النخل ثم إنها نخرت في خلافة عثمان فبناها بالآجر فلم تزل ثابتة حتى الآن ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The pillars of the mosque of the Prophet (ﷺ) during the life time of the Messenger of Allah (ﷺ) were made of the trunks of the palm-tree; they covered from the above by twigs of the palm-tree; they decayed during the caliphate of Abu Bakr. He built it afresh with trunks and twigs of the palm-tree. But they again decayed during the caliphate of 'Uthman. He, therefore, built it with bricks. That survives until today.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20340",
        "20240",
        "11385",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2114",
      "hadith_no": "2114",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن فراس، عن الشعبي، عن مسروق، عن عبد الله، في رجل تزوج امرأة فمات عنها ولم يدخل بها ولم يفرض لها الصداق فقال لها الصداق كاملا وعليها العدة ولها الميراث ‏.‏ فقال معقل بن سنان سمعت رسول الله صلى الله عليه وسلم قضى به في بروع بنت واشق ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Masruq said on the authority of Abdullah ibn Mas'ud: Abdullah (ibn Mas'ud ) was asked about a man who had married a woman without cohabiting with her or fixing any dower for her till he died. Ibn Mas'ud said: She should receive the full dower (as given to women of her class), observe the waiting period ('Iddah), and have her share of inheritance. Thereupon Ma'qil ibn Sinan said: I heard the Messenger of Allah (ﷺ) giving the same decision regarding Birwa' daughter of Washiq (as the decision you have given).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20033",
        "20012",
        "11385",
        "11052",
        "11018"
      ]
    },
    {
      "id": "sunan-abi-daud-5168",
      "hadith_no": "5168",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وأبو كامل قالا حدثنا أبو عوانة، عن فراس، عن أبي صالح، ذكوان عن زاذان، قال أتيت ابن عمر وقد أعتق مملوكا له فأخذ من الأرض عودا أو شيئا فقال ما لي فيه من الأجر ما يسوى هذا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لطم مملوكه أو ضربه فكفارته أن يعتقه ‏\"‏ ‏.‏",
      "text_en": " Zadhan said:                      I came to Ibn ‘Umar when he set his slave free. He took a stick or something else from the earth and said; for me there is no reward even equivalent to this. I heard the Messenger of Allah (May peace be upon him) say: If anyone slaps or beats his slave the atonement due from him is to set him free.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30559",
        "20469",
        "11385",
        "11161",
        "10911"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2381",
      "hadith_no": "2381",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن فراس، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرائي يرائي الله به ومن يسمع يسمع الله به ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ من لا يرحم الناس لا يرحمه الله ‏\"‏ ‏.‏ وفي الباب عن جندب وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Sa'eed narrated that the Messenger of Allah (S.a.w) said:                     \"Whoever wants to be seen, Allah will show him, And whoever wants to be heard of, Allah will make him heard off.\" And he narrated that the Messenger of Allah (s.a.w) said: \"He who shows no mercy to the people, Allah shows him no mercy.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20609",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2715",
      "hadith_no": "2715",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عباس الدوري، حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها وقال ذلك الظل الممدود ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سعيد ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said:                     \"In Paradise there is a tree, a rider will travel in its shade for a hundred years without reaching an end.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2731",
      "hadith_no": "2731",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ أول زمرة تدخل الجنة على صورة القمر ليلة البدر والثانية على لون أحسن كوكب دري في السماء لكل رجل منهم زوجتان على كل زوجة سبعون حلة يبدو مخ ساقها من ورائها ‏\"‏ ‏.‏ قال هذا حديث صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2793",
      "hadith_no": "2793",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبيد الله بن موسى، حدثنا شيبان، عن فراس، عن عطية، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ ناركم هذه جزء من سبعين جزءا من نار جهنم لكل جزء منها حرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سعيد ‏.‏",
      "text_en": " Abu Sa'eed narrated that the Prophet (s.a.w) said:                     \"This fire of yours is one part from seventy parts of the fire of Hell, each part of it is like the heat of this one.\"",
      "usc_msa_ref": "",
      "chain": [
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3294",
      "hadith_no": "3294",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فراس، عن الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الإشراك بالله وعقوق الوالدين أو قال اليمين الغموس ‏\"‏ ‏.‏ شك شعبة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Prophet (ﷺ) said: \"The major sins are associating others with Allah, disobeying the parents\" or he said, \"the false oath\". Shu'bah (a narrator in the chain) was in doubt.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-2541",
      "hadith_no": "2541",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يحيى بن حماد، قال أنبأنا أبو عوانة، عن فراس، عن عامر، عن مسروق، عن عائشة، رضى الله عنها أن أزواج، النبي صلى الله عليه وسلم اجتمعن عنده فقلن أيتنا بك أسرع لحوقا فقال ‏\"‏ أطولكن يدا ‏\"‏ ‏.‏ فأخذن قصبة فجعلن يذرعنها فكانت سودة أسرعهن به لحوقا فكانت أطولهن يدا فكان ذلك من كثرة الصدقة ‏.‏",
      "text_en": " It was narrated from 'Aishah, may Allah be pleased with her, that the wives of the Prophet \"gathered around him and said:                     \"Which of us will be the first to following you (in death)?\" He said: \"The one of you who has the longest arms.\" They took a stick and started to measure their arms. But Sawdah was the first one to follow him. She was the one who had the longest arms, because she used to give in charity a great deal.",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20574",
        "20469",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3356",
      "hadith_no": "3356",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن فراس، عن الشعبي، عن مسروق، عن عبد الله، في رجل تزوج امرأة فمات ولم يدخل بها ولم يفرض لها قال لها الصداق وعليها العدة ولها الميراث ‏.‏ فقال معقل بن سنان فقد سمعت النبي صلى الله عليه وسلم قضى به في بروع بنت واشق ‏.‏",
      "text_en": " It was narrated that 'Abdullah said, concerning a man who married a woman, then died before consummating the marriage with her, and without naming a dowry:                      \"She should have the dowry, and she has to observe the 'Iddah, and she may inherit.\" Ma'qil bin Sinan said: \"I heard the Prophet pass the same judgment concerning Birwa' bint Washiq.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20012",
        "11385",
        "11052",
        "11018"
      ]
    },
    {
      "id": "sunan-an-nasai-3636",
      "hadith_no": "3636",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله، عن شيبان، عن فراس، عن الشعبي، قال حدثني جابر بن عبد الله، أن أباه، استشهد يوم أحد وترك ست بنات وترك عليه دينا فلما حضر جداد النخل أتيت رسول الله صلى الله عليه وسلم فقلت قد علمت أن والدي استشهد يوم أحد وترك دينا كثيرا وإني أحب أن يراك الغرماء‏.‏ قال ‏\"‏ اذهب فبيدر كل تمر على ناحية ‏\"‏‏.‏ ففعلت ثم دعوته فلما نظروا إليه كأنما أغروا بي تلك الساعة فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات ثم جلس عليه ثم قال ‏\"‏ ادع أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله أمانة والدي وأنا راض أن يؤدي الله أمانة والدي لم تنقص تمرة واحدة‏.‏",
      "text_en": " Jabir bin 'Abdullah narrated that his father was martyred on the Day of Uhud, and he left behind six daughters, and some outstanding debts. When the time to pick the dates came, I went to the Messenger of Allah and said:                      \"You know that my father was martyred on the Day of Uhud and he left behind a great deal of debt. I would like the creditors to see you.\" He said: \"Go and pile up the dates in separate heaps.\" I did that, then I called him. When they saw him, it was as if they started to put pressure on me at that time. When he saw what they were doing, he went around the biggest heap three times, then he sat on it then said: \"Call your companions (the creditors).\" Then he kept on weighing them out for them, until Allah cleared all my father's debts. I am pleased that Allah cleared my father's debts without even a single date being missed.",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "11201",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4011",
      "hadith_no": "4011",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني عبدة بن عبد الرحيم، قال أنبأنا ابن شميل، قال أنبأنا شعبة، قال حدثنا فراس، قال سمعت الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الإشراك بالله وعقوق الوالدين وقتل النفس واليمين الغموس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that:                     The Prophet [SAW] said: \"The major sins are: Associating others with Allah, disobeying parents, killing a soul (murder) and swearing a false oath knowingly.\"",
      "usc_msa_ref": "",
      "chain": [
        "38366",
        "20020",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4394",
      "hadith_no": "4394",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، عن ابن أبي زائدة، قال أنبأنا أبي، عن فراس، عن عامر، عن البراء بن عازب، ح وأنبأنا داود بن أبي هند، عن الشعبي، عن البراء، - فذكر أحدهما ما لم يذكر الآخر - قال قام رسول الله صلى الله عليه وسلم يوم الأضحى فقال ‏\"‏ من وجه قبلتنا وصلى صلاتنا ونسك نسكنا فلا يذبح حتى يصلي ‏\"‏ ‏.‏ فقام خالي فقال يا رسول الله إني عجلت نسكي لأطعم أهلي وأهل داري أو أهلي وجيراني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعد ذبحا آخر ‏\"‏ ‏.‏ قال فإن عندي عناق لبن هي أحب إلى من شاتى لحم ‏.‏ قال ‏\"‏ اذبحها فإنها خير نسيكتيك ولا تقضي جذعة عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Bara bin 'Azib said:                     \"The Messenger of Allah stood up on the Day of Sacrifice and Said: 'Whoever turn toward our Qiblah and prays as we pray and offers the same sacrifice as we do, let him not offer his sacrifice until he has prayed; My maternal uncle stood up and said: 'O Messenger of Allah, I hastened to slaughter my sacrifice, so that I could feed my family,. And the members of my household,; or my family and my neighbors,; The Messenger of Allah said; 'Offer another sacrifice,; He said: 'I have a suckling she-goat kid that is dearer to me than two sheep raised for meat,' He said: 'Sacrifice it, for it is the better of your two sacrifices. But no Jadh'ah will do as a sacrifice for anyone after you.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20366",
        "11338",
        "11385",
        "11052",
        "400",
        "11585",
        "11052"
      ]
    },
    {
      "id": "sunan-an-nasai-4868",
      "hadith_no": "4868",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبدة بن عبد الرحيم، قال أنبأنا ابن شميل، قال حدثنا شعبة، قال أنبأنا فراس، قال سمعت الشعبي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الإشراك بالله وعقوق الوالدين وقتل النفس واليمين الغموس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Prophet said:                     \"The major sins are: associating others with Allah, disobeying parents, killing a souls (murder) and swearing a false oath knowingly.",
      "usc_msa_ref": "",
      "chain": [
        "38366",
        "20020",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-100",
      "hadith_no": "100",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان، عن الحسن بن عمارة، عن فراس، عن الشعبي، عن الحارث، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أبو بكر وعمر سيدا كهول أهل الجنة من الأولين والآخرين إلا النبيين والمرسلين لا تخبرهما يا علي ما داما حيين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah said: 'Abu Bakr and 'Umar are the leaders of the mature people of Paradise, and the first and the last, except for the Prophets and Messengers, but do not tell them about that, O 'Ali, as long as they are still alive.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20012",
        "25053",
        "11385",
        "11052",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1689",
      "hadith_no": "1689",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن زكريا، عن فراس، عن عامر، عن مسروق، عن عائشة، قالت اجتمعن نساء النبي  صلى الله عليه وسلم  فلم تغادر منهن امرأة فجاءت فاطمة كأن مشيتها مشية رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ مرحبا بابنتي ‏\"‏ ‏.‏ ثم أجلسها عن شماله ثم إنه أسر إليها حديثا فبكت فاطمة ثم إنه سارها فضحكت أيضا فقلت لها ما يبكيك قالت ما كنت لأفشي سر رسول الله  صلى الله عليه وسلم  ‏.‏ فقلت ما رأيت كاليوم فرحا أقرب من حزن ‏.‏ فقلت لها حين بكت أخصك رسول الله  صلى الله عليه وسلم  بحديث دوننا ثم تبكين وسألتها عما قال ‏.‏ فقالت ما كنت لأفشي سر رسول الله - -- ص - ‏.‏ حتى إذا قبض سألتها عما قال فقالت إنه كان يحدثني أن جبرائيل كان يعارضه بالقرآن في كل عام مرة وأنه عارضه به العام مرتين ‏\"‏ ولا أراني إلا قد حضر أجلي وأنك أول أهلي لحوقا بي ونعم السلف أنا لك ‏\"‏ ‏.‏ فبكيت ثم إنه سارني فقال ‏\"‏ ألا ترضين أن تكوني سيدة نساء المؤمنين - أو نساء هذه الأمة - ‏\"‏ ‏.‏ فضحكت لذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The wives of the Prophet (ﷺ)gathered together and not one of them lagged behind. Fatimah came,andher gait was like that of the Messenger of Allah (ﷺ). He said,‘Welcome to my daughter.’ Then he made her sit to his left, andhewhispered something to her, and she smiled. I said to her: ‘Whatmadeyou weep?’ She said: ‘I will not disclose the secret of theMessengerof Allah (ﷺ).’ I said: ‘I never saw joy so close togrief as I sawtoday.’ When she wept I said: ‘Did the Messengerof Allah (ﷺ) tellyou some special words that were not for us, thenyou wept?’ And Iasked her about what he had said. She said: ‘Iwill not disclose thesecret of the Messenger of Allah (ﷺ).’After he died I asked herwhat he had said, and she said: ‘He toldme that Jibra’il used toreview the Qur’an with him once eachyear, but he had reviewed it withhim twice that year, (and he said:)“I do not think but that my timeis near. You will be the first ofmy family to join me, and what agood predecessor I am for you.” SoI wept. Then he whispered to me andsaid: “Will you not be pleasedto be the leader of the women of thisUmmah?” So I smiled.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "11338",
        "11385",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1965",
      "hadith_no": "1965",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن فراس، عن الشعبي، عن مسروق، عن عبد الله، أنه سئل عن رجل، تزوج امرأة فمات عنها ولم يدخل بها ولم يفرض لها ‏.‏ قال فقال عبد الله لها الصداق ولها الميراث وعليها العدة ‏.‏ فقال معقل بن سنان الأشجعي شهدت رسول الله  صلى الله عليه وسلم  قضى في بروع بنت واشق بمثل ذلك ‏.‏",
      "text_en": " It was narrated from Abu Saeed Al-Khudri that:                     the Prophet(ﷺ) married Aishah with the household goods the values of which was fifty Dirham.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20033",
        "20012",
        "11385",
        "11052",
        "11018",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2859",
      "hadith_no": "2859",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ المجاهد في سبيل الله مضمون على الله إما أن يكفته إلى مغفرته ورحمته وإما أن يرجعه بأجر وغنيمة ومثل المجاهد في سبيل الله كمثل الصائم القائم الذي لا يفتر حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)said:                     “The one who fights in the cause of Allah has a guarantee fromAllah. Either He will raise him to His forgiveness and mercy, or Hewill send him back with reward and spoils of war. The likeness of theone who fights in the cause of Allah is that of one who fasts andprays at night without ceasing, until he returns.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3780-2",
      "hadith_no": "3780",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبيد الله بن موسى، أنبأنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقال لصاحب القرآن إذا دخل الجنة اقرأ واصعد ‏.‏ فيقرأ ويصعد بكل آية درجة حتى يقرأ آخر شىء معه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed Al-Khudri that the Messenger of Allah(ﷺ) said:                     \"It will be said to the companion of the Quran, when he enters Paradise: 'Recite and rise one degree for ever Verse,' until he recites the last thing that he knows.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3895",
      "hadith_no": "3895",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبيد الله بن موسى، أنبأنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ رؤيا الرجل المسلم الصالح جزء من سبعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)said:                     “The dream of a righteous Muslim man is one of the seventy partsofprophecy.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    }
  ],
  "total_hadiths": 34
}