{
  "id": "11384",
  "name": "Farat bin Abi 'Abdur Rahman فرات بن أبي عبد الرحمن القزاز",
  "full_name": "Farat bin Abi 'Abdur Rahman فرات بن أبي عبد الرحمن القزاز",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Basri",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20582",
      "name": "al-Hasan bin al-Farat al-Qazaz الحسن بن الفرات بن أبي عبد الرحمن القزاز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10794",
      "name": "'Ubaidullah bin al-Qbtyh عبيد الله بن القبطية الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11056",
      "name": "'Abdur Rahman bin al-Aswad عبد الرحمن بن الأسود النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20582",
      "name": "al-Hasan bin al-Farat al-Qazaz الحسن بن الفرات بن أبي عبد الرحمن القزاز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25094",
      "name": "Ziyad bin al-Hasan bin al-Farat al-Qazaz زياد بن الحسن بن الفرات القزاز",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20726",
      "name": "'Amr bin Abi Qays عمرو بن أبي قيس الرازي الأزرق كوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3455",
      "hadith_no": "3455",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فرات القزاز، قال سمعت أبا حازم، قال قاعدت أبا هريرة خمس سنين، فسمعته يحدث، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت بنو إسرائيل تسوسهم الأنبياء، كلما هلك نبي خلفه نبي، وإنه لا نبي بعدي، وسيكون خلفاء فيكثرون‏.‏ قالوا فما تأمرنا قال فوا ببيعة الأول فالأول، أعطوهم حقهم، فإن الله سائلهم عما استرعاهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Israelis used to be ruled and guided by prophets: Whenever a prophet died, another would take over his place. There will be no prophet after me, but there will be Caliphs who will increase in number.\" The people asked, \"O Allah's Apostle! What do you order us (to do)?\" He said, \"Obey the one who will be given the pledge of allegiance first. Fulfil their (i.e. the Caliphs) rights, for Allah will ask them about (any shortcoming) in ruling those Allah has put under their guardianship.\"",
      "usc_msa_ref": "661",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11384",
        "11172"
      ]
    },
    {
      "id": "sahih-muslim-431-3",
      "hadith_no": "431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن إسرائيل، عن فرات، - يعني القزاز - عن عبيد الله، عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم فكنا إذا سلمنا قلنا بأيدينا السلام عليكم السلام عليكم فنظر إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما شأنكم تشيرون بأيديكم كأنها أذناب خيل شمس إذا سلم أحدكم فليلتفت إلى صاحبه ولا يومئ بيده ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      We said our prayer with the Messenger of Allah (may peace be upon him) and, while pronouncing salutations, we made gestures with our hands (indicating)\" Peace be upon you, peace be upon you.\" The Messenger of Allah (may peace be upon him) looked towards us and said: Why is it that you make gestures with your hands like the tails of headstrong horses? When any one of you pro- nounces salutation (in prayer) he should only turn his face towards his companion and should not make a gesture with his hand.",
      "usc_msa_ref": "",
      "chain": [
        "20340",
        "20311",
        "11384",
        "11201",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-4879",
      "hadith_no": "4879",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن فرات القزاز، عن أبي حازم، قال قاعدت أبا هريرة خمس سنين فسمعته يحدث، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت بنو إسرائيل تسوسهم الأنبياء كلما هلك نبي خلفه نبي وإنه لا نبي بعدي وستكون خلفاء فتكثر ‏\"‏ ‏.‏ قالوا فما تأمرنا قال ‏\"‏ فوا ببيعة الأول فالأول وأعطوهم حقهم فإن الله سائلهم عما استرعاهم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Abu Huraira that the Holy Prophet (may pceace be upon him) said:                      Banu Isra'il were ruled over by the Prophets. When one Prophet died, another succeeded him; but after me there is no prophet and there will be caliphs and they will be quite large in number. His Companions said: What do you order us to do (in case we come to have more than one Caliph)? He said: The one to whom allegiance is sworn first has a supremacy over the others. Concede to them their due rights (i. e. obey them). God (Himself) will question them about the subjects whom He had entrusted to them.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11384",
        "11349"
      ]
    },
    {
      "id": "sahih-muslim-7467",
      "hadith_no": "7467",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو خيثمة، زهير بن حرب وإسحاق بن إبراهيم وابن أبي عمر المكي - واللفظ لزهير - قال إسحاق أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن فرات، القزاز عن أبي الطفيل، عن حذيفة بن أسيد الغفاري، قال اطلع النبي صلى الله عليه وسلم علينا ونحن نتذاكر فقال ‏\"‏ ما تذاكرون ‏\"‏ ‏.‏ قالوا نذكر الساعة ‏.‏ قال ‏\"‏ إنها لن تقوم حتى ترون قبلها عشر آيات ‏\"‏ ‏.‏ فذكر الدخان والدجال والدابة وطلوع الشمس من مغربها ونزول عيسى ابن مريم صلى الله عليه وسلم ويأجوج ومأجوج وثلاثة خسوف خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب وآخر ذلك نار تخرج من اليمن تطرد الناس إلى محشرهم ‏.‏",
      "text_en": " Hudhaifa b. Usaid Ghifari reported:                      Allah's Messenger (may peace be upon him) came to us all of a sudden as we were (busy in a discussion). He said: What do you discuss about? They (the Companions) said. We are discussing about the Last Hour. Thereupon he said: It will not cone until you see ten signs before and (in this connection) he made a mention of the smoke, Dajjal, the beast, the rising of the sun from the west, the descent of Jesus son of Mary (Allah be pleased with him), the Gog and Magog, and land-slidings in three places, one in the east, one in the west and one in Arabia at the end of which fire would burn forth from the Yemen, and would drive people to the place of their assembly.",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20005",
        "11384",
        "3660"
      ]
    },
    {
      "id": "sahih-muslim-7468",
      "hadith_no": "7468",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن فرات القزاز، عن  أبي الطفيل، عن أبي سريحة، حذيفة بن أسيد قال كان النبي صلى الله عليه وسلم في غرفة ونحن أسفل منه فاطلع إلينا فقال ‏\"‏ ما تذكرون ‏\"‏ ‏.‏ قلنا الساعة ‏.‏ قال ‏\"‏ إن الساعة لا تكون حتى تكون عشر آيات خسف بالمشرق وخسف بالمغرب وخسف في جزيرة العرب والدخان والدجال ودابة الأرض ويأجوج ومأجوج وطلوع الشمس من مغربها ونار تخرج من قعرة عدن ترحل الناس ‏\"‏ ‏.‏ قال شعبة وحدثني عبد العزيز بن رفيع عن أبي الطفيل عن أبي سريحة ‏.‏ مثل ذلك لا يذكر النبي صلى الله عليه وسلم وقال أحدهما في العاشرة نزول عيسى ابن مريم صلى الله عليه وسلم ‏.‏ وقال الآخر وريح تلقي الناس في البحر ‏.‏",
      "text_en": " Hudhaifa b. Usaid reported:                      Allah's Apostle (may peace be upon him) was in an apartment and we were beneath that that he peeped in and said to us: What are you discussing about? We said: (We are discussing about the Last) Hour. Thereupon he said: The Last Hour would not come until the ten signs dppear: land-sliding in the east, and land-sliding in the west, and land-sliding in the peninsula of Arabia, the smoke, the Dajjal, the beast of the earth, Gog and Magog, the rising of the sun from the west and the fire which would emit from the lower part of 'Adan. Shu'ba said that 'Abd al-'Aziz b. Rufai' reported on the authority of Abu Tufail who reported on the authority of Abu Sariha a hadith like this that Allah's Apostle (may peace be upon him) did not make a mention of (the tenth sign) but he said that out of the ten one was the descent of Jesus Christ, son of Mary (peace be upon him), and in another version it is theb lowing of the violent gale which would drive the people to the ocean.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11384",
        "3660"
      ]
    },
    {
      "id": "sunan-abi-daud-4311",
      "hadith_no": "4311",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا مسدد، وهناد، - المعنى - قال مسدد حدثنا أبو الأحوص، حدثنا فرات القزاز، عن عامر بن واثلة، - وقال هناد عن أبي الطفيل، - عن حذيفة بن أسيد الغفاري، قال كنا قعودا نتحدث في ظل غرفة لرسول الله صلى الله عليه وسلم فذكرنا الساعة فارتفعت أصواتنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ لن تكون - أو لن تقوم - الساعة حتى يكون قبلها عشر آيات طلوع الشمس من مغربها وخروج الدابة وخروج يأجوج ومأجوج والدجال وعيسى ابن مريم والدخان وثلاث خسوف خسف بالمغرب وخسف بالمشرق وخسف بجزيرة العرب وآخر ذلك تخرج نار من اليمن من قعر عدن تسوق الناس إلى المحشر ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah b. Usaid al-Ansari said :                      We were sitting in the shade of the chamber of the Messenger of Allah (ﷺ) discussing (something) and when we mentioned the last hour, our voices rose high. The Messenger of Allah (ﷺ) said: The last hour will not come or happen until there appear ten signs before it : the rising of the sun in its place of setting, the coming forth of the beast, the coming forth of Gog and Magog, the Dajjal (Antichrist), (the descent of) Jesus son of Mary, the smoke, three subsidence’s, one in the will issue forth from the Yemen, from the lowest part of Aden, and drive mankind to their place of assembly.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30175",
        "20327",
        "11384",
        "30480",
        "3660"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2183-2",
      "hadith_no": "2183",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا بندار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن فرات القزاز، عن أبي الطفيل، عن حذيفة بن أسيد، قال أشرف علينا رسول الله صلى الله عليه وسلم من غرفة ونحن نتذاكر الساعة فقال النبي صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تروا عشر آيات طلوع الشمس من مغربها ويأجوج ومأجوج والدابة وثلاثة خسوف خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب ونار تخرج من قعر عدن تسوق الناس أو تحشر الناس فتبيت معهم حيث باتوا وتقيل معهم حيث قالوا ‏\"‏ ‏.‏ حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن فرات، نحوه وزاد فيه ‏\"‏ الدخان ‏\"‏ ‏.‏حدثنا هناد، حدثنا أبو الأحوص، عن فرات القزاز، نحو حديث وكيع عن سفيان، ‏.‏حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، عن شعبة، والمسعودي، سمعا من، فرات القزاز نحو حديث عبد الرحمن عن سفيان عن فرات وزاد فيه ‏\"‏ الدجال أو الدخان ‏\"‏ ‏.‏حدثنا أبو موسى، محمد بن المثنى حدثنا أبو النعمان الحكم بن عبد الله العجلي، عن شعبة، عن فرات، نحو حديث أبي داود عن شعبة، وزاد، فيه قال ‏\"‏ والعاشرة إما ريح تطرحهم في البحر وإما نزول عيسى ابن مريم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وأبي هريرة وأم سلمة وصفية بنت حيى ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Asid said:                     \"The Messenger of Allah (s.a.w) stood over us on a balcony, and we were discussing the Hour. So the Messenger of Allah(s.a.w) said: 'The Hour shall not be established until you see ten signs. The sun rising from its setting place, Ya'juj and Ma'juj, the beast of the earth, and three collapses of the earth: A collapse in the east, a collapse in the west and a collapse in the 'Arabian peninsula. And a fire that comes out of a place within 'Adan, driving the people, or gathering the people, camping where they camp, and resting where they rest.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11384",
        "3660"
      ]
    },
    {
      "id": "sunan-an-nasai-1326",
      "hadith_no": "1326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن فرات القزاز، عن عبيد الله، - وهو ابن القبطية - عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم فكنا إذا سلمنا قلنا بأيدينا السلام عليكم السلام عليكم - قال - فنظر إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما شأنكم تشيرون بأيديكم كأنها أذناب خيل شمس إذا سلم أحدكم فليلتفت إلى صاحبه ولا يومئ بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I prayed with the Messenger of Allah (ﷺ) and when we said the salam we used to gesture with our hands: 'Asalamu alaykum wa rahmatullah (peace be upon, peace be upon you).' The Messenger of Allah (ﷺ) looked at us and said: 'What is the matter with you, pointing with your hands as if they are the tails of wild horses? When any one of you says the salam, let him turn to his companions and not gesture with his hand.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11384",
        "10794",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-4177",
      "hadith_no": "4177",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن فرات القزاز، عن أبي الطفيل، عن حذيفة بن أسيد، قال اطلع علينا النبي  صلى الله عليه وسلم  من غرفة ونحن نتذاكر الساعة فقال ‏\"‏ لا تقوم الساعة حتى تكون عشر آيات الدجال والدخان وطلوع الشمس من مغربها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Asid said:                      \"The Prophet (ﷺ)looked out at us from a room, when we were talking about the Hour. Hesaid: 'The Hour will not begin until there are ten signs: Dajjal,(False Christ), the smoke, and the rising of the sun from the west.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11384",
        "3660"
      ]
    },
    {
      "id": "sunan-ibn-majah-4191",
      "hadith_no": "4191",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن فرات القزاز، عن عامر بن واثلة أبي الطفيل الكناني، عن حذيفة بن أسيد أبي سريحة، قال اطلع رسول الله  صلى الله عليه وسلم  من غرفة ونحن نتذاكر الساعة فقال ‏\"‏ لا تقوم الساعة حتى تكون عشر آيات طلوع الشمس من مغربها والدجال والدخان والدابة ويأجوج ومأجوج وخروج عيسى ابن مريم عليه السلام وثلاث خسوف خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب ونار تخرج من قعر عدن أبين تسوق الناس إلى المحشر تبيت معهم إذا باتوا وتقيل معهم إذا قالوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Asid, Abu Sarihah, said:                      \"TheMessenger of Allah (ﷺ) looked out from a room, when we were talkingabout the Hour. He said: 'The Hour will not begin until ten signsappear: The rising of the sun from the west (place of its setting);Dajjal; the smoke; the beast; Gog and Magog people; the appearance of'Eisa bin Maryam(as), the earth collapsing three times - once in theeast, one in the west and one in the Arabian Peninsula; and fire thatwill emerge from the plain of Aden Abyan and will drive the people tothe place of Gathering, stopping with them when they stop at nightandwhen they stop to rest at midday.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11384"
      ]
    }
  ],
  "total_hadiths": 10
}