{
  "id": "11381",
  "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
  "full_name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "112",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Muradi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10780",
      "name": "'Abdullah bin al-Harith عبد الله بن الحارث الزبيدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11557",
      "name": "al-Hasan bin Muslim bin Yanaq الحسن بن مسلم بن يناق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11332",
      "name": "Khaythama bin 'Abdur Rahman خيثمة بن عبد الرحمن بن أبي سبرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14457",
      "name": "Abu 'Umar أبو عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11633",
      "name": "Talha bin Yazid al-Ayly طلحة بن يزيد الأيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10839",
      "name": "Yahya bin al-Jazar al-Arni يحيى بن الجزار",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20407",
      "name": "Idris bin Yazid bin 'Abdur Rahman al-Awd إدريس بن يزيد بن عبد الرحمن الأودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11441",
      "name": "al-'Awwam bin Hushab العوام بن حوشب بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10776",
      "name": "Darar bin Marra, Abu Sinan ضرار بن مرة الكوفي أبو سنان الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "717",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا شعبة، قال أخبرني عمرو بن مرة، قال سمعت سالم بن أبي الجعد، قال سمعت النعمان بن بشير، يقول قال النبي صلى الله عليه وسلم ‏\"‏ لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin 'Bashir:                     The Prophet said, \"Straighten your rows or Allah will alter your faces.\"",
      "chain": [
        "20296",
        "20020",
        "11381",
        "11342",
        "274"
      ]
    },
    {
      "hadith_no": "775",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، قال جاء رجل إلى ابن مسعود فقال قرأت المفصل الليلة في ركعة‏.‏ فقال هذا كهذ الشعر لقد عرفت النظائر التي كان النبي صلى الله عليه وسلم يقرن بينهن فذكر عشرين سورة من المفصل سورتين في كل ركعة‏.‏",
      "text_en": " Narrated Abu Wa'il:                     A man came to Ibn Mas`ud and said, \"I recited the Mufassal (Suras) at night in one rak`a.\" Ibn Mas`ud said, \"This recitation is (too quick) like the recitation of poetry. I know the identical Suras which the Prophet used to recite in pairs.\" Ibn Mas`ud then mentioned 20 Mufassal Suras including two Suras from the family of (i.e. those verses which begin with) Ha, Meem [??] (which the Prophet used to recite) in each rak`a.",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11353"
      ]
    },
    {
      "hadith_no": "1176",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، يقول ما حدثنا أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى غير أم هانئ فإنها قالت إن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فاغتسل وصلى ثماني ركعات فلم أر صلاة قط أخف منها، غير أنه يتم الركوع والسجود‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Only Um Hani narrated to me that she had seen the Prophet offering the Duha prayer. She said, \"On the day of the conquest of Mecca, the Prophet entered my house, took a bath and offered eight rak`at (of Duha prayers. I had never seen the Prophet offering such a light prayer but he performed bowing and prostrations perfectly .",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1312",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد قاعدين بالقادسية، فمروا عليهما بجنازة فقاما‏.‏ فقيل لهما إنها من أهل الأرض، أى من أهل الذمة فقالا إن النبي صلى الله عليه وسلم مرت به جنازة فقام فقيل له إنها جنازة يهودي‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏‏.‏   وقال أبو حمزة عن الأعمش، عن عمرو، عن ابن أبي ليلى، قال كنت مع قيس وسهل  رضى الله عنهما  فقالا كنا مع النبي صلى الله عليه وسلم‏.‏ وقال زكرياء عن الشعبي عن ابن أبي ليلى كان أبو مسعود وقيس يقومان للجنازة‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Sahl bin Hunaif and Qais bin Sa`d were sitting in the city of Al-Qadisiya. A funeral procession passed in front of them and they stood up. They were told that funeral procession was of one of the inhabitants of the land i.e. of a non-believer, under the protection of Muslims. They said, \"A funeral procession passed in front of the Prophet and he stood up. When he was told that it was the coffin of a Jew, he said, \"Is it not a living being (soul)?\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196",
        "403"
      ]
    },
    {
      "hadith_no": "1394",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال أبو لهب  عليه لعنة الله  للنبي صلى الله عليه وسلم تبا لك سائر اليوم‏.‏ فنزلت ‏{‏تبت يدا أبي لهب وتب‏}‏ ‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     Abu Lahab, may Allah curse him, once said to the Prophet (p.b.u.h), \"Perish you all the day.\" Then the Divine Inspiration came: \"Perish the hands of Abi Lahab! And perish he!\" (111.1).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حجاج بن محمد الأعور، عن شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال اختلف علي وعثمان  رضى الله عنهما  وهما بعسفان في المتعة، فقال علي ما تريد إلا أن تنهى عن أمر فعله النبي صلى الله عليه وسلم‏.‏ فلما رأى ذلك علي أهل بهما جميعا‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     `Ali and `Uthman differed regarding Hajj-at-Tamattu` while they were at 'Usfan (a familiar place near Mecca). `Ali said, \"I see you want to forbid people to do a thing that the Prophet did?\" When `Ali saw that, he assumed Ihram for both Hajj and `Umra.",
      "chain": [
        "30367",
        "20381",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "3411",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا وكيع، عن شعبة، عن عمرو بن مرة، عن مرة الهمداني، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كمل من الرجال كثير، ولم يكمل من النساء إلا آسية امرأة فرعون، ومريم بنت عمران، وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"Many amongst men reached (the level of) perfection but none amongst the women reached this level except Asia, Pharaoh's wife, and Mary, the daughter of `Imran. And no doubt, the superiority of `Aisha to other women is like the superiority of Tharid (i.e. a meat and bread dish) to other meals.\"",
      "chain": [
        "30397",
        "20032",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "3433",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن عمرو بن مرة، قال سمعت مرة الهمداني، يحدث عن أبي موسى الأشعري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام، كمل من الرجال كثير، ولم يكمل من النساء إلا مريم بنت عمران وآسية امرأة فرعون ‏\"‏‏.‏",
      "text_en": "  Narrated Abu Musa Al-Ash`ari:                      The Prophet said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid (i.e. meat and bread dish) to other meals. Many men reached the level of perfection, but no woman reached such a level except Mary, the daughter of `Imran and Asia, the wife of Pharaoh.\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "3488",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، سمعت سعيد بن المسيب، قال قدم معاوية بن أبي سفيان المدينة آخر قدمة قدمها، فخطبنا فأخرج كبة من شعر فقال ما كنت أرى أن أحدا يفعل هذا غير اليهود، وإن النبي صلى الله عليه وسلم سماه الزور  يعني الوصال في الشعر‏.‏ تابعه غندر عن شعبة‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     When Muawiya bin Abu Sufyan came to Medina for the last time, he delivered a sermon before us. He took out a tuft of hair and said, \"I never thought that someone other than the Jews would do such a thing (i.e. use false hair). The Prophet named such a practice, 'Az-Zur' (i.e. falsehood),\" meaning the use of false hair.",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ جعل النبي صلى الله عليه وسلم ينادي ‏\"‏ يا بني فهر، يا بني عدي لبطون قريش ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed, the Prophet started calling (the 'Arab tribes), \"O Bani Fihr, O Bani `Adi\" mentioning first the various branch tribes of Quraish.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3804",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن إبراهيم، عن مسروق، قال ذكر عبد الله عند عبد الله بن عمرو، فقال ذاك رجل لا أزال أحبه بعد ما سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ استقرئوا القرآن من أربعة من عبد الله بن مسعود، فبدأ به، وسالم مولى أبي حذيفة، وأبى بن كعب، ومعاذ بن جبل ‏\"‏‏.‏ قال لا أدري بدأ بأبى أو بمعاذ‏.‏",
      "text_en": " Narrated Masruq:                     `Abdullah (bin Mas`ud) was mentioned before `Abdullah bin `Amr. The latter said, \"That is a man I continue to love because I heard Allah's Apostle saying, ' Learn the recitation of the Qur'an from (any of these) four persons: `Abdullah bin Masud, Salim the freed slave of Abu Hudhaifa, Ubai bin Ka`b, and Mu`adh bin Jabal.\" I do not remember whether he mentioned Ubai first or Mu`adh.",
      "chain": [
        "20193",
        "20020",
        "11381",
        "11051",
        "11018"
      ]
    },
    {
      "hadith_no": "3815",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا آدم، حدثنا شعبة، قال وحدثنا عمرو، أخبرنا شعبة، عن عمرو بن مرة، عن مرة، عن أبي موسى الأشعري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كمل من الرجال كثير، ولم يكمل من النساء إلا مريم بنت عمران، وآسية امرأة فرعون، وفضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle said, \"Many amongst men attained perfection but amongst women none attained the perfection except Mary, the daughter of `Imran and Asiya, the wife of Pharaoh. And the superiority of `Aisha to other women is like the superiority of Tharid (i.e. an Arabic dish) to other meals.\"",
      "chain": [
        "20404",
        "20020",
        "20377",
        "20020",
        "11381",
        "41"
      ]
    },
    {
      "hadith_no": "3834",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت أبا حمزة  رجلا من الأنصار  قالت الأنصار إن لكل قوم أتباعا، وإنا قد اتبعناك، فادع الله أن يجعل أتباعنا منا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ اللهم اجعل أتباعهم منهم ‏\"‏‏.‏ قال عمرو فذكرته لابن أبي ليلى‏.‏ قال قد زعم ذاك زيد‏.‏ قال شعبة أظنه زيد بن أرقم‏.‏",
      "text_en": " Narrated Abu Hamza:                     (A man from the Ansar) The Ansar said, \"Every nation has followers and (O Prophet) we have followed you, so invoke Allah to let our followers be considered from us (as Ansar like ourselves).\" So the Prophet said, \"O Allah! Let their followers be considered as Ansar like themselves.\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "19"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عمرو بن مرة، عن إبراهيم، عن مسروق، قال ذكر عبد الله بن مسعود عند عبد الله بن عمرو فقال ذاك رجل لا أزال أحبه، سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خذوا القرآن من أربعة من عبد الله بن مسعود  فبدأ به  وسالم مولى أبي حذيفة، ومعاذ بن جبل، وأبى بن كعب ‏\"‏‏.‏",
      "text_en": " Narrated Masruq:                     `Abdullah bin Masud was mentioned before `Abdullah bin `Amr who said, \"That is a man I still love, as I heard the Prophet saying 'Learn the recitation of Qur'an from four from `Abdullah bin Mas`ud -- he started with him--Salim, the freed slave of Abu Hudaifa, Mu`adh bin Jabal and Ubai bin Ka`b.\"",
      "chain": [
        "20296",
        "20020",
        "11381",
        "11051",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عبيد الله بن معاذ حدثنا أبي، حدثنا شعبة، عن عمرو بن مرة، حدثني عبد الله بن أبي أوفى  رضى الله عنهما  كان أصحاب الشجرة ألفا وثلاثمائة، وكانت أسلم ثمن المهاجرين‏.‏ تابعه محمد بن بشار حدثنا أبو داود حدثنا شعبة‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4217",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن أبي أوفى  وكان من أصحاب الشجرة  قال كان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقة قال ‏\"‏ اللهم صل عليهم ‏\"‏‏.‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     (Who was one of those who had given the Pledge of allegiance to the Prophet beneath the Tree) When the people brought Sadaqa (i.e. rak`at) to the Prophet he used to say, \"O Allah! Bless them with your Mercy.\" Once my father came with his Sadaqa to him whereupon he (i.e. the Prophet) said. \"O Allah! Bless the family of Abu `Aufa.\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4625",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة، أخبرنا يحيى، عن سفيان، عن سليمان، عن إبراهيم، عن عبيدة، عن عبد الله، قال يحيى بعض الحديث عن عمرو بن مرة، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏‏.‏ قلت آقرأ عليك وعليك أنزل قال ‏\"‏ فإني أحب أن أسمعه من غيري ‏\"‏‏.‏ فقرأت عليه سورة النساء حتى بلغت ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ قال ‏\"‏ أمسك ‏\"‏‏.‏ فإذا عيناه تذرفان‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     Allah's Apostle said to me, \"Recite (of the Qur'an) for me,\" I said, \"Shall I recite it to you although it had been revealed to you?\" He said, \"I like to hear (the Qur'an) from others.\" So I recited Surat-an- Nisa' till I reached: \"How (will it be) then when We bring from each nation a witness, and We bring you (O Muhammad) as a witness against these people?\" (4.41) Then he said, \"Stop!\" And behold, his eyes were overflowing with tears.\"",
      "chain": [
        "30343",
        "20031",
        "20012",
        "11060",
        "11051",
        "11370",
        "16",
        "11381"
      ]
    },
    {
      "hadith_no": "4682",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن أبي وائل، عن عبد الله  رضى الله عنه  قال قلت أنت سمعت هذا من عبد الله قال نعم، ورفعه‏.‏ قال ‏\"‏ لا أحد أغير من الله، فلذلك حرم الفواحش ما ظهر منها وما بطن، ولا أحد أحب إليه المدحة من الله، فلذلك مدح نفسه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Allah's Apostle said, \"None has more sense of ghaira than Allah, and for this He has forbidden shameful sins whether committed openly or secretly, and none loves to be praised more than Allah does, and this is why He Praises Himself.\"",
      "chain": [
        "20193",
        "20020",
        "11381",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4817",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ صعد النبي صلى الله عليه وسلم على الصفا فجعل ينادي ‏\"‏ يا بني فهر، يا بني عدي ‏\"‏‏.‏ لبطون قريش حتى اجتمعوا، فجعل الرجل إذا لم يستطع أن يخرج أرسل رسولا لينظر ما هو، فجاء أبو لهب وقريش فقال ‏\"‏ أرأيتكم لو أخبرتكم أن خيلا بالوادي تريد أن تغير عليكم، أكنتم مصدقي ‏\"‏‏.‏ قالوا نعم، ما جربنا عليك إلا صدقا‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏‏.‏ فقال أبو لهب تبا لك سائر اليوم، ألهذا جمعتنا فنزلت ‏{‏تبت يدا أبي لهب وتب * ما أغنى عنه ماله وما كسب‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:--'And warn your tribe of near-kindred, was revealed, the Prophet ascended the Safa (mountain) and started calling, \"O Bani Fihr! O Bani `Adi!\" addressing various tribes of Quraish till they were assembled. Those who could not come themselves, sent their messengers to see what was there. Abu Lahab and other people from Quraish came and the Prophet then said, \"Suppose I told you that there is an (enemy) cavalry in the valley intending to attack you, would you believe me?\" They said, \"Yes, for we have not found you telling anything other than the truth.\" He then said, \"I am a warner to you in face of a terrific punishment.\" Abu Lahab said (to the Prophet) \"May your hands perish all this day. Is it for this purpose you have gathered us?\" Then it was revealed: \"Perish the hands of Abu Lahab (one of the Prophet's uncles), and perish he! His wealth and his children will not profit him....\" (111.1-5)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4849",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن خازم، حدثنا الأعمش، عن عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال صعد النبي صلى الله عليه وسلم الصفا ذات يوم فقال ‏\"‏ يا صباحاه ‏\"‏ فاجتمعت إليه قريش قالوا ما لك قال ‏\"‏ أرأيتم لو أخبرتكم أن العدو يصبحكم أو يمسيكم أما كنتم تصدقوني ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏‏.‏ فقال أبو لهب تبا لك ألهذا جمعتنا فأنزل الله ‏{‏تبت يدا أبي لهب‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One day the Prophet ascended Safa mountain and said, \"Oh Sabah! \" All the Quraish gathered round him and said, \"What is the matter?\" He said, Look, if I told you that an enemy is going to attack you in the morning or in the evening, would you not believe me?\" They said, \"Yes, we will believe you.\" He said, \"I am a warner to you in face of a terrible punishment.\" On that Abu Lahab said, \"May you perish ! Is it for this thing that you have gathered us?\" So Allah revealed: 'Perish the hands of Abu Lahab!...' (111.1)",
      "chain": [
        "30026",
        "20354",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5023",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ ورهطك منهم المخلصين، خرج رسول الله صلى الله عليه وسلم حتى صعد الصفا فهتف ‏\"‏ يا صباحاه ‏\"‏‏.‏ فقالوا من هذا، فاجتمعوا إليه‏.‏ فقال ‏\"‏ أرأيتم إن أخبرتكم أن خيلا تخرج من سفح هذا الجبل أكنتم مصدقي ‏\"‏‏.‏ قالوا ما جربنا عليك كذبا‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏‏.‏ قال أبو لهب تبا لك ما جمعتنا إلا لهذا ثم قام فنزلت ‏{‏تبت يدا أبي لهب وتب‏}‏ وقد تب هكذا قرأها الأعمش يومئذ‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed. Allah's Apostle went out, and when he had ascended As-Safa mountain, he shouted, \"O Sabahah!\" The people said, \"Who is that?\" \"Then they gathered around him, whereupon he said, \"Do you see? If I inform you that cavalrymen are proceeding up the side of this mountain, will you believe me?\" They said, \"We have never heard you telling a lie.\" Then he said, \"I am a plain warner to you of a coming severe punishment.\" Abu Lahab said, \"May you perish! You gathered us only for this reason? \" Then Abu Lahab went away. So the \"Surat:--ul--LAHAB\" 'Perish the hands of Abu Lahab!' (111.1) was revealed.",
      "chain": [
        "30224",
        "20318",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5024",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج إلى البطحاء فصعد إلى الجبل فنادى ‏\"‏ يا صباحاه ‏\"‏‏.‏ فاجتمعت إليه قريش فقال ‏\"‏ أرأيتم إن حدثتكم أن العدو مصبحكم أو ممسيكم، أكنتم تصدقوني ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏‏.‏ فقال أبو لهب ألهذا جمعتنا تبا لك‏.‏ فأنزل الله عز وجل ‏{‏تبت يدا أبي لهب‏}‏ إلى آخرها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet went out towards Al-Batha' and ascended the mountain and shouted, \"O Sabahah!\" So the Quraish people gathered around him. He said, \"Do you see? If I tell you that an enemy is going to attack you in the morning or in the evening, will you believe me?\" They replied, \"Yes.\" He said, \"Then I am a plain warner to you of a coming severe punishment.\" Abu Lahab said, \"Is it for this reason that you have gathered us? May you perish ! \" Then Allah revealed: 'Perish the hands of Abu Lahab!'",
      "chain": [
        "30376",
        "20354",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5025",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال أبو لهب تبا لك ألهذا جمعتنا فنزلت ‏{‏تبت يدا أبي لهب‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Lahab said, \"May you perish! Is it' for this that you have gathered us?\" So there was revealed:-- 'Parish the hands of Abu Lahab'.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5110",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا صدقة، أخبرنا يحيى، عن سفيان، عن سليمان، عن إبراهيم، عن عبيدة، عن عبد الله، قال يحيى بعض الحديث عن عمرو بن مرة، قال لي النبي صلى الله عليه وسلم‏.‏  حدثنا مسدد عن يحيى عن سفيان عن الأعمش عن إبراهيم عن عبيدة عن عبد الله قال الأعمش وبعض الحديث حدثني عمرو بن مرة عن إبراهيم وعن أبيه عن أبي الضحى عن عبد الله قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏‏.‏ قال قلت أقرأ عليك وعليك أنزل قال ‏\"‏ إني أشتهي أن أسمعه من غيري ‏\"‏‏.‏ قال فقرأت النساء حتى إذا بلغت ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏‏.‏ قال لي ‏\"‏ كف  أو أمسك  ‏\"‏‏.‏ فرأيت عينيه تذرفان‏.‏",
      "text_en": " Narrated `Abdullah (bin Mas`ud):                     Allah's Apostle said (to me), \"Recite the Qur'an to me.\" I said, \"Shall I recite (it) to you while it has been revealed to you?\" He said, \"I like to hear it from another person.\" So I recited Surat An-Nisa (The Women) till I reached the Verse: 'How (will it be) then when We bring from each nation a witness, and We bring you (O Muhammad) as a witness against these people.' (4.41) Then he said to me, \"Stop!\" Thereupon I saw his eyes overflowing with tears.",
      "chain": [
        "30343",
        "20031",
        "20012",
        "11060",
        "11051",
        "11370",
        "16",
        "11381"
      ]
    },
    {
      "hadith_no": "5473",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عمرو بن مرة الجملي، عن مرة الهمداني، عن أبي موسى الأشعري، عن النبي صلى الله عليه وسلم قال كمل من الرجال كثير، ولم يكمل من النساء إلا مريم بنت عمران وآسية امرأة فرعون، وفضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet said, \"Many men reached perfection but none among the women reached perfection except Mary, the daughter of ' `Imran, and Asia, Pharoah's wife. And the superiority of `Aisha to other women is like the superiority of Tharid to other kinds of food.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "5997",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن عمرو بن مرة، قال سمعت الحسن بن مسلم بن يناق، يحدث عن صفية بنت شيبة، عن عائشة  رضى الله عنها  أن جارية، من الأنصار تزوجت، وأنها مرضت فتمعط شعرها، فأرادوا أن يصلوها فسألوا النبي صلى الله عليه وسلم فقال ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏‏.‏ تابعه ابن إسحاق عن أبان بن صالح عن الحسن عن صفية عن عائشة‏.‏",
      "text_en": " Narrated `Aisha:                     An Ansari girl was married and she became sick and all her hair fell out intending to provide her with false hair. They asked the Prophet who said, \"Allah has cursed the lady who artificially lengthens (her or someone else's) hair and also the one who gets her hair lengthened.\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "6001",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، سمعت سعيد بن المسيب، قال قدم معاوية المدينة آخر قدمة قدمها، فخطبنا فأخرج كبة من شعر قال ما كنت أرى أحدا يفعل هذا غير اليهود، إن النبي صلى الله عليه وسلم سماه الزور‏.‏ يعني الواصلة في الشعر‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     Mu'awiya came to Medina for the last time and delivered a sermon. He took out a tuft of hair and said, \"I thought that none used to do this (i.e. use false hair) except Jews. The Prophet labelled such practice, (i.e. the use of false hair), as cheating.",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "6241",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبدان، أخبرنا أبي، عن شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أنس بن مالك، أن رجلا، سأل النبي صلى الله عليه وسلم متى الساعة يا رسول الله قال ‏\"‏ ما أعددت لها ‏\"‏‏.‏ قال ما أعددت لها من كثير صلاة ولا صوم ولا صدقة، ولكني أحب الله ورسوله‏.‏ قال ‏\"‏ أنت مع من أحببت ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man asked the Prophet \"When will the Hour be established O Allah's Apostle?\" The Prophet . said, \"What have you prepared for it?\" The man said, \" I haven't prepared for it much of prayers or fast or alms, but I love Allah and His Apostle.\" The Prophet said, \"You will be with those whom you love.\"",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11381",
        "11342",
        "19"
      ]
    },
    {
      "hadith_no": "6433",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي أوفى، قال كان إذا أتى رجل النبي صلى الله عليه وسلم بصدقته قال ‏\"‏ اللهم صل عليه‏\"‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى‏\"‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     Whenever somebody brought alms to the Prophet the used to say, \"Allahumma Salli 'Alaihi (O Allah! Send Your Salat (Grace and Honor) on him).\" Once when my father brought his alms to him, he said, \"O Allah! Send Your Salat (Grace and Honor) on the family of Abi `Aufa.\"",
      "chain": [
        "20193",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "7363",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، أخبرنا عمرو بن مرة، سمعت مرة الهمداني، يقول قال عبد الله إن أحسن الحديث كتاب الله، وأحسن الهدى هدى محمد صلى الله عليه وسلم، وشر الأمور محدثاتها، وإن ما توعدون لآت، وما أنتم بمعجزين‏.‏",
      "text_en": " Narrated `Abdullah:                     The best talk (speech) is Allah's Book 'Qur'an), and the best way is the way of Muhammad, and the worst matters are the heresies (those new things which are introduced into the religion); and whatever you have been promised will surely come to pass, and you cannot escape (it).",
      "chain": [
        "20404",
        "20020",
        "11381",
        "9759",
        "16"
      ]
    },
    {
      "hadith_no": "463",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله صلى الله عليه وسلم بخمس كلمات فقال ‏\"‏ إن الله عز وجل لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل الليل قبل عمل النهار وعمل النهار قبل عمل الليل حجابه النور - وفي رواية أبي بكر النار - لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه ‏\"‏ ‏.‏ - وفي رواية أبي بكر عن الأعمش ولم يقل حدثنا ‏.‏",
      "text_en": " Abu Musa reported:                      The Messenger ofallah (may peace be upon him) was standing amongst us and he told us five things. He said: Verily the Exalted and Mighty God does not sleep, and it does not befit Him to sleep. He lowers the scale and lifts it. The deeds in the night are taken up to Him before the deeds of the day. and the deeds of the day before the deeds of the night. His veil is the light. In the hadith narrated by Abu Bakr (instead of the word\" light\" ) it is fire. If he withdraws it (the veil), the splendour of His countenance would consume His creation so far as His sight reaches.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "hadith_no": "465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، قال حدثني شعبة، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله صلى الله عليه وسلم بأربع ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يرفع القسط ويخفضه ويرفع إليه عمل النهار بالليل وعمل الليل بالنهار ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported:                      The Messenger of Allah (znay peace be upon him) was standing amongst us and (he said) four (things): Verily Allah dock not sleep and it does not befit Him to sleep. He raises the scale and lowers it. The deeds of the day are presented to Him in the night and the deeds of the night in the day.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "hadith_no": "529",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن الأعمش، عن عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ وأنذر عشيرتك الأقربين‏}‏ ورهطك منهم المخلصين ‏.‏ خرج رسول الله صلى الله عليه وسلم حتى صعد الصفا فهتف ‏\"‏ يا صباحاه ‏\"‏ ‏.‏ فقالوا من هذا الذي يهتف قالوا محمد ‏.‏ فاجتمعوا إليه فقال ‏\"‏ يا بني فلان يا بني فلان يا بني فلان يا بني عبد مناف يا بني عبد المطلب ‏\"‏ فاجتمعوا إليه فقال ‏\"‏ أرأيتكم لو أخبرتكم أن خيلا تخرج بسفح هذا الجبل أكنتم مصدقي ‏\"‏ ‏.‏ قالوا ما جربنا عليك كذبا ‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏ ‏.‏ قال فقال أبو لهب تبا لك أما جمعتنا إلا لهذا ثم قام فنزلت هذه السورة تبت يدا أبي لهب وقد تب ‏.‏ كذا قرأ الأعمش إلى آخر السورة ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that when this verse was revealed:                     \" And warn thy nearest kindred\" (and thy group of selected people among them) the Messenger of Allah (may peace be upon him) set off till he climbed Safa' and called loudly: Be on your guard! They said: Who is it calling aloud? They said: Muhammad. They gathered round him, and he said: O sons of so and so, O sons of so and so, O sons of 'Abd Manaf, O sons of 'Abd al-Muttalib, and they gathered around him. He (the Apostle) said: If I were to inform you that there were horsemen emerging out of the foot of this mountain, would you believe me? They said: We have not experienced any lie from you. He said: Well, I am a warner to you before a severe torment. He (the narrator) said that Abu Lahab then said: Destruction to you! Is it for this you have gathered us? He (the Holy Prophet) then stood up, and this verse was revealed:\" Perish the hands of Abu Lahab, and he indeed perished\" (cxi. 1). A'mash recited this to the end of the Sura.",
      "chain": [
        "30216",
        "20318",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت سالم بن أبي الجعد الغطفاني، قال سمعت النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لتسون صفوفكم أو ليخالفن الله بين وجوهكم ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported:                      I heard the Messenger of Allah (may peace be upon him) say: Straighten your rows, or Allah would create dissension amongst you.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "274"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت سعيد بن المسيب، قال حدث عثمان بن أبي العاص، قال آخر ما عهد إلى رسول الله صلى الله عليه وسلم ‏\"‏ إذا أممت قوما فأخف بهم الصلاة ‏\"‏ ‏.‏",
      "text_en": " Uthman b. Abu'l-'As reported:                      The last thing which the Messenger of Allah (may peace be upon him) instructed me was: When you lead the people in prayer, be brief.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11002",
        "3210"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال أبو بكر، حدثنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن عبد الله بن الحارث النجراني، قال حدثني جندب، قال سمعت النبي صلى الله عليه وسلم قبل أن يموت بخمس وهو يقول ‏\"‏ إني أبرأ إلى الله أن يكون لي منكم خليل فإن الله تعالى قد اتخذني خليلا كما اتخذ إبراهيم خليلا ولو كنت متخذا من أمتي خليلا لاتخذت أبا بكر خليلا ألا وإن من كان قبلكم كانوا يتخذون قبور أنبيائهم وصالحيهم مساجد ألا فلا تتخذوا القبور مساجد إني أنهاكم عن ذلك ‏\"‏ ‏.‏",
      "text_en": " Jundub reported:                      I heard from the Apostle of Allah (may peace be upon him) five days before his death and he said: I stand acquitted before Allah that I took any one of you as friend, for Allah has taken me as His friend, as he took Ibrahim as His friend. Had I taken any one of my Ummah as a friend, I would have taken Abu Bakr as a friend. Beware of those who preceded you and used to take the graves of their prophets and righteous men as places of worship, but you must not take graves as mosques; I forbid you to do that.",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "30464",
        "30024",
        "11340",
        "11381",
        "10780",
        "4053"
      ]
    },
    {
      "hadith_no": "1587",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت ابن أبي ليلى، قال حدثنا البراء بن عازب، أن رسول الله صلى الله عليه وسلم كان يقنت في الصبح والمغرب ‏.‏",
      "text_en": " Al-Bari' b. 'Azib reported that the Messenger of Allah (may peace be upon him) observed Qunut in the morning and evening (prayers).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1588",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سفيان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن البراء، قال قنت رسول الله صلى الله عليه وسلم في الفجر والمغرب ‏.‏",
      "text_en": " Al-Bari' reported that the Messenger of Allah (may peace be upon him) observed Qunut in the dawn and evening (prayers).",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1700",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال ما أخبرني أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى إلا أم هانئ فإنها حدثت أن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فصلى ثماني ركعات ما رأيته صلى صلاة قط أخف منها غير أنه كان يتم الركوع والسجود ‏.‏ ولم يذكر ابن بشار في حديثه قوله قط ‏.‏",
      "text_en": " Abd al-Rahman b. Abu Laila reported:                      No one has ever narrated to me that he saw the Apostle of Allah (may peace be upon him) observing the forenoon prayer, except Umm Hani. She, however, narrated that the Apostle of Allah (may peace be upon him) entered her house on the day of the Conquest of Mecca and prayed eight rak'ahs (adding): I never saw a shorter prayer than it except that he performed the bowing and prostration completely. But (one of the narrators) Ibn Bashshar in his narration made no mention of the word:\" Never\".",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1905",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، حدثني مسعر، - وقال أبو كريب عن مسعر، - عن عمرو بن مرة، عن إبراهيم، قال قال النبي صلى الله عليه وسلم لعبد الله بن مسعود ‏\"‏ اقرأ على ‏\"‏ ‏.‏ قال أقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏ قال فقرأ عليه من أول سورة النساء إلى قوله ‏{‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ فبكى ‏.‏ قال مسعر فحدثني معن عن جعفر بن عمرو بن حريث عن أبيه عن ابن مسعود قال قال النبي صلى الله عليه وسلم ‏\"‏ شهيدا عليهم ما دمت فيهم أو ما كنت فيهم ‏\"‏ ‏.‏ شك مسعر ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      I was in Hims when some of the people asked me to recite the Qur'an to them. So I recited Surah Yusuf to them. One of the persons among the people said: By Allah, this is not how it has been sent down. I said: Woe upon you! By Allah, I recited it to the Messenger of Allah (may peace be upon him) and he said to me: You have (recited) it well. I was talking with him (the man who objected to my recitation) that I sensed the smell of wine from him. So I said to him. Do you drink wine and belie the Book (of Allah)? You would not depart till I would whip you. So I lashed him according to the prescribed punishment (for the offence of drinking wine).",
      "chain": [
        "30201",
        "30216",
        "20318",
        "20359",
        "30216",
        "20359",
        "11381",
        "11051"
      ]
    },
    {
      "hadith_no": "1950",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، أنه سمع أبا وائل، يحدث أن رجلا، جاء إلى ابن مسعود فقال إني قرأت المفصل الليلة كله في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر فقال عبد الله لقد عرفت النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن - قال - فذكر عشرين سورة من المفصل سورتين سورتين في كل ركعة ‏.‏",
      "text_en": " Abu Ishaq reported:                      I saw a man asking Aswad b. Yazid who taught the Qur'an in the mosque: How do you recite the verse (fahal min muddakir) whether (the word muddakir) Is with (d) or (dh)? He (Aswad) said: It was with (d). I heard Abdullah b. Mas'ud saying that he had heard the Messenger of Allah (may peace be upon him) reciting (muddakir) with (d).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11353"
      ]
    },
    {
      "hadith_no": "2038",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن عمرو بن مرة، عن أبي عبيدة، عن كعب بن عجرة، قال دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا الخبيث يخطب قاعدا وقال الله تعالى ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Ka'b b. 'Ujra reported that he entered the mosque and saw Abd al-Rahman b. Umm Hakam delivering the sermon in a sitting posture. Upon this he said:                      Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing.\"",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11381",
        "10",
        "4052"
      ]
    },
    {
      "hadith_no": "2260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد، بن جعفر حدثنا شعبة، - وقال أبو بكر عن شعبة، - عن عمرو بن مرة، عن عبد الرحمن، بن أبي ليلى قال كان زيد يكبر على جنائزنا أربعا وإنه كبر على جنازة خمسا فسألته فقال كان رسول الله صلى الله عليه وسلم يكبرها ‏.‏",
      "text_en": " It is narrated on the authority of 'Abd al-Rahman b. Abu Laila that Zaid used to recite four takbirs on our funerals and he recited five takbirs on one funeral. I asked him the reason (for this variation), to which he replied:                      The Messenger of Allah (may peace be upon him) recited thus.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "20436",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "2269",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، أن قيس بن سعد، وسهل بن حنيف، كانا بالقادسية فمرت بهما جنازة فقاما فقيل لهما إنها من أهل الأرض ‏.‏ فقالا إن رسول الله صلى الله عليه وسلم مرت به جنازة فقام فقيل إنه يهودي ‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏ ‏.‏ وحدثنيه القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن عمرو بن مرة، بهذا الإسناد وفيه فقالا كنا مع رسول الله صلى الله عليه وسلم فمرت علينا جنازة ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abu Laila that while Qais b. Sa'd and Sahl b. Hunaif were both in Qadislyya a bier passed by them and they both stood up. They were told that it was the bier of one of the people of the land (non-Muslim). They said that a bier passed before the Holy Prophet (may peace be upon him) and he stood up. He was told that he (the dead man) was a Jew. Upon this he remarked:                      Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196",
        "172",
        "403"
      ]
    },
    {
      "hadith_no": "2396",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن خيثمة، عن عدي بن حاتم، قال ذكر رسول الله صلى الله عليه وسلم النار فأعرض وأشاح ثم قال ‏\"‏ اتقوا النار ‏\"‏ ‏.‏ ثم أعرض وأشاح حتى ظننا أنه كأنما ينظر إليها ثم قال ‏\"‏ اتقوا النار ولو بشق تمرة فمن لم يجد فبكلمة طيبة ‏\"‏ ‏.‏ ولم يذكر أبو كريب كأنما وقال حدثنا أبو معاوية حدثنا الأعمش ‏.‏",
      "text_en": " 'Adi b. Hatim reported that the Messenger of Allah (may peace be upon him) made a mention of Fire. He turned his face aside and diverted his attention and then said:                      Guard (yourselves) against Fire. He turned his face and diverted his attention till we thought as if he were (actually seeing it and then said: Protect yourselves against Fire even if it is with half a date, and he who does not find it, (he should do so) with pleasant words. Abu Kuraib did not mention the word: (as if).",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11381",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "2397",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن خيثمة، عن عدي بن حاتم، عن رسول الله صلى الله عليه وسلم أنه ذكر النار فتعوذ منها وأشاح بوجهه ثلاث مرار ثم قال ‏\"‏ اتقوا النار ولو بشق تمرة فإن لم تجدوا فبكلمة طيبة ‏\"‏ ‏.‏",
      "text_en": " Adi b. Hatim reported that the Messenger of Allah (may peace be upon him) made a mention of the Fire and sought refuge (with Allah against it). He turned aside his face three times and then said:                      Protect yourselves against Fire even if with half a date. But if you fail to find it (then protect yourselves against Fire) with the help of a pleasant word).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "2543",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وعمرو الناقد وإسحاق بن إبراهيم قال يحيى أخبرنا وكيع، عن شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن أبي أوفى، ح . وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، عن شعبة، عن عمرو، - وهو ابن مرة - حدثنا عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل عليهم ‏\"‏ ‏.‏ فأتاه أبي أبو أوفى بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Abu Aufa said that it was the common practice of the Mes- senger of Allah (may peace be upon him) that when the people brought to him sadaqa he blessed them:                      0 Allah, bless them. So when Abu Aufa brought to him Sadaqa he (the Holy Prophet) said: 0 Allah, bless, the posterity of Abu Aufa.",
      "chain": [
        "30399",
        "20031",
        "20032",
        "20020",
        "11381",
        "5115",
        "11201",
        "11905",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حصين، عن عمرو بن، مرة عن أبي البختري، قال خرجنا للعمرة فلما نزلنا ببطن نخلة - قال - تراءينا الهلال فقال بعض القوم هو ابن ثلاث ‏.‏ وقال بعض القوم هو ابن ليلتين قال فلقينا ابن عباس فقلنا إنا رأينا الهلال فقال بعض القوم هو ابن ثلاث وقال بعض القوم هو ابن ليلتين ‏.‏ فقال أى ليلة رأيتموه قال فقلنا ليلة كذا وكذا ‏.‏ فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله مده للرؤية فهو لليلة رأيتموه ‏\"‏ ‏.‏",
      "text_en": " Abu'l-Bakhtari reported:                      We went out to perform Umra and when we encamped in the valley of Nakhla, we tried to see the new moon. Some of the people said: It was three nights old, and others (said) that it was two nights old. We then met Ibn 'Abbas and told him we had seen the new moon, but that some of the people said it was three nights old and others that it was two nights old. He asked on which night we had seen it; and when we told him we had seen it on such and such night, he said the Prophet of Allah (may peace be upon him) had said: Verily Allah deferred it till the time it is seen, so it is to be reckoned from the night you saw it.",
      "chain": [
        "30201",
        "20356",
        "15097",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "2582",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، أخبرنا شعبة، عن عمرو بن مرة، قال سمعت أبا البختري، قال أهللنا رمضان ونحن بذات عرق فأرسلنا رجلا إلى ابن عباس - رضى الله عنهما - يسأله فقال ابن عباس - رضى الله عنهما - قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله قد أمده لرؤيته فإن أغمي عليكم فأكملوا العدة ‏\"‏ ‏.‏",
      "text_en": " Abu'l-Bakhtari reported:                      We saw the new moon of Ramadan as we were at Dhit-i-'Irq. We sent a man to Ibn Abbas (Allah be pleased with both of them) to ask him (whether the sighting of a small moon had something of the nature of defect in it). Upon this Ibn 'Abbas (Allah be pleased with both of them) said that the Messenger of Allah (may peace be upon him) had said: Verily Allah deferred its sight, but if (the new moon) is hidden from you, then, complete its number (thirty).",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30160",
        "20173",
        "20020",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "3023",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال اجتمع علي وعثمان - رضى الله عنهما - بعسفان فكان عثمان ينهى عن المتعة أو العمرة فقال علي ما تريد إلى أمر فعله رسول الله صلى الله عليه وسلم تنهى عنه فقال عثمان دعنا منك ‏.‏ فقال إني لا أستطيع أن أدعك فلما أن رأى علي ذلك أهل بهما جميعا ‏.‏",
      "text_en": " Sa'id b. al-Musayyab reported that 'Ali and 'Uthman (Allah be pleased with them) met at 'Usfan; and Uthman used to forbid (people) from performing Tamattu' and 'Umra (during the period of Hajj), whereupon 'Ali said:                      What is your opinion about a matter which the Messenger of Allah (may peace be upon him) did but you forbid it? Thereupon Uthman said: You leave us alone, whereupon he ('Ali) said: I cannot leave you alone. When 'Ali saw this, he put on Ihram for both of them together (both for Hajj and 'Umra).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "3953",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن أبي البختري، قال سألت ابن عباس عن بيع النخل، فقال نهى رسول الله صلى الله عليه وسلم عن بيع النخل حتى يأكل منه أو يؤكل وحتى يوزن ‏.‏ قال فقلت ما يوزن فقال رجل عنده حتى يحزر ‏.‏",
      "text_en": " Abu Bakhtari reported:                      I asked Ibn 'Abbas (Allah be pleased with them) about the sale of dates. He said: Allah's Messenger (may peace be upon him) forbade the sale of dates of the trees until one eats them or they are eaten (i. e. they are fit to be eaten) or until they are weighed (or measured). I said: What does it imply:\" Until it is weighed\"? Thereupon a person who was with him (Ibn Abbas) said: Until he is able to keep it with him (after plucking them).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11347",
        "17"
      ]
    },
    {
      "hadith_no": "4919",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، قال سألت جابر بن عبد الله عن أصحاب، الشجرة فقال لو كنا مائة ألف لكفانا كنا ألفا وخمسمائة ‏.‏",
      "text_en": " It has been narrated on the authority of Salim b. Abu al-Ja'd who said:                      I asked Jabir b. 'Abdullah about the number of the Companions (of the Holy Prophet who took the oath of fealty under) the tree. He said: If we were a hundred thousand, it (i. e. the water in the well at Hudaibiya) would have sufficed us, but actually we were one thousand and five hundred.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "4922",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عمرو، - يعني ابن مرة - حدثني عبد الله بن أبي أوفى، قال كان أصحاب الشجرة ألفا وثلاثمائة وكانت أسلم ثمن المهاجرين ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah b. Abu Aufa who said:                      The Companions of the Tree (i e. those who swore fealty under the tree) were one thousand and three hundred, and the people of Aslam tribe were one-eighth of the Muhajirs.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "5028",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، قال حدثنا أبو موسى، الأشعري أن رجلا، أعرابيا أتى النبي صلى الله عليه وسلم فقال يا رسول الله الرجل يقاتل للمغنم والرجل يقاتل ليذكر والرجل يقاتل ليرى مكانه فمن في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من قاتل لتكون كلمة الله أعلى فهو في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Musa Ash'ari that a desert Arab came to the Holy Prophet (may peace be upon him) and said:                      Messenger of Allah, one man fights fgr the spoils of war; another fights that he may be remembered, and another fights that he may see his (high) position (achieved as a result of his valour in fighting). Which of these is fighting in the cause of God? The Messenger of Allah (may peace be upon him) said: Who fights so that the word of Allah is exalted is fighting in the way of Allah.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11381",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "5315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عمرو بن مرة، حدثني  زاذان، قال قلت لابن عمر حدثني بما، نهى عنه النبي صلى الله عليه وسلم من الأشربة بلغتك وفسره لي بلغتنا فإن لكم لغة سوى لغتنا ‏.‏ فقال نهى رسول الله صلى الله عليه وسلم عن الحنتم وهي الجرة وعن الدباء وهي القرعة وعن المزفت وهو المقير وعن النقير وهى النخلة تنسح نسحا وتنقر نقرا وأمر أن ينتبذ في الأسقية ‏.‏",
      "text_en": " Zadhan reported:                      I said to Ibn 'Umar: Tell me in your own language and then explain it to me in any language because your language is different from our language (about the vessels) in which Allah's Apostle (may peace be upon him) has forbidden (us) to drink. He said: Allah's Messenger (may peace be upon him) has forbidden (the preparation) of Nabidh in Hantama and that is a pitcher (besmeared with pitch), in gourd and that is pumpkin, in the varnished jar, in hollow stump and in wooden vessels. This Naqir is the wood of date-palm from which the vessel is fashioned out or hollowed out, but he commanded us to prepare Nabidh in waterskins.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "5690",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا أبو داود، حدثنا شعبة، ح وحدثنا  أبو بكر بن أبي شيبة، - واللفظ له - حدثنا يحيى بن أبي بكير، عن شعبة، عن عمرو بن، مرة قال سمعت الحسن بن مسلم، يحدث عن صفية بنت شيبة، عن عائشة، أن جارية، من الأنصار تزوجت وأنها مرضت فتمرط شعرها فأرادوا أن يصلوه فسألوا رسول الله صلى الله عليه وسلم عن ذلك فلعن الواصلة والمستوصلة ‏.‏",
      "text_en": " A'isha reported that a girl of the Ansar who had fallen ill and had lost the hair was married. They (her relatives) thought of adding false hair (to her head). so they asked Allah's Messenger (may peace be upon him) about it, whereupon he cursed the woman who adds false hair and the woman who asks for it.",
      "chain": [
        "30170",
        "30160",
        "30002",
        "20020",
        "20436",
        "20365",
        "20020",
        "11381",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5702",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال قدم معاوية المدينة فخطبنا وأخرج كبة من شعر فقال ما كنت أرى أن أحدا يفعله إلا اليهود إن رسول الله صلى الله عليه وسلم بلغه فسماه الزور ‏.‏",
      "text_en": " Sa'id b. Musayyib reported:                      Mu'awiya came to Medina and he addressed us and he took out a bunch of hair and said: What do I see that one of you does but that what the Jews did? (I can well recall) that when this act (adding of artificial hair) reached Allah's Messenger (may peace be upon him), he named it as cheating.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30160",
        "20173",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "6254",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن عمرو، بن مرة عن أبي عبيدة، عن أبي موسى الأشعري، قال كان رسول الله صلى الله عليه وسلم يسمي لنا نفسه أسماء فقال ‏\"‏ أنا محمد وأحمد والمقفي والحاشر ونبي التوبة ونبي الرحمة ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that Allah's Messenger (may peace be upon him) mentioned many names of his and said:                      I am Muhammad, Ahmad. Muqaffi (the last in succession), Hashir, the Prophet of repentance, and the Prophet of Mercy.",
      "chain": [
        "30021",
        "20028",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "hadith_no": "6425",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، ح وحدثنا محمد، بن المثنى وابن بشار قالا حدثنا محمد بن جعفر، جميعا عن شعبة، ح وحدثنا عبيد الله، بن معاذ العنبري - واللفظ له - حدثنا أبي، حدثنا شعبة، عن عمرو بن مرة، عن مرة، عن  أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كمل من الرجال كثير ولم يكمل من النساء غير مريم بنت عمران وآسية امرأة فرعون وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Messenger (may peace be upon him) as saying:                      There are many persons amongst men who are quite perfect but there are none perfect amongst women except Mary, daughter of 'Imran, Asiya wife of Pharaoh, and the excellence of 'A'isha as compared to women is that of Tharid over all other foods.",
      "chain": [
        "30201",
        "30216",
        "20032",
        "30170",
        "20173",
        "20020",
        "13898",
        "20020",
        "11381",
        "41"
      ]
    },
    {
      "hadith_no": "6492",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  عمرو بن مرة، عن إبراهيم، عن مسروق، قال ذكروا ابن مسعود عند عبد الله بن عمرو فقال ذاك رجل لا أزال أحبه بعد ما سمعت من رسول الله صلى الله عليه وسلم يقول ‏\"‏ استقرئوا القرآن من أربعة من ابن مسعود وسالم مولى أبي حذيفة وأبى بن كعب ومعاذ بن جبل ‏\"‏ ‏.‏",
      "text_en": " Masruq reported:                      They made a mention of Ibn Mas'ud before 'Abdullah b. Amr, whereupon he said: He is a person whose love is always fresh in my heart after I heard Allah's Messenger (may peace be upon him) as saying: Learn the recita- tion of the Qur'an from four persons: from Ibn Mas'ud, Salim, the ally of Abu Hudhaifa, Ubayy b. Ka'b, Mu'adh b. Jabal.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11051",
        "11018"
      ]
    },
    {
      "hadith_no": "6884",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن يحيى بن عبد العزيز اليشكري، حدثنا عبد الله بن عثمان بن، جبلة أخبرني أبي، عن شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أنس، عن  النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "11222",
        "20020",
        "11381",
        "11342",
        "19"
      ]
    },
    {
      "hadith_no": "7034",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن عمرو بن مرة، عن أبي، بردة قال سمعت الأغر، وكان، من أصحاب النبي صلى الله عليه وسلم يحدث ابن عمر قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أيها الناس توبوا إلى الله فإني أتوب في اليوم إليه مائة مرة ‏\"‏ ‏.‏",
      "text_en": " Al-Agharr al-Muzani who was from amongst the Companions of Allah's Apostle (may peace be upon him) reported that Ibn 'Umar stated to him that Allah's Messenger (may peace 'be upon him) said:                      O people, seek repentance from Allah. Verily, I seek repentance from Him a hundred times a day.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11381",
        "11901"
      ]
    },
    {
      "hadith_no": "7059",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، ح وحدثنا ابن بشار، حدثنا  عبد الرحمن، وأبو داود قالا حدثنا شعبة، عن عمرو بن مرة، قال سمعت سعد بن عبيدة، يحدث عن البراء بن عازب، أن رسول الله صلى الله عليه وسلم أمر رجلا إذا أخذ مضجعه من الليل أن يقول ‏\"‏ اللهم أسلمت نفسي إليك ووجهت وجهي إليك وألجأت ظهري إليك وفوضت أمري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبرسولك الذي أرسلت ‏.‏ فإن مات مات على الفطرة ‏\"‏ ‏.‏ ولم يذكر ابن بشار في حديثه من الليل ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that Allah's Messenger (in may peace be upon him) commanded a person (in these words):                      When you go to bed during night, you should say:\" O Allah, I surrender myself to Thee and entrust my affair to Thee, with hope in Thee and fear of Thee. There is no resort and no deliverer (from hardship but Thou). I affirm my faith in the Book which Thou revealed and in the Messengers whom Thou sent.\" If you die in this state you would die on Fitra, and Ibn Bashshdr did not make a mention of\" night\" in this hadith.",
      "chain": [
        "30170",
        "30002",
        "20020",
        "30160",
        "20033",
        "30002",
        "20020",
        "11381",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "7165",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا عبيدة، يحدث عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل يبسط يده بالليل ليتوب مسيء النهار ويبسط يده بالنهار ليتوب مسيء الليل حتى تطلع الشمس من مغربها ‏\"‏ ‏.‏  وحدثنا محمد بن بشار، حدثنا أبو داود، حدثنا شعبة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Abu Mu'sa reported Allah's Messenger (may peace be upon him) as saying that Allah, the Exalted and Glorious, Stretches out His Hand during the night so that the people repent for the fault committed from dawn till dusk and He stretches out His Hand daring the day so that the people may reprint for the fault committed from dusk to dawn. (He would accept repentance) before the sun rises in the west (before the Day of Resurrection). A hadith like this has been narrated on the authority of Shu'ba with the same chain of transmitters.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11381",
        "41"
      ]
    },
    {
      "hadith_no": "7169",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  عمرو بن مرة، قال سمعت أبا وائل، يقول سمعت عبد الله بن مسعود، يقول قلت له آنت سمعته من عبد الله، قال نعم ورفعه أنه قال ‏\"‏ لا أحد أغير من الله ولذلك حرم الفواحش ما ظهر منها وما بطن ولا أحد أحب إليه المدح من الله ولذلك مدح نفسه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported it directly from Allah's Messenger (may peace be upon him) that he said:                      None is more self-respecting than Allah and it is because of this that He has prohibited abominable acts-both visible and invisible and nothing is loved by Allah more than the praise of His Ownself and it is because of this that He has praised Himself.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7306",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا ابن إدريس، ح وحدثنا منجاب بن الحارث التميمي، حدثنا ابن مسهر، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى، بن يونس ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن الأعمش، بهذا الإسناد ‏.‏ نحوه ‏.‏ وزاد منجاب في روايته عن ابن مسهر قال الأعمش وحدثني عمرو بن مرة عن شقيق عن عبد الله مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah through other chains of transmitters.",
      "chain": [
        "30200",
        "20102",
        "30479",
        "30123",
        "30556",
        "20347",
        "30421",
        "11060",
        "11381"
      ]
    },
    {
      "hadith_no": "229",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، قال دخلت على علي - رضى الله عنه - أنا ورجلان رجل منا ورجل من بني أسد - أحسب فبعثهما علي - رضى الله عنه - وجها وقال إنكما علجان فعالجا عن دينكما ‏.‏ ثم قام فدخل المخرج ثم خرج فدعا بماء فأخذ منه حفنة فتمسح بها ثم جعل يقرأ القرآن فأنكروا ذلك فقال إن رسول الله صلى الله عليه وسلم كان يخرج من الخلاء فيقرئنا القرآن ويأكل معنا اللحم ولم يكن يحجبه - أو قال يحجزه - عن القرآن شىء ليس الجنابة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Abdullah ibn Salamah said: I, accompanied by other two persons, one from us and the other from Banu Asad, called upon Ali. He sent them to a certain territory (on some mission) saying: You are sturdy and vigorous people; hence display your power for religion. He then stood and entered the toilet. He then came out and called for water and took a handful of it. Then he wiped (his hands) with it and began to recite the Qur'an. They were surprised at this (action).  Thereupon he said: The Messenger of Allah (ﷺ) came out from the privy and taught us the Qur'an and took meat  with us. Nothing prevented him; or the narrator said: Nothing prevented him from (reciting) the Qur'an except sexual defilement.",
      "chain": [
        "30329",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن مرزوق، أخبرنا شعبة، عن عمرو بن مرة، قال سمعت ابن أبي ليلى، ح وحدثنا ابن المثنى، حدثنا محمد بن جعفر، عن شعبة، عن عمرو بن مرة، سمعت ابن أبي ليلى، قال أحيلت الصلاة ثلاثة أحوال - قال - وحدثنا أصحابنا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لقد أعجبني أن تكون صلاة المسلمين - أو قال المؤمنين - واحدة حتى لقد هممت أن أبث رجالا في الدور ينادون الناس بحين الصلاة وحتى هممت أن آمر رجالا يقومون على الآطام ينادون المسلمين بحين الصلاة حتى نقسوا أو كادوا أن ينقسوا ‏\"‏ ‏.‏ قال فجاء رجل من الأنصار فقال يا رسول الله إني لما رجعت - لما رأيت من اهتمامك - رأيت رجلا كأن عليه ثوبين أخضرين فقام على المسجد فأذن ثم قعد قعدة ثم قام فقال مثلها إلا أنه يقول قد قامت الصلاة ولولا أن يقول الناس - قال ابن المثنى أن تقولوا - لقلت إني كنت يقظانا غير نائم ‏.‏ فقال رسول الله صلى الله عليه وسلم وقال ابن المثنى ‏\"‏ لقد أراك الله خيرا ‏\"‏ ‏.‏ ولم يقل عمرو ‏\"‏ لقد أراك الله خيرا فمر بلالا فليؤذن ‏\"‏ ‏.‏ قال فقال عمر أما إني قد رأيت مثل الذي رأى ولكني لما سبقت استحييت ‏.‏ قال وحدثنا أصحابنا قال وكان الرجل إذا جاء يسأل فيخبر بما سبق من صلاته وإنهم قاموا مع رسول الله صلى الله عليه وسلم من بين قائم وراكع وقاعد ومصل مع رسول الله صلى الله عليه وسلم ‏.‏ قال ابن المثنى قال عمرو وحدثني بها حصين عن ابن أبي ليلى حتى جاء معاذ ‏.‏ قال شعبة وقد سمعتها من حصين فقال لا أراه على حال إلى قوله كذلك فافعلوا ‏.‏ قال أبو داود ثم رجعت إلى حديث عمرو بن مرزوق قال فجاء معاذ فأشاروا إليه - قال شعبة وهذه سمعتها من حصين - قال فقال معاذ لا أراه على حال إلا كنت عليها ‏.‏ قال فقال إن معاذا قد سن لكم سنة كذلك فافعلوا ‏.‏ قال وحدثنا أصحابنا أن رسول الله صلى الله عليه وسلم لما قدم المدينة أمرهم بصيام ثلاثة أيام ثم أنزل رمضان وكانوا قوما لم يتعودوا الصيام وكان الصيام عليهم شديدا فكان من لم يصم أطعم مسكينا فنزلت هذه الآية ‏{‏ فمن شهد منكم الشهر فليصمه ‏}‏ فكانت الرخصة للمريض والمسافر فأمروا بالصيام ‏.‏ قال وحدثنا أصحابنا قال وكان الرجل إذا أفطر فنام قبل أن يأكل لم يأكل حتى يصبح ‏.‏ قال فجاء عمر بن الخطاب فأراد امرأته فقالت إني قد نمت فظن أنها تعتل فأتاها فجاء رجل من الأنصار فأراد الطعام فقالوا حتى نسخن لك شيئا فنام فلما أصبحوا أنزلت عليه هذه الآية ‏{‏ أحل لكم ليلة الصيام الرفث إلى نسائكم ‏}‏ ‏.‏",
      "text_en": " Ibn Abi Laila said:                      Prayer passed through three stages. And out people narrated to us that Messenger of Allah (May peace be upon him) said; it is to my liking that the prayer of Muslims or believers should be united (i.e., in congregation), so much so that I intended to send people to the houses to announce the time of prayer; and I also resolved that I should order people to stand at (the tops of) the forts and announce the time of the prayer for Muslims; and they struck the bell or were about to strike the bell (to announce the time for prayer). Then came a person from among the Ansar who said: Messenger of Allah, when I returned from you, as I saw your anxiety. I saw (in sleep) a person with two green clothes on him; he stood on the  mosque and called (people) to prayer. He then sat down for a short while and stood up and pronounced in a like manner, except that he added: “The time for prayer has come”. If the people did not call me (a liar), and according to the version of Ibn al-Muthanna, if you did not call me (a liar). I would say that I was awake; I was awake; I was not asleep. The Messenger of Allah (May peace be upon him) said: According to the version of Ibn al-Muthanna, Allah has shown you a good (dream). But the version of ‘Amr does not have the words: Allah has shown you a good (dream). Then ask Bilal to pronounce the ADHAN (to call to the prayer). ‘Umar (in the meantime) said: I also had a dream like the one he had. But as he informed earlier. I was ashamed (to inform). Our people have narrated to us: when a person came (to the mosque during the prayer in congregation), he would ask (about the RAKAHS of prayer), and he would be informed about the number of RAKAHS already performed. They would stand (in prayer) along with the Messenger of Allah (May peace be upon him): some in standing position; others bowing; some sitting and some praying along with the Messenger of Allah (May peace be upon him).Ibn al-Muthanna reported from ‘Amr from Hussain b. Abi Laila, saying ; Until Mu’adh came. Shu’bah said ; I heard it from Hussain who said : I shall follow the position (in the prayer in which I find him (the prophet)). . . you should do in a similar way.Abu Dawud said: I then turned to the tradition reported by ‘Amr b. Marzuq he said; then Ma’adh came and they (the people) hinted at him. Shu’bah said; I heard it from hussain who said: Mu’adh then said; I shall follow the position (in the prayer when I join it) in which I find him (the prophet). He then said: Mu’adh has prayer when I join it in which I find him (the prophet). He then said: MU’adh has introduced for you a SUNNAH (a model behaviour), so you should do in a like manner.He said; our people have narrated to us; when the Messenger of Allah (ﷺ) came to Madina, he commanded them (the people) to keep fast  for three days. Thereafter the Quranic verses with regard to the fasts during Ramadan were revealed. But they were people who were not accustomed to keep fast ; hence the keeping of the fasts was hard for them; so those who could not keep fast would feed an indigent; then the month”. The concession was granted to the patient and the traveler; all were commanded to keep fast.",
      "chain": [
        "20268",
        "20020",
        "11381",
        "11196",
        "30170",
        "20173",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، عن أبي داود، ح وحدثنا نصر بن المهاجر، حدثنا يزيد بن هارون، عن المسعودي، عن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قال أحيلت الصلاة ثلاثة أحوال وأحيل الصيام ثلاثة أحوال وساق نصر الحديث بطوله واقتص ابن المثنى منه قصة صلاتهم نحو بيت المقدس قط قال الحال الثالث أن رسول الله صلى الله عليه وسلم قدم المدينة فصلى - يعني نحو بيت المقدس - ثلاثة عشر شهرا فأنزل الله تعالى هذه الآية ‏{‏ قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره ‏}‏ فوجهه الله تعالى إلى الكعبة ‏.‏ وتم حديثه وسمى نصر صاحب الرؤيا قال فجاء عبد الله بن زيد رجل من الأنصار وقال فيه فاستقبل القبلة قال الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة مرتين حى على الفلاح مرتين الله أكبر الله أكبر لا إله إلا الله ثم أمهل هنية ثم قام فقال مثلها إلا أنه قال زاد بعد ما قال ‏\"‏ حى على الفلاح ‏\"‏ ‏.‏ قد قامت الصلاة قد قامت الصلاة ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقنها بلالا ‏\"‏ ‏.‏ فأذن بها بلال وقال في الصوم قال فإن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر ويصوم يوم عاشوراء فأنزل الله تعالى ‏{‏ كتب عليكم الصيام كما كتب على الذين من قبلكم ‏}‏ إلى قوله ‏{‏ طعام مسكين ‏}‏ فكان من شاء أن يصوم صام ومن شاء أن يفطر ويطعم كل يوم مسكينا أجزأه ذلك وهذا حول فأنزل الله تعالى ‏{‏ شهر رمضان الذي أنزل فيه القرآن ‏}‏ إلى ‏{‏ أيام أخر ‏}‏ فثبت الصيام على من شهد الشهر وعلى المسافر أن يقضي وثبت الطعام للشيخ الكبير والعجوز اللذين لا يستطيعان الصوم وجاء صرمة وقد عمل يومه وساق الحديث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     Prayer passed through three stages and fasting also passed through three stages. The narrator Nasr reported the rest of the tradition completely. The narrator, Ibn al-Muthanna, narrated the story of saying prayer facing in the direction of Jerusalem.  He said: The third stage is that the Messenger of Allah (ﷺ) came to Medina and prayed, i.e. facing Jerusalem, for thirteen months.  Then Allah, the Exalted, revealed the verse: \"We have seen thee turning thy face to Heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wherever ye may be, turn your face (when ye pray) toward it\" (ii.144). And Allah, the Reverend and the Majestic, turned (them) towards the Ka'bah. He (the narrator) completed his tradition.  The narrator, Nasr, mentioned the name of the person who had the dream, saying: And Abdullah ibn Zayd, a man from the Ansar, came. The same version reads: And he turned his face towards the qiblah and said: Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer (he pronounced it twice), come to salvation (he pronounced it twice); Allah is Most Great, Allah is most great. He then paused for a while, and then got up and pronounced in a similar way, except that after the phrase \"Come to salvation\" he added. \"The time for prayer has come, the time for prayer has come.\"  The Messenger of Allah (ﷺ) said: Teach it to Bilal, then pronounce the adhan (call to prayer) with the same words. As regards fasting, he said: The Messenger of Allah (ﷺ) used to fast for three days every month, and would fast on the tenth of Muharram. Then Allah, the Exalted, revealed the verse: \".......Fasting was prescribed for those before you, that ye may ward off (evil)......and for those who can afford it there is a ransom: the feeding of a man in need (ii.183-84). If someone wished to keep the fast, he would keep the fast; if someone wished to abandon the fast, he would feed an indigent every day; it would do for him. But this was changed. Allah, the Exalted, revealed: \"The month of Ramadan in which was revealed the Qur'an ..........(let him fast the same) number of other days\" (ii.185).  Hence the fast was prescribed for the one who was present in the month (of Ramadan) and the traveller was required to atone (for them); feeding (the indigent) was prescribed for the old man and woman who were unable to fast. (The narrator, Nasr, further reported): The companion Sirmah, came after finishing his day's work......and he narrated the rest of the tradition.",
      "chain": [
        "30170",
        "30002",
        "20472",
        "20724",
        "11381",
        "11196",
        "32"
      ]
    },
    {
      "hadith_no": "682",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، عن عمرو بن مرة، عن هلال بن يساف، عن عمرو بن راشد، عن وابصة، أن رسول الله صلى الله عليه وسلم رأى رجلا يصلي خلف الصف وحده فأمره أن يعيد - قال سليمان بن حرب - الصلاة ‏.‏",
      "text_en": " Narrated Wabisah:                     The Messenger of Allah (ﷺ) saw a man praying alone behind the row. He ordered him to repeat. Sulayman ibn Harb said: The prayer.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "10835"
      ]
    },
    {
      "hadith_no": "709",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يصلي فذهب جدى يمر بين يديه فجعل يتقيه ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Prophet (ﷺ) was (once) praying. A kid went passing in front of him and he kept on stopping it.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "10839",
        "17"
      ]
    },
    {
      "hadith_no": "764",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن مرزوق، أخبرنا شعبة، عن عمرو بن مرة، عن عاصم العنزي، عن ابن جبير بن مطعم، عن أبيه، أنه رأى رسول الله صلى الله عليه وسلم يصلي صلاة قال عمرو لا أدري أى صلاة هي فقال ‏\"‏ الله أكبر كبيرا الله أكبر كبيرا الله أكبر كبيرا والحمد لله كثيرا والحمد لله كثيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا ‏\"‏ ‏.‏ ثلاثا ‏\"‏ أعوذ بالله من الشيطان من نفخه ونفثه وهمزه ‏\"‏ ‏.‏ قال نفثه الشعر ونفخه الكبر وهمزه الموتة ‏.‏",
      "text_en": " Narrated Jubayr ibn Mut'im:                     Jabir saw the Messenger of Allah (ﷺ) observing prayer. (The narrator Amr said: I do not know which prayer he was offering.) He (the Prophet) said: Allah is altogether great; Allah is altogether great; Allah is altogether great; and praise be to Allah in abundance; and praise be to Allah is abundance; and praise be to Allah in abundance. Glory be to Allah in the morning and after (saying it three times). I seek refuge in Allah from the accursed devil, from his puffing up (nafkh), his spitting (nafth) and his evil suggestion (hamz). He (Amr) said: His nafth it poetry, his nafkh is pride, and his hamz is madness.",
      "chain": [
        "20268",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "765",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مسعر، عن عمرو بن مرة، عن رجل، عن نافع بن جبير، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقول في التطوع ذكر نحوه ‏.‏",
      "text_en": " The above mentioned tradition has also been reported by Jubair b. Mut’im through a different chain of narrators. This version adds:                      I head the Prophet(ﷺ) uttering (all these supplications) in a supererogatory prayer; he narrated the tradition in a similar manner.",
      "chain": [
        "30175",
        "20031",
        "20359",
        "11381",
        "11059",
        "871"
      ]
    },
    {
      "hadith_no": "874",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وعلي بن الجعد، قالا حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، مولى الأنصار عن رجل، من بني عبس عن حذيفة، أنه رأى رسول الله صلى الله عليه وسلم يصلي من الليل فكان يقول ‏\"‏ الله أكبر - ثلاثا - ذو الملكوت والجبروت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم استفتح فقرأ البقرة ثم ركع فكان ركوعه نحوا من قيامه وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ ثم رفع رأسه من الركوع فكان قيامه نحوا من ركوعه يقول ‏\"‏ لربي الحمد ‏\"‏ ‏.‏ ثم سجد فكان سجوده نحوا من قيامه فكان يقول في سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ ثم رفع رأسه من السجود وكان يقعد فيما بين السجدتين نحوا من سجوده وكان يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ فصلى أربع ركعات فقرأ فيهن البقرة وآل عمران والنساء والمائدة أو الأنعام شك شعبة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     Hudhayfah saw the Messenger of Allah (ﷺ) praying at night. He said: Allah is most great\" three times, \"Possessor of kingdom, grandeur, greatness and majesty.\" He then began (his prayer) and recited Surah al-Baqarah; then he bowed and he paused in bowing as long as he stood up; he said while bowing, \"Glory be to my mighty Lord,\" \"Glory be to my mighty Lord\" ; then he raised his head, after bowing: then he stood up and he paused as long as he paused in bowing and said, \"Praise be to my Lord\" ; then he prostrated and paused in prostration as long as he paused in the standing position; he said while prostrating: \"Glory be to my most high Lord\"; then he raised his head after prostration, and sat as long as he prostrated, and said while sitting: \"O my Lord forgive me.\" He offered four rak'ahs of prayer and recited in them Surah al-Baqarah, Aal Imran, an-Nisa, al-Ma'idah, or al-An'am. The narrator Shu'bah doubted.",
      "chain": [
        "20296",
        "20386",
        "20020",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "hadith_no": "1291",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، قال ما أخبرنا أحد، أنه رأى النبي صلى الله عليه وسلم صلى الضحى غير أم هانئ فإنها ذكرت أن النبي صلى الله عليه وسلم يوم فتح مكة اغتسل في بيتها وصلى ثماني ركعات فلم يره أحد صلاهن بعد ‏.‏",
      "text_en": " Narrated Ibn Abi Laila:                     No one told us that the Prophet (ﷺ) had offered Duha prayer except Umm Hani. She said that the Prophet (ﷺ) had taken bath in her house on the day of the Conquest of Mecca and prayed eight rak'ahs. But no one saw him afterwards praying these rak'ahs.",
      "chain": [
        "30329",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1417",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم بمعناه زاد فقال أعرابي ما تقول فقال ‏\"‏ ليس لك ولا لأصحابك ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated by 'Abd Allah (b. Mas'ud) through a different chain of narrators to the same effect. This version adds:                      A bedouin said: What are you saying ? He replied: This is neither for you, nor for your companions.",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11381",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، ومسلم بن إبراهيم، وحفص بن عمر، ح وحدثنا ابن معاذ، حدثني أبي قالوا، كلهم حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، عن البراء، أن النبي صلى الله عليه وسلم كان يقنت في صلاة الصبح زاد ابن معاذ وصلاة المغرب ‏.‏",
      "text_en": " Al-Bara' said:                      The Prophet (ﷺ) used to recite the supplication in the dawn prayer. The version of Ibn Mu'adh has the words: \"sunset prayer\".",
      "chain": [
        "20296",
        "20285",
        "30329",
        "30150",
        "20286",
        "20020",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1510",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمرو بن مرة، عن عبد الله بن الحارث، عن طليق بن قيس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يدعو ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر هداى إلى وانصرني على من بغى على اللهم اجعلني لك شاكرا لك ذاكرا لك راهبا لك مطواعا إليك مخبتا أو منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي واهد قلبي وسدد لساني واسلل سخيمة قلبي ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) used to supplicate Allah: \"My Lord, help me and do not give help against me; grant me victory, and do not grant victory over me; plan on my behalf and do not plan against me; guide me, and made my right guidance easy for me; grant me victory over those who  act wrongfully towards me; O Allah, make me grateful to Thee, mindful of Thee, full of fear towards Thee, devoted to Thy obedience, humble before Thee, or penitent. My Lord, accept my repentance, wash away my sin, answer my supplication, clearly establish my evidence, guide my heart, make true my tongue and draw out malice in my breast.\"",
      "chain": [
        "28531",
        "20012",
        "11381",
        "912",
        "19870",
        "17"
      ]
    },
    {
      "hadith_no": "1511",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال سمعت عمرو بن مرة، بإسناده ومعناه قال ‏\"‏ ويسر الهدى إلى ‏\"‏ ‏.‏ ولم يقل ‏\"‏ هداى ‏\"‏ ‏.‏ قال أبو داود سمع سفيان من عمرو بن مرة قالوا ثمانية عشر حديثا ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by 'Amr b. Murrah through a different chain of narrators to the same effect. This version adds:                      \"And make right guidance easy for me.\" The narrator did not say: \"my right guidance\".\t\t\t\t\t\t\tAbu Dawud said: Sufyan heard eighteen traditions from 'Amr b. Murrah.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11381",
        "30002"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا محمد بن عبيد، حدثنا إدريس بن يزيد الأودي، عن عمرو بن مرة الجملي، عن أبي البختري الطائي، عن أبي سعيد الخدري، يرفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق زكاة ‏\"‏ ‏.‏ والوسق ستون مختوما ‏.‏ قال أبو داود أبو البختري لم يسمع من أبي سعيد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: There is no zakat payable (on grain or dates) on less than five camel-loads. The wasq (one camel-load) measures sixty sa' in weight.",
      "chain": [
        "38120",
        "30213",
        "20407",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر النمري، وأبو الوليد الطيالسي، - المعنى - قالا أخبرنا شعبة، عن عمرو بن مرة، عن عبد الله بن أبي أوفى، قال كان أبي من أصحاب الشجرة وكان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ قال فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " Narrated ‘Abdallah bin Abi Awfa :                     My father was one of those Companions who took the oath of allegiance at the hand of the Prophet (ﷺ) beneath the tree. The Prophet (ﷺ) said when the people brought him their sadaqah : O Allah, bless the family of so and so. When my father brought him his sadaqah he said O Allah bless the family of Abu Awfa.",
      "chain": [
        "30329",
        "20296",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "1698",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن الحارث، عن أبي كثير، عن عبد الله بن عمرو، قال خطب رسول الله صلى الله عليه وسلم فقال ‏\"‏ إياكم والشح فإنما هلك من كان قبلكم بالشح أمرهم بالبخل فبخلوا وأمرهم بالقطيعة فقطعوا وأمرهم بالفجور ففجروا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) preached and said: Abstain from avarice, for those who had been before you were annihilated due to avarice. It (avarice) commanded them to show niggardliness; it commanded them to cut off their relationship with their nearest relatives, so they cut off. It commanded them to show profligacy, so they showed it.",
      "chain": [
        "30329",
        "20020",
        "11381",
        "912",
        "29"
      ]
    },
    {
      "hadith_no": "2517",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو بن مرة، عن أبي وائل، عن أبي موسى، ‏:‏ أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم فقال ‏:‏ إن الرجل يقاتل للذكر، ويقاتل ليحمد، ويقاتل ليغنم، ويقاتل ليرى مكانه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من قاتل حتى تكون كلمة الله هي أعلى فهو في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa said “A beduoin came to the Apostle of Allaah(ﷺ) and said “One man fights for reputation, one fights for being praised, one fights for booty and one for his place to be seen. (Which of them is in Allaah’s path?)”. The Apostle of Allaah(ﷺ) replied “The one who fights that Allaah’s word may have pre-eminence is in Allaah’s path.”",
      "chain": [
        "30329",
        "20020",
        "11381",
        "11353"
      ]
    },
    {
      "hadith_no": "2524",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن عمرو بن مرة، قال سمعت عمرو بن ميمون، عن عبد الله بن ربيعة، عن عبيد بن خالد السلمي، قال ‏:‏ آخى رسول الله صلى الله عليه وسلم بين رجلين فقتل أحدهما ومات الآخر بعده بجمعة أو نحوها، فصلينا عليه، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ ما قلتم ‏\"‏ ‏.‏ فقلنا ‏:‏ دعونا له، وقلنا ‏:‏ اللهم اغفر له وألحقه بصاحبه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ فأين صلاته بعد صلاته وصومه بعد صومه ‏\"‏ ‏.‏ شك شعبة في صومه ‏:‏ ‏\"‏ وعمله بعد عمله إن بينهما كما بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydullah ibn Khalid as-Sulami:                     The Messenger of Allah (ﷺ) made a brotherhood between two men, one of whom was killed (in Allah's path), and a week or thereabouts later the other died, and we prayed at his funeral). The Messenger of Allah (ﷺ) asked: What did you say? We replied: We prayed for him and said: O Allah, forgive him, and join him to his companion. The Messenger of Allah (ﷺ) said: What about his prayers since the time the other died, and his fasting since the time the other died--the narrator Shu'bah doubted the words, \"his fasting--and his deeds since the time the other died. The distance between them is just like the distance between heaven and earth.",
      "chain": [
        "28531",
        "20020",
        "11381",
        "11382",
        "18514",
        "5164"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن الحسين الرقي، قال حدثنا عبد الله بن جعفر الرقي، قال أخبرني عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن إبراهيم، قال أراد الضحاك بن قيس أن يستعمل، مسروقا فقال له عمارة بن عقبة أتستعمل رجلا من بقايا قتلة عثمان فقال له مسروق حدثنا عبد الله بن مسعود - وكان في أنفسنا موثوق الحديث - أن النبي صلى الله عليه وسلم لما أراد قتل أبيك قال من للصبية قال ‏\"‏ النار ‏\"‏ ‏.‏ فقد رضيت لك ما رضي لك رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Ibrahim said: Ad-Dahhak ibn Qays intended to appoint Masruq as governor. Thereupon Umarah ibn Uqbah said to him: Are you appointing a man from the remnants of the murderers of Uthman? Masruq said to him: Ibn Mas'ud narrated to us, and he was trustworthy in respect of traditions, that when the Prophet (ﷺ) intended to kill your father, he said: Who will look after my children? He replied: Fire. I also like for you what the Messenger of Allah (ﷺ) liked for you.",
      "chain": [
        "38396",
        "30346",
        "30024",
        "11340",
        "11381",
        "11051",
        "16"
      ]
    },
    {
      "hadith_no": "2975",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن مرزوق، أخبرنا شعبة، عن عمرو بن مرة، عن أبي البختري، قال سمعت حديثا، من رجل فأعجبني فقلت اكتبه لي فأتى به مكتوبا مذبرا دخل العباس وعلي على عمر وعنده طلحة والزبير وعبد الرحمن وسعد وهما يختصمان فقال عمر لطلحة والزبير وعبد الرحمن وسعد ألم تعلموا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل مال النبي صلى الله عليه وسلم صدقة إلا ما أطعمه أهله وكساهم إنا لا نورث ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال فكان رسول الله صلى الله عليه وسلم ينفق من ماله على أهله ويتصدق بفضله ثم توفي رسول الله صلى الله عليه وسلم فوليها أبو بكر سنتين فكان يصنع الذي كان يصنع رسول الله صلى الله عليه وسلم ‏.‏ ثم ذكر شيئا من حديث مالك بن أوس ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     AbulBakhtari said: I heard from a man a tradition which I liked. I said to him: Write it down for me. So he brought it clearly written to me.  (It says): Al-Abbas and Ali entered upon Umar when Talhah, az-Zubayr, AbdurRahman and Sa'd were with him. They (Abbas and Ali) were disputing.  Umar said to Talhah, az-Zubayr, AbdurRahman and Sa'd: Do you not know that the Messenger of Allah (ﷺ) said: All the property of the Prophet (ﷺ) is sadaqah (alms), except what he provided for his family for their sustenance and their clothing. We are not to be inherited.  They said: Yes, indeed.  He said: The Messenger of Allah (ﷺ) used to spend from his property on his family, and give the residue as sadaqah (alms). The Messenger of Allah (ﷺ) then died, and AbuBakr ruled for two years. He would deal with it in the same manner as the Messenger of Allah (ﷺ) did. He then mentioned a little from the tradition of Malik ibn Aws.",
      "chain": [
        "20268",
        "20020",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "3197",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، عن شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، قال كان زيد - يعني ابن أرقم - يكبر على جنائزنا أربعا وإنه كبر على جنازة خمسا فسألته فقال كان رسول الله صلى الله عليه وسلم يكبرها ‏.‏ قال أبو داود وأنا لحديث ابن المثنى أتقن ‏.‏",
      "text_en": " Narrated Ibn Abi Laila:                     Zaid b. Arqam used to utter four takbirs (Allah is Most Great) over our dead person (during prayer). He uttered five takbirs on a dead person. So I asked him. He replied: The Messenger of Allah (ﷺ) used to utter those.Abu Dawud said: I remember the tradition of Ibn al-Muthanna in a more guarded way.",
      "chain": [
        "20296",
        "20020",
        "30170",
        "20173",
        "20020",
        "11381",
        "11196",
        "384"
      ]
    },
    {
      "hadith_no": "3883",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن أخي، زينب امرأة عبد الله عن زينب، امرأة عبد الله عن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الرقى والتمائم والتولة شرك ‏\"‏ ‏.‏ قالت قلت لم تقول هذا والله لقد كانت عيني تقذف وكنت أختلف إلى فلان اليهودي يرقيني فإذا رقاني سكنت ‏.‏ فقال عبد الله إنما ذاك عمل الشيطان كان ينخسها بيده فإذا رقاها كف عنها إنما كان يكفيك أن تقولي كما كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ أذهب الباس رب الناس اشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Zaynab, the wife of Abdullah ibn Mas'ud, told that Abdullah said: I heard the Messenger of Allah (ﷺ) saying: spells, charms and love-potions are polytheism.  I asked: Why do you say this? I swear by Allah, when my eye was discharging I used to go to so-and-so, the Jew, who applied a spell to me. When he applied the spell to me, it calmed down. Abdullah said:  That was just the work of the Devil who was picking it with his hand, and when he uttered the spell on it, he desisted. All you need to do is to say as the Messenger of Allah (ﷺ) used to say: Remove the harm, O Lord of men, and heal. Thou art the Healer. There is no remedy but Thine which leaves no disease behind.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "10839",
        "16"
      ]
    },
    {
      "hadith_no": "3967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن شرحبيل بن السمط، أنه قال لكعب بن مرة أو مرة بن كعب حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم فذكر معنى معاذ إلى قوله ‏\"‏ وأيما امرئ أعتق مسلما وأيما امرأة أعتقت امرأة مسلمة ‏\"‏ ‏.‏ زاد ‏\"‏ وأيما رجل أعتق امرأتين مسلمتين إلا كانتا فكاكه من النار يجزى مكان كل عظمين منهما عظم من عظامه ‏\"‏ ‏.‏ قال أبو داود سالم لم يسمع من شرحبيل مات شرحبيل بصفين ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Mu'adh through a different chain of narrators. After mentioning the words \"If any Muslim emancipates a Muslim slave... and if a woman emancipates a Muslim woman, this version adds:                      \"If a man emancipates two Muslim women, they will be deliverance from Hell fire; two bones of their will be emancipation for each of his bone.\"Abu Dawud said: Salim did not hear (traditions) from Shurahbil. Shurahbil died at Siffin.",
      "chain": [
        "30329",
        "20020",
        "11381",
        "11342",
        "6225"
      ]
    },
    {
      "hadith_no": "4337",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا خلف بن هشام، حدثنا أبو شهاب الحناط، عن العلاء بن المسيب، عن عمرو بن مرة، عن سالم، عن أبي عبيدة، عن ابن مسعود، عن النبي صلى الله عليه وسلم بنحوه زاد ‏\"‏ أو ليضربن الله بقلوب بعضكم على بعض ثم ليلعننكم كما لعنهم ‏\"‏ ‏.‏ قال أبو داود رواه المحاربي عن العلاء بن المسيب عن عبد الله بن عمرو بن مرة عن سالم الأفطس عن أبي عبيدة عن عبد الله رواه خالد الطحان عن العلاء عن عمرو بن مرة عن أبي عبيدة ‏.‏",
      "text_en": " A similar tradition (to the No. 4322) has also been transmitted by Ibn Mas'ud through a different chain of narrators to the same effect. This version adds:                      \"Or Allah will mingle your hearts together and curse you as He cursed them.\"Abu Dawud said: This tradition has been transmitted by al-Muharibi, from al-'Ala bin al-Musayyab, from 'Abd Allah bin 'Amr bin Murrah, from Salim al-Aftas, from Abu Ubaidah, from 'Abd Allah; and it is been transmitted by Khalid al-Tahhan, from al-'Ala, from 'Amr bin Murrah from Abu 'Ubaidah.",
      "chain": [
        "30503",
        "11613",
        "11647",
        "11381",
        "11011",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "4347",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، - وهذا لفظه - عن عمرو بن مرة، عن أبي البختري، قال أخبرني من، سمع النبي صلى الله عليه وسلم يقول وقال سليمان حدثني رجل من أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ لن يهلك الناس حتى يعذروا أو يعذروا من أنفسهم ‏\"‏ ‏.‏",
      "text_en": " A man from among the companions of the prophet (ﷺ) reported him as saying:                      The people will not perish until their sins and faults become abundant, and there remains no excuse for them.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "4746",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، عن زيد بن أرقم، قال ‏:‏ كنا مع رسول الله صلى الله عليه وسلم فنزلنا منزلا فقال ‏:‏ ‏\"‏ ما أنتم جزء من مائة ألف جزء ممن يرد على الحوض ‏\"‏ ‏.‏ قال قلت ‏:‏ كم كنتم يومئذ قال ‏:‏ سبعمائة أو ثمانمائة ‏.‏",
      "text_en": " Narrated Zayd ibn Arqam:                     We were with the Messenger of Allah (ﷺ). He said when we arrived at a halting place: You are not a hundred thousandth part of those who will come down to me at the pond. I (the narrator AbuHamzah) asked: What was your number that day? He replied: Seven or eight hundred.",
      "chain": [
        "30329",
        "20020",
        "11381",
        "20458",
        "384"
      ]
    },
    {
      "hadith_no": "4919",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأفضل من درجة الصيام والصلاة والصدقة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ إصلاح ذات البين وفساد ذات البين الحالقة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: Shall I not inform you of something more excellent in degree than fasting, prayer and almsgiving (sadaqah)? The people replied: Yes, Prophet of Allah! He said: It is putting things right between people, spoiling them is the shaver (destructive).",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11011",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "4985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا مسعر بن كدام، عن عمرو بن مرة، عن سالم بن أبي الجعد، قال قال رجل - قال مسعر أراه من خزاعة - ليتني صليت فاسترحت فكأنهم عابوا عليه ذلك فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يا بلال أقم الصلاة أرحنا بها ‏\"‏ ‏.‏",
      "text_en": " Narrated A man:                     Salim ibn AbulJa'dah said: A man said: (Mis'ar said: I think he was from the tribe of Khuza'ah): would that I had prayed, and got comfort. The people objected to him for it. Thereupon he said: I heard the Messenger of Allah (ﷺ) as saying: O Bilal, call iqamah for prayer: give us comfort by it.",
      "chain": [
        "30175",
        "20347",
        "20359",
        "11381",
        "11342",
        "20359"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو سعيد عبد الله بن سعيد الأشج، حدثنا حفص بن غياث، وعقبة بن خالد، قالا حدثنا الأعمش، وابن أبي ليلى، عن عمرو بن مرة، عن عبد الله بن سلمة، عن علي، قال كان رسول الله صلى الله عليه وسلم يقرئنا القرآن على كل حال ما لم يكن جنبا ‏.‏ قال أبو عيسى حديث علي هذا حديث حسن صحيح ‏.‏ وبه قال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ‏.‏ قالوا يقرأ الرجل القرآن على غير وضوء ولا يقرأ في المصحف إلا وهو طاهر ‏.‏ وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"Allah's Messenger would recite the Qur'an in all conditions, as long as he was not Junub.\"",
      "chain": [
        "30200",
        "20317",
        "20344",
        "11060",
        "11196",
        "11381",
        "5"
      ]
    },
    {
      "hadith_no": "194",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، عن ابن أبي ليلى، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن عبد الله بن زيد، قال كان أذان رسول الله صلى الله عليه وسلم شفعا شفعا في الأذان والإقامة ‏\"‏ ‏.‏ قال أبو عيسى حديث عبد الله بن زيد رواه وكيع عن الأعمش عن عمرو بن مرة عن عبد الرحمن بن أبي ليلى قال حدثنا أصحاب محمد صلى الله عليه وسلم أن عبد الله بن زيد رأى الأذان في المنام ‏.‏ وقال شعبة عن عمرو بن مرة عن عبد الرحمن بن أبي ليلى أن عبد الله بن زيد رأى الأذان في المنام ‏.‏ وهذا أصح من حديث ابن أبي ليلى ‏.‏ وعبد الرحمن بن أبي ليلى لم يسمع من عبد الله بن زيد ‏.‏ وقال بعض أهل العلم الأذان مثنى مثنى والإقامة مثنى مثنى ‏.‏ وبه يقول سفيان الثوري وابن المبارك وأهل الكوفة ‏.‏ قال أبو عيسى ابن أبي ليلى هو محمد بن عبد الرحمن بن أبي ليلى كان قاضي الكوفة ولم يسمع من أبيه شيئا إلا أنه يروي عن رجل عن أبيه ‏.‏",
      "text_en": " Abdullah bin Zaid said:                     \"Allah's Messenger would say each phrase of the call (for prayer) two times, for the Adhan and the Iqamah.\"",
      "chain": [
        "30200",
        "20344",
        "11196",
        "11381",
        "11196",
        "605"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن هلال بن يساف، عن عمرو بن راشد، عن وابصة بن معبد، أن رجلا، صلى خلف الصف وحده فأمره النبي صلى الله عليه وسلم أن يعيد الصلاة ‏.‏ قال أبو عيسى وسمعت الجارود يقول سمعت وكيعا يقول إذا صلى الرجل خلف الصف وحده فإنه يعيد ‏.‏",
      "text_en": " Wabisah bin Ma'bad narrated:                     \"A man prayed alone behind the row s the Prophet ordered him to repeat the Salat.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381",
        "10835"
      ]
    },
    {
      "hadith_no": "401",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، ومحمد بن المثنى، قالا حدثنا غندر، محمد بن جعفر عن شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، أن النبي صلى الله عليه وسلم كان يقنت في صلاة الصبح والمغرب ‏.‏ قال وفي الباب عن علي وأنس وأبي هريرة وابن عباس وخفاف بن إيماء بن رحضة الغفاري ‏.‏ قال أبو عيسى حديث البراء حديث حسن صحيح ‏.‏ واختلف أهل العلم في القنوت في صلاة الفجر فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم القنوت في صلاة الفجر وهو قول مالك والشافعي ‏.‏ وقال أحمد وإسحاق لا يقنت في الفجر إلا عند نازلة تنزل بالمسلمين فإذا نزلت نازلة فللإمام أن يدعو لجيوش المسلمين ‏.‏",
      "text_en": " Al-Bara bin Azib narrated:                     \"The Prophet (S) would perform the Qunut in the Subh and Maghrib prayers.\"",
      "chain": [
        "30367",
        "30170",
        "20020",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان النبي صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بسبع ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم الوتر بثلاث عشرة وإحدى عشرة وتسع وسبع وخمس وثلاث وواحدة ‏.‏ قال إسحاق بن إبراهيم معنى ما روي أن النبي صلى الله عليه وسلم كان يوتر بثلاث عشرة قال إنما معناه أنه كان يصلي من الليل ثلاث عشرة ركعة مع الوتر فنسبت صلاة الليل إلى الوتر ‏.‏ وروى في ذلك حديثا عن عائشة واحتج بما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أوتروا يا أهل القرآن ‏\"‏ ‏.‏ قال إنما عنى به قيام الليل يقول إنما قيام الليل على أصحاب القرآن ‏.‏",
      "text_en": " Aishah narrated:                     \"The night prayer of Allah's Messenger was thirteen Rak'ah, five of which were his Witr, not sitting in any of them except at the end of them. When the Mu'adh-dhin called the Adhan he would stand to perform two light (Rak'ah).\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن جعفر، أخبرنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال ما أخبرني أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى إلا أم هانئ فإنها حدثت أن رسول الله صلى الله عليه وسلم دخل بيتها يوم فتح مكة فاغتسل فسبح ثمان ركعات ما رأيته صلى صلاة قط أخف منها غير أنه كان يتم الركوع والسجود ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وكأن أحمد رأى أصح شيء في هذا الباب حديث أم هانئ ‏.‏ واختلفوا في نعيم فقال بعضهم نعيم بن خمار وقال بعضهم ابن همار ويقال ابن هبار ويقال ابن همام والصحيح ابن همار ‏.‏ وأبو نعيم وهم فيه فقال ابن حماز وأخطأ فيه ثم ترك فقال نعيم عن النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى وأخبرني بذلك عبد بن حميد عن أبي نعيم ‏.‏",
      "text_en": " Abdur-Rahman bin Abi Laila narrated:                     \"No one informed that they saw Allah's Messenger praying Ad-Duha except Umm Hani. She narrated that Allah's Messenger entered her house on the Day of the Conquest of Makkah. He performed Ghusl and performed eight voluntary Rak'ah such that she had not ever seen him pray any Salat lighter than them, but that he completed the bowing and prostrations.\"",
      "chain": [
        "20173",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "591",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن يونس الكوفي، حدثنا المحاربي، عن الحجاج بن أرطاة، عن أبي إسحاق، عن هبيرة بن يريم، عن علي، وعن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قالا قال النبي صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم الصلاة والإمام على حال فليصنع كما يصنع الإمام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعلم أحدا أسنده إلا ما روي من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا إذا جاء الرجل والإمام ساجد فليسجد ولا تجزئه تلك الركعة إذا فاته الركوع مع الإمام واختار عبد الله بن المبارك أن يسجد مع الإمام وذكر عن بعضهم فقال لعله لا يرفع رأسه في تلك السجدة حتى يغفر له ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated that :                     the Messenger of Allah said: \"When one of you comes to the Salat and (finds) the Imam is in a position, then do as the Imam is doing.\"",
      "chain": [
        "20333",
        "20580",
        "11049",
        "19883",
        "5",
        "11381",
        "11196",
        "32"
      ]
    },
    {
      "hadith_no": "624",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن عمرو بن مرة قال سألت أبا عبيدة بن عبد الله هل تذكر من عبد الله شيئا قال لا ‏.‏",
      "text_en": " Muhammad bin Bash-shar (Al-Abdi) narrated to us, :                     Muhammad bin Ja'far narrated to us, from Shu'bah, from Amr bin Murrah who said: \"I asked Abu Ubaidah bin Abdullah: 'Did you remember anything from Abdullah?' He said, 'No'\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "671",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، يحدث عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إذا تصدقت المرأة من بيت زوجها كان لها به أجر وللزوج مثل ذلك وللخازن مثل ذلك ولا ينقص كل واحد منهم من أجر صاحبه شيئا له بما كسب ولها بما أنفقت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Aishah narrated that :                     the Prophet said: \"When a woman gives in charity from her husband's house, she will get the reward for it, and for her husband is the same as that, and for the trustee is the same as that. The reward of each them will not be decreased at all by the reward of the other, for him is what he earned, and for her is what she spent.\"",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11381",
        "11353",
        "53"
      ]
    },
    {
      "hadith_no": "1023",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، أخبرنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال كان زيد بن أرقم يكبر على جنائزنا أربعا وإنه كبر على جنازة خمسا فسألناه عن ذلك فقال كان رسول الله صلى الله عليه وسلم يكبرها ‏.‏ قال أبو عيسى حديث زيد بن أرقم حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا من أصحاب النبي صلى الله عليه وسلم وغيرهم رأوا التكبير على الجنازة خمسا ‏.‏ وقال أحمد وإسحاق إذا كبر الإمام على الجنازة خمسا فإنه يتبع الإمام ‏.‏",
      "text_en": " Abdur-Rahman bin Abi Laila said:                     \"Zaid bin Arqam would say four Takbir for our funerals. (Once) he said five Takbir for a funeral so we asked him about that and he said: 'The Messenger of Allah would say those Takbir.'\"",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11381",
        "11196",
        "384"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثني علي بن الحكم، حدثني أبو الحسن، قال قال عمرو بن مرة لمعاوية إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من إمام يغلق بابه دون ذوي الحاجة والخلة والمسكنة إلا أغلق الله أبواب السماء دون خلته وحاجته ومسكنته ‏\"‏ ‏.‏ فجعل معاوية رجلا على حوائج الناس ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث عمرو بن مرة حديث غريب وقد روي هذا الحديث من غير هذا الوجه ‏.‏ وعمرو بن مرة الجهني يكنى أبا مريم ‏.‏",
      "text_en": " Abul-Hasan narrated that 'Amr bin Murrah said to Mu'awiyah:                      \"I heard the Messenger of Allah (ﷺ) saying: 'No Imam closes his door on one in need, dire straits and poverty, except that Allah closes the gates of the Heavens from his dire straits, his needs, and his poverty.' So Mu'awiyah appointed a man to look after the needs of the people.\"",
      "chain": [
        "30242",
        "20208",
        "11381"
      ]
    },
    {
      "hadith_no": "1634",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، أن شرحبيل بن السمط، قال يا كعب بن مرة حدثنا عن رسول الله صلى الله عليه وسلم واحذر ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شاب شيبة في الإسلام كانت له نورا يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن فضالة بن عبيد وعبد الله بن عمرو ‏.‏ وحديث كعب بن مرة حديث حسن ‏.‏ هكذا رواه الأعمش عن عمرو بن مرة وقد روي هذا الحديث عن منصور عن سالم بن أبي الجعد وأدخل بينه وبين كعب بن مرة في الإسناد رجلا ‏.‏ ويقال كعب بن مرة ويقال مرة بن كعب البهزي والمعروف من أصحاب النبي صلى الله عليه وسلم مرة بن كعب البهزي وقد روى عن النبي صلى الله عليه وسلم أحاديث ‏.‏",
      "text_en": " Narrated Shurahbil bin As-Samt:                     \"O Ka'b bin Murrah! Relate (something) to is from the Messenger of Allah (ﷺ), and be cautious. He said: 'I heard the Prophet (ﷺ) say: \"Whoever develops some gray hair in Islam, it shall be a light from him on the Day of Judgement.\"[Abu 'Eisa said:] There is something on this topic from Fadalah bin 'Ubaid and 'Abdullah bin 'Amr. The narration of Ka'b bin Murrah was reported like this from Al-A'mash, from 'Amr bin Murrah.This Hadith is been reported from Mansur, from Salim bin Abu Al-Ja'd, and he included a man between him and between Ka'b bin Murrah in the chain. He is called: \"Ka'b bin Murrah,\" and he is called: \"Murrah bin Ka'b Al-Bahzi,\" and the one known among the Companions of the Prophet (ﷺ) is Ka'b bin Murrah Al-Bahzi, he reported some Ahadith from the Prophet (ﷺ).",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "11342",
        "6225"
      ]
    },
    {
      "hadith_no": "1714",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن عبد الله، قال لما كان يوم بدر وجيء بالأسارى قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تقولون في هؤلاء الأسارى ‏\"‏ ‏.‏ فذكر قصة في هذا الحديث طويلة ‏.‏ قال أبو عيسى وفي الباب عن عمر وأبي أيوب وأنس وأبي هريرة ‏.‏ وهذا حديث حسن وأبو عبيدة لم يسمع من أبيه ‏.‏ ويروى عن أبي هريرة قال ما رأيت أحدا أكثر مشورة لأصحابه من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu 'Ubaidah:                     That 'Abdullah said: \"On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'\" Then he mentioned the story in the lengthy Hadith.[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu HurairahThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said: \"None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ)",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "1834",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن مرة الهمداني، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ كمل من الرجال كثير ولم يكمل من النساء إلا مريم ابنة عمران وآسية امرأة فرعون وفضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأنس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Musa:                     That the Prophet (ﷺ) said: \"Many a man achieved perfection, but no woman achieved perfection except for Mariam the daughter of 'Imran, and Asiyah the wife of Fir'awn. And the superiority of 'Aishah over other women is like the superiority of Tharid over other foods.\"He said: There is something on this topic from 'Aishah and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "1868",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا شعبة، عن عمرو بن مرة، قال سمعت زاذان، يقول سألت ابن عمر عما نهى عنه رسول الله صلى الله عليه وسلم من الأوعية أخبرناه بلغتكم وفسره لنا بلغتنا ‏.‏ فقال نهى رسول الله صلى الله عليه وسلم عن الحنتمة وهي الجرة ونهى عن الدباء وهي القرعة ونهى عن النقير وهو أصل النخل ينقر نقرا أو ينسح نسحا ونهى عن المزفت وهي المقير وأمر أن ينبذ في الأسقية ‏.‏ قال وفي الباب عن عمر وعلي وابن عباس وأبي سعيد وأبي هريرة وعبد الرحمن بن يعمر وسمرة وأنس وعائشة وعمران بن حصين وعائذ بن عمرو والحكم الغفاري وميمونة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zadhan:                     \"I asked Ibn 'Umar about what containers the Messenger of Allah (ﷺ) prohibited. He informed us in your language, and he explained it to us in our language. He said: \"The Messenger of Allah (ﷺ) prohibited Al-Hantamah, and it is an earthenware container, and he prohibited Ad-Dubba', and it is gourd, and he prohibited An-Naqir, and it is the trunk of a date-palm that is hollowed out or carved, and he prohibited Al-Muzaffat, and it is coated with pitch. And he ordered that Nabidh be prepared in water-skins.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn 'Abbas, Abu Sa'eed, Abu Hurairah, 'Abdur-Rahman bin Ya'mur, Samurah, Anas, 'Aishah, 'Imran bin Husain, 'A'idh bin 'Amr, Al-Hakam Al-Ghifari, and Maimunah.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "20547",
        "20020",
        "11381",
        "10911"
      ]
    },
    {
      "hadith_no": "2377",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا زيد بن حباب، أخبرني المسعودي، حدثنا عمرو بن مرة، عن إبراهيم، عن علقمة، عن عبد الله، قال نام رسول الله صلى الله عليه وسلم على حصير فقام وقد أثر في جنبه فقلنا يا رسول الله لو اتخذنا لك وطاء ‏.‏ فقال ‏\"‏ ما لي وما للدنيا ما أنا في الدنيا إلا كراكب استظل تحت شجرة ثم راح وتركها ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah narrated :                     \"The Messenger of Allah (s.a.w) was sleeping upon a mat, then he stood, and the mat had left marks on his side. We said: 'O Messenger of Allah! We said: 'O Messenger of Allah! We could get a bed for you.' He said: 'What do I have to do with the world! I am not in the world but as a rider seeking shade under a tree, then he catches his breath and leaves it.'\"",
      "chain": [
        "20650",
        "20724",
        "11381",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأفضل من درجة الصيام والصلاة والصدقة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ صلاح ذات البين فإن فساد ذات البين هي الحالقة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ ويروى عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ هي الحالقة لا أقول تحلق الشعر ولكن تحلق الدين ‏\"‏ ‏.‏",
      "text_en": " Abu Ad-Darda' narrated that the Messenger of Allah (s.a.w) said:                     \"Shall I not inform you of what is more virtuous than the rank of fasting, Salat, and charity?\" They said: \"But of course!\" He said: \"Making peace between each other. For indeed spoiling relations with each other is the Haliqah.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "11342",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2733",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن إدريس، وأبو أسامة عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، قال قال يهودي لصاحبه اذهب بنا إلى هذا النبي ‏.‏ فقال صاحبه لا تقل نبي إنه لو سمعك كان له أربعة أعين ‏.‏ فأتيا رسول الله صلى الله عليه وسلم فسألاه عن تسع آيات بينات ‏.‏ فقال لهم ‏\"‏ لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تمشوا ببريء إلى ذي سلطان ليقتله ولا تسحروا ولا تأكلوا الربا ولا تقذفوا محصنة ولا تولوا الفرار يوم الزحف وعليكم خاصة اليهود أن لا تعتدوا في السبت ‏\"‏ ‏.‏ قال فقبلوا يده ورجله فقالا نشهد أنك نبي ‏.‏ قال ‏\"‏ فما يمنعكم أن تتبعوني ‏\"‏ ‏.‏ قالوا إن داود دعا ربه أن لا يزال في ذريته نبي وإنا نخاف إن تبعناك أن تقتلنا اليهود ‏.‏ وفي الباب عن يزيد بن الأسود وابن عمر وكعب بن مالك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Safwan bin Assal:                     \"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"",
      "chain": [
        "30216",
        "20102",
        "20318",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "3364",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة بن عبد الله، عن عبد الله بن مسعود، قال لما كان يوم بدر وجيء بالأسارى قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تقولون في هؤلاء الأسارى ‏\"‏ ‏.‏ فذكر في الحديث قصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينفلتن منهم أحد إلا بفداء أو ضرب عنق ‏\"‏ ‏.‏ قال عبد الله بن مسعود فقلت يا رسول الله إلا سهيل بن بيضاء فإني قد سمعته يذكر الإسلام ‏.‏ قال فسكت رسول الله صلى الله عليه وسلم قال فما رأيتني في يوم أخوف أن تقع على حجارة من السماء مني في ذلك اليوم قال حتى قال رسول الله صلى الله عليه وسلم ‏\"‏ إلا سهيل ابن بيضاء ‏\"‏ ‏.‏ قال ونزل القرآن بقول عمر ‏:‏ ‏(‏ وما كان لنبي أن يكون له أسرى حتى يثخن في الأرض ‏)‏ إلى آخر الآيات ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وأبو عبيدة بن عبد الله لم يسمع من أبيه ‏.‏",
      "text_en": " Narrated 'Amr bin Murrah:                     that Abu 'Ubaidah bin 'Abdullah narrated from 'Abdullah bin Mas'ud who said: \"On the Day of Badr, when the captives were brought, the Messenger of Allah (ﷺ) said 'What do you say about these captives?' So he mentioned the story. And the Messenger of Allah (ﷺ) said 'Not one of them should be released without a ransom, or a blow to the neck.'\" So 'Abdullah bin Mas'ud said: \"O Messenger of Allah! With the exception of Suhail bin Baidam for indeed I heard him mentioning Islam.\" He said: \"So the Messenger of Allah (ﷺ) was silent.\" He said: \"I have not seen a day upon which I was more fearful of stones falling from the heavens upon my head that the day.\" [He said:] \"Until the Messenger of Allah (ﷺ) said: 'Except for Suhail bin Al-Baida.'\" He said: \"And the Qur'an was revealed in accordance with the view of 'Umar. 'It is not (fitting) for a Prophet that he should have prisoners of war until he has fought (his enemies thoroughly) in the land...' until the end of the Ayat.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "16"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، ويزيد بن هارون، وأبو الوليد، واللفظ، لفظ يزيد والمعنى واحد عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال المرادي، أن يهوديين، قال أحدهما لصاحبه اذهب بنا إلى هذا النبي نسأله فقال لا تقل له نبي فإنه إن سمعنا نقول نبي كانت له أربعة أعين فأتيا النبي صلى الله عليه وسلم فسألاه عن قول الله عز وجل ‏:‏ ‏(‏ ولقد آتينا موسى تسع آيات بينات ‏)‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تشركوا بالله شيئا ولا تزنوا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تسرقوا ولا تسحروا ولا تمشوا ببريء إلى سلطان فيقتله ولا تأكلوا الربا ولا تقذفوا محصنة ولا تفروا من الزحف شك شعبة وعليكم اليهود خاصة أن لا تعدوا في السبت ‏\"‏ ‏.‏ فقبلا يديه ورجليه وقالا نشهد أنك نبي ‏.‏ قال ‏\"‏ فما يمنعكما أن تسلما ‏\"‏ ‏.‏ قالا إن داود دعا الله أن لا يزال في ذريته نبي وإنا نخاف إن أسلمنا أن تقتلنا اليهود ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Safwan bin 'Assal Al-Muradi:                     \"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet,\" for if he hears you calling him a Prophet then he will be happy.' So they went to the Prophet (ﷺ) to question him about Allah, the Most High, saying: And indeed we gave Musa nine clear signs (17:101). So the Messenger of Allah (ﷺ) said to them: 'Do not associate anything with Allah, nor commit unlawful intercourse, nor take a life which Allah has made prohibited, except for what is required (in the law), nor steal, nor practice magic, nor hasten to damage the reputation of an innocent person in front of a ruler, so that he will be killed, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march (i.e. flee from war).' - Shu'bah was in doubt - 'and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet and they said: 'We bear witness that you are a Prophet.' So he said: 'Then what prevents you from accepting Islam?' They said: 'Because Dawud supplicated to his Lord, that his offspring never be devoid of Prophets, and we feared that if we follow you then the Jews will kill us.'\"",
      "chain": [
        "30277",
        "20547",
        "20472",
        "20296",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هناد، وأحمد بن منيع، حدثنا أبو معاوية، حدثنا الأعمش، عن عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس، قال صعد رسول الله صلى الله عليه وسلم ذات يوم على الصفا فنادى ‏\"‏ يا صباحاه ‏\"‏ ‏.‏ فاجتمعت إليه قريش فقال ‏\"‏ إني نذير لكم بين يدى عذاب شديد أرأيتم لو أني أخبرتكم أن العدو ممسيكم أو مصبحكم أكنتم تصدقوني ‏\"‏ ‏.‏ فقال أبو لهب ألهذا جمعتنا تبا لك ‏.‏ فأنزل الله ‏:‏ ‏(‏ تبت يدا أبي لهب وتب ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas narrated:                     “One day the Messenger of Allah ascended As-Safa and called out: ‘O people! Come at once!’ So the Quraish gathered before him. He said: ‘I am a warner for you before the coming of a severe punishment. Do you think that if I informed you that the enemy was preparing to attack you in the evening or in the morning, would you believe me?’ So Abu Lahab said: ‘Is it for this that you gathered us? May you perish?’ So Allah, Blessed is He and Most High, revealed: Perish the hands of Abu Lahad, perish he.”",
      "chain": [
        "30480",
        "30242",
        "20354",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3482",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا يحيى بن آدم، عن أبي بكر بن عياش، عن الأعمش، عن عمرو بن مرة، عن عبد الله بن الحارث، عن زهير بن الأقمر، عن عبد الله بن عمرو، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من قلب لا يخشع ودعاء لا يسمع ومن نفس لا تشبع ومن علم لا ينفع أعوذ بك من هؤلاء الأربع ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي هريرة وابن مسعود ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن عمرو ‏.‏",
      "text_en": " Abdullah bin Amr narrated that:                     The Messenger of Allah used to say: “O Allah, I seek refuge in You from a heart that does not humble itself, and from a supplication that is not heard, and from a soul that is never satisfied, and from knowledge that does not benefit, I seek refuge in You from these four (Allahumma! Inna A’udhu Bika Min Qalbin La Yakhsha’u, Wa Min Du’a’in La Yusma’u, Wa Min Nafsin La Tashba’u, Wa Min Ilmin La Yanfa’u, A’udhu Bika Min Ha’ula’il-Arba).”",
      "chain": [
        "30216",
        "20364",
        "20373",
        "11060",
        "11381",
        "912",
        "29"
      ]
    },
    {
      "hadith_no": "3530",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، قال سمعت عبد الله بن مسعود، يقول قلت له أأنت سمعته من عبد الله، قال نعم ‏.‏ ورفعه أنه قال ‏\"‏ لا أحد أغير من الله ولذلك حرم الفواحش ما ظهر منها وما بطن ولا أحد أحب إليه المدح من الله ولذلك مدح نفسه ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح من هذا الوجه ‏.‏",
      "text_en": " Amr bin Murrah said:                     “I heard Abu Wa’il say: ‘Abdullah bin Mas’ud said’ and I said to him: ‘Did you hear it from Abdullah?’ He said: ‘Yes.’ And he narrated it in Marfu form that he said: ‘There is none with more Ghirah than Allah, and due to this He prohibited the lewd sins, that which is apparent of them and that which is hidden. And there is none to whom praise is more beloved than Allah, and due to this, He praised Himself.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن عمرو بن مرة، عن عبد الله بن الحارث، عن طليق بن قيس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يدعو يقول ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطواعا لك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي وسدد لساني واهد قلبي واسلل سخيمة صدري ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمود بن غيلان وحدثنا محمد بن بشر العبدي، عن سفيان الثوري، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Ibn Abbas said:                     “The Prophet used to supplicate, saying: “My Lord, aid me and do not aid against me, and grant me victory and do not grant victory over me, plot for me and do not plot against me, guide me and facilitate guidance for me, grant me victory over those who transgress against me. My Lord, make me ever-grateful to You, ever-remembering of You, ever-fearful of You, ever-obedient to You, ever-humble to You, oft-turning and returning to You. My Lord, accept my repentance, wash my sin, answer my call, make firm my proof, make firm my tongue, guide my heart, and remove the treachery of my chest (Rabbi A’inni Wa La Tu’in Alayya, Wansurni Wa La Tansur Alayya, Wahdini Wa Yassir Lil-Huda, Wansurni Ala Man Bagha Alayya. Rabbij’alni Laka Shakkaran, Laka Dhak-Karan, Laka Rahhaban, Laka Mitwa’an, Laka Mikhbitan, Ilaika Awwahan Muniba. Rabbi Taqabbal Tawbati, Waghsil Hawbati, Wa Ajib Da’wati, Wa Thab-bit Hujjati, Wa Saddid Lisani Wahdi Qalbi, Waslul Sakhimata Sadri).”",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11381",
        "912",
        "19870",
        "17"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن علي، قال كنت شاكيا فمر بي رسول الله صلى الله عليه وسلم وأنا أقول اللهم إن كان أجلي قد حضر فأرحني وإن كان متأخرا فارفعني وإن كان بلاء فصبرني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قال فأعاد عليه ما قال قال فضربه برجله فقال ‏\"‏ اللهم عافه أو اشفه ‏\"‏ ‏.‏ شعبة الشاك ‏.‏ فما اشتكيت وجعي بعد ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Ali said:                     “I was ill and the Messenger of Allah passed by me while I was saying: ‘O Allah, if  my term has come, then give me relief, and if it is coming later, then make my life more bountiful, and if it is a trial then make me patient (Allahumma, In Kana Ajali Qad Hadara Far’arihni, Wa In Kana Mata’akh-khiran Fa’arfighni, Wa In Kana Bala’an Fasabbirni).’ So the Messenger of Allah said: ‘What dod you say?’” He said: “So he repeated to him what he said.” He (one of the narrators) said: So he struck him with his foot and said: “O Allah, grant him health (Allahumma Afihi)” – or – “heal him (Ashfini).” – Shu’ba is the one who doubted. He said: “So I did not suffer from my ailment again.”",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11381",
        "5"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا عبد الله بن عبد القدوس، حدثنا الأعمش، عن عمرو بن مرة، عن عبد الله بن سلمة، عن عبيدة السلماني، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ يطلع عليكم رجل من أهل الجنة ‏\"‏ ‏.‏ فاطلع أبو بكر ثم قال ‏\"‏ يطلع عليكم رجل من أهل الجنة ‏\"‏ ‏.‏ فاطلع عمر ‏.‏ وفي الباب عن أبي موسى وجابر ‏.‏ قال هذا حديث غريب من حديث ابن مسعود ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Prophet (ﷺ) said: \"A man among the inhabitants of Paradise will appear before you.\" So Abu Bakr appeared. Then he said: \"A man among the inhabitants of Paradise will appear before you.\" So 'Umar appeared.",
      "chain": [
        "38495",
        "25147",
        "11060",
        "11381",
        "16"
      ]
    },
    {
      "hadith_no": "4100",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، رجل من الأنصار قال سمعت زيد بن أرقم، يقول أول من أسلم علي ‏.‏ قال عمرو بن مرة فذكرت ذلك لإبراهيم النخعي فأنكره وقال أول من أسلم أبو بكر الصديق ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حمزة اسمه طلحة بن زيد ‏.‏",
      "text_en": " Narrated A man from the Ansar:                     that Zaid bin Al-Arqam said: \"The first to accept Islam was 'Ali.\"'Amr bin Murrah said: \"So I mentioned that to Ibrahim An-Nakha'i, so he rejected that and said: 'The first to accept Islam was Abu Bakr As-Siddiq.'\"",
      "chain": [
        "30160",
        "30170",
        "20173",
        "20020",
        "11381",
        "384",
        "11381"
      ]
    },
    {
      "hadith_no": "4127",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا وهب بن جرير، حدثني أبي قال، سمعت الأعمش، يحدث عن عمرو بن مرة، عن أبي البختري، عن علي، أن النبي صلى الله عليه وسلم قال لعمر في العباس ‏\"‏ إن عم الرجل صنو أبيه ‏\"‏ ‏.‏ وكان عمر كلمه في صدقته ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Ali:                     that concerning Al-'Abbas, the Prophet (ﷺ) said to 'Umar: \"Indeed, the uncle of a man is the Sinw of his father.\" And 'Umar had spoken to him concerning his charity.",
      "chain": [
        "30494",
        "20298",
        "11272",
        "11060",
        "11381",
        "11347",
        "5"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل بن إبراهيم، عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، قال أتيت عليا أنا ورجلان، فقال كان رسول الله صلى الله عليه وسلم يخرج من الخلاء فيقرأ القرآن ويأكل معنا اللحم ولم يكن يحجبه عن القرآن شىء ليس الجنابة ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Salimah said:                      \"I came to 'Ali with two other men and he said: 'The Messenger of Allah (ﷺ) used to come out of the toilet and recite Qur'an, and he would eat meat with us and nothing would prevent him from (reciting) Qur'an except Janabah.\"",
      "chain": [
        "20387",
        "20208",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن أحمد أبو يوسف الصيدلاني الرقي، قال حدثنا عيسى بن يونس، قال حدثنا الأعمش، عن عمرو بن مرة، عن عبد الله بن سلمة، عن علي، قال كان رسول الله صلى الله عليه وسلم يقرأ القرآن على كل حال ليس الجنابة ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"The Messenger of Allah (ﷺ) used to recite Qur'an in all circumstances except when he was Junub.\"",
      "chain": [
        "20347",
        "11060",
        "11381",
        "5"
      ]
    },
    {
      "hadith_no": "885",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني محمد بن وهب، قال حدثنا محمد بن سلمة، عن أبي عبد الرحيم، قال حدثني زيد، - هو ابن أبي أنيسة - عن عمرو بن مرة، عن عون بن عبد الله، عن عبد الله بن عمر، قال قام رجل خلف نبي الله صلى الله عليه وسلم فقال الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ من صاحب الكلمة ‏\"‏ فقال رجل أنا يا نبي الله ‏.‏ فقال ‏\"‏ لقد ابتدرها اثنا عشر ملكا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Umar that:                     A man stood behind the Prophet of Allah (ﷺ) and said: \"Allahu Akbaru kabira wal-hamdu Lillahi kathira, wa subhan-Allahi bukratan was asila (Allah is Most Great and much praise be to Allah and glorified be Allah at the beginning and end of the day).\" The Prophet of Allah (ﷺ) said: \"Who spoke these words?\" A man said: \"I did, O Prophet of Allah (SWT).\" He said: \"Twelve angels rushed (to take them up).\"",
      "chain": [
        "20672",
        "11340",
        "11381",
        "10806",
        "18"
      ]
    },
    {
      "hadith_no": "1005",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، يقول قال رجل عند عبد الله قرأت المفصل في ركعة ‏.‏ قال هذا كهذ الشعر لقد عرفت النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن ‏.‏ فذكر عشرين سورة من المفصل سورتين سورتين في ركعة ‏.‏",
      "text_en": " It was narrated that 'Amr bin Murrah said:                     \"I heard Abu Wa'il say: \"A man said in the presence of Abdullah: 'I recited Al-Mufassal in one rak'ah.' He said: 'That is like reciting poetry. I know the similar surahs that the Messenger of Allah (ﷺ) used to recite together.' And he mentioned twenty surahs from Al-Mufassal, two by two in each rak'ah.\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11353"
      ]
    },
    {
      "hadith_no": "1009",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن آدم، عن حفص بن غياث، عن العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، والأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي صلى الله عليه وسلم قرأ البقرة وآل عمران والنساء في ركعة لا يمر بآية رحمة إلا سأل ولا بآية عذاب إلا استجار ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Prophet (ﷺ) recited Surat Al-Baqarah, Al 'Imran and An-Nisa' in one rak'ah, and he did not reach any verse that spoke of mercy but he asked Allah for it, nor any verse that spoke of punishment but he asked Allah for protection therefrom.",
      "chain": [
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1069",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا يزيد بن زريع، قال حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، عن رجل، من بني عبس عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم ذات ليلة فسمعه حين كبر قال ‏\"‏ الله أكبر ذا الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ وإذا رفع رأسه من الركوع قال ‏\"‏ لربي الحمد لربي الحمد ‏\"‏ ‏.‏ وفي سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ وبين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ وكان قيامه وركوعه ‏.‏ وإذا رفع رأسه من الركوع وسجوده وما بين السجدتين قريبا من السواء ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed with the Messenger of Allah (ﷺ) one night and he heard him say when he said the takbir: \"Allahu Akbara dhal-jabaruti wal-malakuti wal-kibriya'i wal-'azamah (Allah is Most Great, the One Who has all power, sovereignty, magnificence and might.)\" When bowing he would say: \"Subhana Rabbial-'Azim (Glory be to my Lord Almighty).\" When he raised his head from bowing he would say: \"Lirabbil-hamd, Lirabbil-hamd (To my Lord be praise, to my Lord be praise).\" And when he prostrated (he said): \"Subhana Rabbial-A'la (Glory be to my Lord Most High).\" And between the two prostrations (he said): \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me).\" His standing, his bowing, when he raised his head from bowing, his prostration and the time between the two prostrations, were almost the same.",
      "chain": [
        "30430",
        "20304",
        "20020",
        "11381",
        "20458",
        "145"
      ]
    },
    {
      "hadith_no": "1076",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن عبد الرحمن، عن سفيان، وشعبة، عن عمرو بن مرة، ح وأخبرنا عمرو بن علي، قال حدثنا يحيى، عن شعبة، وسفيان، قالا حدثنا عمرو بن مرة، عن ابن أبي ليلى، عن البراء بن عازب، أن النبي صلى الله عليه وسلم كان يقنت في الصبح والمغرب ‏.‏ وقال عبيد الله أن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Al-Bara' bin 'Azib that:                     The Prophet (ﷺ) used to say the Qunut in Subh and Maghrib. (One of the narrators) 'Ubaidullah said: \"Allah's Messenger (ﷺ) used to.\"",
      "chain": [
        "30359",
        "20033",
        "20012",
        "20020",
        "11381",
        "30153",
        "20031",
        "20020",
        "20005",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1145",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، سمعه يحدث، عن رجل، من عبس عن حذيفة، أنه انتهى إلى النبي صلى الله عليه وسلم فقام إلى جنبه فقال ‏\"‏ الله أكبر ذو الملكوت والجبروت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم قرأ بالبقرة ثم ركع فكان ركوعه نحوا من قيامه فقال في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ وقال حين رفع رأسه ‏\"‏ لربي الحمد لربي الحمد ‏\"‏ ‏.‏ وكان يقول في سجوده ‏\"‏ سبحان ربي الأعلى سبحان ربي الأعلى ‏\"‏ ‏.‏ وكان يقول بين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏",
      "text_en": " A man from (the tribe of) 'Abs narrated from Hudhaifah that:                     He came to the Prophet (ﷺ) and stood by his side, and he said: \"Allahu Akbar Dhul-malakut wal-jabarut wal-kibriya' wal 'azamah (Allah is Most Great, the One Who has all sovereignty, power, magnificence, and might.)\" Then he recited Al-Baqarah, then he bowed, and his bowing lasted almost as long as his standing, and he said when bowing: 'Subahana Rabbial-'azim, Subhana Rabbial-'azim (Glory be to my Lord Almighty, Glory be to my Lord Almighty).\" When he raised his head he said: \"Li Rabbial-hamd, Li Rabbial-hamd (To my Lord be praise, to my Lord be praise).\" And when he prostrated he said: \"Subahana Rabbial-A'la, Subahna Rabbial-A'la (Glory be to my Lord Most High, glory be to my Lord Most High).\" And between the two prostrations he would say: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me).\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11381",
        "20458",
        "145"
      ]
    },
    {
      "hadith_no": "1287",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، من كتابه قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال ابن أبي ليلى ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن حدثنا به من كتابه وهذا خطأ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"We said: 'O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?' He said: \"Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) Ibn Abi Laila said: \"We used to say: 'And also upon us.'\" Abu Abdur-Rahman (An-Nasa'I) said: It was narrated from his book, and this is a mistake.",
      "chain": [
        "36617",
        "20315",
        "20320",
        "11060",
        "11381",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن منصور، عن عمرو بن مرة، عن أبي عبيدة، عن كعب بن عجرة، قال دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا يخطب قاعدا وقد قال الله عز وجل ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said that:                     He entered the masjid and 'Abdur-Rahman bin Umm Al-Hakam was delivering the Khutbah while seated. \"He said: 'Look at this man who is delivering the khutbah while seated when Allah (SWT) says: And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.'\"",
      "chain": [
        "20173",
        "20020",
        "11067",
        "11381",
        "10",
        "4052"
      ]
    },
    {
      "hadith_no": "1665",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن محمد المروزي، - ثقة - قال حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد الأنصاري، عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم في رمضان فركع فقال في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ مثل ما كان قائما ثم جلس يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ مثل ما كان قائما ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ مثل ما كان قائما فما صلى إلا أربع ركعات حتى جاء بلال إلى الغداة ‏.‏ قال أبو عبد الرحمن هذا الحديث عندي مرسل وطلحة بن يزيد لا أعلمه سمع من حذيفة شيئا وغير العلاء بن المسيب قال في هذا الحديث عن طلحة عن رجل عن حذيفة ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed with the Messenger of Allah during Ramadan. He bowed and said: \"Subhana Rabbiyal-Azim while bowing, for as long as he had stood. Then he sat down and said: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me),\" for as long as he had stood. Then he prostrated and said: \"Subhana Rabbiyal-'Ala for as long as he had stood And he prayed no more than four rak'ahs when Bilal came for Al-Ghadah.",
      "chain": [
        "30123",
        "28603",
        "11647",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏ خالفه عمارة بن عمير فرواه عن يحيى بن الجزار عن عائشة ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, and when he grew older and weaker he prayed witr with nine.\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "1727",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, but when he grew older and weaker he prayed witr with nine.\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "1921",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد بن عبادة بالقادسية فمر عليهما بجنازة فقاما فقيل لهما إنها من أهل الأرض ‏.‏ فقالا مر على رسول الله صلى الله عليه وسلم بجنازة فقام فقيل له إنه يهودي ‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abi Laila said:                     \"Sahl bin Hunaif and Qais bin Sa'd bin 'Ubadah were in Al-Qadisiyyah when a funeral passed by them, so they stood up and it was said to them: 'It is one of the local people.' They said: 'A funeral passed the Messenger of Allah and he stood up, and it was said to him: It Is a Jew. He said: 'Is it not a soul?\"'",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1982",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثني عمرو بن مرة، عن ابن أبي ليلى، أن زيد بن أرقم، صلى على جنازة فكبر عليها خمسا وقال كبرها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Abu Laila:                     That Zaid bin Arqam offered the funeral prayer and said the Takbir five times, and said that the Messenger of Allah had said the Takbir like this.",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1985",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت عمرو بن ميمون، يحدث عن عبد الله بن ربيعة السلمي، وكان، من أصحاب رسول الله صلى الله عليه وسلم عن عبيد بن خالد السلمي أن رسول الله صلى الله عليه وسلم آخى بين رجلين فقتل أحدهما ومات الآخر بعده فصلينا عليه فقال النبي صلى الله عليه وسلم ‏\"‏ ما قلتم ‏\"‏ ‏.‏ قالوا دعونا له اللهم اغفر له اللهم ارحمه اللهم ألحقه بصاحبه فقال النبي صلى الله عليه وسلم ‏\"‏ فأين صلاته بعد صلاته وأين عمله بعد عمله فلما بينهما كما بين السماء والأرض ‏\"‏ ‏.‏ قال عمرو بن ميمون أعجبني لأنه أسند لي ‏.‏",
      "text_en": " It was narrated from 'Amr bin Maimun from \"Abdullah bin Rubayy'ah As-Sulami, who was also one of the Companions of Allah's Messenger from 'Ubaid bin Khalid As-Sulami, that:                     the Messenger of Allah established the bond of brotherhood between two men. One of them was killed and the other died after him. We offered the funeral prayer for him, and the Prophet said: \"What did you say?\" They said: \"O Allah, forgive him; O Allah, have mercy on him; O Allah, join him with his companion.\" The Prophet said: \"Where is his Salah in comparison to his companion's Salah? Where are his deeds in comparison to his companion's deeds? Indeed the difference between heaven and Earth.\" (One of narrators) 'Amr bin Maimun Said: \"I was happy with that because he raised it for me.\"",
      "chain": [
        "38265",
        "20025",
        "20020",
        "11381",
        "11382"
      ]
    },
    {
      "hadith_no": "2459",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال عمرو بن مرة أخبرني قال سمعت عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Awfa said:                     \"When people brought their Zakah to him, the Messenger of Allah would say: 'O Allah, send salah upon the family of so-and-so,' My father brought his Sadaqah to him and he said: 'O Allah, send Salah upon the family of Abu Awfa.\"'",
      "chain": [
        "20214",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "2486",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا إدريس الأودي، عن عمرو بن مرة، عن أبي البختري، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     The Messenger of Allah said: \"No Sadaqah is due on less than five Awaq.\"",
      "chain": [
        "20032",
        "11381",
        "11347",
        "38"
      ]
    },
    {
      "hadith_no": "2539",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، يحدث عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تصدقت المرأة من بيت زوجها كان لها أجر وللزوج مثل ذلك وللخازن مثل ذلك ولا ينقص كل واحد منهما من أجر صاحبه شيئا للزوج بما كسب ولها بما أنفقت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                     \"When a woman give charity from her husband's house, she will have a reward, and her husband will have a similar reward, and the storekeeper will have a similar reward, without the reward of any of them detracting from the reward of the others in the slightest. The husband will be rewarded for what he earned and she will be rewarded for what she spent.\"",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11353",
        "53"
      ]
    },
    {
      "hadith_no": "2553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أنبأنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، أن عمرو بن مرة، حدثهم عن خيثمة، عن عدي بن حاتم، قال ذكر رسول الله صلى الله عليه وسلم النار فأشاح بوجهه وتعوذ منها ذكر شعبة أنه فعله ثلاث مرات - ثم قال ‏\"‏ اتقوا النار ولو بشق التمرة فإن لم تجدوا فبكلمة طيبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"The Messenger of Allah mentioned the Fire, and he turned his face away (as if seeing it), and sought refuge with Allah from it.\" (One of the narrators) Shu'bah said: \"He did that three times, then he said: 'Protect yourselves from the Fire even with half a date, and if you cannot find that, then with a good word.\"'",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن داود المصيصي، قال حدثنا يحيى بن محمد بن سابق، قال حدثنا أبو أسامة، قال حدثنا عبد السلام، عن الدالاني، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أخيه، قال حدثني ابن أبي ربيعة، عن حفصة بنت عمر، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يبعث جند إلى هذا الحرم فإذا كانوا ببيداء من الأرض خسف بأولهم وآخرهم ولم ينج أوسطهم ‏\"‏ ‏.‏ قلت أرأيت إن كان فيهم مؤمنون قال ‏\"‏ تكون لهم قبورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hafshah bint Umar said:                     \"The Messenger of Allah sadi: 'An army will be sent toward this House, and when they are in Al-Baida, they first and the last of them will be swallowed up by the earth, and those in the middle will be saved.' I said: \"What if there are believers among them?\" He said: 'It will be graves for them.'\" (Daif)",
      "chain": [
        "38505",
        "35172",
        "20318",
        "11381",
        "11342",
        "15158",
        "54"
      ]
    },
    {
      "hadith_no": "3136",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، أن عمرو بن مرة، أخبرهم قال سمعت أبا وائل، قال حدثنا أبو موسى الأشعري، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال الرجل يقاتل ليذكر ويقاتل ليغنم ويقاتل ليرى مكانه فمن في سبيل الله قال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Al-Ash'ari said:                      \"A Bedouin came to the Messenger of Allah (ﷺ) and said: 'A man fights for fame, or he fights for the spoils of war, or he fights to show off. Who is the one who is fighting in the cause of Allah?' He said: 'The one who fights so that the word of Allah will be supreme is the one who is fighting in the cause of Allah, the Mighty and Sublime.'\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "3144",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، قال حدثنا الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن شرحبيل بن السمط، قال لكعب بن مرة يا كعب حدثنا عن رسول الله صلى الله عليه وسلم واحذر ‏.‏ قال سمعته يقول ‏\"‏ من شاب شيبة في الإسلام في سبيل الله كانت له نورا يوم القيامة ‏\"‏ ‏.‏ قال له حدثنا عن النبي صلى الله عليه وسلم واحذر ‏.‏ قال سمعته يقول ‏\"‏ ارموا من بلغ العدو بسهم رفعه الله به درجة ‏\"‏ ‏.‏ قال ابن النحام يا رسول الله وما الدرجة قال ‏\"‏ أما إنها ليست بعتبة أمك ولكن ما بين الدرجتين مائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Shurahbil bin As-Simt said to Ka'b bin Murrah:                      \"O Ka'b! Tell us a Hadith from the Messenger of Allah (ﷺ) and be careful.\" He said: \"I heard him say: 'Whoever develops one gray hair in Islam, in the cause of Allah, it will be light for him on the Day of Resurrection.'\" He said to him: \"Tell us about the Prophet (ﷺ) and be careful.\" He said: \"I heard him say: 'Shoot, and whoever hits the enemy with an arrow, Allah will raise him one degree in status thereby.'\" Ibn An-Nahhan said: 'O Messenger of Allah, what is a degree?' He said: 'It is not like the doorstep of your mother; [1] rather (the distance) between two degrees is (that if) a hundred years.'\"[1] As explained after it; the degree of distance is greater than such a degree in this world.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11342",
        "6225"
      ]
    },
    {
      "hadith_no": "3785",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن عمرو، مولى الحسن بن علي يحدث عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأت الذي هو خير وليكفر عن يمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"The Messenger of Allah said: 'Whoever swears an oath, then sees something better than it, let him do that which is better and offer expiation for his oath.'\"",
      "chain": [
        "30313",
        "20033",
        "20020",
        "11381",
        "212"
      ]
    },
    {
      "hadith_no": "3947",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن عمرو بن مرة، ‏{‏ عن مرة، ‏}‏ عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet said:                      \"The superiority of 'Aishah to other women is like the superiority of Tharid to other kinds of food.\"",
      "chain": [
        "34033",
        "20212",
        "20020",
        "11381",
        "41"
      ]
    },
    {
      "hadith_no": "4072",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن العلاء، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أبي برزة، قال تغيظ أبو بكر على رجل فقلت من هو يا خليفة رسول الله قال لم قلت لأضرب عنقه إن أمرتني بذلك ‏.‏ قال أفكنت فاعلا قلت نعم ‏.‏ قال فوالله لأذهب عظم كلمتي التي قلت غضبه ثم قال ما كان لأحد بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"Abu Bakr got infuriated with a man, and I said: 'Who is he, O Khalifah of the Messenger of Allah?' He said: 'Why?' I said: 'So that I might strike his neck (killing him) if you tell me to.' He said: 'Would you really do that?' I said: 'Yes. By Allah,' the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad [SAW].'\"",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11342",
        "227"
      ]
    },
    {
      "hadith_no": "4073",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يعلى، قال حدثنا الأعمش، عن عمرو بن مرة، عن أبي البختري، عن أبي برزة، قال مررت على أبي بكر وهو متغيظ على رجل من أصحابه فقلت يا خليفة رسول الله من هذا الذي تغيظ عليه قال ولم تسأل قلت أضرب عنقه ‏.‏ قال فوالله لأذهب عظم كلمتي غضبه ثم قال ما كانت لأحد بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"I passed by Abu Bakr and he was furious with one of his companions. I said: 'O Khalifah of the Messenger of Allah, who is the one with whom you are furious?' He said: 'Why are you asking about him?' I said: 'I will strike his neck (kill him).' By Allah, the seriousness of what I said took away his anger. Then he said: 'That is not for anyone after Muhammad [SAW].'\"",
      "chain": [
        "30002",
        "20372",
        "11060",
        "11381",
        "11347",
        "227"
      ]
    },
    {
      "hadith_no": "4074",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى بن حماد، قال حدثنا أبو عوانة، عن سليمان، عن عمرو بن مرة، عن أبي البختري، عن أبي برزة، قال تغيظ أبو بكر على رجل فقال لو أمرتني لفعلت ‏.‏ قال أما والله ما كانت لبشر بعد محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah said:                     \"Abu Bakr became infuriated with a man.\" He said: \"If you tell me to, I will do it.\" He said: \"By Allah, that is not for any human being after Muhammad [SAW].\"",
      "chain": [
        "30170",
        "20574",
        "20469",
        "11060",
        "11381",
        "11347",
        "227"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا معاوية بن صالح الأشعري، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن أبي نضرة، عن أبي برزة، قال غضب أبو بكر على رجل غضبا شديدا حتى تغير لونه قلت يا خليفة رسول الله والله لئن أمرتني لأضربن عنقه فكأنما صب عليه ماء بارد فذهب غضبه عن الرجل ‏.‏ قال ثكلتك أمك أبا برزة وإنها لم تكن لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب أبو نصر واسمه حميد بن هلال خالفه شعبة ‏.‏",
      "text_en": " It was narrated from Abu Nadrah, that Abu Barzah said:                     \"Abu Bakr got very angry with a man, so much so that his color changed. I said: 'O Khalifah of the Messenger of Allah, if you tell me to, I will strike his neck (kill him).' It was as if cold water had been poured on him and he became calm. He said: 'May your mother be bereft of you, Abu Barzah! That is not for anyone after the Messenger of Allah [SAW].'\"",
      "chain": [
        "37535",
        "108",
        "11201",
        "15",
        "11381",
        "10721",
        "227"
      ]
    },
    {
      "hadith_no": "4076",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن المثنى، عن أبي داود، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا نصر، يحدث عن أبي برزة، قال أتيت على أبي بكر وقد أغلظ لرجل فرد عليه فقلت ألا أضرب عنقه فانتهرني ‏.‏ فقال إنها ليست لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن أبو نصر حميد بن هلال ‏.‏ ورواه عنه يونس بن عبيد فأسنده ‏.‏",
      "text_en": " Abu Nasr narrated from Abu Barzah, that he said:                     \"I came to Abu Bakr when he had spoken harshly to a man who had answered back. I said: 'Shall I not strike his neck (kill him)?' He rebuked me, and said: 'That is not for anyone after the Messenger of Allah [SAW].'\"",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11381",
        "227"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن العلاء، عن ابن إدريس، قال أنبأنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، قال قال يهودي لصاحبه اذهب بنا إلى هذا النبي ‏.‏ قال له صاحبه لا تقل نبي لو سمعك كان له أربعة أعين ‏.‏ فأتيا رسول الله صلى الله عليه وسلم وسألاه عن تسع آيات بينات فقال لهم ‏\"‏ لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تمشوا ببريء إلى ذي سلطان ولا تسحروا ولا تأكلوا الربا ولا تقذفوا المحصنة ولا تولوا يوم الزحف وعليكم خاصة يهود أن لا تعدوا في السبت ‏\"‏ ‏.‏ فقبلوا يديه ورجليه وقالوا نشهد أنك نبي ‏.‏ قال ‏\"‏ فما يمنعكم أن تتبعوني ‏\"‏ ‏.‏ قالوا إن داود دعا بأن لا يزال من ذريته نبي وإنا نخاف إن اتبعناك أن تقتلنا يهود ‏.‏",
      "text_en": " It was narrated that Safwan bin 'Assal said:                     \"A Jew said to his companion: 'Let us go to this Prophet.' His companion said to him: 'Do not say Prophet; if he hears you, he will become big-headed.' So they came to the Messenger of Allah [SAW] and asked him about nine clear signs. He said to them: 'Do not associate anything with Allah, do not steal, do not commit adultery, do not kill any soul whom Allah has forbidden you to kill, except by right, do not speak falsely about an innocent man before a ruler, do not engage in magic, do not consume Riba (usury), do not slander chaste women, and do not flee on the day of the march (to battle). And for you Jews especially, do not break the Sabbath.' They kissed his hands and feet and said: 'We bear witness that you are a Prophet.' He said: 'What is keeping you from following me?' They said: 'Dawud prayed that there would always be a Prophet among his descendants, and we are afraid that if we follow you, the Jews will kill us.'\"",
      "chain": [
        "30216",
        "20102",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "4165",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن الحارث، عن أبي كثير، عن عبد الله بن عمرو، قال قال رجل يا رسول الله أى الهجرة أفضل قال ‏\"‏ أن تهجر ما كره ربك عز وجل ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ الهجرة هجرتان هجرة الحاضر وهجرة البادي فأما البادي فيجيب إذا دعي ويطيع إذا أمر وأما الحاضر فهو أعظمهما بلية وأعظمهما أجرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"A man said: 'O Messenger of Allah! Which emigration (Hijrah) is best?' He said: 'To leave what your Lord, the Mighty and Sublime, dislikes.' He said: 'There are two kinds of emigration, the emigration of the town dweller and the emigration of the Bedouin. As for the Bedouin, when he is called (to fight in Jihad) he must respond, and he must obey when he is commanded, and as for the town dweller, he is the one who is more severely tested and more greatly rewarded.\"'",
      "chain": [
        "20173",
        "20020",
        "11381",
        "912",
        "29"
      ]
    },
    {
      "hadith_no": "5097",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن وهب، قال حدثنا مسكين بن بكير، قال حدثنا شعبة، عن عمرو بن مرة، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Shaibah, that 'Aishah said:                     \"The Messenger of Allah [SAW] said: 'May Allah curse the woman who affixes hair extensions and the woman who has that done.'\"",
      "chain": [
        "20463",
        "20020",
        "11381",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5246",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، عن محمد بن جعفر، قال حدثنا شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال قدم معاوية المدينة فخطبنا وأخذ كبة من شعر قال ما كنت أرى أحدا يفعله إلا اليهود وإن رسول الله صلى الله عليه وسلم بلغه فسماه الزور ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"Mu'awiyah came to Al-Madinah and addressed us. He took hold of a hairpiece and said: 'I never used to see anyone do this except the Jews. The Messenger of Allah [SAW] heard of it and he called it \"giving a false impression.\"",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "5534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني العلاء بن هلال، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن القاسم بن عبد الرحمن، عن مسروق بن الأجدع، عن عائشة، قالت طلبت رسول الله صلى الله عليه وسلم ذات ليلة في فراشي فلم أصبه فضربت بيدي على رأس الفراش فوقعت يدي على أخمص قدميه فإذا هو ساجد يقول ‏\"‏ أعوذ بعفوك من عقابك وأعوذ برضاك من سخطك وأعوذ بك منك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I looked for the Messenger of Allah [SAW] one night in my bed, and I did not find him. I struck my hand on the head of the bed, and my hand fell on the soles of his feet. He was prostrating and saying: 'A'udhu bi 'afwika min 'iqabika, wa a'udhu bi ridaka min sakhatika, wa a'udhu bika minka (I seek refuge in Your forgiveness from Your punishment, and I seek refuge in Your pleasure from Your wrath, and I seek refuge in You from You.)'\"",
      "chain": [
        "38088",
        "28464",
        "11201",
        "15",
        "11381",
        "19896",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5645",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني عمرو بن مرة، قال سمعت زاذان، قال سألت عبد الله بن عمر قلت حدثني بشىء، سمعته من، رسول الله صلى الله عليه وسلم في الأوعية وفسره قال نهى رسول الله صلى الله عليه وسلم عن الحنتم وهو الذي تسمونه أنتم الجرة ونهى عن الدباء وهو الذي تسمونه أنتم القرع ونهى عن النقير وهي النخلة ينقرونها ونهى عن المزفت وهو المقير ‏.‏",
      "text_en": " Zadan said:                     \"I asked 'Abdullah bin 'Umar: 'Tell me of something that you heard from the Messenger of Allah [SAW] concerning vessels and explain it.' He said: 'The Messenger of Allah [SAW] forbade Al-Hantam, which are what you call earthenware jars. And he forbade Ad-Dubba' which are what you call squash. And he forbade An-Naqir, which are hollowed-out date palm wood. And he forbade Al-Muzaffat which are (Al-Muqayyar) vessels daubed with tar.'\"",
      "chain": [
        "20214",
        "20020",
        "11381",
        "10911",
        "18"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن شعبة، عن عمرو بن مرة، عن أبي البختري، عن أبي عبد الرحمن السلمي، عن علي بن أبي طالب، قال إذا حدثتكم عن رسول الله  صلى الله عليه وسلم  بحديث فظنوا به الذي هو أهناه وأهداه وأتقاه ‏.‏",
      "text_en": " It was narrated that Ali bin Abu Talib said :                     \"When I narrate a Hadith from the Messenger of Allah (ﷺ), to you, then think  of him as being the best, the most rightly guided and the one with the utmost Taqwa (piety, righteousness)\"",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11381",
        "11347",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "23",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "قال أبو الحسن حدثنا يحيى بن عبد الله الكرابيسي، حدثنا علي بن الجعد، عن شعبة، عن عمرو بن مرة، مثل حديث علي رضى الله تعالى عنه ‏.‏",
      "text_en": "",
      "chain": [
        "20386",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال قلنا لزيد بن أرقم حدثنا عن رسول الله  صلى الله عليه وسلم  ‏.‏ قال كبرنا ونسينا والحديث عن رسول الله  صلى الله عليه وسلم  شديد ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abi Laila said:                     We said to Zaid bin Arqam: 'Tell us a Hadith from the Messenger of Allah (ﷺ).' He said: 'We have grown old and have forgotten, and (narrating) Ahadith from the Messenger of Allah (ﷺ) is difficult (not a simple matter).'\"",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30160",
        "20033",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "111",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، قال سمعت عليا، يقول خير الناس بعد رسول الله  صلى الله عليه وسلم  أبو بكر وخير الناس بعد أبي بكر عمر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Salimah said:                     \"I heard 'Ali say: 'The best of people after the Messenger of Allah is Abu Bakr, and the best of people after Abu Bakr is 'Umar.'\"",
      "chain": [
        "38409",
        "20032",
        "20020",
        "11381",
        "5"
      ]
    },
    {
      "hadith_no": "200",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قام فينا رسول الله  صلى الله عليه وسلم  بخمس كلمات فقال ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه يرفع إليه عمل الليل قبل عمل النهار وعمل النهار قبل عمل الليل حجابه النور لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah stood up among us and said five things. He said: 'Allah does not sleep, and it is not befitting that He should sleep. He lowers the Scales and raises them. The deed done during the day is taken up to Him before the deed done during the night, and the deed done during the night before the deed done during the day. His Veil is Light, and if He were to remove it, the glory of his Face would burn everything of His creation, as far as His gaze reaches.'\"",
      "chain": [
        "38409",
        "20354",
        "11060",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "hadith_no": "201",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا المسعودي، عن عمرو بن مرة، عن أبي عبيدة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله لا ينام ولا ينبغي له أن ينام يخفض القسط ويرفعه حجابه النور لو كشفها لأحرقت سبحات وجهه كل شىء أدركه بصره ‏\"‏ ‏.‏ ثم قرأ أبو عبيدة ‏{أن بورك من في النار ومن حولها وسبحان الله رب العالمين}‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah said: 'Allah does not sleep, and it is not befitting that He should sleep. He lowers the Scales and raises them. His Veil is Light, and if He were to remove it, the glory of his Face would burn everything of His creation, as far as His gaze reaches.' \" Then Abu 'Ubaidah recited the verse: 'Blessed is whosoever is in the fire, (i.e. the light of Allah) and whosoever is round about it! And Glorified is Allah, the Lord of all that exists.\"",
      "chain": [
        "38409",
        "20032",
        "20724",
        "11381",
        "10",
        "41"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، قال دخلت على علي بن أبي طالب فقال كان رسول الله  صلى الله عليه وسلم  يأتي الخلاء فيقضي الحاجة ثم يخرج فيأكل معنا الخبز واللحم ويقرأ القرآن ولا يحجبه - وربما قال ولا يحجزه - عن القرآن شىء إلا الجنابة ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Salamah said:                     \"I entered upon 'Ali bin Abu Talib and he said: 'The Messenger of Allah used to go to the lavatory and relieve himself, then come out, and he would eat bread and meat with us and recite Qur'an, nothing stopped him' or perhaps he said: 'prevented him from doing so except sexual impurity.'\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "856",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عاصم العنزي، عن ابن جبير بن مطعم، عن أبيه، قال رأيت رسول الله  صلى الله عليه وسلم  حين دخل في الصلاة قال ‏\"‏ الله أكبر كبيرا الله أكبر كبيرا - ثلاثا - الحمد لله كثيرا الحمد لله كثيرا - ثلاثا - سبحان الله بكرة وأصيلا - ثلاث مرات - اللهم إني أعوذ بك من الشيطان الرجيم من همزه ونفخه ونفثه ‏\"‏ ‏.‏ قال عمرو همزه الموتة ونفثه الشعر ونفخه الكبر ‏.‏",
      "text_en": " It wasnarrated from Ibn Jubair bin Mut’im that his father said:                      “Isawthe Messenger of Allah (ﷺ) when he started the prayer. He said:‘Allahu Akbaru kabiran, Allahu Akbaru kabiran (Allah is the MostGreatindeed),’ three times; ‘Al-hamdu Lillahi kathiran, al-hamduLillahikathiran (Much praise is to Allah),’ three times; ‘SubhanAllahibukratan wa asilan (Glory is to Allah morning and evening),’threetimes; ‘Allahumma inni a’udhu bika minash-Shaitanir-rajim,min hamzihiwa nafkhihi wa nafthihi (O Allah, I seek refuge in Youfrom theaccursed Satan, from his madness, his poetry, and hispride).”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا حفص بن غياث، حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، ح وحدثنا علي بن محمد، حدثنا حفص بن غياث، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي  صلى الله عليه وسلم  كان يقول بين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah that the Prophet (ﷺ) used to saybetweenthe two prostrations:                      “Rabbighfir li, Rabbighfir li (O Lordforgiveme, O Lord forgive me).”",
      "chain": [
        "38409",
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "38409",
        "20317",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1041",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن إسماعيل، حدثنا عمرو بن علي، حدثنا يحيى، حدثنا شعبة، حدثنا عمرو بن مرة، عن سعيد بن المسيب، قال حدث عثمان بن أبي العاص، أن آخر، ما قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أممت قوما فأخف بهم ‏\"‏ ‏.‏",
      "text_en": " ‘Uthmanbin Abul-‘As narrated that the last thing the Messenger ofAllah(ﷺ) enjoined on him was that he said:                      “When you lead people,keepit short for them.”",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11381",
        "11002",
        "3210"
      ]
    },
    {
      "hadith_no": "1225",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، عن الأعمش، عن عمرو بن مرة، عن أبي عبيدة، عن عبد الله بن مسعود، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الله وتر يحب الوتر فأوتروا يا أهل القرآن ‏\"‏ ‏.‏ فقال أعرابي ما يقول رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ليس لك ولا لأصحابك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Allah is Witr and He loves the odd (numbered), so perform Witr,Opeople of the Qur’an.” A Bedouin said: ‘What is the MessengerofAllah (ﷺ) saying?’ He said: ‘That is not for you or yourcompanions.’”",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11381",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "1328",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن شرحبيل بن السمط، أنه قال لكعب يا كعب بن مرة حدثنا عن رسول الله  صلى الله عليه وسلم  واحذر ‏.‏ قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله استسق الله فرفع رسول الله  صلى الله عليه وسلم  يديه فقال ‏\"‏ اللهم اسقنا غيثا مريئا مريعا طبقا عاجلا غير رائث نافعا غير ضار ‏\"‏ ‏.‏ قال فما جمعوا حتى أجيبوا ‏.‏ قال فأتوه فشكوا إليه المطر فقالوا يا رسول الله تهدمت البيوت ‏.‏ فقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏ ‏.‏ قال فجعل السحاب ينقطع يمينا وشمالا ‏.‏",
      "text_en": " It wasnarrated from Shurahbil bin Simt that he said to Ka’b:                      “O Ka’bbin Murrah, narrate to us a Hadith from the Messenger of Allah (ﷺ),but be careful.” He said: “A man came to the Prophet (ﷺ) andsaid:‘O Messenger of Allah, ask Allah for rain!’ So theMessenger of Allah(ﷺ) raised his hands and said: ‘O Allah! Sendwholesome, productiverain upon all of us, sooner rather than later,beneficial and notharmful.’ No sooner had they finished performingFriday (prayer) butthey were revived. Then they came to him andcomplained to him aboutthe rain, saying: ‘O Allah, around us andnot upon us.’ Then theclouds began to disperse right and left.”",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11342",
        "6225"
      ]
    },
    {
      "hadith_no": "1572",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا يحيى بن حكيم، حدثنا ابن أبي عدي، وأبو داود عن شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال كان زيد بن أرقم يكبر على جنائزنا أربعا وأنه كبر على جنازة خمسا فسألته فقال كان رسول الله  صلى الله عليه وسلم  يكبرها ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Abi Laila said:                      “Zaid binArqanused to say the Takbir four times in the funeral prayer, and hesaidthe Takbir five times for one funeral. I asked him (about that)andhe said: ‘The Messenger of Allah (ﷺ) used to do that.’”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "34280",
        "20276",
        "20547",
        "20020",
        "11381",
        "11196",
        "384"
      ]
    },
    {
      "hadith_no": "1868",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن أبي أوفى، يقول كان رسول الله  صلى الله عليه وسلم  إذا أتاه الرجل بصدقة ماله صلى عليه فأتيته بصدقة مالي فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Abu Awfa said:                     “Whenever a man brought Sadaqah to the Messenger of Allah, he would bless him. I brought him the Sadaqah of my wealth and he said: 'Allhumma, salli ala ali abi awfa(O Allah! Send blessing upon the family of Abu Awfa).' ”",
      "chain": [
        "38409",
        "20032",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا محمد بن عبيد الطنافسي، عن إدريس الأودي، عن عمرو بن مرة، عن أبي البختري، عن أبي سعيد، رفعه إلى النبي  صلى الله عليه وسلم  قال ‏\"‏ الوسق ستون صاعا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'eed narrated and attributed to the Prophet:                     “A Wasq is sixty Sa.”",
      "chain": [
        "30200",
        "30213",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "2310",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن محمد، حدثنا يعلى، وأبو معاوية عن الأعمش، عن عمرو بن مرة، عن أبي البختري، عن علي، قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن فقلت يا رسول الله تبعثني وأنا شاب أقضي بينهم ولا أدري ما القضاء قال فضرب في صدري بيده ثم قال ‏\"‏ اللهم اهد قلبه وثبت لسانه ‏\"‏ ‏.‏ قال فما شككت بعد في قضاء بين اثنين ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     “The Messenger of Allah (ﷺ) sent me to Yemen. I said: 'O Messenger of Allah, you are sending me to judge between them while I am a young man, and I do not know how to judge.' He struck me on the chest with his hand and said: 'O Allah, guide his heart and make his tongue steadfast.' And after that I never doubted in passing judgment between two people.”",
      "chain": [
        "38409",
        "20372",
        "20354",
        "11060",
        "11381",
        "11347",
        "5"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن شرحبيل بن السمط، قال قلت لكعب يا كعب بن مرة حدثنا عن رسول الله صلى الله عليه وسلم واحذر ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق امرأ مسلما كان فكاكه من النار يجزئ بكل عظم منه عظم منه ومن أعتق امرأتين مسلمتين كانتا فكاكه من النار يجزئ بكل عظمين منهما عظم منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Shurahbil bin Simt said:                     I said to Ka'b bin Murrah, tell us a Hadith from the Messenger of Allah (ﷺ), but be careful. He said: I heard the Messenger of Allah (ﷺ) say: “Whoever frees a Muslim man, he will be his ransom from the Fire; each of his bones will suffice (as a ransom) for each of his bones. Whoever frees two Muslim women, they will be his ransom from the Fire; each of their two bones will suffice (as a ransom) for each of his bones.”",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11342",
        "6225"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن محمد، وأبو بكر بن أبي شيبة قالا حدثنا وكيع، حدثنا سفيان، حدثنا عمرو بن مرة، عن مرة بن شراحيل، قال قال عمر بن الخطاب ثلاث لأن يكون رسول الله صلى الله عليه وسلم بينهن أحب إلى من الدنيا وما فيها الكلالة والربا والخلافة ‏.‏",
      "text_en": " ‘Umarbin Khattab said:                      “There are three things, if the Messenger ofAllah (ﷺ) had clarified them, that would have been dearer to methanthe world and everything in it: a person who leaves behind noheir,usury, and the caliphate.”",
      "chain": [
        "38409",
        "30201",
        "20032",
        "20012",
        "11381",
        "11391"
      ]
    },
    {
      "hadith_no": "3173",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا زافر بن سليمان، عن أبي سنان، عن عمرو بن مرة، عن مرة، عن عبد الله بن مسعود، قال قال رسول الله  صلى الله عليه وسلم  وهو على ناقته المخضرمة بعرفات فقال ‏\"‏ أتدرون أى يوم هذا وأى شهر هذا وأى بلد هذا ‏\"‏ ‏.‏ قالوا هذا بلد حرام وشهر حرام ويوم حرام ‏.‏ قال ‏\"‏ ألا وإن أموالكم ودماءكم عليكم حرام كحرمة شهركم هذا في بلدكم هذا في يومكم هذا ألا وإني فرطكم على الحوض وأكاثر بكم الأمم فلا تسودوا وجهي ألا وإني مستنقذ أناسا ومستنقذ مني أناس فأقول يا رب أصيحابي ‏.‏ فيقول إنك لا تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mas’ud said:                      “The Messenger ofAllah (ﷺ) said, when he was atop his camel with the clipped ears in‘Arafat: ‘Do you know what day this is, what month this is andwhatland this is?’ They said: ‘This is a sacred land, a sacredmonth and asacred day.’ He said: ‘Your wealth and your blood aresacred to you asthis month of yours, in this land of yours, on thisday of yours. Iwill reach the Cistern (Hawd) before you, and I willbe proud of yourgreat numbers before the nations, so do not blackenmy face (i.e.,cause me to be ashamed). I will rescue some people,and some peoplewill be taken away from me. I will say: “O Lord, mycompanions!” andHe will say: “You do not know what innovationsthey introduced afteryou were gone.’”",
      "chain": [
        "38108",
        "26511",
        "11381",
        "16"
      ]
    },
    {
      "hadith_no": "3405",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن مرة الهمداني، عن أبي موسى الأشعري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كمل من الرجال كثير ولم يكمل من النساء إلا مريم بنت عمران وآسية امرأة فرعون وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Musa Al-Ash’ari that the Prophet (ﷺ) said:                     “Many men have attained perfection but no women have attainedperfection except Maryam bint ‘Imran (Mary) and Asiyah the wife ofFir’awn. And the superiority of ‘Aishah over other women is likethesuperiority of Tharid over all other foods.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "3660",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا معمر بن سليمان، حدثنا عبد الله بن بشر، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن أخت، زينب امرأة عبد الله عن زينب، قالت كانت عجوز تدخل علينا ترقي من الحمرة وكان لنا سرير طويل القوائم وكان عبد الله إذا دخل تنحنح وصوت فدخل يوما فلما سمعت صوته احتجبت منه فجاء فجلس إلى جانبي فمسني فوجد مس خيط فقال ما هذا فقلت رقى لي فيه من الحمرة فجذبه وقطعه فرمى به وقال لقد أصبح آل عبد الله أغنياء عن الشرك سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الرقى والتمائم والتولة شرك ‏\"‏ ‏.‏ قلت فإني خرجت يوما فأبصرني فلان فدمعت عيني التي تليه فإذا رقيتها سكنت دمعتها وإذا تركتها دمعت ‏.‏ قال ذاك الشيطان إذا أطعتيه تركك وإذا عصيتيه طعن بإصبعه في عينك ولكن لو فعلت كما فعل رسول الله  صلى الله عليه وسلم  كان خيرا لك وأجدر أن تشفين تنضحين في عينك الماء وتقولين ‏\"‏ أذهب الباس رب الناس اشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain that the Prophet (ﷺ) saw amanwith a brass ring on his hand. He said:                      “What is this ring?” Hesaid: “It is for Wahinah.”* He said: “Take it off, for it willonlyincrease you in weakness.”",
      "chain": [
        "38120",
        "28578",
        "25140",
        "11060",
        "11381",
        "10839",
        "57"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، وغندر، وأبو أسامة عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، أن قوما، من اليهود قبلوا يد النبي  صلى الله عليه وسلم  ورجليه ‏.‏",
      "text_en": " It was narrated from Safwan bin 'Assal that:                     \"Some people among the Jews kissed the hands and feet of the Prophet(ﷺ).\"",
      "chain": [
        "20436",
        "20102",
        "20278",
        "20318",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "3761",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، عن شيبان، عن الأعمش، عن عمرو بن مرة، عن يوسف بن ماهك، عن عبيد بن عمير، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أعظم الناس فرية لرجل هاجى رجلا فهجا القبيلة بأسرها ورجل انتفى من أبيه وزنى أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aisha that the Messenger of Allah(ﷺ) said:                     \"The worst of all people lying is a man who trades insults with another man, disparaging the entire tribe, and a man who denies his father and accuses his mother of adultery.\"",
      "chain": [
        "30201",
        "11201",
        "20240",
        "11060",
        "11381",
        "11264",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "3830",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، سنة إحدى وثلاثين ومائتين حدثنا وكيع، في سنة خمس وتسعين ومائة قال حدثنا سفيان في مجلس الأعمش منذ خمسين سنة حدثنا عمرو بن مرة الجملي في زمن خالد عن عبد الله بن الحارث المكتب عن طليق بن قيس الحنفي عن ابن عباس أن النبي  صلى الله عليه وسلم  كان يقول في دعائه ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطيعا إليك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي واهد قلبي وسدد لساني وثبت حجتي واسلل سخيمة قلبي ‏\"‏ ‏.‏ قال أبو الحسن الطنافسي قلت لوكيع أقوله في قنوت الوتر قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Prophet (saas) used to say in his supplication: \"Rabbi! A'inni wa la tu'in 'alayya, wansurni wa la tansur 'alayya, wamkurli wa la tamkur 'alayya, wahdini wa yassiril-huda li, wansurni 'ala man bagha 'alayya.  Rabbij'alni laka shakkaran laka dhakkaran, laka rahhaban, laka muti'an, 'ilayka mukhbitan, 'ilayka awwahan muniba. Rabbi! Taqabbal tawbati, waghsil hawbati wa ajib da'wati, wahdi qalbi, wa saddid lisani, wa thabbit hujjati, waslul sakhimata qalbi (O Lord! Help me and do not help others against me, support me and do not support others against me, plan for me and do not plan against me, guide me and make guidance easy for me, and help me against those who wrong me. O Lord! Make me grateful to You, make me remember You much, make me fearful of You, obedient to You, humble before You and turning to You. O Lord! Accept my repentance and wash away my sins, answer my supplication, guide my heart, make my tongue speak the truth, make my proof firm and remove resentment from my heard).\" (Sahih)(One of the narrators) Abul-Hasan At-Tanafisi said: \"I said to Waki': 'Shall I say it in the Qunut of Witr?' He said: 'Yes.'\"",
      "chain": [
        "38409",
        "11381",
        "10780",
        "19870",
        "17"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن نمير، وأبو معاوية عن الأعمش، عن عمرو بن مرة، عن أبي البختري، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يحقر أحدكم نفسه ‏\"‏ ‏.‏ قالوا يا رسول الله كيف يحقر أحدنا نفسه قال ‏\"‏ يرى أمرا لله عليه فيه مقال ثم لا يقول فيه فيقول الله عز وجل له يوم القيامة ما منعك أن تقول في كذا وكذا فيقول خشية الناس ‏.‏ فيقول فإياى كنت أحق أن تخشى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed that the Messenger of Allah (ﷺ)said:                      “No one of you should belittle himself.” They said: “OMessengerof Allah, how could anyone of us belittle himself?” Hesaid: “If hesees something concerning which he should speak outfor the sake ofAllah but does not say anything. Allah will say tohim on the Day ofResurrection: “What prevented you from speakingconcerning such andsuch?” He will say: “Fear of the people.”(Allah) will say: “Ratheryou should have feared Me.”",
      "chain": [
        "30216",
        "20331",
        "20354",
        "11060",
        "11381",
        "11347",
        "38"
      ]
    }
  ],
  "total_hadiths": 183
}