{
  "id": "11382",
  "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
  "full_name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
  "grade": "Follower(Tabi') [1st Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3120",
      "name": "Ma'qil bin Yasar al-Mazni ( معقل بن يسار المزني البصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10760",
      "name": "al-Rabi' bin Khathaym الربيع بن خثيم الثوري",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10760",
      "name": "al-Rabi' bin Khathaym الربيع بن خثيم الثوري",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11387",
      "name": "Muhammad bin Suqah محمد بن سوقة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-240",
      "hadith_no": "240",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينا رسول الله صلى الله عليه وسلم ساجد ح قال وحدثني أحمد بن عثمان قال حدثنا شريح بن مسلمة قال حدثنا إبراهيم بن يوسف عن أبيه عن أبي إسحاق قال حدثني عمرو بن ميمون أن عبد الله بن مسعود حدثه أن النبي صلى الله عليه وسلم كان يصلي عند البيت، وأبو جهل وأصحاب له جلوس، إذ قال بعضهم لبعض أيكم يجيء بسلى جزور بني فلان فيضعه على ظهر محمد إذا سجد فانبعث أشقى القوم فجاء به، فنظر حتى إذا سجد النبي صلى الله عليه وسلم وضعه على ظهره بين كتفيه وأنا أنظر، لا أغير شيئا، لو كان لي منعة‏.‏ قال فجعلوا يضحكون ويحيل بعضهم على بعض، ورسول الله صلى الله عليه وسلم ساجد لا يرفع رأسه، حتى جاءته فاطمة، فطرحت عن ظهره، فرفع رأسه ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏‏.‏ ثلاث مرات، فشق عليهم إذ دعا عليهم  قال وكانوا يرون أن الدعوة في ذلك البلد مستجابة  ثم سمى ‏\"‏ اللهم عليك بأبي جهل، وعليك بعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط ‏\"‏‏.‏ وعد السابع فلم يحفظه قال فوالذي نفسي بيده، لقد رأيت الذين عد رسول الله صلى الله عليه وسلم صرعى في القليب قليب بدر‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Once the Prophet was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his companions. One of them said to the others, \"Who amongst you will bring the Abdominal contents (intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he prostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet prostrated and then placed it on his back between his shoulders. I was watching but could not do any thing. I wish I had some people with me to hold out against them. They started laughing and falling on one another. Allah's Apostle was in prostration and he did not lift his head up till Fatima (Prophet's daughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head and said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the Prophet invoked Allah against them as they had a conviction that the prayers and invocations were accepted in this city (Mecca). The Prophet said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned the seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies of those persons who were counted by Allah's Apostle in the Qalib (one of the wells) of Badr.",
      "usc_msa_ref": "241",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-520",
      "hadith_no": "520",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن إسحاق السرماري، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينما رسول الله صلى الله عليه وسلم قائم يصلي عند الكعبة، وجمع قريش في مجالسهم إذ قال قائل منهم ألا تنظرون إلى هذا المرائي أيكم يقوم إلى جزور آل فلان، فيعمد إلى فرثها ودمها وسلاها فيجيء به، ثم يمهله حتى إذا سجد وضعه بين كتفيه فانبعث أشقاهم، فلما سجد رسول الله صلى الله عليه وسلم وضعه بين كتفيه، وثبت النبي صلى الله عليه وسلم ساجدا، فضحكوا حتى مال بعضهم إلى بعض من الضحك، فانطلق منطلق إلى فاطمة  عليها السلام  وهى جويرية، فأقبلت تسعى وثبت النبي صلى الله عليه وسلم ساجدا حتى ألقته عنه، وأقبلت عليهم تسبهم، فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش  ثم سمى  اللهم عليك بعمرو بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط، وعمارة بن الوليد ‏\"‏‏.‏ قال عبد الله فوالله لقد رأيتهم صرعى يوم بدر، ثم سحبوا إلى القليب قليب بدر، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ وأتبع أصحاب القليب لعنة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Maimun [??]:                     `Abdullah bin Mas`ud said, \"While Allah's Apostle was praying beside the Ka`ba, there were some Quraish people sitting in a gathering. One of them said, 'Don't you see this (who does deeds just to show off)? Who amongst you can go and bring the dung, blood and the Abdominal contents (intestines, etc.) of the slaughtered camels of the family of so and so and then wait till he prostrates and put that in between his shoulders?' The most unfortunate amongst them (`Uqba bin Abi Mu'ait) went (and brought them) and when Allah's Apostle prostrated, he put them between his shoulders. The Prophet remained in prostration and they laughed so much so that they fell on each other. A passerby went to Fatima, who was a young girl in those days. She came running and the Prophet was still in prostration. She removed them and cursed upon the Quraish on their faces. When Allah's Apostle completed his prayer, he said, 'O Allah! Take revenge on Quraish.' He said so thrice and added, 'O Allah! take revenge on `Amr bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, `Uqba bin Abi Mu'ait and `Umar a bin Al-Walid.\" `Abdullah added, \"By Allah! I saw all of them dead in the battle field on the day of Badr and they were dragged and thrown in the Qalib (a well) at Badr: Allah's Apostle then said, 'Allah's curse has descended upon the people of the Qalib (well).",
      "usc_msa_ref": "",
      "chain": [
        "30289",
        "20340",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-1392",
      "hadith_no": "1392",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا جرير بن عبد الحميد، حدثنا حصين بن عبد الرحمن، عن عمرو بن ميمون الأودي، قال رأيت عمر بن الخطاب  رضى الله عنه  قال يا عبد الله بن عمر، اذهب إلى أم المؤمنين عائشة  رضى الله عنها  فقل يقرأ عمر بن الخطاب عليك السلام، ثم سلها أن أدفن مع صاحبى‏.‏ قالت كنت أريده لنفسي، فلأوثرنه اليوم على نفسي‏.‏ فلما أقبل قال له ما لديك قال أذنت لك يا أمير المؤمنين‏.‏ قال ما كان شىء أهم إلى من ذلك المضجع، فإذا قبضت فاحملوني ثم سلموا ثم قل يستأذن عمر بن الخطاب‏.‏ فإن أذنت لي فادفنوني، وإلا فردوني إلى مقابر المسلمين، إني لا أعلم أحدا أحق بهذا الأمر من هؤلاء النفر الذين توفي رسول الله صلى الله عليه وسلم وهو عنهم راض، فمن استخلفوا بعدي فهو الخليفة، فاسمعوا له وأطيعوا‏.‏ فسمى عثمان وعليا وطلحة والزبير وعبد الرحمن بن عوف وسعد بن أبي وقاص، وولج عليه شاب من الأنصار فقال أبشر يا أمير المؤمنين ببشرى الله، كان لك من القدم في الإسلام ما قد علمت، ثم استخلفت فعدلت، ثم الشهادة بعد هذا كله‏.‏ فقال ليتني يا ابن أخي وذلك كفافا لا على ولا لي أوصي الخليفة من بعدي بالمهاجرين الأولين خيرا، أن يعرف لهم حقهم، وأن يحفظ لهم حرمتهم، وأوصيه بالأنصار خيرا الذين تبوءوا الدار والإيمان أن يقبل من محسنهم، ويعفى عن مسيئهم، وأوصيه بذمة الله وذمة رسوله صلى الله عليه وسلم أن يوفى لهم بعهدهم، وأن يقاتل من ورائهم، وأن لا يكلفوا فوق طاقتهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun Al-Audi:                     I saw `Umar bin Al-Khattab (when he was stabbed) saying, \"O `Abdullah bin `Umar! Go to the mother of the believers Aisha and say, `Umar bin Al-Khattab sends his greetings to you,' and request her to allow me to be buried with my companions.\" (So, Ibn `Umar conveyed the message to `Aisha.) She said, \"I had the idea of having this place for myself but today I prefer him (`Umar) to myself (and allow him to be buried there).\" When `Abdullah bin `Umar returned, `Umar asked him, \"What (news) do you have?\" He replied, \"O chief of the believers! She has allowed you (to be buried there).\" On that `Umar said, \"Nothing was more important to me than to be buried in that (sacred) place. So, when I expire, carry me there and pay my greetings to her (`Aisha ) and say, `Umar bin Al-Khattab asks permission; and if she gives permission, then bury me (there) and if she does not, then take me to the graveyard of the Muslims. I do not think any person has more right for the caliphate than those with whom Allah's Apostle (p.b.u.h) was always pleased till his death. And whoever is chosen by the people after me will be the caliph, and you people must listen to him and obey him,\" and then he mentioned the name of `Uthman, `Ali, Talha, Az-Zubair, `Abdur-Rahman bin `Auf and Sa`d bin Abi Waqqas. By this time a young man from Ansar came and said, \"O chief of the believers! Be happy with Allah's glad tidings. The grade which you have in Islam is known to you, then you became the caliph and you ruled with justice and then you have been awarded martyrdom after all this.\" `Umar replied, \"O son of my brother! Would that all that privileges will counterbalance (my short comings), so that I neither lose nor gain anything. I recommend my successor to be good to the early emigrants and realize their rights and to protect their honor and sacred things. And I also recommend him to be good to the Ansar who before them, had homes (in Medina) and had adopted the Faith. He should accept the good of the righteous among them and should excuse their wrongdoers. I recommend him to abide by the rules and regulations concerning the Dhimmis (protectees) of Allah and His Apostle, to fulfill their contracts completely and fight for them and not to tax (overburden) them beyond their capabilities.\"",
      "usc_msa_ref": "475",
      "chain": [
        "30367",
        "20028",
        "15097",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-1710",
      "hadith_no": "1710",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، عن أبي إسحاق، سمعت عمرو بن ميمون، يقول شهدت عمر  رضى الله عنه  صلى بجمع الصبح، ثم وقف فقال إن المشركين كانوا لا يفيضون حتى تطلع الشمس، ويقولون أشرق ثبير‏.‏ وأن النبي صلى الله عليه وسلم خالفهم، ثم أفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I saw `Umar, offering the Fajr (morning) prayer at Jam'; then he got up and said, \"The pagans did not use to depart (from Jam') till the sun had risen, and they used to say, 'Let the sun shine on Thabir (a mountain).' But the Prophet contradicted them and departed from Jam' before sunrise.\"",
      "usc_msa_ref": "744",
      "chain": [
        "20219",
        "20020",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-2822",
      "hadith_no": "2822",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك بن عمير، سمعت عمرو بن ميمون الأودي، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المعلم الغلمان الكتابة، ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ منهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وأعوذ بك من عذاب القبر ‏\"‏‏.‏ فحدثت به مصعبا فصدقه‏.‏",
      "text_en": " Narrated `Amr bin Maimun Al-Audi:                     Sa`d used to teach his sons the following words as a teacher teaches his students the skill of writing and used to say that Allah's Apostle used to seek Refuge with Allah from them (i.e. the evils) at the end of every prayer. The words are: 'O Allah! I seek refuge with You from cowardice, and seek refuge with You from being brought back to a bad stage of old life and seek refuge with You from the afflictions of the world, and seek refuge with You from the punishments in the grave.'",
      "usc_msa_ref": "76",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-2856",
      "hadith_no": "2856",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع يحيى بن آدم، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ  رضى الله عنه  قال كنت ردف النبي صلى الله عليه وسلم على حمار يقال له عفير، فقال ‏\"‏ يا معاذ، هل تدري حق الله على عباده وما حق العباد على الله ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا، وحق العباد على الله أن لا يعذب من لا يشرك به شيئا ‏\"‏‏.‏ فقلت يا رسول الله، أفلا أبشر به الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh:                     I was a companion rider of the Prophet on a donkey called 'Ufair. The Prophet asked, \"O Mu`adh! Do you know what Allah's right on His slaves is, and what the right of His slaves on Him is?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on His slaves is that they should worship Him (Alone) and should not worship any besides Him. And slave's right on Allah is that He should not punish him who worships none besides Him.\" I said, \"O Allah's Apostle! Should I not inform the people of this good news?\" He said, \"Do not inform them of it, lest they should depend on it (absolutely).",
      "usc_msa_ref": "108",
      "chain": [
        "30123",
        "20364",
        "20327",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "id": "sahih-bukhari-2934",
      "hadith_no": "2934",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا جعفر بن عون، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يصلي في ظل الكعبة، فقال أبو جهل وناس من قريش، ونحرت جزور بناحية مكة، فأرسلوا فجاءوا من سلاها، وطرحوه عليه، فجاءت فاطمة فألقته عنه، فقال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش ‏\"‏‏.‏ لأبي جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأبى بن خلف، وعقبة بن أبي معيط‏.‏ قال عبد الله فلقد رأيتهم في قليب بدر قتلى‏.‏ قال أبو إسحاق ونسيت السابع‏.‏ وقال يوسف بن إسحاق عن أبي إسحاق أمية بن خلف‏.‏ وقال شعبة أمية أو أبى‏.‏ والصحيح أمية‏.‏",
      "text_en": " Narrated `Abdullah:                     Once the Prophet was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet Then Fatima (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).",
      "usc_msa_ref": "185",
      "chain": [
        "30201",
        "20416",
        "20012",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3052",
      "hadith_no": "3052",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن حصين، عن عمرو بن ميمون، عن عمر  رضى الله عنه  قال وأوصيه بذمة الله وذمة رسوله صلى الله عليه وسلم أن يوفى لهم بعهدهم، وأن يقاتل من ورائهم، ولا يكلفوا إلا طاقتهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     `Umar (after he was stabbed), instructed (his would-be-successor) saying, \"I urge him (i.e. the new Caliph) to take care of those non-Muslims who are under the protection of Allah and His Apostle in that he should observe the convention agreed upon with them, and fight on their behalf (to secure their safety) and he should not over-tax them beyond their capability.\"",
      "usc_msa_ref": "287",
      "chain": [
        "20040",
        "20469",
        "15097",
        "11382",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-3185",
      "hadith_no": "3185",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا عبدان بن عثمان، قال أخبرني أبي، عن شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال بينا رسول الله صلى الله عليه وسلم ساجد وحوله ناس من قريش من المشركين إذ جاء عقبة بن أبي معيط بسلى جزور، فقذفه على ظهر النبي صلى الله عليه وسلم فلم يرفع رأسه حتى جاءت فاطمة  عليها السلام  فأخذت من ظهره، ودعت على من صنع ذلك، فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم عليك الملأ من قريش، اللهم عليك أبا جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، وعقبة بن أبي معيط، وأمية بن خلف  أو أبى بن خلف ‏\"‏‏.‏ فلقد رأيتهم قتلوا يوم بدر، فألقوا في بئر، غير أمية أو أبى، فإنه كان رجلا ضخما، فلما جروه تقطعت أوصاله قبل أن يلقى في البئر‏.‏",
      "text_en": " Narrated `Abdullah:                     While the Prophet was in the state of prostration, surrounded by a group of people from Quraish pagans. `Uqba bin Abi Mu'ait came and brought the intestines of a camel and threw them on the back of the Prophet . The Prophet did not raise his head from prostration till Fatima (i.e. his daughter) came and removed those intestines from his back, and invoked evil on whoever had done (the evil deed). The Prophet said, \"O Allah! Destroy the chiefs of Quraish, O Allah! Destroy Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, `Uqba bin Abi Mu'ait, Umaiya bin Khalaf (or Ubai bin Kalaf).\" Later on I saw all of them killed during the battle of Badr and their bodies were thrown into a well except the body of Umaiya or Ubai, because he was a fat person, and when he was pulled, the parts of his body got separated before he was thrown into the well.",
      "usc_msa_ref": "409",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3675",
      "hadith_no": "3675",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عبيد الله بن موسى، حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله بن مسعود  رضى الله عنه  قال انطلق سعد بن معاذ معتمرا  قال  فنزل على أمية بن خلف أبي صفوان، وكان أمية إذا انطلق إلى الشأم فمر بالمدينة نزل على سعد، فقال أمية لسعد انتظر حتى إذا انتصف النهار، وغفل الناس انطلقت فطفت، فبينا سعد يطوف إذا أبو جهل فقال من هذا الذي يطوف بالكعبة فقال سعد أنا سعد‏.‏ فقال أبو جهل تطوف بالكعبة آمنا، وقد آويتم محمدا وأصحابه فقال نعم‏.‏ فتلاحيا بينهما‏.‏ فقال أمية لسعد لا ترفع صوتك على أبي الحكم، فإنه سيد أهل الوادي‏.‏ ثم قال سعد والله لئن منعتني أن أطوف بالبيت لأقطعن متجرك بالشأم‏.‏ قال فجعل أمية يقول لسعد لا ترفع صوتك‏.‏ وجعل يمسكه، فغضب سعد فقال دعنا عنك، فإني سمعت محمدا صلى الله عليه وسلم يزعم أنه قاتلك‏.‏ قال إياى قال نعم‏.‏ قال والله ما يكذب محمد إذا حدث‏.‏ فرجع إلى امرأته، فقال أما تعلمين ما قال لي أخي اليثربي قالت وما قال قال زعم أنه سمع محمدا يزعم أنه قاتلي‏.‏ قالت فوالله ما يكذب محمد‏.‏ قال فلما خرجوا إلى بدر، وجاء الصريخ قالت له امرأته أما ذكرت ما قال لك أخوك اليثربي قال فأراد أن لا يخرج، فقال له أبو جهل إنك من أشراف الوادي، فسر يوما أو يومين، فسار معهم فقتله الله‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Sa`d bin Mu`adh came to Mecca with the intention of performing `Umra, and stayed at the house of Umaiya bin Khalaf Abi Safwan, for Umaiya himself used to stay at Sa`d's house when he passed by Medina on his way to Sham. Umaiya said to Sa`d, \"Will you wait till midday when the people are (at their homes), then you may go and perform the Tawaf round the Ka`ba?\" So, while Sa`d was going around the Ka`ba, Abu Jahl came and asked, \"Who is that who is performing Tawaf?\" Sa`d replied, \"I am Sa`d.\" Abu Jahl said, \"Are you circumambulating the Ka`ba safely although you have given refuge to Muhammad and his companions?\" Sa`d said, \"Yes,\" and they started quarreling. Umaiya said to Sa`d, \"Don't shout at Abi-l-Hakam (i.e. Abu Jahl), for he is chief of the valley (of Mecca).\" Sa`d then said (to Abu Jahl). 'By Allah, if you prevent me from performing the Tawaf of the Ka`ba, I will spoil your trade with Sham.\" Umaiya kept on saying to Sa`d, \"Don't raise your voice.\" and kept on taking hold of him. Sa`d became furious and said, (to Umaiya), \"Be away from me, for I have heard Muhammad saying that he will kill you.\" Umaiiya said, \"Will he kill me?\" Sa`d said, \"Yes,.\" Umaiya said, \"By Allah! When Muhammad says a thing, he never tells a lie.\" Umaiya went to his wife and said to her, \"Do you know what my brother from Yathrib (i.e. Medina) has said to me?\" She said, \"What has he said?\" He said, \"He claims that he has heard Muhammad claiming that he will kill me.\" She said, By Allah! Muhammad never tells a lie.\" So when the infidels started to proceed for Badr (Battle) and declared war (against the Muslims), his wife said to him, \"Don't you remember what your brother from Yathrib told you?\" Umaiya decided not to go but Abu Jahl said to him, \"You are from the nobles of the valley (of Mecca), so you should accompany us for a day or two.\" He went with them and thus Allah got him killed.",
      "usc_msa_ref": "826",
      "chain": [
        "30289",
        "20340",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3747",
      "hadith_no": "3747",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن حصين، عن عمرو بن ميمون، قال رأيت عمر بن الخطاب  رضى الله عنه  قبل أن يصاب بأيام بالمدينة وقف على حذيفة بن اليمان وعثمان بن حنيف، قال كيف فعلتما أتخافان أن تكونا قد حملتما الأرض ما لا تطيق قالا حملناها أمرا هي له مطيقة، ما فيها كبير فضل‏.‏ قال انظرا أن تكونا حملتما الأرض ما لا تطيق، قال قالا لا‏.‏ فقال عمر لئن سلمني الله لأدعن أرامل أهل العراق لا يحتجن إلى رجل بعدي أبدا‏.‏ قال فما أتت عليه إلا رابعة حتى أصيب‏.‏ قال إني لقائم ما بيني وبينه إلا عبد الله بن عباس غداة أصيب، وكان إذا مر بين الصفين قال استووا‏.‏ حتى إذا لم ير فيهن خللا تقدم فكبر، وربما قرأ سورة يوسف، أو النحل، أو نحو ذلك، في الركعة الأولى حتى يجتمع الناس، فما هو إلا أن كبر فسمعته يقول قتلني  أو أكلني  الكلب‏.‏ حين طعنه، فطار العلج بسكين ذات طرفين لا يمر على أحد يمينا ولا شمالا إلا طعنه حتى طعن ثلاثة عشر رجلا، مات منهم سبعة، فلما رأى ذلك رجل من المسلمين، طرح عليه برنسا، فلما ظن العلج أنه مأخوذ نحر نفسه، وتناول عمر يد عبد الرحمن بن عوف فقدمه، فمن يلي عمر فقد رأى الذي أرى، وأما نواحي المسجد فإنهم لا يدرون غير أنهم قد فقدوا صوت عمر وهم يقولون سبحان الله سبحان الله‏.‏ فصلى بهم عبد الرحمن صلاة خفيفة، فلما انصرفوا‏.‏ قال يا ابن عباس، انظر من قتلني‏.‏ فجال ساعة، ثم جاء، فقال غلام المغيرة‏.‏ قال الصنع قال نعم‏.‏ قال قاتله الله لقد أمرت به معروفا، الحمد لله الذي لم يجعل منيتي بيد رجل يدعي الإسلام، قد كنت أنت وأبوك تحبان أن تكثر العلوج بالمدينة وكان ‏{‏العباس‏}‏ أكثرهم رقيقا‏.‏ فقال إن شئت فعلت‏.‏ أى إن شئت قتلنا‏.‏ قال كذبت، بعد ما تكلموا بلسانكم، وصلوا قبلتكم وحجوا حجكم فاحتمل إلى بيته فانطلقنا معه، وكأن الناس لم تصبهم مصيبة قبل يومئذ، فقائل يقول لا بأس‏.‏ وقائل يقول أخاف عليه، فأتي بنبيذ فشربه فخرج من جوفه، ثم أتي بلبن فشربه فخرج من جرحه، فعلموا أنه ميت، فدخلنا عليه، وجاء الناس يثنون عليه، وجاء رجل شاب، فقال أبشر يا أمير المؤمنين ببشرى الله لك من صحبة رسول الله صلى الله عليه وسلم وقدم في الإسلام ما قد علمت، ثم وليت فعدلت، ثم شهادة‏.‏ قال وددت أن ذلك كفاف لا على ولا لي‏.‏ فلما أدبر، إذا إزاره يمس الأرض‏.‏ قال ردوا على الغلام قال ابن أخي ارفع ثوبك، فإنه أبقى لثوبك وأتقى لربك، يا عبد الله بن عمر انظر ما على من الدين‏.‏ فحسبوه فوجدوه ستة وثمانين ألفا أو نحوه، قال إن وفى له مال آل عمر، فأده من أموالهم، وإلا فسل في بني عدي بن كعب، فإن لم تف أموالهم فسل في قريش، ولا تعدهم إلى غيرهم، فأد عني هذا المال، انطلق إلى عائشة أم المؤمنين فقل يقرأ عليك عمر السلام‏.‏ ولا تقل أمير المؤمنين‏.‏ فإني لست اليوم للمؤمنين أميرا، وقل يستأذن عمر بن الخطاب أن يدفن مع صاحبيه‏.‏ فسلم واستأذن، ثم دخل عليها، فوجدها قاعدة تبكي فقال يقرأ عليك عمر بن الخطاب السلام ويستأذن أن يدفن مع صاحبيه‏.‏ فقالت كنت أريده لنفسي، ولأوثرن به اليوم على نفسي‏.‏ فلما أقبل قيل هذا عبد الله بن عمر قد جاء‏.‏ قال ارفعوني، فأسنده رجل إليه، فقال ما لديك قال الذي تحب يا أمير المؤمنين أذنت‏.‏ قال الحمد لله، ما كان من شىء أهم إلى من ذلك، فإذا أنا قضيت فاحملوني ثم سلم فقل يستأذن عمر بن الخطاب، فإن أذنت لي فأدخلوني، وإن ردتني ردوني إلى مقابر المسلمين‏.‏ وجاءت أم المؤمنين حفصة والنساء تسير معها، فلما رأيناها قمنا، فولجت عليه فبكت عنده ساعة، واستأذن الرجال، فولجت داخلا لهم، فسمعنا بكاءها من الداخل‏.‏ فقالوا أوص يا أمير المؤمنين استخلف‏.‏ قال ما أجد أحق بهذا الأمر من هؤلاء النفر أو الرهط الذين توفي رسول الله صلى الله عليه وسلم وهو عنهم راض‏.‏ فسمى عليا وعثمان والزبير وطلحة وسعدا وعبد الرحمن وقال يشهدكم عبد الله بن عمر وليس له من الأمر شىء  كهيئة التعزية له  فإن أصابت الإمرة سعدا فهو ذاك، وإلا فليستعن به أيكم ما أمر، فإني لم أعزله عن عجز ولا خيانة وقال أوصي الخليفة من بعدي بالمهاجرين الأولين أن يعرف لهم حقهم، ويحفظ لهم حرمتهم، وأوصيه بالأنصار خيرا، الذين تبوءوا الدار والإيمان من قبلهم، أن يقبل من محسنهم، وأن يعفى عن مسيئهم، وأوصيه بأهل الأمصار خيرا فإنهم ردء الإسلام، وجباة المال، وغيظ العدو، وأن لا يؤخذ منهم إلا فضلهم عن رضاهم، وأوصيه بالأعراب خيرا، فإنهم أصل العرب ومادة الإسلام أن يؤخذ من حواشي أموالهم وترد على فقرائهم، وأوصيه بذمة الله وذمة رسوله صلى الله عليه وسلم أن يوفى لهم بعهدهم، وأن يقاتل من ورائهم، ولا يكلفوا إلا طاقتهم‏.‏ فلما قبض خرجنا به فانطلقنا نمشي فسلم عبد الله بن عمر قال يستأذن عمر بن الخطاب‏.‏ قالت أدخلوه‏.‏ فأدخل، فوضع هنالك مع صاحبيه، فلما فرغ من دفنه اجتمع هؤلاء الرهط، فقال عبد الرحمن اجعلوا أمركم إلى ثلاثة منكم‏.‏ فقال الزبير قد جعلت أمري إلى علي‏.‏ فقال طلحة قد جعلت أمري إلى عثمان‏.‏ وقال سعد قد جعلت أمري إلى عبد الرحمن بن عوف‏.‏ فقال عبد الرحمن أيكما تبرأ من هذا الأمر فنجعله إليه، والله عليه والإسلام لينظرن أفضلهم في نفسه‏.‏ فأسكت الشيخان، فقال عبد الرحمن أفتجعلونه إلى، والله على أن لا آلو عن أفضلكم قالا نعم، فأخذ بيد أحدهما فقال لك قرابة من رسول الله صلى الله عليه وسلم والقدم في الإسلام ما قد علمت، فالله عليك لئن أمرتك لتعدلن، ولئن أمرت عثمان لتسمعن ولتطيعن‏.‏ ثم خلا بالآخر فقال له مثل ذلك، فلما أخذ الميثاق قال ارفع يدك يا عثمان‏.‏ فبايعه، فبايع له علي، وولج أهل الدار فبايعوه‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I saw `Umar bin Al-Khattab a few days before he was stabbed in Medina. He was standing with Hudhaifa bin Al-Yaman and `Uthman bin Hunaif to whom he said, \"What have you done? Do you think that you have imposed more taxation on the land (of As-Swad i.e. 'Iraq) than it can bear?\" They replied, \"We have imposed on it what it can bear because of its great yield.\" `Umar again said, \"Check whether you have imposed on the land what it can not bear.\" They said, \"No, (we haven't).\" `Umar added, \"If Allah should keep me alive I will let the widows of Iraq need no men to support them after me.\" But only four days had elapsed when he was stabbed (to death ). The day he was stabbed, I was standing and there was nobody between me and him (i.e. `Umar) except `Abdullah bin `Abbas. Whenever `Umar passed between the two rows, he would say, \"Stand in straight lines.\" When he saw no defect (in the rows), he would go forward and start the prayer with Takbir. He would recite Surat Yusuf or An-Nahl or the like in the first rak`a so that the people may have the time to Join the prayer. As soon as he said Takbir, I heard him saying, \"The dog has killed or eaten me,\" at the time he (i.e. the murderer) stabbed him. A non-Arab infidel proceeded on carrying a double-edged knife and stabbing all the persons he passed by on the right and left (till) he stabbed thirteen persons out of whom seven died. When one of the Muslims saw that, he threw a cloak on him. Realizing that he had been captured, the non-Arab infidel killed himself, `Umar held the hand of `Abdur-Rahman bin `Auf and let him lead the prayer. Those who were standing by the side of `Umar saw what I saw, but the people who were in the other parts of the Mosque did not see anything, but they lost the voice of `Umar and they were saying, \"Subhan Allah! Subhan Allah! (i.e. Glorified be Allah).\" `Abdur-Rahman bin `Auf led the people a short prayer. When they finished the prayer, `Umar said, \"O Ibn `Abbas! Find out who attacked me.\" Ibn `Abbas kept on looking here and there for a short time and came to say. \"The slave of Al Mughira.\" On that `Umar said, \"The craftsman?\" Ibn `Abbas said, \"Yes.\" `Umar said, \"May Allah curse him. I did not treat him unjustly. All the Praises are for Allah Who has not caused me to die at the hand of a man who claims himself to be a Muslim. No doubt, you and your father (Abbas) used to love to have more non-Arab infidels in Medina.\" Al-Abbas had the greatest number of slaves. Ibn `Abbas said to `Umar. \"If you wish, we will do.\" He meant, \"If you wish we will kill them.\" `Umar said, \"You are mistaken (for you can't kill them) after they have spoken your language, prayed towards your Qibla, and performed Hajj like yours.\" Then `Umar was carried to his house, and we went along with him, and the people were as if they had never suffered a calamity before. Some said, \"Do not worry (he will be Alright soon).\" Some said, \"We are afraid (that he will die).\" Then an infusion of dates was brought to him and he drank it but it came out (of the wound) of his belly. Then milk was brought to him and he drank it, and it also came out of his belly. The people realized that he would die. We went to him, and the people came, praising him. A young man came saying, \"O chief of the believers! Receive the glad tidings from Allah to you due to your company with Allah's Apostle and your superiority in Islam which you know. Then you became the ruler (i.e. Caliph) and you ruled with justice and finally you have been martyred.\" `Umar said, \"I wish that all these privileges will counterbalance (my shortcomings) so that I will neither lose nor gain anything.\" When the young man turned back to leave, his clothes seemed to be touching the ground. `Umar said, \"Call the young man back to me.\" (When he came back) `Umar said, \"O son of my brother! Lift your clothes, for this will keep your clothes clean and save you from the Punishment of your Lord.\" `Umar further said, \"O `Abdullah bin `Umar! See how much I am in debt to others.\" When the debt was checked, it amounted to approximately eighty-six thousand. `Umar said, \"If the property of `Umar's family covers the debt, then pay the debt thereof; otherwise request it from Bani `Adi bin Ka`b, and if that too is not sufficient, ask for it from Quraish tribe, and do not ask for it from any one else, and pay this debt on my behalf.\" `Umar then said (to `Abdullah), \"Go to `Aisha (the mother of the believers) and say: \"`Umar is paying his salutation to you. But don't say: 'The chief of the believers,' because today I am not the chief of the believers. And say: \"`Umar bin Al-Khattab asks the permission to be buried with his two companions (i.e. the Prophet, and Abu Bakr).\" `Abdullah greeted `Aisha and asked for the permission for entering, and then entered to her and found her sitting and weeping. He said to her, \"`Umar bin Al-Khattab is paying his salutations to you, and asks the permission to be buried with his two companions.\" She said, \"I had the idea of having this place for myself, but today I prefer `Umar to myself.\" When he returned it was said (to `Umar), \"`Abdullah bin `Umar has come.\" `Umar said, \"Make me sit up.\" Somebody supported him against his body and `Umar asked (`Abdullah), \"What news do you have?\" He said, \"O chief of the believers! It is as you wish. She has given the permission.\" `Umar said, \"Praise be to Allah, there was nothing more important to me than this. So when I die, take me, and greet `Aisha and say: \"`Umar bin Al-Khattab asks the permission (to be buried with the Prophet ), and if she gives the permission, bury me there, and if she refuses, then take me to the grave-yard of the Muslims.\" Then Hafsa (the mother of the believers) came with many other women walking with her. When we saw her, we went away. She went in (to `Umar) and wept there for sometime. When the men asked for permission to enter, she went into another place, and we heard her weeping inside. The people said (to `Umar), \"O chief of the believers! Appoint a successor.\" `Umar said, \"I do not find anyone more suitable for the job than the following persons or group whom Allah's Apostle had been pleased with before he died.\" Then `Umar mentioned `Ali, `Uthman, AzZubair, Talha, Sa`d and `Abdur-Rahman (bin `Auf) and said, \"Abdullah bin `Umar will be a witness to you, but he will have no share in the rule. His being a witness will compensate him for not sharing the right of ruling. If Sa`d becomes the ruler, it will be alright: otherwise, whoever becomes the ruler should seek his help, as I have not dismissed him because of disability or dishonesty.\" `Umar added, \"I recommend that my successor takes care of the early emigrants; to know their rights and protect their honor and sacred things. I also recommend that he be kind to the Ansar who had lived in Medina before the emigrants and Belief had entered their hearts before them. I recommend that the (ruler) should accept the good of the righteous among them and excuse their wrong-doers, and I recommend that he should do good to all the people of the towns (Al-Ansar), as they are the protectors of Islam and the source of wealth and the source of annoyance to the enemy. I also recommend that nothing be taken from them except from their surplus with their consent. I also recommend that he do good to the 'Arab bedouin, as they are the origin of the 'Arabs and the material of Islam. He should take from what is inferior, amongst their properties and distribute that to the poor amongst them. I also recommend him concerning Allah's and His Apostle's protectees (i.e. Dhimmis) to fulfill their contracts and to fight for them and not to overburden them with what is beyond their ability.\" So when `Umar expired, we carried him out and set out walking. `Abdullah bin `Umar greeted (`Aisha) and said, \"`Umar bin Al-Khattab asks for the permission.\" `Aisha said, \"Bring him in.\" He was brought in and buried beside his two companions. When he was buried, the group (recommended by `Umar) held a meeting. Then `Abdur-Rahman said, \" Reduce the candidates for rulership to three of you.\" Az-Zubair said, \"I give up my right to `Ali.\" Talha said, \"I give up my right to `Uthman,\" Sa`d, 'I give up my right to `Abdur-Rahman bin `Auf.\" `Abdur-Rahman then said (to `Uthman and `Ali), \"Now which of you is willing to give up his right of candidacy to that he may choose the better of the (remaining) two, bearing in mind that Allah and Islam will be his witnesses.\" So both the sheiks (i.e. `Uthman and `Ali) kept silent. `Abdur-Rahman said, \"Will you both leave this matter to me, and I take Allah as my Witness that I will not choose but the better of you?\" They said, \"Yes.\" So `Abdur-Rahman took the hand of one of them (i.e. `Ali) and said, \"You are related to Allah's Apostle and one of the earliest Muslims as you know well. So I ask you by Allah to promise that if I select you as a ruler you will do justice, and if I select `Uthman as a ruler you will listen to him and obey him.\" Then he took the other (i.e. `Uthman) aside and said the same to him. When `Abdur-Rahman secured (their agreement to) this covenant, he said, \"O `Uthman! Raise your hand.\" So he (i.e. `Abdur-Rahman) gave him (i.e. `Uthman) the solemn pledge, and then `Ali gave him the pledge of allegiance and then all the (Medina) people gave him the pledge of allegiance.",
      "usc_msa_ref": "50",
      "chain": [
        "20040",
        "20469",
        "15097",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-3886",
      "hadith_no": "3886",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال قال عمر  رضى الله عنه  إن المشركين كانوا لا يفيضون من جمع حتى تشرق الشمس على ثبير، فخالفهم النبي صلى الله عليه وسلم فأفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Umar:                     The pagans used not to leave Jam' (i.e. Muzdalifa) till the sun had risen on Thabir mountain. The Prophet contradicted them by leaving (Muzdalifa) before the sun rose.",
      "usc_msa_ref": "179",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-3897",
      "hadith_no": "3897",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا نعيم بن حماد، حدثنا هشيم، عن حصين، عن عمرو بن ميمون، قال رأيت في الجاهلية قردة اجتمع عليها قردة قد زنت، فرجموها فرجمتها معهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     During the pre-lslamic period of ignorance I saw a she-monkey surrounded by a number of monkeys. They were all stoning it, because it had committed illegal sexual intercourse. I too, stoned it along with them.",
      "usc_msa_ref": "188",
      "chain": [
        "30238",
        "20468",
        "15097",
        "11382"
      ]
    },
    {
      "id": "sahih-bukhari-3902",
      "hadith_no": "3902",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال بينا النبي صلى الله عليه وسلم ساجد وحوله ناس من قريش جاء عقبة بن أبي معيط بسلى جزور، فقذفه على ظهر النبي صلى الله عليه وسلم، فلم يرفع رأسه فجاءت فاطمة  عليها السلام  فأخذته من ظهره، ودعت على من صنع فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم عليك الملأ من قريش أبا جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، وأمية بن خلف  أو أبى بن خلف ‏\"‏‏.‏ شعبة الشاك  فرأيتهم قتلوا يوم بدر، فألقوا في بئر غير أمية أو أبى تقطعت أوصاله، فلم يلق في البئر‏.‏",
      "text_en": " Narrated `Abdullah:                     While the Prophet was prostrating, surrounded by some of Quraish, `Uqba bin Abi Mu'ait brought the intestines (i.e. Abdominal contents) of a camel and put them over the back of the Prophet. The Prophet did not raise his head, (till) Fatima, came and took it off his back and cursed the one who had done the harm. The Prophet said, \"O Allah! Destroy the chiefs of Quraish, Abu Jahl bin Hisham, `Utba bin Rabi`al, Shaba bin Rabi`a, Umaiya bin Khalaf or Ubai bin Khalaf.\" (The sub-narrator Shu`ba, is not sure of the last name.) I saw these people killed on the day of Badr battle and thrown in the well except Umaiya or Ubai whose body parts were mutilated but he was not thrown in the well.",
      "usc_msa_ref": "193",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-3998",
      "hadith_no": "3998",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال حدثني عمرو بن ميمون، أنه سمع عبد الله بن مسعود  رضى الله عنه  حدث عن سعد بن معاذ، أنه قال كان صديقا لأمية بن خلف، وكان أمية إذا مر بالمدينة نزل على سعد، وكان سعد إذا مر بمكة نزل على أمية، فلما قدم رسول الله صلى الله عليه وسلم المدينة انطلق سعد معتمرا، فنزل على أمية بمكة، فقال لأمية انظر لي ساعة خلوة لعلي أن أطوف بالبيت‏.‏ فخرج به قريبا من نصف النهار فلقيهما أبو جهل فقال يا أبا صفوان، من هذا معك فقال هذا سعد‏.‏ فقال له أبو جهل ألا أراك تطوف بمكة آمنا، وقد أويتم الصباة، وزعمتم أنكم تنصرونهم وتعينونهم، أما والله لولا أنك مع أبي صفوان ما رجعت إلى أهلك سالما‏.‏ فقال له سعد ورفع صوته عليه أما والله لئن منعتني هذا لأمنعنك ما هو أشد عليك منه طريقك على المدينة‏.‏ فقال له أمية لا ترفع صوتك يا سعد على أبي الحكم سيد أهل الوادي‏.‏ فقال سعد دعنا عنك يا أمية، فوالله لقد سمعت رسول الله صلى الله عليه وسلم يقول إنهم قاتلوك‏.‏ قال بمكة قال لا أدري‏.‏ ففزع لذلك أمية فزعا شديدا، فلما رجع أمية إلى أهله قال يا أم صفوان، ألم ترى ما قال لي سعد قالت وما قال لك قال زعم أن محمدا أخبرهم أنهم قاتلي، فقلت له بمكة قال لا أدري‏.‏ فقال أمية والله لا أخرج من مكة، فلما كان يوم بدر استنفر أبو جهل الناس قال أدركوا عيركم‏.‏ فكره أمية أن يخرج، فأتاه أبو جهل فقال يا أبا صفوان، إنك متى ما يراك الناس قد تخلفت وأنت سيد أهل الوادي تخلفوا معك، فلم يزل به أبو جهل حتى قال أما إذ غلبتني، فوالله لأشترين أجود بعير بمكة ثم قال أمية يا أم صفوان جهزيني‏.‏ فقالت له يا أبا صفوان وقد نسيت ما قال لك أخوك اليثربي قال لا، ما أريد أن أجوز معهم إلا قريبا‏.‏ فلما خرج أمية أخذ لا ينزل منزلا إلا عقل بعيره، فلم يزل بذلك حتى قتله الله عز وجل ببدر‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     From Sa`d bin Mu`adh: Sa`d bin Mu`adh was an intimate friend of Umaiya bin Khalaf and whenever Umaiya passed through Medina, he used to stay with Sa`d, and whenever Sa`d went to Mecca, he used to stay with Umaiya. When Allah's Apostle arrived at Medina, Sa`d went to perform `Umra and stayed at Umaiya's home in Mecca. He said to Umaiya, \"Tell me of a time when (the Mosque) is empty so that I may be able to perform Tawaf around the Ka`ba.\" So Umaiya went with him about midday. Abu Jahl met them and said, \"O Abu Safwan! Who is this man accompanying you?\" He said, \"He is Sa`d.\" Abu Jahl addressed Sa`d saying, \"I see you wandering about safely in Mecca inspite of the fact that you have given shelter to the people who have changed their religion (i.e. became Muslims) and have claimed that you will help them and support them. By Allah, if you were not in the company of Abu Safwan, you would not be able to go your family safely.\" Sa`d, raising his voice, said to him, \"By Allah, if you should stop me from doing this (i.e. performing Tawaf) I would certainly prevent you from something which is more valuable for you, that is, your passage through Medina.\" On this, Umaiya said to him, \"O Sa`d do not raise your voice before Abu-l-Hakam, the chief of the people of the Valley (of Mecca).\" Sa`d said, \"O Umaiya, stop that! By Allah, I have heard Allah's Apostle predicting that the Muslim will kill you.\" Umaiya asked, \"In Mecca?\" Sa`d said, \"I do not know.\" Umaiya was greatly scared by that news. When Umaiya returned to his family, he said to his wife, \"O Um Safwan! Don't you know what Sa`d told me? \"She said, \"What has he told you?\" He replied, \"He claims that Muhammad has informed them (i.e. companions that they will kill me. I asked him, 'In Mecca?' He replied, 'I do not know.\" Then Umaiya added, \"By Allah, I will never go out of Mecca.\" But when the day of (the Ghazwa of) Badr came, Abu Jahl called the people to war, saying, \"Go and protect your caravan.\" But Umaiya disliked to go out (of Mecca). Abu Jahl came to him and said, \"O Abu Safwan! If the people see you staying behind though you are the chief of the people of the Valley, then they will remain behind with you.\" Abu Jahl kept on urging him to go until he (i.e. Umaiya) said, \"As you have forced me to change my mind, by Allah, I will buy the best camel in Mecca. Then Umaiya said (to his wife). \"O Um Safwan, prepare what I need (for the journey).\" She said to him, \"O Abu Safwan! Have you forgotten what your Yathribi brother told you?\" He said, \"No, but I do not want to go with them but for a short distance.\" So when Umaiya went out, he used to tie his camel wherever he camped. He kept on doing that till Allah caused him to be killed at Badr.",
      "usc_msa_ref": "286",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4008",
      "hadith_no": "4008",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، عن عمرو بن ميمون، عن عبد الله بن مسعود  رضى الله عنه  قال استقبل النبي صلى الله عليه وسلم الكعبة فدعا على نفر من قريش، على شيبة بن ربيعة، وعتبة بن ربيعة والوليد بن عتبة، وأبي جهل بن هشام‏.‏ فأشهد بالله لقد رأيتهم صرعى، قد غيرتهم الشمس، وكان يوما حارا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet faced the Ka`ba and invoked evil on some people of Quraish, on Shaiba bin Rabi`a, `Utba bin Rabi`a, Al-Walid bin `Utba and Abu Jahl bin Hisham. I bear witness, by Allah, that I saw them all dead, putrefied by the sun as that day was a very hot day.",
      "usc_msa_ref": "297",
      "chain": [
        "30237",
        "20321",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4391",
      "hadith_no": "4391",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن عمرو بن ميمون، أن معاذا  رضى الله عنه  لما قدم اليمن صلى بهم الصبح فقرأ ‏{‏واتخذ الله إبراهيم خليلا‏}‏ فقال رجل من القوم لقد قرت عين أم إبراهيم‏.‏ زاد معاذ عن شعبة عن حبيب عن سعيد عن عمرو أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقرأ معاذ في صلاة الصبح سورة النساء فلما قال ‏{‏واتخذ الله إبراهيم خليلا‏}‏ قال رجل خلفه قرت عين أم إبراهيم‏.‏",
      "text_en": " Narrated `Amr bin Maimuin:                     When Mu`adh arrived at Yemen, he led them (i.e. the people of Yemen) in the Fajr prayer wherein he recited: 'Allah took Abraham as a Khalil.' A man amongst the people said, \"(How) glad the mother of Abraham is!\" (In another narration) `Amr said, \"The Prophet sent Mu`adh to Yemen and he (led the people) in the Fajr prayer and recited: 'Allah took Abraham as a Khalil. A man behind him said, \"(How) glad the mother of Abraham is!\"",
      "usc_msa_ref": "635",
      "chain": [
        "20193",
        "20020",
        "11331",
        "11050",
        "11382",
        "32"
      ]
    },
    {
      "id": "sahih-bukhari-4937",
      "hadith_no": "4937",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن حصين، عن عمرو بن ميمون، قال قال عمر رضى الله عنه أوصي الخليفة بالمهاجرين الأولين أن يعرف لهم حقهم، وأوصي الخليفة بالأنصار الذين تبوءوا الدار والإيمان من قبل أن يهاجر النبي صلى الله عليه وسلم أن يقبل من محسنهم ويعفو عن مسيئهم‏.‏",
      "text_en": " Narrated `Umar:                     I recommend that my successor should take care of and secure the rights of the early emigrants; and I also advise my successor to be kind to the Ansar who had homes (in Medina) and had adopted the Faith, before the Prophet migrated to them, and to accept the good from their good ones and excuse their wrong doers.",
      "usc_msa_ref": "410",
      "chain": [
        "30184",
        "20436",
        "15097",
        "11382",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-6478",
      "hadith_no": "6478",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا عمر بن أبي زائدة، عن أبي إسحاق، عن عمرو بن ميمون، قال من قال عشرا كان كمن أعتق رقبة من ولد إسماعيل‏.‏ قال عمر بن أبي زائدة وحدثنا عبد الله بن أبي السفر عن الشعبي عن ربيع بن خثيم مثله‏.‏ فقلت للربيع ممن سمعته فقال من عمرو بن ميمون‏.‏ فأتيت عمرو بن ميمون فقلت ممن سمعته فقال من ابن أبي ليلى‏.‏ فأتيت ابن أبي ليلى فقلت ممن سمعته فقال من أبي أيوب الأنصاري يحدثه عن النبي صلى الله عليه وسلم وقال إبراهيم بن يوسف عن أبيه عن أبي إسحاق حدثني عمرو بن ميمون عن عبد الرحمن بن أبي ليلى عن أبي أيوب قوله عن النبي صلى الله عليه وسلم‏.‏     وقال موسى حدثنا وهيب، عن داود، عن عامر، عن عبد الرحمن بن أبي ليلى، عن أبي أيوب، عن النبي صلى الله عليه وسلم‏.‏ وقال إسماعيل عن الشعبي عن الربيع قوله‏.‏ وقال آدم حدثنا شعبة حدثنا عبد الملك بن ميسرة سمعت هلال بن يساف عن الربيع بن خثيم وعمرو بن ميمون عن ابن مسعود قوله‏.‏ وقال الأعمش وحصين عن هلال عن الربيع عن عبد الله قوله‏.‏ ورواه أبو محمد الحضرمي عن أبي أيوب عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted one of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet saying, \"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"",
      "usc_msa_ref": "413",
      "chain": [
        "30351",
        "11643",
        "11049",
        "11382",
        "11643",
        "11636",
        "11052"
      ]
    },
    {
      "id": "sahih-bukhari-6607",
      "hadith_no": "6607",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في قبة فقال ‏\"‏ أترضون أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ قلنا نعم‏.‏ قال ‏\"‏ ترضون أن تكونوا ثلث أهل الجنة ‏\"‏‏.‏ قلنا نعم‏.‏ قال ‏\"‏ أترضون أن تكونوا شطر أهل الجنة ‏\"‏‏.‏ قلنا نعم‏.‏ قال ‏\"‏ والذي نفس محمد بيده إني لأرجو أن تكونوا نصف أهل الجنة، وذلك أن الجنة لا يدخلها إلا نفس مسلمة، وما أنتم في أهل الشرك إلا كالشعرة البيضاء في جلد الثور الأسود أو كالشعرة السوداء في جلد الثور الأحمر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were in the company of the Prophet in a tent he said, ''Would it please you to be one fourth of the people of Paradise?\" We said, \"Yes.\" He said, \"Would It please you to be one-third of the people of Paradise?\" We said, \"Yes.\" He said, \"Would it please you to be half of the people of Paradise?\" We said, \"Yes.\" Thereupon he said, \"I hope that you will be one half of the people of Paradise, for none will enter Paradise but a Muslim soul, and you people, in comparison to the people who associate others in worship with Allah, are like a white hair on the skin of a black ox, or a black hair on the skin of a red ox.\"",
      "usc_msa_ref": "535",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-6723",
      "hadith_no": "6723",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم، عن أبيه، عن أبي إسحاق، سمعت عمرو بن ميمون، قال حدثني عبد الله بن مسعود  رضى الله عنه  قال بينما رسول الله صلى الله عليه وسلم مضيف ظهره إلى قبة من أدم يمان إذ قال لأصحابه ‏\"‏ أترضون أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ أفلم ترضوا أن تكونوا ثلث أهل الجنة ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ فوالذي نفس محمد بيده، إني لأرجو أن تكونوا نصف أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     While Allah's Apostle was sitting, reclining his back against a Yemenite leather tent he said to his companions, \"Will you be pleased to be one-fourth of the people of Paradise?\" They said, 'Yes.' He said \"Won't you be pleased to be one-third of the people of Paradise\" They said, \"Yes.\" He said, \"By Him in Whose Hand Muhammad's soul is, I hope that you will be one-half of the people of Paradise.\"",
      "usc_msa_ref": "637",
      "chain": [
        "30185",
        "20427",
        "20150",
        "11063",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-153",
      "hadith_no": "153",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال كنت ردف رسول الله صلى الله عليه وسلم على حمار يقال له عفير قال فقال ‏\"‏ يا معاذ تدري ما حق الله على العباد وما حق العباد على الله ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوا الله ولا يشركوا به شيئا وحق العباد على الله عز وجل أن لا يعذب من لا يشرك به شيئا ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا أبشر الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that he observed:                      I was riding behind the Messenger of Allah (may peace be upon him) on an ass known as 'Ufair. He (Mu'adh) observed: He (the Holy Prophet) said: Mu'adh, do you know what right has Allah over His bondsmen and what right have His bondsmen over Him? Mu'adh added: I replied: Allah and his Messenger know best. Upon this he (the Holy Prophet remarked: The right of Allah over His bondsmen is that they should worship Allah and should not associate anything with Him, and the right of His bondsmen over Allah, Glorious and Sublime, is that He does not punish him who associates not anything with Him. He (Mu'adh) added: I said to the Messenger of Allah: Should I then give the tidings to the people? He (the Holy Prophet) said: Do not tell them this good news, for they would trust in it alone.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "id": "sahih-muslim-551",
      "hadith_no": "551",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضون أن تكونوا ربع أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ أما ترضون أن تكونوا ثلث أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة وسأخبركم عن ذلك ما المسلمون في الكفار إلا كشعرة بيضاء في ثور أسود أو كشعرة سوداء في ثور أبيض ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported:                      The Messenger of Allah (may peace be upon him) addressing us said: Aren't you pleased that you should constitute one-fourth of the inhabitants of Paradise? He (the narrator) said: We glorified (our Lord, i. e. we called aloud Allah-o Akbar, Allah is the Greatest). He, then, again said: Aren't you pleased that you should constitute one-third of the inhabitants of Paradise? He (the narrator) said: We glorified (our Lord) and he (the Holy Prophet) then again said: I hope that you would constitute half of the inhabitants of Paradise and I shall explain to you its (reason). The believers among the unbelievers would not be more than a white hair on (the body of a) black ox or a black hair on (the body of a) white ox.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-552",
      "hadith_no": "552",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم في قبة نحوا من أربعين رجلا فقال ‏\"‏ أترضون أن تكونوا ربع أهل الجنة قال قلنا نعم ‏.‏ فقال ‏\"‏ أترضون أن تكونوا ثلث أهل الجنة ‏\"‏ فقلنا نعم ‏.‏ فقال ‏\"‏ والذي نفسي بيده إني لأرجو أن تكونوا نصف أهل الجنة وذاك أن الجنة لا يدخلها إلا نفس مسلمة وما أنتم في أهل الشرك إلا كالشعرة البيضاء في جلد الثور الأسود أو كالشعرة السوداء في جلد الثور الأحمر ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      We, about forty men, were with the Messenger of Allah (may peace be upon him) in a camp when he said: Aren't you pleased that they should constitute one-fourth of the inhabitants of Paradise? He (the narrator) said: Yes. He (the Holy Prophet) again said: Aren't you pleased that you should constitute one-third of the inhabitants of Paradise? They said: Yes. Upon this he again said: By Him in Whose Hand is my life, I hope that you would constitute one-half of the inhabitants of Paradise and the reason is that no one would be admitted into Paradise but a believer and you are no more among the polytheists than as a white hair on the skin of a black ox or a black hair on the skin of a red ox.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-553",
      "hadith_no": "553",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا مالك، - وهو ابن مغول - عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال خطبنا رسول الله صلى الله عليه وسلم فأسند ظهره إلى قبة أدم فقال ‏\"‏ ألا لا يدخل الجنة إلا نفس مسلمة اللهم هل بلغت اللهم اشهد ‏.‏ أتحبون أنكم ربع أهل الجنة ‏\"‏ ‏.‏ فقلنا نعم يا رسول الله ‏.‏ فقال ‏\"‏ أتحبون أن تكونوا ثلث أهل الجنة ‏\"‏ ‏.‏ قالوا نعم يا رسول الله ‏.‏ قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة ما أنتم في سواكم من الأمم إلا كالشعرة السوداء في الثور الأبيض أو كالشعرة البيضاء في الثور الأسود ‏\"‏ ‏.‏",
      "text_en": " Abdullah b Mas'ud reported:                      The Messenger of Allah (may peace be upon him) addressed us and then supported his back (by reclining) against a leather tent and said: Behold, no one but a believing person would enter Paradise. O Allah, (see) have I conveyed (it not)? 0 Allah, be witness (to it that I have conveyed it). (Then addressing the companions) he said: Don't you like that you should constitute one-fourth of the inhabitants of Paradise? We said: Yes, Messenger of Allah. He again said: Don't you like that you should constitute one-third of the inhabitants of Paradise? They said: Yes, Messenger of Allah. He said: I hope that you would constitute one- half of the inhabitants of Paradise and you would be among the peoples of the world, like a black hair on (the body of) a white ox or like a white hair on the body of a black ox.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20358",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-289-3",
      "hadith_no": "289",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو كامل الجحدري، حدثنا عبد الواحد، - يعني ابن زياد ح وحدثنا أبو كريب، أخبرنا ابن المبارك، وابن أبي زائدة، كلهم عن عمرو بن ميمون، بهذا الإسناد أما ابن أبي زائدة فحديثه كما قال ابن بشر أن رسول الله صلى الله عليه وسلم كان يغسل المني وأما ابن المبارك وعبد الواحد ففي حديثهما قالت كنت أغسله من ثوب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Kuraib, Ibn al-Mubarak, Ibn Abu Za'ida all of them narrated from Amr b. Maimun with the same chain of transmitters. Ibn Abu Za'ida narrated as was transmitted from Ibn Bishr that the Messenger of Allah (may peace be upon him) washed semen, and in the hadith transmitted on the authority of Ibn Mabarak and Abdul Wahid the words are:                     \" She (A'isha) reported: I used to wash it from the garment of the Messenger of Allah (may peace be upon him).\"",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "30216",
        "20025",
        "20366",
        "11382"
      ]
    },
    {
      "id": "sahih-muslim-2639",
      "hadith_no": "2639",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبل في شهر الصوم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that the Messenger of Allah (may peace be upon him) used to kiss her during the month of fasting.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2640",
      "hadith_no": "2640",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا أبو بكر النهشلي، حدثنا زياد، بن علاقة عن عمرو بن ميمون، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يقبل في رمضان وهو صائم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) kissed (his wives) during Ramadan while observing fast.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20214",
        "20619",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4750",
      "hadith_no": "4750",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عبد الله بن عمر بن محمد بن أبان الجعفي، حدثنا عبد الرحيم، - يعني ابن سليمان - عن زكرياء، عن أبي إسحاق، عن عمرو بن ميمون الأودي، عن ابن مسعود، قال بينما رسول الله صلى الله عليه وسلم يصلي عند البيت وأبو جهل وأصحاب له جلوس وقد نحرت جزور بالأمس فقال أبو جهل أيكم يقوم إلى سلا جزور بني فلان فيأخذه فيضعه في كتفى محمد إذا سجد فانبعث أشقى القوم فأخذه فلما سجد النبي صلى الله عليه وسلم وضعه بين كتفيه قال فاستضحكوا وجعل بعضهم يميل على بعض وأنا قائم أنظر ‏.‏ لو كانت لي منعة طرحته عن ظهر رسول الله صلى الله عليه وسلم والنبي صلى الله عليه وسلم ساجد ما يرفع رأسه حتى انطلق إنسان فأخبر فاطمة فجاءت وهي جويرية فطرحته عنه ‏.‏ ثم أقبلت عليهم تشتمهم فلما قضى النبي صلى الله عليه وسلم صلاته رفع صوته ثم دعا عليهم وكان إذا دعا دعا ثلاثا ‏.‏ وإذا سأل سأل ثلاثا ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاث مرات فلما سمعوا صوته ذهب عنهم الضحك وخافوا دعوته ثم قال ‏\"‏ اللهم عليك بأبي جهل بن هشام وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عقبة وأمية بن خلف وعقبة بن أبي معيط ‏\"‏ ‏.‏ وذكر السابع ولم أحفظه فوالذي بعث محمدا صلى الله عليه وسلم بالحق لقد رأيت الذين سمى صرعى يوم بدر ثم سحبوا إلى القليب قليب بدر ‏.‏ قال أبو إسحاق الوليد بن عقبة غلط في هذا الحديث ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Mas'ud who said:                      While the Messenger of Allah (may peace be upon him) was saying his prayer near the Ka'ba and Abu Jahl with his companions was sitting (near by), Abu Jahl said, referring to the she-camel that had been slaughtered the previous day: Who will rise to fetch the foetus of the she-camel of so and so, and place it between the shoulders of Muhammad when he goes down in prostration (a posture in prayer). The one most accursed among the people got up, brought the foetus and, when the Prophet (may peace be upon him) went down in prostration, placed it between his shoulders. Then they laughed at him and some of them leaned upon the others with laughter. And I stood looking. If I had the power, I would have thrown it away from the back of the Messenger of Allah (may peace be upon him). The Prophet (may peace be upon him) had bent down his head in prostration and did not raise it, until a man went (to his house) and informed (his daughter) Fatima, who was a young girl (at that time) (about this ugly incident). She came and removed (the filthy thing) from him. Then she turned towards them rebuking them (the mischief-mongers). When the Prophet (may peace be upon him) had finished his prayer, he invoked God's imprecations upon them in a loud voice. When he prayed, he prayed thrice, and when he asked for God's blessings, he asked thrice. Then he said thrice: O Allah, it is for Thee to deal with the Quraish. When they heard his voice, laughter vanished from them and they feared his malediction. Then he said: O God, it is for Thee to deal with Abu Jahl b. Hisham, 'Utba b. Rabi'a, Shaiba b. Rabi'a. Walid b. Uqba, Umayya b. Khalaf, Uqba b. Abu Mu'ait (and he mentioned the name of the seventh person. which I did not remember). By One Who sent Muhammad with truth, I saw (all) those he had named lying slain on the Day of Badr. Their dead bodies were dragged to be thrown into a pit near the battlefield. Abu Ishiq had said that the name of Walid b. 'Uqba has been wrongly mentioned in this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11338",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4751",
      "hadith_no": "4751",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت أبا إسحاق، يحدث عن عمرو بن ميمون، عن عبد الله، قال بينما رسول الله صلى الله عليه وسلم ساجد وحوله ناس من قريش إذ جاء عقبة بن أبي معيط بسلا جزور فقذفه على ظهر رسول الله صلى الله عليه وسلم فلم يرفع رأسه فجاءت فاطمة فأخذته عن ظهره ودعت على من صنع ذلك فقال ‏\"‏ اللهم عليك الملأ من قريش أبا جهل بن هشام وعتبة بن ربيعة وعقبة بن أبي معيط وشيبة بن ربيعة وأمية بن خلف أو أبى بن خلف ‏\"‏ ‏.‏ شعبة الشاك قال فلقد رأيتهم قتلوا يوم بدر فألقوا في بئر غير أن أمية أو أبيا تقطعت أوصاله فلم يلق في البئر ‏.‏",
      "text_en": " It has been narrated by Abdullah (b. Mas'ud) who said:                      When the Messenger of Allah (may peace be upon him) was lying postrate in prayer and around him were some people from the Quraish, 'Uqba b. Abu Mu'ait brought the foetus of a she-camel and threw it on the back of the Messenger of Allah (may peace be upon him). He did not raise his head until Fatima arrived, removed it from his back and cured him who had done that (ugly act). He said: O Allah, it is for Thee to deal with the chiefs of the Quraish. Abu Jahl b. Hisham, 'Utba b. Rabi'a. Uqba b. Abu Mu'ait, Shaiba b. Rabi'a, Umayya b. Khalaf or Ubayy b. Khalaf (Shu'ba, one of the narrator of this tradition is in doubt about the exact person). I saw that all were slain in the Battle of Badr and their dead bodies were thrown into a well, except that of Umayya or Ubayy which was cut into pieces and was thrown into the well.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4753",
      "hadith_no": "4753",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا أبو إسحاق، عن عمرو بن ميمون، عن عبد الله، قال استقبل رسول الله صلى الله عليه وسلم البيت فدعا على ستة نفر من قريش ‏.‏ فيهم أبو جهل وأمية بن خلف وعتبة بن ربيعة وشيبة بن ربيعة وعقبة بن أبي معيط فأقسم بالله لقد رأيتهم صرعى على بدر ‏.‏ قد غيرتهم الشمس وكان يوما حارا ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah that, the Messenger of Allah (may peace be upon him) turned his face towards the Ka'ba and invoked God's imprecations upon six men of the Quraish, amorig whom were Abu Jahl. Umayya b. Khalaf, Utba b. Rabi'a, Shaiba b. Rabi'a and 'Uqba b. Abu Mu'ait I swear by God that I saw them lying slain in the battlefield of Badr. It being a hot day, their complexion had changed (showing signs of decay).",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "20418",
        "20321",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7020",
      "hadith_no": "7020",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر، - يعني العقدي - حدثنا عمر، - وهو ابن أبي زائدة - عن أبي إسحاق، عن عمرو بن ميمون، قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير عشر مرار كان كمن أعتق أربعة أنفس من ولد إسماعيل ‏\"‏ ‏.‏ وقال سليمان حدثنا أبو عامر حدثنا عمر حدثنا عبد الله بن أبي السفر عن الشعبي عن ربيع بن خثيم ‏.‏ بمثل ذلك قال فقلت للربيع ممن سمعته قال من عمرو بن ميمون - قال - فأتيت عمرو بن ميمون فقلت ممن سمعته قال من ابن أبي ليلى - قال - فأتيت ابن أبي ليلى فقلت ممن سمعته قال من أبي أيوب الأنصاري يحدثه عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Amr b. Maimun reported:                      He who uttered:\" There is no god but Allah, the One, having no partner with Him, His is the Sovereignty and all praise is due to Him and He is Potent over everything\" ten times, he is like one who emancipated four slaves from the progeny of Isma'il. Rabi' b. Khuthaim narrated a hadith like this. Sha'bi reported: I said to Rabi': From whom did you hear it? He said: From 'Amr b. Maimun. I came to 'Amr b. Maimun and said to him: From whom did you hear this hadith? He said: from Ibn Abi Laila. I came to Ibn Abi Laila and said to him: From whom did you hear this hadith? He said: From Abu Ayyub Ansari, who narrated from Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20443",
        "11643",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-abi-daud-432",
      "hadith_no": "432",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، دحيم الدمشقي حدثنا الوليد، حدثنا الأوزاعي، حدثني حسان، - يعني ابن عطية - عن عبد الرحمن بن سابط، عن عمرو بن ميمون الأودي، قال قدم علينا معاذ بن جبل اليمن رسول رسول الله صلى الله عليه وسلم إلينا - قال - فسمعت تكبيره مع الفجر رجل أجش الصوت - قال - فألقيت عليه محبتي فما فارقته حتى دفنته بالشام ميتا ثم نظرت إلى أفقه الناس بعده فأتيت ابن مسعود فلزمته حتى مات فقال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ كيف بكم إذا أتت عليكم أمراء يصلون الصلاة لغير ميقاتها ‏\"‏ ‏.‏ قلت فما تأمرني إن أدركني ذلك يا رسول الله قال ‏\"‏ صل الصلاة لميقاتها واجعل صلاتك معهم سبحة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Amr ibn Maymun al-Awdi said: Mu'adh ibn Jabal, the Messenger of the Messenger of Allah (ﷺ) came to us in Yemen, I heard his takbir (utterance of AllahuAkbar) in the dawn prayer. He was a man with loud voice. I began to love him. I did depart from him until I buried him dead in Syria (i.e. until his death).  Then I searched for a person who had deep understanding in religion amongst the people after him. So I came to Ibn Mas'ud and remained in his company until his death. He (Ibn Mas'ud) said: The Messenger of Allah (ﷺ) said to me: How will you act when you are ruled by rulers who say prayer beyond its proper time? I said: What do you command me, Messenger of Allah, if I witness such a time? He replied: Offer the prayer at its proper time and also say your prayer along with them as a supererogatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20024",
        "11413",
        "10646",
        "11382"
      ]
    },
    {
      "id": "sunan-abi-daud-1524",
      "hadith_no": "1524",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن علي بن سويد السدوسي، حدثنا أبو داود، عن إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، أن رسول الله صلى الله عليه وسلم كان يعجبه أن يدعو ثلاثا ويستغفر ثلاثا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) liked to supplicate three times and to ask pardon (of Allah) three times.",
      "usc_msa_ref": "",
      "chain": [
        "28001",
        "30002",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-1539",
      "hadith_no": "1539",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عمر بن الخطاب، قال كان النبي صلى الله عليه وسلم يتعوذ من خمس من الجبن والبخل وسوء العمر وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     The Prophet (ﷺ) used to seek refuge in Allah from five things; cowardliness, niggardliness, the evils of old age, evil thoughts, and punishment in the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "20311",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-1864",
      "hadith_no": "1864",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن عمرو بن ميمون، قال سمعت أبا حاضر الحميري، يحدث أبي ميمون بن مهران قال خرجت معتمرا عام حاصر أهل الشأم ابن الزبير بمكة وبعث معي رجال من قومي بهدى فلما انتهينا إلى أهل الشأم منعونا أن ندخل الحرم فنحرت الهدى مكاني ثم أحللت ثم رجعت فلما كان من العام المقبل خرجت لأقضي عمرتي فأتيت ابن عباس فسألته فقال أبدل الهدى فإن رسول الله صلى الله عليه وسلم أمر أصحابه أن يبدلوا الهدى الذي نحروا عام الحديبية في عمرة القضاء ‏.‏",
      "text_en": " Maymun ibn Mahran said:                      I came out to perform umrah in the year when the people of Syria besieged Ibn az-Zubayr at Mecca. Some people of my tribe sent sacrificial animals with me as an offering. When we reached the people of Syria, they stopped us from entering the sacred territory. I, therefore, sacrificed the animals at the same spot. I then took off ihram and returned. Next year I came out to make an atonement for my umrah. I came to Ibn Abbas and asked him (about it). He said: Bring a new sacrificial animal, for the Messenger of Allah (ﷺ) ordered his companions to bring fresh sacrificial animals for the umrah of atonement in lieu of the animals they had sacrificed in the year of al-Hudaybiyyah.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11382"
      ]
    },
    {
      "id": "sunan-abi-daud-1938",
      "hadith_no": "1938",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن كثير، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال قال عمر بن الخطاب كان أهل الجاهلية لا يفيضون حتى يروا الشمس على ثبير فخالفهم النبي صلى الله عليه وسلم فدفع قبل طلوع الشمس ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     The Arabs in the pre-Islamic period did not return from al-Muzdalifah till they saw sunlight at the mountain Thabir. The Prophet (ﷺ) opposed them and returned before the sunrise.",
      "usc_msa_ref": "",
      "chain": [
        "30169",
        "20012",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-2383",
      "hadith_no": "2383",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقبل في شهر الصوم ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) used to kiss (me) during the month of fasting.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2524",
      "hadith_no": "2524",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن عمرو بن مرة، قال سمعت عمرو بن ميمون، عن عبد الله بن ربيعة، عن عبيد بن خالد السلمي، قال ‏:‏ آخى رسول الله صلى الله عليه وسلم بين رجلين فقتل أحدهما ومات الآخر بعده بجمعة أو نحوها، فصلينا عليه، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ ما قلتم ‏\"‏ ‏.‏ فقلنا ‏:‏ دعونا له، وقلنا ‏:‏ اللهم اغفر له وألحقه بصاحبه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ فأين صلاته بعد صلاته وصومه بعد صومه ‏\"‏ ‏.‏ شك شعبة في صومه ‏:‏ ‏\"‏ وعمله بعد عمله إن بينهما كما بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydullah ibn Khalid as-Sulami:                     The Messenger of Allah (ﷺ) made a brotherhood between two men, one of whom was killed (in Allah's path), and a week or thereabouts later the other died, and we prayed at his funeral). The Messenger of Allah (ﷺ) asked: What did you say? We replied: We prayed for him and said: O Allah, forgive him, and join him to his companion. The Messenger of Allah (ﷺ) said: What about his prayers since the time the other died, and his fasting since the time the other died--the narrator Shu'bah doubted the words, \"his fasting--and his deeds since the time the other died. The distance between them is just like the distance between heaven and earth.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20020",
        "11381",
        "11382",
        "18514",
        "5164"
      ]
    },
    {
      "id": "sunan-abi-daud-2559",
      "hadith_no": "2559",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ، قال كنت ردف رسول الله صلى الله عليه وسلم على حمار يقال له عفير ‏.‏",
      "text_en": " Mu’adh said “I was seated behind the Prophet (ﷺ) on a donkey that was called ‘Ufair”.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "id": "jami-al-tirmidhi-95",
      "hadith_no": "95",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن سعيد بن مسروق، عن إبراهيم التيمي، عن عمرو بن ميمون، عن أبي عبد الله الجدلي، عن خزيمة بن ثابت، عن النبي صلى الله عليه وسلم أنه سئل عن المسح على الخفين فقال ‏\"‏ للمسافر ثلاثة وللمقيم يوم ‏\"‏ ‏.‏ وذكر عن يحيى بن معين أنه صحح حديث خزيمة بن ثابت في المسح ‏.‏ وأبو عبد الله الجدلي اسمه عبد بن عبد ويقال عبد الرحمن بن عبد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن علي وأبي بكرة وأبي هريرة وصفوان بن عسال وعوف بن مالك وابن عمر وجرير ‏.‏",
      "text_en": " Khuzaimah bin Thabit narrated:                     \"The Prophet was asked about wiping over the Khuff.  So he said: \"Three (days) for the traveler, and one day for the resident.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "20016",
        "11322",
        "11382",
        "19307",
        "410"
      ]
    },
    {
      "id": "jami-al-tirmidhi-727",
      "hadith_no": "727",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، وقتيبة، قالا حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، أن النبي صلى الله عليه وسلم كان يقبل في شهر الصوم ‏.‏ قال وفي الباب عن عمر بن الخطاب وحفصة وأبي سعيد وأم سلمة وابن عباس وأنس وأبي هريرة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ واختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في القبلة للصائم فرخص بعض أصحاب النبي صلى الله عليه وسلم في القبلة للشيخ ولم يرخصوا للشاب مخافة أن لا يسلم له صومه والمباشرة عندهم أشد ‏.‏ وقد قال بعض أهل العلم القبلة تنقص الأجر ولا تفطر الصائم ‏.‏ ورأوا أن للصائم إذا ملك نفسه أن يقبل وإذا لم يأمن على نفسه ترك القبلة ليسلم له صومه ‏.‏ وهو قول سفيان الثوري والشافعي ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet would kiss during the month of fasting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30367",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-896",
      "hadith_no": "896",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن أبي إسحاق، قال سمعت عمرو بن ميمون، يحدث يقول كنا وقوفا بجمع فقال عمر بن الخطاب إن المشركين كانوا لا يفيضون حتى تطلع الشمس وكانوا يقولون أشرق ثبير ‏.‏ وإن رسول الله صلى الله عليه وسلم خالفهم ‏.‏ فأفاض عمر قبل طلوع الشمس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Amr bin Maimun narrated:                     \"We were halted at Jama when Umar bin Al-Khattab said: 'The idolaters would not depart until the sun had risen and they would say: \"Let the sun shine on Thabir\" and indeed the Messenger of Allah contradicted them.' So Umar departed before the rising of the sun.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11049",
        "11382"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2726",
      "hadith_no": "2726",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا فروة بن أبي المغراء، أخبرنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة من نساء أهل الجنة ليرى بياض ساقها من وراء سبعين حلة حتى يرى مخها وذلك بأن الله يقول‏:‏ ‏(‏كأنهن الياقوت والمرجان ‏)‏ فأما الياقوت فإنه حجر لو أدخلت فيه سلكا ثم استصفيته لأريته من ورائه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Prophet (s.a.w) said:                     \"Indeed, a woman from the wives of the people of Paradise, the whiteness of her shin is visible through seventy garments until her marrow is seen, and that is because Allah, he Exalted, says: As if they are corundum and Marjan. So, as for the corundum, it is a stone that if you were to enter a wire through it, then you polished its cloudiness away, you would surely be able to see it through it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30207",
        "20341",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2727",
      "hadith_no": "2727",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20341",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2728",
      "hadith_no": "2728",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، نحوه بمعناه ولم يرفعه ‏.‏ وهذا أصح من حديث عبيدة بن حميد وهكذا روى جرير وغير واحد عن عطاء بن السائب ولم يرفعوه ‏.‏",
      "text_en": " (Another chain:                     ) From 'Abdullah bin Mas'ud, similar in meaning, and he did not report it in Marfu' form.And this is more correct than the narration of 'Abidah bin Humaid (a narrator in no.2533), and it has been reported like this by Jarir and more than one from 'Ata' bin As-Sa'ib, and they did not mention it in Marfu' form.[Qutaibah repoted to us (he said): \"Jarir reported to us, from 'Ata' bin As-Sa'ib and it is similar to the narration of Abu Al-Ahwas. The companions of 'Ata' did not narrate it in Marfu' form, and this is more correct.]",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2744",
      "hadith_no": "2744",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن أبي إسحاق، قال سمعت عمرو بن ميمون، يحدث عن عبد الله بن مسعود، قال كنا مع النبي صلى الله عليه وسلم في قبة نحوا من أربعين فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أترضون أن تكونوا ربع أهل الجنة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ أترضون أن تكونوا ثلث أهل الجنة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ أترضون أن تكونوا شطر أهل الجنة إن الجنة لا يدخلها إلا نفس مسلمة ما أنتم في الشرك إلا كالشعرة البيضاء في جلد الثور الأسود أو كالشعرة السوداء في جلد الثور الأحمر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عمران بن حصين وأبي سعيد الخدري ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated:                     \"We were in a tent with the Messenger of Allah (s.a.w), about forty of us when the Messenger of Allah (s.a.w) said to us: 'Would you be pleased to be a quarter of the people of Paradise?' They said:'Yes.' He said: 'Would you be pleased to be a third of the people of Paradise?' They said: 'Yes.' He said: 'Would you be pleased to be one half of the people of Paradise? Verily none shall enter Paradise except a Muslim soul. And you are not with relation to Shirk except like the white hair on the hide of a black bull or like the black hair on the hide of a red bull.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2643-2",
      "hadith_no": "2643",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حقه عليهم أن يعبدوه ولا يشركوا به شيئا ‏\"‏ ‏.‏ قال ‏\"‏ فتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن معاذ بن جبل ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     that the Messenger of Allah (ﷺ) said: \"Do you know what Allah's right upon His slaves is?\" I said: \"Allah and His Messenger know best.\" He said: \"His right upon them is that they worship Him alone and do not associate any partners with Him.\" He said: \"And do you know what their right over Allah is if they do that?\" I said: \"Allah and His Messenger know best.\" He said: \"That He will not punish them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3141",
      "hadith_no": "3141",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة، ومحمد بن بشار، قالا حدثنا عبد الرحمن بن مهدي، حدثنا زائدة، عن منصور، عن هلال بن يساف، عن ربيع بن خثيم، عن عمرو بن ميمون، عن عبد الرحمن بن أبي ليلى، عن امرأة، وهي امرأة أبي أيوب عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن من قرأ الله الواحد الصمد فقد قرأ ثلث القرآن ‏\"‏ ‏.‏ وفي الباب عن أبي الدرداء وأبي سعيد وقتادة بن النعمان وأبي هريرة وأنس وابن عمر وأبي مسعود ‏.‏ قال أبو عيسى هذا حديث حسن ولا نعرف أحدا روى هذا الحديث أحسن من رواية زائدة وتابعه على روايته إسرائيل والفضيل بن عياض وقد روى شعبة وغير واحد من الثقات هذا الحديث عن منصور واضطربوا فيه ‏.‏",
      "text_en": " Narrated Abu Ayyub:                     that the Messenger of Allah (ﷺ) said: \"Would one of you like to recite a third of the Qur'an during a night? Whoever recited: Allaahu Al-Wahid As-Samad then he has recited a third of the Qur'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30160",
        "20033",
        "20320",
        "11067",
        "10835",
        "11382",
        "11196",
        "33"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3460-2",
      "hadith_no": "3460",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن أبي زياد الكوفي، حدثنا عبد الله بن أبي بكر السهمي، عن حاتم بن أبي صغيرة، عن أبي بلج، عن عمرو بن ميمون، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما على الأرض أحد يقول لا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏.‏ إلا كفرت عنه خطاياه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى شعبة هذا الحديث عن أبي بلج بهذا الإسناد نحوه ولم يرفعه وأبو بلج اسمه يحيى بن أبي سليم ويقال أيضا يحيى بن سليم ‏.‏ حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن حاتم بن أبي صغيرة، عن أبي بلج، عن عمرو بن ميمون، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم نحوه وحاتم يكنى أبا يونس القشيري ‏.‏حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بلج، نحوه ولم يرفعه ‏.‏",
      "text_en": " Abdullah bin Amr narrated that :                     the Messenger of Allah said: “there is not anyone upon the earth who says: ‘None has the right to be worshipped but Allah, and Allah is the Greatest, and there is no might nor power except by Allah, (La Ilaha Illallah, Wa Allahu Akbar, Wa La Hawla Wa La Quwwata Illa Billah) except that his sins shall be pardoned, even if they were like the foam of the sea.”",
      "usc_msa_ref": "",
      "chain": [
        "11274",
        "11382",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3567-2",
      "hadith_no": "3567",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا زكريا بن عدي، حدثنا عبيد الله، هو ابن عمرو الرقي عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من الجبن وأعوذ بك من البخل وأعوذ بك من أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن أبو إسحاق الهمداني مضطرب في هذا الحديث يقول عن عمرو بن ميمون عن عمر ويقول عن غيره ويضطرب فيه قال أبو عيسى هذا حديث حسن صحيح من هذا الوجه ‏.‏",
      "text_en": " Mus’ab bin Sa’d and Amr bin Maimun narrated:                     “Sa’d used to teach his children these words just as the Muktib teaches children, he would say: ‘Indeed, the Messenger of Allah used to seek refuge by saying them at the end of (every) Salat: O Allah I seek refuge in You from miserliness, I seek refuge in You from feeble old age, and I seek refuge in You from the trial of the world, and the punishment of the grave (Allahumma Inni A’udhu Bika Minal-Jubn, Wa A’udhu Bika Minal-Bukhl, Wa A’udhu Bika Min Ardhalil-Umur, Wa A’udhu Bika Min Fitnatid-Dunya Wa Adhabil Qabr).’”",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30464",
        "20445",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4097",
      "hadith_no": "4097",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا إبراهيم بن المختار، عن شعبة، عن أبي بلج، عن عمرو بن ميمون، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أمر بسد الأبواب إلا باب علي ‏.‏ قال هذا حديث غريب لا نعرفه عن شعبة بهذا الإسناد إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Prophet (ﷺ) ordered that the gates be closed, except the gate of 'Ali.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20111",
        "20020",
        "11382",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4099",
      "hadith_no": "4099",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد، حدثنا إبراهيم بن المختار، عن شعبة، عن أبي بلج، عن عمرو بن ميمون، عن ابن عباس، قال أول من صلى علي ‏.‏ قال هذا حديث غريب من هذا الوجه لا نعرفه من حديث شعبة عن أبي بلج إلا من حديث محمد بن حميد ‏.‏ وأبو بلج اسمه يحيى بن أبي سليم ‏.‏ وقد اختلف أهل العلم في هذا فقال بعضهم أول من أسلم أبو بكر الصديق ‏.‏ وقال بعضهم أول من أسلم علي ‏.‏ وقال بعض أهل العلم أول من أسلم من الرجال أبو بكر وأسلم علي وهو غلام ابن ثمان سنين وأول من أسلم من النساء خديجة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     Ibn 'Abbas said: \"The first to perform Salat was 'Ali.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20111",
        "20020",
        "11382",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-309",
      "hadith_no": "309",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا خالد، - يعني ابن مخلد - قال حدثنا علي، - وهو ابن صالح - عن أبي إسحاق، عن عمرو بن ميمون، قال حدثنا عبد الله، في بيت المال قال كان رسول الله صلى الله عليه وسلم يصلي عند البيت وملأ من قريش جلوس وقد نحروا جزورا فقال بعضهم أيكم يأخذ هذا الفرث بدمه ثم يمهله حتى يضع وجهه ساجدا فيضعه - يعني - على ظهره قال عبد الله فانبعث أشقاها فأخذ الفرث فذهب به ثم أمهله فلما خر ساجدا وضعه على ظهره فأخبرت فاطمة بنت رسول الله صلى الله عليه وسلم وهي جارية فجاءت تسعى فأخذته من ظهره فلما فرغ من صلاته قال ‏\"‏ اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاث مرات ‏\"‏ اللهم عليك بأبي جهل بن هشام وشيبة بن ربيعة وعتبة بن ربيعة وعقبة بن أبي معيط ‏\"‏ ‏.‏ حتى عد سبعة من قريش ‏.‏ قال عبد الله فوالذي أنزل عليه الكتاب لقد رأيتهم صرعى يوم بدر في قليب واحد ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                      \"Abdullah told us: 'The Messenger of Allah (ﷺ) was praying at the House (the Ka'bah) and a group of the nobles of Quraish were sitting there. They had just slaughtered a camel and one of them said: \"Which of you will take these stomach contents with the blood and wait until he prostrates, then put them on his back?\" 'Abdullah said: 'The one who was most doomed got up and took the stomach contents, then went and waited until he prostrated himself, and put it on his back. Fatimah, the daughter of the Messenger of Allah (ﷺ), who was a young girl, was told about that, and she came running and took it off his back. When he had finished praying he said: \"O Allah! Punish the Quraish,\" three times, \"O Allah, punish Abu Jahl bin Hisham, Shaibah bin Rabi'ah, 'Utbah bin Rabi'ah, 'Uqbah bin Abi Mu'ait\" until he had listed seven men from Quraish.' 'Abdullah said: 'By the One Who revealed the Book to him, I saw them dead on the day of Badr (their corpses) in a single dry well.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "30463",
        "20593",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-996",
      "hadith_no": "996",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا زائدة، عن منصور، عن هلال بن يساف، عن ربيع بن خثيم، عن عمرو بن ميمون، عن ابن أبي ليلى، عن امرأة، عن أبي أيوب، عن النبي صلى الله عليه وسلم قال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ ثلث القرآن ‏\"‏ ‏.‏ قال أبو عبد الرحمن ما أعرف إسنادا أطول من هذا ‏.‏",
      "text_en": " It was narrated from Abu Ayyub that:                     The Prophet (ﷺ) said: \"Say: He is Allah, (the) One\" is one-third of the Quran.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20320",
        "11067",
        "10835",
        "11382",
        "11196",
        "33"
      ]
    },
    {
      "id": "sunan-an-nasai-1985",
      "hadith_no": "1985",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت عمرو بن ميمون، يحدث عن عبد الله بن ربيعة السلمي، وكان، من أصحاب رسول الله صلى الله عليه وسلم عن عبيد بن خالد السلمي أن رسول الله صلى الله عليه وسلم آخى بين رجلين فقتل أحدهما ومات الآخر بعده فصلينا عليه فقال النبي صلى الله عليه وسلم ‏\"‏ ما قلتم ‏\"‏ ‏.‏ قالوا دعونا له اللهم اغفر له اللهم ارحمه اللهم ألحقه بصاحبه فقال النبي صلى الله عليه وسلم ‏\"‏ فأين صلاته بعد صلاته وأين عمله بعد عمله فلما بينهما كما بين السماء والأرض ‏\"‏ ‏.‏ قال عمرو بن ميمون أعجبني لأنه أسند لي ‏.‏",
      "text_en": " It was narrated from 'Amr bin Maimun from \"Abdullah bin Rubayy'ah As-Sulami, who was also one of the Companions of Allah's Messenger from 'Ubaid bin Khalid As-Sulami, that:                     the Messenger of Allah established the bond of brotherhood between two men. One of them was killed and the other died after him. We offered the funeral prayer for him, and the Prophet said: \"What did you say?\" They said: \"O Allah, forgive him; O Allah, have mercy on him; O Allah, join him with his companion.\" The Prophet said: \"Where is his Salah in comparison to his companion's Salah? Where are his deeds in comparison to his companion's deeds? Indeed the difference between heaven and Earth.\" (One of narrators) 'Amr bin Maimun Said: \"I was happy with that because he raised it for me.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20020",
        "11381",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-3047",
      "hadith_no": "3047",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن أبي إسحاق، عن عمرو بن ميمون، قال سمعته يقول شهدت عمر بجمع فقال إن أهل الجاهلية كانوا لا يفيضون حتى تطلع الشمس ويقولون أشرق ثبير وإن رسول الله صلى الله عليه وسلم خالفهم ثم أفاض قبل أن تطلع الشمس ‏.‏",
      "text_en": " It was narrated that Amr bin Maimun aid:                     \"I head him say 'I saw 'Umar in Al-Muzdalifah and he said: The people of the Jahiliyyah would not depart until the sun had risen, and they would say: Shine, O Thabir! The Messenger of Allah differed from them and departed before the sun had risen.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5443",
      "hadith_no": "5443",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبيد الله، قال حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عمر، أن النبي صلى الله عليه وسلم كان يتعوذ من الجبن والبخل وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated from 'Umar that:                     The Prophet [SAW] used to seek refuge with Allah from cowardice, miserliness, the tribulation of the heart and the torment of the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "11201",
        "20311",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-5446",
      "hadith_no": "5446",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال حدثنا الفضل بن موسى، عن زكريا، عن أبي إسحاق، عن عمرو بن ميمون، عن ابن مسعود، قال كان النبي صلى الله عليه وسلم يتعوذ من خمس من البخل والجبن وسوء العمر وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"The Prophet [SAW] used to seek refuge (with Allah) from five things: From miserliness, cowardice, reaching the age of second childhood, the tribulation of the heart and the torment of the grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30380",
        "20452",
        "11338",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-5447",
      "hadith_no": "5447",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يحيى بن محمد، قال حدثنا حبان بن هلال، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عمرو بن ميمون الأودي، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المعلم الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏ فحدثت بها مصعبا فصدقه ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he said that the Messenger of Allah [SAW] used to seek refuge by means of them at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave.) So I narrated that to Mus'ab and he said that he told the truth.\"",
      "usc_msa_ref": "",
      "chain": [
        "20218",
        "20469",
        "11368",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5479",
      "hadith_no": "5479",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن إسرائيل، عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون الأودي، قالا كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن في دبر كل صلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mus'ab bin Sa'd and 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he would say that the Messenger of Allah [SAW] used to seek refuge (with Allah) with these words at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika mnal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge with You from the trials of this life and the torment of the grave.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "28464",
        "11201",
        "20311",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5480",
      "hadith_no": "5480",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن فضالة، عن عبيد الله، قال أنبأنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عمر، أن النبي صلى الله عليه وسلم كان يتعوذ من الجبن والبخل وسوء العمر وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated from 'Umar that:                     The Prophet [SAW] used to seek refuge with Allah from cowardice, miserliness, reaching the age of second childhood, the trials of the heart and the torment of the grave.",
      "usc_msa_ref": "",
      "chain": [
        "38045",
        "11201",
        "20311",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-5481",
      "hadith_no": "5481",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا سليمان بن سلم البلخي، - هو أبو داود المصاحفي - قال أنبأنا النضر، قال أنبأنا يونس، عن أبي إسحاق، عن عمرو بن ميمون، قال سمعت عمر بن الخطاب، يقول كان رسول الله صلى الله عليه وسلم يتعوذ من خمس ‏\"‏ اللهم إني أعوذ بك من الجبن والبخل وسوء العمر وفتنة الصدر وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Urwah bin Maimun said:                     \"I heard 'Umar bin Al-Khattab say: 'The Messenger of Allah [SAW] used to seek refuge with Allah from five things and say: Allahumma inni a'udhu bika minal-jubni, wal-bukhli, wa suw'il-'umuri, wa fitnatis-sadri wa 'adhabil-qabr (O Allah, I seek refuge with You from cowardice, miserliness, reaching the age of second childhood, the trials of the heart and the torment of the grave.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "20291",
        "20475",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-5482",
      "hadith_no": "5482",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن عمرو بن ميمون، قال حدثني أصحاب، محمد صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يتعوذ من الشح والجبن وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"The Companions of Muhammad [SAW] told me that the Messenger of Allah [SAW] used to seek refuge with Allah from stinginess, cowardice, the trials of the heart and the torment of the grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5483",
      "hadith_no": "5483",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال كان النبي صلى الله عليه وسلم يتعوذ مرسل ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"The Prophet [SAW] used to seek refuge.\" Mursal.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5497",
      "hadith_no": "5497",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أحمد بن خالد، قال حدثنا يونس، عن أبي إسحاق، - يعني أباه - عن عمرو بن ميمون، قال حججت مع عمر فسمعته يقول بجمع ألا إن النبي صلى الله عليه وسلم كان يتعوذ من خمس ‏\"‏ اللهم إني أعوذ بك من البخل والجبن وأعوذ بك من سوء العمر وأعوذ بك من فتنة الصدر وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"I went for Hajj with 'Umar, and in Muzdalifah, I heard him say that the Prophet [SAW] used to seek refuge from five things: 'Allahumma inni a'udhu bika minal-bukhli, wal-jubni, wa a'udhu bika min su'il-'umuri, wa a'udhu bika min fitnatis-sadri, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness and cowardice, and I seek refuge with You from reaching the age of second childhood, and I seek refuge in You from the ills of the heart, and I seek refuge in You from the torment of the grave.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38437",
        "20475",
        "11382"
      ]
    },
    {
      "id": "sunan-ibn-majah-24",
      "hadith_no": "24",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاذ بن معاذ، عن ابن عون، حدثنا مسلم البطين، عن إبراهيم التيمي، عن أبيه، عن عمرو بن ميمون، قال ما أخطأني ابن مسعود عشية خميس إلا أتيته فيه قال فما سمعته يقول لشىء قط قال رسول الله  صلى الله عليه وسلم  فلما كان ذات عشية قال قال رسول الله  صلى الله عليه وسلم  - قال فنكس ‏.‏ قال فنظرت إليه فهو قائم محللة أزرار قميصه قد اغرورقت عيناه وانتفخت أوداجه قال أو دون ذلك أو فوق ذلك أو قريبا من ذلك أو شبيها بذلك ‏.‏",
      "text_en": " Amr bin Maimun said :                     \"I used to visit Ibn Mas'ud every Thursday afternoon but he never uttered the words: 'The Messenger of Allah (ﷺ) said.' Then one evening, he said: 'The Messenger of Allah (ﷺ) said,' then he let his head hang down.\" He said: \"I looked at him and saw his shirt was unfastened; his eyes were filled with tears, and his veins were bulging out (with fear). He said:' Or more than that, or less than that, or close to that or something similar.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20286",
        "11071",
        "11393",
        "11322",
        "11405",
        "11382"
      ]
    },
    {
      "id": "sunan-ibn-majah-596",
      "hadith_no": "596",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن إبراهيم التيمي، عن عمرو بن ميمون، عن خزيمة بن ثابت، قال جعل رسول الله  صلى الله عليه وسلم  للمسافر ثلاثا ولو مضى السائل على مسألته لجعلها خمسا ‏.‏",
      "text_en": " It was narrated that Khuzaimah bin Thabit said:                     \"The Messenger of Allah set a time limit for the traveler of three days, and if the questioner had persisted in asking, he would have made it five (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "20016",
        "11322",
        "11382",
        "410"
      ]
    },
    {
      "id": "sunan-ibn-majah-597",
      "hadith_no": "597",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت إبراهيم التيمي، يحدث عن الحارث بن سويد، عن عمرو بن ميمون، عن خزيمة بن ثابت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة أيام - أحسبه قال - ولياليهن للمسافر في المسح على الخفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khuzaimah bin Thabit that:                     The Prophet said: \"Three days.\" I think he said, \"And three nights during which the traveler may wipe over his leather socks.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11350",
        "11322",
        "11330",
        "11382",
        "410"
      ]
    },
    {
      "id": "sunan-ibn-majah-741",
      "hadith_no": "741",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا عبد الكريم بن عبد الرحمن، عن أبي إسحاق، عن عمرو بن ميمون، عن عمر بن الخطاب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما ساء عمل قوم قط إلا زخرفوا مساجدهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     The Messenger of Allah said: \"No people's deeds ever became evil deeds but they started to adorn their places of worship.\"",
      "usc_msa_ref": "",
      "chain": [
        "35021",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-1753",
      "hadith_no": "1753",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن الجراح، قالا حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، قالت كان النبي  صلى الله عليه وسلم  يقبل في شهر الصوم ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) used to kissduring the month of fasting.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20327",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2104",
      "hadith_no": "2104",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عمر بن هياج، حدثنا قبيصة بن عقبة، حدثنا سفيان، عن عمرو بن ميمون، عن أبيه، عن الزبير بن العوام، أنه كانت عنده أم كلثوم بنت عقبة فقالت له وهي حامل طيب نفسي بتطليقة ‏.‏ فطلقها تطليقة ثم خرج إلى الصلاة فرجع وقد وضعت ‏.‏ فقال مالها خدعتني خدعها الله ثم أتى النبي  صلى الله عليه وسلم  فقال ‏\"‏ سبق الكتاب أجله اخطبها إلى نفسها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zubair bin 'Awwam that:                     he was married to Umm Kulthum bint 'Uqbah, and she said to him when she was pregnant. \"I will accept one divorce.\" So he divorced her once. Then he went out for prayer, and when he came back she had given birth. He said: \"What is wrong with her? She misled me may Allah mislead her!\" Then he came to the Prophet (ﷺ), who said: \"Her waiting period is over (and she is divorced); propose marriage a new to her.\"",
      "usc_msa_ref": "",
      "chain": [
        "35139",
        "20351",
        "20012",
        "11382",
        "7"
      ]
    },
    {
      "id": "sunan-ibn-majah-2826",
      "hadith_no": "2826",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن عمرو بن ميمون، عن معقل بن يسار المزني، قال سمعت النبي صلى الله عليه وسلم أتي بفريضة فيها جد فأعطاه ثلثا أو سدسا ‏.‏",
      "text_en": " It wasnarrated that Ma’qil bin Yasar Al-Muzani said:                      “I heard theProphet (ﷺ) when a case was brought to him which involved the shareof a grandfather. He gave him one third, or one sixth.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "10846",
        "11049",
        "11382",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-3137",
      "hadith_no": "3137",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن أبي إسحاق، عن عمرو بن ميمون، قال حججنا مع عمر بن الخطاب فلما أردنا أن نفيض، من المزدلفة قال إن المشركين كانوا يقولون أشرق ثبير كيما نغير ‏.‏ وكانوا لا يفيضون حتى تطلع الشمس فخالفهم رسول الله  صلى الله عليه وسلم  فأفاض قبل طلوع الشمس ‏.‏",
      "text_en": " It wasnarrated that ‘Amr bin Maimun said:                      “We performed Hajj with‘Umarbin Khattab, and when we wanted to depart from Muzdalifah, hesaid:‘The idolators used to say: “May the sun rise over you, OThabir!* So that we may begin our journey (to Mina),” and they didnotdepart until the sun had risen.’ So the Messenger of Allah(ﷺ)differed from them by departing before the sun rose.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20219",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-ibn-majah-3789",
      "hadith_no": "3789",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن أبي قيس الأودي، عن عمرو بن ميمون، عن أبي مسعود الأنصاري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الله أحد الواحد الصمد تعدل ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud Al Ansari said:                     \"The Messenger of Allah(ﷺ) said: \"Allahu ahad, Al-Wahidus-Samad [Allah (the) One, the One the Self-Sufficient Master] is equivalent to one third of the Quran.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11382",
        "402"
      ]
    },
    {
      "id": "sunan-ibn-majah-3844",
      "hadith_no": "3844",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عمر، أن النبي  صلى الله عليه وسلم  كان يتعوذ من الجبن والبخل وأرذل العمر وعذاب القبر وفتنة الصدر ‏.‏ قال وكيع يعني الرجل يموت على فتنة لا يستغفر الله منها ‏.‏",
      "text_en": " It was narrated from 'Umar that the :                     Prophet saas used to seek refuge with Allah from cowardice, miserliness, old age, the torment of the grave and the tribulation of the heart. (Da'if)(One of the narrators) Waki' said: \"Meaning when a man dies in a state of tribulation (Fitnah) and does not ask Allah to forgive him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20311",
        "11049",
        "11382",
        "3"
      ]
    }
  ],
  "total_hadiths": 76
}