{
  "id": "11392",
  "name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
  "full_name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Hamdani",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "16496",
      "name": "Sabih Clinet Of Sa'id bin al-Aas صبيح مولى آل سعيد بن العاص",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10773",
      "name": "Shtyr bin Shkl bin Hameed شتير بن شكل",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10791",
      "name": "'Abdur Rahman bin Hilal عبد الرحمن بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11365",
      "name": "'Abdur Rahman bin 'Ubaid bin Nastas عبد الرحمن بن عبيد بن نسطاس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11623",
      "name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15060",
      "name": "Jabir bin Yazid bin al-Harith جابر بن يزيد بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "511",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن خليل، حدثنا علي بن مسهر، عن الأعمش، عن مسلم  يعني ابن صبيح  عن مسروق، عن عائشة، أنه ذكر عندها ما يقطع الصلاة فقالوا يقطعها الكلب والحمار والمرأة‏.‏ قالت قد جعلتمونا كلابا، لقد رأيت النبي  عليه السلام  يصلي، وإني لبينه وبين القبلة، وأنا مضطجعة على السرير، فتكون لي الحاجة، فأكره أن أستقبله فأنسل انسلالا‏.‏ وعن الأعمش عن إبراهيم عن الأسود عن عائشة نحوه‏.‏",
      "text_en": " Narrated `Aisha:                     The things which annul the prayers were mentioned before me. They said, \"Prayer is annulled by a dog, a donkey and a woman (if they pass in front of the praying people).\" I said, \"You have made us (i.e. women) dogs. I saw the Prophet praying while I used to lie in my bed between him and the Qibla. Whenever I was in need of something, I would slip away. for I disliked to face him.\"",
      "chain": [
        "30186",
        "20345",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثنا إبراهيم، عن الأسود، عن عائشة،‏.‏ قال الأعمش وحدثني مسلم، عن مسروق، عن عائشة، ذكر عندها ما يقطع الصلاة الكلب والحمار والمرأة فقالت شبهتمونا بالحمر والكلاب، والله لقد رأيت النبي صلى الله عليه وسلم يصلي، وإني على السرير  بينه وبين القبلة  مضطجعة فتبدو لي الحاجة، فأكره أن أجلس فأوذي النبي صلى الله عليه وسلم فأنسل من عند رجليه‏.‏",
      "text_en": " Narrated `Aisha:                     The things which annual prayer were mentioned before me (and those were): a dog, a donkey and a woman. I said, \"You have compared us (women) to donkeys and dogs. By Allah! I saw the Prophet praying while I used to lie in (my) bed between him and the Qibla. Whenever I was in need of something, I disliked to sit and trouble the Prophet. So, I would slip away by the side of his feet.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "794",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to say in his bowing and prostrations, \"Subhanaka l-lahumma Rabbana wa bihamdika; Allahumma ghfir li.' (Exalted [from unbecoming attributes] Are you O Allah our Lord, and by Your praise [do I exalt you]. O Allah! Forgive me).",
      "chain": [
        "30329",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "817",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني منصور، عن مسلم، عن مسروق، عن عائشة  رضى الله عنها  أنها قالت كان النبي صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي ‏\"‏ يتأول القرآن‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to say frequently in his bowing and prostrations \"Subhanaka l-lahumma Rabbana wa bihamdika, Allahumma ghfir li\" (Exalted [from unbecoming attributes] Are you O Allah our Lord, and by Your praise [do I exalt you]. O Allah! Forgive me). In this way [??] he was acting on what was explained to him in the Holy Qur'an.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثني مسلم، عن مسروق، عن عائشة، قالت كل الليل أوتر رسول الله صلى الله عليه وسلم وانتهى وتره إلى السحر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle offered witr prayer at different nights at various hours extending (from the `Isha' prayer) up to the last hour of the night.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1007",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، قال كنا عند عبد الله فقال إن النبي صلى الله عليه وسلم لما رأى من الناس إدبارا قال ‏\"‏ اللهم سبع كسبع يوسف ‏\"‏‏.‏ فأخذتهم سنة حصت كل شىء حتى أكلوا الجلود والميتة والجيف، وينظر أحدهم إلى السماء فيرى الدخان من الجوع، فأتاه أبو سفيان فقال يا محمد إنك تأمر بطاعة الله وبصلة الرحم وإن قومك قد هلكوا، فادع الله لهم قال الله تعالى ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ إلى قوله ‏{‏عائدون * يوم نبطش البطشة الكبرى‏}‏ فالبطشة يوم بدر، وقد مضت الدخان والبطشة واللزام وآية الروم‏.‏",
      "text_en": " Narrated Masruq:                     We were with `Abdullah and he said, \"When the Prophet saw the refusal of the people to accept Islam he said, \"O Allah! Send (famine) years on them for (seven years) like the seven years (of famine during the time) of (Prophet) Joseph.\" So famine overtook them for one year and destroyed every kind of life to such an extent that the people started eating hides, carcasses and rotten dead animals. Whenever one of them looked towards the sky, he would (imagine himself to) see smoke because of hunger. So Abu Sufyan went to the Prophet and said, \"O Muhammad! You order people to obey Allah and to keep good relations with kith and kin. No doubt the people of your tribe are dying, so please pray to Allah for them.\" So Allah revealed: \"Then watch you For the day that The sky will bring forth a kind Of smoke Plainly visible ... Verily! You will return (to disbelief) On the day when We shall seize You with a mighty grasp. (44.10-16) Ibn Mas`ud added, \"Al-Batsha (i.e. grasp) happened in the battle of Badr and no doubt smoke, Al-Batsha, Al-Lizam, and the verse of Surat Ar-Rum have all passed .",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "1020",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، حدثنا منصور، والأعمش، عن أبي الضحى، عن مسروق، قال أتيت ابن مسعود فقال إن قريشا أبطئوا عن الإسلام،، فدعا عليهم النبي صلى الله عليه وسلم فأخذتهم سنة حتى هلكوا فيها وأكلوا الميتة والعظام، فجاءه أبو سفيان فقال يا محمد، جئت تأمر بصلة الرحم، وإن قومك هلكوا، فادع الله‏.‏ فقرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ ثم عادوا إلى كفرهم فذلك قوله تعالى ‏{‏يوم نبطش البطشة الكبرى‏}‏ يوم بدر‏.‏ قال وزاد أسباط عن منصور فدعا رسول الله صلى الله عليه وسلم، فسقوا الغيث، فأطبقت عليهم سبعا، وشكا الناس كثرة المطر فقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ فانحدرت السحابة عن رأسه، فسقوا الناس حولهم‏.‏",
      "text_en": " Narrated Masruq:                     One day I went to Ibn Mas`ud who said, \"When Quraish delayed in embracing Islam, the Prophet I invoked Allah to curse them, so they were afflicted with a (famine) year because of which many of them died and they ate the carcasses and Abu Sufyan came to the Prophet and said, 'O Muhammad! You came to order people to keep good relation with kith and kin and your nation is being destroyed, so invoke Allah I ? So the Prophet I recited the Holy verses of Sirat-Ad-Dukhan: 'Then watch you For the day that The sky will Bring forth a kind Of smoke Plainly visible.' (44.10) When the famine was taken off, the people renegade once again as nonbelievers. The statement of Allah, (in Sura \"Ad- Dukhan\"-44) refers to that: 'On the day when We shall seize You with a mighty grasp.' (44.16) And that was what happened on the day of the battle of Badr.\" Asbath added on the authority of Mansur, \"Allah's Apostle prayed for them and it rained heavily for seven days. So the people complained of the excessive rain. The Prophet said, 'O Allah! (Let it rain) around us and not on us.' So the clouds dispersed over his head and it rained over the surroundings.\"",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "2024",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أبي يعفور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم إذا دخل العشر شد مئزره، وأحيا ليله، وأيقظ أهله‏.‏",
      "text_en": " Narrated Aisha:                     With the start of the last ten days of Ramadan, the Prophet used to tighten his waist belt (i.e. work hard) and used to pray all the night, and used to keep his family awake for the prayers.",
      "chain": [
        "30026",
        "20005",
        "11403",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2084",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت لما نزلت آخر البقرة قرأهن النبي صلى الله عليه وسلم عليهم في المسجد، ثم حرم التجارة في الخمر‏.‏",
      "text_en": " Narrated Aisha:                     When the last Verses of Surat al- Baqara were revealed, the Prophet recited them in the mosque and proclaimed the trade of alcohol as illegal.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2091",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية، وكان لي على العاص بن وائل دين، فأتيته أتقاضاه قال لا أعطيك حتى تكفر بمحمد صلى الله عليه وسلم‏.‏ فقلت لا أكفر حتى يميتك الله، ثم تبعث‏.‏ قال دعني حتى أموت وأبعث، فسأوتى مالا وولدا فأقضيك فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا ‏}‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith in the Pre-Islamic period, and 'Asi bin Wail owed me some money, so I went to him to demand it. He said (to me), \"I will not pay you unless you disbelieve Muhammad.\" I said, \"I will not disbelieve till Allah kills you and then you get resurrected.\" He said, \"Leave me till I die and get resurrected, then I will be given wealth and children and I will pay you your debt.\" On that occasion it was revealed to the Prophet: 'Have you seen him who disbelieved in Our signs and says: Surely I will be given wealth and children? Has he known the unseen, or has he taken a covenant from the Beneficent (Allah)? (19.77- 78)",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2226",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  لما نزلت آيات سورة البقرة عن آخرها خرج النبي صلى الله عليه وسلم فقال ‏\"‏ حرمت التجارة في الخمر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When the last verses of Surat-al-Baqara were revealed, the Prophet went out (of his house to the Mosque) and said, \"The trade of alcohol has become illegal.\"",
      "chain": [
        "20285",
        "20020",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير بن حازم، أخبرنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية وكان لي على العاص بن وائل دراهم، فأتيته أتقاضاه فقال لا أقضيك حتى تكفر بمحمد، فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله ثم يبعثك‏.‏ قال فدعني حتى أموت ثم أبعث فأوتى مالا وولدا، ثم أقضيك‏.‏ فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ الآية‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith In the Pre-Islamic period of ignorance, and 'Asi bin Wail owed me some money. I went to him to demand it, but he said to me, \"I will not pay you unless you reject faith in Muhammad.\" I replied, \"By Allah, I will never disbelieve Muhammad till Allah let you die and then resurrect you.\" He said, \"Then wait till I die and come to life again, for then I will be given property and offspring and will pay your right.\" So, thus revelation came: \"Have you seen him who disbelieved in Our signs and yet says, 'I will be given property and offspring?' \" (19.77)",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها كانت تكره أن يجعل ‏{‏المصلي‏}‏ يده في خاصرته وتقول إن اليهود تفعله‏.‏ تابعه شعبة عن الأعمش‏.‏",
      "text_en": " Narrated `Aisha:                     That she used to hate that one should keep his hands on his flanks while praying. She said that the Jew used to do so.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4199",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، قال دخلنا على عائشة  رضى الله عنها  وعندها حسان بن ثابت ينشدها شعرا، يشبب بأبيات له وقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل فقالت له عائشة لكنك لست كذلك‏.‏ قال مسروق فقلت لها لم تأذنين له أن يدخل عليك‏.‏ وقد قال الله تعالى ‏{‏والذي تولى كبره منهم له عذاب عظيم‏}‏‏.‏ فقالت وأى عذاب أشد من العمى‏.‏ قالت له إنه كان ينافح  أو يهاجي  عن رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Masruq:                     We went to `Aisha while Hassan bin Thabit was with her reciting poetry to her from some of his poetic verses, saying \"A chaste wise lady about whom nobody can have suspicion. She gets up with an empty stomach because she never eats the flesh of indiscreet (ladies).\" `Aisha said to him, \"But you are not like that.\" I said to her, \"Why do you grant him admittance, though Allah said:-- \"and as for him among them, who had the greater share therein, his will be a severe torment.\" (24.11) On that, `Aisha said, \"And what punishment is more than blinding?\" She, added, \"Hassan used to defend or say poetry on behalf of Allah's Apostle (against the infidels).",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4338",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم، ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4582",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، عن عائشة  رضى الله عنها  قالت لما نزلت الآيات من آخر سورة البقرة في الربا قرأها رسول الله صلى الله عليه وسلم على الناس، ثم حرم التجارة في الخمر‏.‏",
      "text_en": " Narrated `Aisha:                     When the Verses of Surat-al-Baqara regarding usury (i.e. Riba) were revealed, Allah's Apostle recited them before the people and then he prohibited the trade of alcoholic liquors.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4583",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، سمعت أبا الضحى، يحدث عن مسروق، عن عائشة، أنها قالت لما أنزلت الآيات الأواخر من سورة البقرة خرج رسول الله صلى الله عليه وسلم فتلاهن في المسجد، فحرم التجارة في الخمر‏.‏",
      "text_en": " Narrated `Aisha:                     When the last Verses of Surat-al-Baqara were revealed. Allah's Apostle went out and recited them in the Mosque and prohibited the trade of alcoholic liquors.",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4584",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة، قالت لما أنزلت الآيات من آخر سورة البقرة قرأهن النبي صلى الله عليه وسلم في المسجد، وحرم التجارة في الخمر‏.‏",
      "text_en": " Narrated `Aisha:                     When the last Verses of Surat-al-Baqara were revealed, the Prophet read them in the Mosque and prohibited the trade of alcoholic liquors. \"If the debtor is in difficulty, grant him time till it is easy for him to repay..\" (2.280) Narrated `Aisha: When the last Verses of Surat-al-Baqara were revealed, Allah's Apostle stood up and recited them before us and then prohibited the trade of alcoholic liquors.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4585",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال لنا محمد بن يوسف عن سفيان، عن منصور، والأعمش، عن أبي الضحى، عن مسروق، عن عائشة، قالت لما أنزلت الآيات من آخر سورة البقرة قام رسول الله صلى الله عليه وسلم فقرأهن علينا، ثم حرم التجارة في الخمر‏.‏",
      "text_en": "",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس  أراه قال  حدثنا أبو بكر، عن أبي حصين، عن أبي الضحى، عن ابن عباس، ‏{‏حسبنا الله ونعم الوكيل‏}‏ قالها إبراهيم عليه السلام حين ألقي في النار، وقالها محمد صلى الله عليه وسلم حين قالوا ‏{‏إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     'Allah is Sufficient for us and He Is the Best Disposer of affairs,\" was said by Abraham when he was thrown into the fire; and it was said by Muhammad when they (i.e. hypocrites) said, \"A great army is gathering against you, therefore, fear them,\" but it only increased their faith and they said: \"Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).\" (3.173)",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11392"
      ]
    },
    {
      "hadith_no": "4606",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي حصين، عن أبي الضحى، عن ابن عباس، قال كان آخر قول إبراهيم حين ألقي في النار حسبي الله ونعم الوكيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The last statement of Abraham when he was thrown into the fire was:--\"Allah is Sufficient for us and He is the Best Disposer (of affairs for us).\" (3.173)",
      "chain": [
        "20357",
        "20311",
        "11371",
        "11392",
        "17"
      ]
    },
    {
      "hadith_no": "4779",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، قال سمعت خبابا، قال جئت العاصي بن وائل السهمي أتقاضاه حقا لي عنده، فقال لا أعطيك حتى تكفر بمحمد فقلت لا حتى تموت ثم تبعث‏.‏ قال وإني لميت ثم مبعوث قلت نعم‏.‏ قال إن لي هناك مالا وولدا فأقضيكه، فنزلت هذه الآية ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ رواه الثوري وشعبة وحفص وأبو معاوية ووكيع عن الأعمش‏.‏",
      "text_en": " Narrated Khabbab:                     I came to Al-`Asi bin Wail As-Sahmi and demanded something which he owed me. He said, \"I will not give you (your money) till you disbelieve in Muhammad.\" I said, \"No, I shall not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I die and then be resurrected?\" I said, 'Yes'. He said', \"Then I will have wealth and children there, and I will pay you (there).\" So this Verse was revealed:-- 'Have you then seen him who disbelieved in Our Signs and (yet) says: I shall certainly be given wealth and children? (19.77)",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "4780",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا بمكة، فعملت للعاصي بن وائل السهمي سيفا، فجئت أتقاضاه فقال لا أعطيك حتى تكفر بمحمد‏.‏ قلت لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله، ثم يحييك‏.‏ قال إذا أماتني الله ثم بعثني، ولي مال وولد فأنزل الله ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا‏}‏‏.‏ قال موثقا‏.‏ لم يقل الأشجعي عن سفيان سيفا ولا موثقا‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith in Mecca Once I made a sword for Al-`Asi bin Wail As-Sahmi. When I went to demand its price, he said, \"I will not give it to you till you disbelieve in Muhammad.\" I said, \"I shall not disbelieve in Muhammad till Allah make you die and then bring you to life again.\" He said, \"If Allah should make me die and then resurrect me and I would have wealth and children.\" So Allah revealed:-- 'Have you seen him who disbelieved in Our Signs, and (yet) says I shall certainly be given wealth and children? Has he known the unseen or has he taken a covenant from (Allah) the Beneficent?' (19.77- 78)",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "4781",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، سمعت أبا الضحى، يحدث عن مسروق، عن خباب، قال كنت قينا في الجاهلية، وكان لي دين على العاصي بن وائل قال فأتاه يتقاضاه، فقال لا أعطيك حتى تكفر بمحمد فقال والله لا أكفر حتى يميتك الله ثم تبعث‏.‏ قال فذرني حتى أموت ثم أبعث، فسوف أوتى مالا وولدا، فأقضيك فنزلت هذه الآية ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏",
      "text_en": " Narrated Masruq:                     Khabbab said, \"During the pre-lslamic period, I was a blacksmith and Al-Asi bin Wail owed me a debt.\" So Khabbab went to him to demand the debt. He said, \"I will not give you (your due) till you disbelieve in Muhammad.\" Khabbab said, \"By Allah, I shall not disbelieve in Muhammad till Allah makes you die and then resurrects you.\" Al-Asi said, \"So leave me till I die and then be resurrected, for I will be given wealth and children whereupon I will pay you your debt.\" So this Verse was revealed:-- 'Have you seen him who disbelieved in Our Signs and, (yet) says: I shall certainly be given wealth and children.' (19.77)",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "4782",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت رجلا قينا، وكان لي على العاصي بن وائل دين فأتيته أتقاضاه، فقال لي لا أقضيك حتى تكفر بمحمد‏.‏ قال قلت لن أكفر به حتى تموت ثم تبعث‏.‏ قال وإني لمبعوث من بعد الموت فسوف أقضيك إذا رجعت إلى مال وولد‏.‏ قال فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا * كلا سنكتب ما يقول ونمد له من العذاب مدا * ونرثه ما يقول ويأتينا فردا‏}‏‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith and Al-Asi Bin Wail owed me a debt, so I went to him to demand it. He said to me. \"I will not pay you your debt till you disbelieve in Muhammad.\" I said, \"I will not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I be resurrected after my death? If so, I shall pay you (there) if I should find wealth and children.\" So there was revealed:-- 'Have you seen him who disbelieved in Our Signs, and yet says: I shall certainly be given wealth and children? Has he, known to the unseen or has he taken a covenant from (Allah) the Beneficent? Nay ! We shall record what he says, and we shall add and add to his punishment. And We shall inherit from him all that he talks of, and he shall appear before Us alone.' (19.77-80)",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "4802",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت جاء حسان بن ثابت يستأذن عليها قلت أتأذنين لهذا قالت أوليس قد أصابه عذاب عظيم‏.‏ قال سفيان تعني ذهاب بصره‏.‏ فقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل قالت لكن أنت‏.‏ ‏.‏‏.‏ ‏.‏",
      "text_en": " Narrated Masruq:                     `Aisha said that Hassan bin Thabit came and asked permission to visit her. I said, \"How do you permit such a person?\" She said, \"Hasn't he received a severely penalty?\" (Sufyan, the subnarrator, said: She meant the loss of his sight.) Thereupon Hassan said the following poetic verse: \"A chaste pious woman who arouses no suspicion. She never talks about chaste heedless women behind their backs.' On that she said, \"But you are not so.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4803",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا ابن أبي عدي، أنبأنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخل حسان بن ثابت على عائشة فشبب وقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل قالت لست كذاك‏.‏ قلت تدعين مثل هذا يدخل عليك وقد أنزل الله ‏{‏والذي تولى كبره منهم‏}‏ فقالت وأى عذاب أشد من العمى وقالت وقد كان يرد عن رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Masruq:                     Hassan came to Aisha and said the following poetic Verse: 'A chaste pious woman who arouses no suspicion. She never talks against chaste heedless women behind their backs.' `Aisha said, \"But you are not,\" I said (to `Aisha), \"Why do you allow such a person to enter upon you after Allah has revealed: \"...and as for him among them who had the greater share therein'?\" (24.11) She said, \"What punishment is worse than blindness?\" She added, \"And he used to defend Allah's Apostle against the pagans (in his poetry).",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4821",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، حدثنا منصور، والأعمش، عن أبي الضحى، عن مسروق، قال بينما رجل يحدث في كندة فقال يجيء دخان يوم القيامة فيأخذ بأسماع المنافقين وأبصارهم، يأخذ المؤمن كهيئة الزكام‏.‏ ففزعنا، فأتيت ابن مسعود، وكان متكئا، فغضب فجلس فقال من علم فليقل، ومن لم يعلم فليقل الله أعلم‏.‏ فإن من العلم أن يقول لما لا يعلم لا أعلم‏.‏ فإن الله قال لنبيه صلى الله عليه وسلم ‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏ وإن قريشا أبطئوا عن الإسلام فدعا عليهم النبي صلى الله عليه وسلم فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف، فأخذتهم سنة حتى هلكوا فيها، وأكلوا الميتة والعظام ويرى الرجل ما بين السماء والأرض كهيئة الدخان ‏\"‏، فجاءه أبو سفيان فقال يا محمد جئت تأمرنا بصلة الرحم، وإن قومك قد هلكوا فادع الله، فقرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ إلى قوله ‏{‏عائدون‏}‏ أفيكشف عنهم عذاب الآخرة إذا جاء ثم عادوا إلى كفرهم فذلك قوله تعالى ‏{‏يوم نبطش البطشة الكبرى‏}‏ يوم بدر ولزاما يوم بدر ‏{‏الم * غلبت الروم‏}‏ إلى ‏{‏سيغلبون‏}‏ والروم قد مضى‏.‏",
      "text_en": " Narrated Masruq:                     While a man was delivering a speech in the tribe of Kinda, he said, \"Smoke will prevail on the Day of Resurrection and will deprive the hypocrites their faculties of hearing and seeing. The believers will be afflicted with something like cold only thereof.\" That news scared us, so I went to (Abdullah) Ibn Mas`ud while he was reclining (and told him the story) whereupon he became angry, sat up and said, \"He who knows a thing can say, it, but if he does not know, he should say, 'Allah knows best,' for it is an aspect of knowledge to say, 'I do not know,' if you do not know a certain thing. Allah said to His prophet. 'Say (O Muhammad): No wage do I ask of you for this (Qur'an), nor I am one of the pretenders (a person who pretends things which do not exist.)' (38.86) The Qur'aish delayed in embracing Islam for a period, so the Prophet invoked evil on them, saying, 'O Allah! Help me against them by sending seven years of (famine) like those of Joseph.' So they were afflicted with such a severe year of famine that they were destroyed therein and ate dead animals and bones. They started seeing something like smoke between the sky and the earth (because of severe hunger). Abu Sufyan then came (to the Prophet) and said, \"O Muhammad! You came to order us for to keep good relations with Kith and kin, and your kinsmen have now perished, so please invoke Allah (to relieve them).' Then Ibn Mas`ud recited:-- 'Then watch you for the day that the sky will bring forth a kind of smoke plainly visible....but truly you will return! (to disbelief) (44.10-15) Ibn Mas`ud added, Then the punishment was stopped, but truly, they reverted to heathenism (their old way). So Allah (threatened them thus): 'On the day when we shall seize you with a mighty grasp.' (44.16) And that was the day of the Battle of Badr. Allah's saying- \"Lizama\" (the punishment) refers to the day of Badr Allah's Statement: Alif-Lam-Mim, the Romans have been defeated, and they, after their defeat, will be victorious,' (30.1- 3) (This verse): Indicates that the defeat of Byzantine has already passed.",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4857",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخلنا على عبد الله بن مسعود، قال يا أيها الناس من علم شيئا فليقل به، ومن لم يعلم فليقل الله أعلم، فإن من العلم أن يقول لما لا يعلم الله أعلم، قال الله عز وجل لنبيه صلى الله عليه وسلم ‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏ وسأحدثكم عن الدخان إن رسول الله صلى الله عليه وسلم دعا قريشا إلى الإسلام فأبطئوا عليه فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏، فأخذتهم سنة فحصت كل شىء حتى أكلوا الميتة والجلود حتى جعل الرجل يرى بينه وبين السماء دخانا من الجوع، قال الله عز وجل ‏{‏فارتقب يوم تأتي السماء بدخان مبين * يغشى الناس هذا عذاب أليم‏}‏ قال فدعوا ‏{‏ربنا اكشف عنا العذاب إنا مؤمنون * أنى لهم الذكرى وقد جاءهم رسول مبين * ثم تولوا عنه وقالوا معلم مجنون * إنا كاشفو العذاب قليلا إنكم عائدون‏}‏ أفيكشف العذاب يوم القيامة قال فكشف ثم عادوا في كفرهم، فأخذهم الله يوم بدر قال الله تعالى ‏{‏يوم نبطش البطشة الكبرى إنا منتقمون‏}‏‏.‏",
      "text_en": " Narrated Masruq:                     We came upon `Abdullah bin Mas`ud and he said \"O people! If somebody knows something, he can say it, but if he does not know it, he should say, \"Allah knows better,' for it is a sign of having knowledge to say about something which one does not know, 'Allah knows better.' Allah said to His Prophet: 'Say (O Muhammad ! ) No wage do I ask of You for this (Qur'an) nor am I one of the pretenders (a person who pretends things which do not exist).' (38.86) Now I will tell you about Ad- Dukhan (the smoke), Allah's Apostle invited the Quraish to embrace Islam, but they delayed their response. So he said, \"O Allah! Help me against them by sending on them seven years of famine similar to the seven years of famine of Joseph.\" So the famine year overtook them and everything was destroyed till they ate dead animals and skins. People started imagining to see smoke between them and the sky because of severe hunger. Allah said: 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible, covering the people. . . This is painful torment.' (44.10-11) (So they invoked Allah) \"Our Lord! Remove the punishment from us really we are believers.\" How can there be an (effectual) reminder for them when an Apostle, explaining things clearly, has already come to them? Then they had turned away from him and said: 'One taught (by a human being), a madman?' 'We shall indeed remove punishment for a while, but truly, you will revert (to disbelief).' (44.12-15) Will the punishment be removed on the Day of Resurrection?\" `Abdullah added, \"The punishment was removed from them for a while but they reverted to disbelief, so Allah destroyed them on the Day of Badr. Allah said: 'The day We shall seize you with a mighty grasp. We will indeed (then) exact retribution.\" (44.16)",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4871",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخلت على عبد الله فقال إن من العلم أن تقول لما لا تعلم الله أعلم، إن الله قال لنبيه صلى الله عليه وسلم ‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏",
      "text_en": " Narrated `Abdullah:                     It is a sign of having knowledge that, when you do not know something, you say: 'Allah knows better.' Allah said to his Prophet: 'Say: No wage do I ask of you for this (Qur'an), nor am I one of the pretenders (a person who pretends things which do not exist)' (38.86) When the Quraish troubled and stood against the Prophet he said, \"O Allah! Help me against them by afflicting them with seven years of famine like the seven years of Joseph.\" So they were stricken with a year of famine during which they ate bones and dead animals because of too much suffering, and one of them would see something like smoke between him and the sky because of hunger. Then they said: Our Lord! Remove the torment from us, really we are believers. (44.12) And then it was said to the Prophet (by Allah), \"If we remove it from them. they will revert to their ways (of heathenism).\" So the Prophet invoked his Lord, who removed the punishment from them, but later they reverted (to heathenism), whereupon Allah punished them on the day of the Battle of Badr, and that is what Allah's Statement indicates: 'Then watch for the day that the sky will bring forth a kind of smoke plainly visible...we will indeed (then) exact retribution.' (44.10).",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4872",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا جرير بن حازم، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخلت على عبد الله ثم قال إن رسول الله صلى الله عليه وسلم لما دعا قريشا كذبوه واستعصوا عليه فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏‏.‏ فأصابتهم سنة حصت  يعني  كل شىء حتى كانوا يأكلون الميتة فكان يقوم أحدهم فكان يرى بينه وبين السماء مثل الدخان من الجهد والجوع ثم قرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين * يغشى الناس هذا عذاب أليم‏}‏ حتى بلغ ‏{‏إنا كاشفو العذاب قليلا إنكم عائدون‏}‏ قال عبد الله أفيكشف عنهم العذاب يوم القيامة قال والبطشة الكبرى يوم بدر‏.‏",
      "text_en": " Narrated Masruq:                     I came upon `Abdullah and he said, \"When Allah's Apostle invited Quraish (to Islam), they disbelieved him and stood against him. So he (the Prophet) said, \"O Allah! Help me against them by afflicting them with seven years of famine similar to the seven years of Joseph.' So they were stricken with a year of drought that destroyed everything, and they started eating dead animals, and if one of them got up he would see something like smoke between him and the sky from the severe fatigue and hunger.\" `Abdullah then recited:-- 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible, covering the people. This is a painful torment... (till he reached) ........ We shall indeed remove the punishment for a while, but truly you will revert (to heathenism): (44.10-15) `Abdullah added: \"Will the punishment be removed from them on the Day of Resurrection?\" He added,\" The severe grasp\" was the Day of the Battle of Badr.\"",
      "chain": [
        "20193",
        "11272",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4873",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد، عن شعبة، عن سليمان، ومنصور، عن أبي الضحى، عن مسروق، قال قال عبد الله إن الله بعث محمدا صلى الله عليه وسلم وقال ‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏ فإن رسول الله صلى الله عليه وسلم لما رأى قريشا استعصوا عليه فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏‏.‏ فأخذتهم السنة حتى حصت كل شىء حتى أكلوا العظام والجلود  فقال أحدهم حتى أكلوا الجلود والميتة  وجعل يخرج من الأرض كهيئة الدخان فأتاه أبو سفيان فقال أى محمد إن قومك قد هلكوا فادع الله أن يكشف عنهم فدعا ثم قال ‏\"‏ تعودوا بعد هذا ‏\"‏‏.‏ في حديث منصور ثم قرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ إلى ‏{‏عائدون‏}‏ أيكشف عذاب الآخرة فقد مضى الدخان والبطشة واللزام وقال أحدهم القمر وقال الآخر الروم‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah sent (the Prophet) Muhammad and said:-- 'Say, No wage do I ask of you for this (Qur'an) nor am I one of the pretenders (i.e. a person who pretends things which do not exist). (38.68) When Allah's Apostle saw Quraish standing against him, he said, \"O Allah! Help me against them by afflicting them with seven years of famine similar to the seven years (of famine) of Joseph. So they were afflicted with a year of drought that destroyed everything, and they ate bones and hides. (One of them said), \"And they ate hides and dead animals, and (it seemed to them that) something like smoke was coming out of the earth. So Abu Sufyan came to the Prophet and said, \"O Muhammad! Your people are on the verge of destruction! Please invoke Allah to relieve them.\" So the Prophet invoked Allah for them (and the famine disappeared). He said to them. \"You will revert (to heathenism) after that.\" `Abdullah then recited: 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible.......but truly you will revert (to disbelief).' He added, \"Will the punishment be removed from them in the Hereafter? The smoke and the grasp and the Al-Lizam have all passed.\" One of the sub-narrater said, \"The splitting of the moon.\" And another said, \"The defeat of the Romans (has passed).",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11067",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "5019",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت ما صلى النبي صلى الله عليه وسلم صلاة بعد أن نزلت عليه ‏{‏إذا جاء نصر الله والفتح‏}‏ إلا يقول فيها ‏\"‏ سبحانك ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     \"When the \"Surat-An-Nasr\", 'When comes the Help of Allah and the conquest,' had been revealed to the Prophet he did not offer any prayer except that he said therein, \"Subhanka Rabbana wa bihamdika; Allahumma ighfirli (I testify the Uniqueness of our Lord, and all the praises are for Him: O Allah, forgive me!\")",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5020",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏ يتأول القرآن‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle used to say very often in bowing and prostration (during his prayers), Subhanka Allahumma Rabbana wa bihamdika; Allahumma ighfirli,\" according to the order of the Qur'an.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5858",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قيس بن حفص، حدثنا عبد الواحد، حدثنا الأعمش، قال حدثني أبو الضحى، قال حدثني مسروق، قال حدثني المغيرة بن شعبة، قال انطلق النبي صلى الله عليه وسلم لحاجته ثم أقبل، فتلقيته بماء، فتوضأ وعليه جبة شأمية، فمضمض واستنشق وغسل وجهه، فذهب يخرج يديه من كميه فكانا ضيقين، فأخرج يديه من تحت الجبة، فغسلهما ومسح برأسه وعلى خفيه‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet went to answer the call of nature, and when he returned, I met him with water and he performed the ablution while he was wearing a Sham, cloak. He rinsed his mouth, put the water in his nose and blew it out, washed his face and tried to take his hands out of his sleeves, but they were too narrow, so he took out his hands from under his chest and washed them and then passed his wet hands over his head and Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30158",
        "20256",
        "11060",
        "11392",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "6350",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يصلي وسط السرير، وأنا مضطجعة بينه وبين القبلة تكون لي الحاجة، فأكره أن أقوم فأستقبله فأنسل انسلالا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer his prayer (while standing) in the midst of the bed, and I used to lie in front of him between him and the Qibla It I had any necessity for getting up and I used to dislike to get up and face him (while he was in prayer), but I would gradually slip away from the bed.",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال زهير حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده ‏\"‏ سبحانك اللهم ربنا وبحمدك اللهم اغفر لي ‏\"‏ ‏.‏ يتأول القرآن ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him') often said while bowing and prostrating himself:\" Glory be to Thee, O Allah, our Lord, and praise be to Thee, O Allah, forgive me,\" thus complying with the (command in) the Qur'an.",
      "chain": [
        "30022",
        "30123",
        "20321",
        "20028",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مفضل، عن الأعمش، عن مسلم بن صبيح، عن مسروق، عن عائشة، قالت ما رأيت النبي صلى الله عليه وسلم منذ نزل عليه ‏{‏ إذا جاء نصر الله والفتح‏}‏ يصلي صلاة إلا دعا أو قال فيها ‏\"‏ سبحانك ربي وبحمدك اللهم اغفر لي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      Never did I, see the Apostle of Allah (may peace be upon him) after the revelation (of these verses):\" When Allah's help and victory came.\" observin- his prayer without making (this supplication) or he said in it (supplication): Hallowed be Thee, my Lord, and with Thy praise, O Allah, forgive me.",
      "chain": [
        "30375",
        "20364",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1457",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأبو كريب قالوا حدثنا أبو معاوية، عن الأعمش، عن مسلم بن صبيح، عن شتير بن شكل، عن علي، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏\"‏ شغلونا عن الصلاة الوسطى صلاة العصر ملأ الله بيوتهم وقبورهم نارا ‏\"‏ ‏.‏ ثم صلاها بين العشاءين بين المغرب والعشاء ‏.‏",
      "text_en": " 'Ali reported:                      The Messenger of Allah (may peace be upon him) said on the day (of the Battle) of Ahzab: They diverted us from saying the middle prayer, i. e. the 'Asr prayer. May Allah fill their houses and graves with fire; he then observed this prayer between the evening prayer and the night prayer.",
      "chain": [
        "30201",
        "30022",
        "30216",
        "20354",
        "11060",
        "11392",
        "10773",
        "5"
      ]
    },
    {
      "hadith_no": "1772",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني علي بن حجر، حدثنا حسان، - قاضي كرمان - عن سعيد بن مسروق، عن أبي الضحى، عن مسروق، عن عائشة، قالت كل الليل قد أوتر رسول الله صلى الله عليه وسلم فانتهى وتره إلى آخر الليل ‏.‏",
      "text_en": " Sa'd b. Hisham b. 'Amir decided to participate in the expedition for the sake of Allah, so he came to Medina and he decided to dispose of his property there and buy arms and horses instead and fight against the Romans to the end of his life. When he came to Medina, he met the people of Medina. They dissuaded him to do such a thing, and informed him that a group of six men had decided to do so during the lifetime of the Apostle of Allah (may peace be upon him) and the Apostle of Allah (may peace be upon him) forbade them to do it, and said:                      Is there not for you a model pattern in me? And when they narrated this to him (Sa'd b. Hisham), he returned to his wife, though he had divorced her and made (people) witness to his reconciliation. He then came to Ibn 'Abbas and asked him about the Witr of the Messenger of Allah (may peace be upon him). Ibn 'Abbas said: Should I not lead you to one who knows best amongst the people of the world about the Witr of the Messenger of Allah (may peace be upon him)? He said: Who is it? He (Ibn 'Abbas) said: It is 'A'isha. So go to her and ask her (about Witr) and then come to me and inform me about her answer that she would give you. So I came to Hakim b. Aflah and requested him to take me to her. He said: I would not go to her, for I forbade her to speak anything (about the conflict) between the two groupS, but she refused (to accept my advice) and went (to participate in that corflict). I (requested) him (Hakim) with an oath to lead me to her. So we went to 'A'isha and we begged permission to meet her. She granted us permission and we went in. She said: Are you Hakim? (She recognised him.) He replied: Yes. She said: Who is there with you? He said: He is Sa'd b. Hisham. She said: Which Hisham? He said: He is Hisham b. 'Amir. She blessed him ('Amir) with mercy from Allah and spoke good of him (Qatada said that he died as a martyr in Uhud). I said: Mother of the Faithful, tell me about the character of the Messenger of Allah (may peace be upon him). She said: Don't you read the Qur'an? I said: Yes. Upon this she said: The character of the Apostle of Allah (may peace be upon him) was the Qur'an. He said: I felt inclined to get up and not ask anything (further) till death. But then I changed my mind and said: Inform me about the observance (of the night prayer) of the Messenger of Allah (may peace be upon him). She said: Did you not recite:\" O thou wrapped up\"? He said: Yes. She said: Allah, the Exalted and the Glorious, made the observance of the night prayer at the beginning of this Surah obligatory. So the Apostle of Allah (may peace be upon him and his Companions around him observed this (night prayer) for one year. Allah held back the concluding portion of this Surah for twelve months in the Heaven till (at the end of this period) Allah revealed the concluding verses of this Surah which lightened (the burden of this prayer), and the night prayer became a supererogatory prayer after being an obligatory one. I said: Mother of the Faithful, inform me about the Witr of the Messenger of Allah (may peace be upon him). She said: I used to prepare tooth stick for him and water for his ablution, and Allah would rouse him to the extent He wished during the night. He would use the tooth stick, and perform ablution, and would offer nine rak'ahs, and would not sit but in the eighth one and would remember Allah, and praise Him and supplicate Him, then he would get up without uttering the salutation and pray the ninth rak'ah. He would then sit, remember, praise Him and supplicate Him and then utter a salutation loud enough for us to hear. He would then pray two rak'ahs sitting after uttering the salutation, and that made eleven rak'ahs. O my son, but when the Apostle of Allah (may peace be upon him) grew old and put on flesh, he observed Witr of seven, doing in the two rak'ahs as he had done formerly, and that made nine. O my son, and when the Apostle of Allah (may peace be upon him) observed prayer, he liked to keep on observing it, and when sleep or pain overpowered him and made it impossible (for him) to observe prayer in the night, he prayed twelve rak'ahs daring the day. I am not aware of Allah's Prophet (may peace be upon him) having recited the whole Qur'an during one single night, or praying through the night till morning, or fasting a complete month, except Ramadan. He (the narrator) said: I then went to Ibn 'Abbas and narrated to him the hadith (transmitted from her), and he said: She says the truth If I went to her and got into her presence, I would have listened to it orally from her. He said: If I were to know that you do not go to her. I would not have transmitted this hadith to you narrated by her.",
      "chain": [
        "20387",
        "20016",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2844",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وابن أبي عمر، جميعا عن ابن عيينة، - قال إسحاق أخبرنا سفيان بن عيينة، - عن أبي يعفور، عن مسلم بن صبيح، عن مسروق، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم إذا دخل العشر أحيا الليل وأيقظ أهله وجد وشد المئزر ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that when the last ten nights began Allah's Messenger (may peace be upon him) kept awake at night (for prayer and devotion), wakened his family, and prepared himself to observe prayer (with more vigour).",
      "chain": [
        "30021",
        "30421",
        "20005",
        "30312",
        "20005",
        "11403",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأبو سعيد الأشج قالوا حدثنا وكيع، حدثنا الأعمش، عن أبي الضحى، عن مسروق، عن عائشة، - رضى الله عنها - قالت كأني أنظر إلى وبيص الطيب في مفارق رسول الله صلى الله عليه وسلم وهو يلبي‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to see the glisten- ing of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head, while he was pronouncing Talbiya.",
      "chain": [
        "30201",
        "30022",
        "30200",
        "20032",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال زهير حدثنا وقال، إسحاق أخبرنا جرير، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة، قالت لما نزلت الآيات من آخر سورة البقرة خرج رسول الله صلى الله عليه وسلم فاقترأهن على الناس ثم نهى عن التجارة في الخمر ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      When the concluding verses of Sura Baqara were revealed, Allah's Messenger (may peace be upon him) went out and read them out to the people and then forbade them to trade in wine.",
      "chain": [
        "30022",
        "30123",
        "20321",
        "30312",
        "4057",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5659",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، ح وحدثني أبو سعيد،الأشج حدثنا وكيع، حدثنا الأعمش، عن أبي الضحى، عن مسروق، عن عبد الله، قال قالرسول الله صلى الله عليه وسلم ‏\"‏ إن أشد الناس عذابا يوم القيامة المصورون ‏\"‏ ‏.‏ ولميذكر الأشج إن ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      Verity the most grievously tormented people on the Day of Resurrection would be the painters of pictures. Ashajj (one of the narrators) in the hadith narrated by him did not make mention of the word\" verity\".",
      "chain": [
        "30203",
        "20028",
        "11060",
        "20032",
        "11060",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "5836",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، زهير - واللفظ له - حدثنا جرير، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اشتكى منا إنسان مسحه بيمينه ثم قال ‏\"‏ أذهب الباس رب الناس واشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏ فلما مرض رسول الله صلى الله عليه وسلم وثقل أخذت بيده لأصنع به نحو ما كان يصنع فانتزع يده من يدي ثم قال ‏\"‏ اللهم اغفر لي واجعلني مع الرفيق الأعلى ‏\"‏ ‏.‏ قالت فذهبت أنظر فإذا هو قد قضى ‏.‏",
      "text_en": " 'A'isha reported:                      When any person amongst us fell ill, Allah's Messenger (may peace he upon him) used to rub him with his right band and then say: O Lord of the people, grant him health, heal him, for Thou art a Greet Healer. There is no healere, but with Thy healing Power one is healed and illness is removed. She further added: When Allah's Messenger (may peace be upon him) fell ill, and his illness took a serious turn I took hold of hie hand to that I should do with it what he ward to do with that (i. e. I would rub his body with his sacred hand). But he withdrew his hand from my hand and then said: O Allah, pardon me and make me join the companion. ship on She said. I was gazing at him constantly whereas he had passed away.",
      "chain": [
        "30022",
        "30123",
        "30312",
        "4057",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5839",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا أتى المريض يدعو له قال ‏\"‏ أذهب الباس رب الناس واشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏ وفي رواية أبي بكر فدعا له وقال ‏\"‏ وأنت الشافي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that when Allah's Messenger (may peace be upon him) came to visit any sick he supplicated for him and said:                      Lord of the people, remove the malady, cure him for Thou art a great Curer. There is no cure but through Thine healing Power which leaves no trouble, and in the narration transmitted on the authority of Abu Bakr there is a slight variation of wording.",
      "chain": [
        "30201",
        "30022",
        "20028",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5840",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن إبراهيم، ومسلم بن صبيح، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم بمثل حديث أبي عوانة وجرير ‏.‏",
      "text_en": " This hadith has been reported on the authority of 'A'isha through another chain of transmitters with a slight variation of wording.",
      "chain": [
        "20340",
        "20311",
        "11067",
        "11051",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "6255",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة، قالت صنع رسول الله صلى الله عليه وسلم أمرا فترخص فيه فبلغ ذلك ناسا من أصحابه فكأنهم كرهوه وتنزهوا عنه فبلغه ذلك فقام خطيبا فقال ‏\"‏ ما بال رجال بلغهم عني أمر ترخصت فيه فكرهوه وتنزهوا عنه فوالله لأنا أعلمهم بالله وأشدهم له خشية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) did an act, and held it to be valid. This news reached some persons amongst his Companions (and it was felt) that they did not approve of it and avoided (it). This reaction of theirs was conveyed to him. He stood to deliver an address; and said:                      What has happened to the people to whom there was conveyed on my behalf a matter for which I granted permission and they disapproved it and avoided it? By Allah, I have the best knowledge of Allah amongst them, and I fear Him most amongst them.",
      "chain": [
        "30022",
        "20028",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "6546",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، قال دخلت على عائشة وعندها حسان بن ثابت ينشدها شعرا يشبب بأبيات له فقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل فقالت له عائشة لكنك لست كذلك ‏.‏ قال مسروق فقلت لها لم تأذنين له يدخل عليك وقد قال الله ‏{‏ والذي تولى كبره منهم له عذاب عظيم‏}‏ فقالت فأى عذاب أشد من العمى إنه كان ينافح أو يهاجي عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Masruq reported:                      I visited 'A'isha when Hassin was sitting there and reciting verses from his compilation: She is chaste and prudent. There is no calumny against her and she rises up early in the morning without eating the meat of the un- mindful. 'A'isha said: But you are not so. Masruq said: I said to her: Why do you permit him to visit you, whereas Allah has said:\" And as for him among them who took upon himself the main part thereof, he shall have a grievous punishment\" (XXIV. ll)? Thereupon she said: What tornient can be more severe than this that he has become blind? He used to write satire as a rebuttal on behalf of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "6779",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم رجلان فكلماه بشىء لا أدري ما هو فأغضباه فلعنهما وسبهما فلما خرجا قلت يا رسول الله من أصاب من الخير شيئا ما أصابه هذان قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالت قلت لعنتهما وسببتهما قال ‏\"‏ أوما علمت ما شارطت عليه ربي قلت اللهم إنما أنا بشر فأى المسلمين لعنته أو سببته فاجعله له زكاة وأجرا ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that two persons visited Allah's Messenger (may peace be upon him) and both of them talked about a thing, of which I am not aware, but that annoyed him and he invoked curse upon both of them and hurled malediction, and when they went out I said:                      Allah's Messenger, the good would reach everyone but it would not reach these two. He said: Why so? I said: Because you have invoked curse and hurled malediction upon both of them. He said: Don't you know that I have made condition with my Lord saying thus: O Allah, I am a human being and that for a Muslim upon whom I invoke curse or hurl malediction make it a source of purity and reward.",
      "chain": [
        "30022",
        "20028",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    }
  ],
  "total_hadiths": 102
}