{
  "id": "11395",
  "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
  "full_name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "141",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B. Haritha",
      "al-Jarfi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12157",
      "name": "Sulaiman bin al-Jhm bin Aby سليمان بن الجهم بن أبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11348",
      "name": "Sa'id bin Yahmad, Abu al-Safr سعيد بن يحمد أبو السفر الهمداني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18131",
      "name": "Ja'far bin Abi al-Mughira جعفر بن أبي المغيرة الخزاعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15373",
      "name": "Atyh bin Sa'd bin Jnad'h عطية بن سعد بن جنادة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18252",
      "name": "Khalid bin Abi Nwf خالد بن أبي نوف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18401",
      "name": "Swad'h bin Abi al-J'd سوادة بن أبي الجعد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18734",
      "name": "Ata'a bin Naf' al-Kykharany عطاء بن نافع الكيخاراني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11646",
      "name": "'Umayr bin Sa'id al-Nakha'i عمير بن سعيد النخعي الصهباني",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20746",
      "name": "Abu Ja'far al-Razi أبو جعفر الرازي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20368",
      "name": "Yahya bin al-Mhlb al-Bjly يحيى بن المهلب البجلي أبو كدينة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20313",
      "name": "Isma'il bin Zakaria bin Mrh إسماعيل بن زكريا بن مرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20341",
      "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-111",
      "hadith_no": "111",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا وكيع، عن سفيان، عن مطرف، عن الشعبي، عن أبي جحيفة، قال قلت لعلي هل عندكم كتاب قال لا، إلا كتاب الله، أو فهم أعطيه رجل مسلم، أو ما في هذه الصحيفة‏.‏ قال قلت فما في هذه الصحيفة قال العقل، وفكاك الأسير، ولا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Ash-Shu`bi:                     Abu Juhaifa said, \"I asked `Ali, 'Have you got any book (which has been revealed to the Prophet apart from the Qur'an)?' `Ali replied, 'No, except Allah's Book or the power of understanding which has been bestowed (by Allah) upon a Muslim or what is (written) in this sheet of paper (with me).' Abu Juhaifa said, \"I asked, 'What is (written) in this sheet of paper?' `Ali replied, it deals with The Diyya (compensation (blood money) paid by the killer to the relatives of the victim), the ransom for the releasing of the captives from the hands of the enemies, and the law that no Muslim should be killed in Qisas (equality in punishment) for the killing of (a disbeliever).",
      "usc_msa_ref": "111",
      "chain": [
        "30376",
        "20032",
        "20012",
        "11395",
        "11052",
        "4047"
      ]
    },
    {
      "id": "sahih-bukhari-784",
      "hadith_no": "784",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن أبي العلاء، عن مطرف، عن عمران بن حصين، قال صلى مع علي  رضى الله عنه  بالبصرة فقال ذكرنا هذا الرجل صلاة كنا نصليها مع رسول الله صلى الله عليه وسلم‏.‏ فذكر أنه كان يكبر كلما رفع وكلما وضع‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     I offered the prayer with `Ali in Basra and he made us remember the prayer which we used to pray with Allah's Apostle. `Ali said Takbir on each rising and bowing.",
      "usc_msa_ref": "751",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-826",
      "hadith_no": "826",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف، قال صليت أنا وعمران، صلاة خلف علي بن أبي طالب  رضى الله عنه  فكان إذا سجد كبر، وإذا رفع كبر، وإذا نهض من الركعتين كبر، فلما سلم أخذ عمران بيدي فقال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif:                     `Imran and I prayed behind `Ali bin Abi Talib and he said Takbir on prostrating, on rising and on getting up after the two rak`at (i.e. after the second rak`a). When the prayer was finished, `Imran took me by the hand and said, \"He (`Ali) has prayed the prayer of Muhammad\" (or said, \"He made us remember the prayer of Muhammad).",
      "usc_msa_ref": "789",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "id": "sahih-bukhari-1596",
      "hadith_no": "1596",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، قال حدثني مطرف، عن عمران  رضى الله عنه  قال تمتعنا على عهد رسول الله صلى الله عليه وسلم فنزل القرآن قال رجل برأيه ما شاء‏.‏",
      "text_en": " Narrated `Imran:                     We performed Hajj-at-Tamattu` in the lifetime of Allah's Apostle and then the Qur'an was revealed (regarding Hajj-at-Tamattu`) and somebody said what he wished (regarding Hajj-at-Tamattu`) according his own opinion.",
      "usc_msa_ref": "642",
      "chain": [
        "20040",
        "20297",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-1983",
      "hadith_no": "1983",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي، عن غيلان،‏.‏ وحدثنا أبو النعمان، حدثنا مهدي بن ميمون، حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه سأله  أو سأل رجلا وعمران يسمع  فقال ‏\"‏ يا أبا فلان أما صمت سرر هذا الشهر ‏\"‏‏.‏ قال أظنه قال يعني رمضان‏.‏ قال الرجل لا يا رسول الله‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏‏.‏ لم يقل الصلت أظنه يعني رمضان‏.‏ قال أبو عبد الله وقال ثابث عن مطرف عن عمران عن النبي صلى الله عليه وسلم ‏\"‏ من سرر شعبان ‏\"‏‏.‏",
      "text_en": " Narrated Mutarrif from `Imran Ibn Husain:                     That the Prophet asked him (Imran) or asked a man and `Imran was listening, \"O Abu so-and-so! Have you fasted the last days of this month?\" (The narrator thought that he said, \"the month of Ramadan\"). The man replied, \"No, O Allah's Apostle!\" The Prophet said to him, \"When you finish your fasting (of Ramadan) fast two days (in Shawwal).\" Through another series of narrators `Imran said, \"The Prophet said, '(Have you fasted) the last days of Sha'ban?\"",
      "usc_msa_ref": "204",
      "chain": [
        "30140",
        "11307",
        "20283",
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-2544",
      "hadith_no": "2544",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن مطرف، عن الشعبي، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له جارية فعالها، فأحسن إليها ثم أعتقها وتزوجها، كان له أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"He who has a slave-girl and educates and treats her nicely and then manumits and marries her, will get a double reward.\"",
      "usc_msa_ref": "720",
      "chain": [
        "30123",
        "20356",
        "11395",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-3047",
      "hadith_no": "3047",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا مطرف، أن عامرا، حدثهم عن أبي جحيفة  رضى الله عنه  قال قلت لعلي  رضى الله عنه هل عندكم شىء من الوحى إلا ما في كتاب الله قال والذي فلق الحبة وبرأ النسمة ما أعلمه إلا فهما يعطيه الله رجلا في القرآن، وما في هذه الصحيفة‏.‏ قلت وما في الصحيفة قال العقل وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I asked `Ali, \"Do you have the knowledge of any Divine Inspiration besides what is in Allah's Book?\" `Ali replied, \"No, by Him Who splits the grain of corn and creates the soul. I don't think we have such knowledge, but we have the ability of understanding which Allah may endow a person with, so that he may understand the Qur'an, and we have what is written in this paper as well.\" I asked, \"What is written in this paper?\" He replied, \"(The regulations of) blood-money, the freeing of captives, and the judgment that no Muslim should be killed for killing an infidel.\"",
      "usc_msa_ref": "283",
      "chain": [
        "30184",
        "20321",
        "11395",
        "4047"
      ]
    },
    {
      "id": "sahih-bukhari-3896",
      "hadith_no": "3896",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا سفيان، أخبرنا مطرف، سمعت أبا السفر، يقول سمعت ابن عباس  رضى الله عنهما  يقول يا أيها الناس، اسمعوا مني ما أقول لكم، وأسمعوني ما تقولون، ولا تذهبوا فتقولوا قال ابن عباس، قال ابن عباس من طاف بالبيت فليطف من وراء الحجر، ولا تقولوا الحطيم، فإن الرجل في الجاهلية كان يحلف فيلقي سوطه أو نعله أو قوسه‏.‏",
      "text_en": " Narrated Abu As-Safar:                     I heard Ibn `Abbas saying, \"O people! Listen to what I say to you, and let me hear whatever you say, and don't go (without understanding), and start saying, 'Ibn `Abbas said so-and-so, Ibn `Abbas said soand- so, Ibn `Abbas said so-and-so.' He who wants to perform the Tawaf around the Ka`ba should go behind Al-Hijr (i.e. a portion of the Ka`ba left out unroofed) and do not call it Al-Hatim, for in the pre-Islamic period of ignorance if any man took an oath, he used to throw his whip, shoes or bow in it.",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20005",
        "11395",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4551",
      "hadith_no": "4551",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن مطرف، عن الشعبي، عن عدي بن حاتم  رضى الله عنه  قال قلت يا رسول الله ما الخيط الأبيض من الخيط الأسود أهما الخيطان قال ‏\"‏ إنك لعريض القفا إن أبصرت الخيطين ‏\"‏‏.‏ ثم قال ‏\"‏ لا بل هو سواد الليل وبياض النهار ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I said, \"O Allah's Apostle! What is the meaning of the white thread distinct from the black thread? Are these two threads?\" He said, \"You are not intelligent if you watch the two threads.\" He then added, \"No, it is the darkness of the night and the whiteness of the day.''",
      "usc_msa_ref": "37",
      "chain": [
        "30367",
        "20028",
        "11395",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-5614",
      "hadith_no": "5614",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا مطرف، عن عامر، عن البراء بن عازب  رضى الله عنهما  قال ضحى خال لي يقال له أبو بردة قبل الصلاة، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ شاتك شاة لحم ‏\"‏‏.‏ فقال يا رسول الله إن عندي داجنا جذعة من المعز‏.‏ قال ‏\"‏ اذبحها ولن تصلح لغيرك ‏\"‏‏.‏ ثم قال ‏\"‏ من ذبح قبل الصلاة فإنما يذبح لنفسه، ومن ذبح بعد الصلاة فقد تم نسكه، وأصاب سنة المسلمين ‏\"‏‏.‏ تابعه عبيدة عن الشعبي وإبراهيم‏.‏ وتابعه وكيع عن حريث عن الشعبي‏.‏ وقال عاصم وداود عن الشعبي عندي عناق لبن‏.‏ وقال زبيد وفراس عن الشعبي عندي جذعة‏.‏ وقال أبو الأحوص حدثنا منصور عناق جذعة‏.‏ وقال ابن عون عناق جذع، عناق لبن‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Apostle said to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's Apostle! I have got a domestic kid.\" The Prophet said, \"Slaughter it (as a sacrifice) but it will not be permissible for anybody other than you\" The Prophet added, \"Whoever slaughtered his sacrifice before the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, he offered his sacrifice properly and followed the tradition of the Muslims.\"",
      "usc_msa_ref": "463",
      "chain": [
        "30175",
        "20423",
        "11395",
        "11052",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-6988",
      "hadith_no": "6988",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا مطرف، قال سمعت الشعبي، قال سمعت أبا جحيفة، قال سألت عليا  رضى الله عنه  هل عندكم شىء ما ليس في القرآن وقال مرة ما ليس عند الناس فقال والذي فلق الحب وبرأ النسمة ما عندنا إلا ما في القرآن، إلا فهما يعطى رجل في كتابه، وما في الصحيفة‏.‏ قلت وما في الصحيفة قال العقل، وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Ash-Shu`bi:                     I heard Abu Juhaifa saying, \"I asked `Ali 'Have you got any Divine literature apart from the Qur'an?' (Once he said...apart from what the people have?) `Ali replied, 'By Him Who made the grain split (germinate) and created the soul, we have nothing except what is in the Qur'an and the ability (gift) of understanding Allah's Book which He may endow a man with and we have what is written in this paper.' I asked, 'What is written in this paper?' He replied, 'Al-`Aql (the regulation of Diya), about the ransom of captives, and the Judgment that a Muslim should not be killed in Qisas (equality in punishment) for killing a disbeliever.\" (See Hadith No. 283,Vol. 4)",
      "usc_msa_ref": "",
      "chain": [
        "30343",
        "20005",
        "11395",
        "11052",
        "4047",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-7001",
      "hadith_no": "7001",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا مطرف، أن عامرا، حدثهم عن أبي جحيفة، قال قلت لعلي‏.‏ وحدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا مطرف، سمعت الشعبي، يحدث قال سمعت أبا جحيفة، قال سألت عليا  رضى الله عنه  هل عندكم شىء مما ليس في القرآن  وقال ابن عيينة مرة ما ليس عند الناس  فقال والذي فلق الحبة وبرأ النسمة ما عندنا إلا ما في القرآن إلا فهما يعطى رجل في كتابه وما في الصحيفة‏.‏ قلت وما في الصحيفة قال العقل، وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I asked `Ali \"Do you have anything Divine literature besides what is in the Qur'an?\" Or, as Uyaina once said, \"Apart from what the people have?\" `Ali said, \"By Him Who made the grain split (germinate) and created the soul, we have nothing except what is in the Qur'an and the ability (gift) of understanding Allah's Book which He may endow a man, with and what is written in this sheet of paper.\" I asked, \"What is on this paper?\" He replied, \"The legal regulations of Diya (Blood-money) and the (ransom for) releasing of the captives, and the judgment that no Muslim should be killed in Qisas (equality in punishment) for killing a Kafir (disbeliever).",
      "usc_msa_ref": "50",
      "chain": [
        "30184",
        "20321",
        "11395",
        "4047",
        "30343",
        "20005",
        "11395",
        "11052",
        "4047",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-483",
      "hadith_no": "483",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا سفيان بن عيينة، عن مطرف، وابن، أبجر عن الشعبي، قال سمعت المغيرة بن شعبة، رواية إن شاء الله ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "20005",
        "11395",
        "10792",
        "11052",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-484",
      "hadith_no": "484",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، حدثنا مطرف بن طريف، وعبد الملك بن سعيد، سمعا الشعبي، يخبر عن المغيرة بن شعبة، قال سمعته على المنبر، يرفعه إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11395",
        "166"
      ]
    },
    {
      "id": "sahih-muslim-485",
      "hadith_no": "485",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "قال وحدثني بشر بن الحكم، - واللفظ له - حدثنا سفيان بن عيينة، حدثنا مطرف، وابن، أبجر سمعا الشعبي، يقول سمعت المغيرة بن شعبة، يخبر به الناس على المنبر قال سفيان رفعه أحدهما - أراه ابن أبجر - قال ‏\"‏ سأل موسى ربه ما أدنى أهل الجنة منزلة قال هو رجل يجيء بعد ما أدخل أهل الجنة الجنة فيقال له ادخل الجنة ‏.‏ فيقول أى رب كيف وقد نزل الناس منازلهم وأخذوا أخذاتهم فيقال له أترضى أن يكون لك مثل ملك ملك من ملوك الدنيا فيقول رضيت رب ‏.‏ فيقول لك ذلك ومثله ومثله ومثله ومثله ‏.‏ فقال في الخامسة رضيت رب ‏.‏ فيقول هذا لك وعشرة أمثاله ولك ما اشتهت نفسك ولذت عينك ‏.‏ فيقول رضيت رب ‏.‏ قال رب فأعلاهم منزلة قال أولئك الذين أردت غرست كرامتهم بيدي وختمت عليها فلم تر عين ولم تسمع أذن ولم يخطر على قلب بشر ‏\"‏ ‏.‏ قال ومصداقه في كتاب الله عز وجل ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين‏}‏ الآية ‏.‏",
      "text_en": " It is reported on the authority of al-Mughira b. Shu'ba that the Messenger of Allah (may peace be upon him) said:                      Moses asked his Lord: Who amongst the inhabitants of Paradise is the lowest to rank? He (Allah) said: The person who would be admitted into Paradise last of all among those deserving of Paradise who are admitted to it. I would be said to him: Enter Paradise. He would gay: O my Lord! how (should I enter) while the people have settled in their apartments and taken the shares (portions)? It would be said to him: Would you be pleased if there be for you like the kingdom of a king amongst the kings of the world? He would say: I am pleased my Lord. He (Allah) would say: For you is that, and like that, and like that, and like that, and that. He would say at the fifth (point): I am well pleased. My Lord. He (Allah) would say: It is for you and, ten times like it, and for you is what your self desires and your eye enjoys. He would say: I am well pleased, my Lord. He (Moses) said: (Which is) the highest of their (inhabitants of Paradise) ranks? He (Allah) said: They are those whom I choose. I establish their honour with My own hand and then set a seal over it (and they would be blessed with Bounties) which no eye has seen, no ear has heard and no human mind has perceived: and this is sub- stantiated by the Book of Allah, Exalted and Great:\" So no soul knows what delight of the eye is hidden for them; a reward for what they did\" (xxxii. 17).",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "20005",
        "11395",
        "10792",
        "11052",
        "166",
        "10792"
      ]
    },
    {
      "id": "sahih-muslim-393-2",
      "hadith_no": "393",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن غيلان، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب فكان إذا سجد كبر وإذا رفع رأسه كبر وإذا نهض من الركعتين كبر فلما انصرفنا من الصلاة - قال - أخذ عمران بيدي ثم قال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم ‏.‏ أو قال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Mutarrif reported:                      I and 'Imran b. Husain said prayer behind 'Ali b. Abu, Talib. He recited takbir when he prostrated, and he recited takbir when he raised his head and he recited takbir while rising up (from the sitting position at the end of two rak'ahs). When we had finished our prayer, 'Imran caught hold of my hand and said: He (Hadrat Ali) has led prayer like Muhammad (may peace be upon him) or he said: He in fact recalled to my mind the prayer of Muhammad (may peace be upon him.)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30503",
        "20022",
        "20031",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "id": "sahih-muslim-487-3",
      "hadith_no": "487",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شعبة، أخبرني قتادة، قال سمعت مطرف بن عبد الله بن الشخير، قال أبو داود وحدثني هشام، عن قتادة، عن مطرف، عن عائشة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30002",
        "20020",
        "11019",
        "11305",
        "30002",
        "20295",
        "11019",
        "11395",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2802",
      "hadith_no": "2802",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي، - وهو ابن ميمون - حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين، - رضى الله عنهما - أنصلى الله عليه وسلم قال له أو قال لرجل وهو يسمع ‏\"‏ يا فلان أصمت من سرة هذا الشهر ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) said to him (or he said to another person and he was listening to it):                      O, so and so, did you observe fast in the middle of the month? He said: No. Thereupon he (the Messenger of Allah) said: When you break it, then observe fast for two days.",
      "usc_msa_ref": "",
      "chain": [
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-2809",
      "hadith_no": "2809",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن الجريري، عن أبي، العلاء عن مطرف، عن عمران بن حصين، - رضى الله عنهما - أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ هل صمت من سرر هذا الشهر شيئا ‏\"‏ ‏.‏ قال لا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإذا أفطرت من رمضان فصم يومين مكانه ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain (Allah be pleased with them) reported that Allah's Apostle (way peace heupon him) said. to a person:                      Did you observe any fast in the middle of this month (Sha'ban)? He said: No. Thereupon the Messenger of Allah (may peace be upon him) said: Fast for two days instead of (one fast) when you have completed (fasts of) Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-2810",
      "hadith_no": "2810",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن ابن أخي، مطرف بن الشخير قال سمعت مطرفا، يحدث عن عمران بن حصين، - رضى الله عنهما - أنصلى الله عليه وسلم قال لرجل ‏\"‏ هل صمت من سرر هذا الشهر شيئا ‏\"‏ ‏.‏ يعني شعبان ‏.‏ قال لا ‏.‏ قال فقال له ‏\"‏ إذا أفطرت رمضان فصم يوما أو يومين ‏\"‏ ‏.‏ شعبة الذي شك فيه قال وأظنه قال يومين ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) said to a person:                      Did you observe fast in the middle of this month. i. e. Sha'ban? He said: No. Thereupon he said to him: When it is the end of Ramadan, then observe fast for one day or two (Shu'ba had some doubt about it) but he said: I think that he has said: two days.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-3031",
      "hadith_no": "3031",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا إسماعيل بن إبراهيم، حدثنا الجريري، عن أبي، العلاء عن مطرف، قال قال لي عمران بن حصين إني لأحدثك بالحديث اليوم ينفعك الله به بعد اليوم واعلم أن رسول الله صلى الله عليه وسلم قد أعمر طائفة من أهله في العشر فلم تنزل آية تنسخ ذلك ولم ينه عنه حتى مضى لوجهه ارتأى كل امرئ بعد ما شاء أن يرتئي ‏.‏",
      "text_en": " Mutarrif reported:                      'Imran b. Husain said to me: Should I not narrate to you a hadith today by which Allah will benefit you subsequently-and bear in mind that Allah's Messenger (may peace be upon him) made some members of his family perform 'Umra within ten days of Dhu'l-Hijja. No verse was revealed to abrogate that, and he (the Holy Prophet) did not refrain from doing it till he died. So after him everyone said as he liked, (but it would be his. personal opinion and not the verdict of the Shari'ah).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-3033",
      "hadith_no": "3033",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حميد بن هلال، عن مطرف، قال قال لي عمران بن حصين أحدثك حديثا عسى الله أن ينفعك به إن رسول الله صلى الله عليه وسلم جمع بين حجة وعمرة ثم لم ينه عنه حتى مات ولم ينزل فيه قرآن يحرمه وقد كان يسلم على حتى اكتويت فتركت ثم تركت الكى فعاد ‏.‏",
      "text_en": " Imran b. Husain reported:                      I am narrating to you a hadith by which Allah will benefit you (and the hadith is) that Allah's Messenger (may peace be upon him) combined Hajj and 'Umra, and he did not forbid (this combination) till he died. (Moreover) nothing was revealed in the Holy Qur'an which forbade it. And I was always blessed till I was branded and then it (blessing) was abandoned. I then abandoned branding and it (the blessing was restored).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11281",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-3034",
      "hadith_no": "3034",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن حميد بن هلال، قال سمعت مطرفا، قال قال لي عمران بن حصين ‏.‏ بمثل حديث معاذ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mutarrif with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11281",
        "11395"
      ]
    },
    {
      "id": "sahih-muslim-3035",
      "hadith_no": "3035",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، عن شعبة، عن قتادة، عن مطرف، قال بعث إلى عمران بن حصين في مرضه الذي توفي فيه فقال إني كنت محدثك بأحاديث لعل الله أن ينفعك بها بعدي فإن عشت فاكتم عني وإن مت فحدث بها إن شئت إنه قد سلم على واعلم أن نبي الله صلى الله عليه وسلم قد جمع بين حج وعمرة ثم لم ينزل فيها كتاب الله ولم ينه عنها نبي الله صلى الله عليه وسلم ‏.‏ قال رجل فيها برأيه ما شاء ‏.‏",
      "text_en": " Mutarrif reported:                      'Imran b. Husain sent for me during his illness of which he died, and said: I am narrating to you some ahadith which may benefit you after me. If I live you conceal (the fact that these have been transmitted by me), and if I die, then you narrate them if you like (and these are): I am blessed, and bear in mind that the Messenger of Allah (may peace be upon him) combined Hajj and Umra. Then no verse was revealed in regard to it in the Book of Allah (which abrogated it) and the Apostle of Allah (may peace be upon him) did not forbid (from doing it). And whatever a person (, Umar) said was out of his personal opinion.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11395"
      ]
    },
    {
      "id": "sahih-muslim-3037",
      "hadith_no": "3037",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا همام، حدثنا قتادة، عن مطرف، عن عمران بن حصين، - رضى الله عنه - قال تمتعنا مع رسول الله صلى الله عليه وسلم ولم ينزل فيه القرآن ‏.‏ قال رجل برأيه ما شاء ‏.‏ وحدثنيه حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا إسماعيل، بن مسلم حدثني محمد بن واسع، عن مطرف بن عبد الله بن الشخير، عن عمران بن حصين، - رضى الله عنه - بهذا الحديث قال تمتع نبي الله صلى الله عليه وسلم وتمتعنا معه ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with him) reported:                      We performed Tamattu' (Hajj and 'Umra combining together) in the company of Allah's Messenger (may peace be upon him), and nothing was revealed in the Qur'an (concerning the abrogation of this practice), and whatever a person (Hadhrat 'Umar) said was his personal opinion. 'Imran b. Husain narrated this hadith (in these words also):\" Allah's Apostle (may peace be upon him) performed Hajj Tamattu' and we also performed it along with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20250",
        "20297",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-3570",
      "hadith_no": "3570",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن مطرف، عن عامر، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم في الذي يعتق جاريته ثم يتزوجها ‏\"‏ له أجران ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that Allah's Messenger (may peace be upon him) said about one who emancipated a slave woman, and then married her, that for him there are two rewards.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "11395",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-4180",
      "hadith_no": "4180",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن مطرف، وأبي، فروة الهمداني ح وحدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن ابن عجلان، عن عبد الرحمن بن سعيد، كلهم عن الشعبي، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم بهذا الحديث غير أن حديث زكرياء أتم من حديثهم وأكثر ‏.‏",
      "text_en": " AI-Nu'man b. Bashir reported it from Allah's Apostle (may peace be upon him). The hadith narrated by Zakariya is, however, more complete and lengthy than the other ones.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11395",
        "30367",
        "20185",
        "10616",
        "11052",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-5181",
      "hadith_no": "5181",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن مطرف، عن عامر، عن  البراء، قال ضحى خالي أبو بردة قبل الصلاة فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك شاة لحم ‏\"‏ ‏.‏ فقال يا رسول الله إن عندي جذعة من المعز فقال ‏\"‏ ضح بها ولا تصلح لغيرك ‏\"‏ ‏.‏ ثم قال ‏\"‏ من ضحى قبل الصلاة فإنما ذبح لنفسه ومن ذبح بعد الصلاة فقد تم نسكه وأصاب سنة المسلمين ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' reported:                      My maternal uncle Abu Burda sacrificed his animal before ('Id) prayer. Thereupon Allah's Messenger (may peace be upon him) said: That is a goat (slaughtered for the sake of) flesh (and not as a sacrifice on the day of Adha). He said: I have a lamb of six months. Thereupon he said: Offer it as a sacrifice, but it will not justify for anyone except you, and then said: He who sacrificed (the animal) before ('Id) prayer, he in fact slaughtered it for his own self, and he who slaughtered after prayer, his ritual of sacrifice became complete and he in fact observed the religious practice of the Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "11395",
        "11052",
        "400"
      ]
    },
    {
      "id": "sahih-muslim-5466",
      "hadith_no": "5466",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن مطرف، عن الحكم، عن الحسن، عن عمرو بن حريث، عن سعيد بن زيد بن عمرو بن نفيل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن الذي أنزل الله تبارك وتعالى على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail reported Allah's Messenger (may peace be upon him) as saying:                      Truffles are a kind of 'Manna' which Allah the Glorious and Exalted, sent down upon the people of Israil, and its juice is a medicine for the eyes.",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "11395",
        "11069",
        "11016",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-muslim-5467",
      "hadith_no": "5467",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن مطرف، عن الحكم بن عتيبة، عن  الحسن العرني، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن الذي أنزل الله على موسى وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid reported Allal a Messenger (may peace be upon him) as saying:                      Truffles are a kind of 'Manna' which Allah sent down upon Moses and their juice is a medicine for the eyes.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11395",
        "11069",
        "11623",
        "5202",
        "11"
      ]
    },
    {
      "id": "sahih-muslim-6752",
      "hadith_no": "6752",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا إسحاق الحنظلي، أخبرنا جرير، عن مطرف، عن الشعبي، عن النعمان بن، بشير عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " Nu'man b. Bashir reported a hadith like this from Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11395",
        "11052",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-6907",
      "hadith_no": "6907",
      "source": "Sahih Muslim",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا حماد بن زيد، عن يزيد الضبعي، حدثنا مطرف، عن عمران بن حصين، قال قيل يا رسول الله أعلم أهل الجنة من أهل النار قال فقال ‏\"‏ نعم ‏\"‏ ‏.‏ قال قيل ففيم يعمل العاملون قال ‏\"‏ كل ميسر لما خلق له ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain repotted that it was said to Allah's Messenger (may peace be upon him):                      Has there been drawn a distinction between the people of Paradise and the denizens of hell? He said: Yes. It was again said: (If it is so), then What is the use of doing good deeds? Thereupon he said: Everyone is facilitated in what has been created for him.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20022",
        "11395",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-7002",
      "hadith_no": "7002",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن مطرف، عن عامر، عن شريح، بن هانئ عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ قال فأتيت عائشة فقلت يا أم المؤمنين سمعت أبا هريرة يذكر عن رسول الله صلى الله عليه وسلم حديثا إن كان كذلك فقد هلكنا ‏.‏ فقالت إن الهالك من هلك بقول رسول الله صلى الله عليه وسلم وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ وليس منا أحد إلا وهو يكره الموت ‏.‏ فقالت قد قاله رسول الله صلى الله عليه وسلم وليس بالذي تذهب إليه ولكن إذا شخص البصر وحشرج الصدر واقشعر الجلد وتشنجت الأصابع فعند ذلك من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who loves meeting Allah, Allah loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him. I (Shuraih b. Hani, one of the narrators) came to A'isha and said to her: Mother of the faithful, I heard Abu Huraira narrate from Allah's Messenger (may peace be upon him) which, if it is actually so, is a destruction to us. Thereupon she said: Those are in fact ruined who are ruined at the words of Allah's Messenger (may peace be upon him). What are (the words which in your opinion would cause your destruction)? He said that Allah's Messenger (may peace be upon him) had stated: He who loves to meet Allah, Allah too loves to meet him, and he who dislikes to meet Allah, Allah too abhors to meet him, and there is none amongst us who dons not hate death. Thereupon she said: Allah's Messenger (may peace be upon him) has in fact stated this, but it does not mean what you construe, but it implies (the time) when one loses the lustre of the eye, and there is rattling in the throat, shudder in the body and convulsion in fingers (at the time of death). (It is about this time) that it has been said: He who loves to meet Allah, Allah would love to meet him, and he who dislikes to meet Allah, Allah would abhor to meet him",
      "usc_msa_ref": "",
      "chain": [
        "30465",
        "11395",
        "11052",
        "10774",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7119",
      "hadith_no": "7119",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  أبي التياح، قال سمعت مطرفا، يحدث أنه كانت له امرأتان بمعنى حديث معاذ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mutarrif through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "id": "sahih-muslim-7388",
      "hadith_no": "7388",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عبد الرحمن بن بشر العبدي، حدثنا يحيى بن سعيد، عن هشام، - صاحب الدستوائي - حدثنا قتادة، عن مطرف، عن عياض بن حمار، أن رسول الله صلى الله عليه وسلم خطب ذات يوم ‏.‏ وساق الحديث وقال في آخره قال يحيى قال شعبة عن قتادة قال سمعت مطرفا في هذا الحديث ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Iyad b. Himar that Allah's Messenger (may peace be upon him) gave an address one day. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30356",
        "20031",
        "11019",
        "11395",
        "5217"
      ]
    },
    {
      "id": "sahih-muslim-7609",
      "hadith_no": "7609",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن مطرف، عن أبيه، قال أتيت النبي صلى الله عليه وسلم وهو يقرأ ‏{‏ ألهاكم التكاثر‏}‏ قال ‏\"‏ يقول ابن آدم مالي مالي - قال - وهل لك يا ابن آدم من مالك إلا ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت ‏\"‏ ‏.‏",
      "text_en": " Mutarrif reported on the authority of his father:                      I came to Allah's Apostle (may peace be upon him) as he was reciting:\" Abundance diverts you\" (cii. 1). He said: The son of Adam claims: My wealth, my wealth. And he (the Holy Prophet) said: O son of Adam. is there anything as your belonging except that which you consumed, which you utilised, or which you wore and then it was worn out or you gave as charity and sent it forward?",
      "usc_msa_ref": "",
      "chain": [
        "20297",
        "11019",
        "11395"
      ]
    },
    {
      "id": "sahih-muslim-7610",
      "hadith_no": "7610",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، وقالا، جميعا حدثنا ابن أبي عدي، عن سعيد، ح وحدثنا ابن المثنى، حدثنا معاذ بن هشام، حدثنا  أبي كلهم، عن قتادة، عن مطرف، عن أبيه، قال انتهيت إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث همام ‏.‏",
      "text_en": " Mutarrif reported on the authority of his father:                      I went to Allah's Apostle (may peace be upon him). The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "20276",
        "11168",
        "20287",
        "11019",
        "11395"
      ]
    },
    {
      "id": "sunan-abi-daud-74",
      "hadith_no": "74",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن شعبة، حدثنا أبو التياح، عن مطرف، عن ابن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم ولها ‏\"‏ ‏.‏ فرخص في كلب الصيد وفي كلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرار والثامنة عفروه بالتراب ‏\"‏ ‏.‏ قال أبو داود وهكذا قال ابن مغفل ‏.‏",
      "text_en": " Narrated Ibn Mughaffal:                     The Messenger of Allaah (sal Allaahu alayhi wa sallam) ordered the killing of the dogs, and then said: Why are they (people) after them (dogs)? and then granted permission (to keep) for hunting  and for (the security) of the herd, and said : When the dog licks the utensil wash it seven times, and rub it with earth the eighth time.Abu Dawud said : Ibn Mughaffal narrated in a similar way.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20031",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "id": "sunan-abi-daud-482",
      "hadith_no": "482",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا سعيد الجريري، عن أبي العلاء، عن مطرف، عن أبيه، قال أتيت رسول الله صلى الله عليه وسلم وهو يصلي فبزق تحت قدمه اليسرى ‏.‏",
      "text_en": " Abu al-‘Ala’ reported on the authority of his father:                      I came to the Messenger of Allah(ﷺ) who was saying prayer. He spat beneath his left foot.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11286",
        "11395"
      ]
    },
    {
      "id": "sunan-abi-daud-835",
      "hadith_no": "835",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن غيلان بن جرير، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب - رضى الله عنه - فكان إذا سجد كبر وإذا ركع كبر وإذا نهض من الركعتين كبر فلما انصرفنا أخذ عمران بيدي وقال لقد صلى هذا قبل أو قال لقد صلى بنا هذا قبل صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Mutarrif said:                      I and ‘Imran b. Husain offered prayer behind ‘All b. AbI Talib(may Allah be pleased with him). When he prostrated, he uttered the takbir (Allah is most great) and when he bowed, he uttered the takbir and when he stood up at the end of two rak’ahs, he uttered the takbir. When we finished our prayer, ‘Imran caught hold of my hand, and said: He has led us in prayer just now like the prayer offered by Muhammed(may peace by upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "id": "sunan-abi-daud-849",
      "hadith_no": "849",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بشر بن عمار، حدثنا أسباط، عن مطرف، عن عامر، قال لا يقول القوم خلف الإمام سمع الله لمن حمده ولكن يقولون ربنا لك الحمد ‏.‏",
      "text_en": " ‘Amir said:                      The people behind the imam should not say: “Allah listens to him who praises Him.” But they should say: “ Our Lord, to Thee be the praise.”",
      "usc_msa_ref": "",
      "chain": [
        "11395",
        "11052"
      ]
    },
    {
      "id": "sunan-abi-daud-872",
      "hadith_no": "872",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا قتادة، عن مطرف، عن عائشة، أن النبي صلى الله عليه وسلم كان يقول في ركوعه وسجوده ‏\"‏ سبوح قدوس رب الملائكة والروح ‏\"‏ ‏.‏",
      "text_en": " ‘Aishah said that the prophet (ﷺ) used to say when bowing and prostrating, “All-Glorious, All-Holy, Lord of the angels and spirit.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20295",
        "11019",
        "11395",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-904",
      "hadith_no": "904",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن محمد بن سلام، حدثنا يزيد، - يعني ابن هارون - أخبرنا حماد، - يعني ابن سلمة - عن ثابت، عن مطرف، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يصلي وفي صدره أزيز كأزيز الرحى من البكاء صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn ash-Shikhkhir:                     I saw the Messenger of Allah (ﷺ) praying and a sound came from his breast like the rumbling of a mill owing to weeping.",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20472",
        "20021",
        "11269",
        "11395"
      ]
    },
    {
      "id": "sunan-abi-daud-1386",
      "hadith_no": "1386",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، أخبرنا شعبة، عن قتادة، أنه سمع مطرفا، عن معاوية بن أبي سفيان، عن النبي صلى الله عليه وسلم في ليلة القدر قال ‏\"‏ ليلة القدر ليلة سبع وعشرين ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. Abi Sufyan :                     The Prophet (ﷺ) as saying: Lailat al-qadr is the twenty-seventh night (of Ramadan)",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11395",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-2053",
      "hadith_no": "2053",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبثر، عن مطرف، عن عامر، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق جاريته وتزوجها كان له أجران ‏\"‏ ‏.‏",
      "text_en": " Abu Dawud reported the Apostle of Allaah(ﷺ) as saying “Anyone who sets his slave girl free and then marries her, will have a double reward.”",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "11395",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-2328",
      "hadith_no": "2328",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن ثابت، عن مطرف، عن عمران بن حصين، وسعيد الجريري، عن أبي العلاء، عن مطرف، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم قال لرجل ‏\"‏ هل صمت من سرر شعبان شيئا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أفطرت فصم يوما ‏\"‏ ‏.‏ وقال أحدهما ‏\"‏ يومين ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     The Messenger of Allah (ﷺ) asked a man: Did you fast the last day of Sha'ban ? He replied: No. He said: If you did not observe a fast, you must fast for a day. One of the two narrators said: For two days.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11269",
        "11395",
        "123",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-2484",
      "hadith_no": "2484",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن قتادة، عن مطرف، عن عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين على من ناوأهم حتى يقاتل آخرهم المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) said: A section of my community will continue to fight for the right and overcome their opponents till the last of them fights with the Antichrist.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-2489",
      "hadith_no": "2489",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن مطرف، عن بشر أبي عبد الله، عن بشير بن مسلم، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يركب البحر إلا حاج أو معتمر أو غاز في سبيل الله فإن تحت البحر نارا وتحت النار بحرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: No one should sail on the sea except the one who is going to perform hajj or umrah, or the one who is fighting in Allah's path for under the sea there is a fire, and under the fire there is a sea.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20313",
        "11395",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2801",
      "hadith_no": "2801",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا خالد، عن مطرف، عن عامر، عن البراء بن عازب، قال ضحى خال لي يقال له أبو بردة قبل الصلاة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ شاتك شاة لحم ‏\"‏ ‏.‏ فقال يا رسول الله إن عندي داجنا جذعة من المعز فقال ‏\"‏ اذبحها ولا تصلح لغيرك ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     A maternal uncle of mine called AbuBurdah sacrificed before the prayer (for 'Id). The Messenger of Allah (ﷺ) said: Your goat is meant for flesh. He said: Messenger of Allah, I have a domestic kid with me. He said: Sacrifice it, but it is not valid for any man other than you.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20423",
        "11395",
        "11052",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-2947",
      "hadith_no": "2947",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن مطرف، عن أبي الجهم، عن أبي مسعود الأنصاري، قال بعثني النبي صلى الله عليه وسلم ساعيا ثم قال ‏\"‏ انطلق أبا مسعود ولا ألفينك يوم القيامة تجيء على ظهرك بعير من إبل الصدقة له رغاء قد غللته ‏\"‏ ‏.‏ قال إذا لا أنطلق ‏.‏ قال ‏\"‏ إذا لا أكرهك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMas'ud al-Ansari:                     The Prophet (ﷺ) appointed me to collect sadaqah and then said: Go, AbuMas'ud, I should not find you on the Day of Judgment carrying a camel of sadaqah on your back, which rumbles, the one you have taken by unfaithful dealing in sadaqah. He said: If it is so, I will not go. He said: Then I do not force you.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11395",
        "402"
      ]
    },
    {
      "id": "sunan-abi-daud-2983",
      "hadith_no": "2983",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثنا يحيى بن أبي بكير، حدثنا أبو جعفر الرازي، عن مطرف، عن عبد الرحمن بن أبي ليلى، قال سمعت عليا، يقول ولاني رسول الله صلى الله عليه وسلم خمس الخمس فوضعته مواضعه حياة رسول الله صلى الله عليه وسلم وحياة أبي بكر وحياة عمر فأتي بمال فدعاني فقال خذه ‏.‏ فقلت لا أريده ‏.‏ قال خذه فأنتم أحق به ‏.‏ قلت قد استغنينا عنه فجعله في بيت المال ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Abi Laila:                     I heard 'Ali say: The Messenger of Allah (ﷺ) assigned me the fifth (of the booty). I spent it on its beneficiaries during the lifetime of the Messenger of Allah (ﷺ) and Abu Bakr and of 'Umar. Some property was brought to him ('Umar) and he called me and said: Take it. I said: I dod not want it. He said: Take it ; you have right to it. I said: We do not need it. So he deposited in the government treasury.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20365",
        "20746",
        "11395",
        "11196",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-2991",
      "hadith_no": "2991",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن مطرف، عن عامر الشعبي، قال كان للنبي صلى الله عليه وسلم سهم يدعى الصفي إن شاء عبدا وإن شاء أمة وإن شاء فرسا يختاره قبل الخمس ‏.‏",
      "text_en": " ‘Amir Al Sha’bi said “The Prophet (ﷺ) had a special portion in the booty called safi. This would be a slave if he desired or a slave girl if he desired or a horse if he desired. He would choose it before taking out the fifth.”",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11395",
        "11052"
      ]
    },
    {
      "id": "sunan-abi-daud-3865",
      "hadith_no": "3865",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن ثابت، عن مطرف، عن عمران بن حصين، قال نهى النبي صلى الله عليه وسلم عن الكى فاكتوينا فما أفلحن ولا أنجحن ‏.‏ قال أبو داود وكان يسمع تسليم الملائكة فلما اكتوى انقطع عنه فلما ترك رجع إليه ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) forbade to cauterise; we cauterised but they (cauterisation) did not benefit us, nor proved useful for us.Abu Dawud said: He used to hear the salutation of the angels: When he cauterized, it stopped. When he abandoned, it returned to him.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11269",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-4074",
      "hadith_no": "4074",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا همام، عن قتادة، عن مطرف، عن عائشة، - رضى الله عنها - قالت صنعت لرسول الله صلى الله عليه وسلم بردة سوداء فلبسها فلما عرق فيها وجد ريح الصوف فقذفها ‏.‏ قال وأحسبه قال وكان تعجبه الريح الطيبة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I made a black cloak for the Prophet (ﷺ) and he put it on; but when he sweated in it and noticed the odour of the wool, he threw it away. The narrator said: I think he said: He liked good smell.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20297",
        "11019",
        "11395",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-0-5",
      "hadith_no": "0",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "وقال هارون حدثنا عمرو بن أبي قيس عن مطرف بن طريف عن أبي الحسن عن هلال بن عمرو قال سمعت عليا - رضى الله عنه - يقول قال النبي صلى الله عليه وسلم ‏\"‏ يخرج رجل من وراء النهر يقال له الحارث بن حراث على مقدمته رجل يقال له منصور يوطئ أو يمكن لآل محمد كما مكنت قريش لرسول الله صلى الله عليه وسلم وجب على كل مؤمن نصره ‏\"‏ ‏.‏ أو قال ‏\"‏ إجابته ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: A man called al-Harith ibn Harrath will come forth from Ma Wara an-Nahr. His army will be led by a man called Mansur who will establish or consolidate things for Muhammad's family as Quraysh consolidated them for the Messenger of Allah (ﷺ). Every believer must help him, or he said: respond to his sermons.",
      "usc_msa_ref": "",
      "chain": [
        "20726",
        "11395",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-4456",
      "hadith_no": "4456",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا مطرف، عن أبي الجهم، عن البراء بن عازب، قال بينا أنا أطوف، على إبل لي ضلت إذ أقبل ركب أو فوارس معهم لواء فجعل الأعراب يطيفون بي لمنزلتي من النبي صلى الله عليه وسلم إذ أتوا قبة فاستخرجوا منها رجلا فضربوا عنقه فسألت عنه فذكروا أنه أعرس بامرأة أبيه ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     while I was wandering in search of my camels which had strayed, a caravan or some horsemen carrying a standard came forward. The bedouin began to go round me for my position with the Prophet (ﷺ). They came to a domed structure, took out a man from it, and struck his neck. I asked about him. They told me that he had married his father's wife.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20423",
        "11395",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-4709",
      "hadith_no": "4709",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن يزيد الرشك، قال حدثنا مطرف، عن عمران بن حصين، قال قيل لرسول الله صلى الله عليه وسلم يا رسول الله أعلم أهل الجنة من أهل النار قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال ففيم يعمل العاملون قال ‏\"‏ كل ميسر لما خلق له ‏\"‏ ‏.‏",
      "text_en": " ‘Imran b. Husain said :                      The Messenger of Allah (May peace be upon him) was asked : Is it known who are those who will go to paradise and those who will go to hell? He said : Yes. He asked : Then what is the good of doing anything by those who act? He replied : Everyone is helped to do for which he has been created.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11319",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-4758",
      "hadith_no": "4758",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، وأبو بكر بن عياش ومندل عن مطرف، عن أبي جهم، عن خالد بن وهبان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من فارق الجماعة شبرا فقد خلع ربقة الإسلام من عنقه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Prophet (ﷺ) said: He who separates from the community within a span takes off the noose of Islam from his neck.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11395",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4759",
      "hadith_no": "4759",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا مطرف بن طريف، عن أبي الجهم، عن خالد بن وهبان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ كيف أنتم وأئمة من بعدي يستأثرون بهذا الفىء ‏\"‏ ‏.‏ قلت ‏:‏ إذا والذي بعثك بالحق أضع سيفي على عاتقي، ثم أضرب به حتى ألقاك أو ألحقك ‏.‏ قال ‏:‏ ‏\"‏ أولا أدلك على خير من ذلك تصبر حتى تلقاني ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported the Messenger of Allah (May peace be upon him) as saying :                      How will you deal with the rulers (imams) who appropriate to themselves this booty? I said : I swear by him who sent you with the truth that at that time I shall put my sword on my shoulder and smite with it till I meet you, or I join you. He said: shall I not guide you to something better than that? You must show endurance till you meet me.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11395",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4806",
      "hadith_no": "4806",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا أبو مسلمة، سعيد بن يزيد عن أبي نضرة، عن مطرف، قال قال أبي انطلقت في وفد بني عامر إلى رسول الله صلى الله عليه وسلم فقلنا أنت سيدنا ‏.‏ فقال ‏\"‏ السيد الله تبارك وتعالى ‏\"‏ ‏.‏ قلنا وأفضلنا فضلا وأعظمنا طولا ‏.‏ فقال ‏\"‏ قولوا بقولكم أو بعض قولكم ولا يستجرينكم الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn ash-Shikhkhir:                     I went with a deputation of Banu Amir to the apostle of Allah (ﷺ), and we said: You are our lord (sayyid). To this he replied: The lord is Allah, the Blessed and Exalted. Then we said: And the one of us most endowed with excellence and superiority. To this he replied: Say what you have to say, or part of what you have to say, and do not let the devil make you his agents.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11288",
        "10721",
        "11395"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1412",
      "hadith_no": "1412",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أنبأنا مطرف، عن الشعبي، حدثنا أبو جحيفة، قال قلت لعلي يا أمير المؤمنين هل عندكم سوداء في بيضاء ليس في كتاب الله قال لا والذي فلق الحبة وبرأ النسمة ما علمته إلا فهما يعطيه الله رجلا في القرآن وما في الصحيفة ‏.‏ قلت وما في الصحيفة قال فيها العقل وفكاك الأسير وأن لا يقتل مؤمن بكافر ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول سفيان الثوري ومالك بن أنس والشافعي وأحمد وإسحاق قالوا لا يقتل مؤمن بكافر ‏.‏ وقال بعض أهل العلم يقتل المسلم بالمعاهد ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Juhaifah said:                      \"I said to 'Ali: O Commander of the Believers! Do you have anything written that is not in Allah's Book?' He said: 'By the One Who splits the seed and creates the soul, I have not learned from it except what understanding of the Qur'an Allah gives to a man, and what is in this sheet of paper.' I said: 'What is in the paper?' He said: 'It is the 'Aql, the (ransom for) release of captives, and the judgement that no believer is killed for a disbeliever.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11395",
        "11052",
        "4047"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2134",
      "hadith_no": "2134",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا قبيصة بن الليث الكوفي، عن مطرف، عن عطاء، عن أم الدرداء، عن أبي الدرداء، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ما من شيء يوضع في الميزان أثقل من حسن الخلق وإن صاحب حسن الخلق ليبلغ به درجة صاحب الصوم والصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Ad-Dardh narrated that the Messenger of Allah said:                     \"Nothing is placed on the Scale that is heavier than good character. Indeed the person with good character will have attained the rank of the person of fasting and prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "11395",
        "11029",
        "11457",
        "37"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2342",
      "hadith_no": "2342",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وهب بن جرير، حدثنا شعبة، عن قتادة، عن مطرف، عن أبيه، أنه انتهى إلى النبي صلى الله عليه وسلم وهو يقول ‏:‏ ‏(‏ألهاكم التكاثر ‏)‏ قال ‏\"‏ يقول ابن آدم مالي مالي وهل لك من مالك إلا ما تصدقت فأمضيت أو أكلت فأفنيت أو لبست فأبليت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Mutarrif narrated from his father, that he met up with the Prophet (s.a.w) while he was saying:                     \"The mutual increase diverts you\". He (s.a.w) said: \"The son of Adam says:'My wealth, my wealth, but is there something for you from your wealth besides what you give in charity that remains, or you eat which perishes, or what you wear that grows worn?\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20298",
        "20020",
        "11019",
        "11395"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3198",
      "hadith_no": "3198",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي، حدثنا أبي، عن مطرف، عن أبي إسحاق، عن أبي بردة، عن عبد الله بن عمرو، قال قلت يا رسول الله في كم أقرأ القرآن قال ‏\"‏ اختمه في شهر ‏\"‏ ‏.‏ قلت إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ اختمه في عشرين ‏\"‏ ‏.‏ قلت إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ اختمه في خمسة عشر ‏\"‏ ‏.‏ قلت إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ اختمه في عشر ‏\"‏ ‏.‏ قلت إني أطيق أفضل من ذلك ‏.‏ قال ‏\"‏ اختمه في خمس ‏\"‏ ‏.‏ قلت إني أطيق أفضل من ذلك ‏.‏ قال فما رخص لي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه يستغرب من حديث أبي بردة عن عبد الله بن عمرو ‏.‏ وقد روي هذا الحديث من غير وجه عن عبد الله بن عمرو وروي عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال ‏\"‏ لم يفقه من قرأ القرآن في أقل من ثلاث ‏\"‏ ‏.‏ وروي عن عبد الله بن عمرو أن النبي صلى الله عليه وسلم قال له ‏\"‏ اقرإ القرآن في أربعين ‏\"‏ ‏.‏ قال إسحاق بن إبراهيم ولا نحب للرجل أن يأتي عليه أكثر من أربعين يوما ولم يقرإ القرآن لهذا الحديث ‏.‏ وقال بعض أهل العلم لا يقرأ القرآن في أقل من ثلاث للحديث الذي روي عن النبي صلى الله عليه وسلم ورخص فيه بعض أهل العلم وروي عن عثمان بن عفان أنه كان يقرأ القرآن في ركعة يوتر بها وروي عن سعيد بن جبير أنه قرأ القرآن في ركعة في الكعبة والترتيل في القراءة أحب إلى أهل العلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr :                     \"I said: 'O Messenger of Allah! In how much time may I recite the Qur'an?' He said: 'Complete it in one month.' I said: 'I am able to do more than that.' He said: 'Then complete it in twenty (days).' I said: 'I am able to do more than that.' He said: 'Then finish it in fifteen (days).' I said: 'I am able to do more than that.' He said: 'Finish it in ten (days).' I said: 'I am able to do more than that.' He said: 'Finish it in five (days).' I said: 'I am able to do more than that.'\" He ('Abdullah bin 'Amr) said: \"But he did not permit me.\"",
      "usc_msa_ref": "",
      "chain": [
        "11395",
        "11049",
        "11901",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3502",
      "hadith_no": "3502",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مطرف بن طريف، وعبد الملك، وهو ابن أبجر سمعا الشعبي، يقول سمعت المغيرة بن شعبة، على المنبر يرفعه إلى رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى عليه السلام سأل ربه فقال أى رب أى أهل الجنة أدنى منزلة قال رجل يأتي بعد ما يدخل أهل الجنة الجنة فيقال له ادخل الجنة ‏.‏ فيقول كيف أدخل وقد نزلوا منازلهم وأخذوا أخذاتهم ‏.‏ قال فيقال له أترضى أن يكون لك ما كان لملك من ملوك الدنيا فيقول نعم أى رب قد رضيت ‏.‏ فيقال له فإن لك هذا ومثله ومثله ومثله فيقول رضيت أى رب ‏.‏ فيقال له فإن لك هذا وعشرة أمثاله فيقول رضيت أى رب ‏.‏ فيقال له فإن لك مع هذا ما اشتهت نفسك ولذت عينك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى بعضهم هذا الحديث عن الشعبي عن المغيرة ولم يرفعه والمرفوع أصح ‏.‏",
      "text_en": " Narrated Ash-Sha'bi:                     \"While he was on the Minbar, I heard Al-Mughirah bin Shu'bah saying - and he attributed it to the Prophet (ﷺ) - 'Indeed Musa [peace be upon him] asked his Lord: \"O Lord! Who is the lowest in rank among the people of Paradise?\" He said: \"A man who comes after the people of Paradise have been admitted to Paradise, and he is told to enter. He says: 'How can I enter when they have gotten all of their abodes, and all that is to be had?'\" He said: \"So it is said to him: 'Would you accept if you were to have what a king in the world?' He says: 'Yes, O Lord! I accept.' So it is said to him: 'Then for you is this and its like, and its like again, and its like again.' So he says: 'I accept, O Lord!' So it is said to him: 'Then for you is this and ten the like thereof.' So he says: 'I accept, O Lord!' So it is said: 'Indeed you shall have this, and whatever your soul desires, and whatever delights your eyes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11395",
        "11368",
        "10792",
        "11052"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3551",
      "hadith_no": "3551",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مطرف، عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كيف أنعم وقد التقم صاحب القرن القرن وحنى جبهته وأصغى سمعه ينتظر أن يؤمر أن ينفخ فينفخ ‏\"‏ ‏.‏ قال المسلمون فكيف نقول يا رسول الله قال ‏\"‏ قولوا حسبنا الله ونعم الوكيل توكلنا على الله ربنا ‏\"‏ ‏.‏ وربما قال سفيان على الله توكلنا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه الأعمش أيضا عن عطية عن أبي سعيد ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that the Messenger of Allah (ﷺ) said: \"How can I be comfortable when the one with the horn is holding it in his lips and his forehead is leaning forward, waiting to be given permission to blow?\" The Muslims said: \"So what should we say, O Messenger of Allah?\" He said: \"Say: 'Allah is sufficient for us and what a good protector He is. We rely upon [our Lord] Allah'\" - and perhaps Sufyan (one of the narrators) said: \"upon Allah we rely.\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11395",
        "15373",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-67",
      "hadith_no": "67",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن المغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ورخص في كلب الصيد والغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Al-Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:                      \"If a dog licks a vessel then wash it seven times, and rub it the eighth time with dust.\"",
      "usc_msa_ref": "",
      "chain": [
        "20423",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-327",
      "hadith_no": "327",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الملك بن عمرو، قال حدثنا عبد العزيز بن مسلم، - وكان من العابدين - عن مطرف بن طريف، عن خالد بن أبي نوف، عن سليط، عن ابن أبي سعيد الخدري، عن أبيه، قال مررت بالنبي صلى الله عليه وسلم وهو يتوضأ من بئر بضاعة فقلت أتتوضأ منها وهي يطرح فيها ما يكره من النتن فقال ‏\"‏ الماء لا ينجسه شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abi Sa'eed Al-Khudri that his father said:                      \"I passed by the Prophet (ﷺ) when he was performing Wudu' from the well of Buda'ah. I said: 'Are you performing Wudu' from it when garbage is thrown into it?' He said: 'Water is not made impure by anything.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20443",
        "20253",
        "11395",
        "18252"
      ]
    },
    {
      "id": "sunan-an-nasai-336",
      "hadith_no": "336",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، - يعني ابن الحارث - عن شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ورخص في كلب الصيد والغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:                      \"If a dog licks a vessel then wash it seven times and rub it the eighth time with dust.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20226",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-337",
      "hadith_no": "337",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن أبي التياح، يزيد بن حميد قال سمعت مطرفا، يحدث عن عبد الله بن مغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ قال ورخص في كلب الصيد وكلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروا الثامنة بالتراب ‏\"‏ ‏.‏ خالفه أبو هريرة فقال إحداهن بالتراب ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                      \"The Messenger of Allah (ﷺ) commanded that dogs be killed. He said: 'What do they have to do with dogs?' And he granted a concession regarding hunting dogs and sheepdogs. And he said: 'If a dog licks a vessel, wash it seven times, and rub it the eighth time with dust.' Abu Hurairah differed from him and said: 'Rub it one time with dust.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-680",
      "hadith_no": "680",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا حماد بن سلمة، قال حدثنا سعيد الجريري، عن أبي العلاء، عن مطرف، عن عثمان بن أبي العاص، قال قلت يا رسول الله اجعلني إمام قومي ‏.‏ فقال ‏\"‏ أنت إمامهم واقتد بأضعفهم واتخذ مؤذنا لا يأخذ على أذانه أجرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin Abi Al-As said:                      \"I said: 'O Messenger of Allah, made me the Imam of my people.' He said: 'You are their Imam, so consider the weakest among them and choose a Mu'adhdhin who does not accept any payment for his Adhan.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20021",
        "11286",
        "11395",
        "3210"
      ]
    },
    {
      "id": "sunan-an-nasai-1048",
      "hadith_no": "1048",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أنبأني قتادة، عن مطرف، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول في ركوعه ‏\"‏ سبوح قدوس رب الملائكة والروح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Messenger of Allah (ﷺ) used to say when bowing: 'Subbuhun Quddusun Rabbul-mala'ikati war-ruh (Perfect, Most Holy, is the Lord of the angels and the spirit).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11395",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1082",
      "hadith_no": "1082",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب فكان إذا سجد كبر وإذا رفع رأسه من السجود كبر وإذا نهض من الركعتين كبر فلما قضى صلاته أخذ عمران بيدي فقال لقد ذكرني هذا - قال كلمة يعني - صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Imran bin Husain and I prayed behind Ali bin Abi Talib. When he prostrated he said the Takbir, and when he raised his head from prostration he said the takbir, and when he stood up following two rak'ahs he said the takbir, and when he had finished praying, 'Imran took my hand and said: 'This reminded me of- he said a word meaning- the prayer of Muhammad (ﷺ).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-1134",
      "hadith_no": "1134",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا بندار، محمد بن بشار قال حدثنا يحيى بن سعيد القطان، وابن أبي عدي، عن شعبة، قالا حدثنا سعيد، عن قتادة، عن مطرف، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول في ركوعه وسجوده ‏\"‏ سبوح قدوس رب الملائكة والروح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) said when bowing and prostrating: 'Subbuhun Quddusun Rabbul-mala'ikati war'ruh (Perfect, Most Holy, Lord of the Angels and the Spirit).\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20276",
        "20020",
        "11168",
        "11019",
        "11395",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1214",
      "hadith_no": "1214",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن حماد بن سلمة، عن ثابت البناني، عن مطرف، عن أبيه، قال أتيت النبي صلى الله عليه وسلم وهو يصلي ولجوفه أزيز كأزيز المرجل يعني يبكي ‏.‏",
      "text_en": " It was narrated from Mutarrif that his father said:                     \"I came to the Prophet (ﷺ) when he was praying, and there was a sound coming from his chest like the sound of water boiling,\" meaning, he was weeping.",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20021",
        "11269",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-1834",
      "hadith_no": "1834",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هناد، عن أبي زبيد، - وهو عبثر بن القاسم - عن مطرف، عن عامر، عن شريح بن هانئ، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ قال شريح فأتيت عائشة فقلت يا أم المؤمنين سمعت أبا هريرة يذكر عن رسول الله صلى الله عليه وسلم حديثا إن كان كذلك فقد هلكنا ‏.‏ قالت وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ ولكن ليس منا أحد إلا وهو يكره الموت قالت قد قاله رسول الله صلى الله عليه وسلم وليس بالذي تذهب إليه ولكن إذا طمح البصر وحشرج الصدر واقشعر الجلد فعند ذلك من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said;\"The Messenger of Allah said:                      Allah loves to meet him, and whoever hates to meet Allah, Allah hates to meet him.\" (One of the narrators) Shuraih said: 'I went to Aishan and said: O mother of the believers! I heard Abu Hurairah narrate from the Messenger of Allah a Hadith which, if that is the case, we are all doomed. She said: 'What is that?' He said: 'The Messenger of Allah said: Whoever loves to meet him, and whoever hates to meet Allah, Allah hates to meet him. But there is no one among us who does not hate death.' She said: 'The Messenger of Allah did say that, but it is not what you think. When the eyes begin to stare, the death rattle sounds in the chest and the flesh shiver, at that point, whoever loves to meet Allah, Allah loves to meet him, and whoever hates to meet Allah, Allah hates to meet him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20329",
        "11395",
        "11052",
        "10774",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1851",
      "hadith_no": "1851",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، عن مطرف، عن حكيم بن قيس، أن قيس بن عاصم، قال لا تنوحوا على فإن رسول الله صلى الله عليه وسلم لم ينح عليه ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated from Hakim bin Qais, that Qais bin 'Asim said:                     \"Do not wail over me, for no one wailed over the Messenger of Allah.\" This is an abridgment.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11019",
        "11395",
        "5242"
      ]
    },
    {
      "id": "sunan-an-nasai-2169",
      "hadith_no": "2169",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا جرير، عن مطرف، عن الشعبي، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم عن قوله تعالى ‏{‏ حتى يتبين لكم الخيط الأبيض من الخيط الأسود ‏}‏ قال ‏\"‏ هو سواد الليل وبياض النهار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that:                     he asked the Messenger of Allah about the verse \"Until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night).\" He said: \"It is the blackness of the night and the whiteness of the day.\" '",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20028",
        "11395",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-2231",
      "hadith_no": "2231",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن الحسين، قال حدثنا ابن أبي عدي، عن ابن إسحاق، عن سعيد بن أبي هند، عن مطرف، قال دخلت على عثمان بن أبي العاص فدعا بلبن فقلت إني صائم ‏.‏ فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الصوم جنة من النار كجنة أحدكم من القتال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"I entered upon 'Uthman bin Abi Al-As and he called for milk. I said: I am fasting; He said: \"I heard the Messenger of Allah say: 'Fasting is a shield like the of any one of you in battle.\"' Abu Hurairah said: \"The Messenger of Allah said: 'Fasting is a shield.\"' (Sahih",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "20276",
        "11107",
        "11427",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-2395",
      "hadith_no": "2395",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، عن أبيه، قال حدثنا أبو العلاء، عن مطرف، عن ابن أبي ربيعة، عن عبد الله بن عمرو، قال ذكرت للنبي صلى الله عليه وسلم الصوم فقال ‏\"‏ صم من كل عشرة أيام يوما ولك أجر تلك التسعة ‏\"‏ ‏.‏ فقلت إني أقوى من ذلك ‏.‏ قال ‏\"‏ صم من كل تسعة أيام يوما ولك أجر تلك الثمانية ‏\"‏ ‏.‏ قلت إني أقوى من ذلك ‏.‏ قال ‏\"‏ فصم من كل ثمانية أيام يوما ولك أجر تلك السبعة ‏\"‏ ‏.‏ قلت إني أقوى من ذلك قال فلم يزل حتى قال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     'Amr said: \"I spoke to the Prophet and he said: 'Fast one day out of ten and you will have the reward of the other nine.' I said: 'I am able to do more than that.' He said: 'Fast one day out of eight and you will have the reward of the other eight.' I said: 'I am able to do more than that.' He said: 'Fast one day out of eight and you will have the reward of the other seven.' I said: 'I am able to do more than that.' 'Fast one day and not the next.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11395",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-2397",
      "hadith_no": "2397",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبيد، عن أسباط، عن مطرف، عن حبيب بن أبي ثابت، عن أبي العباس، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه بلغني أنك تقوم الليل وتصوم النهار ‏\"‏ ‏.‏ قلت يا رسول الله ما أردت بذلك إلا الخير ‏.‏ قال ‏\"‏ لا صام من صام الأبد ولكن أدلك على صوم الدهر ثلاثة أيام من الشهر ‏\"‏ ‏.‏ قلت يا رسول الله إني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ صم خمسة أيام ‏\"‏ ‏.‏ قلت إني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ فصم عشرا ‏\"‏ ‏.‏ فقلت إني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ صم صوم داود عليه السلام كان يصوم يوما ويفطر يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said: 'I have heard that you stand (in prayer) all night and fast all day.' I said: 'O Messenger of Allah, I only meant good by that.' He said: 'One who fasts every day of his life has not truly fasted. But I will tell you what fasting for a lifetime means: Three days of every month.' I said: 'O Messenger of Allah, I said: 'I am able to do more than that.' He said 'Observe the fast of Dawud, peace be upon him; he used to fast one day and not the next.\"' 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "11395",
        "11331",
        "11246",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-2411",
      "hadith_no": "2411",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن مطرفا، حدثه أن عثمان بن أبي العاص قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ صيام حسن ثلاثة أيام من الشهر ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin Abi Al-As said:                     \"I heard the Messenger of Allah say: 'It is a good fast to fast three days of each month\".",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11427",
        "11395",
        "3210"
      ]
    },
    {
      "id": "sunan-an-nasai-2726",
      "hadith_no": "2726",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد، قال حدثنا شعبة، قال حدثني حميد بن هلال، قال سمعت مطرفا، يقول قال لي عمران بن حصين جمع رسول الله صلى الله عليه وسلم بين حج وعمرة ثم توفي قبل أن ينهى عنها وقبل أن ينزل القرآن بتحريمه ‏.‏",
      "text_en": " 'Imran bin Husain said:                     \"The Messenger of Allah combined Hajj and \"Umrah, then he passed away before he could forbid that, and before Qur'an was revealed forbidding it.",
      "usc_msa_ref": "",
      "chain": [
        "20423",
        "20020",
        "11281",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-2727",
      "hadith_no": "2727",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، عن مطرف، عن عمران، أن رسول الله صلى الله عليه وسلم جمع بين حج وعمرة ثم لم ينزل فيها كتاب ولم ينه عنهما النبي صلى الله عليه وسلم قال فيهما رجل برأيه ما شاء ‏.‏",
      "text_en": " It was narrated from 'Imran:                     That the Messenger of Allah combined Hajj and \"Umrah, then no Qur'an was revealed concerning that, and the Prophet did not forbid it, regardless of what one man may say.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20423",
        "20020",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-2736",
      "hadith_no": "2736",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أنبأنا أبي قال، أنبأنا أبو حمزة، عن مطرف، عن سلمة بن كهيل، عن طاوس، عن ابن عباس، قال سمعت عمر، يقول والله إني لأنهاكم عن المتعة، وإنها، لفي كتاب الله ولقد فعلها رسول الله صلى الله عليه وسلم يعني العمرة في الحج ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I heard 'Umar say\" 'By Allah, I forbid you to forbid you to perform Tamattur,' but it is mentioned in the Book of Allah and the Messenger of Allah did it\" meaning 'Umrah with Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "38554",
        "30362",
        "20458",
        "11395",
        "11350",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-2739",
      "hadith_no": "2739",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا عثمان بن عمر، قال حدثنا إسماعيل بن مسلم، عن محمد بن واسع، عن مطرف، قال قال لي عمران بن حصين إن رسول الله صلى الله عليه وسلم قد تمتع وتمتعنا معه قال فيها قائل برأيه ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Imran bin Husain said to me; 'The Messenger of Allah performed 'Umrah and Hajj together, and we performed 'Umrah and Hajj together with him, and whoever says anything different, that is his own personal opinion.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20262",
        "22025",
        "11395",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-3040",
      "hadith_no": "3040",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثني جرير، عن مطرف، عن الشعبي، عن عروة بن مضرس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أدرك جمعا مع الإمام والناس حتى يفيض منها فقد أدرك الحج ومن لم يدرك مع الناس والإمام فلم يدرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Urwah bin Mudarris said:                     The Messenger of allah said: \"Whoever catches up (with Fajir prayer) in Jam (Al-Muzdalifah) with the Imam and the people (and stays there) until they move on, the he has caught up with Hajj. Whoever does not catuch up with the people and the Imam, then has not caught it (Hajj).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11395",
        "11052",
        "4068"
      ]
    },
    {
      "id": "sunan-an-nasai-3257",
      "hadith_no": "3257",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبثر، عن مطرف، عن أبي إسحاق، عن أبي عبيدة، قال قالت عائشة تزوجني رسول الله صلى الله عليه وسلم لتسع سنين وصحبته تسعا ‏.‏",
      "text_en": " It was narrated that Abu 'Ubaidah said:                      \"Aishah said: 'The Messenger of Allah married me when I was nine and I lived with him for nine years.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11395",
        "11049",
        "10"
      ]
    },
    {
      "id": "sunan-an-nasai-3345",
      "hadith_no": "3345",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هناد بن السري، عن أبي زبيد، عبثر بن القاسم عن مطرف، عن عامر، عن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق جاريته ثم تزوجها فله أجران ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                      \"The Messenger of Allah said: 'Whoever manumits his female slave, then marries her, he will have two rewards.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20329",
        "11395",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-3613",
      "hadith_no": "3613",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، عن قتادة، عن مطرف، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ ‏{‏ألهاكم التكاثر * حتى زرتم المقابر‏}‏ قال يقول ابن آدم مالي مالي وإنما مالك ما أكلت فأفنيت أو لبست فأبليت أو تصدقت فأمضيت ‏\"‏‏.‏",
      "text_en": " It was narrated from Mutarrif, from his father, that the Prophet said:                      \"The mutual rivalry (for piling up of worldly things) diverts you, 'Until you visit the graves (i.e. till you die).' The son of Adam says: 'My wealth, my wealth,' but your wealth is what you eat and consume, or what you wear and it wears out, or what you give in charity and send on ahead (for the Hereafter).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11019",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-4096",
      "hadith_no": "4096",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا سعيد بن عمرو الأشعثي، قال حدثنا عبثر، عن مطرف، عن سوادة بن أبي الجعد، عن أبي جعفر، قال كنت جالسا عند سويد بن مقرن فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون مظلمته فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ja'far said:                     \"I was sitting with Suwaid bin Muqarrin, and he said: The Messenger of Allah [SAW] said: \"Whoever is killed defending himself against injustice, he is a martyr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "30465",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-4145",
      "hadith_no": "4145",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن مطرف، قال سئل الشعبي عن سهم النبي، صلى الله عليه وسلم وصفيه فقال أما سهم النبي صلى الله عليه وسلم فكسهم رجل من المسلمين وأما سهم الصفي فغرة تختار من أى شىء شاء ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Ash-Shabi was asked about the share of the Prophet and what he chose for himself. He said: 'The share of the Prophet was like the share of any Muslim man, and what he chose for himself was something precious; he chose whatever he wanted to.\"'",
      "usc_msa_ref": "",
      "chain": [
        "11210",
        "11049",
        "11395"
      ]
    },
    {
      "id": "sunan-an-nasai-4744",
      "hadith_no": "4744",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن مطرف بن طريف، عن الشعبي، قال سمعت أبا جحيفة، يقول سألنا عليا فقلنا هل عندكم من رسول الله صلى الله عليه وسلم شىء سوى القرآن فقال لا والذي فلق الحبة وبرأ النسمة إلا أن يعطي الله عز وجل عبدا فهما في كتابه أو ما في هذه الصحيفة ‏.‏ قلت وما في الصحيفة قال فيها ‏\"‏ العقل وفكاك الأسير وأن لا يقتل مسلم بكافر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ash-Sha'bi said:                     \"I heard Abu Juhaifah say: 'We asked 'Ali: \"Do you have anything from the Messenger of Allah apart from the Qur'an?\" He said:  \"No, by the One who splits the seeds and creates the soul, unless Allah gives a slave understanding of His Book, or except this sheet.\" I said: \"What is in the sheet?\" He said: \"In it are (the regulations concerning) blood money and the freeing of captives and (the rule) that no Muslim should be killed for killing a disbeliever.\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11395",
        "11052",
        "4047"
      ]
    },
    {
      "id": "sunan-an-nasai-5142",
      "hadith_no": "5142",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن شاهين الواسطي، قال أنبأنا خالد، عن مطرف، ح وأنبأنا أحمد بن حرب، قال حدثنا أسباط، عن مطرف، عن أبي الجهم، عن أبي زيد، عن أبي هريرة، قال كنت قاعدا عند النبي صلى الله عليه وسلم فأتته امرأة فقالت يا رسول الله سوارين من ذهب ‏.‏ قال ‏\"‏ سواران من نار ‏\"‏ ‏.‏ قالت يا رسول الله طوق من ذهب ‏.‏ قال ‏\"‏ طوق من نار ‏\"‏ ‏.‏ قالت قرطين من ذهب ‏.‏ قال ‏\"‏ قرطين من نار ‏\"‏ ‏.‏ قال وكان عليهما سواران من ذهب فرمت بهما قالت يا رسول الله إن المرأة إذا لم تتزين لزوجها صلفت عنده ‏.‏ قال ‏\"‏ ما يمنع إحداكن أن تصنع قرطين من فضة ثم تصفره بزعفران أو بعبير ‏\"‏ ‏.‏ اللفظ لابن حرب ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I was sitting with the Prophet [SAW] when a woman came to him and said: 'O Messenger of Allah, two bracelets of gold.' He said: 'Two bracelets of fire.' She said: 'O Messenger of Allah, a necklace of gold.' He said: 'A necklace of fire.' She said: 'Two earrings of gold.' He said: 'Two earrings of fire.' She was wearing two bracelets of gold, so she took them off and said: 'O Messenger of Allah, if a woman does not adorn herself for her husband, she will become unattractive to him.' He said: 'What is there to keep any one of you from making earrings of silver and painting them yellow with saffron or some 'Abir'?' This is the wording of Ibn Harb.",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20423",
        "11395",
        "38011",
        "11395",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-38",
      "hadith_no": "38",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن مطرف، عن عطية، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever tells lies about me deliberately, let him take his place in Hell.\"",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20345",
        "11395",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-395",
      "hadith_no": "395",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، يحدث عن عبد الله بن المغفل، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that:                     The Messenger of Allah said: 'If a dog licks a vessel, wash it seven times and rub it with dust the eight times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11317",
        "11395"
      ]
    },
    {
      "id": "sunan-ibn-majah-1773",
      "hadith_no": "1773",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن مطرف، عن الشعبي، عن مسروق، عن عائشة، قالت كان النبي  صلى الله عليه وسلم  يبيت جنبا فيأتيه بلال فيؤذنه بالصلاة فيقوم فيغتسل فأنظر إلى تحدر الماء من رأسه ثم يخرج فأسمع صوته في صلاة الفجر ‏.‏ قال مطرف فقلت في رمضان قال رمضان وغيره سواء ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) used to spendthenight in a state of sexual impurity, then Bilal would come to himandinform him that it is time for prayer. So he would get up and haveabath, and I would see the water dripping from his head, then hewouldgo out and I would hear his voice during Fajr prayer.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11395",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2601",
      "hadith_no": "2601",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الوهاب الثقفي، عن خالد الحذاء، عن أبي العلاء، عن مطرف، عن عياض بن حمار، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجد لقطة فليشهد ذا عدل أو ذوى عدل ثم لا يغيره ولا يكتم فإن جاء ربها فهو أحق بها وإلا فهو مال الله يؤتيه من يشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Iyad bin Himar that the Messenger of Allah (ﷺ) said:                     “Whoever finds lost property, let him ask one or two men of good character to witness it, then he should not alter it nor conceal it. If its owner comes along, then he has more right to it, otherwise it belongs to Allah (SWT), Who gives it to whomsoever He wills.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20259",
        "11282",
        "11395",
        "5217"
      ]
    },
    {
      "id": "sunan-ibn-majah-2760",
      "hadith_no": "2760",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا علقمة بن عمرو الدارمي، حدثنا أبو بكر بن عياش، عن مطرف، عن الشعبي، عن أبي جحيفة، قال قلت لعلي بن أبي طالب هل عندكم شىء من العلم ليس عند الناس قال لا والله ما عندنا إلا ما عند الناس إلا أن يرزق الله رجلا فهما في القرآن أو ما في هذه الصحيفة فيها الديات عن رسول الله صلى الله عليه وسلم وأن لا يقتل مسلم بكافر ‏.‏",
      "text_en": " It was narrated that Abu Juhaifah said:                     “I said to 'Ali bin Abu Talib: 'Do you have any knowledge that the people do not have?' He said: 'No, by Allah, we only know what the people know, except that Allah may bless a man with understanding of Qur'an or what is in this sheet, in which are mentioned the rulings on blood money from the Messenger of Allah (ﷺ) and it says that a Muslim should not be killed in retaliation for the murder of disbeliever.'”",
      "usc_msa_ref": "",
      "chain": [
        "20373",
        "11395",
        "11052",
        "4047"
      ]
    },
    {
      "id": "sunan-ibn-majah-3321",
      "hadith_no": "3321",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، يحدث عن عبد الله بن مغفل، أن رسول الله  صلى الله عليه وسلم  أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم وللكلاب ‏\"‏ ‏.‏ ثم رخص لهم في كلب الصيد ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) commanded that dogs be killed, then he said:                      “What do theyuse dogs for?” Then he permitted them to keep hunting dogs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-3322",
      "hadith_no": "3322",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، ح وحدثنا محمد بن الوليد، حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله  صلى الله عليه وسلم  أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم وللكلاب ‏\"‏ ‏.‏ ثم رخص لهم في كلب الزرع وكلب العين ‏.‏ قال بندار العين حيطان المدينة ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) commanded that dogs be killed, then he said:                      “What do theyuse dogs for?” Then he permitted them to keep farming dogs and dogsof‘Ein. Bundar said: “The ‘Ein refers to the walls ofAl-Madinah.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "20459",
        "20173",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    }
  ],
  "total_hadiths": 101
}