{
  "id": "11390",
  "name": "Mkhwl bin Rashid al-Nhdy Mwlahm مخول بن راشد",
  "full_name": "Mkhwl bin Rashid al-Nhdy Mwlahm مخول بن راشد",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "255",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن مخول بن راشد، عن محمد بن علي، عن جابر بن عبد الله، قال كان النبي صلى الله عليه وسلم يفرغ على رأسه ثلاثا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pour water three times on his head.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11390",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "2068",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن سفيان، عن مخول، بن راشد عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يقرأ في صلاة الفجر يوم الجمعة ‏{‏ الم * تنزيل‏}‏ السجدة و ‏{‏ هل أتى على الإنسان حين من الدهر‏}‏ وأن النبي صلى الله عليه وسلم كان يقرأ في صلاة الجمعة سورة الجمعة والمنافقين ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer on Friday Surah\" Alif-Lam-Mim, Tanz'il ul-Sajda\" (Surah xxxii.): Surely there came over the man a time\" (Surah lxxvii) and he used to recite in Jumu'a prayer Surahs Jumu'a and al-Munafiqin.",
      "chain": [
        "30201",
        "20337",
        "20012",
        "11390",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن مخول بن راشد، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الفجر يوم الجمعة تنزيل السجدة و ‏{‏ هل أتى على الإنسان حين من الدهر ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      the Messenger of Allah (ﷺ) used to recite in the morning prayer on Friday Surah Tanzil al-Sajdah (xxxii.) and Surah al-Dahr(lxxi.).",
      "chain": [
        "30175",
        "20469",
        "11390",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "520",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن مخول بن راشد، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يقرأ يوم الجمعة في صلاة الفجر * ‏(‏تنزيل ‏)‏ السجدة و ‏(‏هل أتى على الإنسان ‏)‏ ‏.‏ قال وفي الباب عن سعد وابن مسعود وأبي هريرة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد رواه سفيان الثوري وشعبة وغير واحد عن مخول ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"For the Fajr prayer on Friday, Allah's Messenger would recite: Alif Lam Mem (which is) revealed in (Surat) As-Sajdah and, Has there not been over man.\"",
      "chain": [
        "20387",
        "20587",
        "11390",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، حدثنا خالد بن الحارث، عن شعبة، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، أخبرني مخول بن راشد، قال سمعت أبا سعد، - رجلا من أهل المدينة - يقول رأيت أبا رافع مولى رسول الله  صلى الله عليه وسلم  رأى الحسن بن علي وهو يصلي وقد عقص شعره فأطلقه أو نهى عنه وقال نهى رسول الله  صلى الله عليه وسلم  أن يصلي الرجل وهو عاقص شعره ‏.‏",
      "text_en": " Mukhawwal said:                      “I heard Abu Sa’d, a man from the people ofMadinah,say: ‘I saw Abu Rafi’, the freed slave of the Messengerof Allah(ﷺ), when he saw Hasan bin ‘Ali performing prayer, withhis hairbraided. He undid it, or told him not to do that, and said:“TheMessenger of Allah (ﷺ) forbade a man from performing prayerwith hishair braided.”",
      "chain": [
        "34043",
        "20226",
        "20020",
        "30160",
        "20173",
        "20020",
        "11390"
      ]
    }
  ],
  "total_hadiths": 5
}