{
  "id": "11394",
  "name": "al-Musayb bin Rafa'i al-Asadi المسيب بن رافع الأسدي الكاهلي أبو العلاء",
  "full_name": "al-Musayb bin Rafa'i al-Asadi المسيب بن رافع الأسدي الكاهلي أبو العلاء",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Asad",
      "al-Kahali",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4109",
      "name": "Harithh bin Wahb al-Khza'y ( حارثة بن وهب الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4026",
      "name": "Kharsha bin al-Hurr al-Fazari ( خرشة بن الحر الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10779",
      "name": "'Amir bin 'Abda عامر بن عبدة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11402",
      "name": "Wrad al-Thqfy Abu Sa'id وراد الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18400",
      "name": "Swa'a al-Khza'y Akhw Mghyth سواء الخزاعي أخو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10894",
      "name": "Tmym bin Trfh تميم بن طرفة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4221",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن إشكاب، حدثنا محمد بن فضيل، عن العلاء بن المسيب، عن أبيه، قال لقيت البراء بن عازب  رضى الله عنهما  فقلت طوبى لك صحبت النبي صلى الله عليه وسلم وبايعته تحت الشجرة‏.‏ فقال يا ابن أخي إنك لا تدري ما أحدثنا بعده‏.‏",
      "text_en": " Narrated Al-Musaiyab:                     I met Al-Bara bin `Azib and said (to him). \"May you live prosperously! You enjoyed the company of the Prophet and gave him the Pledge of allegiance (of Al-Hudaibiya) under the Tree.\" On that, Al- Bara' said, \"O my nephew! You do not know what we have done after him (i.e. his death).",
      "chain": [
        "30290",
        "20356",
        "11647",
        "11394"
      ]
    },
    {
      "hadith_no": "6388",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، حدثنا العلاء بن المسيب، قال حدثني أبي، عن البراء بن عازب، قال كان رسول الله صلى الله عليه وسلم إذا أوى إلى فراشه نام على شقه الأيمن ثم قال ‏\"‏ اللهم أسلمت نفسي إليك، ووجهت وجهي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، ونبيك الذي أرسلت‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ من قالهن ثم مات تحت ليلته مات على الفطرة ‏\"‏‏.‏ ‏{‏استرهبوهم‏}‏ من الرهبة، ملكوت ملك مثل رهبوت خير من رحموت، تقول ترهب خير من أن ترحم‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     When Allah's Apostle went to bed, he used to sleep on his right side and then say, \"All-ahumma aslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu zahri ilaika, raghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Amantu bikitabika al-ladhi anzalta wa nabiyyika al-ladhi arsalta! Allah's Apostle said, \"Whoever recites these words (before going to bed) and dies the same night, he will die on the Islamic religion (as a Muslim).",
      "chain": [
        "30175",
        "20256",
        "11647",
        "11394",
        "400"
      ]
    },
    {
      "hadith_no": "6404",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة قال كتب المغيرة إلى معاوية بن أبي سفيان أن رسول الله صلى الله عليه وسلم كان يقول في دبر كل صلاة إذا سلم ‏\"‏ لا إله إلا الله، وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ‏\"‏‏.‏ وقال شعبة عن منصور قال سمعت المسيب‏.‏",
      "text_en": " Narrated Warrad:                     (the freed slave of Al-Mughira bin Shu`ba) Al-Mughira wrote to Muawiya bin Abu Sufyan that Allah's Apostle used to say at the end of every prayer after the Taslim, \"La ilaha illa-l-lahu wahdahu la sharika lahu; lahu-l-mulk wa lahu-l-hamd, wahuwa 'ala kulli shai'n qadir. Allahumma la mani'a Lima a taita, wa la mu'ta Lima mana'ta, wa la yanfa'u dhal-jaddu minkal-jadd.",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11394"
      ]
    },
    {
      "hadith_no": "17",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني أبو سعيد الأشج، حدثنا وكيع، حدثنا الأعمش، عن المسيب بن رافع، عن عامر بن عبدة، قال قال عبد الله إن الشيطان ليتمثل في صورة الرجل فيأتي القوم فيحدثهم بالحديث من الكذب فيتفرقون فيقول الرجل منهم سمعت رجلا أعرف وجهه ولا أدري ما اسمه يحدث ‏.‏",
      "text_en": "",
      "chain": [
        "30200",
        "20032",
        "11060",
        "11394",
        "10779",
        "16"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج علينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما لي أراكم رافعي أيديكم كأنها أذناب خيل شمس اسكنوا في الصلاة ‏\"‏ ‏.‏ قال ثم خرج علينا فرآنا حلقا فقال ‏\"‏ ما لي أراكم عزين ‏\"‏ ‏.‏ قال ثم خرج علينا فقال ‏\"‏ ألا تصفون كما تصف الملائكة عند ربها ‏\"‏ ‏.‏ فقلنا يا رسول الله وكيف تصف الملائكة عند ربها قال ‏\"‏ يتمون الصفوف الأول ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) came to us and said: How is it that I see you lifting your hands like the tails of headstrong horses? Be calm in prayer. He (the narrator) said: He then again came to us and saw us (sitting) in circles; he said: How is it that I see you in separate groups? He (the narrator) said: He again came to us and said: Why don't you draw yourselves up in rows as angels do in the presence of their Lord? We said: Messenger of Allah, bow do the angels draw themselves up in rows in the presence of their Lord? He (the Holy Prophet) said: They make the first rows complete and keep close together in the row.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة قال كتب المغيرة بن شعبة إلى معاوية أن رسول الله صلى الله عليه وسلم كان إذا فرغ من الصلاة وسلم قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba wrote to Mu'awiya:                      When the Messenger of Allah (may peace be upon him) finished the prayer and pronounced salutation he uttered (this supplication):\" There is no god but Allah. He is alone, Who has no partner. To Him belongs the sovereignty and to Him praise is due and He is Potent over every. thing. O Allah! no one can withhold what Thou givest, or give what Thou withholdest, and the riches cannot avail a wealthy person with Thee.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11394"
      ]
    },
    {
      "hadith_no": "1367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وأبو كريب وأحمد بن سنان قالوا حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة عن المغيرة، عن النبي صلى الله عليه وسلم ‏.‏ مثله قال أبو بكر وأبو كريب في روايتهما قال فأملاها على المغيرة وكتبت بها إلى معاوية ‏.‏",
      "text_en": " A hadith like this has been narrated by Mughira b. Shu'ba with another chain of transmitters. Abu Bakr and Abu Kuraib narrated in their narration (that Warrad reported):                      Mughira gave me dictation of it and 1 wrote it to Mu'awiya.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11394",
        "166"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن آدم بن سليمان المصيصي، حدثنا ابن أبي زائدة، قال حدثني أبو أيوب، - يعني الإفريقي - عن عاصم، عن المسيب بن رافع، ومعبد، عن حارثة بن وهب الخزاعي، قال حدثتني حفصة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يجعل يمينه لطعامه وشرابه وثيابه ويجعل شماله لما سوى ذلك ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) used his right hand for taking his food and drink and used his left hand for other purposes.",
      "chain": [
        "38474",
        "20366",
        "15293",
        "11080",
        "11394",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، قال سألت سليمان الأعمش عن جابر بن سمرة، في الصفوف المقدمة فحدثنا عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم جل وعز ‏\"‏ ‏.‏ قلنا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصفوف المقدمة ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " jabir b. Samurah reported the Messenger of Allah (ﷺ) as saying:                      Why do you stand in rows as the angels do in the presence of their Lord? We asked: how do the angles stand in rows in the presence of their Lord? He replied: they make the first row complete and keep close together in the row.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "393",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - وهذا حديثه وهو أتم - عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة الطائي، عن جابر بن سمرة، - قال عثمان - قال دخل رسول الله صلى الله عليه وسلم المسجد فرأى فيه ناسا يصلون رافعي أيديهم إلى السماء - ثم اتفقا - فقال ‏\"‏ لينتهين رجال يشخصون أبصارهم إلى السماء - قال مسدد في الصلاة - أو لا ترجع إليهم أبصارهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said(this is the version of the narrator ‘Uthman):                      The Messenger of Allah(ﷺ) entered the mosque and saw there some people praying raising their hand towards the heaven. (This Is the common version: ) He said : People must stop raising their eyes to the heaven. The narrator Musaddad said: During prayer, otherwise their sight will be taken away.",
      "chain": [
        "30175",
        "20354",
        "30203",
        "20028",
        "11060",
        "11394",
        "10894",
        "393",
        "4"
      ]
    },
    {
      "hadith_no": "1000",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا الأعمش، عن المسيب بن رافع، عن تميم الطائي، عن جابر بن سمرة، قال دخل علينا رسول الله صلى الله عليه وسلم والناس رافعو أيديهم - قال زهير أراه قال - في الصلاة فقال ‏\"‏ ما لي أراكم رافعي أيديكم كأنها أذناب خيل شمس اسكنوا في الصلاة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said:                      The Messenger of Allah (ﷺ) entered upon us while the people were raising their hands. The narrator Zubair said: I think( they were raising the hands) during prayer. He (the prophet) said: What is the matter, I see you raising your hands as if they are the tails of restive horses! Maintain tranquility during prayer.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "11394",
        "393"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، كتب معاوية إلى المغيرة بن شعبة أى شىء كان رسول الله صلى الله عليه وسلم يقول إذا سلم من الصلاة فأملاها المغيرة عليه وكتب إلى معاوية كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu'bah reported:                      \"Mu'awiyah wrote to al-Mughirah b. Shu'bah: 'What would the the Messenger of Allah (ﷺ) recite when he gave Taslim (salutation) in the prayer ?' Al-Mughirah dictated and wrote to Mu'awiyah: 'The Messenger of Allah (ﷺ) used to say (at the end of the prayer after taslim): 'There is no God but Allah, Alone, Who has no partner, to Him belongs the dominion, to Him praise is due, and He is Omnipotent. O Allah no one cane withhold what You give and give what You withhold, and none benefits the fortunate person, for from You is the fortune.\t'\"",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11394",
        "166"
      ]
    },
    {
      "hadith_no": "4823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الأعمش، قال حدثني المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال دخل رسول الله صلى الله عليه وسلم المسجد وهم حلق فقال ‏\"‏ ما لي أراكم عزين ‏\"‏ ‏.‏",
      "text_en": " JABIR B. SAMURAH SAID:                      THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) ENTERED THE MOSQUE, AND SAW THEM( HIS COMPANIONS) IN SEPARATE GROUPS. HE SAID: HOW IS IT THAT I SEE YOU IN SEPARATE GROUPS.",
      "chain": [
        "30175",
        "20031",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا مؤمل، - هو ابن إسماعيل حدثنا سفيان الثوري، عن أبي إسحاق، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى في يوم وليلة ثنتى عشرة ركعة بني له بيت في الجنة أربعا قبل الظهر وركعتين بعدها وركعتين بعد المغرب وركعتين بعد العشاء وركعتين قبل صلاة الفجر ‏\"‏ ‏.‏ قال أبو عيسى وحديث عنبسة عن أم حبيبة في هذا الباب حديث حسن صحيح وقد روي عن عنبسة من غير وجه ‏.‏",
      "text_en": " Umm Habibah narrated that Allah's Messenger (S) sad:                     \"Whoever prays twelve Rak'ah in a day and night, a house will be built from him in Paradise: Four Rak'ah before Zuhr, two Rak'ah after it, two Rak'ah after Maghrib, two Rak'ah after Isha, and two Rak'ah before Fajr in the morning Salat.\"",
      "chain": [
        "30277",
        "23066",
        "20012",
        "11049",
        "11394",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل بن عياض، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم ‏\"‏ ‏.‏ قالوا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصف الأول ثم يتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                      \"The Messenger of Allah (ﷺ) came out to us and said:'Will you not form rows as the angels form rows before their Lord? They said: 'How do the angels form rows before their lord? He said: 'They complete the first row and fill the gaps in the rows.\"'",
      "chain": [
        "30367",
        "20200",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا عبثر، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن رافعو أيدينا في الصلاة فقال ‏\"‏ ما بالهم رافعين أيديهم في الصلاة كأنها أذناب الخيل الشمس اسكنوا في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah (ﷺ) came out to us and we were raising our hands during the Salah. He said: 'Why are you raising your hands while praying, like the tails of wild horses? Stay still when you are praying.'\"",
      "chain": [
        "30367",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال أنبأنا زهير، عن أبي إسحاق، عن المسيب بن رافع، عن عنبسة، أخي أم حبيبة عن أم حبيبة، قالت من صلى في اليوم والليلة ثنتى عشرة ركعة سوى المكتوبة بني له بيت في الجنة أربعا قبل الظهر وركعتين بعدها وثنتين قبل العصر وثنتين بعد المغرب وثنتين قبل الفجر ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day other than the prescribed prayers, a house will be built for him in Paradise: four before Zuhr and two rak'ahs afterward, two before Asr, two after Maghrib and two before Fajr.\"",
      "chain": [
        "38022",
        "20348",
        "20321",
        "11049",
        "11394",
        "59"
      ]
    },
    {
      "hadith_no": "1804",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد بن هارون، قال أنبأنا إسماعيل، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى في اليوم والليلة ثنتى عشرة ركعة بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Habibah that:                     The Prophet (ﷺ) said: \"Whoever prays twelve rak'ahs during the day and night, a house will be built for him in Paradise.\"",
      "chain": [
        "34188",
        "20472",
        "11418",
        "11394",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1805",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا إسماعيل، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت من صلى في الليل والنهار ثنتى عشرة ركعة سوى المكتوبة بني له بيت في الجنة ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, a house will be built for him in Paradise.\"",
      "chain": [
        "38022",
        "20372",
        "11418",
        "11394",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1806",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا محمد بن مكي، وحبان، قالا حدثنا عبد الله، عن إسماعيل، عن المسيب بن رافع، عن أم حبيبة، قالت من صلى في يوم وليلة ثنتى عشرة ركعة سوى المكتوبة بنى الله عز وجل له بيتا في الجنة ‏.‏ لم يرفعه حصين وأدخل بين عنبسة وبين المسيب ذكوان ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise.\"",
      "chain": [
        "30514",
        "20218",
        "18",
        "20208",
        "11394",
        "59"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا وهب، قال حدثنا خالد، عن حصين، عن المسيب بن رافع، عن أبي صالح، ذكوان قال حدثني عنبسة بن أبي سفيان، أن أم حبيبة، حدثته أنه، من صلى في يوم ثنتى عشرة ركعة بني له بيت في الجنة ‏.‏",
      "text_en": " Anbasah bin Abi Sufyan narrated that:                     Umm Habibah told him: \"Whoever prays twelve rak'ahs, a house will be built for him in Paradise.\"",
      "chain": [
        "20298",
        "20423",
        "15097",
        "11394",
        "11161",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1940",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبثر، عن برد، أخي يزيد بن أبي زياد عن المسيب بن رافع، قال سمعت البراء بن عازب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من تبع جنازة حتى يصلى عليها كان له من الأجر قيراط ومن مشى مع الجنازة حتى تدفن كان له من الأجر قيراطان والقيراط مثل أحد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Musayyab bin Rafi' said:                     \"I heard Al-Bara' bin 'Azib say: The Messenger of Allah said: 'whoever follows a Janazah until the prayer is offered, he will have one Qirat of reward and whoever walks with the funeral until (the body) is buried will have two Qirats of reward, and a Qirat is like Uhud.\"'",
      "chain": [
        "30367",
        "11394",
        "400"
      ]
    },
    {
      "hadith_no": "2364",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم بن حبيب بن الشهيد، قال حدثنا يحيى بن يمان، عن سفيان، عن عاصم، عن المسيب بن رافع، عن سواء الخزاعي، عن عائشة، قالت كان النبي صلى الله عليه وسلم يصوم الاثنين والخميس ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to be keen to fast on Mondays and Thursday.\"",
      "chain": [
        "34027",
        "20617",
        "20012",
        "11080",
        "11394",
        "18400",
        "53"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة السوائي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا تصفون كما تصف الملائكة عند ربها ‏\"‏ ‏.‏ قال قلنا وكيف تصف الملائكة عند ربها قال ‏\"‏ يتمون الصفوف الأول ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin Samurah As-Suwa’i said:                      “The Messenger ofAllah (ﷺ) said: ‘Will you not form your rows as the angels formtheir rows before their Lord?’ We said: ‘How do the angels formtheir rows before their Lord?’ He said: ‘They complete the firstrow and they stand close of one another in the line (leaving no gapsbetween one another).’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1098",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لينتهين أقوام يرفعون أبصارهم إلى السماء أو لا ترجع أبصارهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin Samurah that the Prophet (ﷺ) said:                     “Letthose who lift their gaze to the heavens desist, or their sightwillnot come back.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا إسماعيل بن أبي خالد، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة بنت أبي سفيان، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من صلى في يوم وليلة ثنتى عشرة سجدة بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Habibah bint Abi Sufyan that the Prophet(ﷺ)said:                      “Whoever performs twelve Rak’ah (of Sunnah) during the dayand night, a house will be built for him in Paradise.”",
      "chain": [
        "30201",
        "20472",
        "11418",
        "11394",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "3920",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى الأشيب، حدثنا حماد بن سلمة، عن عاصم بن بهدلة، عن المسيب بن رافع، عن خرشة بن الحر، قال قدمت المدينة فجلست إلى أشيخة في مسجد النبي  صلى الله عليه وسلم  فجاء شيخ يتوكأ على عصا له فقال القوم من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏.‏ فقام خلف سارية فصلى ركعتين فقمت إليه فقلت له قال بعض القوم كذا وكذا ‏.‏ قال الحمد لله الجنة لله يدخلها من يشاء وإني رأيت على عهد رسول الله  صلى الله عليه وسلم  رؤيا رأيت كأن رجلا أتاني فقال لي انطلق ‏.‏ فذهبت معه فسلك بي في منهج عظيم فعرضت على طريق على يساري فأردت أن أسلكها فقال إنك لست من أهلها ‏.‏ ثم عرضت على طريق عن يميني فسلكتها حتى إذا انتهيت إلى جبل زلق فأخذ بيدي فزجل بي فإذا أنا على ذروته فلم أتقار ولم أتماسك وإذا عمود من حديد في ذروته حلقة من ذهب فأخذ بيدي فزجل بي حتى أخذت بالعروة فقال استمسكت قلت نعم فضرب العمود برجله ‏.‏ فاستمسكت بالعروة ‏.‏ فقال قصصتها على النبي  صلى الله عليه وسلم  ‏.‏ قال ‏\"‏ رأيت خيرا أما المنهج العظيم فالمحشر وأما الطريق التي عرضت عن يسارك فطريق أهل النار ولست من أهلها وأما الطريق التي عرضت عن يمينك فطريق أهل الجنة وأما الجبل الزلق فمنزل الشهداء وأما العروة التي استمسكت بها فعروة الإسلام فاستمسك بها حتى تموت ‏\"‏ ‏.‏ فأنا أرجو أن أكون من أهل الجنة فإذا هو عبد الله بن سلام ‏.‏",
      "text_en": " It wasnarrated that Kharashah bin Hurr said:                      “I came to Al-Madinah andsat with some old men in the mosque of the Prophet (ﷺ). Then an oldman came, leaning on his stick, and the people said: ‘Whoever wouldlike to look at a man from among the people of Paradise, let him lookat this man.’ He stood behind a pillar and prayed two Rak’ah. Igot up and went to him, and said to him: ‘Some of the people saidsuch and such.’ He said: ‘Praise is to Allah. Paradise belongs toAllah and He admits whomsoever He wills to it. At the time of theMessenger of Allah (ﷺ) I saw a dream in which a man came to me andsaid: “Let’s go.” So I went with him and he took me along agreat road. A road was shown to me on the left and I wanted to followit, but he said: “You are not one of its people.” Then a road wasshown to me on the right, and I followed him until I reached aslippery mountain. He took me by the hand and helped me up. When Ireached the top I could not stand firm. There was an iron pillarthere with a golden ring at the top. He took my hand and helped me upuntil I reached the handhold, then he said: “Have you gotten a firmhold?” I said: “Yes.” Then he struck the pillar with his footand I held tight to the pillar. I told this to the Prophet (ﷺ) and he said: \"You have seen something good. The great road is the plain of gathering (on the Day of Resurrection). The road that you were shown on your left is the way of the people of Hell, and you are not one of its people. The road which you were shown on your right is the way of the people of Paradise. The slippery mountain is the place of the martyrs, and the handhold that you held on tight to is the handhold of Islam. Hold on tight to it until you die.\" I hope to be one of the people of Paradise,' and he was 'Abdullah bin Salam.\"",
      "chain": [
        "30201",
        "20383",
        "20021",
        "11358",
        "11394",
        "4026"
      ]
    }
  ],
  "total_hadiths": 27
}