{
  "id": "11396",
  "name": "Ma'bad bin Khalid al-Jadli معبد بن خالد الجدلي",
  "full_name": "Ma'bad bin Khalid al-Jadli معبد بن خالد الجدلي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "112",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Jadli",
      "al-Qaysi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4109",
      "name": "Harithh bin Wahb al-Khza'y ( حارثة بن وهب الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2904",
      "name": "al-Mustward bin Shadad ( المستورد بن شداد الفهري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15166",
      "name": "Zayd bin 'Uqba al-Fzary زيد بن عقبة الفزاري الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "18400",
      "name": "Swa'a al-Khza'y Akhw Mghyth سواء الخزاعي أخو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "169",
      "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11358",
      "name": "'Asim bin Abu al-Najud عاصم بن بهدلة / بن أبي النجود",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1432",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا معبد بن خالد، قال سمعت حارثة بن وهب، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ تصدقوا فإنه يأتي عليكم زمان يمشي الرجل بصدقته، فلا يجد من يقبلها يقول الرجل لو جئت بها بالأمس لقبلتها، فأما اليوم فلا حاجة لي بها ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahab:                     I heard the Prophet saying, \"O people! Give in charity as a time will come upon you when a person will wander about with his object of charity and will not find anybody to accept it, and one (who will be requested to take it) will say, \"If you had brought it yesterday, would have taken it, but today I am not in need of it.\"",
      "chain": [
        "20404",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "1445",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، قال أخبرني معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ تصدقوا، فسيأتي عليكم زمان يمشي الرجل بصدقته فيقول الرجل لو جئت بها بالأمس لقبلتها منك، فأما اليوم فلا حاجة لي فيها ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahab Al-Khuza`i:                     I heard the Prophet (p.b.u.h) saying, \"(O people!) Give in charity (for Allah's cause) because a time will come when a person will carry his object of charity from place to place (and he will not find any person to take it) and any person whom he shall request to take it, I will reply, 'If you had brought it yesterday I would have taken it, but today I am not in need of it.\"",
      "chain": [
        "20386",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "4967",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره، ألا أخبركم بأهل النار كل عتل جواظ مستكبر ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb Al-Khuza`i:                     I heard the Prophet saying. \"May I tell you of the people of Paradise? Every weak and poor obscure person whom the people look down upon but his oath is fulfilled by Allah when he takes an oath to do something. And may I inform you of the people of the Hell-Fire? They are all those violent, arrogant and stubborn people.\"",
      "chain": [
        "20348",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "5797",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال حدثني معبد بن خالد، قال سمعت عبد الله بن شداد، عن عائشة  رضى الله عنها  قالت أمرني رسول الله صلى الله عليه وسلم أو أمر أن يسترقى من العين‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet ordered me or somebody else to do Ruqya (if there was danger) from an evil eye.",
      "chain": [
        "28531",
        "20012",
        "11396",
        "169",
        "53"
      ]
    },
    {
      "hadith_no": "6140",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا معبد بن خالد القيسي، عن حارثة بن وهب الخزاعي، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأهل الجنة، كل ضعيف متضاعف، لو أقسم على الله لأبره، ألا أخبركم بأهل النار كل عتل جواظ مستكبر ‏\"‏‏.‏",
      "text_en": "      Narrated Haritha bin Wahb:                          Al-Khuzai: The Prophet said, \"Shall I inform you about the people of      Paradise? They comprise every obscure unimportant humble person, and      if he takes Allah's Oath that he will do that thing, Allah will      fulfill his oath (by doing that). Shall I inform you about the people      of the Fire? They comprise every cruel, violent, proud and conceited      person.\"",
      "chain": [
        "28531",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "6671",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا حرمي بن عمارة، حدثنا شعبة، عن معبد بن خالد، أنه سمع حارثة بن وهب، يقول سمعت النبي صلى الله عليه وسلم وذكر الحوض فقال ‏\"‏ كما بين المدينة وصنعاء ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb:                     I heard the Prophet mentioning the Lake-Fount (Al-Kauthar), saying, \"(The width of the Lake-Fount) is equal to the distance between Medina and Sana' (capital of Yemen).\" Haritha said that he heard the Prophet saying that his Lake-Fount would be as large as the distance between Sana' and Medina. Al- Mustaurid said to Haritha, \"Didn't you hear him talking about the vessels?\" He said, \"No.\" Al- Mustaurid said, \"The vessels are seen in it as (numberless as) the stars.\"",
      "chain": [
        "30026",
        "20221",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "6672",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وزاد ابن أبي عدي عن شعبة، عن معبد بن خالد، عن حارثة، سمع النبي صلى الله عليه وسلم قوله حوضه ما بين صنعاء والمدينة‏.‏ فقال له المستورد ألم تسمعه قال الأواني‏.‏ قال لا‏.‏ قال المستورد ترى فيه الآنية مثل الكواكب‏.‏",
      "text_en": "",
      "chain": [
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "6738",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن المثنى، حدثني غندر، حدثنا شعبة، عن معبد بن خالد، سمعت حارثة بن وهب، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ألا أدلكم على أهل الجنة، كل ضعيف متضعف، لو أقسم على الله لأبره، وأهل النار كل جواظ عتل مستكبر ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb:                     I heard the Prophet saying, \"Shall I tell you of the people of Paradise? They comprise every poor humble person, and if he swears by Allah to do something, Allah will fulfill it; while the people of the fire comprise every violent, cruel arrogant person.\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "2384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا وكيع، حدثنا شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن معبد بن خالد، قال سمعت حارثة بن وهب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تصدقوا فيوشك الرجل يمشي بصدقته فيقول الذي أعطيها لو جئتنا بها بالأمس قبلتها فأما الآن فلا حاجة لي بها ‏.‏ فلا يجد من يقبلها ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb reported Allah's Messenger (may peace be upon him) as saying:                      Give Sadaqa for a time is about to come when a person would walk with alms and the one whom it is to be given would say: Had you brought it yesterday, I would have accepted it. For the present I do not need it. (And the giver of Sadaqa) I would not find anyone to accept it.",
      "chain": [
        "30201",
        "30212",
        "20032",
        "20020",
        "30170",
        "20173",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "5849",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - قال إسحاق أخبرنا وقال أبو بكر، وأبو كريب - واللفظ لهما - حدثنا محمد بن بشر، عن مسعر، حدثنا  معبد بن خالد، عن ابن شداد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يأمرها أن تسترقي من العين ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) commanded the use of incantation for curing the influence of an evil eye.",
      "chain": [
        "30201",
        "30312",
        "20436",
        "20352",
        "20359",
        "11396",
        "53"
      ]
    },
    {
      "hadith_no": "5851",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سفيان، عن معبد بن خالد، عن عبد الله بن، شداد عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يأمرني أن أسترقي من العين ‏.‏",
      "text_en": " 'A'isha reported:                      Allah's Messenger (may peace he upon him) commanded me that I should make use of incantation for curing the influence of an evil eye.",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11396",
        "169",
        "53"
      ]
    },
    {
      "hadith_no": "6122",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن عبد الله بن بزيع، حدثنا ابن أبي عدي، عن شعبة، عن معبد، بن خالد عن حارثة، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ حوضه ما بين صنعاء والمدينة ‏\"‏ ‏.‏ فقال له المستورد ألم تسمعه قال ‏\"‏ الأواني ‏\"‏ ‏.‏ قال لا ‏.‏ فقال المستورد ‏\"‏ ترى فيه الآنية مثل الكواكب ‏\"‏ ‏.‏",
      "text_en": " Haritha reported that he heard Allah's Messenger (may peace be upon him) as saying:                      His Cistern would be as extensive as the distance between San'a' and Medina. Mustaurid (one of the narrators) said: Did you not hear anything about the utensils? Thereupon he said. No. Mustaurid said: You would find that the utensils would be like stars.",
      "chain": [
        "30448",
        "20276",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "6123",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة، حدثنا حرمي بن عمارة، حدثنا شعبة، عن معبد بن خالد، أنه سمع حارثة بن وهب الخزاعي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ وذكر الحوض بمثله ولم يذكر قول المستورد وقوله ‏.‏",
      "text_en": " Haritha b. Wahb al-Khuza'i reported Allah's Messeiiger's (may peace be upon him) words concerning the Cistern like it, but he made no mention of the words of Mustaurid.",
      "chain": [
        "30426",
        "20221",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "7366",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني معبد بن خالد، أنه سمع حارثة بن وهب، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأهل الجنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال صلى الله عليه وسلم ‏\"‏ كل ضعيف متضعف لو أقسم على الله لأبره ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبركم بأهل النار ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ كل عتل جواظ مستكبر ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb reported that he heard Allah's Apostle (may peace be upon him) as saying:                      May I not inform you about the inmates of Paradise? They said: Do this, of course. Thereupon Allah's Apostle (may peace be upon him) said: Every humble person who is considered to be humble if he were to adjure In the name of Allah, He would fulfil it. He then said: May I not inform you about the denizens of Hell-Fire? They said: Yes. And he said: Every haughty, fat and proud (person).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "7368",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره ألا أخبركم بأهل النار كل جواظ زنيم متكبر ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb al-KhuzaIi reported Allah's Messenger (may peace be upon him) as saying:                      May I not inform you about the inmates of Paradise? (And then informing about them) said: Every meek person who is considered to be humble and if they were to adjure in the name of Allah, Allah would certainly fulfil it. May I not inform you about the inmates of Hell-Fire? They are all proud, mean and haughty.",
      "chain": [
        "30212",
        "20032",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن آدم بن سليمان المصيصي، حدثنا ابن أبي زائدة، قال حدثني أبو أيوب، - يعني الإفريقي - عن عاصم، عن المسيب بن رافع، ومعبد، عن حارثة بن وهب الخزاعي، قال حدثتني حفصة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يجعل يمينه لطعامه وشرابه وثيابه ويجعل شماله لما سوى ذلك ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) used his right hand for taking his food and drink and used his left hand for other purposes.",
      "chain": [
        "38474",
        "20366",
        "15293",
        "11080",
        "11394",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "1125",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، عن يحيى بن سعيد، عن شعبة، عن معبد بن خالد، عن زيد بن عقبة، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الجمعة ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) used to recite in the Friday prayer: \"Glorify the name of your most high Lord\" (Surah 87) and Has the story of the overwhelming event reached you? (Surah 88).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11396",
        "15166",
        "394"
      ]
    },
    {
      "hadith_no": "4801",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا وكيع، عن سفيان، عن معبد بن خالد، عن حارثة بن وهب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة الجواظ ولا الجعظري ‏\"‏ ‏.‏ قال والجواظ الغليظ الفظ ‏.‏",
      "text_en": " HARITHAH B. WAHAB REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING :                      NEITHER THE JAWWAZ NOR THE JAZARI WILL ENTER PARADISE. HE SAID THAT THE JAWWAZ IS THE ONE WHO IS COARSE AND UNCIVIL.",
      "chain": [
        "30201",
        "30203",
        "20032",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "5045",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان، حدثنا عاصم، عن معبد بن خالد، عن سواء، عن حفصة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان إذا أراد أن يرقد وضع يده اليمنى تحت خده ثم يقول ‏\"‏ اللهم قني عذابك يوم تبعث عبادك ‏\"‏ ‏.‏ ثلاث مرار ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) wanted to go to sleep, he put his right hand under his cheek and would then say three times: O Allah, guard me from Thy punishment on the day when Thou raisest up Thy servants.",
      "chain": [
        "20040",
        "20577",
        "11080",
        "11396"
      ]
    },
    {
      "hadith_no": "2809",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو نعيم، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره ألا أخبركم بأهل النار كل عتل جواظ متكبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Harithah bin Wahb Al-Khuzai narrated that the Messenger Of Allah (s.a.w) said:                     \"Should I not inform you about the people of Paradise: They are every humble and weak person, who if he  were to make an Oath by Allah, He  would fulfill it. Should I not inform  you about  the people of the Fire: They are every prideful swaggering ill-speaking person.\"",
      "chain": [
        "30277",
        "20348",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، قال أخبرني معبد بن خالد، عن زيد بن عقبة، عن سمرة، قال كان رسول الله صلى الله عليه وسلم يقرأ في صلاة الجمعة ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و{‏ هل أتاك حديث الغاشية ‏}‏ ‏.‏",
      "text_en": " It was narrated that Samurah said:                     \"The Messenger of Allah (ﷺ) used to recite in jumu'ah prayer: 'Glorify the Name of your Lord, the Most Hight' and: 'Has there come to you the narration of the overwhelming (i.e. the Day of Resurrection)?\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11396",
        "15166",
        "394"
      ]
    },
    {
      "hadith_no": "2555",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن معبد بن خالد، عن حارثة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تصدقوا فإنه سيأتي عليكم زمان يمشي الرجل بصدقته فيقول الذي يعطاها لو جئت بها بالأمس قبلتها فأما اليوم فلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Harithah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Give charity, for there will come a time when a man will walk about with his charity, and the one to whom he wants to give it will say: If you had brought ityesterday I would have accepted it, but today (I have no need of it).\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يوسف بن عيسى، قال حدثنا الفضل بن موسى، قال حدثنا مسعر، عن معبد بن خالد، عن عبد الله بن يسار، عن قتيلة، - امرأة من جهينة - أن يهوديا، أتى النبي صلى الله عليه وسلم فقال إنكم تنددون وإنكم تشركون تقولون ما شاء الله وشئت وتقولون والكعبة ‏.‏ فأمرهم النبي صلى الله عليه وسلم إذا أرادوا أن يحلفوا أن يقولوا ‏\"‏ ورب الكعبة ‏\"‏ ‏.‏ ويقولون ‏\"‏ ما شاء الله ثم شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Yasar, from Qutailah, a woman from Juhainah, that a Jew came to the Prophet and said:                      \"You are setting up rivals (to Allah) and associating others (with Him). You say: 'Whatever Allah wills and you will,' and you say: 'By the Ka'bah.'\" So the Prophet commanded them, if they wanted to swear an oath, to say: \"By the Lord of the Ka'bah;\" and to say: \"Whatever Allah wills, then what you will.\"",
      "chain": [
        "30401",
        "20452",
        "20359",
        "11396",
        "15313"
      ]
    },
    {
      "hadith_no": "3641",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن أبي الخصيب، حدثنا وكيع، عن سفيان، ومسعر، عن معبد بن خالد، عن عبد الله بن شداد، عن عائشة، أن النبي  صلى الله عليه وسلم  أمرها أن تسترقي من العين ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) commanded her torecite Ruqyah to treat the evil eye.",
      "chain": [
        "20032",
        "20012",
        "20359",
        "11396",
        "169",
        "53"
      ]
    }
  ],
  "total_hadiths": 24
}