{
  "id": "11409",
  "name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
  "full_name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "136",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Client",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11105",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10938",
      "name": "Abu 'Abdur Rahman al-Habli عبد الله بن يزيد أبو عبد الرحمن الحبلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10913",
      "name": "Salm bin Abi Salm سالم بن أبي سالم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10852",
      "name": "al-Jlah Abu Kathir al-Amwy Mwlahm الجلاح أبو كثير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20438",
      "name": "'Abdur Rahman bin Sharih عبد الرحمن بن شريح أبو شريح المعافري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28148",
      "name": "Khalid bin Hameed al-Mhry خالد بن حميد المهري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "288",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عبيد الله بن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا أراد أن ينام وهو جنب، غسل فرجه، وتوضأ للصلاة‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet intended to sleep while he was Junub, he used to wash his private parts and perform ablution like that for the prayer.",
      "chain": [
        "30399",
        "20023",
        "11409",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "902",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر بن الزبير، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان الناس ينتابون يوم الجمعة من منازلهم والعوالي، فيأتون في الغبار، يصيبهم الغبار والعرق، فيخرج منهم العرق، فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي، فقال النبي صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Apostle who was in my house. The Prophet said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath).\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عبيد الله بن أبي جعفر، قال سمعت حمزة بن عبد الله بن عمر، قال سمعت عبد الله بن عمر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ما يزال الرجل يسأل الناس حتى يأتي يوم القيامة ليس في وجهه مزعة لحم ‏\"‏‏.‏ وقال إن الشمس تدنو يوم القيامة حتى يبلغ العرق نصف الأذن، فبينا هم كذلك استغاثوا بآدم، ثم بموسى، ثم بمحمد صلى الله عليه وسلم ‏\"‏‏.‏ وزاد عبد الله حدثني الليث حدثني ابن أبي جعفر ‏\"‏ فيشفع ليقضى بين الخلق، فيمشي حتى يأخذ بحلقة الباب، فيومئذ يبعثه الله مقاما محمودا، يحمده أهل الجمع كلهم ‏\"‏‏.‏ وقال معلى حدثنا وهيب، عن النعمان بن راشد، عن عبد الله بن مسلم، أخي الزهري عن حمزة، سمع ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم في المسألة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"A man keeps on asking others for something till he comes on the Day of Resurrection without any piece of flesh on his face.\" The Prophet added, \"On the Day of Resurrection, the Sun will come near (to, the people) to such an extent that the sweat will reach up to the middle of the ears, so, when all the people are in that state, they will ask Adam for help, and then Moses, and then Muhammad (p.b.u.h) .\" The sub-narrator added \"Muhammad will intercede with Allah to judge amongst the people. He will proceed on till he will hold the ring of the door (of Paradise) and then Allah will exalt him to Maqam Mahmud (the privilege of intercession, etc.). And all the people of the gathering will send their praises to Allah.",
      "chain": [
        "30399",
        "20023",
        "11409",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "1952",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن خالد، حدثنا محمد بن موسى بن أعين، حدثنا أبي، عن عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر، حدثه عن عروة، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏‏.‏ تابعه ابن وهب عن عمرو‏.‏ ورواه يحيى بن أيوب عن ابن أبي جعفر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"Whoever died and he ought to have fasted (the missed days of Ramadan) then his guardians must fast on his behalf.\"",
      "chain": [
        "38496",
        "30384",
        "20377",
        "11409",
        "20173",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2335",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عبيد الله بن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعمر أرضا ليست لأحد فهو أحق ‏\"‏‏.‏ قال عروة قضى به عمر  رضى الله عنه  في خلافته‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"He who cultivates land that does not belong to anybody is more rightful (to own it).\" `Urwa said, \"`Umar gave the same verdict in his Caliphate.\"",
      "chain": [
        "30399",
        "20023",
        "11409",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7081",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عبيد الله بن أبي جعفر، أخبرني أبو سلمة، عن أبي قتادة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الرؤيا الصالحة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا، وليتعوذ من الشيطان، فإنها لا تضره، وإن الشيطان لا يتزايا بي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"A good dream is from Allah, and a bad dream is from Satan. So whoever has seen (in a dream) something he dislike, then he should spit without saliva, thrice on his left and seek refuge with Allah from Satan, for it will not harm him, and Satan cannot appear in my shape.\"",
      "chain": [
        "30399",
        "20023",
        "11409",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن عبد الرحمن الأعرج، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Abual-Rahman al-Araj on the authority of Abu Huraira.",
      "chain": [
        "30487",
        "20029",
        "20377",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1995",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر، حدثه عن عروة بن الزبير، عن عائشة، أنها قالت كان الناس ينتابون الجمعة من منازلهم من العوالي فيأتون في العباء ويصيبهم الغبار فتخرج منهم الريح فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏ ‏.‏",
      "text_en": " 'Aisha reported:                      The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foal smell. A person among them (those who were dressed so) came to the Messenger of Allah (may peace be upon him) while he was in my house. The Messenger of Allah (may peace he upon him) said to him: Were you to cleanse yourselves on this day.",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11409",
        "20173",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2445",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني الليث، عن عبيد الله بن، أبي جعفر عن حمزة بن عبد الله بن عمر، أنه سمع أباه، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما يزال الرجل يسأل الناس حتى يأتي يوم القيامة وليس في وجهه مزعة لحم ‏\"‏ ‏.‏",
      "text_en": " Hamza b. 'Abdullah b. Umar heard his father cay that the Messenger of Allah (may peace be upon him) had said:                      The person would continue begging from people till he would come on the Day of Resurrection and there would be no flesh on his face.",
      "chain": [
        "20029",
        "20023",
        "11409",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "2748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرنا عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، - رضى الله عنها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      If anyone dies in a state (that he had to complete) some fasts, his heir must fast on his behalf.",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4900",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا ابن نمير، حدثنا يحيى بن عبد الله بن بكير، حدثنا ليث، عن عبيد الله، بن أبي جعفر عن بكير بن عبد الله بن الأشج، عن نافع، عن ابن عمر، أنه أتى ابن مطيع ‏.‏ فذكر عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn 'Umar that he visited Ibn Muti', and related from the Holy Prophet (may peace be upon him) the tradition that has gone before.",
      "chain": [
        "30212",
        "30239",
        "20023",
        "11409",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6020",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن المقرئ، قال أبو بكر حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني عبيد الله بن أبي جعفر، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عرض عليه ريحان فلا يرده فإنه خفيف المحمل طيب الريح ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who is presented with a flower should not reject it, for it is light to carry and pleasant in odour.",
      "chain": [
        "30201",
        "30022",
        "20436",
        "20375",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1055",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان الناس ينتابون الجمعة من منازلهم ومن العوالي ‏.‏",
      "text_en": " ‘A’ishah, the wife of prophet(ﷺ), said:                      The people used to attend the Friday prayer from their houses and from the suburbs of Medina.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "20173",
        "10511"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إدريس الرازي، حدثنا عمرو بن الربيع بن طارق، حدثنا يحيى بن أيوب، عن عبيد الله بن أبي جعفر، أن محمد بن عمرو بن عطاء، أخبره عن عبد الله بن شداد بن الهاد، أنه قال دخلنا على عائشة زوج النبي صلى الله عليه وسلم فقالت دخل على رسول الله صلى الله عليه وسلم فرأى في يدي فتخات من ورق فقال ‏\"‏ ما هذا يا عائشة ‏\"‏ ‏.‏ فقلت صنعتهن أتزين لك يا رسول الله ‏.‏ قال ‏\"‏ أتؤدين زكاتهن ‏\"‏ ‏.‏ قلت لا أو ما شاء الله ‏.‏ قال ‏\"‏ هو حسبك من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated ‘Abdallah bin Shaddad bin Al Had :                     We entered upon A’ishah, wife of the Prophet (ﷺ). She said The Apostle of Allaah (ﷺ) entered upon me and saw two silver rings in my hand. He asked What is this, Aishah? I said I have made two ornaments myself for you, Messenger of Allah (ﷺ). He asked Do you pay zakat on them? I said No or I said Whatever Allah willed. He said this is sufficient for you (to take you) to the Hell fire.",
      "chain": [
        "20002",
        "30206",
        "20379",
        "11409",
        "11220",
        "169"
      ]
    },
    {
      "hadith_no": "2400",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏ قال أبو داود هذا في النذر وهو قول أحمد بن حنبل ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) as saying: If anyone dies when some fast is due from him (i.e. which he could not keep) his heir must fast on his behalf.Abu Dawud said: This applies to the fast which a man vows ; and this is the opinion of Ahmad b. Hanbal.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2868",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عبد الرحمن المقرئ، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي فلا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏ قال أبو داود تفرد به أهل مصر ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Messenger of Allah (ﷺ) said to me: Abu Dharr, I see you weak, and I like for you what I like for myself. Do not be a leader of two (persons), and do not be a guardian of an orphan.Abu Dawud said: This has been narrated only by the people of Egypt.",
      "chain": [
        "30115",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "3311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) as saying: If anyone dies when some fast due from him has been unfulfilled, his heir must fast on his behalf.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن عمر بن مالك، عن عبيد الله بن أبي جعفر، عن خالد بن أبي عمران، عن القاسم، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من شفع لأخيه بشفاعة فأهدى له هدية عليها فقبلها فقد أتى بابا عظيما من أبواب الربا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: If anyone intercedes for his brother and he presents a gift to him for it and he accepts it, he approaches a great door of the doors of usury.",
      "chain": [
        "30485",
        "20029",
        "11409",
        "10906",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "3962",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني ابن لهيعة، والليث بن سعد، عن عبيد الله بن أبي جعفر، عن بكير بن الأشج، عن نافع، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق عبدا وله مال فمال العبد له إلا أن يشترطه السيد ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:                      If anyone emancipates a slave who has property, the property of the slave belongs to him except that the master makes a stipulation.",
      "chain": [
        "30226",
        "20029",
        "20624",
        "20023",
        "11409",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4172",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا الحسن بن علي، وهارون بن عبد الله، - المعنى - أن أبا عبد الرحمن المقرئ، حدثهم عن سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عرض عليه طيب فلا يرده فإنه طيب الريح خفيف المحمل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone is presented some perfume, he should not return it, for it is a thing of good fragrance and light to bear.",
      "chain": [
        "30",
        "20375",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبي عبد الرحمن الحبلي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كشف سترا فأدخل بصره في البيت قبل أن يؤذن له فرأى عورة أهله فقد أتى حدا لا يحل له أن يأتيه لو أنه حين أدخل بصره استقبله رجل ففقأ عينيه ما غيرت عليه وإن مر رجل على باب لا ستر له غير مغلق فنظر فلا خطيئة عليه إنما الخطيئة على أهل البيت ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وأبي أمامة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مثل هذا إلا من حديث ابن لهيعة وأبو عبد الرحمن الحبلي اسمه عبد الله بن يزيد ‏.‏",
      "text_en": " Narrated Abu Dharr:                     that the Messenger of Allah (ﷺ) said: \"Whoever lifts the curtain so that his sight enters the house before he was given permission, and he seeks the nakedness of its inhabitants, then he has done something punishable which was not lawful for him to do. If it were that when he gazed into it, he was facing a man who lanced his eyes, there would be nothing wrong with him doing so. But if a man passes by a door that has no cover over it, and it is not closed and he looks, then there is no sin on him, the sin is only on the inhabitants of the house.\"",
      "chain": [
        "30367",
        "20624",
        "11409",
        "10938",
        "23"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبان بن صالح، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء مخ العبادة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه لا نعرفه إلا من حديث ابن لهيعة ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     the Prophet said: “The supplication is the essence of worship.”",
      "chain": [
        "20387",
        "20733",
        "20624",
        "11409",
        "19897",
        "19"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن عبيد الله بن أبي جعفر، عن صفوان بن سليم، قال ما نهض ملك من الأرض حتى قال لا حول ولا قوة إلا بالله ‏.‏",
      "text_en": " [Safwan bin Sulaim said:                     “No angel has risen from the earth until he said: ‘There is no might or power except with Allah (La Hawla Wa La Quwwata Illa Billah).’”]",
      "chain": [
        "30367",
        "20023",
        "11409",
        "11177"
      ]
    },
    {
      "hadith_no": "2585",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث بن سعد، عن عبيد الله بن أبي جعفر، قال سمعت حمزة بن عبد الله، يقول سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما يزال الرجل يسأل حتى يأتي يوم القيامة ليس في وجهه مزعة من لحم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said: ' A man will keep on asking until on the Day of Resurrection he will come without even a shared of skin on his face. \"'",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "3115",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن عبيد الله بن أبي جعفر، عن صفوان بن أبي يزيد، عن أبي العلاء بن اللجلاج، أنه سمع أبا هريرة، يقول لا يجمع الله عز وجل غبارا في سبيل الله ودخان جهنم في جوف امرئ مسلم ولا يجمع الله في قلب امرئ مسلم الإيمان بالله والشح جميعا ‏.‏",
      "text_en": " It was narrated from Abu Al-'Ala' bin Al-Lajlaj that he heard Abu Hurairah say:                      \"Allah will never combine the dust in the cause of Allah, the Mighty and Sublime, and the smoke of Hell, in the lungs of a Muslim man, and Allah will never combine faith in Allah, and stinginess in the heart of a Muslim man.\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3129",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن عبيد الله بن أبي جعفر، قال أخبرني عروة، عن أبي مراوح، عن أبي ذر، أنه سأل نبي الله صلى الله عليه وسلم أى العمل خير قال ‏\"‏ إيمان بالله وجهاد في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that he asked the prophet of Allah (ﷺ) which deed was best. He said:                      \"Belief in Allah and Jihad in the cause of Allah, the Mighty and Sublime.\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "10511",
        "23"
      ]
    },
    {
      "hadith_no": "3667",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا العباس بن محمد، قال حدثنا عبد الله بن يزيد، عن سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين على مال يتيم ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said to me: 'O Abu Dharr, I think that you are weak, and I like for you what I like for myself. Do not accept a position of Amir over two people, and do not agree to be the guardian of an orphan's property.'\"",
      "chain": [
        "1945",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "4203",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن عبيد الله بن أبي جعفر، عن صفوان، عن أبي سلمة، عن أبي أيوب، أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما بعث من نبي ولا كان بعده من خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا فمن وقي بطانة السوء فقد وقي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ayyub said;\"I heard the Messenger of Allah say:                      'No prophet has eve been sent, nor has there been any Khalifah after him, but he has two groups of advisers, a group that tells him to do good and a group that tells him to do evil. Whoever is protected from the evil group, then he is indeed protected.",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "10921",
        "10567",
        "33"
      ]
    },
    {
      "hadith_no": "4206",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن عبيد الله بن أبي جعفر، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ على المرء المسلم السمع والطاعة فيما أحب وكره إلا أن يؤمر بمعصية فإذا أمر بمعصية فلا سمع ولا طاعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah said: 'The Muslim must hear and obey whether he likes it or not, unless he is commanded to commit an act of disobedience. If he is commanded to commit an act of disobedience, then he is not required to hear and obey.\"'",
      "chain": [
        "30367",
        "20023",
        "11409",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5259",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني عبيد الله بن فضالة بن إبراهيم، قال أنبأنا عبد الله بن يزيد المقرئ، قال حدثنا سعيد، قال حدثني عبيد الله بن أبي جعفر، عن الأعرج، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من عرض عليه طيب فلا يرده فإنه خفيف المحمل طيب الرائحة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] said: \"Whoever is offered perfume, let him not refuse it for it is easy to carry, and smells good.\"",
      "chain": [
        "23033",
        "11168",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "938",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رمح المصري، أنبأنا ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبي الأزهر، عن حذيفة بن اليمان، أنه سمع رسول الله  صلى الله عليه وسلم  يقول إذا ركع ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ ثلاث مرات وإذا سجد قال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah bin Al-Yaman that he heard theMessenger ofAllah (ﷺ) say when he bowed:                      “Subhana Rabbiyal-‘Azim(Glory isto my Lord, the Most Great)” three times, and when heprostrated hesaid: “Subhana Rabbiyal-A’la (Glory is to my Lord theMost High)”three times.",
      "chain": [
        "30490",
        "20624",
        "11409",
        "145"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، ومحمد بن يحيى، قالا حدثنا ابن أبي مريم، حدثنا يحيى بن أيوب، عن عبيد الله بن أبي جعفر، عن نافع، عن ابن عمر، وعائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من طلب حقا فليطلبه في عفاف واف أو غير واف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar and 'Aishah that the Messenger of Allah (ﷺ) said:                     “Whoever demands his rights let him do so in a decent manner as much as he can.”",
      "chain": [
        "38502",
        "11222",
        "30232",
        "20379",
        "11409",
        "11014",
        "18",
        "53"
      ]
    },
    {
      "hadith_no": "2625",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني ابن لهيعة، ح وحدثنا محمد بن يحيى، حدثنا سعيد بن أبي مريم، أنبأنا الليث بن سعد، جميعا عن عبيد الله بن أبي جعفر، عن بكير بن الأشج، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق عبدا وله مال فمال العبد له إلا أن يشترط السيد ماله فيكون له ‏\"‏ ‏.‏ وقال ابن لهيعة إلا أن يستثنيه السيد ‏.‏",
      "text_en": " It was narrated from Ibn`Umar that the Messenger of Allah (ﷺ) said:                     “Whoever frees a slave who has some wealth, the slave's wealth belongs to him, unless the master stipulates that it will belong to him.”",
      "chain": [
        "30487",
        "20029",
        "20624",
        "11222",
        "30232",
        "20023",
        "11409",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2656",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا زيد بن يحيى بن عبيد، حدثنا الليث بن سعد، عن عبيد الله بن أبي جعفر، عن أبي الأسود، عن عروة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كنت راجما أحدا بغير بينة لرجمت فلانة فقد ظهر فيها الريبة في منطقها وهيئتها ومن يدخل عليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “If I were to stone anyone without proof, I would have stoned so-and-so, for there is obviously doubt concerning her speech, her appearance and those who enter upon her.”",
      "chain": [
        "27513",
        "20023",
        "11409",
        "11105",
        "10511",
        "17"
      ]
    }
  ],
  "total_hadiths": 34
}