{
  "id": "11406",
  "name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
  "full_name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15056",
      "name": "Thabit bin Qays al-Nakha'i ثابت بن قيس بن منقع النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4026",
      "name": "Kharsha bin al-Hurr al-Fazari ( خرشة بن الحر الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18002",
      "name": "Ibrahim bin Jryr bin Abd إبراهيم بن جرير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11678",
      "name": "Jryr bin Zayd جرير بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11622",
      "name": "al-Harith bin Yazid al-'Akli الحارث بن يزيد العكلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10777",
      "name": "Talq bin Mua'wiya al-Nakha'i طلق بن معاوية النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10783",
      "name": "'Abdullah bin Shabarma عبد الله بن شبرمة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10788",
      "name": "'Abdullah bin Yazid al-Nkh'y عبد الله بن يزيد النخعي الصهباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28446",
      "name": "'Amr bin 'Uthman bin 'Abdur Rahman عمرو بن عثمان بن عبد الرحمن بن سعيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11641",
      "name": "'Urwa bin al-Harith عروة بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10707",
      "name": "'Amr bin Sa'id al-Quraishi عمرو بن سعيد القرشي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-36",
      "hadith_no": "36",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حرمي بن حفص، قال حدثنا عبد الواحد، قال حدثنا عمارة، قال حدثنا أبو زرعة بن عمرو بن جرير، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ انتدب الله لمن خرج في سبيله لا يخرجه إلا إيمان بي وتصديق برسلي أن أرجعه بما نال من أجر أو غنيمة، أو أدخله الجنة، ولولا أن أشق على أمتي ما قعدت خلف سرية، ولوددت أني أقتل في سبيل الله ثم أحيا، ثم أقتل ثم أحيا، ثم أقتل ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The person who participates in (Holy battles) in      Allah's cause and nothing compels him to do so except belief in Allah      and His Apostles, will be recompensed by Allah either with a reward,      or booty (if he survives) or will be admitted to Paradise (if he is      killed in the battle as a martyr). Had I not found it difficult for my     followers, then I would not remain behind any sariya going for Jihad      and I would have loved to be martyred in Allah's cause and then made      alive, and then martyred and then made alive, and then again martyred      in His cause.\"",
      "usc_msa_ref": "35",
      "chain": [
        "30129",
        "20256",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-50",
      "hadith_no": "50",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، أخبرنا أبو حيان التيمي، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم بارزا يوما للناس، فأتاه جبريل فقال ما الإيمان قال ‏\"‏ الإيمان أن تؤمن بالله وملائكته وبلقائه ورسله، وتؤمن بالبعث ‏\"‏‏.‏ قال ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به، وتقيم الصلاة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك ‏\"‏‏.‏ قال متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل، وسأخبرك عن أشراطها إذا ولدت الأمة ربها، وإذا تطاول رعاة الإبل البهم في البنيان، في خمس لا يعلمهن إلا الله ‏\"‏‏.‏ ثم تلا النبي صلى الله عليه وسلم ‏{‏إن الله عنده علم الساعة‏}‏ الآية‏.‏ ثم أدبر فقال ‏\"‏ ردوه ‏\"‏‏.‏ فلم يروا شيئا‏.‏ فقال ‏\"‏ هذا جبريل جاء يعلم الناس دينهم ‏\"‏‏.‏ قال أبو عبد الله جعل ذلك كله من الإيمان‏.‏",
      "text_en": "      Narrated Abu Huraira:                          One day while the Prophet was sitting in the company of some people,      (The angel) Gabriel came and asked, \"What is faith?\" Allah's Apostle      replied, 'Faith is to believe in Allah, His angels, (the) meeting with     Him, His Apostles, and to believe in Resurrection.\" Then he further      asked, \"What is Islam?\" Allah's Apostle replied, \"To worship Allah      Alone and none else, to offer prayers perfectly to pay the compulsory      charity (Zakat) and to observe fasts during the month of Ramadan.\"       Then he further asked, \"What is Ihsan (perfection)?\" Allah's Apostle      replied, \"To worship Allah as if you see Him, and if you cannot      achieve this state of devotion then you must consider that He is      looking at you.\" Then he further asked, \"When will the Hour be      established?\" Allah's Apostle replied, \"The answerer has no better      knowledge than the questioner. But I will inform you about its      portents.     1. When a slave (lady) gives birth to her master.     2. When the shepherds of black camels start boasting and competing      with others in the construction of higher buildings. And the Hour is      one of five things which nobody knows except Allah.     The Prophet then recited: \"Verily, with Allah (Alone) is the knowledge     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet      asked his companions to call him back, but they could not see him.      Then the Prophet said, \"That was Gabriel who came to teach the people      their religion.\" Abu 'Abdullah said: He (the Prophet) considered all      that as a part of faith.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-121",
      "hadith_no": "121",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني علي بن مدرك، عن أبي زرعة، عن جرير، أن النبي صلى الله عليه وسلم قال له في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet said to me during Hajjat-al-Wida`: Let the people keep quiet and listen. Then he said (addressing the people), \"Do not (become infidels) revert to disbelief after me by striking the necks (cutting the throats) of one another (killing each other).",
      "usc_msa_ref": "122",
      "chain": [
        "20219",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-1149",
      "hadith_no": "1149",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال لبلال عند صلاة الفجر ‏\"‏ يا بلال حدثني بأرجى عمل عملته في الإسلام، فإني سمعت دف نعليك بين يدى في الجنة ‏\"‏‏.‏ قال ما عملت عملا أرجى عندي أني لم أتطهر طهورا في ساعة ليل أو نهار إلا صليت بذلك الطهور ما كتب لي أن أصلي‏.‏ قال أبو عبد الله دف نعليك يعني تحريك‏.‏",
      "text_en": " Narrated Abu Huraira:                     At the time of the Fajr prayer the Prophet asked Bilal, \"Tell me of the best deed you did after embracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do anything worth mentioning except that whenever I performed ablution during the day or night, I prayed after that ablution as much as was written for me.\"",
      "usc_msa_ref": "250",
      "chain": [
        "30311",
        "20318",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1416",
      "hadith_no": "1416",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا عفان بن مسلم، حدثنا وهيب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن أعرابيا، أتى النبي صلى الله عليه وسلم فقال دلني على عمل إذا عملته دخلت الجنة‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة المكتوبة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال والذي نفسي بيده لا أزيد على هذا‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏\"‏‏.‏ حدثنا مسدد، عن يحيى، عن أبي حيان، قال أخبرني أبو زرعة، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abu Huraira:                     A Bedouin came to the Prophet and said, \"Tell me of such a deed as will make me enter Paradise, if I do it.\" The Prophet (p.b.u.h) said, \"Worship Allah, and worship none along with Him, offer the (five) prescribed compulsory prayers perfectly, pay the compulsory Zakat, and fast the month of Ramadan.\" The Bedouin said, \"By Him, in Whose Hands my life is, I will not do more than this.\" When he (the Bedouin) left, the Prophet said, \"Whoever likes to see a man of Paradise, then he may look at this man.\"Narrated Abu Zur'a:From the Prophet the same as above.",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30106",
        "20299",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1755",
      "hadith_no": "1755",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اغفر للمحلقين ‏\"‏‏.‏ قالوا وللمقصرين‏.‏ قال ‏\"‏ اللهم اغفر للمحلقين ‏\"‏‏.‏ قالوا وللمقصرين‏.‏ قالها ثلاثا‏.‏ قال ‏\"‏ وللمقصرين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"O Allah! Forgive those who get their heads shaved.\" The people asked. \"Also those who get their hair cut short?\" The Prophet said, \"O Allah! Forgive those who have their heads shaved.\" The people said, \"Also those who get their hair cut short?\" The Prophet (invoke Allah for those who have their heads shaved and) at the third time said, \"also (forgive) those who get their hair cut short.\"",
      "usc_msa_ref": "786",
      "chain": [
        "30157",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2543",
      "hadith_no": "2543",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال لا أزال أحب بني تميم‏.‏ وحدثني ابن سلام أخبرنا جرير بن عبد الحميد عن المغيرة عن الحارث عن أبي زرعة عن أبي هريرة‏.‏ وعن عمارة عن أبي زرعة عن أبي هريرة قال ما زلت أحب بني تميم منذ ثلاث سمعت من رسول الله صلى الله عليه وسلم يقول فيهم، سمعته يقول ‏\"‏ هم أشد أمتي على الدجال ‏\"‏‏.‏ قال وجاءت صدقاتهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذه صدقات قومنا ‏\"‏‏.‏ وكانت سبية منهم عند عائشة‏.‏ فقال ‏\"‏ أعتقيها فإنها من ولد إسماعيل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I have loved the people of the tribe of Bani Tamim ever since I heard, three things, Allah's Apostle said about them. I heard him saying, These people (of the tribe of Bani Tamim) would stand firm against Ad-Dajjal.\" When the Sadaqat (gifts of charity) from that tribe came, Allah's Apostle said, \"These are the Sadaqat (i.e. charitable gifts) of our folk.\" `Aisha had a slave-girl from that tribe, and the Prophet said to `Aisha, \"Manumit her as she is a descendant of Ishmael (the Prophet).",
      "usc_msa_ref": "719",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2748",
      "hadith_no": "2748",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن سفيان، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رجل للنبي صلى الله عليه وسلم يا رسول الله، أى الصدقة أفضل قال ‏\"‏ أن تصدق وأنت صحيح حريص‏.‏ تأمل الغنى، وتخشى الفقر، ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا ولفلان كذا، وقد كان لفلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man asked the Prophet, \"O Allah's Apostle! What kind of charity is the best?\" He replied. \"To give in charity when you are healthy and greedy hoping to be wealthy and afraid of becoming poor. Don't delay giving in charity till the time when you are on the death bed when you say, 'Give so much to soand- so and so much to so-and so,' and at that time the property is not yours but it belongs to so-and-so (i.e. your inheritors).",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "20012",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2926",
      "hadith_no": "2926",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقاتلوا اليهود حتى يقول الحجر وراءه اليهودي يا مسلم، هذا يهودي ورائي فاقتله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established until you fight with the Jews, and the stone behind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill him.\"",
      "usc_msa_ref": "177",
      "chain": [
        "30123",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3327",
      "hadith_no": "3327",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول زمرة يدخلون الجنة على صورة القمر ليلة البدر، ثم الذين يلونهم على أشد كوكب دري في السماء إضاءة، لا يبولون ولا يتغوطون ولا يتفلون ولا يمتخطون، أمشاطهم الذهب، ورشحهم المسك، ومجامرهم الألوة الأنجوج عود الطيب، وأزواجهم الحور العين، على خلق رجل واحد على صورة أبيهم آدم، ستون ذراعا في السماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The first group of people who will enter Paradise, will be glittering like the full moon and those who will follow them, will glitter like the most brilliant star in the sky. They will not urinate, relieve nature, spit, or have any nasal secretions. Their combs will be of gold, and their sweat will smell like musk. The aloes-wood will be used in their centers. Their wives will be houris. All of them will look alike and will resemble their father Adam (in statute), sixty cubits tall.\"",
      "usc_msa_ref": "544",
      "chain": [
        "30367",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3340",
      "hadith_no": "3340",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا محمد بن عبيد، حدثنا أبو حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في دعوة، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة وقال ‏\"‏ أنا سيد القوم يوم القيامة، هل تدرون بمن يجمع الله الأولين والآخرين في صعيد واحد فيبصرهم الناظر ويسمعهم الداعي، وتدنو منهم الشمس، فيقول بعض الناس ألا ترون إلى ما أنتم فيه، إلى ما بلغكم، ألا تنظرون إلى من يشفع لكم إلى ربكم فيقول بعض الناس أبوكم آدم، فيأتونه فيقولون يا آدم أنت أبو البشر، خلقك الله بيده ونفخ فيك من روحه، وأمر الملائكة فسجدوا لك، وأسكنك الجنة، ألا تشفع لنا إلى ربك ألا ترى ما نحن فيه وما بلغنا فيقول ربي غضب غضبا لم يغضب قبله مثله، ولا يغضب بعده مثله، ونهاني عن الشجرة فعصيته، نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى نوح‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى أهل الأرض، وسماك الله عبدا شكورا، أما ترى إلى ما نحن فيه ألا ترى إلى ما بلغنا ألا تشفع لنا إلى ربك فيقول ربي غضب اليوم غضبا لم يغضب قبله مثله، ولا يغضب بعده مثله، نفسي نفسي، ائتوا النبي صلى الله عليه وسلم، فيأتوني، فأسجد تحت العرش فيقال يا محمد ارفع رأسك واشفع تشفع، وسل تعطه ‏\"‏‏.‏ قال محمد بن عبيد لا أحفظ سائره‏.‏",
      "text_en": " Narrated Abu Huraira:                     We were in the company of the Prophet at a banquet and a cooked (mutton) forearm was set before him, and he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the Day of Resurrection. Do you know how Allah will gather all the first and the last (people) in one level place where an observer will be able to see (all) of them and they will be able to hear the announcer, and the sun will come near to them. Some People will say: Don't you see, in what condition you are and the state to which you have reached? Why don't you look for a person who can intercede for you with your Lord? Some people will say: Appeal to your father, Adam.' They will go to him and say: 'O Adam! You are the father of all mankind, and Allah created you with His Own Hands, and ordered the angels to prostrate for you, and made you live in Paradise. Will you not intercede for us with your Lord? Don't you see in what (miserable) state we are, and to what condition we have reached?' On that Adam will reply, 'My Lord is so angry as He has never been before and will never be in the future; (besides), He forbade me (to eat from) the tree, but I disobeyed (Him), (I am worried about) myself! Myself! Go to somebody else; go to Noah.' They will go to Noah and say; 'O Noah! You are the first amongst the messengers of Allah to the people of the earth, and Allah named you a thankful slave. Don't you see in what a (miserable) state we are and to what condition we have reached? Will you not intercede for us with your Lord? Noah will reply: 'Today my Lord has become so angry as he had never been before and will never be in the future Myself! Myself! Go to the Prophet (Muhammad). The people will come to me, and I will prostrate myself underneath Allah's Throne. Then I will be addressed: 'O Muhammad! Raise your head; intercede, for your intercession will be accepted, and ask (for anything). for you will be given. \"",
      "usc_msa_ref": "556",
      "chain": [
        "30311",
        "30213",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3361",
      "hadith_no": "3361",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن نصر، حدثنا أبو أسامة، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم يوما بلحم فقال ‏\"‏ إن الله يجمع يوم القيامة الأولين والآخرين في صعيد واحد، فيسمعهم الداعي، وينفدهم البصر، وتدنو الشمس منهم  فذكر حديث الشفاعة  فيأتون إبراهيم فيقولون أنت نبي الله وخليله من الأرض، اشفع لنا إلى ربك‏.‏ فيقول  فذكر كذباته  نفسي نفسي اذهبوا إلى موسى ‏\"‏‏.‏ تابعه أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     One day some meat was given to the Prophet and he said, \"On the Day of Resurrection Allah will gather all the first and the last (people) in one plain, and the voice of the announcer will reach all of them, and one will be able to see them all, and the sun will come closer to them.\" (The narrator then mentioned the narration of intercession): \"The people will go to Abraham and say: 'You are Allah's Prophet and His Khalil on the earth. Will you intercede for us with your Lord?' Abraham will then remember his lies and say: 'Myself! Myself! Go to Moses.\"",
      "usc_msa_ref": "581",
      "chain": [
        "30123",
        "20318",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3533",
      "hadith_no": "3533",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تجدون الناس معادن، خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا، وتجدون خير الناس في هذا الشأن أشدهم له كراهية ‏\"‏‏.‏   ‏\"‏ وتجدون شر الناس ذا الوجهين، الذي يأتي هؤلاء بوجه، ويأتي هؤلاء بوجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"You see that the people are of different natures. Those who were the best in the pre-lslamic period, are also the best in Islam if they comprehend religious knowledge. You see that the best amongst the people in this respect (i.e. ambition of ruling) are those who hate it most. And you see that the worst among people is the double faced (person) who appears to these with one face and to the others with another face (i.e a hypocrite).",
      "usc_msa_ref": "699",
      "chain": [
        "30123",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3647",
      "hadith_no": "3647",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا أبو معمر، إسماعيل بن إبراهيم حدثنا أبو أسامة، حدثنا شعبة، عن أبي التياح، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يهلك الناس هذا الحى من قريش ‏\"‏‏.‏ قالوا فما تأمرنا قال ‏\"‏ لو أن الناس اعتزلوهم ‏\"‏‏.‏ قال محمود حدثنا أبو داود أخبرنا شعبة عن أبي التياح سمعت أبا زرعة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"This branch from Quraish will ruin the people.\" The companions of the Prophet asked, \"What do you order us to do (then)?\" He said, \"I would suggest that the people keep away from them.''",
      "usc_msa_ref": "801",
      "chain": [
        "30272",
        "20318",
        "20020",
        "11317",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3868",
      "hadith_no": "3868",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال أتى جبريل النبي صلى الله عليه وسلم فقال يا رسول الله هذه خديجة قد أتت معها إناء فيه إدام أو طعام أو شراب، فإذا هي أتتك فاقرأ عليها السلام من ربها ومني، وبشرها ببيت في الجنة من قصب، لا صخب فيه ولا نصب‏.‏",
      "text_en": "      Narrated Abu Huraira:                           Gabriel came to the Prophet and said, \"O Allah's Apostle! This is Khadija coming to you with a dish having meat soup (or some food or drink). When she reaches you, greet her on behalf of her Lord (i.e. Allah) and on my behalf, and give her the glad tidings of having a Qasab palace in Paradise wherein there will be neither any noise nor any fatigue (trouble) . \"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4409",
      "hadith_no": "4409",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال لا أزال أحب بني تميم بعد ثلاث سمعته من رسول الله صلى الله عليه وسلم يقولها فيهم ‏\"‏ هم أشد أمتي على الدجال ‏\"‏‏.‏ وكانت فيهم سبية عند عائشة فقال ‏\"‏ أعتقيها فإنها من ولد إسماعيل ‏\"‏‏.‏ وجاءت صدقاتهم فقال ‏\"‏ هذه صدقات قوم، أو قومي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I have not ceased to like Banu Tamim ever since I heard of three qualities attributed to them by Allah's Apostle (He said): They, out of all my followers, will be the strongest opponent of Ad-Dajjal; `Aisha had a slave-girl from them, and the Prophet told her to manumit her as she was from the descendants of (the Prophet) Ishmael; and, when their Zakat was brought, the Prophet said, \"This is the Zakat of my people.\"",
      "usc_msa_ref": "652",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4449",
      "hadith_no": "4449",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن جرير، أن النبي صلى الله عليه وسلم قال في حجة الوداع لجرير ‏\"‏ استنصت الناس ‏\"‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet ordered me during Hajjatul-Wada`. \"Ask the people to listen.\" He then said, \"Do not become infidels after me by cutting the necks (throats) of one another. \"",
      "usc_msa_ref": "687",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-4759",
      "hadith_no": "4759",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا أبو حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة  رضى الله عنه  قال أتي رسول الله صلى الله عليه وسلم بلحم، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة ثم قال ‏\"‏ أنا سيد الناس يوم القيامة، وهل تدرون مم ذلك يجمع الناس الأولين والآخرين في صعيد واحد، يسمعهم الداعي، وينفذهم البصر، وتدنو الشمس، فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون فيقول الناس ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض عليكم بآدم فيأتون آدم عليه السلام فيقولون له أنت أبو البشر خلقك الله بيده‏.‏ ونفخ فيك من روحه، وأمر الملائكة فسجدوا لك، اشفع لنا إلى ربك، ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله، وإنه نهاني عن الشجرة فعصيته، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى نوح، فيأتون نوحا فيقولون يا نوح إنك أنت أول الرسل إلى أهل الأرض، وقد سماك الله عبدا شكورا اشفع لنا إلى ربك، ألا ترى إلى ما نحن فيه فيقول إن ربي عز وجل قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله، وإنه قد كانت لي دعوة دعوتها على قومي نفسي نفسي نفسي اذهبوا إلى غيري، اذهبوا إلى إبراهيم، فيأتون إبراهيم، فيقولون يا إبراهيم، أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله، وإني قد كنت كذبت ثلاث كذبات  فذكرهن أبو حيان في الحديث  نفسي نفسي نفسي، اذهبوا إلى غيري اذهبوا إلى موسى، فيأتون موسى، فيقولون يا موسى أنت رسول الله، فضلك الله برسالته وبكلامه على الناس، اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني قد قتلت نفسا لم أومر بقتلها، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى عيسى، فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه، وكلمت الناس في المهد صبيا اشفع لنا ألا ترى إلى ما نحن فيه فيقول عيسى إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله  ولم يذكر ذنبا  نفسي نفسي نفسي، اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتون محمدا صلى الله عليه وسلم فيقولون يا محمد أنت رسول الله وخاتم الأنبياء، وقد غفر الله لك ما تقدم من ذنبك وما تأخر، اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فأنطلق فآتي تحت العرش، فأقع ساجدا لربي عز وجل ثم يفتح الله على من محامده وحسن الثناء عليه شيئا لم يفتحه على أحد قبلي ثم يقال يا محمد ارفع رأسك، سل تعطه، واشفع تشفع، فأرفع رأسي، فأقول أمتي يا رب، أمتي يا رب فيقال يا محمد أدخل من أمتك من لا حساب عليهم من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب، ثم قال والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وحمير، أو كما بين مكة وبصرى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some (cooked) meat was brought to Allah Apostle and the meat of a forearm was presented to him as he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the Day of Resurrection. Do you know the reason for it? Allah will gather all the human being of early generations as well as late generation on one plain so that the announcer will be able to make them all-hear his voice and the watcher will be able to see all of them. The sun will come so close to the people that they will suffer such distress and trouble as they will not be able to bear or stand. Then the people will say, 'Don't you see to what state you have reached? Won't you look for someone who can intercede for you with your Lord' Some people will say to some others, 'Go to Adam.' So they will go to Adam and say to him. 'You are the father of mankind; Allah created you with His Own Hand, and breathed into you of His Spirit (meaning the spirit which he created for you); and ordered the angels to prostrate before you; so (please) intercede for us with your Lord. Don't you see in what state we are? Don't you see what condition we have reached?' Adam will say, 'Today my Lord has become angry as He has never become before, nor will ever become thereafter. He forbade me (to eat of the fruit of) the tree, but I disobeyed Him . Myself! Myself! Myself! (I am preoccuied with my own problems). Go to someone else; go to Noah.' So they will go to Noah and say (to him), 'O Noah! You are the first (of Allah's Messengers) to the people of the earth, and Allah has named you a thankful slave; please intercede for us with your Lord. Don't you see in what state we are?' He will say.' Today my Lord has become angry as He has never become nor will ever become thereafter. I had (in the world) the right to make one definitely accepted invocation, and I made it against my nation. Myself! Myself! Myself! Go to someone else; go to Abraham.' They will go to Abraham and say, 'O Abraham! You are Allah's Apostle and His Khalil from among the people of the earth; so please intercede for us with your Lord. Don't you see in what state we are?' He will say to them, 'My Lord has today become angry as He has never become before, nor will ever become thereafter. I had told three lies (Abu Haiyan (the sub-narrator) mentioned them in the Hadith) Myself! Myself! Myself! Go to someone else; go to Moses.' The people will then go to Moses and say, 'O Moses! You art Allah's Apostle and Allah gave you superiority above the others with this message and with His direct Talk to you; (please) intercede for us with your Lord Don't you see in what state we are?' Moses will say, 'My Lord has today become angry as He has never become before, nor will become thereafter, I killed a person whom I had not been ordered to kill. Myself! Myself! Myself! Go to someone else; go to Jesus.' So they will go to Jesus and say, 'O Jesus! You are Allah's Apostle and His Word which He sent to Mary, and a superior soul created by Him, and you talked to the people while still young in the cradle. Please intercede for us with your Lord. Don't you see in what state we are?' Jesus will say. 'My Lord has today become angry as He has never become before nor will ever become thereafter. Jesus will not mention any sin, but will say, 'Myself! Myself! Myself! Go to someone else; go to Muhammad.' So they will come to me and say, 'O Muhammad ! You are Allah's Apostle and the last of the prophets, and Allah forgave your early and late sins. (Please) intercede for us with your Lord. Don't you see in what state we are?\" The Prophet added, \"Then I will go beneath Allah's Throne and fall in prostration before my Lord. And then Allah will guide me to such praises and glorification to Him as He has never guided anybody else before me. Then it will be said, 'O Muhammad Raise your head. Ask, and it will be granted. Intercede and It (your intercession) will be accepted.' So I will raise my head and Say, 'My followers, O my Lord! My followers, O my Lord'. It will be said, 'O Muhammad! Let those of your followers who have no accounts, enter through such a gate of the gates of Paradise as lies on the right; and they will share the other gates with the people.\" The Prophet further said, \"By Him in Whose Hand my soul is, the distance between every two gate-posts of Paradise is like the distance between Mecca and Busra (in Sham).",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4824",
      "hadith_no": "4824",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، عن جرير، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يوما بارزا للناس إذ أتاه رجل يمشي فقال يا رسول الله ما الإيمان قال ‏\"‏ الإيمان أن تؤمن بالله وملائكته ورسله ولقائه وتؤمن بالبعث الآخر ‏\"‏‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال يا رسول الله، ما الإحسان قال ‏\"‏ الإحسان أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك ‏\"‏‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل، ولكن سأحدثك عن أشراطها إذا ولدت المرأة ربتها، فذاك من أشراطها، وإذا كان الحفاة العراة رءوس الناس فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏{‏إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام‏}‏ ‏\"‏‏.‏ ثم انصرف الرجل فقال ‏\"‏ ردوا على ‏\"‏‏.‏ فأخذوا ليردوا فلم يروا شيئا‏.‏ فقال ‏\"‏ هذا جبريل جاء ليعلم الناس دينهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     One day while Allah's Apostle was sitting with the people, a man came to him walking and said, \"O Allah's Apostle. What is Belief?\" The Prophet said, \"Belief is to believe in Allah, His Angels, His Books, His Apostles, and the meeting with Him, and to believe in the Resurrection.\" The man asked, \"O Allah's Apostle What is Islam?\" The Prophet replied, \"Islam is to worship Allah and not worship anything besides Him, to offer prayers perfectly, to pay the (compulsory) charity i.e. Zakat and to fast the month of Ramadan.\" The man again asked, \"O Allah's Apostle What is Ihsan (i.e. perfection or Benevolence)?\" The Prophet said, \"Ihsan is to worship Allah as if you see Him, and if you do not achieve this state of devotion, then (take it for granted that) Allah sees you.\" The man further asked, \"O Allah's Apostle When will the Hour be established?\" The Prophet replied, \"The one who is asked about it does not know more than the questioner does, but I will describe to you its portents. When the lady slave gives birth to her mistress, that will be of its portents; when the bare-footed naked people become the chiefs of the people, that will be of its portents. The Hour is one of five things which nobody knows except Allah. Verily, the knowledge of the Hour is with Allah (alone). He sends down the rain, and knows that which is in the wombs.\" (31.34) Then the man left. The Prophet said, \"Call him back to me.\" They went to call him back but could not see him. The Prophet said, \"That was Gabriel who came to teach the people their religion.\" (See Hadith No. 47 Vol 1)",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20028",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5591",
      "hadith_no": "5591",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، عن عبد الواحد، حدثنا عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مكلوم يكلم في الله إلا جاء يوم القيامة وكلمه يدمى، اللون لون دم والريح ريح مسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"None is wounded in Allah's Cause but will come on the Day of Resurrection with his wound bleeding. The thing that will come out of his wound will be the color of blood, but its smell will be the smell of musk.\"",
      "usc_msa_ref": "441",
      "chain": [
        "30175",
        "20256",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6010",
      "hadith_no": "6010",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال أتي عمر بامرأة تشم فقام فقال أنشدكم بالله من سمع من النبي صلى الله عليه وسلم في الوشم فقال أبو هريرة فقمت فقلت يا أمير المؤمنين أنا سمعت‏.‏ قال ما سمعت قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تشمن ولا تستوشمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A woman who used to practise tattooing was brought to `Umar. `Umar got up and said, \"I beseech you by Allah, which of you heard the Prophet saying something about tattooing?\" l got up and said, \"0 chief of the Believers! l heard something.\" He said, \"What did you hear?\" I said, \"I heard the Prophet (addressing the ladies), saying, 'Do not practise tattooing and do not get yourselves tattooed.'\"",
      "usc_msa_ref": "830",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6037",
      "hadith_no": "6037",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عمارة بن القعقاع بن شبرمة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله من أحق بحسن صحابتي قال ‏\"‏ أمك ‏\"‏‏.‏ قال ثم من قال ‏\"‏ أمك ‏\"‏‏.‏ قال ثم من قال ‏\"‏ أمك ‏\"‏‏.‏ قال ثم من قال ‏\"‏ ثم أبوك ‏\"‏‏.‏ وقال ابن شبرمة ويحيى بن أيوب حدثنا أبو زرعة مثله‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! Who is more entitled to be treated with the best companionship by me?\" The Prophet said, \"Your mother.\" The man said. \"Who is next?\" The Prophet said, \"Your mother.\" The man further said, \"Who is next?\" The Prophet said, \"Your mother.\" The man asked for the fourth time, \"Who is next?\" The Prophet said, \"Your father. \"",
      "usc_msa_ref": "2",
      "chain": [
        "30367",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6481",
      "hadith_no": "6481",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا زهير بن حرب، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن، سبحان الله العظيم، سبحان الله وبحمده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There are two expressions which are very easy for the tongue to say, but they are very heavy in the balance and are very dear to The Beneficent (Allah), and they are, 'Subhan Allah Al- `Azim and 'Subhan Allah wa bihamdihi.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6537",
      "hadith_no": "6537",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا محمد بن فضيل، عن أبيه، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم ارزق آل محمد قوتا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"O Allah! Give food to the family of Muhammad.\"",
      "usc_msa_ref": "467",
      "chain": [
        "30351",
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6763",
      "hadith_no": "6763",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن سبحان الله وبحمده، سبحان الله العظيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(Following are) two words (sentences or utterances that are very easy for the tongue to say, and very heavy in the balance (of reward,) and the must beloved to the Gracious Almighty (And they are): Subhan Allah wa bi-hamdihi; Subhan Allahi-l-'Azim,\"",
      "usc_msa_ref": "673",
      "chain": [
        "30367",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6953",
      "hadith_no": "6953",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، عن جرير، قال قال النبي صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس، لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏ رواه أبو بكرة وابن عباس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Zur'a bin `Amr bin Jarir:                     The Prophet said during Hajjat-al-Wada`, \"Let the people be quiet and listen to me. After me, do not become disbelievers, by striking (cutting) the necks of one another.\"",
      "usc_msa_ref": "8",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-7167",
      "hadith_no": "7167",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن علي بن مدرك، سمعت أبا زرعة بن عمرو بن جرير، عن جده، جرير قال قال لي رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet said to me during Hajjat-al-Wada`, \"Let the people keep quiet and listen.\" Then he said (addressing the people), \"Beware! Do not renegade as disbelievers after me by striking (cutting) the necks of one another.\"",
      "usc_msa_ref": "201",
      "chain": [
        "20193",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-7589",
      "hadith_no": "7589",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا زهير بن حرب، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، فقال ‏\"‏ هذه خديجة أتتك بإناء فيه طعام أو إناء فيه شراب فأقرئها من ربها السلام وبشرها ببيت من قصب لا صخب فيه ولا نصب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said that Gabriel said, \"Here is Khadija coming to you with a dish of food or a tumbler containing something to drink. Convey to her a greeting from her Lord (Allah) and give her the glad tidings that she will have a palace in Paradise built of Qasab wherein there will be neither any noise nor any fatigue (trouble).\" (See Hadith No. 168, Vol. 5)",
      "usc_msa_ref": "588",
      "chain": [
        "30022",
        "20356",
        "11379",
        "11406"
      ]
    },
    {
      "id": "sahih-bukhari-7654",
      "hadith_no": "7654",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، سمع أبا هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ قال الله عز وجل ومن أظلم ممن ذهب يخلق كخلقي، فليخلقوا ذرة، أو ليخلقوا حبة أو شعيرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"Allah said, 'Who are most unjust than those who try to create something like My creation? I challenge them to create even a smallest ant, a wheat grain or a barley grain.' \"",
      "usc_msa_ref": "648",
      "chain": [
        "30216",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7658",
      "hadith_no": "7658",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني أحمد بن إشكاب، حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ كلمتان حبيبتان إلى الرحمن، خفيفتان على اللسان، ثقيلتان في الميزان سبحان الله وبحمده، سبحان الله العظيم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"(There are) two words which are dear to the Beneficent (Allah) and very light (easy) for the tongue (to say), but very heavy in weight in the balance. They are: ''Subhan Allah wa-bi hamdihi'' and ''Subhan Allah Al-`Azim.\" (See Hadith No. 673, Vol. 8).",
      "usc_msa_ref": "652",
      "chain": [
        "30290",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-106",
      "hadith_no": "106",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال زهير حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يوما بارزا للناس فأتاه رجل فقال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتابه ولقائه ورسله وتؤمن بالبعث الآخر ‏\"‏ ‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤدي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها إذا ولدت الأمة ربها فذاك من أشراطها وإذا كانت العراة الحفاة رءوس الناس فذاك من أشراطها وإذا تطاول رعاء البهم في البنيان فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ ثم تلا صلى الله عليه وسلم ‏{‏ إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ ‏\"‏ ‏.‏ قال ثم أدبر الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوا على الرجل ‏\"‏ ‏.‏ فأخذوا ليردوه فلم يروا شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل جاء ليعلم الناس دينهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      One day the Messenger of Allah (may peace be upon him) appeared before the public that a man came to him and said: Prophet of Allah, (tell me) what is Iman. Upon this he (the Holy Prophet) replied: That you affirm your faith in Allah, His angels, His Books, His meeting, His Messengers and that you affirm your faith in the Resurrection hereafter. He (again) said: Messenger of Allah, (tell me) what does al-Islam signify. He (the Holy Prophet) replied: Al-Islam signifies that you worship Allah and do not associate anything with Him and you establish obligatory prayer and you pay the obligatory poor-rate (Zakat) and you observe the fast of Ramadan. He (the inquirer) again said: Messenger of Allah, what does al-Ihsan imply? He (the Holy Prophet) replied: That you worship Allah as if you are seeing Him, and in case you fail to see Him, then observe prayer (with this idea in your mind) that (at least) He is seeing you. He (the inquirer ) again said: Messenger of Allah, when would there be the hour (of Doom)? He (the Holy Prophet) replied: The one who is asked about it is no better informed than the inquirer. I, however, narrate some of its signs (and these are): when the slave-girl will give birth to he master, when the naked, barefooted would become the chiefs of the people - these are some of the signs of (Doom). (Moreover) when the shepherds of the black (camels) would exult themselves in buildings, this is one of the signs of (Doom). (Doom) is one of the five (happenings wrapped in the unseen) which no one knows but Allah. Then he (the Messenger of Allah) recited (the verse):\" Verily Allah! with Him alone is the knowledge of the hour and He it is Who sends (down the rain) and knows that which is in the wombs and no person knows whatsoever he shall earn tomorrow, and a person knows not in whatsoever land he shall die. Verily Allah is Knowing, Aware. He (the narrator, Abu Huraira) said: Then the person turned back and went away. The Messenger of Allah (may peace be upon him) said: Bring that man back to me. They (the Companions of the Holy Prophet present there) went to bring him back, but they saw nothing there. Upon this the Messenger of Allah remarked: he was Gabriel, who came to teach the people their religion.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20321",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-108",
      "hadith_no": "108",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير، عن عمارة، - وهو ابن القعقاع - عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سلوني ‏\"‏ فهابوه أن يسألوه ‏.‏ فجاء رجل فجلس عند ركبتيه ‏.‏ فقال يا رسول الله ما الإسلام قال ‏\"‏ لا تشرك بالله شيئا وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتابه ولقائه ورسله وتؤمن بالبعث وتؤمن بالقدر كله ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تخشى الله كأنك تراه فإنك إن لا تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا رسول الله متى تقوم الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل وسأحدثك عن أشراطها إذا رأيت المرأة تلد ربها فذاك من أشراطها وإذا رأيت الحفاة العراة الصم البكم ملوك الأرض فذاك من أشراطها وإذا رأيت رعاء البهم يتطاولون في البنيان فذاك من أشراطها في خمس من الغيب لا يعلمهن إلا الله ‏\"‏ ‏.‏ ثم قرأ ‏{‏ إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ قال ثم قام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوه على ‏\"‏ فالتمس فلم يجدوه فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل أراد أن تعلموا إذ لم تسألوا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Ask me (about matters pertaining to religion), but they (the Companions of the Holy Prophet) were too much overawed out of profound respect for him to ask him (anything). In the meanwhile a man came there, and sat near his knees and said: Messenger of Allah, what al-lslam is? -to which he (the Holy Prophet) replied: You must not associate anything with Allah, and establish prayer, pay the poor-rate (Zakat) and observe (the fasts) of Ramadan. He said: You (have) told the truth. He (again) said: Messenger of Allah, what al-Iman (the faith) is? He (the Holy Prophet) said: That you affirm your faith in Allah, His angels, His Books, His meeting, His Apostles, and that you believe in Resurrection and that you believe in Qadr (Divine Decree) in all its entirety, He (the inquirer) said: You (have) told the truth. He (again) said: Messenger of Allah, what al-Ihsan is? Upon this he (the Holy Prophet) said: (Al-Ihsan implies) that you fear Allah as if you are seeing Him, and though you see Him not, verily He is seeing you. He (the inquirer) said: You (have) told the truth. He (the inquirer) said: When there would be the hour (of Doom)? (Upon this) he (the HolyProphet said: The one who is being asked about it is no better informed than the inquirer himself. I, however, narrate some of its signs (and these are): when you see a slave (woman) giving birth to her master - that is one of the signs of (Doom) ; when you see barefooted, naked, deaf and dumb (ignorant and foolish persons) as the rulers of the earth - that is one of the signs of the Doom. And when you see the shepherds of black camels exult in buildings - that is one of the signs of Doom. The (Doom) is one of the five things (wrapped) in the unseen. No one knows them except Allah. Then (the Holy Prophet) recited (the folowing verse):\" Verily Allah! with Him alone is the knowledge of the hour and He it is Who sends down the rain and knows that which is in the wombs and no person knows whatsoever he shall earn on morrow and a person knows not in whatsoever land he shall die. Verily Allah is Knowing, Aware. He (the narrator, Abu Huraira) said: Then the person stood up an (made his way). The Messenger of Allah (may peace be upon him) said: Bring him back to me. He was searched for, but they (the Companions of the Holy Prophet) could not find him. The Messenger of Allah (may peace be upon him) thereupon said: He was Gabriel and he wanted to teach you (things pertaining to religion) when you did not ask (them yourselves).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-116",
      "hadith_no": "116",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن إسحاق، حدثنا عفان، حدثنا وهيب، حدثنا يحيى بن سعيد، عن أبي زرعة، عن أبي هريرة، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله دلني على عمل إذا عملته دخلت الجنة ‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤدي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال والذي نفسي بيده لا أزيد على هذا شيئا أبدا ولا أنقص منه ‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that a bedouin came to the Messenger of Allah (may peace be upon him) and said:                      Messenger of Allah, direct me to a deed by which I may be entitled to enter Paradise. Upon this he (the Holy Prophet) remarked: You worship Allah and never associate anything with Him, establish the obligatory prayer, and pay the Zakat which is incumbent upon you, and observe the fast of Ramadan. He (the bedouin) said: By Him in Whose hand is my life, I will never add anything to it, nor will I diminish anything from it. When he (the bedouin) turned his back, the Prophet (may peace be upon him) said: He who is pleased to see a man from the dwellers of Paradise should catch a glimpse of him.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30106",
        "20299",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-306",
      "hadith_no": "306",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد بن جعفر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ قال فقرأها رسول الله صلى الله عليه وسلم ثلاث مرار ‏.‏ قال أبو ذر خابوا وخسروا من هم يا رسول الله قال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It is narrated o the authority of Abu Dharr that the Messenger of Allah (may ace he upon him) observed:                      Three are the (persons) with whom Allah would neither speak on the Day of Resurrection, nor would look at them nor would absolve the and there is a painful chastisement for them. The Messenger of Allah (may peace be upon him) repeated it three times. Abu Dharr remarked: They failed and they lost; who are these persons, Messenger of Allah? Upon this he (the Holy) Prophet) observed: They are: the dragger of lower garment, the recounter of obligation the seller of goods by false oath.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-414",
      "hadith_no": "414",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا حدثنا ابن فضيل، ح وحدثني زهير بن حرب، حدثنا جرير، كلاهما عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": " This hadith has been narrated by another chain of transmitters, Abu Bakr b. Abi Shaiba, Ibn Numair, Abu Kuraib, Ibn Fudail.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "30022",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-501",
      "hadith_no": "501",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واتفقا في سياق الحديث إلا ما يزيد أحدهما من الحرف بعد الحرف - قالا حدثنا محمد بن بشر حدثنا أبو حيان عن أبي زرعة عن أبي هريرة قال أتي رسول الله صلى الله عليه وسلم يوما بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها نهسة فقال ‏\"‏ أنا سيد الناس يوم القيامة وهل تدرون بم ذاك يجمع الله يوم القيامة الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس فيبلغ الناس من الغم والكرب ما لا يطيقون وما لا يحتملون فيقول بعض الناس لبعض ألا ترون ما أنتم فيه ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض ائتوا آدم ‏.‏ فيأتون آدم فيقولون يا آدم أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه نهاني عن الشجرة فعصيته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى الأرض وسماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كانت لي دعوة دعوت بها على قومي نفسي نفسي اذهبوا إلى إبراهيم صلى الله عليه وسلم ‏.‏ فيأتون إبراهيم فيقولون أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول لهم إبراهيم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولا يغضب بعده مثله ‏.‏ وذكر كذباته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقولون يا موسى أنت رسول الله فضلك الله برسالاته وبتكليمه على الناس اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم موسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قتلت نفسا لم أومر بقتلها نفسي نفسي اذهبوا إلى عيسى صلى الله عليه وسلم ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمت الناس في المهد وكلمة منه ألقاها إلى مريم وروح منه فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم عيسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله - ولم يذكر له ذنبا - نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتوني فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وغفر الله لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فأنطلق فآتي تحت العرش فأقع ساجدا لربي ثم يفتح الله على ويلهمني من محامده وحسن الثناء عليه شيئا لم يفتحه لأحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي أمتي ‏.‏ فيقال يا محمد أدخل الجنة من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة لكما بين مكة وهجر أو كما بين مكة وبصرى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Meat was one day brought to the Messenger of Allah (may peace be upon him) and a foreleg was offered to him, a part which he liked. He sliced with his teeth a piece out of it and said: I shall be the leader of mankind on the Day of Resurrection. Do you know why? Allah would gather in one plain the earlier and the later (of the human race) on the Day of Resurrection. Then the voice of the proclaimer would be heard by all of them and the eyesight would penetrate through all of them and the sun would come near. People would then experience a degree of anguish, anxiety and agony which they shall not be able to bear and they shall not be able to stand. Some people would say to the others: Don you see in which trouble you are? Don't you see what (misfortune) has overtaken you? Why don't you find one who should intercede for you with your Lord? Some would say to the others: Go to Adam. And they would go to Adam and say: O Adam, thou art the father of mankind. Allah created thee by His own Hand and breathed in thee of His spirit and ordered the angels to prostrate before thee. Intercede for us with thy Lord Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Adam would say: Verily, my Lord is angry, to an extent to which He had never been angry before nor would He be angry afterward. Verily, He forbade me (to go near) that tree and I disobeyed Him. I am concerned with my own self. Go to someone else; go to Noah. They would come to Noah and would say: O Noah, thou art the first of the Messengers (sent) on the earth (after Adam), and Allah named thee as a\" Grateful Servant,\" intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? He would say: Verily, my Lord is angry today as He had never been angry before, and would never be angry afterwards. There had emanated a curse from me with which I cursed my people. I am concerned with only myself, I am concerned only with myself; you better go to Ibrahim (peace be upon him). They would go to Ibrahim and say: Thou art the apostle of Allah and His Friend amongst the inhabitants of the earth; intercede for us with thy Lord. Don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? Ibrahim would say to them: Verily, my Lord is today angry as He had never been angry before and would never be angry afterwards. and (Ibrahim) would mention his lies (and then say): I am concerned only with myself, I am concerned only with myself. You better go to someone else: go to Moses. They would come to Moses (peace be upon him) and say: O Moses, thou art Allah's messenger, Allah blessed thee with His messengership and His conversation amongst people. Intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Moses (peace be upon him) would say to them: Verily. my Lord is angry as He had never been angry before and would never be angry afterwards. I, in fact, killed a person whom I had not been ordered to kill. I am concerned with myself, I am concerned with myself. You better go to Jesus (peace be upon him). They would come to Jesus and would say: O Jesus, thou art the messenger of Allah and thou conversed with people in the cradle, (thou art) His Word which I-Ie sent down upon Mary. and (thou art) the Spirit from Him; so intercede for us with thy Lord. Don't you see (the trouble) in which we are? Don't you see (the misfortune) that has overtaken us? Jesus (peace be upon him) would say: Verily, my Lord is angry today as He had never been angry before or would ever be angry afterwards. He mentioned no sin of his. (He simply said: ) I am concerned with myself, I am concerned with myself; you go to someone else: better go to Muhammad (may peace be upon him). They would come to me and say: O Mahammad, thou art the messenger of Allah and the last of the apostles. Allah has pardoned thee all thy previous and later sins. Intercede for us with thy Lord; don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? I shall then set off and come below the Throne and fall down prostrate before my Lord; then Allah would reveal to me and inspire me with some of His Praises and Glorifications which He had not revealed to anyone before me. He would then say: Muhammad, raise thy head; ask and it would be granted; intercede and intercession would be accepted I would then raise my head and say: O my Lord, my people, my people. It would be said: O Muhammad, bring in by the right gate of Paradise those of your people who would have no account to render. They would share with the people some other door besides this door. The Holy Prophet then said: By Him in Whose Hand is the life of Muhammad, verify the distance between two door leaves of the Paradise is as great as between Mecca and Hajar, or as between Mecca and Busra.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-502",
      "hadith_no": "502",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال وضعت بين يدى رسول الله صلى الله عليه وسلم قصعة من ثريد ولحم فتناول الذراع وكانت أحب الشاة إليه فنهس نهسة فقال ‏\"‏ أنا سيد الناس يوم القيامة ‏\"‏ ‏.‏ ثم نهس أخرى فقال ‏\"‏ أنا سيد الناس يوم القيامة ‏\"‏ ‏.‏ فلما رأى أصحابه لا يسألونه قال ‏\"‏ ألا تقولون كيفه ‏\"‏ ‏.‏ قالوا كيفه يا رسول الله قال ‏\"‏ يقوم الناس لرب العالمين ‏\"‏ ‏.‏ وساق الحديث بمعنى حديث أبي حيان عن أبي زرعة وزاد في قصة إبراهيم فقال وذكر قوله في الكوكب هذا ربي ‏.‏ وقوله لآلهتهم بل فعله كبيرهم هذا ‏.‏ وقوله إني سقيم ‏.‏ قال ‏\"‏ والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة إلى عضادتى الباب لكما بين مكة وهجر أو هجر ومكة ‏\"‏ ‏.‏ قال لا أدري أى ذلك قال ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that there was placed before the Messenger of Allah a cup of soft bread, soup and meat. He took part of the foreleg which he liked most. He sliced (with his teeth) a slice (out of that) and said:                      I would be the leader of mankind on the Day of Resurrection. He then sliced (that meat) for the second time and said: I am the leader of mankind on the Day of Resurrection. When he saw that his companions did not ask him (about this assertion) he said: Why don't you say: How would that be? They said: How would be it, Messenger of Allah? He said: People would stand before the Lord of the worlds. And the rest of the hadith was narrated like the one transmitted by Abu Hayyan, on the authority of Abu Zur'a, and in the story of Ibrahim, this addition was made. He said and made mention of his words with regard to the star: This is my Lord. And his words with regard to their gods: But the big among them has done that. And his words: I am ailing. He (the Holy Prophet) said: By Him in Whose Hand is the life of Muhammad, the distance between two leaves of the door from their supporting frames is as the distance between Mecca and Hajar or Hajar and Mecca. I do not remember how he said it (whether Mecca and Hajar or Hajar and Mecca).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-513",
      "hadith_no": "513",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عمارة، - وهو ابن القعقاع - عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة مستجابة يدعو بها فيستجاب له فيؤتاها وإني اختبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      The Messenger of Allah (may peace be upon him) said: Every Messenger is endowed with a prayer which is granted and by which he would (pray to his Lord) and it would he granted for him. I have, however, reserved my prayer for the intercession of my Ummab on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1382",
      "hadith_no": "1382",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا كبر في الصلاة سكت هنية قبل أن يقرأ فقلت يا رسول الله بأبي أنت وأمي أرأيت سكوتك بين التكبير والقراءة ما تقول قال ‏\"‏ أقول اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم نقني من خطاياى كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياى بالثلج والماء والبرد ‏\"‏ ‏.‏  حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا ابن فضيل، ح وحدثنا أبو كامل، حدثنا عبد الواحد، - يعني ابن زياد - كلاهما عن عمارة بن القعقاع، بهذا الإسناد نحو حديث جرير ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) used to observe, silence for a short while between the takbir (at the time of opening the prayer) and the recitation of the Qur'an. I said to him:                      Messenger of Allah, for whom I would give my father and mother in ransom, what do you recite during your period of silence between the takbir and the recitation? He said: I say (these words):\" O Allah, remove my sins from me as Thou hast removed the East from the West. O Allah purify me from sins as a white garment is purified from filth. O Allah! wash away my sins with water, snow and hail.\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2429",
      "hadith_no": "2429",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال أتى رسول الله صلى الله عليه وسلم رجل فقال يا رسول الله أى الصدقة أعظم فقال ‏\"‏ أن تصدق وأنت صحيح شحيح تخشى الفقر وتأمل الغنى ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا ولفلان كذا ألا وقد كان لفلان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that there came a person to the Messenger of Allah (may peace be upon him) and said:                      Messenger of Allah, which charity is the best? Upon this he said: That you should give charity (in a state when you are) healthy and close-fisted, one haunted by the fear of poverty, hoping to become rich (charity in such a state of health and mind is the best). And you must not defer (charity to such a length) that you are about to die and would he saying: This is for so and so, and this is for so and so. Lo, it has already come into (the possession of so and so).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2430",
      "hadith_no": "2430",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الصدقة أعظم أجرا فقال ‏\"‏ أما وأبيك لتنبأنه أن تصدق وأنت صحيح شحيح تخشى الفقر وتأمل البقاء ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا ولفلان كذا وقد كان لفلان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that a person came to the Apostle of Allah (may peace be upon him) and said:                      Messenger of Allah, which charity is the greatest in reward? (The Holy Prophet said): By your father, beware, you should give charity (in a state when you are) healthy and close-fisted, haunted by the fear of poverty, and still hoping to live (as rich). And you must not defer charity (to the time) when you are about to die, and would then say:\" This is for so and so, and this for so and so.\" It has already become the possession of so and so.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2446",
      "hadith_no": "2446",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن عمارة بن، القعقاع عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الناس أموالهم تكثرا فإنما يسأل جمرا فليستقل أو ليستكثر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who begs the riches of others to increase his own is asking only for live coals, so let him ask a little or much.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2474",
      "hadith_no": "2474",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وأبو سعيد الأشج قالوا حدثنا وكيع، حدثنا الأعمش، ح وحدثني زهير بن حرب، حدثنا محمد بن فضيل، عن أبيه، كلاهما عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      0 Allah, make the provision of Mahammad's family sufficient just to sustain life.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30263",
        "30200",
        "20032",
        "11060",
        "30022",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2622",
      "hadith_no": "2622",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني زهير بن حرب، وإسحاق، قال زهير حدثنا جرير، عن عمارة، عن أبي، زرعة عن أبي هريرة، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إياكم والوصال ‏\"‏ ‏.‏ قالوا فإنك تواصل يا رسول الله ‏.‏ قال ‏\"‏ إنكم لستم في ذلك مثلي إني أبيت يطعمني ربي ويسقيني فاكلفوا من الأعمال ما تطيقون ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Abstain from Saum-Wisal. They (his Companions) said: Messenger of Allah, but you observe Saum Wisal. Upon this he said: You are not like me in this matter, for I spend my night (in a state) that my Lord feeds me and provides me drink Devote yourselves to the deeds (the burden of which) you can bear.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30312",
        "20321",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3208",
      "hadith_no": "3208",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير وأبو كريب جميعا عن ابن فضيل، - قال زهير حدثنا محمد بن فضيل، - حدثنا عمارة، عن أبي زرعة، عن أبي، هريرة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اغفر للمحلقين ‏\"‏ ‏.‏ قالوا يا رسول الله وللمقصرين قال ‏\"‏ اللهم اغفر للمحلقين ‏\"‏ ‏.‏ قالوا يا رسول الله وللمقصرين قال ‏\"‏ اللهم اغفر للمحلقين ‏\"‏ ‏.‏ قالوا يا رسول الله وللمقصرين قال ‏\"‏ وللمقصرين ‏\"‏‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as having said:                      O Allah, grant pardon to those who got their heads shaved They (Companions of the Holy Prophet) said: Messenger of Allah, (what about those) who get their hair cut? He said: O Allah, grant pardon to those who get their heads shaved. They said: Messenger of Allah, (what about those) who got their hair clipped? He said: O Allah, grant pardon to those who get their heads shaved. They said: Messenger of Allah, (what about those) who get their hair clipped? He said: O Allah, grant pardon to those who get their heads shaved. They said: (What about those) who get their hair clipped? He said: (O Allah, grant pardon to) those who get their hair clipped.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20356",
        "20321",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4150",
      "hadith_no": "4150",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء وواصل بن عبد الأعلى قالا حدثنا ابن فضيل، عن أبيه، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التمر بالتمر والحنطة بالحنطة والشعير بالشعير والملح بالملح مثلا بمثل يدا بيد فمن زاد أو استزاد فقد أربى إلا ما اختلفت ألوانه ‏\"‏ ‏.‏",
      "text_en": "  Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Dates are to be paid for by dates, wheat by wheat, barley by barley, salt by salt, like for like, payment being made on the spot. He who made an addition or demanded an addition, in fact, dealt in usury except in case where their classes differ.",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "20349",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4839",
      "hadith_no": "4839",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي، زرعة عن أبي هريرة، قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم فذكر الغلول فعظمه وعظم أمره ثم قال ‏\"‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته بعير له رغاء يقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته فرس له حمحمة فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته شاة لها ثغاء يقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته نفس لها صياح فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته رقاع تخفق فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته صامت فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      One day the Messenger of Allah (may peace be upon him) stood among us (to deliver a sermon). He talked about the misappropriation of booty, and declared it to be a serious matter and a grave sin. Then he said: I shouldn't find that any of you should come on the Day of Judgment with a growling camel mounted on his neck, and should appeal to me for help saying:\" Messenger of Allah, help me.\" and I should say: I have no authority to help you; I already communicated to you. I shouldn't find that any of you should come on the Day of Judgment with a bleating ewe mounted on his neck, and he should say to me:\" Messenger of Allah, help me,\" and I should say: I have no authority to help you; I conveyed to you. I shouldn't find that one of you should come on the Day of Judgment with a Person crying loudly mounted on his neck, and he should say to me:\" Messenger of Allah, help me,\" and I should say: I have no authority to help you; I conveyed to you. I shouldn't find that any one of you should come on the Day of Judgment with fluttering clothes wrapped round his neck and he should say to me:\" Messenger of Allah, help me,\" and I should say: I have no authority to help you; I conveyed to you. I shouldn't find that any of you should come on the Day of Judgment with a heap of gold and silver placed on his neck and he should say to me:\" Messenger of Allah, help me.\" and I should say: I have no authority to help you; I already conveyed to you (the warning from the Almighty).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4840",
      "hadith_no": "4840",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن أبي حيان، ح وحدثني زهير بن حرب، حدثنا جرير، عن أبي حيان، وعمارة بن القعقاع، جميعا عن أبي زرعة، عن أبي هريرة، بمثل حديث إسماعيل عن أبي حيان، ‏.‏",
      "text_en": " The above tradition has been narrated on the same authority through different chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11404",
        "30022",
        "4057",
        "11404",
        "11379",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-4841",
      "hadith_no": "4841",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا سليمان بن حرب، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن يحيى بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال ذكر رسول الله صلى الله عليه وسلم الغلول فعظمه ‏.‏ واقتص الحديث قال حماد ثم سمعت يحيى بعد ذلك يحدثه فحدثنا بنحو ما حدثنا عنه أيوب ‏.‏",
      "text_en": " Abu Huraira has narrated this hadith with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20193",
        "20022",
        "11015",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4842",
      "hadith_no": "4842",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن الحسن بن خراش، حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديثهم ‏.‏",
      "text_en": " Abu Huraira has narrated this hadith similar to the above mentioned hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "30315",
        "20258",
        "11015",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4955",
      "hadith_no": "4955",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وصالح بن حاتم بن وردان، جميعا عن يزيد، - قال الجهضمي حدثنا يزيد بن زريع، - حدثنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم يلوي ناصية فرس بإصبعه وهو يقول ‏\"‏ الخيل معقود بنواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jarir b. Abdullah who said:                      I saw that the Messenger of Allah (may peace be upon him) was twisting the forelock of a horse with his fingers and he was saying: (A great) benefit. i. e. reward (for rearing them for Jihad) and spoils of war, has been tied to the forelocks of horses until the Day of Judgment.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20304",
        "20304",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-4964",
      "hadith_no": "4964",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وزهير بن حرب وأبو كريب قال يحيى أخبرنا وقال الآخرون، حدثنا وكيع، عن سفيان، عن سلم بن عبد الرحمن، عن  أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏",
      "text_en": " It has been narrated on the authority of Abn Huraira that the Messenger of Allah (may peace be upon him) used to dislike the Shikal horse.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20031",
        "20032",
        "20012",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4966",
      "hadith_no": "4966",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد يعني ابن جعفر، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، جميعا عن شعبة، عن عبد الله بن يزيد النخعي، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث وكيع ‏.‏ وفي رواية وهب عن عبد الله بن يزيد ‏.‏ ولم يذكر النخعي ‏.‏",
      "text_en": " The tradition has been handed down through a different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "30170",
        "20298",
        "20020",
        "10788",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4967",
      "hadith_no": "4967",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، عن عمارة، - وهو ابن القعقاع - عن  أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تضمن الله لمن خرج في سبيله لا يخرجه إلا جهادا في سبيلي وإيمانا بي وتصديقا برسلي فهو على ضامن أن أدخله الجنة أو أرجعه إلى مسكنه الذي خرج منه نائلا ما نال من أجر أو غنيمة ‏.‏ والذي نفس محمد بيده ما من كلم يكلم في سبيل الله إلا جاء يوم القيامة كهيئته حين كلم لونه لون دم وريحه مسك والذي نفس محمد بيده لولا أن يشق على المسلمين ما قعدت خلاف سرية تغزو في سبيل الله أبدا ولكن لا أجد سعة فأحملهم ولا يجدون سعة ويشق عليهم أن يتخلفوا عني والذي نفس محمد بيده لوددت أني أغزو في سبيل الله فأقتل ثم أغزو فأقتل ثم أغزو فأقتل ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace upon him) said:                      Allah has undertaken to look after the affairs of one who goes out to fight in His way believing in Him and affirming the truth of His Apostles. He is committed to His care that Re will either admit him to Paradise or bring him back to his home from where he set out with a reward or (his share of) booty. By the Being in Whose Hand is the life of Muhammad. If a person gets wounded in the way of Allah, he will come on the Day of Judgment with his wound in the same condition as it was when it was first inflicted; its colour being the colour of blood but its smell will be the smell of musk. By, the Being in Whose Hand is Muhammad's life, if it were not to be too hard upon the Muslime. I would not lag behind any expedition which is going to fight in the cause of Allah. But I do not have abundant means to provide them (the Mujahids) with riding beasts, nor have they (i. e. all of them) abundant means (to provide themselves with all the means of Jihad) so that they could he left behind. By the Being in Whose Hand is Mubammgls lac, I love to fight in the way of Allah and be killed, to fight and again be killed and to fight again and be killed.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5665",
      "hadith_no": "5665",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو كريب وألفاظهم متقاربة قالوا حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، قال دخلت مع أبي هريرة في دار مروان فرأى فيها تصاوير فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله عز وجل ومن أظلم ممن ذهب يخلق خلقا كخلقي فليخلقوا ذرة أو ليخلقوا حبة أو ليخلقوا شعيرة ‏\"‏ ‏.‏  وحدثنيه زهير بن حرب، حدثنا جرير، عن عمارة، عن أبي زرعة، قال دخلت أنا وأبو هريرة دارا تبنى بالمدينة لسعيد أو لمروان ‏.‏ قال فرأى مصورا يصور في الدار فقال قال رسول الله صلى الله عليه وسلم بمثله ولم يذكر ‏\"‏ أو ليخلقوا شعيرة ‏\"‏ ‏.‏",
      "text_en": " Abu Zur'a reported:                      I visited the house of Marwan in the company of Abu Huraira and he found pictures there. whereupon he said: I heard Allah's Messenger (may peace be upon him) as saying: Allah, the Glorious and Exalted, said: Who is a more wrongdoer than one who tries to create creation like Mine creation. Let him create an atom or a grain of wheat or that of barley. This hadith has been transmitted on the authority of Abu Zur'a and he said: Abu Huraira went to the house of Sa'ld or Marwan which they had built in Medina and he (Abu Huraira) saw a painter who had been painting pictures in his house, whereupon he told that Allah's Messenger (may peace be upon him) had said like this, but he made no mention of the words:\" Let him create the grain of barley.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20356",
        "11379",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-5770",
      "hadith_no": "5770",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني قتيبة بن سعيد، حدثنا يزيد بن زريع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، كلاهما عن يونس، ح وحدثني زهير بن حرب، حدثنا هشيم، أخبرنا يونس، عن عمرو بن سعيد، عن أبي زرعة، عن جرير بن عبد الله، قال سألت رسول الله صلى الله عليه وسلم عن نظر الفجاءة فأمرني أن أصرف بصري ‏.‏",
      "text_en": " Jarir b. 'Abdullah reported:                      I asked Allah's Messenger (may peace be upon him) about the sudden glance (that is cast) on the face (of a non-Mahram). He commanded me that I should turn away my eyes.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20304",
        "30201",
        "20208",
        "20475",
        "30022",
        "20468",
        "20475",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-6426",
      "hadith_no": "6426",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وابن نمير قالوا حدثنا ابن فضيل، عن  عمارة، عن أبي زرعة، قال سمعت أبا هريرة، قال أتى جبريل النبي صلى الله عليه وسلم فقال يا رسول الله هذه خديجة قد أتتك معها إناء فيه إدام أو طعام أو شراب فإذا هي أتتك فاقرأ عليها السلام من ربها عز وجل ومني وبشرها ببيت في الجنة من قصب لا صخب فيه ولا نصب ‏.‏ قال أبو بكر في روايته عن أبي هريرة ولم يقل سمعت ‏.‏ ولم يقل في الحديث ومني ‏.‏",
      "text_en": " Abu Huraira reported that Gabriel came to Allah's Apostle (may peace be upon him) and said:                      Allah's Messenger, lo. Khadija is coming to you with a vessel of seasoned food or drink. When she comes to you, offer her greetings from her Lord, the Exalted and Glorious, and on my behalf and give her glad tidings of a palace of jewels in Paradise wherein there is no noise and no toil. This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6478",
      "hadith_no": "6478",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد بن يعيش، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة، عن  أبي حيان، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا أبو حيان التيمي يحيى بن سعيد عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لبلال عند صلاة الغداة ‏\"‏ يا بلال حدثني بأرجى عمل عملته عندك في الإسلام منفعة فإني سمعت الليلة خشف نعليك بين يدى في الجنة ‏\"‏ ‏.‏ قال بلال ما عملت عملا في الإسلام أرجى عندي منفعة من أني لا أتطهر طهورا تاما في ساعة من ليل ولا نهار إلا صليت بذلك الطهور ما كتب الله لي أن أصلي ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said to Bilal:                      Bilal, narrate to me which act at the time of morning prayer you did in Islam for which you hope to receive good reward, for I heard during the night the sound of your steps before me in Paradise. Bilal said: I did not do any act in Islam for which I hope to get any benefit but this that when I perform complete ablution during the night or day I observe prayer with that purification what Allah has ordained for me to pray.",
      "usc_msa_ref": "",
      "chain": [
        "30469",
        "30216",
        "20318",
        "11404",
        "15184",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6612",
      "hadith_no": "6612",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن مغيرة، عن الحارث، عن أبي زرعة، قال قال أبو هريرة لا أزال أحب بني تميم من ثلاث سمعتهن من، رسول الله صلى الله عليه وسلم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هم أشد أمتي على الدجال ‏\"‏ ‏.‏ قال وجاءت صدقاتهم فقال النبي صلى الله عليه وسلم ‏\"‏ هذه صدقات قومنا ‏\"‏ ‏.‏ قال وكانت سبية منهم عند عائشة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعتقيها فإنها من ولد إسماعيل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Since I heard three things from Allah's Messenger (may peace be upon him) my love for Banu Tamim is never on the decline (and these things are): I heard Allah's Messenger (may peace be upon him) as saying about them that they would put up stout resistance against Dajjal amongst my Umma. And he (the narrator) said: (When) the consignment of Zakat was brought to him, Allah's Messenger (may peace be upon him) said: This is the charity of our people, and there was one slave-girl in the house of 'A'isha and she was from the tribe of Banu Tamim; thereupon Allah's Messenger (may peace be upon him) said: Set her free, for she is from the offspring of Isma'il. The other hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11072",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-6613",
      "hadith_no": "6613",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال لا أزال أحب بني تميم بعد ثلاث سمعتهن من، رسول الله صلى الله عليه وسلم يقولها فيهم ‏.‏ فذكر مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6616",
      "hadith_no": "6616",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، ح",
      "text_en": " This hadith has been transmitted on the authority of Abu Zur'a with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-6664",
      "hadith_no": "6664",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد بن جميل بن طريف الثقفي، وزهير بن حرب، قالا حدثنا  جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال من أحق الناس بحسن صحابتي قال ‏\"‏ أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أبوك ‏\"‏ ‏.‏ وفي حديث قتيبة من أحق بحسن صحابتي ولم يذكر الناس ‏.‏",
      "text_en": " Abu Huraira reported that a person came to Allah, 's Messenger (may peace be upon him) and said:                      Who among the people is most deserving of a fine treatment from my hand? He said: Your mother. He again said: Then who (is the next one)? He said: Again it is your mother (who deserves the best treatment from you). He said: Then who (is the next one)? He (the Holy Prophet) said: Again, it is your mother. He (again) said: Then who? Thereupon he said: Then it is your father. In the hadith transmitted on the authority of Qutalba, there is no mention of the word\" the people\".",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6665",
      "hadith_no": "6665",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء الهمداني حدثنا ابن فضيل، عن أبيه، عن عمارة، بن القعقاع عن أبي زرعة، عن أبي هريرة، قال قال رجل يا رسول الله من أحق بحسن الصحبة قال ‏\"‏ أمك ثم أمك ثم أمك ثم أبوك ثم أدناك أدناك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that a person said:                      Allah's Messenger, who amongst the people is most deserving of my good treatment? He said: Your mother, again your mother, again your mother, then your father, then your nearest relatives according to the order (of nearness).",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6666",
      "hadith_no": "6666",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عمارة، وابن، شبرمة عن أبي، زرعة عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث جرير وزاد فقال ‏\"‏ نعم وأبيك لتنبأن ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person came to Allah's Apostle (may peace be upon him). The rest of the hadith is the same as transmitted by jarir but with this addition: By your father, you would get the information.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6798",
      "hadith_no": "6798",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تجدون من شر الناس ذا الوجهين الذي يأتي هؤلاء بوجه وهؤلاء بوجه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      You will find the worst amongst the people one having double face. He comes to some people with one face and to the others with the other face.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6871",
      "hadith_no": "6871",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو سعيد الأشج - واللفظ لأبي بكر - قالوا حدثنا حفص، - يعنون ابن غياث ح وحدثنا عمر بن حفص، بن غياث حدثنا أبي، عن جده، طلق بن معاوية عن أبي زرعة بن عمرو بن جرير، عن  أبي هريرة، قال أتت امرأة النبي صلى الله عليه وسلم بصبي لها فقالت يا نبي الله ادع الله له فلقد دفنت ثلاثة قال ‏\"‏ دفنت ثلاثة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ لقد احتظرت بحظار شديد من النار ‏\"‏ ‏.‏ قال عمر من بينهم عن جده ‏.‏ وقال الباقون عن طلق ‏.‏ ولم يذكروا الجد ‏.‏",
      "text_en": " Abu Huraira reported that a woman came to Allah's Apostle (may peace be upon him) with her child and said:                      Allah's Apostle, invoke Allah's blessing upon him for I have already buried three. He said: You have buried three! She said: Yes. Thereupon he (the Holy Prophet) said: You have, indeed, safeguarded yourself against the torment of Hell with a strong safeguard. 'Umar has made a mention of his father, whereas others have not made a mention of his father.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "30200",
        "30204",
        "20317",
        "10777",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6872",
      "hadith_no": "6872",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وزهير بن حرب، قالا حدثنا جرير، عن طلق بن معاوية، النخعي أبي غياث عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال جاءت امرأة إلى النبي صلى الله عليه وسلم بابن لها فقالت يا رسول الله إنه يشتكي وإني أخاف عليه قد دفنت ثلاثة ‏.‏ قال ‏\"‏ لقد احتظرت بحظار شديد من النار ‏\"‏ ‏.‏ قال زهير عن طلق ‏.‏ ولم يذكر الكنية ‏.‏",
      "text_en": " Abu Huraira reported that a woman came to Allah's Apostle (may peace be upon him) with her child and said:                      Allah's Messenger, he is ailing, and I am afraid (that he may die), as I have already buried three. Thereupon he said: It (their sad demise) would be a protection against Hell-Fire for you. Zuhair has not mentioned the kunya of Abu Ghiyath; he has mentioned his name.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30022",
        "20028",
        "10777",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7021",
      "hadith_no": "7021",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وزهير بن حرب، وأبو كريب ومحمد بن طريف البجلي قالوا حدثنا ابن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Two are the expressions which are light on the tongue, but heavy in scale, dear to the Compassionate One:\" Hallowed be Allah and praise is due to Him\" ;\" Hallowed be Allah, the Great.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "30022",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7328",
      "hadith_no": "7328",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا قتيبة بن سعيد، وزهير بن حرب، - واللفظ لقتيبة - قالا حدثنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول زمرة يدخلون الجنة على صورة القمر ليلة البدر والذين يلونهم على أشد كوكب دري في السماء إضاءة لا يبولون ولا يتغوطون ولا يمتخطون ولا يتفلون أمشاطهم الذهب ورشحهم المسك ومجامرهم الألوة وأزواجهم الحور العين أخلاقهم على خلق رجل واحد على صورة أبيهم آدم ستون ذراعا في السماء ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7570",
      "hadith_no": "7570",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن أبي حيان، عن أبي زرعة، عن عبد الله بن عمرو، قال حفظت من رسول الله صلى الله عليه وسلم حديثا لم أنسه بعد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى وأيهما ما كانت قبل صاحبتها فالأخرى على إثرها قريبا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Amr reported:                      I committed to memory a hadith from Allah's Messenger (may peace be upon him) and I did not forget it after I had heard Allah's Messenger (may peace be upon him) as saying: The first sign (nut of the signs of the appearance of the Dajjal) would be the appearance of the sun from the west, the appearance of the beast before the people in the forenoon and whkch of the two hap- pens first, the second one would follow immediately after that.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11404",
        "11406",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-7571",
      "hadith_no": "7571",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا أبو حيان، عن أبي زرعة، قال جلس إلى مروان بن الحكم بالمدينة ثلاثة نفر من المسلمين فسمعوه وهو، يحدث عن الآيات، أن أولها، خروجا الدجال فقال عبد الله بن عمرو لم يقل مروان شيئا قد حفظت من رسول الله صلى الله عليه وسلم حديثا لم أنسه بعد سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " Abu Zur'a reported that three persons amongst Muslims had been sitting in Medina in the presence of Marwan b. Hakam and they heard him narrate these signs from him and the first amongst them was the appearance of the Dajjal. 'Abdullah b. 'Amr reported that Marwin said nothing (particular in this connection). I, however, heard a hadith from Allah's Messenger (may peace be upon him) and I did not forget that after I had heard that from Allah's Apostle (may peace be upon him) and he reported a hadith like the foregoing.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11404",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-7572",
      "hadith_no": "7572",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا سفيان، عن أبي حيان، عن أبي زرعة، قال تذاكروا الساعة عند مروان فقال عبد الله بن عمرو سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثل حديثهما ولم يذكر ضحى ‏.‏",
      "text_en": " Abu Zur'a reported that there was a discussion in the presence of Marwan about the Last Hour, and Abdullah b. 'Amr said:                      I heard Allah's Messenger (may peace be upon him) as saying. The rest of the hadith is the same, but there is no mention of forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11404",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-7630",
      "hadith_no": "7630",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني زهير بن حرب، حدثنا محمد بن فضيل، عن أبيه، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      O Allah, make for the family of Muhammad the provision which is a bare subsistence.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7631",
      "hadith_no": "7631",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، وأبو كريب قالوا حدثنا وكيع، حدثنا الأعمش، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏ وفي رواية عمرو ‏\"‏ اللهم ارزق ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      0 Allah, provide for the, family of Muhammad their subsistence, and in the narration transmitted on the authority of 'Amr (the words are):\" O Allah, provide us subsistence\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30263",
        "30022",
        "30216",
        "20032",
        "11060",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-154",
      "hadith_no": "154",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن الحسين الدرهمي، حدثنا ابن داود، عن بكير بن عامر، عن أبي زرعة بن عمرو بن جرير، أن جريرا، بال ثم توضأ فمسح على الخفين وقال ما يمنعني أن أمسح وقد رأيت رسول الله صلى الله عليه وسلم يمسح قالوا إنما كان ذلك قبل نزول المائدة ‏.‏ قال ما أسلمت إلا بعد نزول المائدة ‏.‏",
      "text_en": " Abu Zur’ah b. ‘Amr b. Jarir said :                      Jarir urinated. He then performed ablution and wiped over the socks. He said: What can prevent me from wiping (over the socks); I saw the Messenger of Allah (doing so). They (the people) said: This (action of yours) might be valid before the revelation of Surat al-Ma’idah. He replied: I embraced Islam after the revelation of Surat al-Ma’idah.",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "11406"
      ]
    },
    {
      "id": "sunan-abi-daud-227",
      "hadith_no": "227",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: Angels do not enter the house where there is a picture, or a dog, or a person who is sexually defiled.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-781",
      "hadith_no": "781",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن أبي شعيب، حدثنا محمد بن فضيل، عن عمارة، ح وحدثنا أبو كامل، حدثنا عبد الواحد، عن عمارة، - المعنى - عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا كبر في الصلاة سكت بين التكبير والقراءة فقلت له بأبي أنت وأمي أرأيت سكوتك بين التكبير والقراءة أخبرني ما تقول ‏.‏ قال ‏\"‏ اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم أنقني من خطاياى كالثوب الأبيض من الدنس اللهم اغسلني بالثلج والماء والبرد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) kept silence between the takbir and the recitation of Qur’an. So I asked him, for whom I would give my father and mother as ransom: What do you say during you period of silence between the takbir and the recitation? He replied (that he said): O Allah, purify me from sins as a white garment is purified from filth. O Allah, wash away my sings with snow, water and hail.",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20356",
        "11379",
        "30559",
        "20256",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2148",
      "hadith_no": "2148",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثني يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة، عن جرير، قال سألت رسول الله صلى الله عليه وسلم عن نظرة الفجأة فقال ‏\"‏ اصرف بصرك ‏\"‏ ‏.‏",
      "text_en": " Jarir said I asked the Apostle of Allaah(ﷺ) about an accidental glance (on a woman). He (ﷺ) said “Turn your eyes away.”",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sunan-abi-daud-2547",
      "hadith_no": "2547",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سلم، - هو ابن عبد الرحمن - عن أبي زرعة، عن أبي هريرة، قال ‏:‏ كان النبي صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏ والشكال ‏:‏ يكون الفرس في رجله اليمنى بياض وفي يده اليسرى بياض، أو في يده اليمنى وفي رجله اليسرى ‏.‏ قال أبو داود ‏:‏ أى مخالف ‏.‏",
      "text_en": " Abu Hurairah said “The Prophet (ﷺ) disapproved the shikal horses. Shikal are the horses that are white on their right hind leg and white on their left foreleg or white on their right foreleg and left hind leg.Abu Dawud said “This means alternate legs”.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2865",
      "hadith_no": "2865",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، حدثنا عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال قال رجل للنبي صلى الله عليه وسلم يا رسول الله أى الصدقة أفضل قال ‏\"‏ أن تصدق وأنت صحيح حريص تأمل البقاء وتخشى الفقر ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا ولفلان كذا وقد كان لفلان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A man asked the Messenger of Allah (ﷺ): Messenger of Allah, which sadaqah (charity) is the best ? He replied: (The best sadaqah is) that you give something as sadaqah (charity) when you are healthy, greedy, expect survival and fear poverty, and not that you postpone it until your death. and then you say: For so-and-so is such-and-such, and for so-and-so is such-and-such, while it was already for so-and-so.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20256",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3527",
      "hadith_no": "3527",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا زهير بن حرب، وعثمان بن أبي شيبة، قالا حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، أن عمر بن الخطاب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من عباد الله لأناسا ما هم بأنبياء ولا شهداء يغبطهم الأنبياء والشهداء يوم القيامة بمكانهم من الله تعالى ‏\"‏ ‏.‏ قالوا يا رسول الله تخبرنا من هم ‏.‏ قال ‏\"‏ هم قوم تحابوا بروح الله على غير أرحام بينهم ولا أموال يتعاطونها فوالله إن وجوههم لنور وإنهم على نور لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس ‏\"‏ ‏.‏ وقرأ هذه الآية ‏{‏ ألا إن أولياء الله لا خوف عليهم ولا هم يحزنون ‏}‏ ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     reported the Prophet (ﷺ) as saying: There are people from the servants of Allah who are neither prophets nor martyrs; the prophets and martyrs will envy them on the Day of Resurrection for their rank from Allah, the Most High.  They (the people) asked: Tell us, Messenger of Allah, who are they?  He replied: They are people who love one another for the spirit of Allah (i.e. the Qur'an), without having any mutual kinship and giving property to one. I swear by Allah, their faces will glow and they will be (sitting) in (pulpits of) light. They will have no fear (on the Day) when the people will have fear, and they will not grieve when the people will grieve.  He then recited the following Qur'anic verse: \"Behold! Verily for the friends of Allah there is no fear, nor shall they grieve.\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30203",
        "20028",
        "11379",
        "11406",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-4087",
      "hadith_no": "4087",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ثلاثة لا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ قلت من هم يا رسول الله قد خابوا وخسروا أعادها ثلاثا ‏.‏ قلت من هم يا رسول الله خابوا وخسروا فقال ‏\"‏ المسبل والمنان والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏ أو ‏\"‏ الفاجر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet (ﷺ) as saying: There are three to whom Allah will not speak and at whom He will not look on the Day of Resurrection, and whom He will not declare pure, and they will have a painful punishment. I asked: Who are they, Messenger of Allah, they are losers and disappointed ? He repeated it three times. I asked: Who are they. Messenger of Allah, they are losers and disappointed ? He replied: The one who wears a trailing robe, the one who takes account of what he gives, and the one who produces a ready sale of a commodity by false swearing.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-4152",
      "hadith_no": "4152",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن عبد الله بن نجى، عن أبيه، عن علي، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: The angels do not enter a house which contains a picture, a dog, or a man who is impure by sexual defilement.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-4310",
      "hadith_no": "4310",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أبي حيان التيمي، عن أبي زرعة، قال جاء نفر إلى مروان بالمدينة فسمعوه يحدث في الآيات أن أولها الدجال قال فانصرفت إلى عبد الله بن عمرو فحدثته فقال عبد الله لم يقل شيئا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الآيات خروجا طلوع الشمس من مغربها أو الدابة على الناس ضحى فأيتهما كانت قبل صاحبتها فالأخرى على أثرها ‏\"‏ ‏.‏ قال عبد الله وكان يقرأ الكتب وأظن أولهما خروجا طلوع الشمس من مغربها ‏.‏",
      "text_en": " Abu zur’ah said:                      A group of people came to Marwan in Medina, and they heard him say that the first of the signs to appear would be the coming forth of the Dajjal (Antichirst). He said: I then went to Abd Allah b. ‘Amr and mentioned it to him. He did not say anything(reliable). I heard the Messenger of Allah (ﷺ) say: The first of the signs to appear will be the rising of the sun in its place of setting and the coming forth of the beast against mankind in the forenoon. Whichever of them comes first will soon be followed by the other. ’Abd Allah who used to read the scriptures (Torah, Gospel) said: I think the first of them will be the rising of the sun in its place of setting.",
      "usc_msa_ref": "",
      "chain": [
        "30180",
        "20208",
        "11404",
        "11406"
      ]
    },
    {
      "id": "sunan-abi-daud-4312",
      "hadith_no": "4312",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا محمد بن الفضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت ورآها الناس آمن من عليها فذاك حين ‏{‏ لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏}‏ ‏\"‏ ‏.‏ الآية ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The last hour will not come before rising of the sun in its place of setting. When it rises (there) and the people see it, those who are on it (the earth) will believe. This is the time of which the Qur’anic verse says: “. . .no good will it do to a soul to believe in them then, if it believed not before nor earned righteousness through its faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4698",
      "hadith_no": "4698",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن أبي فروة الهمداني، عن أبي زرعة بن عمرو بن جرير، عن أبي ذر، وأبي، هريرة قالا كان رسول الله صلى الله عليه وسلم يجلس بين ظهرى أصحابه فيجيء الغريب فلا يدري أيهم هو حتى يسأل فطلبنا إلى رسول الله صلى الله عليه وسلم أن نجعل له مجلسا يعرفه الغريب إذا أتاه - قال - فبنينا له دكانا من طين فجلس عليه وكنا نجلس بجنبتيه وذكر نحو هذا الخبر فأقبل رجل فذكر هيئته حتى سلم من طرف السماط فقال السلام عليك يا محمد ‏.‏ قال فرد عليه النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated AbuDharr and AbuHurayrah:                     The Messenger of Allah (ﷺ) used to sit among his Companions. A stranger would come and not recognize him (the Prophet) until he asked (about him). So we asked the Messenger of Allah (ﷺ) to make a place where he might take his seat so that when a stranger came, he might recognise him. So we built a terrace of soil on which he would take his seat, and we would sit beside him. He then mentioned something similar to this Hadith saying: A man came, and he described his appearance. He saluted from the side of the assembly, saying: Peace be upon you, Muhammad. The Prophet (ﷺ) then responded to him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11406",
        "23",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4945",
      "hadith_no": "4945",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، عن يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على السمع والطاعة وأن أنصح لكل مسلم - قال - وكان إذا باع الشىء أو اشتراه قال ‏\"‏ أما إن الذي أخذنا منك أحب إلينا مما أعطيناك فاختر ‏\"‏ ‏.‏",
      "text_en": " Narrated Jarir:                     I swore allegiance to the Messenger of Allah (ﷺ) promising to hear and obey, and behave sincerely towards every Muslim. AbuZur'ah said: Whenever he sold and bought anything, he would say: What we took from you is dearer to us than what we gave you. So choose (as you like).",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20423",
        "20475",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1224",
      "hadith_no": "1224",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، حدثنا مزاحم بن ذواد بن علبة، عن أبيه، عن ليث، عن أبي الخطاب، عن أبي زرعة، عن أبي إدريس، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ المختلعات هن المنافقات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Thawban narrated that:                     The Prophet said: \"The women who seek a Khul are hypocrites.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20023",
        "11406",
        "11027",
        "130"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1211-2",
      "hadith_no": "1211",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، قال أخبرني علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ قلت من هم يا رسول الله فقد خابوا وخسروا فقال ‏\"‏ المنان والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وأبي هريرة وأبي أمامة بن ثعلبة وعمران بن حصين ومعقل بن يسار ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Prophet (ﷺ) said: \"There are three whom Allah will not look at on the Day of Judgement, nor will He purify them, and theirs is a painful punishment.\" We said: \"Who are they O Messenger of Allah ? For they have indeed failed and are lost!\" He sai: \"The Mannan, the one whose Izar hangs (below the ankels) and the one who promotes his merchandise with false oath.\" [He said:] There are narrations on this topic from Ibn Mas'ud, Abu Hurairah, Abu Umamah bin Tha'labah, 'Imran bin Husain, and Ma'qil bin Yasar[Abu 'Eisa said:] The Hadith of Abu Dharr is a Hasan Sahih Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1248",
      "hadith_no": "1248",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، حدثنا يحيى بن أيوب، وهو البجلي الكوفي قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يتفرقن عن بيع إلا عن تراض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"They (the two) are not separate from a sale except in agreement.[Abu 'Eisa said:] This Hadith is Gharib.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20355",
        "20379",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1698",
      "hadith_no": "1698",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سفيان، قال حدثني سلم بن عبد الرحمن النخعي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه كره الشكال من الخيل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة عن عبد الله بن يزيد الخثعمي عن أبي زرعة عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وأبو زرعة بن عمرو بن جرير اسمه هرم ‏.‏ حدثنا محمد بن حميد الرازي حدثنا جرير عن عمارة بن القعقاع قال قال لي إبراهيم النخعي إذا حدثتني فحدثني عن أبي زرعة فإنه حدثني مرة بحديث ثم سألته بعد ذلك بسنين فما أخرم منه حرفا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) disliked Shikal in horses.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.Muhammed bin Hammad Ar-Razi narrated to us (he said): \"Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me: \"When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1837",
      "hadith_no": "1837",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن أبي حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها ‏.‏ قال وفي الباب عن ابن مسعود وعائشة وعبد الله بن جعفر وأبي عبيدة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حيان اسمه يحيى بن سعيد بن حيان وأبو زرعة بن عمرو بن جرير اسمه هرم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"Some meat was brought to the Prophet (ﷺ) and a foreleg was presented to him, and he used to like it, so he bit from it.\"He said: There are narrations on this topic from Ibn Mas'ud, 'Aishah, 'Abdullah bin Ja'far, and Abu 'Ubaidah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Hayyan's (a narrator in the chain) name is Yahya bin Sa'eed bin Hayyan At-Taimi. Abu Zur'ah bin 'Amr bin Jarir's name is Harim.",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2293",
      "hadith_no": "2293",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا بندار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عمارة بن القعقاع، حدثنا أبو زرعة بن عمرو بن جرير، قال حدثنا صاحب، لنا عن ابن مسعود، قال قام فينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا يعدي شيء شيئا ‏\"‏ ‏.‏ فقال أعرابي يا رسول الله البعير الجرب الحشفة ندبنه فيجرب الإبل كلها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن أجرب الأول لا عدوى ولا صفر خلق الله كل نفس وكتب حياتها ورزقها ومصائبها ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وابن عباس وأنس ‏.‏ قال وسمعت محمد بن عمرو بن صفوان الثقفي البصري قال سمعت علي بن المديني يقول لو حلفت بين الركن والمقام لحلفت أني لم أر أحدا أعلم من عبد الرحمن بن مهدي ‏.‏",
      "text_en": " 'Ibn Mas'ud narrated:                      \"The Messenger of Allah (s.a.w) stood among us and said:'One thing does not infect another.' So a Bedouin said: 'O Messenger of Allah! If a camel gets mangy glands and we leave it at the resting place of camels, then all of the camels get mange?' The Messenger of Allah (s.a.w) said: 'Who caused the first to get manage? There is no 'Adwa nor safar. Allah created every soul, so he wrote its life, its provision, and its afflictions.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11379",
        "11406",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2361",
      "hadith_no": "2361",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو عمار، حدثنا وكيع، عن الأعمش، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated the the Messenger of Allah (s.a.w) said:                     \"O Allah! Make the sustenance of Muhammad's family nourishing.\"",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "11060",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2621",
      "hadith_no": "2621",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "أخبرنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا أبو حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال أتي رسول الله صلى الله عليه وسلم بلحم فرفع إليه الذراع فأكله وكانت تعجبه فنهس منها نهسة ثم قال ‏\"‏ أنا سيد الناس يوم القيامة هل تدرون لم ذاك يجمع الله الناس الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس منهم فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون فيقول الناس بعضهم لبعض ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول الناس بعضهم لبعض عليكم بآدم ‏.‏ فيأتون آدم فيقولون أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم آدم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد نهاني عن الشجرة فعصيت نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى أهل الأرض وقد سماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم نوح إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كان لي دعوة دعوتها على قومي نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى إبراهيم ‏.‏ فيأتون إبراهيم فيقولون يا إبراهيم أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قد كذبت ثلاث كذبات فذكرهن أبو حيان في الحديث نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى فيقولون يا موسى أنت رسول الله فضلك الله برسالته وبكلامه على البشر اشفع لنا إلى ربك ألا ترى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قد قتلت نفسا لم أومر بقتلها نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى عيسى ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه وكلمت الناس في المهد اشفع لنا إلى ربك ألا ترى ما نحن فيه فيقول عيسى إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله ولم يذكر ذنبا نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد ‏.‏ قال فيأتون محمدا فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وقد غفر لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه فأنطلق فآتي تحت العرش فأخر ساجدا لربي ثم يفتح الله على من محامده وحسن الثناء عليه شيئا لم يفتحه على أحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه واشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي يا رب أمتي يا رب أمتي ‏.‏ فيقول يا محمد أدخل من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب ثم قال والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وهجر وكما بين مكة وبصرى ‏\"‏ ‏.‏ وفي الباب عن أبي بكر الصديق وأنس وعقبة بن عامر وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حيان التيمي اسمه يحيى بن سعيد بن حيان كوفي وهو ثقة وأبو زرعة بن عمرو بن جرير اسمه هرم ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"\"Some meat was brought to the Prophet (s.a.w) and a foreleg was presented to him, and he used to like it, so he bit from it. Then he said: 'I will be the 'Leader' of the people on the Day of Resurrection. Do you know why that is? Allah will gather the people, the first and the last, on one level ground where they will (all) be able to hear a caller, and all of them will be visible, and the sun will be brought near such that the people will suffer distress and trouble that they cannot tolerate nor bear. Then some people will say: \"Don't you see the state you have reached? Why don't you look for a person who can intercede for you with your Lord? \" Some of them will say to others: \" You should go to Adam.\" So they will go to Adam and say, \"You are the father of all mankind, Allah created you with His Own Hands, and breathed into you from His spirit (which He creted for you) and ordered the angels to prostrate for you. Will you not intercede for us with your Lord? Don't you see what has happened to us? Don't you see the state we have reached?\" On that Adam will reply, \"Today my Lord has become angry such that He has never before been angry, and will never be thereafter. He forbade me (to eat from) the tree, but I disobeyed(Him), Myself! Myself! Myself! Go to somebody else; Go to Nuh.\" They will go to Nuh and say: \"O Nuh! You are the first among the Messengers to the people of the earth, and Allah named you a thankful slave. Will you not intercede for us with your Lord? Don't you see what has happened to us? Don't you see the state we have reached?\" Nuh will say to them : \"Today my Lord has become angry as He has never before been angry, and will never be thereafter. I had been given one supplication, and I supplicated against my own people. Myself! Myself! Myself! Go to someone else! Go to Ibrahim.\" They will go to Ibrahim and say: \"O Ibrahim! You are Allah's Prophet and His Khalil among the people of the earth, so intercede for us with your Lord, don't you see what hads happened to us?\" He will say: \"Today my Lord has become angry as He has never before been angry and will never be thereafter. Indeed I uttered three lies.\"- Abu Hayyyan (a narrator) mentioned them in his narration - \" Myself! Myself! Myself! Go to someone else! Go to Musa.\" So they will go to Musa and say: \"O Musa! You are the Messenger of Allah who Allah distinguished above the people with His Message and His Speech, intercede for us with your Lord. Don't you see what has happened to us?\" So he will say \"Today my Lord has become angry as He has never before been angry and will never be thereafter. Indeed I killed a person whom I was ordered not to kill. Myself! Myself! Myself! Go to someone else; Go to 'Eisa.\" They will go to 'Eisa and say: \"O 'Eisa ! You are the Messenger of Allah and His Word which He placed into Mariam, and a Spirit from Him, and you spoke to the people in the cradle. Intercede for us with your Lord. Don't you see what has happened to us?\" Then 'Eisa will say: \"Today my Lord has become angry as He has never before been angry and will never be thereafter.\" He will not mention a sin, but will say: \"Myself! Myself! Myself! Go to someone else! Go to Muhammad.\" He said: 'They will go to Muhammad(s.a.w) and they say: \"O Muhammad! You are the Messenger of Allah and the last of the Prophets, and your past and future sins have been pardoned. Will you not intercede for us with your Lord, don't you see what has happened to us?\" Then I will depart until I come to under the Throne to fall prostrating before my Lord. Then Allah will guide me to such praises and beautiful statements of glorification which He did not guide anyone to before me. Then He will say: \"O Muhammad! Raise your head. Ask,so that you may be granted and intercede so that your intercession may be accepted.\" I will raise my head and say: \"O Lord! My Ummah! O Lord! My Ummah! O Lord! My Ummah!\" He will say: \"O Muhammad! Let those of your Ummah who have no accounts enter the gate on the right among the gates of Paradise, and they shall share in the gates other than that with the people.'\" Then he (s.a.w) said: 'By the One in Whose Hand is my soul! What is between every two gate-posts in Paradise is as what is between Makkah and Hajar, and what is between Makkah and Busra.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3003",
      "hadith_no": "3003",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يونس بن عبيد، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، قال سألت رسول الله صلى الله عليه وسلم عن نظرة الفجأة فأمرني أن أصرف بصري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو زرعة بن عمرو اسمه هرم ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11075",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3438-2",
      "hadith_no": "3438",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عمر بن علي المقدمي، حدثنا ابن أبي عدي، عن شعبة، عن عبد الله بن بشر الخثعمي، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا سافر فركب راحلته قال بأصبعه ومد شعبة بأصبعه قال ‏\"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا بنصحك واقلبنا بذمة ‏.‏ اللهم ازو لنا الأرض وهون علينا السفر اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب ‏\"‏ ‏.‏ قال أبو عيسى كنت لا أعرف هذا إلا من حديث ابن أبي عدي حتى حدثني به سويد ‏.‏ حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، حدثنا شعبة، بهذا الإسناد نحوه بمعناه ‏.‏ قال هذا حديث حسن غريب من حديث أبي هريرة ولا نعرفه إلا من حديث ابن أبي عدي عن شعبة ‏.‏",
      "text_en": " Abu Hurairah narrated:                     “When the Prophet would travel, and he would mount his riding camel, he would gesture with his finger” – and Shu’bah stretched out his finger – “and say: ‘O Allah You are the companion on the journey, and the caretaker for the family, O Allah, accompany us with Your protection, and return us in security, O Allah, I seek refuge in You from the difficulties of the journey, and from returning in great sadness (Allahumma Antas-Sahibu Fis Safari Wal-Khalifatu Fil-Ahli Allahumma Ashabna Bi Nusaika Waqlibna Bi-Dhimmah, Allahummazwi Lanal-Arda Wa Hawwin Alainas-Safar, Allahumma Inni A’udhu Bika Min Wa’tha’is-Safari Wa Ka’abatil-Munqalab).’”",
      "usc_msa_ref": "",
      "chain": [
        "30582",
        "20276",
        "20020",
        "15269",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3467-2",
      "hadith_no": "3467",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا محمد بن الفضيل، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: “There are two statements that are light on the tongue, heavy on the Scale, and beloved to Ar-Rahman: “Glory is to Allah, the Magnificent; Glory is to Allah and the praise. (Subhan Allahil-Azim, Subhan Allahi Wa Bihamdih)”",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4302",
      "hadith_no": "4302",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن غيلان بن عبد الله العامري، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله أوحى إلى أى هؤلاء الثلاثة نزلت فهي دار هجرتك المدينة أو البحرين أو قنسرين ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث الفضل بن موسى تفرد به أبو عامر ‏.‏",
      "text_en": " Narrated Jarir bin 'Abdullah:                     that the Prophet (ﷺ) said: \"Indeed Allah has revealed to me that: Whichever of these three places you go to will be the place of your emigration: Al-Madinah, Bahrain, or Qinnasrin.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "28471",
        "28478",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-50",
      "hadith_no": "50",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة، عن أبي هريرة، أن النبي صلى الله عليه وسلم توضأ فلما استنجى دلك يده بالأرض ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) performed Wudu', and when he had performed Istinja' he rubbed his hand on the ground.",
      "usc_msa_ref": "",
      "chain": [
        "30271",
        "20032",
        "20587",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-60",
      "hadith_no": "60",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا استفتح الصلاة سكت هنيهة فقلت بأبي أنت وأمي يا رسول الله ما تقول في سكوتك بين التكبير والقراءة قال ‏\"‏ أقول اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم نقني من خطاياى كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياى بالثلج والماء والبرد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"When the Messenger of Allah (ﷺ) started Salah, he would remain silent for a short while. I said: 'May my father and mother be ransomed for you, O Messenger of Allah! What do you say when you remain silent between the Takbir and the recitation (in the Salah)?' He said: 'I say: Allahumma ba'id baini was baina khatayaya kama ba'adta baina al-mashriq wal-maghrib; Allahumma naqqini min khatayaya kama yunaqqath-thawb al-abyad min ad-danas; Allahummaghsilni min khatayaya bith-thalji wal-ma'i wal-barad (O Allah, out a great distance between me and my sins, as great as the distance You have made between the East and the West; O Allah, cleanse me of of sin as a white garment is cleansed from filth; Wash away my sins with snow, water, and hail)'.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-263",
      "hadith_no": "263",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا هشام بن عبد الملك، قال أنبأنا شعبة، ح وأنبأنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، - واللفظ له - عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali that the Prophet (ﷺ) said:                      \"The angels do not enter a house where there is an image, a dog or a Junub person.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20020",
        "30359",
        "20031",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-334",
      "hadith_no": "334",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا جرير، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم اغسلني من خطاياى بالثلج والماء والبرد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) would say: [1] 'Allahummaghsil khatayaya bi-ma'ith-thalj wal-barad (O Allah, wash away my sins with the water of snow and hail).'\"[1] That is at the beginning of Salah as is clear from the remainder of the narration whichpreceded under No. 60.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-894",
      "hadith_no": "894",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كانت له سكتة إذا افتتح الصلاة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) used to pause briefly when he had started to pray.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-895",
      "hadith_no": "895",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا جرير، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا افتتح الصلاة سكت هنيهة فقلت بأبي أنت وأمي يا رسول الله ما تقول في سكوتك بين التكبير والقراءة قال ‏\"‏ أقول اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم نقني من خطاياى كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياى بالماء والثلج والبرد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"When the Messenger of Allah (ﷺ) started to pray he would pause briefly. I said: 'May my father and mother be ransomed for you, O Messenger of Allah, what do you say when you pause briefly between the takbir and reciation?' He said: 'I say: Allahuma ba'id bayni wa bayna khatayaya kama ba'adta bayna al-mashriqi wal-maghrib; Allahumma naqqini min khatayaya kama yunaqqa ath-thawb al-abyad min ad-danas; Allahumma ighsilni min khatayaya bil ma'i wa ath-thalji wal-barad. (O Allah, put a great distance between me and my sins, as great as the distance You have made between the East and the West; O Allah, cleanse me of my sins as a white garment is cleansed from filth; O Allah, wash away my sins with water and snow and hail).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1211",
      "hadith_no": "1211",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن المغيرة، عن الحارث العكلي، عن أبي زرعة بن عمرو بن جرير، قال حدثنا عبد الله بن نجى، عن علي، قال كان لي من رسول الله صلى الله عليه وسلم ساعة آتيه فيها فإذا أتيته استأذنت إن وجدته يصلي فتنحنح دخلت وإن وجدته فارغا أذن لي ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"I had certain times when I used to come to the Messenger of Allah (ﷺ). When I came to him I would ask for permission to enter. If I found him praying he would clear his throat and I would enter, and if I found him free he would give me permission (to enter).\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "166",
        "11622",
        "11406",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-1877",
      "hadith_no": "1877",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا جرير، قال حدثني طلق بن معاوية، وحفص بن غياث، قال حدثني جدي، طلق بن معاوية عن أبي زرعة، عن أبي هريرة، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم بابن لها يشتكي فقالت يا رسول الله أخاف عليه وقد قدمت ثلاثة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد احتظرت بحظار شديد من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A woman came to the Messenger of Allah with a son of hers who was ill and said: 'O Messenger of Allah, I fear for him, and I have already lost three.' The Messenger of Allah said: \"You have a great protection against the Hellfire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20028",
        "10777",
        "20317",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2542",
      "hadith_no": "2542",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رجل يا رسول الله أى الصدقة أفضل قال ‏\"‏ أن تصدق وأنت صحيح شحيح تأمل العيش وتخشى الفقر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A man said: 'O Messenger of Allah, which kind of charity is best? He said: 'Giving charity when you are in good health, and feeling stingy, hoping or a long life and fearing poverty.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2563",
      "hadith_no": "2563",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن علي بن المدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقرأها رسول الله صلى الله عليه وسلم فقال أبو ذر خابوا وخسروا خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنفق سلعته بالحلف الكاذب والمنان عطاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three to whom Allah will not speak on the Day of Resurrection, or look at them, or sanctify them, and theirs will be a painful torment.\" The Messenger of Allah repeated and Abu Dharr said: \"May they be lost and doomed.\" He said: \"The one who lets his garment hang beneath his ankles, a vendor who tries to sell his product by means of false oaths, and the one who reminds people of what he has given them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3567",
      "hadith_no": "3567",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني سلم بن عبد الرحمن، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه كره الشكال من الخيل ‏.‏ قال أبو عبد الرحمن الشكال من الخيل أن تكون ثلاث قوائم محجلة وواحدة مطلقة أو تكون الثلاثة مطلقة ورجل محجلة وليس يكون الشكال إلا في رجل ولا يكون في اليد ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet used to dislike the Shikal among horses.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3572",
      "hadith_no": "3572",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن جرير، قال رأيت رسول الله صلى الله عليه وسلم يفتل ناصية فرس بين أصبعيه ويقول ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والغنيمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir said:                      \"I saw the Messenger of Allah twisting the forelock of a horse with his two fingers, and saying: 'Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "20475",
        "10602",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-3611",
      "hadith_no": "3611",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا محمد بن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الصدقة أعظم أجرا قال ‏\"‏ أن تصدق وأنت صحيح شحيح تخشى الفقر وتأمل البقاء ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا وقد كان لفلان ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A man came to the Prophet and said: 'O Messenger of Allah, what kind of charity brings the greatest reward?' He said: 'To give in charity when you are healthy and feeling miserly, and fearing poverty and hoping for a long life. Do not wait until the (death rattle) reaches the throat and then say: \"This is for so and so,\" and it nearly became the property of so and so (the heirs).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38011",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4131",
      "hadith_no": "4131",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، وعبد الرحمن، قالا حدثنا شعبة، عن علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، عن جرير، أن رسول الله صلى الله عليه وسلم في حجة الوداع استنصت الناس قال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jarir that :                     During the Farewell Pilgrimage, the Messenger of Allah [SAW] asked the people to be quiet and listen, and said: \"Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another).\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20033",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-4157",
      "hadith_no": "4157",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن يونس، عن عمرو بن سعيد، عن أبي زرعة بن عمرو بن جرير، قال جرير بايعت النبي صلى الله عليه وسلم على السمع والطاعة وأن أنصح لكل مسلم ‏.‏",
      "text_en": " Jarir said:                     \"I pledged to the Prophet to hear and obey and to be sincere toward every Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20208",
        "20475",
        "10602",
        "11406"
      ]
    },
    {
      "id": "sunan-an-nasai-4281",
      "hadith_no": "4281",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، ويحيى بن سعيد، قالا حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الملائكة لا تدخل بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that the Prophet said:                     \"The angels do not enter a house in which there is a picture, a dog or a person who is Junub.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20031",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-4458",
      "hadith_no": "4458",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقرأها رسول الله صلى الله عليه وسلم قال أبو ذر خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنفق سلعته بالحلف الكاذب والمنان عطاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three to whom Allah will not speak on the Day of Resurrection, or will He look at them, or sanctify them, and theirs will be a painful torment: Abu Dharr said:\" May they be lost and doomed: He said: \"The one who drags his Izar (below the ankles) the one who sells his product by means of false oaths, and the one who reminds others (Al-Mannan) of what he has given to them\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11377",
        "11406",
        "4026",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-4559",
      "hadith_no": "4559",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن أبيه، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التمر بالتمر والحنطة بالحنطة والشعير بالشعير والملح بالملح يدا بيد فمن زاد أو ازداد فقد أربى إلا ما اختلفت ألوانه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'Dates for dates, wheat for wheat, barley for barley, salt for salt, exchanged hand to hand. Whoever gives more or takes more has engaged in Riba unless they are of different types.\"",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "20349",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4904",
      "hadith_no": "4904",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عيسى بن يزيد، قال حدثني جرير بن يزيد، أنه سمع أبا زرعة بن عمرو بن جرير، يحدث أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ حد يعمل في الأرض خير لأهل الأرض من أن يمطروا ثلاثين صباحا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'A Hadd punishment that is carried out on earth is better for the people of earth than if it were to rain for thirty mornings.\"' (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "28079",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4905",
      "hadith_no": "4905",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن زرارة، قال أنبأنا إسماعيل، قال حدثنا يونس بن عبيد، عن جرير بن يزيد، عن أبي زرعة، قال قال أبو هريرة إقامة حد بأرض خير لأهلها من مطر أربعين ليلة ‏.‏",
      "text_en": " It was narrated that Abu Zurah said:                     \"Abu Hurairah said: 'Carrying out a Hadd punishment in a land is better for its people than if it were to rain for forty nights.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30365",
        "20208",
        "11075",
        "28079",
        "11406"
      ]
    },
    {
      "id": "sunan-an-nasai-4991",
      "hadith_no": "4991",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن قدامة، عن جرير، عن أبي فروة، عن أبي زرعة، عن أبي هريرة، وأبي، ذر قالا كان رسول الله صلى الله عليه وسلم يجلس بين ظهرانى أصحابه فيجيء الغريب فلا يدري أيهم هو حتى يسأل فطلبنا إلى رسول الله صلى الله عليه وسلم أن نجعل له مجلسا يعرفه الغريب إذا أتاه فبنينا له دكانا من طين كان يجلس عليه وإنا لجلوس ورسول الله صلى الله عليه وسلم في مجلسه إذ أقبل رجل أحسن الناس وجها وأطيب الناس ريحا كأن ثيابه لم يمسها دنس حتى سلم في طرف البساط فقال السلام عليك يا محمد ‏.‏ فرد عليه السلام قال أدنو يا محمد قال ‏\"‏ ادنه ‏\"‏ ‏.‏ فما زال يقول أدنو مرارا ويقول له ‏\"‏ ادن ‏\"‏ ‏.‏ حتى وضع يده على ركبتى رسول الله صلى الله عليه وسلم قال يا محمد أخبرني ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتحج البيت وتصوم رمضان ‏\"‏ ‏.‏ قال إذا فعلت ذلك فقد أسلمت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال صدقت ‏.‏ فلما سمعنا قول الرجل صدقت أنكرناه قال يا محمد أخبرني ما الإيمان قال ‏\"‏ الإيمان بالله وملائكته والكتاب والنبيين وتؤمن بالقدر ‏\"‏ ‏.‏ قال فإذا فعلت ذلك فقد آمنت قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا محمد أخبرني ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا محمد أخبرني متى الساعة قال فنكس فلم يجبه شيئا ثم أعاد فلم يجبه شيئا ثم أعاد فلم يجبه شيئا ورفع رأسه فقال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن لها علامات تعرف بها إذا رأيت الرعاء البهم يتطاولون في البنيان ورأيت الحفاة العراة ملوك الأرض ورأيت المرأة تلد ربها خمس لا يعلمها إلا الله ‏{‏ إن الله عنده علم الساعة ‏}‏ إلى قوله ‏{‏ إن الله عليم خبير ‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا والذي بعث محمدا بالحق هدى وبشيرا ما كنت بأعلم به من رجل منكم وإنه لجبريل عليه السلام نزل في صورة دحية الكلبي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah and Abu Dharr said:                     \"The Messenger of Allah [SAW] would sit among his Companions and if a stranger came, he would not know which of them was he (the Prophet [SAW]) until he asked. So we suggested to the Messenger of Allah [SAW] that we should make a dais for him so that any stranger would know him if he came to him. So we built for him a bench made of clay on which he used to sit. (One day) we were sitting and the Messenger of Allah [SAW] was sitting in his spot, when a man came along who was the most handsome and good-smelling of all people, and it was as if no dirt had ever touched his garments. He came near the edge of the rug and greeted him, saying: 'Peace be upon you, O Muhammad!' He returned the greeting, and he said: 'Shall I come closer, O Muhammad?' He came a little closer, and he kept telling him to come closer, until he put his hands on the knees of the Messenger of Allah [SAW]. He said: 'O Muhammad, tell me, what is Islam?' He said: 'Islam means to worship Allah and not associate anything with Him; to establish Salah, to pay Zakah, to perform Hajj to the House, and to fast Ramadan.' He said: 'If I do that, will I have submitted (be a Muslim)?' He said: 'Yes.' He said: 'You have spoken the truth,' we found it odd. He said: 'O Muhammad, tell me, what is faith?' He said: 'To believe in Allah [SWT], His Angels, the Book, the Prophets, and to believe in the Divine Decree.' He said: 'If I do that, will I have believed?' The Messenger of Allah [SAW] said: 'Yes.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me, what is Al-Ihsan?' He said: 'To worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me about the Hour.' He lowered his head and did not answer. Then he repeated the question, and he did not answer. Then he repeated the question (a third time) and he did not answer. Then he raised his head and said: 'The one who is being asked does not know more than the one who is asking. But it has signs, by which it may be known. When you see the herdsmen competing in building tall buildings, when you see the barefoot and naked ruling the Earth, when you see a woman giving birth to her mistress. Five things which no one knows except Allah [SWT]. Verily, Allah, with Him (alone) is the knowledge of the Hour up to His saying: 'Verily, Allah is All-Knower, All-Aware (of things).' Then he said: 'No, by the One who sent Muhammad with the truth, with guidance and glad tidings, I did not know him more than any man among you. That was Jibril, peace be upon you, who came down in the form of Dihyah Al-Kalbi.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11653",
        "11406",
        "13",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5030",
      "hadith_no": "5030",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن قدامة قال حدثنا جرير عن عمارة بن القعقاع عن أبي زرعة عن أبي هريرة رضي الله عنه قال   قال رسول الله صلى الله عليه وسلم تضمن الله عز وجل لمن خرج في سبيله لا يخرجه إلا الجهاد في سبيلي وإيمان بي وتصديق برسلي فهو ضامن أن أدخله الجنة أو أرجعه إلى مسكنه الذي خرج منه نال ما نال من أجر أو غنيمة",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Allah, the Mighty and Sublime, has guaranteed to the one who goes out in His cause, 'and he does not go out for any other purpose except Jihad in My cause and faith in Me, believing in My Messengers, but he is guaranteed that I will admit him to Paradise or I will send him back to his dwelling from which he set out, having acquired whatever he acquired of reward or spoils of war.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5106",
      "hadith_no": "5106",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن عمارة، عن أبي زرعة، عن أبي هريرة، قال أتي عمر بامرأة تشم فقال أنشدكم بالله هل سمع أحد منكم من رسول الله صلى الله عليه وسلم قال أبو هريرة فقمت فقلت يا أمير المؤمنين أنا سمعته ‏.‏ قال فما سمعته قلت سمعته يقول ‏\"‏ لا تشمن ولا تستوشمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A woman who did tattoos was brought to 'Umar and he said: 'I adjure you by Allah, did any one among you hear (anything from) the Messenger of Allah [SAW]?' Abu Hurairah said: \"I stood up and said: 'O Commander of the Believers! I heard him (say something).' He said: 'What did you hear?' I said: 'I heard him say: Do not do tattoos and do not have tattoos done.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5501",
      "hadith_no": "5501",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عمر بن علي بن مقدم، قال حدثنا ابن أبي عدي، عن شعبة، عن عبد الله بن بشر الخثعمي، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا سافر فركب راحلته قال بإصبعه - ومد شعبة بإصبعه - قال ‏\"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل والمال اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"When the Messenger of Allah [SAW] traveled and rode his mount, he gestured with his finger - and Shu'bah (one of the narrators) stretched out his finger - and said: 'Allahumma, antas-sahibu fis-safari wal-khalifatu fil-ahli wal-mal. Allahumma, inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi (O Allah, You are our help when we are traveling and the One Who takes care of our families and wealth (in our absence). O Allah, I seek refuge in You from the hardships of travel and the sorrows of return.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30582",
        "20276",
        "20020",
        "15269",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-67",
      "hadith_no": "67",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن أبي حيان، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  يوما بارزا للناس ‏.‏ فأتاه رجل فقال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله ولقائه وتؤمن بالبعث الآخر ‏\"‏ ‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤتي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها إذا ولدت الأمة ربتها فذلك من أشراطها وإذا تطاول رعاء الغنم في البنيان فذلك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ فتلا رسول الله  صلى الله عليه وسلم  {إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"One day the Prophet (ﷺ) appeared among the people. A man came to him and said: 'O messenger of Allah, what is Iman (faith)?'  He said: 'To believe in Allah, His angels, His books, His Messengers and the meeting with, and to believe in the Final Resurrection.' He said: 'O Messenger of Allah, what is Islam?' He said: 'To worship Allah (alone) and not to associate anything with Him; to establish the prescribed prayers, to pay the obligatory Zakat, and to fast Ramadan.' He said: 'O Messenger of Allah, what is Ihsan?  He said: 'To worship Allah as if you see Him, for even though you do not see Him, He sees you.' He said: \"O Messenger of Allah, when will the Hour be?' He said: 'The one who is being asked about it does not know more than the one who is asking. But I will tell you about its signs. When the slave woman gives birth to her mistress that is one of its signs. When the shepherds compete in constructing tall buildings that is one of its signs. And there are five things which no one knows except Allah.' Then the Messenger of Allah (ﷺ) recited the Verse: \"Verily, Allah, with Him (Alone) is the knowledge of the Hour, He sends down the rain, and knows that which is in the wombs. No person knows what he will earn tomorrow, and no person knows in what land he will die. Verily, Allah is All-Knower, All-Aware (of things).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-387",
      "hadith_no": "387",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قضى حاجته ثم استنجى من تور ثم دلك يده بالأرض ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet relieved himself, then he cleaned himself (with water) from a pot made of brass, then he wiped his hand on the ground.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11858",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-511",
      "hadith_no": "511",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  توضأ في تور ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet performed ablution using (the water in) a vessel made of brass.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11858",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-854",
      "hadith_no": "854",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  إذا كبر سكت بين التكبير والقراءة ‏.‏ قال فقلت بأبي أنت وأمي أرأيت سكوتك بين التكبير والقراءة فأخبرني ما تقول قال ‏\"‏ أقول اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم نقني من خطاياى كالثوب الأبيض من الدنس اللهم اغسلني من خطاياى بالماء والثلج والبرد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “When the Messenger of Allah(ﷺ)said the Takbir (Allah Akbar), he would remain silent betweentheTakbir and the recitation. I said: ‘May my father and mother beransomed for you! I noticed that you are silent between the Takbirandthe recitation; please tell me what you say then.’ He said: ‘Isay:‘Allahumma ba’id baini wa baina khatayaya kama ba’adtabainal-mashriqiwal-maghrib; Allahumma naqqini min khatayaykath-thawbil abyad minad-danas; Allahummaghsilni min khatayayabil-ma’i waththalji wal-barad (OAllah, distance me from my sins asYou have distanced the east fromthe west; O Allah purify me of mysins as a white garment is purifiedof dirt; O Allah, cleanse me ofmy sins with water and snow andhail).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1911",
      "hadith_no": "1911",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من سأل الناس أموالهم تكثرا فإنما يسأل جمر جهنم فليستقل منه أو ليكثر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     the Messenger of Allah(ﷺ) said: “Whoever begs from people so as to accumulate more riches, he is asking for alive coal from hell, so let him ask for a lot or a little.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2635",
      "hadith_no": "2635",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، أنبأنا عيسى بن يزيد، أظنه عن جرير بن يزيد، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حد يعمل به في الأرض خير لأهل الأرض من أن يمطروا أربعين صباحا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “A legal punishment that is carried out in the land is better for the people of that land than if it were to rain for forty days.”",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20025",
        "28079",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2810",
      "hadith_no": "2810",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن عمارة بن القعقاع، وابن، شبرمة عن أبي زرعة، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله نبئني بأحق الناس مني بحسن الصحبة فقال ‏\"‏ نعم وأبيك لتنبأن أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ ثم أبوك ‏\"‏ ‏.‏ قال نبئني يا رسول الله عن مالي كيف أتصدق فيه قال ‏\"‏ نعم والله لتنبأن أن تصدق وأنت صحيح شحيح تأمل العيش وتخاف الفقر ولا تمهل حتى إذا بلغت نفسك هاهنا قلت مالي لفلان ومالي لفلان وهو لهم وإن كرهت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     “A man came to the Prophet (ﷺ) and said: “O Messenger of Allah (ﷺ), tell me, which of the people has most right to my good companionship?' He said: 'Yes, by your father, you will certainly be told.' He said: 'Your mother,' He said: 'Then who?' He said: Then your mother.' He said: 'Then who?' He said: Then your mother.' He said: 'Then who?' He said: Then your father.' He said: 'Tell me, O Messenger of Allah (ﷺ) about my wealth- how should I give in charity?' He said: 'Yes, by Allah (SWT) you will certainly be told. You should give in charity when you are still healthy and greedy for wealth, hoping for a long life and fearing poverty. Do not tarry until your soul reaches here and you say: “My wealth of for so-and-so,” and “My wealth of for so-and-so,” and it will be for them even though you dislike that.'”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2858",
      "hadith_no": "2858",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعد الله لمن خرج في سبيله لا يخرجه إلا جهاد في سبيلي وإيمان بي وتصديق برسلي فهو على ضامن أن أدخله الجنة أو أرجعه إلى مسكنه الذي خرج منه نائلا ما نال من أجر أو غنيمة ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لولا أن أشق على المسلمين ما قعدت خلاف سرية تخرج في سبيل الله أبدا ولكن لا أجد سعة فأحملهم ولا يجدون سعة فيتبعوني ولا تطيب أنفسهم فيتخلفون بعدي والذي نفس محمد بيده لوددت أن أغزو في سبيل الله فأقتل ثم أغزو فأقتل ثم أغزو فأقتل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Allah has prepared (reward) for those who go out (to fight) inHiscause: ‘And do not go out except (to fight) for Jihad in My cause,out of faith in Me and belief in My Messengers, but he has aguaranteefrom Me that I will admit him to Paradise, or I will returnhim to hisdwelling from which he set out, with the reward that heattained, orthe spoils that he acquired.’ Then he said: ‘By theOne in Whose Handis my soul, were it not that it would be toodifficult for theMuslims, I would never have stayed behind from anyexpedition thatwent out in the cause of Allah. But I could not findthe resources togive them mounts and they could not find theresources to follow me,nor would they be pleased to stay behind if Iwent. By the One inWhose Hand is the soul of Muhammad, I wish Icould fight in the causeof Allah and be killed, then fight and bekilled, then fight and bekilled.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2896",
      "hadith_no": "2896",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن سلم بن عبد الرحمن النخعي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) used todislikehorses that had three legs with white markings on them, andone legthe same color as the rest of the body.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3159",
      "hadith_no": "3159",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم اغفر للمحلقين ‏\"‏ ‏.‏ قالوا يا رسول الله والمقصرين قال ‏\"‏ اللهم اغفر للمحلقين ‏\"‏ ‏.‏ ثلاثا قالوا يا رسول الله والمقصرين قال ‏\"‏ والمقصرين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “OAllah, forgive those who shave (their heads).” They said: “OMessenger of Allah, and those who cut (their hair)?’ He said; “OAllah, forgive those who shave (their heads),” three times. Theysaid:“O Messenger of Allah, and those who cut (their hair)?” Hesaid: “Andthose who cut (their hair).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3432",
      "hadith_no": "3432",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، ح وحدثنا علي بن محمد، حدثنا محمد بن فضيل، قالا حدثنا أبو حيان التيمي، عن أبي زرعة، عن أبي هريرة، قال أتي رسول الله  صلى الله عليه وسلم  ذات يوم بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “One day some meat wasbrought tothe Messenger of Allah (ﷺ) and the foreleg was offered tohim whichhe liked, so he bit it with his front teeth.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "38409",
        "20356",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3781",
      "hadith_no": "3781",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا غندر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali bin Abu Talib that the Prophet (ﷺ) said:                     “Theangels do not enter a house in which there is a dog or an image.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20278",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-3658-2",
      "hadith_no": "3658",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، محمد بن ميمون المكي حدثنا سفيان بن عيينة، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قالوا يا رسول الله من أبر قال ‏\"‏ أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ أمك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ أباك ‏\"‏ ‏.‏ قال ثم من قال ‏\"‏ الأدنى فالأدنى ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah, may Allah be pleased with them, said that:                     Allah's Messenger said: \"They said: 'O Messenger of Allah, whom should I treat kindly?' He said: 'Your mother.' He said: 'Then who?' He said :'Your mother.\" He said: 'Then who?' He said: 'Your father'. He said : 'Then who?' He said: 'The next closest and the next closest.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20005",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3806",
      "hadith_no": "3806",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بشر، وعلي بن محمد، قالا حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (ﷺ) said: 'Two words which are light on the tongue and heavy in the Balance, and beloved to the Most Merciful: Subhan-Allah wa bi hamdihi, Subhan-Allahil-'Azim (Glory and praise is to Allah, glory is to Allah the Almighty).\"",
      "usc_msa_ref": "",
      "chain": [
        "11419",
        "38409",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4077",
      "hadith_no": "4077",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، وعبد الرحمن بن مهدي، قالا حدثنا شعبة، عن علي بن مدرك، قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن جرير بن عبد الله، أن رسول الله  صلى الله عليه وسلم  قال في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jarir bin ‘Abdullah that the Messenger ofAllah(ﷺ) said, during the Farewell Pilgrimage:                      “Make the peoplepayattention.” Then he said: “Do not turn back into disbelieversafter Iam gone, striking one another’s necks.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20033",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "id": "sunan-ibn-majah-4180",
      "hadith_no": "4180",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن أبي حيان، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  يوما بارزا للناس فأتاه رجل فقال يا رسول الله متى الساعة فقال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأخبرك عن أشراطها إذا ولدت الأمة ربتها فذاك من أشراطها وإذا كانت الحفاة العراة رءوس الناس فذاك من أشراطها وإذا تطاول رعاء الغنم في البنيان فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ فتلا رسول الله  صلى الله عليه وسلم  ‏{إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام}‏ الآية ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      “The Messenger of Allah(ﷺ)came out one day to the people, and a man came to him and said:‘OMessenger of Allah, when will the Hour be?’ He said: ‘Theone who isasked about it does not know more than the one who isasking. But Iwill tell you of its portents. When the slave womangives birth to hermistress, that is one of its portents. When thebarefoot and nakedbecome leaders of the people, that is one of itsportents. Whenshepherds compete in constructing buildings, that isone of itsportents. (The Hour) is one of five (things) which no oneknows exceptAllah.’ Then the Messenger of Allah (ﷺ) recited thewords: “Verily,Allah, with Him (alone) is the knowledge of theHour, He sends downthe rain, and knows that which is in the wombs.(to the end of theVerse).”[31:34]",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4206",
      "hadith_no": "4206",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت ورآها الناس آمن من عليها فذلك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      “I heard the Messenger ofAllah (ﷺ) say: ‘The Hour will not begin until the sun rises fromthewest (i.e. the place of its setting). When it rises, the peoplewillsee it, and everyone on (earth) will believe, but that will beat atime when faith will not benefit anyone who did not believebefore.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4207",
      "hadith_no": "4207",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبي حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى ‏\"‏ ‏.‏ قال عبد الله فأيتهما ما خرجت قبل الأخرى فالأخرى منها قريب ‏.‏ قال عبد الله ولا أظنها إلا طلوع الشمس من مغربها ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Amr that the Messenger ofAllah (ﷺ) said:                      “The first signs to appear will be at the risingof the sun from the west and the emergence of the Beast to thepeople, at forenoon.’”'Abdullah said: \"Whichever of them appears first, the other will come soon after.\" 'Abdullah said: \"I do not think it will be anything other than the sun rising from the west.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11404",
        "11406",
        "29"
      ]
    }
  ],
  "total_hadiths": 141
}