{
  "id": "11400",
  "name": "Hamam bin al-Harith همام بن الحارث",
  "full_name": "Hamam bin al-Harith همام بن الحارث",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "65",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Kufi",
      "'Abid"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Nakha'i",
        "ar": "al-Nakha'i",
        "ckb": "al-Nakha'i"
      },
      {
        "en": "al-Kufi",
        "ar": "al-Kufi",
        "ckb": "al-Kufi"
      },
      {
        "en": "'Abid",
        "ar": "'Abid",
        "ckb": "'Abid"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4057",
      "name": "Jarir bin 'Abdullah al-Bajli ( جرير بن عبد الله البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11662",
      "name": "Wabra bin 'Abdur Rahman al-Musli وبرة بن عبد الرحمن المسلي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-387",
      "hadith_no": "387",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن الأعمش، قال سمعت إبراهيم، يحدث عن همام بن الحارث، قال رأيت جرير بن عبد الله بال ثم توضأ، ومسح على خفيه، ثم قام فصلى، فسئل فقال رأيت النبي صلى الله عليه وسلم صنع مثل هذا‏.‏ قال إبراهيم فكان يعجبهم، لأن جريرا كان من آخر من أسلم‏.‏",
      "text_en": " Narrated Ibrahim:                     Hammam bin Al-Harith said, \"I saw Jarir bin `Abdullah urinating. Then he performed ablution and passed his (wet) hands over his Khuffs (socks made from thick fabric or leather), stood up and prayed. He was asked about it. He replied that he had seen the Prophet doing the same.\" They approved of this narration as Jarir was one of those who embraced Islam very late.",
      "usc_msa_ref": "",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3905",
      "hadith_no": "3905",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن حماد الآملي، قال حدثني يحيى بن معين، حدثنا إسماعيل بن مجالد، عن بيان، عن وبرة، عن همام بن الحارث، قال قال عمار بن ياسر رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان، وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar bin Yasir:                     I saw Allah's Apostle , and the only converts (to Islam) with him, were five slaves, two women and Abu Bakr.",
      "usc_msa_ref": "197",
      "chain": [
        "30347",
        "30020",
        "20314",
        "11326",
        "11662",
        "11400"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5535",
      "hadith_no": "5535",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن منصور، عن إبراهيم، عن همام بن الحارث، عن عدي بن حاتم  رضى الله عنه  قال قلت يا رسول الله إنا نرسل الكلاب المعلمة‏.‏ قال ‏\"‏ كل ما أمسكن عليك ‏\"‏‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ‏\"‏‏.‏ قلت وإنا نرمي بالمعراض‏.‏ قال ‏\"‏ كل ما خزق، وما أصاب بعرضه فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi bin Hatim:                     I said, \"O Allah's Apostle! We let loose our trained hounds after a game?\" He said, \"Eat what they hunt for you.\" I said, \"Even if they killed (the game)?\" He replied, 'Even if they killed (the game).\" I said, 'We also hit (the game) with the Mi'rad?\" He said, \"Eat of the animal which the Mi'rad kills by piercing its body, but do not eat of the animal which is killed by the broad side of the Mi'rad.''",
      "usc_msa_ref": "386",
      "chain": [
        "20351",
        "20012",
        "11067",
        "11051",
        "11400",
        "212"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-304",
      "hadith_no": "304",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، قال إسحاق أخبرنا جرير، عن منصور، عن إبراهيم، عن همام بن الحارث، قال كان رجل ينقل الحديث إلى الأمير فكنا جلوسا في المسجد فقال القوم هذا ممن ينقل الحديث إلى الأمير ‏.‏ قال فجاء حتى جلس إلينا ‏.‏ فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Hammam b, al-Harith that a man used to carry tales to the governor. We were sitting in the mosque. the people said:                      He is one who carries tales to the governor. He (the narrator) said: Then he came and sat with us. Thereupon Hudhaifa remarked: I heard the Messenger of Allah (may peace be upon him) saying: The beater of false tales would never enter heaven.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "30123",
        "30312",
        "20028",
        "11067",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-305",
      "hadith_no": "305",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، ح وحدثنا منجاب بن الحارث التميمي، - واللفظ له - أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال كنا جلوسا مع حذيفة في المسجد فجاء رجل حتى جلس إلينا فقيل لحذيفة إن هذا يرفع إلى السلطان أشياء ‏.‏ فقال حذيفة - إرادة أن يسمعه - سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Hammam b. al-Harith:                      We were sitting with Hudhaifa in the mosque. A man came and sat along with us. It was said to Hudhaifa that he was the man who carried tales to the ruler. Hudhaifa remarked with the intention of conveying to him: I have heard the Messenger of Allah (may peace be upon him) saying: The tale-bearer will not enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "30479",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5081",
      "hadith_no": "5081",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن إبراهيم، عن  همام بن الحارث، عن عدي بن حاتم، قال قلت يا رسول الله إني أرسل الكلاب المعلمة فيمسكن على وأذكر اسم الله عليه فقال ‏\"‏ إذا أرسلت كلبك المعلم وذكرت اسم الله عليه فكل ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ما لم يشركها كلب ليس معها ‏\"‏ ‏.‏ قلت له فإني أرمي بالمعراض الصيد فأصيب فقال ‏\"‏ إذا رميت بالمعراض فخزق فكله وإن أصابه بعرضه فلا تأكله ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported:                      I said: Messenger of Allah, I set off trained dogs and they catch for me (the game) and I recite the came of Allah over it (I slaughter the game by reciting Bismillah-i-Allah-o-Akbar), whereupon he said: When you set off your trained dogs and you recited the name of Allah (while setting them off), then eat (the game). I said: Even if them (the trained dogs) kill that (the game)? He (the Holy Prophet) said: Even if these kill, but (on the condition) that no other dog, which you did not set off (along with your dogs), participates (in catching the game). I said to him: I throw Mi'rad, a heavy featherless blunt arrow, for hunting and killing (the game). Thereupon he said: When you throw Mi'rad, and it pierces, then eat, but if it falls flatly (and beats the game to death), then do not eat that.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11051",
        "11400",
        "212"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7698",
      "hadith_no": "7698",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن منصور، عن إبراهيم، عن همام بن الحارث، أن رجلا، جعل يمدح عثمان فعمد المقداد فجثا على ركبتيه - وكان رجلا ضخما - فجعل يحثو في وجهه الحصباء فقال له عثمان ما شأنك فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم المداحين فاحثوا في وجوههم التراب ‏\"‏ ‏.‏",
      "text_en": " Hammam b. al-Harith reported that a person began to praise 'Uthman and Miqdad sat upon his knee; and he was a bulky person and began to throw pebbles upon his (flatterer's) face. Thereupon 'Uthman said:                      What is the matter with you? And he said: Verily, Allah's Messenger (may peace be upon him) said: When you see those who shower (undue) praise (upon others), throw dust upon their faces.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-371",
      "hadith_no": "371",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حفص بن عمر، عن شعبة، عن الحكم، عن إبراهيم، عن همام بن الحارث، أنه كان عند عائشة - رضى الله عنها - فاحتلم فأبصرته جارية لعائشة وهو يغسل أثر الجنابة من ثوبه أو يغسل ثوبه فأخبرت عائشة فقالت لقد رأيتني وأنا أفركه من ثوب رسول الله صلى الله عليه وسلم ‏.‏ قال أبو داود رواه الأعمش كما رواه الحكم ‏.‏",
      "text_en": " Hammam b. al-Harith reported, he has a sexual dream when he was staying with 'Aishah. The slave girl of 'Aishah saw him while he was washing the mark of defilement, or he was washing his clothe. She informed 'Aishah who said:                      He witnessed me rubbing off the semen from the clothe of the Messenger of Allah (ﷺ).Abu Dawud said: Al-A'mash narrated it as narrated by al-Hakam.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-93",
      "hadith_no": "93",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال بال جرير بن عبد الله ثم توضأ ومسح على خفيه فقيل له أتفعل هذا قال وما يمنعني وقد رأيت رسول الله صلى الله عليه وسلم يفعله ‏.‏ قال إبراهيم وكان يعجبهم حديث جرير لأن إسلامه كان بعد نزول المائدة ‏.‏ هذا قول إبراهيم يعني كان يعجبهم ‏.‏ قال وفي الباب عن عمر وعلي وحذيفة والمغيرة وبلال وسعد وأبي أيوب وسلمان وبريدة وعمرو بن أمية وأنس وسهل بن سعد ويعلى بن مرة وعبادة بن الصامت وأسامة بن شريك وأبي أمامة وجابر وأسامة بن زيد وابن عبادة ويقال ابن عمارة وأبى بن عمارة ‏.‏ قال أبو عيسى وحديث جرير حديث حسن صحيح ‏.‏",
      "text_en": " Hammam bin AI-Harith narrated:                     \"Jarir bin Abdullah urinated, then he performed Wudu, wiping over his Khuff. So he was asked, 'You do this?' He replied, 'What prevents me, when I have seen Allah's Messenger doing it?\" He [Ibrahim] said \"And they were impressed by the narration of Jarir since he accepted Islam after the revelation Sural Al-Ma'idah.\" [This is the saying of lbrahim, that is, \"They were impressed.\"] [He said:] There are narrations on this topic from Umar, Ali, Hudhaifah, AI-Mughirah, Bilil, Sa'd, Abu Ayyub, Salman, Buraidah, Amr bin Umayyah, Anas, Sahl bin Sa'd, Ya'la bin Murrah, Ubadah bin As-Samit, Usamah bin Shank, Abu Umamah, Jabir, Usamah bin Zaid, and Ibn Ubadah. They call him Ibn Imarah and Ubayy bin Imarah.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-116",
      "hadith_no": "116",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال ضاف عائشة ضيف فأمرت له بملحفة صفراء فنام فيها فاحتلم فاستحيا أن يرسل بها وبها أثر الاحتلام فغمسها في الماء ثم أرسل بها فقالت عائشة لم أفسد علينا ثوبنا إنما كان يكفيه أن يفركه بأصابعه وربما فركته من ثوب رسول الله صلى الله عليه وسلم بأصابعي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول غير واحد من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم من الفقهاء مثل سفيان الثوري والشافعي وأحمد وإسحاق قالوا في المني يصيب الثوب يجزئه الفرك وإن لم يغسل ‏.‏ وهكذا روي عن منصور عن إبراهيم عن همام بن الحارث عن عائشة مثل رواية الأعمش ‏.‏ وروى أبو معشر هذا الحديث عن إبراهيم عن الأسود عن عائشة وحديث الأعمش أصح ‏.‏",
      "text_en": " Hammam bin AI-Harith narrated:                     \"Aishah had a guest to whom she lent a yellow wrap for him to sleep in. He had a wet dream, and was too embarrassed to send it to her while the traces of the wet dream were present on it. So he submerged it (washing it) in water, then he sent it to her. Aishah said, \"Why did he ruin our garment? It would have been sufficient for him to scrape it off with his fingers. Sometimes I would scrape it off of the garment of Allah's Messenger with my fingers.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1465",
      "hadith_no": "1465",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا قبيصة، عن سفيان، عن منصور، عن إبراهيم، عن همام بن الحارث، عن عدي بن حاتم، قال قلت يا رسول الله إنا نرسل كلابا لنا معلمة ‏.‏ قال ‏\"‏ كل ما أمسكن عليك ‏\"‏ ‏.‏ قلت يا رسول الله وإن قتلن قال ‏\"‏ وإن قتلن ما لم يشركها كلب غيرها ‏\"‏ ‏.‏ قال قلت يا رسول الله إنا نرمي بالمعراض ‏.‏ قال ‏\"‏ ما خزق فكل وما أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I said: 'O Messenger of Allah! We send our trained dogs to catch game for us.' He said: 'Eat what it catches for you.' I said: 'O Messenger of Allah, and if they kill it?' He said: 'Even if they kill it, as long as they are not accompanied by some other dogs besides them.'\" He said: \"I said: 'O Messenger of Allah! We hunt with the Mir'ad.' He said: 'Eat of the game that the Mir'ad perces, but whatever is struck bu its broad side, then do not eat it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20351",
        "20012",
        "11067",
        "11051",
        "11400",
        "212"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2158",
      "hadith_no": "2158",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن منصور، عن إبراهيم، عن همام بن الحارث، قال مر رجل على حذيفة بن اليمان فقيل له إن هذا يبلغ الأمراء الحديث عن الناس ‏.‏ فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏ قال سفيان والقتات النمام ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Hammam bin Al-Harith said:                     \"Aman passed by Hudhaifah bin Al-Yaman and it was said to him: \"This person conveys news about the people to the leaders.' So Hudaifah said: 'The Messenger of Allah said: 'The Qatat shall not enter paradise.'\" (Sahih)Sufyan said: \"The Qatat is the Nammam.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11067",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-299",
      "hadith_no": "299",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز، قال حدثنا شعبة، قال الحكم أخبرني عن إبراهيم، عن همام بن الحارث، أن عائشة، قالت لقد رأيتني وما أزيد على أن أفركه من ثوب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Hammam bin Al-Harith that 'Aishah said:                      \"I remember when I could do no more than rub it form the garment of the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "11069",
        "11051",
        "11400",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4265",
      "hadith_no": "4265",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا أبو عبد الصمد عبد العزيز بن عبد الصمد، قال حدثنا منصور، عن إبراهيم، عن همام بن الحارث، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم فقال أرسل الكلب المعلم فيأخذ ‏.‏ فقال ‏\"‏ إذا أرسلت الكلب المعلم وذكرت اسم الله عليه فأخذ فكل ‏\"‏ ‏.‏ قلت وإن قتل قال ‏\"‏ وإن قتل ‏\"‏ ‏.‏ قلت أرمي بالمعراض ‏.‏ قال ‏\"‏ إذا أصاب بحده فكل وإذا أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " It was Narrated from 'Adiyy bin Hatim the he asked the Messenger of Allah :                     \"I release my trained dog and he catches (game).\" He said: \"If you release the trained dog and you say the name of Allah over him, and he catches (something), then eat.\" I said: \"Even if he kills it?\" He said: shoot with the Mirad.\" He said: \"If it hits (the game) with its sharp point, then eat, but if it hits it with its broad side, then do not eat\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20251",
        "11067",
        "11051",
        "11400",
        "212"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4267",
      "hadith_no": "4267",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن زنبور أبو صالح المكي، قال حدثنا فضيل بن عياض، عن منصور، عن إبراهيم، عن همام بن الحارث، عن عدي بن حاتم، قال قلت يا رسول الله أرسل كلابي المعلمة فيمسكن على فآكل قال ‏\"‏ إذا أرسلت كلابك المعلمة فأمسكن عليك فكل ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ‏\"‏ ‏.‏ قال ‏\"‏ ما لم يشركهن كلب من سواهن ‏\"‏ ‏.‏ قلت أرمي بالمعراض فيخزق ‏.‏ قال ‏\"‏ إن خزق فكل وإن أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I said: 'O Messenger of Allah, I release my trained dogs and they catch (game) for me; can I eat It? He said: 'When you release your trained dogs and they catch (game) for you, then eat.' I said: 'Even if they kill it.' He said: 'So long as no other dogs have joined them.\" I said: 'I shoot with the Mirad. And they penetrate (the game).' He said 'If they penetrate it, then eat, but if the broad said strikes it, then do not eat.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "20200",
        "11067",
        "11051",
        "11400",
        "212"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-580",
      "hadith_no": "580",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، ح وحدثنا محمد بن طريف، حدثنا عبدة بن سليمان، جميعا عن الأعمش، عن إبراهيم، عن همام بن الحارث، عن عائشة، قالت ربما فركته من ثوب رسول الله  صلى الله عليه وسلم  بيدي ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I often scraped it (semen) from the garment of the Messenger of Allah with my hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "30476",
        "20337",
        "11060",
        "11051",
        "11400",
        "53"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-581",
      "hadith_no": "581",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال نزل بعائشة ضيف فأمرت له بملحفة لها صفراء فاحتلم فيها فاستحيى أن يرسل بها وفيها أثر الاحتلام فغمسها في الماء ثم أرسل بها فقالت عائشة لم أفسدت علينا ثوبنا إنما كان يكفيك أن تفركه بإصبعك ربما فركته من ثوب رسول الله  صلى الله عليه وسلم  بإصبعي ‏.‏",
      "text_en": " Hammam bin Harith narrated:                     \"A guest came and stayed with 'Aishah, and she ordered that he be given a yellow blanket of hers. He had a nocturnal emission on it, and he felt too shy to send it back to send it back to her when it had the traces of that emission on it, so he dipped it in water and then sent it to her. 'Aishah said: 'Why did he spoil our garment? It would have been sufficient for him to scrape it off with his finger. I often scraped it (semen) from the garment of the Messenger of Allah with my finger.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20354",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-586",
      "hadith_no": "586",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال بال جرير بن عبد الله ثم توضأ ومسح على خفيه فقيل له أتفعل هذا قال وما يمنعني وقد رأيت رسول الله  صلى الله عليه وسلم  يفعله ‏.‏ قال إبراهيم كان يعجبهم حديث جرير لأن إسلامه كان بعد نزول المائدة ‏.‏",
      "text_en": " It was narrated that Hammam bin Harith said:                     \"Jarir bin 'Abdullah urinated, then he performed ablution and wiped over his leather socks. Someone asked him: 'Do you do this?' He said: 'Why shouldn't I? I saw the Messenger of Allah doing this.'\" Ibrahim (who narrated it from Hammam) said: \"They were pleased by the Hadith of Jarir because he accepted Islam after the revelation of Ma'idah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3336",
      "hadith_no": "3336",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عبد الله، حدثنا وكيع، عن أبيه، عن منصور، عن إبراهيم، عن همام بن الحارث النخعي، عن عدي بن حاتم، قال سألت رسول الله  صلى الله عليه وسلم  عن المعراض فقال ‏\"‏ لا تأكل إلا أن يخزق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Adi bit Hatim said:                      “I asked the Messenger ofAllah (ﷺ) about Mi’rad. He said: ‘Do not eat unless you pierce(thegame).’”",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20645",
        "11067",
        "11051",
        "11400",
        "212"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 19,
  "grade_display": {
    "en": "Follower (Tabi') [2nd Generation]",
    "ar": "تابعي [الجيل الثاني]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
  }
}