{
  "id": "11403",
  "name": "Waqdan Abu Ya'fur al-Abdi وقدان أبو يعفور العبدي",
  "full_name": "Waqdan Abu Ya'fur al-Abdi وقدان أبو يعفور العبدي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5175",
      "name": "Arfjh bin Shryh ( عرفجة بن شريح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15677",
      "name": "Abu Sadq al-Azdy al-Kwfy أبو صادق الأزدي الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-790",
      "hadith_no": "790",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن أبي يعفور، قال سمعت مصعب بن سعد، يقول صليت إلى جنب أبي فطبقت بين كفى ثم وضعتهما بين فخذى، فنهاني أبي وقال كنا نفعله فنهينا عنه، وأمرنا أن نضع أيدينا على الركب‏.‏",
      "text_en": " Narrated Mus`ab bin Sa`d:                     I offered prayer beside my father and approximated both my hands and placed them in between the knees. My father told me not to do so and said, \"We used to do the same but we were forbidden (by the Prophet) to do it and were ordered to place the hands on the knees.\"",
      "usc_msa_ref": "756",
      "chain": [
        "20296",
        "20020",
        "11403",
        "10556"
      ]
    },
    {
      "id": "sahih-bukhari-2024",
      "hadith_no": "2024",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أبي يعفور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم إذا دخل العشر شد مئزره، وأحيا ليله، وأيقظ أهله‏.‏",
      "text_en": " Narrated Aisha:                     With the start of the last ten days of Ramadan, the Prophet used to tighten his waist belt (i.e. work hard) and used to pray all the night, and used to keep his family awake for the prayers.",
      "usc_msa_ref": "241",
      "chain": [
        "30026",
        "20005",
        "11403",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5553",
      "hadith_no": "5553",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي يعفور، قال سمعت ابن أبي أوفى  رضى الله عنهما  قال غزونا مع النبي صلى الله عليه وسلم سبع غزوات أو ستا، كنا نأكل معه الجراد‏.‏ قال سفيان وأبو عوانة وإسرائيل عن أبي يعفور عن ابن أبي أوفى سبع غزوات‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We participated with the Prophet in six or seven Ghazawat, and we used to eat locusts with him.",
      "usc_msa_ref": "403",
      "chain": [
        "20296",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "id": "sahih-muslim-1222",
      "hadith_no": "1222",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو كامل الجحدري - واللفظ لقتيبة - قالا حدثنا أبو عوانة، عن أبي يعفور، عن مصعب بن سعد، قال صليت إلى جنب أبي قال وجعلت يدى بين ركبتى فقال لي أبي اضرب بكفيك على ركبتيك ‏.‏ قال ثم فعلت ذلك مرة أخرى فضرب يدى وقال إنا نهينا عن هذا وأمرنا أن نضرب بالأكف على الركب ‏.‏",
      "text_en": " Mus'ab b. Sa'd reported:                      I said prayer by the side of my father and placed my hands between my knees. My father said to me: Place your hands on your knees. I repeated that (the previous act) for the second time, and he struck at my hands and said: We have been forbidden to do so and have been commanded to place our palms on the knees.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30559",
        "20469",
        "11403",
        "10556"
      ]
    },
    {
      "id": "sahih-muslim-2844",
      "hadith_no": "2844",
      "source": "Sahih Muslim",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وابن أبي عمر، جميعا عن ابن عيينة، - قال إسحاق أخبرنا سفيان بن عيينة، - عن أبي يعفور، عن مسلم بن صبيح، عن مسروق، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم إذا دخل العشر أحيا الليل وأيقظ أهله وجد وشد المئزر ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that when the last ten nights began Allah's Messenger (may peace be upon him) kept awake at night (for prayer and devotion), wakened his family, and prepared himself to observe prayer (with more vigour).",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "30421",
        "20005",
        "30312",
        "20005",
        "11403",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-5157",
      "hadith_no": "5157",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا أبو عوانة، عن أبي يعفور، عن عبد الله بن، أبي أوفى قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد ‏.‏",
      "text_en": " Ibn Abu Aufa reported:                      We went on seven expeditions with Allah's Messenger (may peace be upon him) and ate locusts.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11403",
        "5115"
      ]
    },
    {
      "id": "sunan-abi-daud-867",
      "hadith_no": "867",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي يعفور، - قال أبو داود واسمه وقدان - عن مصعب بن سعد، قال صليت إلى جنب أبي فجعلت يدى بين ركبتى فنهاني عن ذلك، فعدت فقال لا تصنع هذا فإنا كنا نفعله فنهينا عن ذلك وأمرنا أن نضع أيدينا على الركب ‏.‏",
      "text_en": " Mus’ab b sa’d said:                      I prayed by the side of my father. I put both of my hands between  my knees(in bowing condition). He prohibited me from it. I then repeated; so he said: Do not do so, because we used to do so. But we were prohibited to do that, and commanded to put our hands on the knees.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11403",
        "10556"
      ]
    },
    {
      "id": "sunan-abi-daud-1376",
      "hadith_no": "1376",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي، وداود بن أمية، أن سفيان، أخبرهم عن أبي يعفور، - وقال داود عن ابن عبيد بن نسطاس، - عن أبي الضحى، عن مسروق، عن عائشة، أن النبي صلى الله عليه وسلم كان إذا دخل العشر أحيا الليل وشد المئزر وأيقظ أهله ‏.‏ قال أبو داود وأبو يعفور اسمه عبد الرحمن بن عبيد بن نسطاس ‏.‏",
      "text_en": " Narrated 'Aishah:                     When the last ten days of Ramadan came, the Prophet (ﷺ) kept vigil and prayed during the whole night, and tied the wrapper tightly, and awakened his family (to pray during the night).Abu Dawud said: The name of Abu Ya'fur is 'Abd al-Rahman b. 'Ubaid b. Nistas.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "38210",
        "20005",
        "11403",
        "11365",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3812",
      "hadith_no": "3812",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن أبي يعفور، قال سمعت ابن أبي أوفى، وسألته، عن الجراد، فقال غزوت مع رسول الله صلى الله عليه وسلم ست أو سبع غزوات فكنا نأكله معه ‏.‏",
      "text_en": " Abu Ya’fur said:                      I heard Ibn Abi Awfa say when I asked him about (eating) locusts: I went on six or seven expeditions along with the Messenger of Allah (ﷺ) and we ate them (locusts) along with him.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "id": "jami-al-tirmidhi-173",
      "hadith_no": "173",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا مروان بن معاوية الفزاري، عن أبي يعفور، عن الوليد بن العيزار، عن أبي عمرو الشيباني، أن رجلا، قال لابن مسعود أى العمل أفضل قال سألت عنه رسول الله صلى الله عليه وسلم فقال ‏\"‏ الصلاة على مواقيتها ‏\"‏ ‏.‏ قلت وماذا يا رسول الله قال ‏\"‏ وبر الوالدين ‏\"‏ ‏.‏ قلت وماذا يا رسول الله قال ‏\"‏ والجهاد في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وقد روى المسعودي وشعبة وسليمان هو أبو إسحاق الشيباني وغير واحد عن الوليد بن العيزار هذا الحديث ‏.‏",
      "text_en": " Abu Amr Ash-Shaibani narrated:                     \"A man said to Ibn Mas'ud: 'Which deed is most virtuous?' He said: 'I asked Allah's Messenger (that). He said: \"Salat at the beginning of its time.\" I asked him: \"What is after that O Messenger of Allah?\" He said: \"Being dutiful to one's parents.\" I said: \"What is after that [O Messenger of Allah]?\" He said: \"Jihad in the Way of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20201",
        "11403",
        "11663",
        "11343"
      ]
    },
    {
      "id": "jami-al-tirmidhi-259",
      "hadith_no": "259",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال سعد بن أبي وقاص كنا نفعل ذلك فنهينا عنه وأمرنا أن نضع الأكف على الركب ‏.‏ قال حدثنا قتيبة حدثنا أبو عوانة عن أبي يعفور عن مصعب بن سعد عن أبيه سعد بهذا ‏.‏ وأبو حميد الساعدي اسمه عبد الرحمن بن سعد بن المنذر ‏.‏ وأبو أسيد الساعدي اسمه مالك بن ربيعة ‏.‏ وأبو حصين اسمه عثمان بن عاصم الأسدي ‏.‏ وأبو عبد الرحمن السلمي اسمه عبد الله بن حبيب ‏.‏ وأبو يعفور عبد الرحمن بن عبيد بن نسطاس ‏.‏ وأبو يعفور العبدي اسمه واقد ويقال وقدان وهو الذي روى عن عبد الله بن أبي أوفى ‏.‏ وكلاهما من أهل الكوفة ‏.‏",
      "text_en": " Sa'd bin Abi Waqas said:                     \"We would do that, but then we were prohibited from it, and we were ordered to put our hands on our knees.\"",
      "usc_msa_ref": "",
      "chain": [
        "9",
        "30367",
        "20469",
        "11403",
        "10556"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1822",
      "hadith_no": "1822",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، والمؤمل، قالا حدثنا سفيان، عن أبي يعفور، عن ابن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد ‏.‏  قال أبو عيسى وروى شعبة، هذا الحديث عن أبي يعفور، عن ابن أبي أوفى، قال غزوت مع رسول الله صلى الله عليه وسلم غزوات نأكل الجراد ‏.‏ حدثنا بذلك محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة بهذا ‏.‏",
      "text_en": " Narrated Abu Ya'fur:                     That Ibn Abi Awfa said: \"We participated in seven military expeditions with the Messenger of Allah (ﷺ), (and) we ate locust.\"[Abu 'Eisa said:] Shu'bah reported this Hadith from Abu Ya'fur, from Ibn Awfa and said: \"We participated in military expeditions with the Messenger of Allah (ﷺ) (and) we ate locust.\"This was narrated to us by Muhammad bin Bash-shar (who said): \"Muhammad bin Ja'far narrated to us from Shu'bah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11403",
        "5115"
      ]
    },
    {
      "id": "sunan-an-nasai-1032",
      "hadith_no": "1032",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي يعفور، عن مصعب بن سعد، قال صليت إلى جنب أبي وجعلت يدى بين ركبتى فقال لي اضرب بكفيك على ركبتيك ‏.‏ قال ثم فعلت ذلك مرة أخرى فضرب يدي وقال إنا قد نهينا عن هذا وأمرنا أن نضرب بالأكف على الركب ‏.‏",
      "text_en": " It was narrated that Mus'ab bin Sa'd said:                     \"I prayed beside my father and I put my hands between my knees, and he told me: 'Put your hands on your knees.' Then I did that again and he struck my hands and said: 'We were forbidden to do that, and we were commanded to put our hands on our knees.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11403",
        "10556"
      ]
    },
    {
      "id": "sunan-an-nasai-1639",
      "hadith_no": "1639",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن أبي يعفور، عن مسلم، عن مسروق، قال قالت عائشة رضى الله عنها كان إذا دخلت العشر أحيا رسول الله صلى الله عليه وسلم الليل وأيقظ أهله وشد المئزر ‏.‏",
      "text_en": " It was narrated that Masruq said:                      \"Aishah may Allah (SWT) be pleased with her, said:' When the last ten nights of Ramadan began, the Messenger of Allah (ﷺ) stayed up at night (for prayer) and he woke his family up and tightened his waist-wrap.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11403",
        "20285",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4356",
      "hadith_no": "4356",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن أبي يعفور، سمع عبد الله بن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات فكنا نأكل الجراد ‏.‏",
      "text_en": " It was narrated from Abu Ya fur that he heard 'Abdullah bin Abi Awfa says:                     \"We went on seven campaigns with the Messenger of Allah and we used to eat locusts.\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20711",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "id": "sunan-an-nasai-4357",
      "hadith_no": "4357",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، عن سفيان، - وهو ابن عيينة - عن أبي يعفور، قال سألت عبد الله بن أبي أوفى عن قتل الجراد، فقال غزوت مع رسول الله صلى الله عليه وسلم ست غزوات نأكل الجراد ‏.‏",
      "text_en": " It was narrated that Abuy ya fur said:                     \"I asked 'Abdullah bin Abu Awfa about killing locusts and he said: I went on six campaigns with the Messenger of Allah hand we ate locusts.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11403",
        "5115"
      ]
    }
  ],
  "total_hadiths": 16
}