{
  "id": "11404",
  "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
  "full_name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Kufi",
      "'Abid"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "B.Taym",
        "ar": "B.Taym",
        "ckb": "B.Taym"
      },
      {
        "en": "al-Kufi",
        "ar": "al-Kufi",
        "ckb": "al-Kufi"
      },
      {
        "en": "'Abid",
        "ar": "'Abid",
        "ckb": "'Abid"
      }
    ]
  },
  "parents": [
    {
      "id": "15184",
      "name": "Sa'id bin Hyan al-Tymy سعيد بن حيان التيمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15184",
      "name": "Sa'id bin Hyan al-Tymy سعيد بن حيان التيمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10843",
      "name": "Yazid bin Hyan يزيد بن حيان",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11406",
      "name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "18455",
      "name": "al-Dhak bin al-Mndhr bin Jryr الضحاك بن المنذر بن جرير",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11179",
      "name": "'Ubaya bin Rafa' bin Rafi' عباية بن رفاعة بن رافع",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-50",
      "hadith_no": "50",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، أخبرنا أبو حيان التيمي، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم بارزا يوما للناس، فأتاه جبريل فقال ما الإيمان قال ‏\"‏ الإيمان أن تؤمن بالله وملائكته وبلقائه ورسله، وتؤمن بالبعث ‏\"‏‏.‏ قال ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به، وتقيم الصلاة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك ‏\"‏‏.‏ قال متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل، وسأخبرك عن أشراطها إذا ولدت الأمة ربها، وإذا تطاول رعاة الإبل البهم في البنيان، في خمس لا يعلمهن إلا الله ‏\"‏‏.‏ ثم تلا النبي صلى الله عليه وسلم ‏{‏إن الله عنده علم الساعة‏}‏ الآية‏.‏ ثم أدبر فقال ‏\"‏ ردوه ‏\"‏‏.‏ فلم يروا شيئا‏.‏ فقال ‏\"‏ هذا جبريل جاء يعلم الناس دينهم ‏\"‏‏.‏ قال أبو عبد الله جعل ذلك كله من الإيمان‏.‏",
      "text_en": "      Narrated Abu Huraira:                          One day while the Prophet was sitting in the company of some people,      (The angel) Gabriel came and asked, \"What is faith?\" Allah's Apostle      replied, 'Faith is to believe in Allah, His angels, (the) meeting with     Him, His Apostles, and to believe in Resurrection.\" Then he further      asked, \"What is Islam?\" Allah's Apostle replied, \"To worship Allah      Alone and none else, to offer prayers perfectly to pay the compulsory      charity (Zakat) and to observe fasts during the month of Ramadan.\"       Then he further asked, \"What is Ihsan (perfection)?\" Allah's Apostle      replied, \"To worship Allah as if you see Him, and if you cannot      achieve this state of devotion then you must consider that He is      looking at you.\" Then he further asked, \"When will the Hour be      established?\" Allah's Apostle replied, \"The answerer has no better      knowledge than the questioner. But I will inform you about its      portents.     1. When a slave (lady) gives birth to her master.     2. When the shepherds of black camels start boasting and competing      with others in the construction of higher buildings. And the Hour is      one of five things which nobody knows except Allah.     The Prophet then recited: \"Verily, with Allah (Alone) is the knowledge     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet      asked his companions to call him back, but they could not see him.      Then the Prophet said, \"That was Gabriel who came to teach the people      their religion.\" Abu 'Abdullah said: He (the Prophet) considered all      that as a part of faith.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20208",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1149",
      "hadith_no": "1149",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال لبلال عند صلاة الفجر ‏\"‏ يا بلال حدثني بأرجى عمل عملته في الإسلام، فإني سمعت دف نعليك بين يدى في الجنة ‏\"‏‏.‏ قال ما عملت عملا أرجى عندي أني لم أتطهر طهورا في ساعة ليل أو نهار إلا صليت بذلك الطهور ما كتب لي أن أصلي‏.‏ قال أبو عبد الله دف نعليك يعني تحريك‏.‏",
      "text_en": " Narrated Abu Huraira:                     At the time of the Fajr prayer the Prophet asked Bilal, \"Tell me of the best deed you did after embracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do anything worth mentioning except that whenever I performed ablution during the day or night, I prayed after that ablution as much as was written for me.\"",
      "usc_msa_ref": "250",
      "chain": [
        "30311",
        "20318",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2650",
      "hadith_no": "2650",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا أبو حيان التيمي، عن الشعبي، عن النعمان بن بشير  رضى الله عنهما  قال سألت أمي أبي بعض الموهبة لي من ماله، ثم بدا له فوهبها لي فقالت لا أرضى حتى تشهد النبي صلى الله عليه وسلم‏.‏ فأخذ بيدي وأنا غلام، فأتى بي النبي صلى الله عليه وسلم فقال إن أمه بنت رواحة سألتني بعض الموهبة لهذا، قال ‏\"‏ ألك ولد سواه ‏\"‏‏.‏ قال نعم‏.‏ قال فأراه قال ‏\"‏ لا تشهدني على جور ‏\"‏‏.‏ وقال أبو حريز عن الشعبي ‏\"‏ لا أشهد على جور ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     My mother asked my father to present me a gift from his property; and he gave it to me after some hesitation. My mother said that she would not be satisfied unless the Prophet was made a witness to it. I being a young boy, my father held me by the hand and took me to the Prophet . He said to the Prophet, \"His mother, bint Rawaha, requested me to give this boy a gift.\" The Prophet said, \"Do you have other sons besides him?\" He said, \"Yes.\" The Prophet said, \"Do not make me a witness for injustice.\" Narrated Ash-Shu`bi that the Prophet said, \"I will not become a witness for injustice.\"",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "20025",
        "11404",
        "11052",
        "274"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3073",
      "hadith_no": "3073",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن أبي حيان، قال حدثني أبو زرعة، قال حدثني أبو هريرة  رضى الله عنه  قال قام فينا النبي صلى الله عليه وسلم فذكر الغلول فعظمه وعظم أمره قال ‏\"‏ لا ألفين أحدكم يوم القيامة على رقبته شاة لها ثغاء على رقبته فرس له حمحمة يقول يا رسول الله، أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك‏.‏ وعلى رقبته بعير له رغاء، يقول يا رسول الله أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك‏.‏ وعلى رقبته صامت، فيقول يا رسول الله أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك‏.‏ أو على رقبته رقاع تخفق، فيقول يا رسول الله أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك ‏\"‏‏.‏ وقال أيوب عن أبي حيان فرس له حمحمة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet got up amongst us and mentioned Al Ghulul, emphasized its magnitude and declared that it was a great sin saying, \"Don't commit Ghulul for I should not like to see anyone amongst you on the Day of Ressurection, carrying over his neck a sheep that will be bleating, or carrying over his neck a horse that will be neighing. Such a man will be saying: 'O Allah's Apostle! Intercede with Allah for me,' and I will reply, 'I can't help you, for I have conveyed Allah's Message to you Nor should I like to see a man carrying over his neck, a camel that will be grunting. Such a man will say, 'O Allah's Apostle! Intercede with Allah for me, and I will say, 'I can't help you for I have conveyed Allah's Message to you,' or one carrying over his neck gold and silver and saying, 'O Allah's Apostle! Intercede with Allah for me,' and I will say, 'I can't help you for I have conveyed Allah's Message to you,' or one carrying clothes that will be fluttering, and the man will say, 'O Allah's Apostle! Intercede with Allah for me.' And I will say, 'I can't help you, for I have conveyed Allah's Message to you.\"",
      "usc_msa_ref": "307",
      "chain": [
        "30175",
        "20031",
        "11404",
        "30554",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3340",
      "hadith_no": "3340",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا محمد بن عبيد، حدثنا أبو حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في دعوة، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة وقال ‏\"‏ أنا سيد القوم يوم القيامة، هل تدرون بمن يجمع الله الأولين والآخرين في صعيد واحد فيبصرهم الناظر ويسمعهم الداعي، وتدنو منهم الشمس، فيقول بعض الناس ألا ترون إلى ما أنتم فيه، إلى ما بلغكم، ألا تنظرون إلى من يشفع لكم إلى ربكم فيقول بعض الناس أبوكم آدم، فيأتونه فيقولون يا آدم أنت أبو البشر، خلقك الله بيده ونفخ فيك من روحه، وأمر الملائكة فسجدوا لك، وأسكنك الجنة، ألا تشفع لنا إلى ربك ألا ترى ما نحن فيه وما بلغنا فيقول ربي غضب غضبا لم يغضب قبله مثله، ولا يغضب بعده مثله، ونهاني عن الشجرة فعصيته، نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى نوح‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى أهل الأرض، وسماك الله عبدا شكورا، أما ترى إلى ما نحن فيه ألا ترى إلى ما بلغنا ألا تشفع لنا إلى ربك فيقول ربي غضب اليوم غضبا لم يغضب قبله مثله، ولا يغضب بعده مثله، نفسي نفسي، ائتوا النبي صلى الله عليه وسلم، فيأتوني، فأسجد تحت العرش فيقال يا محمد ارفع رأسك واشفع تشفع، وسل تعطه ‏\"‏‏.‏ قال محمد بن عبيد لا أحفظ سائره‏.‏",
      "text_en": " Narrated Abu Huraira:                     We were in the company of the Prophet at a banquet and a cooked (mutton) forearm was set before him, and he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the Day of Resurrection. Do you know how Allah will gather all the first and the last (people) in one level place where an observer will be able to see (all) of them and they will be able to hear the announcer, and the sun will come near to them. Some People will say: Don't you see, in what condition you are and the state to which you have reached? Why don't you look for a person who can intercede for you with your Lord? Some people will say: Appeal to your father, Adam.' They will go to him and say: 'O Adam! You are the father of all mankind, and Allah created you with His Own Hands, and ordered the angels to prostrate for you, and made you live in Paradise. Will you not intercede for us with your Lord? Don't you see in what (miserable) state we are, and to what condition we have reached?' On that Adam will reply, 'My Lord is so angry as He has never been before and will never be in the future; (besides), He forbade me (to eat from) the tree, but I disobeyed (Him), (I am worried about) myself! Myself! Go to somebody else; go to Noah.' They will go to Noah and say; 'O Noah! You are the first amongst the messengers of Allah to the people of the earth, and Allah named you a thankful slave. Don't you see in what a (miserable) state we are and to what condition we have reached? Will you not intercede for us with your Lord? Noah will reply: 'Today my Lord has become so angry as he had never been before and will never be in the future Myself! Myself! Go to the Prophet (Muhammad). The people will come to me, and I will prostrate myself underneath Allah's Throne. Then I will be addressed: 'O Muhammad! Raise your head; intercede, for your intercession will be accepted, and ask (for anything). for you will be given. \"",
      "usc_msa_ref": "556",
      "chain": [
        "30311",
        "30213",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3361",
      "hadith_no": "3361",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن نصر، حدثنا أبو أسامة، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم يوما بلحم فقال ‏\"‏ إن الله يجمع يوم القيامة الأولين والآخرين في صعيد واحد، فيسمعهم الداعي، وينفدهم البصر، وتدنو الشمس منهم  فذكر حديث الشفاعة  فيأتون إبراهيم فيقولون أنت نبي الله وخليله من الأرض، اشفع لنا إلى ربك‏.‏ فيقول  فذكر كذباته  نفسي نفسي اذهبوا إلى موسى ‏\"‏‏.‏ تابعه أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     One day some meat was given to the Prophet and he said, \"On the Day of Resurrection Allah will gather all the first and the last (people) in one plain, and the voice of the announcer will reach all of them, and one will be able to see them all, and the sun will come closer to them.\" (The narrator then mentioned the narration of intercession): \"The people will go to Abraham and say: 'You are Allah's Prophet and His Khalil on the earth. Will you intercede for us with your Lord?' Abraham will then remember his lies and say: 'Myself! Myself! Go to Moses.\"",
      "usc_msa_ref": "581",
      "chain": [
        "30123",
        "20318",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4662",
      "hadith_no": "4662",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى، وابن، إدريس عن أبي حيان، عن الشعبي، عن ابن عمر، قال سمعت عمر  رضى الله عنه  على منبر النبي صلى الله عليه وسلم يقول أما بعد أيها الناس إنه نزل تحريم الخمر وهى من خمسة، من العنب والتمر والعسل والحنطة والشعير، والخمر ما خامر العقل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar while he was on the pulpit of the Prophet saying, \"Now then O people! The revelation about the prohibition of alcoholic drinks was revealed; and alcoholic drinks are extracted from five things: Grapes, dates, honey, wheat and barley. And the alcoholic drink is that which confuses and stupefies the mind.\"",
      "usc_msa_ref": "143",
      "chain": [
        "30021",
        "20347",
        "20102",
        "11404",
        "11052",
        "18",
        "3"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4759",
      "hadith_no": "4759",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا أبو حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة  رضى الله عنه  قال أتي رسول الله صلى الله عليه وسلم بلحم، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة ثم قال ‏\"‏ أنا سيد الناس يوم القيامة، وهل تدرون مم ذلك يجمع الناس الأولين والآخرين في صعيد واحد، يسمعهم الداعي، وينفذهم البصر، وتدنو الشمس، فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون فيقول الناس ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض عليكم بآدم فيأتون آدم عليه السلام فيقولون له أنت أبو البشر خلقك الله بيده‏.‏ ونفخ فيك من روحه، وأمر الملائكة فسجدوا لك، اشفع لنا إلى ربك، ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله، وإنه نهاني عن الشجرة فعصيته، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى نوح، فيأتون نوحا فيقولون يا نوح إنك أنت أول الرسل إلى أهل الأرض، وقد سماك الله عبدا شكورا اشفع لنا إلى ربك، ألا ترى إلى ما نحن فيه فيقول إن ربي عز وجل قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله، وإنه قد كانت لي دعوة دعوتها على قومي نفسي نفسي نفسي اذهبوا إلى غيري، اذهبوا إلى إبراهيم، فيأتون إبراهيم، فيقولون يا إبراهيم، أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله، وإني قد كنت كذبت ثلاث كذبات  فذكرهن أبو حيان في الحديث  نفسي نفسي نفسي، اذهبوا إلى غيري اذهبوا إلى موسى، فيأتون موسى، فيقولون يا موسى أنت رسول الله، فضلك الله برسالته وبكلامه على الناس، اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني قد قتلت نفسا لم أومر بقتلها، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى عيسى، فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه، وكلمت الناس في المهد صبيا اشفع لنا ألا ترى إلى ما نحن فيه فيقول عيسى إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله، ولن يغضب بعده مثله  ولم يذكر ذنبا  نفسي نفسي نفسي، اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتون محمدا صلى الله عليه وسلم فيقولون يا محمد أنت رسول الله وخاتم الأنبياء، وقد غفر الله لك ما تقدم من ذنبك وما تأخر، اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه فأنطلق فآتي تحت العرش، فأقع ساجدا لربي عز وجل ثم يفتح الله على من محامده وحسن الثناء عليه شيئا لم يفتحه على أحد قبلي ثم يقال يا محمد ارفع رأسك، سل تعطه، واشفع تشفع، فأرفع رأسي، فأقول أمتي يا رب، أمتي يا رب فيقال يا محمد أدخل من أمتك من لا حساب عليهم من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب، ثم قال والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وحمير، أو كما بين مكة وبصرى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some (cooked) meat was brought to Allah Apostle and the meat of a forearm was presented to him as he used to like it. He ate a morsel of it and said, \"I will be the chief of all the people on the Day of Resurrection. Do you know the reason for it? Allah will gather all the human being of early generations as well as late generation on one plain so that the announcer will be able to make them all-hear his voice and the watcher will be able to see all of them. The sun will come so close to the people that they will suffer such distress and trouble as they will not be able to bear or stand. Then the people will say, 'Don't you see to what state you have reached? Won't you look for someone who can intercede for you with your Lord' Some people will say to some others, 'Go to Adam.' So they will go to Adam and say to him. 'You are the father of mankind; Allah created you with His Own Hand, and breathed into you of His Spirit (meaning the spirit which he created for you); and ordered the angels to prostrate before you; so (please) intercede for us with your Lord. Don't you see in what state we are? Don't you see what condition we have reached?' Adam will say, 'Today my Lord has become angry as He has never become before, nor will ever become thereafter. He forbade me (to eat of the fruit of) the tree, but I disobeyed Him . Myself! Myself! Myself! (I am preoccuied with my own problems). Go to someone else; go to Noah.' So they will go to Noah and say (to him), 'O Noah! You are the first (of Allah's Messengers) to the people of the earth, and Allah has named you a thankful slave; please intercede for us with your Lord. Don't you see in what state we are?' He will say.' Today my Lord has become angry as He has never become nor will ever become thereafter. I had (in the world) the right to make one definitely accepted invocation, and I made it against my nation. Myself! Myself! Myself! Go to someone else; go to Abraham.' They will go to Abraham and say, 'O Abraham! You are Allah's Apostle and His Khalil from among the people of the earth; so please intercede for us with your Lord. Don't you see in what state we are?' He will say to them, 'My Lord has today become angry as He has never become before, nor will ever become thereafter. I had told three lies (Abu Haiyan (the sub-narrator) mentioned them in the Hadith) Myself! Myself! Myself! Go to someone else; go to Moses.' The people will then go to Moses and say, 'O Moses! You art Allah's Apostle and Allah gave you superiority above the others with this message and with His direct Talk to you; (please) intercede for us with your Lord Don't you see in what state we are?' Moses will say, 'My Lord has today become angry as He has never become before, nor will become thereafter, I killed a person whom I had not been ordered to kill. Myself! Myself! Myself! Go to someone else; go to Jesus.' So they will go to Jesus and say, 'O Jesus! You are Allah's Apostle and His Word which He sent to Mary, and a superior soul created by Him, and you talked to the people while still young in the cradle. Please intercede for us with your Lord. Don't you see in what state we are?' Jesus will say. 'My Lord has today become angry as He has never become before nor will ever become thereafter. Jesus will not mention any sin, but will say, 'Myself! Myself! Myself! Go to someone else; go to Muhammad.' So they will come to me and say, 'O Muhammad ! You are Allah's Apostle and the last of the prophets, and Allah forgave your early and late sins. (Please) intercede for us with your Lord. Don't you see in what state we are?\" The Prophet added, \"Then I will go beneath Allah's Throne and fall in prostration before my Lord. And then Allah will guide me to such praises and glorification to Him as He has never guided anybody else before me. Then it will be said, 'O Muhammad Raise your head. Ask, and it will be granted. Intercede and It (your intercession) will be accepted.' So I will raise my head and Say, 'My followers, O my Lord! My followers, O my Lord'. It will be said, 'O Muhammad! Let those of your followers who have no accounts, enter through such a gate of the gates of Paradise as lies on the right; and they will share the other gates with the people.\" The Prophet further said, \"By Him in Whose Hand my soul is, the distance between every two gate-posts of Paradise is like the distance between Mecca and Busra (in Sham).",
      "usc_msa_ref": "",
      "chain": [
        "30118",
        "20025",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4824",
      "hadith_no": "4824",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، عن جرير، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم كان يوما بارزا للناس إذ أتاه رجل يمشي فقال يا رسول الله ما الإيمان قال ‏\"‏ الإيمان أن تؤمن بالله وملائكته ورسله ولقائه وتؤمن بالبعث الآخر ‏\"‏‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال يا رسول الله، ما الإحسان قال ‏\"‏ الإحسان أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك ‏\"‏‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل، ولكن سأحدثك عن أشراطها إذا ولدت المرأة ربتها، فذاك من أشراطها، وإذا كان الحفاة العراة رءوس الناس فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏{‏إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام‏}‏ ‏\"‏‏.‏ ثم انصرف الرجل فقال ‏\"‏ ردوا على ‏\"‏‏.‏ فأخذوا ليردوا فلم يروا شيئا‏.‏ فقال ‏\"‏ هذا جبريل جاء ليعلم الناس دينهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     One day while Allah's Apostle was sitting with the people, a man came to him walking and said, \"O Allah's Apostle. What is Belief?\" The Prophet said, \"Belief is to believe in Allah, His Angels, His Books, His Apostles, and the meeting with Him, and to believe in the Resurrection.\" The man asked, \"O Allah's Apostle What is Islam?\" The Prophet replied, \"Islam is to worship Allah and not worship anything besides Him, to offer prayers perfectly, to pay the (compulsory) charity i.e. Zakat and to fast the month of Ramadan.\" The man again asked, \"O Allah's Apostle What is Ihsan (i.e. perfection or Benevolence)?\" The Prophet said, \"Ihsan is to worship Allah as if you see Him, and if you do not achieve this state of devotion, then (take it for granted that) Allah sees you.\" The man further asked, \"O Allah's Apostle When will the Hour be established?\" The Prophet replied, \"The one who is asked about it does not know more than the questioner does, but I will describe to you its portents. When the lady slave gives birth to her mistress, that will be of its portents; when the bare-footed naked people become the chiefs of the people, that will be of its portents. The Hour is one of five things which nobody knows except Allah. Verily, the knowledge of the Hour is with Allah (alone). He sends down the rain, and knows that which is in the wombs.\" (31.34) Then the man left. The Prophet said, \"Call him back to me.\" They went to call him back but could not see him. The Prophet said, \"That was Gabriel who came to teach the people their religion.\" (See Hadith No. 47 Vol 1)",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20028",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5640",
      "hadith_no": "5640",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن أبي حيان، حدثنا عامر، عن ابن عمر  رضى الله عنهما  قام عمر على المنبر فقال أما بعد نزل تحريم الخمر وهى من خمسة العنب والتمر والعسل والحنطة والشعير، والخمر ما خامر العقل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar stood up on the pulpit and said, \"Now then, prohibition of alcoholic drinks have been revealed, and these drinks are prepared from five things, i.e.. grapes, dates, honey, wheat or barley And an alcoholic drink is that, that disturbs the mind.",
      "usc_msa_ref": "487",
      "chain": [
        "30175",
        "20031",
        "11404",
        "11052",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5647",
      "hadith_no": "5647",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أحمد بن أبي رجاء، حدثنا يحيى، عن أبي حيان التيمي، عن الشعبي، عن ابن عمر  رضى الله عنهما  قال خطب عمر على منبر رسول الله صلى الله عليه وسلم فقال إنه قد نزل تحريم الخمر، وهى من خمسة أشياء العنب والتمر والحنطة والشعير والعسل، والخمر ما خامر العقل، وثلاث وددت أن رسول الله صلى الله عليه وسلم لم يفارقنا حتى يعهد إلينا عهدا الجد والكلالة وأبواب من أبواب الربا‏.‏ قال قلت يا أبا عمرو فشىء يصنع بالسند من الرز‏.‏ قال ذاك لم يكن على عهد النبي صلى الله عليه وسلم أو قال على عهد عمر‏.‏ وقال حجاج عن حماد عن أبي حيان مكان العنب الزبيب‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar delivered a sermon on the pulpit of Allah's Apostle, saying, \"Alcoholic drinks were prohibited by Divine Order, and these drinks used to be prepared from five things, i.e., grapes, dates, wheat, barley and honey. Alcoholic drink is that, that disturbs the mind.\" `Umar added, \"I wish Allah's Apostle had not left us before he had given us definite verdicts concerning three matters, i.e., how much a grandfather may inherit (of his grandson), the inheritance of Al-Kalala (the deceased person among whose heirs there is no father or son), and various types of Riba(1 ) (usury) .\"",
      "usc_msa_ref": "493",
      "chain": [
        "30300",
        "20031",
        "11404",
        "11052",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7423",
      "hadith_no": "7423",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "وحدثني إسحاق، أخبرنا عيسى، وابن، إدريس وابن أبي غنية عن أبي حيان، عن الشعبي، عن ابن عمر  رضى الله عنهما  قال سمعت عمر، على منبر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard `Umar (delivering a sermon) on the pulpit of the Prophet.",
      "usc_msa_ref": "437",
      "chain": [
        "30021",
        "20347",
        "20614",
        "11404",
        "11052",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-106",
      "hadith_no": "106",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال زهير حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يوما بارزا للناس فأتاه رجل فقال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتابه ولقائه ورسله وتؤمن بالبعث الآخر ‏\"‏ ‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤدي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها إذا ولدت الأمة ربها فذاك من أشراطها وإذا كانت العراة الحفاة رءوس الناس فذاك من أشراطها وإذا تطاول رعاء البهم في البنيان فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ ثم تلا صلى الله عليه وسلم ‏{‏ إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ ‏\"‏ ‏.‏ قال ثم أدبر الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوا على الرجل ‏\"‏ ‏.‏ فأخذوا ليردوه فلم يروا شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا جبريل جاء ليعلم الناس دينهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      One day the Messenger of Allah (may peace be upon him) appeared before the public that a man came to him and said: Prophet of Allah, (tell me) what is Iman. Upon this he (the Holy Prophet) replied: That you affirm your faith in Allah, His angels, His Books, His meeting, His Messengers and that you affirm your faith in the Resurrection hereafter. He (again) said: Messenger of Allah, (tell me) what does al-Islam signify. He (the Holy Prophet) replied: Al-Islam signifies that you worship Allah and do not associate anything with Him and you establish obligatory prayer and you pay the obligatory poor-rate (Zakat) and you observe the fast of Ramadan. He (the inquirer) again said: Messenger of Allah, what does al-Ihsan imply? He (the Holy Prophet) replied: That you worship Allah as if you are seeing Him, and in case you fail to see Him, then observe prayer (with this idea in your mind) that (at least) He is seeing you. He (the inquirer ) again said: Messenger of Allah, when would there be the hour (of Doom)? He (the Holy Prophet) replied: The one who is asked about it is no better informed than the inquirer. I, however, narrate some of its signs (and these are): when the slave-girl will give birth to he master, when the naked, barefooted would become the chiefs of the people - these are some of the signs of (Doom). (Moreover) when the shepherds of the black (camels) would exult themselves in buildings, this is one of the signs of (Doom). (Doom) is one of the five (happenings wrapped in the unseen) which no one knows but Allah. Then he (the Messenger of Allah) recited (the verse):\" Verily Allah! with Him alone is the knowledge of the hour and He it is Who sends (down the rain) and knows that which is in the wombs and no person knows whatsoever he shall earn tomorrow, and a person knows not in whatsoever land he shall die. Verily Allah is Knowing, Aware. He (the narrator, Abu Huraira) said: Then the person turned back and went away. The Messenger of Allah (may peace be upon him) said: Bring that man back to me. They (the Companions of the Holy Prophet present there) went to bring him back, but they saw nothing there. Upon this the Messenger of Allah remarked: he was Gabriel, who came to teach the people their religion.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20321",
        "20208",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-107",
      "hadith_no": "107",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، بهذا الإسناد مثله غير أن في روايته ‏\"‏ إذا ولدت الأمة بعلها ‏\"‏ يعني السراري ‏.‏",
      "text_en": " This hadith is narrated to us on the authority of Muhammad b. 'Abdullah b. Numair, on the authority of Muhammad b. Bishr, on the authority of Abd Hayyan al-Taymi with the exception that in this narration (instead of the words (Iza Waladat al'amah rabbaha), the words are (Iza Waladat al'amah Ba'laha), i, e, when slave-girl gives birth to her master.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11404"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-501",
      "hadith_no": "501",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واتفقا في سياق الحديث إلا ما يزيد أحدهما من الحرف بعد الحرف - قالا حدثنا محمد بن بشر حدثنا أبو حيان عن أبي زرعة عن أبي هريرة قال أتي رسول الله صلى الله عليه وسلم يوما بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها نهسة فقال ‏\"‏ أنا سيد الناس يوم القيامة وهل تدرون بم ذاك يجمع الله يوم القيامة الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس فيبلغ الناس من الغم والكرب ما لا يطيقون وما لا يحتملون فيقول بعض الناس لبعض ألا ترون ما أنتم فيه ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض ائتوا آدم ‏.‏ فيأتون آدم فيقولون يا آدم أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه نهاني عن الشجرة فعصيته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى الأرض وسماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كانت لي دعوة دعوت بها على قومي نفسي نفسي اذهبوا إلى إبراهيم صلى الله عليه وسلم ‏.‏ فيأتون إبراهيم فيقولون أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول لهم إبراهيم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولا يغضب بعده مثله ‏.‏ وذكر كذباته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقولون يا موسى أنت رسول الله فضلك الله برسالاته وبتكليمه على الناس اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم موسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قتلت نفسا لم أومر بقتلها نفسي نفسي اذهبوا إلى عيسى صلى الله عليه وسلم ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمت الناس في المهد وكلمة منه ألقاها إلى مريم وروح منه فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم عيسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله - ولم يذكر له ذنبا - نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتوني فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وغفر الله لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فأنطلق فآتي تحت العرش فأقع ساجدا لربي ثم يفتح الله على ويلهمني من محامده وحسن الثناء عليه شيئا لم يفتحه لأحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي أمتي ‏.‏ فيقال يا محمد أدخل الجنة من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة لكما بين مكة وهجر أو كما بين مكة وبصرى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Meat was one day brought to the Messenger of Allah (may peace be upon him) and a foreleg was offered to him, a part which he liked. He sliced with his teeth a piece out of it and said: I shall be the leader of mankind on the Day of Resurrection. Do you know why? Allah would gather in one plain the earlier and the later (of the human race) on the Day of Resurrection. Then the voice of the proclaimer would be heard by all of them and the eyesight would penetrate through all of them and the sun would come near. People would then experience a degree of anguish, anxiety and agony which they shall not be able to bear and they shall not be able to stand. Some people would say to the others: Don you see in which trouble you are? Don't you see what (misfortune) has overtaken you? Why don't you find one who should intercede for you with your Lord? Some would say to the others: Go to Adam. And they would go to Adam and say: O Adam, thou art the father of mankind. Allah created thee by His own Hand and breathed in thee of His spirit and ordered the angels to prostrate before thee. Intercede for us with thy Lord Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Adam would say: Verily, my Lord is angry, to an extent to which He had never been angry before nor would He be angry afterward. Verily, He forbade me (to go near) that tree and I disobeyed Him. I am concerned with my own self. Go to someone else; go to Noah. They would come to Noah and would say: O Noah, thou art the first of the Messengers (sent) on the earth (after Adam), and Allah named thee as a\" Grateful Servant,\" intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? He would say: Verily, my Lord is angry today as He had never been angry before, and would never be angry afterwards. There had emanated a curse from me with which I cursed my people. I am concerned with only myself, I am concerned only with myself; you better go to Ibrahim (peace be upon him). They would go to Ibrahim and say: Thou art the apostle of Allah and His Friend amongst the inhabitants of the earth; intercede for us with thy Lord. Don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? Ibrahim would say to them: Verily, my Lord is today angry as He had never been angry before and would never be angry afterwards. and (Ibrahim) would mention his lies (and then say): I am concerned only with myself, I am concerned only with myself. You better go to someone else: go to Moses. They would come to Moses (peace be upon him) and say: O Moses, thou art Allah's messenger, Allah blessed thee with His messengership and His conversation amongst people. Intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Moses (peace be upon him) would say to them: Verily. my Lord is angry as He had never been angry before and would never be angry afterwards. I, in fact, killed a person whom I had not been ordered to kill. I am concerned with myself, I am concerned with myself. You better go to Jesus (peace be upon him). They would come to Jesus and would say: O Jesus, thou art the messenger of Allah and thou conversed with people in the cradle, (thou art) His Word which I-Ie sent down upon Mary. and (thou art) the Spirit from Him; so intercede for us with thy Lord. Don't you see (the trouble) in which we are? Don't you see (the misfortune) that has overtaken us? Jesus (peace be upon him) would say: Verily, my Lord is angry today as He had never been angry before or would ever be angry afterwards. He mentioned no sin of his. (He simply said: ) I am concerned with myself, I am concerned with myself; you go to someone else: better go to Muhammad (may peace be upon him). They would come to me and say: O Mahammad, thou art the messenger of Allah and the last of the apostles. Allah has pardoned thee all thy previous and later sins. Intercede for us with thy Lord; don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? I shall then set off and come below the Throne and fall down prostrate before my Lord; then Allah would reveal to me and inspire me with some of His Praises and Glorifications which He had not revealed to anyone before me. He would then say: Muhammad, raise thy head; ask and it would be granted; intercede and intercession would be accepted I would then raise my head and say: O my Lord, my people, my people. It would be said: O Muhammad, bring in by the right gate of Paradise those of your people who would have no account to render. They would share with the people some other door besides this door. The Holy Prophet then said: By Him in Whose Hand is the life of Muhammad, verify the distance between two door leaves of the Paradise is as great as between Mecca and Hajar, or as between Mecca and Busra.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4268",
      "hadith_no": "4268",
      "source": "Sahih Muslim",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أبي حيان، عن الشعبي، عن النعمان بن بشير، ح. وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، عن الشعبي، حدثني النعمان بن بشير، أن أمه بنت رواحة، سألت أباه بعض الموهبة من ماله لابنها فالتوى بها سنة ثم بدا له فقالت لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم على ما وهبت لابني ‏.‏ فأخذ أبي بيدي وأنا يومئذ غلام فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أم هذا بنت رواحة أعجبها أن أشهدك على الذي وهبت لابنها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بشير ألك ولد سوى هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال ‏\"‏ أكلهم وهبت له مثل هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that his mother bint Rawaha asked his (Nu'man's) father about donating some gifts from his property to his son. He deferred the matter by one year, and then set forth to do that. She (Nu'man's mother) said:                      I shall not be pleased unless you call Allah's Messenger (may peace be upon him) as witness to what you confer as a gift on your son. (Nu'man said): So father took hold of my hand and I was at that time a boy, and came to Allah's Messenger (may peace be upon him). and said: Allah's Messenger, the mother of this son (of mine), daughter of Rawaha wishes that I should call you witness to what I confer as gift to her son. Allah's Messenger (may pease be upon him) said: Bashir, have you any other son besides this (son of yours)? He said: Yes. He (the Holy Prophet) said: Have you given gifts to all of them like this? He said: No. Thereupon he (the Holy Prophet) said: Then call me not as witness, for I cannot be witness to an injustice.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11404",
        "11052",
        "274",
        "20352",
        "11404",
        "11052",
        "274"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4839",
      "hadith_no": "4839",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن أبي حيان، عن أبي، زرعة عن أبي هريرة، قال قام فينا رسول الله صلى الله عليه وسلم ذات يوم فذكر الغلول فعظمه وعظم أمره ثم قال ‏\"‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته بعير له رغاء يقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته فرس له حمحمة فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته شاة لها ثغاء يقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته نفس لها صياح فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته رقاع تخفق فيقول يا رسول الله أغثني ‏.‏ فأقول لا أملك لك شيئا قد أبلغتك ‏.‏ لا ألفين أحدكم يجيء يوم القيامة على رقبته صامت فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      One day the Messenger of Allah (may peace be upon him) stood among us (to deliver a sermon). He talked about the misappropriation of booty, and declared it to be a serious matter and a grave sin. Then he said: I shouldn't find that any of you should come on the Day of Judgment with a growling camel mounted on his neck, and should appeal to me for help saying:\" Messenger of Allah, help me.\" and I should say: I have no authority to help you; I already communicated to you. I shouldn't find that any of you should come on the Day of Judgment with a bleating ewe mounted on his neck, and he should say to me:\" Messenger of Allah, help me,\" and I should say: I have no authority to help you; I conveyed to you. I shouldn't find that one of you should come on the Day of Judgment with a Person crying loudly mounted on his neck, and he should say to me:\" Messenger of Allah, help me,\" and I should say: I have no authority to help you; I conveyed to you. I shouldn't find that any one of you should come on the Day of Judgment with fluttering clothes wrapped round his neck and he should say to me:\" Messenger of Allah, help me,\" and I should say: I have no authority to help you; I conveyed to you. I shouldn't find that any of you should come on the Day of Judgment with a heap of gold and silver placed on his neck and he should say to me:\" Messenger of Allah, help me.\" and I should say: I have no authority to help you; I already conveyed to you (the warning from the Almighty).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4840",
      "hadith_no": "4840",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن أبي حيان، ح وحدثني زهير بن حرب، حدثنا جرير، عن أبي حيان، وعمارة بن القعقاع، جميعا عن أبي زرعة، عن أبي هريرة، بمثل حديث إسماعيل عن أبي حيان، ‏.‏",
      "text_en": " The above tradition has been narrated on the same authority through different chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11404",
        "30022",
        "4057",
        "11404",
        "11379",
        "11406"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6378",
      "hadith_no": "6378",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وشجاع بن مخلد، جميعا عن ابن علية، قال زهير حدثنا  إسماعيل بن إبراهيم، حدثني أبو حيان، حدثني يزيد بن حيان، قال انطلقت أنا وحصين، بن سبرة وعمر بن مسلم إلى زيد بن أرقم فلما جلسنا إليه قال له حصين لقد لقيت يا زيد خيرا كثيرا رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه وغزوت معه وصليت خلفه لقد لقيت يا زيد خيرا كثيرا حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم - قال - يا ابن أخي والله لقد كبرت سني وقدم عهدي ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا وما لا فلا تكلفونيه ‏.‏ ثم قال قام رسول الله صلى الله عليه وسلم يوما فينا خطيبا بماء يدعى خما بين مكة والمدينة فحمد الله وأثنى عليه ووعظ وذكر ثم قال ‏\"‏ أما بعد ألا أيها الناس فإنما أنا بشر يوشك أن يأتي رسول ربي فأجيب وأنا تارك فيكم ثقلين أولهما كتاب الله فيه الهدى والنور فخذوا بكتاب الله واستمسكوا به ‏\"‏ ‏.‏ فحث على كتاب الله ورغب فيه ثم قال ‏\"‏ وأهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي ‏\"‏ ‏.‏ فقال له حصين ومن أهل بيته يا زيد أليس نساؤه من أهل بيته قال نساؤه من أهل بيته ولكن أهل بيته من حرم الصدقة بعده ‏.‏ قال ومن هم قال هم آل علي وآل عقيل وآل جعفر وآل عباس ‏.‏ قال كل هؤلاء حرم الصدقة قال نعم ‏.‏",
      "text_en": " Yazid b. Hayyan reported, I went along with Husain b. Sabra and 'Umar b. Muslim to Zaid b. Arqam and, as we sat by his side, Husain said to him:                      Zaid. you have been able to acquire a great virtue that you saw Allah's Messenger (may peace be upon him) listened to his talk, fought by his side in (different) battles, offered prayer behind me. Zaid, you have in fact earned a great virtue. Zaid, narrate to us what you heard from Allah's Messenger (may peace be upon him). He said: I have grown old and have almost spent my age and I have forgotten some of the things which I remembered in connection with Allah's Messenger (may peace be upon him), so accept whatever I narrate to you, and which I do not narrate do not compel me to do that. He then said: One day Allah's Messenger (may peace be upon him) stood up to deliver sermon at a watering place known as Khumm situated between Mecca and Medina. He praised Allah, extolled Him and delivered the sermon and. exhorted (us) and said: Now to our purpose. O people, I am a human being. I am about to receive a messenger (the angel of death) from my Lord and I, in response to Allah's call, (would bid good-bye to you), but I am leaving among you two weighty things: the one being the Book of Allah in which there is right guidance and light, so hold fast to the Book of Allah and adhere to it. He exhorted (us) (to hold fast) to the Book of Allah and then said: The second are the members of my household I remind you (of your duties) to the members of my family. He (Husain) said to Zaid: Who are the members of his household? Aren't his wives the members of his family? Thereupon he said: His wives are the members of his family (but here) the members of his family are those for whom acceptance of Zakat is forbidden. And he said: Who are they? Thereupon he said: 'Ali and the offspring of 'Ali, 'Aqil and the offspring of 'Aqil and the offspring of Ja'far and the offspring of 'Abbas. Husain said: These are those for whom the acceptance of Zakat is forbidden. Zaid said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30506",
        "20208",
        "20321",
        "20208",
        "11404",
        "28642"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6478",
      "hadith_no": "6478",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد بن يعيش، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة، عن  أبي حيان، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا أبو حيان التيمي يحيى بن سعيد عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لبلال عند صلاة الغداة ‏\"‏ يا بلال حدثني بأرجى عمل عملته عندك في الإسلام منفعة فإني سمعت الليلة خشف نعليك بين يدى في الجنة ‏\"‏ ‏.‏ قال بلال ما عملت عملا في الإسلام أرجى عندي منفعة من أني لا أتطهر طهورا تاما في ساعة من ليل ولا نهار إلا صليت بذلك الطهور ما كتب الله لي أن أصلي ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said to Bilal:                      Bilal, narrate to me which act at the time of morning prayer you did in Islam for which you hope to receive good reward, for I heard during the night the sound of your steps before me in Paradise. Bilal said: I did not do any act in Islam for which I hope to get any benefit but this that when I perform complete ablution during the night or day I observe prayer with that purification what Allah has ordained for me to pray.",
      "usc_msa_ref": "",
      "chain": [
        "30469",
        "30216",
        "20318",
        "11404",
        "15184",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7570",
      "hadith_no": "7570",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن أبي حيان، عن أبي زرعة، عن عبد الله بن عمرو، قال حفظت من رسول الله صلى الله عليه وسلم حديثا لم أنسه بعد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى وأيهما ما كانت قبل صاحبتها فالأخرى على إثرها قريبا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Amr reported:                      I committed to memory a hadith from Allah's Messenger (may peace be upon him) and I did not forget it after I had heard Allah's Messenger (may peace be upon him) as saying: The first sign (nut of the signs of the appearance of the Dajjal) would be the appearance of the sun from the west, the appearance of the beast before the people in the forenoon and whkch of the two hap- pens first, the second one would follow immediately after that.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11404",
        "11406",
        "29"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7571",
      "hadith_no": "7571",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا أبو حيان، عن أبي زرعة، قال جلس إلى مروان بن الحكم بالمدينة ثلاثة نفر من المسلمين فسمعوه وهو، يحدث عن الآيات، أن أولها، خروجا الدجال فقال عبد الله بن عمرو لم يقل مروان شيئا قد حفظت من رسول الله صلى الله عليه وسلم حديثا لم أنسه بعد سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " Abu Zur'a reported that three persons amongst Muslims had been sitting in Medina in the presence of Marwan b. Hakam and they heard him narrate these signs from him and the first amongst them was the appearance of the Dajjal. 'Abdullah b. 'Amr reported that Marwin said nothing (particular in this connection). I, however, heard a hadith from Allah's Messenger (may peace be upon him) and I did not forget that after I had heard that from Allah's Apostle (may peace be upon him) and he reported a hadith like the foregoing.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11404",
        "11406"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7572",
      "hadith_no": "7572",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا سفيان، عن أبي حيان، عن أبي زرعة، قال تذاكروا الساعة عند مروان فقال عبد الله بن عمرو سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثل حديثهما ولم يذكر ضحى ‏.‏",
      "text_en": " Abu Zur'a reported that there was a discussion in the presence of Marwan about the Last Hour, and Abdullah b. 'Amr said:                      I heard Allah's Messenger (may peace be upon him) as saying. The rest of the hadith is the same, but there is no mention of forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11404",
        "11406"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7744",
      "hadith_no": "7744",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أبي حيان، عن الشعبي، عن ابن عمر، قال خطب عمر على منبر رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه ثم قال أما بعد ألا وإن الخمر نزل تحريمها يوم نزل وهى من خمسة أشياء من الحنطة والشعير والتمر والزبيب والعسل ‏.‏ والخمر ما خامر العقل وثلاثة أشياء وددت أيها الناس أن رسول الله صلى الله عليه وسلم كان عهد إلينا فيها الجد والكلالة وأبواب من أبواب الربا ‏.‏",
      "text_en": " Ibn 'Umar reported that Umar delivered a sermon on the pulpit of Allah's Messenger (may peace be upon him) and he praised Allah and lauded Him and then said:                      Now coming to the point. Behold I when the command pertaining to the prohibition of wine was revealed, it was prepared from five things: from wheat, barley, date, grape, honey; and wine is that which clouds the intellect; and O people, I wish Allah's Messenger (may peace be upon him) could have explained to us in (more) detail the laws pertaining to the inheritance of the grandfather, about one who dies leaving no issue, and some of the problems pertaining to interest.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11404",
        "11052",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7745",
      "hadith_no": "7745",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "وحدثنا أبو كريب، أخبرنا ابن إدريس، حدثنا أبو حيان، عن الشعبي، عن ابن، عمر قال سمعت عمر بن الخطاب، على منبر رسول الله صلى الله عليه وسلم يقول أما بعد أيها الناس فإنه نزل تحريم الخمر وهى من خمسة من العنب والتمر والعسل والحنطة والشعير والخمر ما خامر العقل وثلاث أيها الناس وددت أن رسول الله صلى الله عليه وسلم كان عهد إلينا فيهن عهدا ننتهي إليه الجد والكلالة وأبواب من أبواب الربا ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I heard 'Umar b. Khattab delivering sermon on the pulpit ol Allah's messenger (may peace be upon him) and saying': Now, coming to the point, O people, there was revealed (the command pertaining to the prohibition of wine) and it was prepared (at that time) out of five things: grape, date, honey, wheat, barley, and wine is that which clouds the intellect, and, O people, I wish Allah's Messenger (may peace be upon him) had explained to us in greater detail three things: the inheritance of the grandfather, of one who dies without leaving any issue, and some of the problems of interest.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20102",
        "11404",
        "11052",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1720",
      "hadith_no": "1720",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا خالد، عن أبي حيان التيمي، عن المنذر بن جرير، قال كنت مع جرير بالبوازيج فجاء الراعي بالبقر وفيها بقرة ليست منها فقال له جرير ما هذه قال لحقت بالبقر لا ندري لمن هي ‏.‏ فقال جرير أخرجوها فقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يأوي الضالة إلا ضال ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mundhir ibn Jarir:                     I accompanied Jarir at Bawazij. The shepherd brought the cows. Among them there was a cow that was not one of them. Jarir asked him: What is this? He replied: This was mixed with the cows and we do not know to whom it belongs. Jarir said: Take it out. I heard the Messenger of Allah (ﷺ) say: No one mixes a stray animal (with his animals) but a man who strays from right path.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20423",
        "11404",
        "10831"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2546",
      "hadith_no": "2546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا مروان بن معاوية، عن أبي حيان التيمي، حدثنا أبو زرعة، عن أبي هريرة، ‏:‏ أن رسول الله صلى الله عليه وسلم كان يسمي الأنثى من الخيل فرسا ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to name a mare a horse.",
      "usc_msa_ref": "",
      "chain": [
        "35154",
        "20201",
        "11404",
        "30554"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3383",
      "hadith_no": "3383",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سليمان المصيصي، حدثنا محمد بن الزبرقان، عن أبي حيان التيمي، عن أبيه، عن أبي هريرة، رفعه قال ‏\"‏ إن الله يقول أنا ثالث الشريكين، ما لم يخن أحدهما صاحبه فإذا خانه خرجت من بينهما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) having said: Allah, Most High, says: \"I make a third with two partners as long as one of them does not cheat the other, but when he cheats him, I depart from them.\"",
      "usc_msa_ref": "",
      "chain": [
        "20457",
        "11404",
        "15184"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3669",
      "hadith_no": "3669",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، حدثنا أبو حيان، حدثني الشعبي، عن ابن عمر، عن عمر، قال نزل تحريم الخمر يوم نزل وهي من خمسة أشياء من العنب والتمر والعسل والحنطة والشعير والخمر ما خامر العقل وثلاث وددت أن رسول الله صلى الله عليه وسلم لم يفارقنا حتى يعهد إلينا فيهن عهدا ننتهي إليه الجد والكلالة وأبواب من أبواب الربا ‏.‏",
      "text_en": " ’Umar said :                      The prohibition of wine came down when (the Quranic verse ) came down. It was  made from five thing namely, grapes, dates, honey, wheat ,barley. Wine is what infects (khamara) the mind. There are three things I wished that the prophet (ﷺ) would not leave us until he explained them fully to our satisfaction: (share of) grandfather, one who leaves  no  descendants or ascendants as hairs, and the details of usury.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20208",
        "11404",
        "11052",
        "18",
        "3"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4310",
      "hadith_no": "4310",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أبي حيان التيمي، عن أبي زرعة، قال جاء نفر إلى مروان بالمدينة فسمعوه يحدث في الآيات أن أولها الدجال قال فانصرفت إلى عبد الله بن عمرو فحدثته فقال عبد الله لم يقل شيئا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الآيات خروجا طلوع الشمس من مغربها أو الدابة على الناس ضحى فأيتهما كانت قبل صاحبتها فالأخرى على أثرها ‏\"‏ ‏.‏ قال عبد الله وكان يقرأ الكتب وأظن أولهما خروجا طلوع الشمس من مغربها ‏.‏",
      "text_en": " Abu zur’ah said:                      A group of people came to Marwan in Medina, and they heard him say that the first of the signs to appear would be the coming forth of the Dajjal (Antichirst). He said: I then went to Abd Allah b. ‘Amr and mentioned it to him. He did not say anything(reliable). I heard the Messenger of Allah (ﷺ) say: The first of the signs to appear will be the rising of the sun in its place of setting and the coming forth of the beast against mankind in the forenoon. Whichever of them comes first will soon be followed by the other. ’Abd Allah who used to read the scriptures (Torah, Gospel) said: I think the first of them will be the rising of the sun in its place of setting.",
      "usc_msa_ref": "",
      "chain": [
        "30180",
        "20208",
        "11404",
        "11406"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4524",
      "hadith_no": "4524",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا الحسن بن علي بن راشد، أخبرنا هشيم، عن أبي حيان التيمي، حدثنا عباية بن رفاعة، عن رافع بن خديج، قال أصبح رجل من الأنصار مقتولا بخيبر فانطلق أولياؤه إلى النبي صلى الله عليه وسلم فذكروا ذلك له فقال ‏\"‏ لكم شاهدان يشهدان على قتل صاحبكم ‏\"‏ ‏.‏ قالوا يا رسول الله لم يكن ثم أحد من المسلمين وإنما هم يهود وقد يجترئون على أعظم من هذا ‏.‏ قال ‏\"‏ فاختاروا منهم خمسين فاستحلفوهم ‏\"‏ ‏.‏ فأبوا فوداه النبي صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     A man of the Ansar was killed at Khaybar and his relatives went to the Prophet (ﷺ) and mentioned that to him. He asked: Have you two witnesses who can testify to the murderer of your friend? They replied: Messenger of Allah! there was not a single Muslim present, but only Jews who sometimes have the audacity to do even greater crimes than this. He said: Then choose fifty of them and demand that they take an oath; but they refused and the Prophet (ﷺ) paid the blood-wit himself.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20468",
        "11404",
        "11179",
        "1986"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4973",
      "hadith_no": "4973",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي حيان، عن يزيد بن حيان، عن زيد بن أرقم، أن النبي صلى الله عليه وسلم خطبهم فقال ‏\"‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Arqam said that the Prophet (May peace be upon him) addressed them, saying :                      To proceed (amma ba’d)",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11404",
        "28642",
        "384"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1837",
      "hadith_no": "1837",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن أبي حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها ‏.‏ قال وفي الباب عن ابن مسعود وعائشة وعبد الله بن جعفر وأبي عبيدة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حيان اسمه يحيى بن سعيد بن حيان وأبو زرعة بن عمرو بن جرير اسمه هرم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"Some meat was brought to the Prophet (ﷺ) and a foreleg was presented to him, and he used to like it, so he bit from it.\"He said: There are narrations on this topic from Ibn Mas'ud, 'Aishah, 'Abdullah bin Ja'far, and Abu 'Ubaidah.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Hayyan's (a narrator in the chain) name is Yahya bin Sa'eed bin Hayyan At-Taimi. Abu Zur'ah bin 'Amr bin Jarir's name is Harim.",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1874",
      "hadith_no": "1874",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا بذلك، أحمد بن منيع حدثنا عبد الله بن إدريس، عن أبي حيان التيمي، عن الشعبي، عن ابن عمر، عن عمر بن الخطاب، إن من الحنطة خمرا بهذا ‏.‏ وهذا أصح من حديث إبراهيم بن مهاجر ‏.‏ وقال علي بن المديني قال يحيى بن سعيد لم يكن إبراهيم بن مهاجر بالقوي في الحديث ‏.‏ وقد روي من غير وجه أيضا عن الشعبي عن النعمان بن بشير ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     \"Indeed Khamr comes from wheat.\"[After mentioning this, he said:] and this is more correct than the narration of Ibrahim bin Muhajir (no. 1872). 'Ali bin Al-Madini said: \"Yahya bin Sa'eed said: 'Ibrahim bin Al-Muhajir is not strong [in Hadith].'\" And it has also been reported through other rotes from Ash-Sha'bi, from An-Nu'man bin Bashir.",
      "usc_msa_ref": "",
      "chain": [
        "20102",
        "11404",
        "11052",
        "18",
        "3",
        "30026",
        "20031"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2621",
      "hadith_no": "2621",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "أخبرنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا أبو حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال أتي رسول الله صلى الله عليه وسلم بلحم فرفع إليه الذراع فأكله وكانت تعجبه فنهس منها نهسة ثم قال ‏\"‏ أنا سيد الناس يوم القيامة هل تدرون لم ذاك يجمع الله الناس الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس منهم فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون فيقول الناس بعضهم لبعض ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول الناس بعضهم لبعض عليكم بآدم ‏.‏ فيأتون آدم فيقولون أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم آدم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد نهاني عن الشجرة فعصيت نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى أهل الأرض وقد سماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم نوح إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كان لي دعوة دعوتها على قومي نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى إبراهيم ‏.‏ فيأتون إبراهيم فيقولون يا إبراهيم أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قد كذبت ثلاث كذبات فذكرهن أبو حيان في الحديث نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى فيقولون يا موسى أنت رسول الله فضلك الله برسالته وبكلامه على البشر اشفع لنا إلى ربك ألا ترى ما نحن فيه فيقول إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قد قتلت نفسا لم أومر بقتلها نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى عيسى ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه وكلمت الناس في المهد اشفع لنا إلى ربك ألا ترى ما نحن فيه فيقول عيسى إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله ولم يذكر ذنبا نفسي نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد ‏.‏ قال فيأتون محمدا فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وقد غفر لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه فأنطلق فآتي تحت العرش فأخر ساجدا لربي ثم يفتح الله على من محامده وحسن الثناء عليه شيئا لم يفتحه على أحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه واشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي يا رب أمتي يا رب أمتي ‏.‏ فيقول يا محمد أدخل من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب ثم قال والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وهجر وكما بين مكة وبصرى ‏\"‏ ‏.‏ وفي الباب عن أبي بكر الصديق وأنس وعقبة بن عامر وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حيان التيمي اسمه يحيى بن سعيد بن حيان كوفي وهو ثقة وأبو زرعة بن عمرو بن جرير اسمه هرم ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"\"Some meat was brought to the Prophet (s.a.w) and a foreleg was presented to him, and he used to like it, so he bit from it. Then he said: 'I will be the 'Leader' of the people on the Day of Resurrection. Do you know why that is? Allah will gather the people, the first and the last, on one level ground where they will (all) be able to hear a caller, and all of them will be visible, and the sun will be brought near such that the people will suffer distress and trouble that they cannot tolerate nor bear. Then some people will say: \"Don't you see the state you have reached? Why don't you look for a person who can intercede for you with your Lord? \" Some of them will say to others: \" You should go to Adam.\" So they will go to Adam and say, \"You are the father of all mankind, Allah created you with His Own Hands, and breathed into you from His spirit (which He creted for you) and ordered the angels to prostrate for you. Will you not intercede for us with your Lord? Don't you see what has happened to us? Don't you see the state we have reached?\" On that Adam will reply, \"Today my Lord has become angry such that He has never before been angry, and will never be thereafter. He forbade me (to eat from) the tree, but I disobeyed(Him), Myself! Myself! Myself! Go to somebody else; Go to Nuh.\" They will go to Nuh and say: \"O Nuh! You are the first among the Messengers to the people of the earth, and Allah named you a thankful slave. Will you not intercede for us with your Lord? Don't you see what has happened to us? Don't you see the state we have reached?\" Nuh will say to them : \"Today my Lord has become angry as He has never before been angry, and will never be thereafter. I had been given one supplication, and I supplicated against my own people. Myself! Myself! Myself! Go to someone else! Go to Ibrahim.\" They will go to Ibrahim and say: \"O Ibrahim! You are Allah's Prophet and His Khalil among the people of the earth, so intercede for us with your Lord, don't you see what hads happened to us?\" He will say: \"Today my Lord has become angry as He has never before been angry and will never be thereafter. Indeed I uttered three lies.\"- Abu Hayyyan (a narrator) mentioned them in his narration - \" Myself! Myself! Myself! Go to someone else! Go to Musa.\" So they will go to Musa and say: \"O Musa! You are the Messenger of Allah who Allah distinguished above the people with His Message and His Speech, intercede for us with your Lord. Don't you see what has happened to us?\" So he will say \"Today my Lord has become angry as He has never before been angry and will never be thereafter. Indeed I killed a person whom I was ordered not to kill. Myself! Myself! Myself! Go to someone else; Go to 'Eisa.\" They will go to 'Eisa and say: \"O 'Eisa ! You are the Messenger of Allah and His Word which He placed into Mariam, and a Spirit from Him, and you spoke to the people in the cradle. Intercede for us with your Lord. Don't you see what has happened to us?\" Then 'Eisa will say: \"Today my Lord has become angry as He has never before been angry and will never be thereafter.\" He will not mention a sin, but will say: \"Myself! Myself! Myself! Go to someone else! Go to Muhammad.\" He said: 'They will go to Muhammad(s.a.w) and they say: \"O Muhammad! You are the Messenger of Allah and the last of the Prophets, and your past and future sins have been pardoned. Will you not intercede for us with your Lord, don't you see what has happened to us?\" Then I will depart until I come to under the Throne to fall prostrating before my Lord. Then Allah will guide me to such praises and beautiful statements of glorification which He did not guide anyone to before me. Then He will say: \"O Muhammad! Raise your head. Ask,so that you may be granted and intercede so that your intercession may be accepted.\" I will raise my head and say: \"O Lord! My Ummah! O Lord! My Ummah! O Lord! My Ummah!\" He will say: \"O Muhammad! Let those of your Ummah who have no accounts enter the gate on the right among the gates of Paradise, and they shall share in the gates other than that with the people.'\" Then he (s.a.w) said: 'By the One in Whose Hand is my soul! What is between every two gate-posts in Paradise is as what is between Makkah and Hajar, and what is between Makkah and Busra.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4079",
      "hadith_no": "4079",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا أبو عتاب، سهل بن حماد حدثنا المختار بن نافع، حدثنا أبو حيان التيمي، عن أبيه، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رحم الله أبا بكر زوجني ابنته وحملني إلى دار الهجرة وأعتق بلالا من ماله رحم الله عمر يقول الحق وإن كان مرا تركه الحق وماله صديق رحم الله عثمان تستحييه الملائكة رحم الله عليا اللهم أدر الحق معه حيث دار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والمختار بن نافع شيخ بصري كثير الغرائب وأبو حيان التيمي اسمه يحيى بن سعيد بن حيان التيمي كوفي وهو ثقة ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     that the Messenger of Allah (ﷺ) said: \"May Allah have mercy upon Abu Bakr, he married me to his daughter, and he carried me to the land of Hijrah, and he freed Bilal with his wealth. May Allah have mercy upon 'Umar, he says the truth even if it is sour. The truth caused him to be left without a friend. May Allah have mercy upon 'Uthman, the angels are shy of him. May Allah have mercy upon 'Ali. O Allah! Place the truth with him wherever he turns.\"",
      "usc_msa_ref": "",
      "chain": [
        "15512",
        "11404",
        "15184",
        "5"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-3681",
      "hadith_no": "3681",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا أبو أسامة، قال حدثنا أبو حيان، عن الشعبي، قال حدثني النعمان بن بشير الأنصاري، أن أمه ابنة رواحة، سألت أباه بعض الموهبة من ماله لابنها فالتوى بها سنة ثم بدا له فوهبها له فقالت لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم ‏.‏ فقال يا رسول الله إن أم هذا ابنة رواحة قاتلتني على الذي وهبت له ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بشير ألك ولد سوى هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفكلهم وهبت لهم مثل الذي وهبت لابنك هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir Al-Ansari narrated that his mother, the daughter of Rawahah, asked his father to give some of his wealth to her son. He deferred that for a year, then he decided to give it to him. She said:                      \"I will not be pleased until you ask the Messenger of Allah to bear witness.\" He said: \"O Messenger of Allah, the mother of this boy, the daughter of Rawahah, insisted that I give a gift to him.\" The Messenger of Allah said: \"O Bashir, do you have any other children besides this one?\" He said: \"Yes.\" The Messenger of Allah said: \"Have you given all of them a gift like that which you have given to this son of yours?\" He said: \"No.\" The Messenger of Allah said: \"Then do not ask me to bear witness, for I will not bear witness to unfairness.\"",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "11404",
        "11052",
        "274"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3682",
      "hadith_no": "3682",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يعلى، قال حدثنا أبو حيان، عن الشعبي، عن النعمان، قال سألت أمي أبي بعض الموهبة فوهبها لي فقالت لا أرضى حتى أشهد رسول الله صلى الله عليه وسلم ‏.‏ قال فأخذ أبي بيدي وأنا غلام فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أم هذا ابنة رواحة طلبت مني بعض الموهبة وقد أعجبها أن أشهدك على ذلك ‏.‏ قال ‏\"‏ يا بشير ألك ابن غير هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فوهبت له مثل ما وهبت لهذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man said:                      \"My mother asked my father for a gift and he gave it to me. She said: 'I will not be contented until you ask the Messenger of Allah to bear witness.' So my father took me by the hand, as I was still a boy, and went to the Messenger of Allah. He said: 'O Messenger of Allah, the mother of this boy, the daughter of Rawahah, asked me for a gift, and she wanted me to ask you to bear witness to that.' He said: 'O Bashir, do you have any other child apart from this one?' He said: 'Yes.' He said: 'Have you given him gifts like that which you have given to this one?' He said: 'No.' He said: 'Then do not ask me to bear witness, for I will not bear witness to unfairness.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20372",
        "11404",
        "11052",
        "274"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5578",
      "hadith_no": "5578",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، قال حدثنا أبو حيان، قال حدثنا الشعبي، عن ابن عمر، قال سمعت عمر، رضى الله عنه يخطب على منبر المدينة فقال أيها الناس ألا إنه نزل تحريم الخمر يوم نزل وهي من خمسة من العنب والتمر والعسل والحنطة والشعير والخمر ما خامر العقل ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I heard 'Umar, may Allah be pleased with him, delivering a Khutbah on the Minbar of Al-Madinah and he said: 'O people, on the day that the prohibition of Khamr was revealed, it was made from five things: From grapes, dates, honey, wheat and barley. Khamr is that which overcomes the mind.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20208",
        "11404",
        "11052",
        "18",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5579",
      "hadith_no": "5579",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن العلاء، قال أنبأنا ابن إدريس، عن زكريا، وأبي، حيان عن الشعبي، عن ابن عمر، قال سمعت عمر بن الخطاب، رضى الله عنه على منبر رسول الله صلى الله عليه وسلم يقول أما بعد فإن الخمر نزل تحريمها وهي من خمسة من العنب والحنطة والشعير والتمر والعسل ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I heard 'Umar bin Al-Khattab, may Allah be pleased with him, on the Minbar of the Messenger of Allah [SAW], say: 'The prohibition of Khamr was revealed when it was made from five things: From grapes, wheat, barley, dates and honey.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20102",
        "11338",
        "11404",
        "11052",
        "18",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-67",
      "hadith_no": "67",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن أبي حيان، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  يوما بارزا للناس ‏.‏ فأتاه رجل فقال يا رسول الله ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله ولقائه وتؤمن بالبعث الآخر ‏\"‏ ‏.‏ قال يا رسول الله ما الإسلام قال ‏\"‏ أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة المكتوبة وتؤتي الزكاة المفروضة وتصوم رمضان ‏\"‏ ‏.‏ قال يا رسول الله ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لا تراه فإنه يراك ‏\"‏ ‏.‏ قال يا رسول الله متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأحدثك عن أشراطها إذا ولدت الأمة ربتها فذلك من أشراطها وإذا تطاول رعاء الغنم في البنيان فذلك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ فتلا رسول الله  صلى الله عليه وسلم  {إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأى أرض تموت إن الله عليم خبير‏}‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"One day the Prophet (ﷺ) appeared among the people. A man came to him and said: 'O messenger of Allah, what is Iman (faith)?'  He said: 'To believe in Allah, His angels, His books, His Messengers and the meeting with, and to believe in the Final Resurrection.' He said: 'O Messenger of Allah, what is Islam?' He said: 'To worship Allah (alone) and not to associate anything with Him; to establish the prescribed prayers, to pay the obligatory Zakat, and to fast Ramadan.' He said: 'O Messenger of Allah, what is Ihsan?  He said: 'To worship Allah as if you see Him, for even though you do not see Him, He sees you.' He said: \"O Messenger of Allah, when will the Hour be?' He said: 'The one who is being asked about it does not know more than the one who is asking. But I will tell you about its signs. When the slave woman gives birth to her mistress that is one of its signs. When the shepherds compete in constructing tall buildings that is one of its signs. And there are five things which no one knows except Allah.' Then the Messenger of Allah (ﷺ) recited the Verse: \"Verily, Allah, with Him (Alone) is the knowledge of the Hour, He sends down the rain, and knows that which is in the wombs. No person knows what he will earn tomorrow, and no person knows in what land he will die. Verily, Allah is All-Knower, All-Aware (of things).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2599",
      "hadith_no": "2599",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا أبو حيان التيمي، حدثنا الضحاك، خال المنذر بن جرير عن المنذر بن جرير، قال كنت مع أبي بالبوازيج فراحت البقر فرأى بقرة أنكرها فقال ما هذه قالوا بقرة لحقت بالبقر ‏.‏ قال فأمر بها فطردت حتى توارت ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يئوي الضالة إلا ضال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mundhir bin Jarir said:                     “I was with my father in Bawazij and the cows came back in the evening. He saw a cow did not recognize it. He said: 'What is this?' He said: 'A cow that joined the herd.' And he issued orders that it be driven away until it disappeared from view. Then he said: 'I heard the Messenger of Allah (ﷺ) say: “No one gives refuge to a stray animal but one who is also astray.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11404",
        "10831"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3432",
      "hadith_no": "3432",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، ح وحدثنا علي بن محمد، حدثنا محمد بن فضيل، قالا حدثنا أبو حيان التيمي، عن أبي زرعة، عن أبي هريرة، قال أتي رسول الله  صلى الله عليه وسلم  ذات يوم بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “One day some meat wasbrought tothe Messenger of Allah (ﷺ) and the foreleg was offered tohim whichhe liked, so he bit it with his front teeth.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "38409",
        "20356",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4180",
      "hadith_no": "4180",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن أبي حيان، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  يوما بارزا للناس فأتاه رجل فقال يا رسول الله متى الساعة فقال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن سأخبرك عن أشراطها إذا ولدت الأمة ربتها فذاك من أشراطها وإذا كانت الحفاة العراة رءوس الناس فذاك من أشراطها وإذا تطاول رعاء الغنم في البنيان فذاك من أشراطها في خمس لا يعلمهن إلا الله ‏\"‏ ‏.‏ فتلا رسول الله  صلى الله عليه وسلم  ‏{إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام}‏ الآية ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      “The Messenger of Allah(ﷺ)came out one day to the people, and a man came to him and said:‘OMessenger of Allah, when will the Hour be?’ He said: ‘Theone who isasked about it does not know more than the one who isasking. But Iwill tell you of its portents. When the slave womangives birth to hermistress, that is one of its portents. When thebarefoot and nakedbecome leaders of the people, that is one of itsportents. Whenshepherds compete in constructing buildings, that isone of itsportents. (The Hour) is one of five (things) which no oneknows exceptAllah.’ Then the Messenger of Allah (ﷺ) recited thewords: “Verily,Allah, with Him (alone) is the knowledge of theHour, He sends downthe rain, and knows that which is in the wombs.(to the end of theVerse).”[31:34]",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4207",
      "hadith_no": "4207",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبي حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى ‏\"‏ ‏.‏ قال عبد الله فأيتهما ما خرجت قبل الأخرى فالأخرى منها قريب ‏.‏ قال عبد الله ولا أظنها إلا طلوع الشمس من مغربها ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Amr that the Messenger ofAllah (ﷺ) said:                      “The first signs to appear will be at the risingof the sun from the west and the emergence of the Beast to thepeople, at forenoon.’”'Abdullah said: \"Whichever of them appears first, the other will come soon after.\" 'Abdullah said: \"I do not think it will be anything other than the sun rising from the west.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11404",
        "11406",
        "29"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 45,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}