{
  "id": "11401",
  "name": "Wasl bin Hyan al-Ahdb واصل بن حيان الأحدب الأسدي",
  "full_name": "Wasl bin Hyan al-Ahdb واصل بن حيان الأحدب الأسدي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "B.Asad",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11397",
      "name": "al-Ma'rur bin Suwayd al-Asadi المعرور بن سويد الأسدي أبو أمية الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5231",
      "name": "Qabisa bin Barma al-Asadi ( قبيصة بن برمة الأسدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10787",
      "name": "'Abdullah bin Abi al-Hadhayl عبد الله بن أبي الهذيل",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10792",
      "name": "'Abdul Malik bin Sa'id عبد الملك بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "30",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن واصل الأحدب، عن المعرور، قال لقيت أبا ذر بالربذة، وعليه حلة، وعلى غلامه حلة، فسألته عن ذلك، فقال إني ساببت رجلا، فعيرته بأمه، فقال لي النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر أعيرته بأمه إنك امرؤ فيك جاهلية، إخوانكم خولكم، جعلهم الله تحت أيديكم، فمن كان أخوه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا تكلفوهم ما يغلبهم، فإن كلفتموهم فأعينوهم ‏\"‏‏.‏",
      "text_en": "      Narrated Al-Ma'rur:                          At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave,      too, was wearing a similar one. I asked about the reason for it. He      replied, \"I abused a person by calling his mother with bad names.\" The     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his      mother with bad names You still have some characteristics of      ignorance. Your slaves are your brothers and Allah has put them under      your command. So whoever has a brother under his command should feed      him of what he eats and dress him of what he wears. Do not ask them      (slaves) to do things beyond their capacity (power) and if you do so,      then help them.' \"",
      "chain": [
        "20193",
        "20020",
        "11401",
        "11397"
      ]
    },
    {
      "hadith_no": "389",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "أخبرنا الصلت بن محمد، أخبرنا مهدي، عن واصل، عن أبي وائل، عن حذيفة، رأى رجلا لا يتم ركوعه ولا سجوده، فلما قضى صلاته قال له حذيفة ما صليت  قال وأحسبه قال  لو مت مت على غير سنة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa that he saw a person bowing and prostrating imperfectly. When he finished his Salat, Hudhaifa told him that he had not offered Salat. The subnarrator added, \"I think that Hudhaifa also said:                      Were you to die you would die on a \"Sunna\" (legal way) other than that of Muhammad ().\"",
      "chain": [
        "30140",
        "11307",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "808",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا الصلت بن محمد، قال حدثنا مهدي، عن واصل، عن أبي وائل، عن حذيفة، رأى رجلا لا يتم ركوعه ولا سجوده، فلما قضى صلاته قال له حذيفة ما صليت  قال وأحسبه قال  ولو مت مت على غير سنة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Wail:                     Hudhaifa said, \"I saw a person not performing his bowing and prostrations perfectly. When he completed the prayer, I told him that he had not prayed.\" I think that Hudhaifa added (i.e. said to the man), \"Had you died, you would have died on a tradition other than that of the Prophet Muhammad.\"",
      "chain": [
        "30140",
        "11307",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "1237",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا مهدي بن ميمون، حدثنا واصل الأحدب، عن المعرور بن سويد، عن أبي ذر  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني آت من ربي فأخبرني  أو قال بشرني  أنه من مات من أمتي لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Allah's Apostle said, \"Someone came to me from my Lord and gave me the news (or good tidings) that if any of my followers dies worshipping none (in any way) along with Allah, he will enter Paradise.\" I asked, \"Even if he committed illegal sexual intercourse (adultery) and theft?\" He replied, \"Even if he committed illegal sexual intercourse (adultery) and theft.\"",
      "chain": [
        "20040",
        "11307",
        "11401",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا واصل الأحدب، عن أبي وائل، قال جئت إلى شيبة‏.‏ وحدثنا قبيصة، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست مع شيبة على الكرسي في الكعبة فقال لقد جلس هذا المجلس عمر  رضى الله عنه  فقال لقد هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمته‏.‏ قلت إن صاحبيك لم يفعلا‏.‏ قال هما المرآن أقتدي بهما‏.‏",
      "text_en": " Narrated Abu Wail:                     (One day) I sat along with Shaiba on the chair inside the Ka`ba. He (Shaiba) said, \"No doubt, `Umar sat at this place and said, 'I intended not to leave any yellow (i.e. gold) or white (i.e. silver) (inside the Ka`ba) undistributed.' I said (to `Umar), 'But your two companions (i.e. The Prophet and Abu Bakr) did not do so.' `Umar said, They are the two persons whom I always follow.' \"",
      "chain": [
        "30143",
        "20226",
        "20012",
        "11401",
        "11353",
        "20351",
        "20012",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "2545",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا واصل الأحدب، قال سمعت المعرور بن سويد، قال رأيت أبا ذر الغفاري  رضى الله عنه  وعليه حلة وعلى غلامه حلة فسألناه عن ذلك فقال إني ساببت رجلا فشكاني إلى النبي صلى الله عليه وسلم، فقال لي النبي صلى الله عليه وسلم ‏\"‏ أعيرته بأمه ‏\"‏‏.‏ ثم قال ‏\"‏ إن إخوانكم خولكم جعلهم الله تحت أيديكم، فمن كان أخوه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا تكلفوهم ما يغلبهم، فإن كلفتموهم ما يغلبهم فأعينوهم ‏\"‏‏.‏",
      "text_en": " Narrated Al-Ma'rur bin Suwaid:                     I saw Abu Dhar Al-Ghifari wearing a cloak, and his slave, too, was wearing a cloak. We asked him about that (i.e. how both were wearing similar cloaks). He replied, \"Once I abused a man and he complained of me to the Prophet . The Prophet asked me, 'Did you abuse him by slighting his mother?' He added, 'Your slaves are your brethren upon whom Allah has given you authority. So, if one has one's brethren under one's control, one should feed them with the like of what one eats and clothe them with the like of what one wears. You should not overburden them with what they cannot bear, and if you do so, help them (in their hard job).",
      "chain": [
        "20404",
        "20020",
        "11401",
        "11397"
      ]
    },
    {
      "hadith_no": "4808",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني منصور، وسليمان، عن أبي وائل، عن أبي ميسرة، عن عبد الله،‏.‏ قال وحدثني واصل، عن أبي وائل، عن عبد الله  رضى الله عنه  قال سألت  أو سئل رسول الله صلى الله عليه وسلم  أى الذنب عند الله أكبر قال ‏\"‏ أن تجعل لله ندا وهو خلقك ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ ثم أن تقتل ولدك خشية أن يطعم معك‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ أن تزاني بحليلة جارك ‏\"‏‏.‏ قال ونزلت هذه الآية تصديقا لقول رسول الله صلى الله عليه وسلم ‏{‏والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق‏}‏",
      "text_en": " Narrated `Abdullah:                     I or somebody, asked Allah's Apostle \"Which is the biggest sin in the Sight of Allah?\" He said, \"That you set up a rival (in worship) to Allah though He Alone created you.\" I asked, \"What is next?\" He said, \"Then, that you kill your son, being afraid that he may share your meals with you.\" I asked, \"What is next?\" He said, \"That you commit illegal sexual intercourse with the wife of your neighbor.\" Then the following Verse was revealed to confirm the statement of Allah's Apostle: \"Those who invoke not with Allah, any other god, nor kill life as Allah has forbidden except for just cause, nor commit illegal sexual intercourse.\" (25.68)",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11067",
        "11005",
        "11353",
        "11644",
        "11401",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5097",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو النعمان، حدثنا مهدي بن ميمون، حدثنا واصل، عن أبي وائل، عن عبد الله، قال غدونا على عبد الله فقال رجل قرأت المفصل البارحة‏.‏ فقال هذا كهذ الشعر، إنا قد سمعنا القراءة وإني لأحفظ القرناء التي كان يقرأ بهن النبي صلى الله عليه وسلم ثماني عشرة سورة من المفصل وسورتين من آل حم‏.‏",
      "text_en": " Narrated Abu Wail:                     We went to `Abdullah in the morning and a man said, \"Yesterday I recited all the Mufassal Suras.\" On that `Abdullah said, \"That is very quick, and we have the (Prophet's) recitation, and I remember very well the recitation of those Suras which the Prophet used to recite, and they were eighteen Suras from the Mufassal, and two Suras from the Suras that start with Ha Mim.",
      "chain": [
        "20283",
        "11307",
        "11401",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6900",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "قال يحيى وحدثنا سفيان، حدثني واصل، عن أبي وائل، عن عبد الله، قلت يا رسول الله، مثله، قال عمرو فذكرته لعبد الرحمن وكان حدثنا عن سفيان عن الأعمش ومنصور وواصل عن أبي وائل عن أبي ميسرة قال دعه دعه‏.‏",
      "text_en": "",
      "chain": [
        "30020",
        "20005",
        "11401",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7153",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد، حدثنا غندر، حدثنا شعبة، عن واصل، عن أبي وائل، عن عبد الله، وأحسبه، رفعه قال ‏\"‏ بين يدى الساعة أيام الهرج، يزول العلم، ويظهر فيها الجهل ‏\"‏‏.‏ قال أبو موسى والهرج القتل بلسان الحبشة‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Near the establishment of the Hour, there will be the days of Al-Harj, and the religious knowledge will be taken away (vanish i.e. by the death of Religious scholars) and general ignorance will spread.\" Abu Musa said, \"Al-Harj, in the Ethiopian language, means killing,\" Ibn Mas`ud added: I heard Allah's Apostle saying; (It will be) from among the most wicked people who will be living at the time when the Hour will be established.\"",
      "chain": [
        "30213",
        "20278",
        "20020",
        "11401",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7198",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن واصل الأحدب، عن أبي وائل، عن حذيفة بن اليمان، قال إن المنافقين اليوم شر منهم على عهد النبي صلى الله عليه وسلم كانوا يومئذ يسرون واليوم يجهرون‏.‏",
      "text_en": " Narrated Abi Waih:                     Hudhaifa bin Al-Yaman said, 'The hypocrites of today are worse than those of the lifetime of the Prophet, because in those days they used to do evil deeds secretly but today they do such deeds openly.'",
      "chain": [
        "20404",
        "20020",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7361",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست إلى شيبة في هذا المسجد قال جلس إلى عمر في مجلسك هذا فقال هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمتها بين المسلمين‏.‏ قلت ما أنت بفاعل‏.‏ قال لم‏.‏ قلت لم يفعله صاحباك قال هما المرآن يقتدى بهما‏.‏",
      "text_en": " Narrated Abu Wail:                     I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar once sat beside me here as you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the Ka`ba) among the Muslims'. I said, 'You cannot do that.' `Umar said, 'Why?' I said, 'Your two (previous) companions (the Prophet and Abu Bakr) did not do it. `Umar said, 'They are the two persons whom one must follow.'\" (See Hadith No. 664, Vol. 2)",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "7578",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن واصل، عن المعرور، قال سمعت أبا ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل فبشرني أنه من مات لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن سرق وإن زنى قال ‏\"‏ وإن سرق وإن زنى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Prophet said, Gabriel came to me and gave me the glad tidings that anyone who died without worshipping anything besides Allah, would enter Paradise. I asked (Gabriel), 'Even if he committed theft, and even if he committed illegal sexual intercourse?' He said, '(Yes), even if he committed theft, and even if he Committed illegal sexual intercourse.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11401",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن واصل الأحدب، عن المعرور بن سويد، قال سمعت أبا ذر، يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أتاني جبريل - عليه السلام - فبشرني أنه من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق ‏.‏ قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏",
      "text_en": " I heard Abu Dharr narrating it from the Apostle (may peace be upon him) that he observed:                      Gabriel came to me and gave me the tidings: Verily he who died amongst your Ummah without associating anything with Allah would enter Paradise. I (the narrator) said: Even if he committed adultery and theft. He (the Holy Prophet) said: (Yes), even if he committed adultery and theft.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11401",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني شيبان بن فروخ، وعبد الله بن محمد بن أسماء الضبعي، قالا حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل الأحدب، عن أبي وائل، عن حذيفة، أنه بلغه أن رجلا، ينم الحديث فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة نمام ‏\"‏ ‏.‏",
      "text_en": " It is reported from Hudhaifa that news reached him (the Holy Prophet) that a certain man carried tales. Upon this Hudhaifa remarked:                      I heard Allah's Messenger (may peace be upon him) saying: The tale-bearer shall not enter Paradise.",
      "chain": [
        "20656",
        "11307",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، عن مسعر، عن واصل، عن أبي وائل، عن حذيفة، أن رسول الله صلى الله عليه وسلم لقيه وهو جنب فحاد عنه فاغتسل ثم جاء فقال كنت جنبا ‏.‏ قال ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.",
      "chain": [
        "30201",
        "30216",
        "20032",
        "20359",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1948",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا مهدي بن ميمون، حدثنا واصل الأحدب، عن أبي، وائل قال غدونا على عبد الله بن مسعود يوما بعد ما صلينا الغداة فسلمنا بالباب فأذن لنا - قال - فمكثنا بالباب هنية - قال - فخرجت الجارية فقالت ألا تدخلون فدخلنا فإذا هو جالس يسبح فقال ما منعكم أن تدخلوا وقد أذن لكم فقلنا لا إلا أنا ظننا أن بعض أهل البيت نائم ‏.‏ قال ظننتم بآل ابن أم عبد غفلة قال ثم أقبل يسبح حتى ظن أن الشمس قد طلعت فقال يا جارية انظري هل طلعت قال فنظرت فإذا هي لم تطلع فأقبل يسبح حتى إذا ظن أن الشمس قد طلعت قال يا جارية انظري هل طلعت فنظرت فإذا هي قد طلعت ‏.‏ فقال الحمد لله الذي أقالنا يومنا هذا - فقال مهدي وأحسبه قال - ولم يهلكنا بذنوبنا - قال - فقال رجل من القوم قرأت المفصل البارحة كله - قال - فقال عبد الله هذا كهذ الشعر إنا لقد سمعنا القرائن وإني لأحفظ القرائن التي كان يقرؤهن رسول الله صلى الله عليه وسلم ثمانية عشر من المفصل وسورتين من آل حم.",
      "text_en": " Shaqiq reported:                      A person from Banu Bajila who was called Nabik b. Sinan came to Abdullah and said: I recite mufassal surahs in one rak'ah. Upon this 'Abdullah said: (You recite) like the recitation of poetry. I know the manner in which the Messenger of Allah (may peace be upon him) recited two surahs in one rak'ah.",
      "chain": [
        "20656",
        "11307",
        "11401"
      ]
    },
    {
      "hadith_no": "4405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن واصل الأحدب، عن المعرور بن سويد، قال رأيت أبا ذر وعليه حلة وعلى غلامه مثلها فسألته عن ذلك قال فذكر أنه ساب رجلا على عهد رسول الله صلى الله عليه وسلم فعيره بأمه - قال - فأتى الرجل النبي صلى الله عليه وسلم فذكر ذلك له فقال النبي صلى الله عليه وسلم ‏\"‏ إنك امرؤ فيك جاهلية إخوانكم وخولكم جعلهم الله تحت أيديكم فمن كان أخوه تحت يديه فليطعمه مما يأكل وليلبسه مما يلبس ولا تكلفوهم ما يغلبهم فإن كلفتموهم فأعينوهم عليه ‏\"‏ ‏.‏",
      "text_en": " Ma'rur b. Suwaid reported:                      I saw Abu Dharr wearing clothes, and his slave wearing similar ones. I asked him about it, and he narrated that he had abused a person during the lifetime of Allah's Messenger (may peace be upoe. him) and he reproached him for his mother. That person came to Allah's Apostle (may peace be upon him) and made mention of that to him. Thereupon Allah's Apostle (may peace be upon him) said: You are a person who has (remnants of) Ignorance in him. Your slaves are brothers of yours. Allah has placed them in your hand, and he who has his brother under him, he should feed him with what he eats, and dress him with what he dresses himself, and do not burden them beyond their capacities, and if you burden them, (beyond their capacities), then help them.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11401",
        "11397"
      ]
    },
    {
      "hadith_no": "7412",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو داود، سليمان بن معبد حدثنا أبو النعمان، عارم حدثنا مهدي بن، ميمون حدثنا واصل، عن أبي الزبير، عن جابر بن عبد الله الأنصاري، قال سمعت رسول الله صلى الله عليه وسلم قبل موته بثلاثة أيام يقول ‏\"‏ لا يموتن أحدكم إلا وهو يحسن الظن بالله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah al-Ansari reported:                      I heard Allah's Messenger (may peace be upon him) say three days before his death: None of you should die but hoping only good from Allah, the Exalted and Glorious.",
      "chain": [
        "20283",
        "11307",
        "11401",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 19
}