{
  "id": "11415",
  "name": "'Umayr bin Han'i al-Ansi عمير بن هانئ العنسي",
  "full_name": "'Umayr bin Han'i al-Ansi عمير بن هانئ العنسي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "127",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "NA"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Ansi",
      "al-Darani",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11722",
      "name": "Malik bin Yakhamar مالك بن يخامر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "3205",
      "name": "Junadah bin Abi Umayya ( جنادة بن أبي أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20731",
      "name": "'Abdur Rahman bin Thabit عبد الرحمن بن ثابت بن ثوبان العنسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27041",
      "name": "Muslimh bin 'Amr مسلمة بن عمرو",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "18829",
      "name": "al-'Ala' bin 'Utba العلاء بن عتبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "27530",
      "name": "'Uthman bin Abi al-Atk'h عثمان بن أبي العاتكة سليمان الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20710",
      "name": "Sa'id bin Basahyr al-Azdi سعيد بن بشير الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1154",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ الحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله‏.‏ ثم قال اللهم اغفر لي‏.‏ أو دعا استجيب، فإن توضأ وصلى قبلت صلاته ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, waLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha il-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped but Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are due for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none has the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power Except with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), he will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا صدقة بن الفضل، حدثنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من شهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وأن عيسى عبد الله ورسوله وكلمته، ألقاها إلى مريم، وروح منه، والجنة حق والنار حق، أدخله الله الجنة على ما كان من العمل ‏\"‏‏.‏ قال الوليد حدثني ابن جابر عن عمير عن جنادة وزاد ‏\"‏ من أبواب الجنة الثمانية، أيها شاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada:                     The Prophet said, \"If anyone testifies that None has the right to be worshipped but Allah Alone Who has no partners, and that Muhammad is His Slave and His Apostle, and that Jesus is Allah's Slave and His Apostle and His Word which He bestowed on Mary and a Spirit created by Him, and that Paradise is true, and Hell is true, Allah will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junada, the sub-narrator said, \" 'Ubada added, 'Such a person can enter Paradise through any of its eight gates he likes.\")",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني عمير بن هانئ، أنه سمع معاوية، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، لا يضرهم من خذلهم ولا من خالفهم حتى يأتيهم أمر الله وهم على ذلك ‏\"‏‏.‏ قال عمير فقال مالك بن يخامر قال معاذ وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشام‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of people amongst my followers will remain obedient to Allah's orders and they will not be harmed by anyone who will not help them or who will oppose them, till Allah's Order (the Last Day) comes upon them while they are still on the right path.\"",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "hadith_no": "7550",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني عمير بن هانئ، أنه سمع معاوية، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، ما يضرهم من كذبهم، ولا من خالفهم، حتى يأتي أمر الله وهم على ذلك ‏\"‏‏.‏ فقال مالك بن يخامر سمعت معاذا يقول وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشأم‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of my followers will keep on following Allah's Laws strictly and they will not be harmed by those who will disbelieve them or stand against them till Allah's Order (The Hour) will come while they will be in that state.\"",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن ابن جابر، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثنا عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبد الله وابن أمته وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق وأن النار حق أدخله الله من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ubadah b. Samit that the messenger of Allah (may peace be upon him) observed:                      He who said:\" There is no god but Allah, He is One and there is no associate with Him, that Muhammad is his servant and His messenger, that Christ is servant and the son of His slave-girl and he (Christ) His word which He communicated to Mary and is His Spirit, that Paradise is a fact and Hell is a fact,\" Allah would make him (he who affirms these truths enter Paradise through any one of its eight doors which he would like.",
      "chain": [
        "30248",
        "20733",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا مبشر بن إسماعيل، عن الأوزاعي، عن عمير بن هانئ، في هذا الإسناد بمثله غير أنه قال ‏\"‏ أدخله الله الجنة على ما كان من عمل ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Umar b. Hani with the same chain of transmitters with the exception of these words:                      Allah would make him (he who affirms these truths) enter Paradise through one of the eight doors which he would like.",
      "chain": [
        "30494",
        "20461",
        "20024",
        "11415"
      ]
    },
    {
      "hadith_no": "5064",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد، بن جابر أن عمير بن هانئ، حدثه قال سمعت معاوية، على المنبر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي قائمة بأمر الله لا يضرهم من خذلهم أو خالفهم حتى يأتي أمر الله وهم ظاهرون على الناس ‏\"‏ ‏.‏",
      "text_en": " It his been narrated on the authority of Umair b. Umm Hani who said:                      I heard Mu'awiya say (while delivering a sermon from the pulpit) that he heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to obey Allah's Command, and those who desert or oppose them shall not be able to do them any harm. They will be dominating the peeple until Allah's Command is executed (i. e. Resurrection is established).",
      "chain": [
        "30523",
        "20402",
        "20395",
        "11415"
      ]
    },
    {
      "hadith_no": "472",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، حدثنا عثمان بن أبي العاتكة الأزدي، عن عمير بن هانئ العنسي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتى المسجد لشىء فهو حظه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying; one shall have the thing the for which one comes to the mosque.",
      "chain": [
        "30288",
        "20398",
        "11415",
        "13"
      ]
    },
    {
      "hadith_no": "4242",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد الحمصي، حدثنا أبو المغيرة، حدثني عبد الله بن سالم، حدثني العلاء بن عتبة، عن عمير بن هانئ العنسي، قال سمعت عبد الله بن عمر، يقول كنا قعودا عند رسول الله صلى الله عليه وسلم فذكر الفتن فأكثر في ذكرها حتى ذكر فتنة الأحلاس فقال قائل يا رسول الله وما فتنة الأحلاس قال ‏\"‏ هي هرب وحرب ثم فتنة السراء دخنها من تحت قدمى رجل من أهل بيتي يزعم أنه مني وليس مني وإنما أوليائي المتقون ثم يصطلح الناس على رجل كورك على ضلع ثم فتنة الدهيماء لا تدع أحدا من هذه الأمة إلا لطمته لطمة فإذا قيل انقضت تمادت يصبح الرجل فيها مؤمنا ويمسي كافرا حتى يصير الناس إلى فسطاطين فسطاط إيمان لا نفاق فيه وفسطاط نفاق لا إيمان فيه فإذا كان ذاكم فانتظروا الدجال من يومه أو من غده ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     When we were sitting with the Messenger of Allah (ﷺ), he talked about periods of trial (fitnahs), mentioning many of them.  When he mentioned the one when people should stay in their houses, some asked him: Messenger of Allah, what is the trial (fitnah) of staying at home?  He replied: It will be flight and plunder. Then will come a test which is pleasant. Its murkiness is due to the fact that it is produced by a man from the people of my house, who will assert that he belongs to me, whereas he does not, for my friends are only the God-fearing. Then the people will unite under a man who will be like a hip-bone on a rib. Then there will be the little black trial which will leave none of this community without giving him a slap, and when people say that it is finished, it will be extended. During it a man will be a believer in the morning and an infidel in the evening, so that the people will be in two camps: the camp of faith which will contain no hypocrisy, and the camp of hypocrisy which will contain no faith. When that happens, expect the Antichrist (Dajjal) that day or the next.",
      "chain": [
        "20442",
        "35061",
        "11415",
        "18"
      ]
    },
    {
      "hadith_no": "5060",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد، قال قال الأوزاعي حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تعار من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم دعا رب اغفر لي ‏\"‏ ‏.‏ قال الوليد أو قال ‏\"‏ دعا استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏",
      "text_en": " ‘Ubadah b. al-Samit reported the Messenger of Allah (May peace be upon him) as saying; If anyone is alarmed while asleep and he says when awakes :                      there is no god but Allah alone Who has no partner, to whom dominion belongs, to whom praise is due, and who has power over everything (omnipotent). Glory be to Allah, and praise be to Allah, and there is no god but Allah, and then he prays: O my Lord, forgive me. Abu Dawud said : Al-Walid’s version has; and he prays, his prayer will be answered. If he gets up, performs ablution, and prays, his prayer will be accepted.",
      "chain": [
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3414",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، رضى الله عنه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وسبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم قال رب اغفر لي أو قال ثم دعا استجيب له فإن عزم فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ubadah bin As-Samit, may Allah be pleased with him, narrated that:                     The Messenger of Allah said: “Whoever wakes up in the night and say, ‘None has the right to be worshipped but Allah, alone, without partner, to Him belongs the Dominion, and to Him is the praise, and He has power over all things. And Glory is to Allah, and all the praise is to Allah, and ‘None has the right to be worshipped but Allah, and Allah is the greatest, and there is no might nor power except by Allah (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa ala Kulli Shai’in Qadir. Wa Subhan Allah, Walhamdullilah, Wa La Ilaha Illallah, Wa Allahu Akbar, Wa La Hawla Wa La Quwwata Illa Billah.)’ – then he said: ‘O my Lord, forgive me (Rabbighfirli)’ – or he said – ‘then he supplicates, he shall be responded to. So he makes a firm determination, then performs Wudu, then he performs Salat, his Salat shall be accepted.”",
      "chain": [
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3878",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، حدثني جنادة بن أبي أمية، عن عبادة بن الصامت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تعار من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم ثم دعا رب اغفر لي - غفر له ‏\"‏ ‏.‏ قال الوليد أو قال ‏\"‏ دعا استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Ubadah bin As-Samit said:                      “The Messenger of Allah (ﷺ) said: ‘Whoever wakes up in the morning and says upon waking: La ilaha illallah wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa ‘ala kulli shay’in Qadir; Subhan-Allah walhamdu lillahi, wa la ilaha illallahu, wa Allahu Akbar, wa la hawla wa la quwwata illa billahil-‘Aliyil-‘Azim (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion and all praise is to Him, and He is Able to do all things. Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, Allah is the Most Great, and there is no power and no strength except with Allah, the Most High, the Most Supreme), then he supplicates Rabbighfirli (O Lord, forgive me), he will be forgiven.’”Walid said: “Or he said: then if he supplicated, it will be answered for him then if he stood up and performed ablution and then performed prayer, his prayer would be accepted.”",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    }
  ],
  "total_hadiths": 12
}