{
  "id": "11419",
  "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
  "full_name": "Ja'far bin Iyas (Abi Wahshiyya) جعفر بن إياس / بن أبي وحشية",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Wasit",
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Yashkari",
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5109",
      "name": "'Aabad bin Shrhbyl al-Yshkry ( عباد بن شرحبيل اليشكري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12632",
      "name": "Abu 'Umayr bin Anas bin Malik أبو عمير بن أنس بن مالك الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11264",
      "name": "Yusuf bin Mahk يوسف بن ماهك الفارسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11280",
      "name": "Hameed bin 'Abdur Rahman حميد بن عبد الرحمن الحميري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11294",
      "name": "'Abdur Rahman bin Abi Bakra عبد الرحمن بن أبي بكرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10809",
      "name": "Ghylan bin Jam' bin Ash'th غيلان بن جامع بن أشعث المحاربي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-60",
      "hadith_no": "60",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو النعمان، عارم بن الفضل قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف عنا النبي صلى الله عليه وسلم في سفرة سافرناها، فأدركنا وقد أرهقتنا الصلاة ونحن نتوضأ، فجعلنا نمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Once the Prophet remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire.\"",
      "usc_msa_ref": "57",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-96",
      "hadith_no": "96",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف رسول الله صلى الله عليه وسلم في سفر سافرناه فأدركنا وقد أرهقنا الصلاة صلاة العصر ونحن نتوضأ، فجعلنا نمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Once Allah's Apostle remained behind us in a journey. He joined us while we were performing ablution for the `Asr prayer which was over-due. We were just passing wet hands over our feet (not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice, \"Save your heels from the fire.\"",
      "usc_msa_ref": "96",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-163",
      "hadith_no": "163",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى، قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف النبي صلى الله عليه وسلم عنا في سفرة سافرناها، فأدركنا وقد أرهقنا العصر، فجعلنا نتوضأ ونمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet remained behind us on a journey. He joined us while we were performing ablution for the `Asr prayer which was overdue and we were just passing wet hands over our feet (not washing them thoroughly) so he addressed us in a loud voice saying twice , \"Save your heels from the fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-773",
      "hadith_no": "773",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال انطلق النبي صلى الله عليه وسلم في طائفة من أصحابه عامدين إلى سوق عكاظ، وقد حيل بين الشياطين وبين خبر السماء، وأرسلت عليهم الشهب، فرجعت الشياطين إلى قومهم‏.‏ فقالوا ما لكم فقالوا حيل بيننا وبين خبر السماء، وأرسلت علينا الشهب‏.‏ قالوا ما حال بينكم وبين خبر السماء إلا شىء حدث، فاضربوا مشارق الأرض ومغاربها، فانظروا ما هذا الذي حال بينكم وبين خبر السماء فانصرف أولئك الذين توجهوا نحو تهامة إلى النبي صلى الله عليه وسلم وهو بنخلة، عامدين إلى سوق عكاظ وهو يصلي بأصحابه صلاة الفجر، فلما سمعوا القرآن استمعوا له فقالوا هذا والله الذي حال بينكم وبين خبر السماء‏.‏ فهنالك حين رجعوا إلى قومهم وقالوا يا قومنا ‏{‏إنا سمعنا قرآنا عجبا * يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا‏}‏ فأنزل الله على نبيه صلى الله عليه وسلم ‏{‏قل أوحي إلى‏}‏ وإنما أوحي إليه قول الجن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet set out with the intention of going to Suq `Ukaz (market of `Ukaz) along with some of his companions. At the same time, a barrier was put between the devils and the news of heaven. Fire commenced to be thrown at them. The Devils went to their people, who asked them, \"What is wrong with you?\" They said, \"A barrier has been placed between us and the news of heaven. And fire has been thrown at us.\" They said, \"The thing which has put a barrier between you and the news of heaven must be something which has happened recently. Go eastward and westward and see what has put a barrier between you and the news of heaven.\" Those who went towards Tuhama came across the Prophet at a place called Nakhla and it was on the way to Suq `Ukaz and the Prophet was offering the Fajr prayer with his companions. When they heard the Qur'an they listened to it and said, \"By Allah, this is the thing which has put a barrier between us and the news of heaven.\" They went to their people and said, \"O our people; verily we have heard a wonderful recital (Qur'an) which shows the true path; we believed in it and would not ascribe partners to our Lord.\" Allah revealed the following verses to his Prophet (Sura 'Jinn') (72): \"Say: It has been revealed to me.\" And what was revealed to him was the conversation of the Jinns.",
      "usc_msa_ref": "740",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-787",
      "hadith_no": "787",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمرو بن عون، قال حدثنا هشيم، عن أبي بشر، عن عكرمة، قال رأيت رجلا عند المقام يكبر في كل خفض ورفع وإذا قام وإذا وضع، فأخبرت ابن عباس  رضى الله عنه  قال أوليس تلك صلاة النبي صلى الله عليه وسلم لا أم لك‏.‏",
      "text_en": " Narrated `Ikrima:                     I saw a person praying at Muqam-Ibrahim (the place of Abraham by the Ka`ba) and he was saying Takbir on every bowing, rising, standing and sitting. I asked Ibn `Abbas (about this prayer). He admonished me saying: \"Isn't that the prayer of the Prophet?\"",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20468",
        "11419",
        "11023"
      ]
    },
    {
      "id": "sahih-bukhari-1267",
      "hadith_no": "1267",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  أن رجلا، وقصه بعيره، ونحن مع النبي صلى الله عليه وسلم وهو محرم فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was killed by his camel while we were with the Prophet and he was a Muhrim. So the Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik' . \"",
      "usc_msa_ref": "357",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1383",
      "hadith_no": "1383",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، أخبرنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين فقال ‏\"‏ الله إذ خلقهم أعلم بما كانوا عاملين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle (p.b.u.h) was asked about the children of (Mushrikeen) pagans. The Prophet replied, \"Since Allah created them, He knows what sort of deeds they would have done.\"",
      "usc_msa_ref": "465",
      "chain": [
        "20218",
        "20025",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1882",
      "hadith_no": "1882",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن رجلا، كان مع النبي صلى الله عليه وسلم فوقصته ناقته، وهو محرم، فمات، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبيه، ولا تمسوه بطيب، ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was in the company of the Prophet and his she-camel crushed his neck while he was in a state of Ihram and he died Allah's Apostle said, \"Wash him with water and Sidr and shroud him in his two garments; neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection, reciting Talbiya.\"",
      "usc_msa_ref": "76",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1883",
      "hadith_no": "1883",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن امرأة، من جهينة جاءت إلى النبي صلى الله عليه وسلم فقالت إن أمي نذرت أن تحج، فلم تحج حتى ماتت أفأحج عنها قال ‏\"‏ نعم‏.‏ حجي عنها، أرأيت لو كان على أمك دين أكنت قاضية اقضوا الله، فالله أحق بالوفاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Juhaina came to the Prophet and said, \"My mother had vowed to perform Hajj but she died before performing it. May I perform Hajj on my mother's behalf?\" The Prophet replied, \"Perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or not? So, pay Allah's debt as He has more right to be paid.\"",
      "usc_msa_ref": "77",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1971",
      "hadith_no": "1971",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد، عن ابن عباس  رضى الله عنهما  قال ما صام النبي صلى الله عليه وسلم شهرا كاملا قط غير رمضان، ويصوم حتى يقول القائل لا والله لا يفطر، ويفطر حتى يقول القائل لا والله لا يصوم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet never fasted a full month except the month of Ramadan, and he used to fast till one could say, \"By Allah, he will never stop fasting,\" and he would abandon fasting till one would say, \"By Allah, he will never fast.\"",
      "usc_msa_ref": "192",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11168",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-2209",
      "hadith_no": "2209",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا أبو عوانة، عن أبي بشر، عن مجاهد، عن ابن عمر  رضى الله عنهما  قال كنت عند النبي صلى الله عليه وسلم وهو يأكل جمارا، فقال ‏\"‏ من الشجر شجرة كالرجل المؤمن ‏\"‏‏.‏ فأردت أن أقول هي النخلة‏.‏ فإذا أنا أحدثهم قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I was with the Prophet while he was eating fresh dates. He said, \"From the trees there is a tree which resembles a faithful believer.\" I wanted to say that it was the date palm, but I was the youngest among them (so I kept quiet). He added, \"It is the date palm.\"",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20469",
        "11419",
        "11028",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2276",
      "hadith_no": "2276",
      "source": "Sahih Bukhari",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد  رضى الله عنه  قال انطلق نفر من أصحاب النبي صلى الله عليه وسلم في سفرة سافروها حتى نزلوا على حى من أحياء العرب فاستضافوهم، فأبوا أن يضيفوهم، فلدغ سيد ذلك الحى، فسعوا له بكل شىء لا ينفعه شىء، فقال بعضهم لو أتيتم هؤلاء الرهط الذين نزلوا لعله أن يكون عند بعضهم شىء، فأتوهم، فقالوا يا أيها الرهط، إن سيدنا لدغ، وسعينا له بكل شىء لا ينفعه، فهل عند أحد منكم من شىء فقال بعضهم نعم والله إني لأرقي، ولكن والله لقد استضفناكم فلم تضيفونا، فما أنا براق لكم حتى تجعلوا لنا جعلا‏.‏ فصالحوهم على قطيع من الغنم، فانطلق يتفل عليه ويقرأ ‏{‏الحمد لله رب العالمين‏}‏ فكأنما نشط من عقال، فانطلق يمشي وما به قلبة، قال فأوفوهم جعلهم الذي صالحوهم عليه، فقال بعضهم اقسموا‏.‏ فقال الذي رقى لا تفعلوا، حتى نأتي النبي صلى الله عليه وسلم فنذكر له الذي كان، فننظر ما يأمرنا‏.‏ فقدموا على رسول الله صلى الله عليه وسلم فذكروا له، فقال ‏\"‏ وما يدريك أنها رقية  ثم قال  قد أصبتم اقسموا واضربوا لي معكم سهما ‏\"‏‏.‏ فضحك رسول الله صلى الله عليه وسلم‏.‏ وقال شعبة حدثنا أبو بشر سمعت أبا المتوكل بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Some of the companions of the Prophet went on a journey till they reached some of the 'Arab tribes (at night). They asked the latter to treat them as their guests but they refused. The chief of that tribe was then bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some of them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at night, it may be that some of them might possess something (as treatment),\" They went to the group of the companions (of the Prophet ) and said, \"Our chief has been bitten by a snake (or stung by a scorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" One of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as your guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees to pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are for the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a chain, and got up and started walking, showing no signs of sickness. They paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide their earnings among themselves, but the one who performed the recitation said, \"Do not divide them till we go to the Prophet and narrate the whole story to him, and wait for his order.\" So, they went to Allah's Apostle and narrated the story. Allah's Apostle asked, \"How did you come to know that Suratul- Fatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you have earned) and assign a share for me as well.\" The Prophet smiled thereupon.",
      "usc_msa_ref": "",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-2575",
      "hadith_no": "2575",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا جعفر بن إياس، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال أهدت أم حفيد خالة ابن عباس إلى النبي صلى الله عليه وسلم أقطا وسمنا وأضبا، فأكل النبي صلى الله عليه وسلم من الأقط والسمن، وترك الضب تقذرا‏.‏ قال ابن عباس فأكل على مائدة رسول الله صلى الله عليه وسلم، ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said: Um Hufaid, Ibn `Abbas's aunt sent some dried yogurt (butter free), ghee (butter) and a mastigar to the Prophet as a gift. The Prophet ate the dried yogurt and butter but left the mastigar because he disliked it. Ibn `Abbas said, \"The mastigar was eaten at the table of Allah's Apostle and if it had been illegal to eat, it could not have been eaten at the table of Allah's Apostle.\"",
      "usc_msa_ref": "749",
      "chain": [
        "20404",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-2759",
      "hadith_no": "2759",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن الفضل أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال إن ناسا يزعمون أن هذه الآية نسخت، ولا والله ما نسخت، ولكنها مما تهاون الناس، هما واليان وال يرث، وذاك الذي يرزق، ووال لا يرث، فذاك الذي يقول بالمعروف، يقول لا أملك لك أن أعطيك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the people have stopped acting on it. There are two kinds of guardians (who are in charge of the inheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, the orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the orphans): such a person should speak kindly and say (to those who are present at the time of distribution), \"I can not give it to you (as the wealth belongs to the orphans).",
      "usc_msa_ref": "21",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3564",
      "hadith_no": "3564",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال إذا سرك أن تعلم جهل العرب فاقرأ ما فوق الثلاثين ومائة في سورة الأنعام ‏{‏قد خسر الذين قتلوا أولادهم سفها بغير علم‏}‏ إلى قوله ‏{‏قد ضلوا وما كانوا مهتدين‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     If you wish to know about the ignorance of the Arabs, refer to Surat-al-Anam after Verse No. 130:-- Indeed lost are those who have killed their children From folly without knowledge and have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.' (6.14)",
      "usc_msa_ref": "",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3670",
      "hadith_no": "3670",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كان عمر بن الخطاب  رضى الله عنه  يدني ابن عباس، فقال له عبد الرحمن بن عوف إن لنا أبناء مثله‏.‏ فقال إنه من حيث تعلم‏.‏ فسأل عمر ابن عباس عن هذه الآية ‏{‏إذا جاء نصر الله والفتح‏}‏‏.‏ فقال أجل رسول الله صلى الله عليه وسلم أعلمه إياه‏.‏ قال ما أعلم منها إلا ما تعلم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     About Ibn `Abbas: `Umar bin Al-Khattab used to treat Ibn `Abbas very favorably `Abdur Rahman bin `Auf said to him. \"We also have sons that are equal to him (but you are partial to him.)\" `Umar said, \"It is because of his knowledge.\" Then `Umar asked Ibn `Abbas about the interpretation of the Verse:- 'When come the Help of Allah and the conquest (of Mecca) (110.1) Ibn `Abbas said. \"It portended the death of Allah's Apostle, which Allah had informed him of.\" `Umar said, \"I do not know from this Verse but what you know.\"",
      "usc_msa_ref": "821",
      "chain": [
        "20282",
        "20020",
        "11419",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-3991",
      "hadith_no": "3991",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما قدم النبي صلى الله عليه وسلم المدينة وجد اليهود يصومون عاشوراء، فسئلوا عن ذلك، فقالوا هذا اليوم الذي أظفر الله فيه موسى وبني إسرائيل على فرعون، ونحن نصومه تعظيما له، فقال رسول الله صلى الله عليه وسلم ‏\"‏ نحن أولى بموسى منكم ‏\"‏‏.‏ ثم أمر بصومه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet arrived at Medina he found that the Jews observed fast on the day of 'Ashura'. They were asked the reason for the fast. They replied, \"This is the day when Allah caused Moses and the children of Israel to have victory over Pharaoh, so we fast on this day as a sign of glorifying it.\" Allah's Apostle said, \"We are closer to Moses than you.\" Then he ordered that fasting on this day should be observed.",
      "usc_msa_ref": "279",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3993",
      "hadith_no": "3993",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني زياد بن أيوب، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال هم أهل الكتاب، جزءوه أجزاء، فآمنوا ببعضه وكفروا ببعضه‏.‏ ‏{‏يعني قول الله تعالى ‏{‏الذين جعلوا القرآن عضين ‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     They, the people of the Scriptures, divided this Scripture into parts, believing in some portions of it and disbelieving the others. (See 15:91)",
      "usc_msa_ref": "281",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4079",
      "hadith_no": "4079",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني الحسن بن مدرك، حدثنا يحيى بن حماد، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، قال قلت لابن عباس سورة الحشر‏.‏ قال قل سورة النضير‏.‏ تابعه هشيم عن أبي بشر‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I mentioned to Ibn `Abbas Surat-Hashr. He said, \"Call it Surat-an-Nadir.\"",
      "usc_msa_ref": "363",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-4211",
      "hadith_no": "4211",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن خلف، قال حدثنا إسحاق بن يوسف، عن أبي بشر، ورقاء، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم رآه وقمله يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره رسول الله صلى الله عليه وسلم أن يحلق وهو بالحديبية، لم يبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة مساكين، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     That Allah's Apostle saw him with the lice falling (from his head) on his face. Allah's Apostle said, \"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Apostle thus ordered him to shave his head while he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their state of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, so Allah's Apostle ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep or fast for three days.",
      "usc_msa_ref": "478",
      "chain": [
        "30324",
        "20411",
        "11419",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sahih-bukhari-4240",
      "hadith_no": "4240",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن هشام أبو عبد الله، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال كنا مع رسول الله صلى الله عليه وسلم بالحديبية ونحن محرمون، وقد حصرنا المشركون  قال  وكانت لي وفرة فجعلت الهوام تساقط على وجهي، فمر بي النبي صلى الله عليه وسلم فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ قال وأنزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏",
      "text_en": " Narrated Ka`b bin Ujra:                     We were in the company of Allah's Apostle at Al-Hudaibiya in the state of Ihram and the pagans did not allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet passed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator added, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an ailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the poor, Or offering a sacrifice.\" (2.196)",
      "usc_msa_ref": "504",
      "chain": [
        "30276",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sahih-bukhari-4339",
      "hadith_no": "4339",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان عمر يدخلني مع أشياخ بدر، فقال بعضهم لم تدخل هذا الفتى معنا، ولنا أبناء مثله فقال إنه ممن قد علمتم‏.‏ قال فدعاهم ذات يوم، ودعاني معهم قال وما رئيته دعاني يومئذ إلا ليريهم مني فقال ما تقولون ‏{‏إذا جاء نصر الله والفتح * ورأيت الناس يدخلون‏}‏ حتى ختم السورة، فقال بعضهم أمرنا أن نحمد الله ونستغفره، إذا نصرنا وفتح علينا‏.‏ وقال بعضهم لا ندري‏.‏ أو لم يقل بعضهم شيئا‏.‏ فقال لي يا ابن عباس أكذاك تقول قلت لا‏.‏ قال فما تقول قلت هو أجل رسول الله صلى الله عليه وسلم أعلمه الله له ‏{‏إذا جاء نصر الله والفتح‏}‏ فتح مكة، فذاك علامة أجلك ‏{‏فسبح بحمد ربك واستغفره إنه كان توابا‏}‏ قال عمر ما أعلم منها إلا ما تعلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar used to admit me (into his house) along with the old men who had fought in the Badr battle. Some of them said (to `Umar), \"Why do you allow this young man to enter with us, while we have sons of his own age? \" `Umar said, \"You know what person he is.\" One day `Umar called them and called me along with them, I had thought he called me on that day to show them something about me (i.e. my knowledge). `Umar asked them, \"What do you say about (the Sura): \"When comes the help of Allah and the Conquest (of Mecca) And you see mankind entering the Religion of Allah (i.e. Islam) in crowds. 'So celebrate the Praises Of your Lord and ask for His forgiveness, Truly, He is the One Who accepts repentance and forgives.\" (110.1-3) Some of them replied, \"We are ordered to praise Allah and repent to Him if we are helped and granted victory.\" Some said, \"We do not know.\" Others kept quiet. `Umar then said to me, \"Do you say similarly?\" I said, \"No.\" `Umar said \"What do you say then?\" I said, \"This Verse indicates the approaching of the death of Allah's Apostle of which Allah informed him. When comes the help of Allah and the Conquest, i.e. the Conquest of Mecca, that will be the sign of your Prophet's) approaching death, so testify the uniqueness of your Lord (i.e. Allah) and praise Him and repent to Him as He is ready to forgive.\" On that, `Umar said, \"I do not know about it anything other than what you know.\"",
      "usc_msa_ref": "588",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4354",
      "hadith_no": "4354",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي بشر، عن مجاهد، قلت لابن عمر  رضى الله عنهما  إني أريد أن أهاجر إلى الشأم‏.‏ قال لا هجرة ولكن جهاد، فانطلق فاعرض نفسك، فإن وجدت شيئا وإلا رجعت‏.‏",
      "text_en": " Narrated Mujahid:                     I said to Ibn `Umar, \"I want to migrate to Sham.\" He said, \"There is no migration, but Jihad (for Allah's Cause). Go and offer yourself for Jihad, and if you find an opportunity for Jihad (stay there) otherwise, come back.\" (In an other narration) Ibn `Umar said, \"There is no migration today or after Allah's Apostle.\" (and completed his statement as above.)",
      "usc_msa_ref": "600",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11028"
      ]
    },
    {
      "id": "sahih-bukhari-4355",
      "hadith_no": "4355",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال النضر أخبرنا شعبة، أخبرنا أبو بشر، سمعت مجاهدا، قلت لابن عمر فقال لا هجرة اليوم، أو بعد رسول الله صلى الله عليه وسلم مثله‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20291",
        "20020",
        "11419",
        "11028"
      ]
    },
    {
      "id": "sahih-bukhari-4474",
      "hadith_no": "4474",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كان عمر بن الخطاب  رضى الله عنه  يدني ابن عباس فقال له عبد الرحمن بن عوف إن لنا أبناء مثله‏.‏ فقال إنه من حيث تعلم‏.‏ فسأل عمر ابن عباس عن هذه الآية ‏{‏إذا جاء نصر الله والفتح‏}‏ فقال أجل رسول الله صلى الله عليه وسلم أعلمه إياه، فقال ما أعلم منها إلا ما تعلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar bin Al-Khattab used to let Ibn `Abbas sit beside him, so `AbdurRahman bin `Auf said to `Umar, \"We have sons similar to him.\" `Umar replied, \"(I respect him) because of his status that you know.\" `Umar then asked Ibn `Abbas about the meaning of this Holy Verse:-- \"When comes the help of Allah and the conquest of Mecca . . .\" (110.1) Ibn `Abbas replied, \"That indicated the death of Allah's Apostle which Allah informed him of.\" `Umar said, \"I do not understand of it except what you understand.\"",
      "usc_msa_ref": "",
      "chain": [
        "20282",
        "20020",
        "11419",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-4690",
      "hadith_no": "4690",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، أخبرنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال قلت لابن عباس  رضى الله عنهما  سورة الأنفال قال نزلت في بدر‏.‏ الشوكة الحد ‏{‏مردفين‏}‏ فوجا بعد فوج، ردفني وأردفني جاء بعدي ‏{‏ذوقوا‏}‏ باشروا وجربوا وليس هذا من ذوق الفم ‏{‏فيركمه‏}‏ يجمعه‏.‏ ‏{‏شرد‏}‏ فرق ‏{‏وإن جنحوا‏}‏ طلبوا ‏{‏يثخن‏}‏ يغلب‏.‏ وقال مجاهد ‏{‏مكاء‏}‏ إدخال أصابعهم في أفواههم و‏{‏تصدية‏}‏ الصفير ‏{‏ليثبتوك‏}‏ ليحبسوك‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-4726",
      "hadith_no": "4726",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال قدم النبي صلى الله عليه وسلم المدينة واليهود تصوم عاشوراء فقالوا هذا يوم ظهر فيه موسى على فرعون‏.‏ فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ أنتم أحق بموسى منهم، فصوموا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet arrived at Medina, the Jews were observing the fast on 'Ashura' (10th of Muharram) and they said, \"This is the day when Moses became victorious over Pharaoh,\" On that, the Prophet said to his companions, \"You (Muslims) have more right to celebrate Moses' victory than they have, so observe the fast on this day.\"",
      "usc_msa_ref": "202",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4752",
      "hadith_no": "4752",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما ‏{‏الذين جعلوا القرآن عضين‏}‏ قال هم أهل الكتاب، جزءوه أجزاء، فآمنوا ببعضه وكفروا ببعضه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Those who have made their Scripture into parts are the people of the Scripture who divided it into portions and believed in a part of it and disbelieved the other.",
      "usc_msa_ref": "228",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4769",
      "hadith_no": "4769",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  في قوله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة، كان إذا صلى بأصحابه رفع صوته بالقرآن فإذا سمعه المشركون سبوا القرآن ومن أنزله، ومن جاء به، فقال الله تعالى لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك‏}‏ أى بقراءتك، فيسمع المشركون، فيسبوا القرآن، ‏{‏ولا تخافت بها‏}‏ عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding): 'Neither say your, prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Apostle was hiding himself in Mecca. When he prayed with his companions, he used to raise his voice with the recitation of Qur'an, and if the pagans happened to hear him, they would abuse the Qur'an, the One who revealed it and the one who brought it. Therefore Allah said to His Prophet : 'Neither say your prayer aloud.' (17.110) i.e. do not recite aloud lest the pagans should hear you, but follow a way between.",
      "usc_msa_ref": "246",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4784",
      "hadith_no": "4784",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا روح، حدثنا شعبة، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما قدم رسول الله صلى الله عليه وسلم المدينة، واليهود تصوم عاشوراء، فسألهم، فقالوا هذا اليوم الذي ظهر فيه موسى على فرعون، فقال النبي صلى الله عليه وسلم ‏\"‏ نحن أولى بموسى منهم فصوموه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle arrived at Medina, he found the Jews observing the fast on the day of 'Ashura' (10th of Muharram). The Prophet asked them (about it) and they replied, \"This is the day when Moses became victorious over Pharaoh.\" The Prophet said (to the Muslims), \"We are nearer to Moses than they, so fast on this day.\"",
      "usc_msa_ref": "261",
      "chain": [
        "20184",
        "20229",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4876",
      "hadith_no": "4876",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، قال كان مروان على الحجاز استعمله معاوية، فخطب فجعل يذكر يزيد بن معاوية، لكى يبايع له بعد أبيه، فقال له عبد الرحمن بن أبي بكر شيئا، فقال خذوه‏.‏ فدخل بيت عائشة فلم يقدروا ‏{‏عليه‏}‏ فقال مروان إن هذا الذي أنزل الله فيه ‏{‏والذي قال لوالديه أف لكما أتعدانني‏}‏‏.‏ فقالت عائشة من وراء الحجاب ما أنزل الله فينا شيئا من القرآن إلا أن الله أنزل عذري‏.‏",
      "text_en": " Narrated Yusuf bin Mahak:                     Marwan had been appointed as the governor of Hijaz by Muawiya. He delivered a sermon and mentioned Yazid bin Muawiya so that the people might take the oath of allegiance to him as the successor of his father (Muawiya). Then `Abdur Rahman bin Abu Bakr told him something whereupon Marwan ordered that he be arrested. But `Abdur-Rahman entered `Aisha's house and they could not arrest him. Marwan said, \"It is he (`AbdurRahman) about whom Allah revealed this Verse:-- 'And the one who says to his parents: 'Fie on you! Do you hold out the promise to me..?'\" On that, `Aisha said from behind a screen, \"Allah did not reveal anything from the Qur'an about us except what was connected with the declaration of my innocence (of the slander).",
      "usc_msa_ref": "352",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11264"
      ]
    },
    {
      "id": "sahih-bukhari-4931",
      "hadith_no": "4931",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال قلت لابن عباس سورة التوبة قال التوبة هي الفاضحة، ما زالت تنزل ومنهم ومنهم، حتى ظنوا أنها لم تبق أحدا منهم إلا ذكر فيها‏.‏ قال قلت سورة الأنفال‏.‏ قال نزلت في بدر‏.‏ قال قلت سورة الحشر‏.‏ قال نزلت في بني النضير‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I asked Ibn `Abbas about Surat Al-Tauba, and he said, \"Surat Al-Tauba? It is exposure (of all the evils of the infidels and the hypocrites). And it continued revealing (that the oft-repeated expression): '...and of them ...and of them.' till they started thinking that none would be left unmentioned therein.\" I said, \"What about) Surat Al-Anfal?\" He replied, \"Surat Al-Anfal was revealed in connection with the Badr Battle.\" I said, \"(What about) Surat Al-Hashr?\" He replied, \"It was revealed in connection with Bani an-Nadir.\"",
      "usc_msa_ref": "404",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-4932",
      "hadith_no": "4932",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن مدرك، حدثنا يحيى بن حماد، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد، قال قلت لابن عباس  رضى الله عنهما  سورة الحشر قال قل سورة النضير‏.‏",
      "text_en": " Narrated Sa`id:                     I asked Ibn `Abbas about Surat Al-Hashr. He replied, \"Say Surat An-Nadir.\"",
      "usc_msa_ref": "405",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11419",
        "11168"
      ]
    },
    {
      "id": "sahih-bukhari-4970",
      "hadith_no": "4970",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال انطلق رسول الله صلى الله عليه وسلم في طائفة من أصحابه عامدين إلى سوق عكاظ، وقد حيل بين الشياطين وبين خبر السماء، وأرسلت عليهم الشهب فرجعت الشياطين فقالوا ما لكم فقالوا حيل بيننا وبين خبر السماء وأرسلت علينا الشهب‏.‏ قال ما حال بينكم وبين خبر السماء إلا ما حدث، فاضربوا مشارق الأرض ومغاربها فانظروا ما هذا الأمر الذي حدث‏.‏ فانطلقوا فضربوا مشارق الأرض ومغاربها ينظرون ما هذا الأمر الذي حال بينهم وبين خبر السماء‏.‏ قال فانطلق الذين توجهوا نحو تهامة إلى رسول الله صلى الله عليه وسلم بنخلة، وهو عامد إلى سوق عكاظ، وهو يصلي بأصحابه صلاة الفجر، فلما سمعوا القرآن تسمعوا له فقالوا هذا الذي حال بينكم وبين خبر السماء‏.‏ فهنالك رجعوا إلى قومهم فقالوا يا قومنا إنا سمعنا قرآنا عجبا يهدي إلى الرشد فآمنا به، ولن نشرك بربنا أحدا‏.‏ وأنزل الله عز وجل على نبيه صلى الله عليه وسلم ‏{‏قل أوحي إلى أنه استمع نفر من الجن‏}‏ وإنما أوحي إليه قول الجن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle went out along with a group of his companions towards `Ukaz Market. At that time something intervened between the devils and the news of the Heaven, and flames were sent down upon them, so the devils returned. Their fellow-devils said, \"What is wrong with you? \" They said, \"Something has intervened between us and the news of the Heaven, and fires (flames) have been shot at us.\" Their fellow-devils said, \"Nothing has intervened between you and the news of the Heaven, but an important event has happened. Therefore, travel all over the world, east and west, and try to find out what has happened.\" And so they set out and travelled all over the world, east and west, looking for that thing which intervened between them and the news of the Heaven. Those of the devils who had set out towards Tihama, went to Allah's Apostle at Nakhla (a place between Mecca and Taif) while he was on his way to `Ukaz Market. (They met him) while he was offering the Fajr prayer with his companions. When they heard the Holy Qur'an being recited (by Allah's Apostle), they listened to it and said (to each other). This is the thing which has intervened between you and the news of the Heavens.\" Then they returned to their people and said, \"O our people! We have really heard a wonderful recital (Qur'an). It gives guidance to the right, and we have believed therein. We shall not join in worship, anybody with our Lord.\" (See 72.1-2) Then Allah revealed to His Prophet (Surat al- Jinn): 'Say: It has been revealed to me that a group (3 to 9) of Jinns listened (to the Qur'an).' (72.1) The statement of the Jinns was revealed to him .",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5018",
      "hadith_no": "5018",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أنه قال في الكوثر هو الخير الذي أعطاه الله إياه‏.‏ قال أبو بشر قلت لسعيد بن جبير فإن الناس يزعمون أنه نهر في الجنة‏.‏ فقال سعيد النهر الذي في الجنة من الخير الذي أعطاه الله إياه‏.‏",
      "text_en": " Narrated Abu Bishr:                     Sa`id bin Jubair said that Ibn `Abbas said about Al-Kauthar. \"That is the good which Allah has bestowed upon His Apostle.\" I said to Sa`id bin Jubair. \"But the people claim that it is a river in Paradise.\" Sa`id said, \"The river in Paradise is part of the good which Allah has bestowed on His Apostle.\"",
      "usc_msa_ref": "490",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5022",
      "hadith_no": "5022",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كان عمر يدخلني مع أشياخ بدر، فكأن بعضهم وجد في نفسه فقال لم تدخل هذا معنا ولنا أبناء مثله فقال عمر إنه من حيث علمتم‏.‏ فدعا ذات يوم  فأدخله معهم  فما رئيت أنه دعاني يومئذ إلا ليريهم‏.‏ قال ما تقولون في قول الله تعالى ‏{‏إذا جاء نصر الله والفتح‏}‏ فقال بعضهم أمرنا نحمد الله ونستغفره، إذا نصرنا وفتح علينا‏.‏ وسكت بعضهم فلم يقل شيئا فقال لي أكذاك تقول يا ابن عباس فقلت لا‏.‏ قال فما تقول قلت هو أجل رسول الله صلى الله عليه وسلم أعلمه له، قال ‏{‏إذا جاء نصر الله والفتح‏}‏ وذلك علامة أجلك ‏{‏فسبح بحمد ربك واستغفره إنه كان توابا‏}‏‏.‏ فقال عمر ما أعلم منها إلا ما تقول‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar used to make me sit with the elderly men who had fought in the Battle of Badr. Some of them felt it (did not like that) and said to `Umar \"Why do you bring in this boy to sit with us while we have sons like him?\" `Umar replied, \"Because of what you know of his position (i.e. his religious knowledge.)\" One day `Umar called me and made me sit in the gathering of those people; and I think that he called me just to show them. (my religious knowledge). `Umar then asked them (in my presence). \"What do you say about the interpretation of the Statement of Allah: 'When comes Help of Allah (to you O, Muhammad against your enemies) and the conquest (of Mecca).' (110.1) Some of them said, \"We are ordered to praise Allah and ask for His forgiveness when Allah's Help and the conquest (of Mecca) comes to us.\" Some others kept quiet and did not say anything. On that, `Umar asked me, \"Do you say the same, O Ibn `Abbas?\" I replied, \"No.\" He said, 'What do you say then?\" I replied, \"That is the sign of the death of Allah's Apostle which Allah informed him of. Allah said:-- '(O Muhammad) When comes the Help of Allah (to you against your enemies) and the conquest (of Mecca) (which is the sign of your death). You should celebrate the praises of your Lord and ask for His Forgiveness, and He is the One Who accepts the repentance and forgives.' (110.3) On that `Umar said, \"I do not know anything about it other than what you have said.\"",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5088",
      "hadith_no": "5088",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، قال إن الذي تدعونه المفصل هو المحكم، قال وقال ابن عباس توفي رسول الله صلى الله عليه وسلم وأنا ابن عشر سنين وقد قرأت المحكم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Those Suras which you people call the Mufassal, are the Muhkam. And Ibn `Abbas said, \"Allah's Apostle died when I was a boy of ten years, and I had learnt the Muhkam (of the Qur'an).",
      "usc_msa_ref": "554",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-5089",
      "hadith_no": "5089",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  جمعت المحكم في عهد رسول الله صلى الله عليه وسلم فقلت له وما المحكم قال المفصل‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"I have learnt all the Muhkam Suras during the life time of Allah's Apostle.\" I said to him, 'What is meant by the Muhkam?\" He replied, \"The Mufassal.\"",
      "usc_msa_ref": "555",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5443",
      "hadith_no": "5443",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن أم حفيد بنت الحارث بن حزن   خالة ابن عباس  أهدت إلى النبي صلى الله عليه وسلم سمنا وأقطا وأضبا، فدعا بهن فأكلن على مائدته، وتركهن النبي صلى الله عليه وسلم كالمستقذر لهن، ولو كن حراما ما أكلن على مائدة النبي صلى الله عليه وسلم ولا أمر بأكلهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     that his aunt, Um Hufaid bint Al-Harith bin Hazn, presented to the Prophet butter, dried yoghurt and mastigures. The Prophet invited the people to those mastigures and they were eaten on his dining sheet, but the Prophet did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, the people would not have eaten it on the dining sheet of the Prophet nor would he have ordered that they be eaten.",
      "usc_msa_ref": "301",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5457",
      "hadith_no": "5457",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن أبي بشر، عن سعيد، عن ابن عباس  رضى الله عنهما  قال أهدت خالتي إلى النبي صلى الله عليه وسلم ضبابا وأقطا ولبنا، فوضع الضب على مائدته، فلو كان حراما لم يوضع وشرب اللبن، وأكل الأقط‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     My aunt presented (roasted) mastigures, Iqt and milk to the Prophet . The mastigures were put on his dining sheet, and if it was unlawful to eat, it would not have been put there. The Prophet drank the milk and ate the Iqt only.",
      "usc_msa_ref": "314",
      "chain": [
        "20285",
        "20020",
        "11419",
        "11168",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5573",
      "hadith_no": "5573",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، قال كنت عند ابن عمر فمروا بفتية أو بنفر نصبوا دجاجة يرمونها، فلما رأوا ابن عمر تفرقوا عنها، وقال ابن عمر من فعل هذا إن النبي صلى الله عليه وسلم لعن من فعل هذا‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     While I was with Ibn `Umar, we passed by a group of young men who had tied a hen and started shooting at it. When they saw Ibn `Umar, they dispersed, leaving it. On that Ibn `Umar said, \"Who has done this? The Prophet cursed the one who did so.\"",
      "usc_msa_ref": "423",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-5795",
      "hadith_no": "5795",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري  رضى الله عنه  أن ناسا من أصحاب النبي صلى الله عليه وسلم أتوا على حى من أحياء العرب فلم يقروهم، فبينما هم كذلك إذ لدغ سيد أولئك فقالوا هل معكم من دواء أو راق فقالوا إنكم لم تقرونا، ولا نفعل حتى تجعلوا لنا جعلا‏.‏ فجعلوا لهم قطيعا من الشاء، فجعل يقرأ بأم القرآن، ويجمع بزاقه، ويتفل، فبرأ، فأتوا بالشاء، فقالوا لا نأخذه حتى نسأل النبي صلى الله عليه وسلم فسألوه فضحك وقال ‏\"‏ وما أدراك أنها رقية، خذوها، واضربوا لي بسهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some of the companions of the Prophet came across a tribe amongst the tribes of the Arabs, and that tribe did not entertain them. While they were in that state, the chief of that tribe was bitten by a snake (or stung by a scorpion). They said, (to the companions of the Prophet ), \"Have you got any medicine with you or anybody who can treat with Ruqya?\" The Prophet's companions said, \"You refuse to entertain us, so we will not treat (your chief) unless you pay us for it.\" So they agreed to pay them a flock of sheep. One of them (the Prophet's companions) started reciting Surat-al-Fatiha and gathering his saliva and spitting it (at the snake-bite). The patient got cured and his people presented the sheep to them, but they said, \"We will not take it unless we ask the Prophet (whether it is lawful).\" When they asked him, he smiled and said, \"How do you know that Surat-al-Fatiha is a Ruqya? Take it (flock of sheep) and assign a share for me.\"",
      "usc_msa_ref": "632",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-5808",
      "hadith_no": "5808",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد، أن رهطا، من أصحاب رسول الله صلى الله عليه وسلم انطلقوا في سفرة سافروها، حتى نزلوا بحى من أحياء العرب فاستضافوهم، فأبوا أن يضيفوهم، فلدغ سيد ذلك الحى، فسعوا له بكل شىء لا ينفعه شىء، فقال بعضهم لو أتيتم هؤلاء الرهط الذين قد نزلوا بكم، لعله أن يكون عند بعضهم شىء‏.‏ فأتوهم فقالوا يا أيها الرهط إن سيدنا لدغ، فسعينا له بكل شىء، لا ينفعه شىء، فهل عند أحد منكم شىء فقال بعضهم نعم، والله إني لراق، ولكن والله لقد استضفناكم فلم تضيفونا، فما أنا براق لكم حتى تجعلوا لنا جعلا‏.‏ فصالحوهم على قطيع من الغنم، فانطلق فجعل يتفل ويقرأ ‏{‏الحمد لله رب العالمين‏}‏ حتى لكأنما نشط من عقال، فانطلق يمشي ما به قلبة‏.‏ قال فأوفوهم جعلهم الذي صالحوهم عليه، فقال بعضهم اقسموا‏.‏ فقال الذي رقى لا تفعلوا حتى نأتي رسول الله صلى الله عليه وسلم فنذكر له الذي كان، فننظر ما يأمرنا‏.‏ فقدموا على رسول الله صلى الله عليه وسلم فذكروا له فقال ‏\"‏ وما يدريك أنها رقية أصبتم اقسموا واضربوا لي معكم بسهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     A group of the companions of Allah's Apostle proceeded on a journey till they dismounted near one of the Arab tribes and requested them to entertain them as their guests, but they (the tribe people) refused to entertain them. Then the chief of that tribe was bitten by a snake (or stung by a scorpion) and he was given all sorts of treatment, but all in vain. Some of them said, \"Will you go to the group (those travelers) who have dismounted near you and see if one of them has something useful?\" They came to them and said, \"O the group! Our leader has been bitten by a snake (or stung by a scorpion) and we have treated him with everything but nothing benefited him Has anyone of you anything useful?\" One of them replied, \"Yes, by Allah, I know how to treat with a Ruqya. But. by Allah, we wanted you to receive us as your guests but you refused. I will not treat your patient with a Ruqya till you fix for us something as wages.\" Consequently they agreed to give those travellers a flock of sheep. The man went with them (the people of the tribe) and started spitting (on the bite) and reciting Surat-al-Fatiha till the patient was healed and started walking as if he had not been sick. When the tribe people paid them their wages they had agreed upon, some of them (the Prophet's companions) said, \"Distribute (the sheep).\" But the one who treated with the Ruqya said, \"Do not do that till we go to Allah's Apostle and mention to him what has happened, and see what he will order us.\" So they came to Allah's Apostle and mentioned the story to him and he said, \"How do you know that Surat-al-Fatiha is a Ruqya? You have done the right thing. Divide (what you have got) and assign for me a share with you.\"",
      "usc_msa_ref": "645",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-5980",
      "hadith_no": "5980",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الفضل بن عنبسة، أخبرنا هشيم، أخبرنا أبو بشر، ح وحدثنا قتيبة، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بت ليلة عند ميمونة بنت الحارث خالتي، وكان رسول الله صلى الله عليه وسلم عندها في ليلتها  قال  فقام رسول الله صلى الله عليه وسلم يصلي من الليل، فقمت عن يساره  قال  فأخذ بذؤابتي فجعلني عن يمينه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I stayed overnight in the house of my aunt Maimuna bint Al-Harith and Allah's Apostle was with her as it was her turn. Allah's Apostle got up to offer the night prayer. I stood on his left but he took hold of my two locks of hair and made me stand on his right.",
      "usc_msa_ref": "801",
      "chain": [
        "30026",
        "30366",
        "20468",
        "11419",
        "30367",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6658",
      "hadith_no": "6658",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عمرو بن محمد، حدثنا هشيم، أخبرنا أبو بشر، وعطاء بن السائب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنه  قال الكوثر الخير الكثير الذي أعطاه الله إياه‏.‏ قال أبو بشر قلت لسعيد إن أناسا يزعمون أنه نهر في الجنة‏.‏ فقال سعيد النهر الذي في الجنة من الخير الذي أعطاه الله إياه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The word 'Al-Kauthar' means the abundant good which Allah gave to him (the Prophet Muhammad). Abu Bishr said: I said to Sa`id, \"Some people claim that it (Al-Kauthar) is a river in Paradise.\" Sa`id replied, \"The river which is in Paradise is one item of that good which Allah has bestowed upon him (Muhammad).",
      "usc_msa_ref": "580",
      "chain": [
        "30263",
        "20468",
        "11419",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6677",
      "hadith_no": "6677",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال سئل النبي صلى الله عليه وسلم عن أولاد المشركين فقال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet ; was asked about the offspring of the pagans. He said, \"Allah knows what they would have done (were they to live).",
      "usc_msa_ref": "596",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6782",
      "hadith_no": "6782",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن أبي بشر، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال أتى رجل النبي صلى الله عليه وسلم فقال له إن أختي نذرت أن تحج وإنها ماتت‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو كان عليها دين أكنت قاضيه ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاقض الله، فهو أحق بالقضاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man came to the Prophet and said to him, \"My sister vowed to perform the Hajj, but she died (before fulfilling it).\" The Prophet said, \"Would you not have paid her debts if she had any?\" The man said, \"Yes.\" The Prophet said, \"So pay Allah's Rights, as He is more entitled to receive His rights.\"",
      "usc_msa_ref": "690",
      "chain": [
        "20404",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7401",
      "hadith_no": "7401",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن امرأة، جاءت إلى النبي صلى الله عليه وسلم فقالت إن أمي نذرت أن تحج فماتت قبل أن تحج أفأحج عنها قال ‏\"‏ نعم حجي عنها، أرأيت لو كان على أمك دين أكنت قاضيته ‏\"‏‏.‏ قالت نعم‏.‏ فقال ‏\"‏ فاقضوا الذي له، فإن الله أحق بالوفاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman came to the Prophet and said, \"My mother vowed to perform the Hajj but she died before performing it. Should I perform the Hajj on her behalf?\" He said, \"Yes! Perform the Hajj on her behalf. See, if your mother had been in debt, would you have paid her debt?\" She said, \"Yes.\" He said, \"So you should pay what is for Him as Allah has more right that one should fulfill one's obligations to Him. \"",
      "usc_msa_ref": "418",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7445",
      "hadith_no": "7445",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن أم حفيد بنت الحارث بن حزن، أهدت إلى النبي صلى الله عليه وسلم سمنا وأقطا وأضبا، فدعا بهن النبي صلى الله عليه وسلم فأكلن على مائدته، فتركهن النبي صلى الله عليه وسلم كالمتقذر له، ولو كن حراما ما أكلن على مائدته، ولا أمر بأكلهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Um Hufaid bint Al-Harith bin Hazn presented the Prophet with some butter, dried yoghurt (curd milk) and mastigures as a gift. The Prophet then asked for a meal (mastigures etc. to be put) and it was eaten over his table cloth, but the Prophet did not eat of it, as he had aversion to it. But if it had been illegal to eat, it would not have been eaten over his table cloth nor would he have ordered that (mastigures meat) to be eaten.",
      "usc_msa_ref": "457",
      "chain": [
        "20040",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7582",
      "hadith_no": "7582",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، عن هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال أنزلت ورسول الله صلى الله عليه وسلم متوار بمكة، فكان إذا رفع صوته سمع المشركون فسبوا القرآن ومن أنزله ومن جاء به‏.‏ وقال الله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ لا تجهر بصلاتك حتى يسمع المشركون، ولا تخافت بها عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏ أسمعهم ولا تجهر حتى يأخذوا عنك القرآن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding the Verse):-- 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Apostle was hiding himself in Mecca, and when he raised his voice while reciting the Qur'an, the pagans would hear him and abuse the Qur'an and its Revealer and to the one who brought it. So Allah said:-- 'Neither say your prayer aloud, nor say it in a low tone.' (17.110) That is, 'Do not say your prayer so loudly that the pagans can hear you, nor say it in such a low tone that your companions do not hear you.' But seek a middle course between those (extremes), i.e., let your companions hear, but do not relate the Qur'an loudly, so that they may learn it from you.",
      "usc_msa_ref": "582",
      "chain": [
        "30175",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7619",
      "hadith_no": "7619",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني عمرو بن زرارة، عن هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  في قوله تعالى ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة، فكان إذا صلى بأصحابه رفع صوته بالقرآن، فإذا سمعه المشركون سبوا القرآن ومن أنزله ومن جاء به، فقال الله لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك‏}‏ أى بقراءتك، فيسمع المشركون، فيسبوا القرآن ‏{‏ولا تخافت بها‏}‏ عن أصحابك فلا تسمعهم ‏{‏وابتغ بين ذلك سبيلا‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     regarding the explanation of the Verse:-- '(O Muhammad!) Neither say your prayer aloud, nor say it in a low tone.' (17.110) This Verse was revealed while Allah's Apostle was hiding himself at Mecca. At that time, when he led his companions in prayer, he used to raise his voice while reciting the Qur'an; and if the pagans heard him, they would abuse the Qur'an, its Revealer, and the one who brought it. So Allah said to His Prophet: \"Neither say your prayer aloud. i.e., your recitation (of Qur'an) lest the pagans should hear (it) and abuse the Qur'an\" nor say it in a low tone, \"lest your voice should fail to reach your companions, \"but follow a way between.\" (17.110)",
      "usc_msa_ref": "616",
      "chain": [
        "30365",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7642",
      "hadith_no": "7642",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم متواريا بمكة، وكان يرفع صوته، فإذا سمع المشركون سبوا القرآن ومن جاء به، فقال الله عز وجل لنبيه صلى الله عليه وسلم ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was hiding himself in Mecca and used to recite the (Qur'an) in a loud voice. When the pagans heard him they would abuse the Qur'an and the one who brought it, so Allah said to His Prophet: 'Neither say your prayer aloud, nor say it in a low tone.' (17.110)",
      "usc_msa_ref": "637",
      "chain": [
        "20219",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-241-4",
      "hadith_no": "241",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا شيبان بن فروخ، وأبو كامل الجحدري جميعا عن أبي عوانة، - قال أبو كامل حدثنا أبو عوانة، - عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف عنا النبي صلى الله عليه وسلم في سفر سافرناه فأدركنا وقد حضرت صلاة العصر فجعلنا نمسح على أرجلنا فنادى ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr reported:                      The Messenger of Allah (may peace be upon him) lagged behind us on a journey. We travelled (back) and be took him; and then came the time of the afternoon prayer, and as we were going to wipe our feet he (the Holy Prophet) called out: Woe to the heels because of Hell-fire.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "30559",
        "20469",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-328-2",
      "hadith_no": "328",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، وإسماعيل بن سالم، قالا أخبرنا هشيم، عن أبي بشر، عن أبي سفيان، عن جابر بن عبد الله، أن وفد، ثقيف سألوا النبي صلى الله عليه وسلم فقالوا إن أرضنا أرض باردة فكيف بالغسل فقال ‏\"‏ أما أنا فأفرغ على رأسي ثلاثا ‏\"‏ ‏.‏ قال ابن سالم في روايته حدثنا هشيم أخبرنا أبو بشر وقال إن وفد ثقيف قالوا يا رسول الله ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      A delegation of the Thaqif said to the Apostle of Allah (may peace be upon him): Our land is cold; what about our bathing then? He (the Holy Prophet) said: I pour water thrice over my head.Ibn Salim in his narration reported:\" The delegation of the Thaqif said: Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30415",
        "20468",
        "11419",
        "116",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-446-2",
      "hadith_no": "446",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو جعفر، محمد بن الصباح وعمرو الناقد جميعا عن هشيم، - قال ابن الصباح حدثنا هشيم، - أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، في قوله عز وجل ‏{‏ ولا تجهر بصلاتك ولا تخافت بها‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم متوار بمكة فكان إذا صلى بأصحابه رفع صوته بالقرآن فإذا سمع ذلك المشركون سبوا القرآن ومن أنزله ومن جاء به فقال الله تعالى لنبيه صلى الله عليه وسلم ‏{‏ ولا تجهر بصلاتك‏}‏ فيسمع المشركون قراءتك ‏{‏ ولا تخافت بها‏}‏ عن أصحابك أسمعهم القرآن ولا تجهر ذلك الجهر وابتغ بين ذلك سبيلا يقول بين الجهر والمخافتة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The word of (Allah) Great and Glorious: 'And utter not thy prayer loudly, nor be low in it\" (xvii. 110) was revealed as the Messenger of Allah (may peace beupon him) was hiding himself in Mecca. When he led his Companions in prayer he raised his voice (while reciting the) Qur'an. And when the polytheists heard that, they reviled the Qur'an and Him Who revealed it and him who brought it. Upon this Allah, the Exalted, said to His Apostle (may peace be upon him): Utter not thy prayer so loudly that the polytheists may hear thy recitation and (recite it) not so low that it may be inaudible to your Companions. Make them hear the Qur'an, but do not recite it loudly and seek a (middle) way between these. Recite between loud and low tone.",
      "usc_msa_ref": "",
      "chain": [
        "20468",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-449-2",
      "hadith_no": "449",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال ما قرأ رسول الله صلى الله عليه وسلم على الجن وما رآهم انطلق رسول الله صلى الله عليه وسلم في طائفة من أصحابه عامدين إلى سوق عكاظ وقد حيل بين الشياطين وبين خبر السماء وأرسلت عليهم الشهب فرجعت الشياطين إلى قومهم فقالوا ما لكم قالوا حيل بيننا وبين خبر السماء وأرسلت علينا الشهب ‏.‏ قالوا ما ذاك إلا من شىء حدث فاضربوا مشارق الأرض ومغاربها فانظروا ما هذا الذي حال بيننا وبين خبر السماء ‏.‏ فانطلقوا يضربون مشارق الأرض ومغاربها فمر النفر الذين أخذوا نحو تهامة - وهو بنخل - عامدين إلى سوق عكاظ وهو يصلي بأصحابه صلاة الفجر فلما سمعوا القرآن استمعوا له وقالوا هذا الذي حال بيننا وبين خبر السماء ‏.‏ فرجعوا إلى قومهم فقالوا يا قومنا ‏{‏ إنا سمعنا قرآنا عجبا * يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا‏}‏ فأنزل الله عز وجل على نبيه محمد صلى الله عليه وسلم ‏{‏ قل أوحي إلى أنه استمع نفر من الجن‏}‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) neither recited the Qur'an to the Jinn nor did he see them. The Messenger of Allah (may peace be upon him) went out with some of his Companions with the intention of going to the bazaar of 'Ukaz And there had been (at that time) obstructions between satans and the news from the Heaven, and there were flung flames upon them. So satan went back to their people and they said: What has happened to you? They said: There have been created obstructions between us and the news from the Heaven. And there have been flung upon us flames. They said: It cannot happen but for some (important) event. So traverse the eastern parts of the earth and the western parts and find out why is it that there have been created obstructions between us and the news from the Heaven. So they went forth and traversed the easts of the earth and its wests. Some of them proceeded towards Tihama and that is a nakhl towards the bazaar of 'Ukaz and he (the Holy Prophet) was leading his Companions in the morning prayer. So when they heard the Qur'an. they listened to it attentively and said: It is this which has caused obstruction between us and news from the Heaven. They went back to their people and said: O our people, we have heard a strange Qur'an which directs us to the right path; so we affirm our faith in it and we would never associate anyone with our Lord. And Allah, the Exalted and Glorious, revealed to His Apostle Muhammad (may peace be upon him):\" It has been revealed to me that a party of Jinn listened to it\" (Qur'an, lxxii. 1).",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2712",
      "hadith_no": "2712",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن، عباس - رضى الله عنهما - قال قدم رسول الله صلى الله عليه وسلم المدينة فوجد اليهود يصومون يوم عاشوراء فسئلوا عن ذلك فقالوا هذا اليوم الذي أظهر الله فيه موسى وبني إسرائيل على فرعون فنحن نصومه تعظيما له ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نحن أولى بموسى منكم ‏\"‏ ‏.‏ فأمر بصومه ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with both of them) reported that when Allah's Messenger (may peace be upon him) came to Medina, he found the Jews observing the fast on the day of Ashura. They (the Jews) were asked about it and they said:                      It is the day on which Allah granted victory to Moses and (his people) Bani Isra'il over the Pharaoh and we observe fast out of gratitude to Him. Upon this the Apostle of Allah (may peace be upon him) said: We have a closer connection with Moses than you have, and he commanded to observe fast on this day.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2780",
      "hadith_no": "2780",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال ما صام رسول الله صلى الله عليه وسلم شهرا كاملا قط غير رمضان ‏.‏ وكان يصوم إذا صام حتى يقول القائل لا والله لا يفطر ‏.‏ ويفطر إذا أفطر حتى يقول القائل لا والله لا يصوم ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with both of them) reported:                      The Messenger of Allah (may peace be upon him) did not fast throughout any month except during ramadan. And when he observed fast (he fasted so continuously) that one would say that he would not break (them) and when he Abandoned, he abandoned (so continuously) that one would say: By Allah, perhaps he would never fast.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2812",
      "hadith_no": "2812",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني قتيبة بن سعيد، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن، الحميري عن أبي هريرة، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد رمضان شهر الله المحرم وأفضل الصلاة بعد الفريضة صلاة الليل ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent fast after Ramadan is God's month. al-Muharram, and the most excellent prayer after what is prescribed is prayer during the night.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11280",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2954",
      "hadith_no": "2954",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن الصباح، حدثنا هشيم، أخبرنا أبو بشر، حدثنا سعيد بن جبير، عن ابن عباس، رضى الله عنهما ح . وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا هشيم، عن أبي بشر، عن سعيد، بن جبير عن ابن عباس، رضى الله عنهما أن رجلا، كان مع رسول الله صلى الله عليه وسلم محرما فوقصته ناقته فمات فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر وكفنوه في ثوبيه ولا تمسوه بطيب ولا تخمروا رأسه فإنه يبعث يوم القيامة ملبدا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that when a person who was in the state of Ihram was in the company of the Messenger of Allah (may peace be upon him), his camel broke his neckand he died. Upon this the Messenger of Allah (may peace be upon him) said:                      Bathe him with water (mixed with the leaves) of the lute tree and shroud him in his two (pieces of) cloth and, neither perfume him nor cover his head, for he would be raised on the Day of Resurrection pronouncing Talbiya.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2956",
      "hadith_no": "2956",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - أن رجلا، وقصه بعيره وهو محرم مع رسول الله صلى الله عليه وسلم فأمر به رسول الله صلى الله عليه وسلم أن يغسل بماء وسدر ولا يمس طيبا ولا يخمر رأسه فإنه يبعث يوم القيامة ملبدا ‏.‏",
      "text_en": " Sa'id b. Jubair reported on the authority of Ibn 'Abbas (Allah be pleased with them) that a camel broke the neck of its owner while he was in the state of lhram and he was at that time in the company of the Messenger of Allah (may peace be upon him). Allah's Messenger (may peace be upon him) commanded that he should be bathed with water mixed with (leaves of the) lote (tree) and no perfume should be applied to him and his head should not be covered, for he would be raised on the Day of Resurrection pronouncing Talblya.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2957",
      "hadith_no": "2957",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن بشار، وأبو بكر بن نافع قال ابن نافع أخبرنا غندر، حدثنا شعبة، قال سمعت أبا بشر، يحدث عن سعيد بن جبير، أنه سمع ابن عباس، - رضى الله عنهما - يحدث أن رجلا أتى النبي صلى الله عليه وسلم وهو محرم فوقع من ناقته فأقعصته فأمر النبي صلى الله عليه وسلم أن يغسل بماء وسدر وأن يكفن في ثوبين ولا يمس طيبا خارج رأسه ‏.‏ قال شعبة ثم حدثني به بعد ذلك خارج رأسه ووجهه فإنه يبعث يوم القيامة ملبدا ‏.‏",
      "text_en": " Sa'id b. Jubair heard Ibn 'Abbas (Allah be pleased with them) as saying:                      A person came to Allah's Apostle (may peace be upon him) while he was in the state of lhram. He fell down from his camel and broke his neck. Thereupon Allah's Apostle (may peace be upon him) commanded to bathe him with water (mixed with the leaves of) the lote (tree), and shroud him in two (pieces of) cloth and not to apply perfume (to him), keeping his head out (of the shroud). Shu'ba said: He then narrated to me after this (the words)\" keeping his head out,\" his face out, for he would be raised on the Day of Resurrection pronouncing Talbiya.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20523",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3005",
      "hadith_no": "3005",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن معمر بن ربعي القيسي، حدثنا أبو هشام المغيرة بن سلمة، المخزومي عن أبي عوانة، عن أبي بشر، عن عطاء بن أبي رباح، عن جابر بن عبد الله، - رضى الله عنهما - قال قدمنا مع رسول الله صلى الله عليه وسلم مهلين بالحج فأمرنا رسول الله صلى الله عليه وسلم أن نجعلها عمرة ونحل - قال - وكان معه الهدى فلم يستطع أن يجعلها عمرة ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We set out with Allah's Messenger (may peace be upon him) as Muhrim for Hajj. The Messenger of Allah (may peace be upon him) commanded us to make this Ihram for Umra, and some put it off (af ter performing 'Umra), but the Prophet (may peace be upon him) had sacrificial animals with him, so he could not make it (this Ihram) as that of Umra.",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20469",
        "11419",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5106",
      "hadith_no": "5106",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن أبي بشر، ح وحدثنا أحمد بن حنبل، حدثنا هشيم، قال أبو بشر أخبرنا عن ميمون بن مهران، عن ابن عباس، قال نهى ح",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Abbas through a different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11419",
        "30007",
        "20468",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5107",
      "hadith_no": "5107",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو كامل الجحدري، حدثنا أبو عوانة، عن أبي بشر، عن ميمون بن مهران، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم بمثل حديث شعبة عن الحكم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5151",
      "hadith_no": "5151",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن بشار، وأبو بكر بن نافع قال ابن نافع أخبرنا غندر، حدثنا  شعبة، عن أبي بشر، عن سعيد بن جبير، قال سمعت ابن عباس، يقول أهدت خالتي أم حفيد إلى رسول الله صلى الله عليه وسلم سمنا وأقطا وأضبا فأكل من السمن والأقط وترك الضب تقذرا وأكل على مائدة رسول الله صلى الله عليه وسلم ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sa'id b. Jubair reported that he heard Ibn 'Abbas says:                      The sister of my mother Umm Hufaid presented to Allah's Messenger (may peace be upon him) clarified butter (ghee), cheese and some lizards. He ate out of the clarified butter and cheese, but lett the lizard finding no liking for it. But it was eaten on the table of Allah's Messenger (may peace be upon him). Had it been forbidden (haram), it could not be eaten on the table of Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20523",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5173",
      "hadith_no": "5173",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا شيبان بن فروخ، وأبو كامل - واللفظ لأبي كامل - قالا حدثنا أبو عوانة عن أبي بشر، عن سعيد بن جبير، قال مر ابن عمر بنفر قد نصبوا دجاجة يترامونها فلما رأوا ابن عمر تفرقوا عنها ‏.‏ فقال ابن عمر من فعل هذا إن رسول الله صلى الله عليه وسلم لعن من فعل هذا ‏.‏",
      "text_en": " Sa'id b. Jubair reported that Ibn 'Umar happened to pass by a party of men who had tied a hen and were shooting arrows at it. As soon as they saw Ibn 'Umar, they scattered from it. Thereupon Ibn Umar said:                      Who has done this? Verily Allah's Messenger (may peace be upon him) has invoked curse upon him who does this.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20469",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-5174",
      "hadith_no": "5174",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني زهير بن حرب، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، قال مر ابن عمر بفتيان من قريش قد نصبوا طيرا وهم يرمونه وقد جعلوا لصاحب الطير كل خاطئة من نبلهم فلما رأوا ابن عمر تفرقوا فقال ابن عمر من فعل هذا لعن الله من فعل هذا إن رسول الله صلى الله عليه وسلم لعن من اتخذ شيئا فيه الروح غرضا ‏.‏",
      "text_en": " Sa'id b. Jubair reported that Ibn 'Umar happened to pass by some young men of the Quraish who had tied a bird (and th, is made it a target) at which they had been shooting arrows Every arrow that they missed came into the possession of the owner of the bird. So no sooner did they see Ibn 'Umar they went away. Thereupon Ibn 'Umar said:                      Who has done this? Allah has cursed him who does this. Verily Allah's Messenger (may peace be upon him) invoked curse upon one who made a live thing the target (of one's marksmanship).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-5473",
      "hadith_no": "5473",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو عوانة، عن أبي بشر، عن أبي سفيان، عن  جابر بن عبد الله، أن النبي صلى الله عليه وسلم سأل أهله الأدم فقالوا ما عندنا إلا خل ‏.‏ فدعا به فجعل يأكل به ويقول ‏\"‏ نعم الأدم الخل نعم الأدم الخل ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) asked his family for condiment. They (the members of his household) said:                      We have nothing with us but vinegar. He asked for it, he began to eat it, and then said: Vinegar is a good condiment, vinegar is a good condiment.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20469",
        "11419",
        "116",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5863",
      "hadith_no": "5863",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا هشيم، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، أن ناسا، من أصحاب رسول الله صلى الله عليه وسلم كانوا فى سفر فمروا بحى من أحياء العرب فاستضافوهم فلم يضيفوهم ‏.‏ فقالوا لهم هل فيكم راق فإن سيد الحى لديغ أو مصاب ‏.‏ فقال رجل منهم نعم فأتاه فرقاه بفاتحة الكتاب فبرأ الرجل فأعطي قطيعا من غنم فأبى أن يقبلها ‏.‏ وقال حتى أذكر ذلك للنبي صلى الله عليه وسلم ‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له ‏.‏ فقال يا رسول الله والله ما رقيت إلا بفاتحة الكتاب ‏.‏ فتبسم وقال ‏\"‏ وما أدراك أنها رقية ‏\"‏ ‏.‏ ثم قال ‏\"‏ خذوا منهم واضربوا لي بسهم معكم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that some persons amongst the Companions of Allah's Messenger (may peace be upon him) set out on a journey and they happened to pass by a tribe from the tribes of Arabia. They demanded hospitality from the members of that tribe, but they did not extend any hospitality to them. They said to them:                      Is there any incantator amongst you, at the chief of the tribe has bgen stung by a scorpion? A person amongst us said: 'Yes. So he came to him and he practised incan- tation with the help of Sura al-Fatiha and the person became all right. He was given a flock of sheep (as recompense), but he refused to accept that, saying: I shall make a mention of it to Allah's Apostle (may peace be upon him), and if he approves of it. then I shall accept it. So we came to Allah's Apostle (may peace be upon him) and made a mention of that to him and he (that person) said: Allah's Messenger by Allah, I did not practice incantation but with the help of Sura al-Fatiha of the Holy Book. He (the Holy Prophet) smiled and said: How did you come to know that it can be used (as incactation)? - and then said: Take out of that and allocate a share for me along with your share.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6607",
      "hadith_no": "6607",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبي، حدثنا شعبة، عن أبي بشر، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة وجهينة خير من بني تميم ومن بني عامر والحليفين بني أسد وغطفان ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported from the Messenger of Allah (may peace be upon him) that Aslam, Ghifar, Muzaina and Juhaina are better than Banu Tamim, Banu Amir and their allies Banu Asad and Ghatfan.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11419",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sahih-muslim-6636",
      "hadith_no": "6636",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا هشيم، عن أبي بشر، ح وحدثني إسماعيل، بن سالم أخبرنا هشيم، أخبرنا أبو بشر، عن عبد الله بن شقيق، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي القرن الذين بعثت فيهم ثم الذين يلونهم ‏\"‏ ‏.‏ والله أعلم أذكر الثالث أم لا قال ‏\"‏ ثم يخلف قوم يحبون السمانة يشهدون قبل أن يستشهدوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may, peace be upon him) as saying:                      The best age of my Umma is one in which I was sent (by Allah as an Apostle), then the one next to that. (The narrator said): And Allah knows best whether he stated this third (time) or not. Then there would come people who would love (to look) bulky and they would hasten to the witness box before they are asked to bear witness.",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11419",
        "30415",
        "20468",
        "11419",
        "10694",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6936",
      "hadith_no": "6936",
      "source": "Sahih Muslim",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال سئل رسول الله صلى الله عليه وسلم عن أطفال المشركين قال ‏\"‏ الله أعلم بما كانوا عاملين إذ خلقهم ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) was asked about the children of the polytheists, whereupon he said:                      It is Allah alone Who knows what they would be doing according to their creation.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-7743",
      "hadith_no": "7743",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثني عبد الله بن مطيع، حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، قال قلت لابن عباس سورة التوبة قال آلتوبة قال بل هي الفاضحة ما زالت تنزل ومنهم ومنهم ‏.‏ حتى ظنوا أن لا يبقى منا أحد إلا ذكر فيها ‏.‏ قال قلت سورة الأنفال قال تلك سورة بدر ‏.‏ قال قلت فالحشر قال نزلت في بني النضير ‏.‏",
      "text_en": " Sa'id b. Jubair reported:                      I said to Ibn 'Abbas about Sura Tauba, whereupon he said: As for Sura Tauba, it is meant to humiliate (the non-believers and the hypocrites). There is constantly revealed in it (the pronoun) minhum (of them) and minhom (of them, i. e. such is the condition of some of them) till they (the Muslims) thought that none would be left unmentioned out of them who would not be blamed (for one fault or the other). I again said: What about Sura Anfal? He said: It pertains to the Battle of Badr. I again asked him about Sura al-Hashr. He said: It was revealed in connection with (the tribe) of Banu Nadir.",
      "usc_msa_ref": "",
      "chain": [
        "30509",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-305",
      "hadith_no": "305",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا هشيم، أخبرنا أبو بشر، عن عكرمة، أن أم حبيبة بنت جحش، استحيضت فأمرها النبي صلى الله عليه وسلم أن تنتظر أيام أقرائها ثم تغتسل وتصلي فإن رأت شيئا من ذلك توضأت وصلت ‏.‏",
      "text_en": " Narrated Umm Habibah daughter of Jahsh:                     Ikrimah said: Umm Habibah daughter of Jahsh had a prolonged flow of blood. The Prophet (ﷺ) commanded her to refrain (from prayer) during her menstrual period; then she should wash and pray, if she sees anything (which renders ablution void) she should perform ablution and pray.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11023",
        "72"
      ]
    },
    {
      "id": "sunan-abi-daud-419",
      "hadith_no": "419",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بوقت هذه الصلاة صلاة العشاء الآخرة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     I am the one who is best informed of the time of this prayer, i.e. the night prayer. The Messenger of Allah (ﷺ) used to offer it at the hour when the moon went down on its third night.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-abi-daud-498",
      "hadith_no": "498",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباد بن موسى الختلي، وزياد بن أيوب، - وحديث عباد أتم - قالا حدثنا هشيم، عن أبي بشر، - قال زياد أخبرنا أبو بشر، - عن أبي عمير بن أنس، عن عمومة، له من الأنصار قال اهتم النبي صلى الله عليه وسلم للصلاة كيف يجمع الناس لها فقيل له انصب راية عند حضور الصلاة فإذا رأوها آذن بعضهم بعضا فلم يعجبه ذلك قال فذكر له القنع - يعني الشبور - وقال زياد شبور اليهود فلم يعجبه ذلك وقال ‏\"‏ هو من أمر اليهود ‏\"‏ ‏.‏ قال فذكر له الناقوس فقال ‏\"‏ هو من أمر النصارى ‏\"‏ ‏.‏ فانصرف عبد الله بن زيد بن عبد ربه وهو مهتم لهم رسول الله صلى الله عليه وسلم فأري الأذان في منامه - قال - فغدا على رسول الله صلى الله عليه وسلم فأخبره فقال له يا رسول الله إني لبين نائم ويقظان إذ أتاني آت فأراني الأذان ‏.‏ قال وكان عمر بن الخطاب - رضى الله عنه - قد رآه قبل ذلك فكتمه عشرين يوما - قال - ثم أخبر النبي صلى الله عليه وسلم فقال له ‏\"‏ ما منعك أن تخبرني ‏\"‏ ‏.‏ فقال سبقني عبد الله بن زيد فاستحييت فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فانظر ما يأمرك به عبد الله بن زيد فافعله ‏\"‏ ‏.‏ قال فأذن بلال ‏.‏ قال أبو بشر فأخبرني أبو عمير أن الأنصار تزعم أن عبد الله بن زيد لولا أنه كان يومئذ مريضا لجعله رسول الله صلى الله عليه وسلم مؤذنا ‏.‏",
      "text_en": " Narrated AbuUmayr ibn Anas:                     AbuUmayr reported on the authority of his uncle who was from the Ansar (the helpers of the Prophet): The Prophet (ﷺ) was anxious as to how to gather the people for prayer.  The people told him: Hoist a flag at the time of prayer; when they see it, they will inform one another. But he (the Prophet) did not like it. Then someone mentioned to him the horn.  Ziyad said: A horn of the Jews. He (the Prophet) did not like it. He said: This is the matter of the Jews. Then they mentioned to him the bell of the Christians.  He said: This is the matter of the Christians.  Abdullah ibn Zayd returned anxiously from there because of the anxiety of the Apostle (ﷺ). He was then taught the call to prayer in his dream. Next day he came to the Messenger of Allah (ﷺ) and informed him about it.  He said: Messenger of Allah, I was between sleep and wakefulness; all of a sudden a newcomer came (to me) and taught me the call to prayer. Umar ibn al-Khattab had also seen it in his dream before, but he kept it hidden for twenty days.  The Prophet (ﷺ) said to me (Umar): What did prevent you from saying it to me?  He said: Abdullah ibn Zayd had already told you about it before me: hence I was ashamed.  Then the Messenger of Allah (ﷺ) said: Bilal, stand up, see what Abdullah ibn Zayd tells you (to do), then do it. Bilal then called them to prayer.  AbuBishr reported on the authority of AbuUmayr: The Ansar thought that if Abdullah ibn Zayd had not been ill on that day, the Messenger of Allah (ﷺ) would have made him mu'adhdhin.",
      "usc_msa_ref": "",
      "chain": [
        "30255",
        "30249",
        "20468",
        "11419",
        "11339",
        "11419"
      ]
    },
    {
      "id": "sunan-abi-daud-611",
      "hadith_no": "611",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، في هذه القصة قال فأخذ برأسي أو بذؤابتي فأقامني عن يمينه ‏.‏",
      "text_en": " Another version of this tradition transmitted through a different chain of narrators by Ibn ‘Abbas says:                      “He took my head or the hair of my head and made me stand on his right side”.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-971",
      "hadith_no": "971",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، حدثني أبي، حدثنا شعبة، عن أبي بشر، سمعت مجاهدا، يحدث عن ابن عمر، عن رسول الله صلى الله عليه وسلم في التشهد ‏\"‏ التحيات لله الصلوات الطيبات السلام عليك أيها النبي ورحمة الله وبركاته ‏\"‏ ‏.‏ قال قال ابن عمر زدت فيها وبركاته ‏.‏ ‏\"‏ السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال ابن عمر زدت فيها وحده لا شريك له ‏.‏ ‏\"‏ وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (ﷺ) as saying:                      The adoration of the tongue are due to Allah, and acts of worship, all good things. Peace be upon you, O Prophet, and Allah’s mercy and His blessings. Ibn ‘Umar said: I added: “And Allah’s blessings, peace be upon us, and upon Allah’s upright servants. I testify that there is not god but Allah. “Ibn ‘Umar said: I added to it: He is alone, no one is His associate, and I testify that Muhammad is His servant and His Apostle.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11419",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1664",
      "hadith_no": "1664",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن يعلى المحاربي، حدثنا أبي، حدثنا غيلان، عن جعفر بن إياس، عن مجاهد، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ والذين يكنزون الذهب والفضة ‏}‏ قال كبر ذلك على المسلمين فقال عمر - رضى الله عنه أنا أفرج عنكم ‏.‏ فانطلق فقال يا نبي الله إنه كبر على أصحابك هذه الآية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لم يفرض الزكاة إلا ليطيب ما بقي من أموالكم وإنما فرض المواريث لتكون لمن بعدكم ‏\"‏ ‏.‏ فكبر عمر ثم قال له ‏\"‏ ألا أخبرك بخير ما يكنز المرء المرأة الصالحة إذا نظر إليها سرته وإذا أمرها أطاعته وإذا غاب عنها حفظته ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When this verse was revealed: \"And those who hoard gold and silver,\" the Muslims were grieved about it. Umar said: I shall dispel your care. He, therefore, went and said: Prophet of Allah, your Companions were grieved by this verse. The Messenger of Allah (ﷺ) said: Allah has made zakat obligatory simply to purify your remaining property, and He made inheritances obligatory that they might come to those who survive you. Umar then said: Allah is most great. He then said to him: Let me inform you about the best a man hoards; it is a virtuous woman who pleases him when he looks at her, obeys him when he gives her a command, and guards his interests when he is away from her.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20369",
        "20371",
        "11300",
        "11419",
        "11028",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1820",
      "hadith_no": "1820",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، عن أبي بشر، عن عطاء، عن يعلى بن أمية، وهشيم، عن الحجاج، عن عطاء، عن صفوان بن يعلى، عن أبيه، بهذه القصة قال فيه فقال له النبي صلى الله عليه وسلم ‏\"‏ اخلع جبتك ‏\"‏ ‏.‏ فخلعها من رأسه وساق الحديث ‏.‏",
      "text_en": " This tradition has also been narrated by Ya’la bin Umayyah through a different chain of narrators. This version adds The Prophet (ﷺ) said to him “Take off your tunic”. He then took it off from his head. The narrator then narrated the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20469",
        "11419",
        "11029",
        "20468",
        "20381",
        "11029",
        "11248"
      ]
    },
    {
      "id": "sunan-abi-daud-2429",
      "hadith_no": "2429",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، وقتيبة بن سعيد، قالا حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد شهر رمضان شهر الله المحرم وإن أفضل الصلاة بعد المفروضة صلاة من الليل ‏\"‏ ‏.‏ لم يقل قتيبة ‏\"‏ شهر ‏\"‏ ‏.‏ قال ‏\"‏ رمضان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: The most excellent fast after Ramadan is Allah's month al-Muharram, and the most excellent prayer after the prescribed prayer is the prayer during night.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30367",
        "20469",
        "11419",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2444",
      "hadith_no": "2444",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، قال لما قدم النبي صلى الله عليه وسلم المدينة وجد اليهود يصومون عاشوراء فسئلوا عن ذلك فقالوا هذا اليوم الذي أظهر الله فيه موسى على فرعون ونحن نصومه تعظيما له ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ نحن أولى بموسى منكم ‏\"‏ ‏.‏ وأمر بصيامه ‏.‏",
      "text_en": " Ibn 'Abbas said:                      When the Prophet (ﷺ) came to Medina, he found the Jews observing fast on the day of 'Ashurah; so they were asked about it (by the Prophet). They said: This is a day on which Allah gave Moses domination over Pharaoh. We fast on it out of reverence to him. The Messenger of Allah (ﷺ) said: We have a closer connection with Moses than you have. He then gave orders that it should be observed.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2620",
      "hadith_no": "2620",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي بشر، عن عباد بن شرحبيل، قال أصابتني سنة فدخلت حائطا من حيطان المدينة ففركت سنبلا فأكلت وحملت في ثوبي فجاء صاحبه فضربني وأخذ ثوبي فأتيت رسول الله صلى الله عليه وسلم فقال له ‏\"‏ ما علمت إذ كان جاهلا ولا أطعمت إذ كان جائعا ‏\"‏ ‏.‏ أو قال ‏\"‏ ساغبا ‏\"‏ ‏.‏ وأمره فرد على ثوبي وأعطاني وسقا أو نصف وسق من طعام ‏.‏",
      "text_en": " Narrated Abbad ibn Shurahbil:                     I suffered from drought; so I entered a garden of Medina, and rubbed an ear-corn. I ate and carried in my garment. Then its master came, he beat me and took my garment. He came to the Messenger of Allah (ﷺ) who said to him: You did not teach him if he was ignorant; and you did not feed him if he was hungry. He ordered him, so he returned my garment to me, and gave me one or half a wasq (sixty or thirty sa's) of corn.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11419"
      ]
    },
    {
      "id": "sunan-abi-daud-2621",
      "hadith_no": "2621",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بشر، قال سمعت عباد بن شرحبيل، - رجلا منا من بني غبر - بمعناه ‏.‏",
      "text_en": " Abu Bishr said “I heard ‘Abbad bin ‘Shurahbil a man of us from Banu Ghubar. He narrated the reast of the tradition to the same effect.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419"
      ]
    },
    {
      "id": "sunan-abi-daud-2682",
      "hadith_no": "2682",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عمر بن علي المقدمي، قال حدثنا أشعث بن عبد الله، - يعني السجستاني ح وحدثنا محمد بن بشار، قال حدثنا ابن أبي عدي، وهذا، لفظه ح وحدثنا الحسن بن علي، قال حدثنا وهب بن جرير، عن شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كانت المرأة تكون مقلاتا فتجعل على نفسها إن عاش لها ولد أن تهوده فلما أجليت بنو النضير كان فيهم من أبناء الأنصار فقالوا لا ندع أبناءنا فأنزل الله عز وجل ‏{‏ لا إكراه في الدين قد تبين الرشد من الغى ‏}‏ قال أبو داود المقلات التي لا يعيش لها ولد ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When the children of a woman (in pre-Islamic days) did not survive, she took a vow on herself that if her child survives, she would convert it a Jew. When Banu an-Nadir were expelled (from Arabia), there were some children of the Ansar (Helpers) among them. They said: We shall not leave our children. So Allah the Exalted revealed; \"Let there be no compulsion in religion. Truth stands out clear from error.\"Abu Dawud said: Muqlat means a woman whose children do not survive.",
      "usc_msa_ref": "",
      "chain": [
        "30582",
        "24021",
        "30160",
        "20276",
        "30",
        "20298",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3186",
      "hadith_no": "3186",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو كامل، حدثنا أبو عوانة، عن أبي بشر، حدثني نفر، من أهل البصرة عن أبي برزة الأسلمي، أن رسول الله صلى الله عليه وسلم لم يصل على ماعز بن مالك ولم ينه عن الصلاة عليه ‏.‏",
      "text_en": " Narrated AbuBarzah al-Aslami:                     The Messenger of Allah (ﷺ) did not pray over Ma'iz ibn Malik, and he did not prohibit to pray over him.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20469",
        "11419",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-3308",
      "hadith_no": "3308",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، ‏:‏ أن امرأة، ركبت البحر فنذرت إن نجاها الله أن تصوم شهرا، فنجاها الله فلم تصم حتى ماتت، فجاءت ابنتها أو أختها إلى رسول الله صلى الله عليه وسلم فأمرها أن تصوم عنها ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A woman made a voyage and vowed that she would fast one month if Allah made her reach her destination with peace and security. Allah made her reach her destination with security but she died before she could fast. Her daughter or sister (the narrator doubted) came to the Messenger of Allah (ﷺ). So he commanded to fast on her behalf.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-3418",
      "hadith_no": "3418",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، أن رهطا، من أصحاب رسول الله صلى الله عليه وسلم انطلقوا في سفرة سافروها فنزلوا بحى من أحياء العرب فاستضافوهم فأبوا أن يضيفوهم - قال - فلدغ سيد ذلك الحى فشفوا له بكل شىء لا ينفعه شىء ‏.‏ فقال بعضهم لو أتيتم هؤلاء الرهط الذين نزلوا بكم لعل أن يكون عند بعضهم شىء ينفع صاحبكم فقال بعضهم إن سيدنا لدغ فشفينا له بكل شىء فلا ينفعه شىء فهل عند أحد منكم شىء يشفي صاحبنا يعني رقية ‏.‏ فقال رجل من القوم إني لأرقي ولكن استضفناكم فأبيتم أن تضيفونا ما أنا براق حتى تجعلوا لي جعلا ‏.‏ فجعلوا له قطيعا من الشاء فأتاه فقرأ عليه بأم الكتاب ويتفل حتى برئ كأنما أنشط من عقال فأوفاهم جعلهم الذي صالحوه عليه ‏.‏ فقالوا اقتسموا فقال الذي رقى لا تفعلوا حتى نأتي رسول الله صلى الله عليه وسلم فنستأمره ‏.‏ فغدوا على رسول الله صلى الله عليه وسلم فذكروا له فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أين علمتم أنها رقية أحسنتم واضربوا لي معكم بسهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     Some of the Companions of Prophet (ﷺ) went on a journey. They encamped with a clan of the Arabs and sought hospitality from them, but they refused to provide them with any hospitality. The chief of the clan was stung by a scorpion or bitten by a snake. They gave him all sorts of treatment, but nothing gave him relied. One of them said: Would that you had gone to those people who encamped with you ; some of them might have something which could give you relief to your companion. (So they went and) one of them said: Our chief has been stung by a scorpion or bitten by a snake. We administered all sorts of medicine but nothing gave him relief. Has any of you anything, i.e. charm, which gives healing to our companion. One of those people said: I shall apply charm; we sought hospitality from you, but you refused to entertain us. I am not going to apply charm until you give me some wages. So they offered them a number of sheep. He then came to and recited Faithat-al-Kitab and spat until he was cured as if he were set free from a bond. Thereafter they made payment of the wages as agreed by them. They said: Apportion (the wages). The man who applied the charm said: Do not do until we come to the Messenger of Allah (ﷺ) and consult him. So they came to the Messenger of Allah (ﷺ) next morning and mentioned it to him. The Messenger of Allah (ﷺ) said: From where did you learn that it was a charm ? You have done right. Give me a share along with you.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-3503",
      "hadith_no": "3503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن حكيم بن حزام، قال يا رسول الله يأتيني الرجل فيريد مني البيع ليس عندي أفأبتاعه له من السوق فقال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " Narrated Hakim ibn Hizam:                     Hakim asked (the Prophet): Messenger of Allah, a man comes to me and wants me to sell him something which is not in my possession. Should I buy it for him from the market? He replied: Do not sell what you do not possess.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "id": "sunan-abi-daud-3793",
      "hadith_no": "3793",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن خالته، أهدت إلى رسول الله صلى الله عليه وسلم سمنا وأضبا وأقطا فأكل من السمن ومن الأقط وترك الأضب تقذرا وأكل على مائدته ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn ‘Abbas said that his maternal aunt presented to the Messenger of Allah (ﷺ) clarified butter, lizards and cottage cheese. He ate from clarified butter and cheese, but left the lizard abominably. It was eaten on the food cloth of the Messenger of Allah (ﷺ). Had it been unlawful, it would not have been eaten on the food cloth of the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3803",
      "hadith_no": "3803",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن ميمون بن مهران، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن أكل كل ذي ناب من السبع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Messenger of Allah(ﷺ) prohibited the eating of every beast of prey with fang, and every bird with a talon.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11012",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3900",
      "hadith_no": "3900",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد الخدري، أن رهطا، من أصحاب النبي صلى الله عليه وسلم انطلقوا في سفرة سافروها فنزلوا بحى من أحياء العرب فقال بعضهم إن سيدنا لدغ فهل عند أحد منكم شىء ينفع صاحبنا فقال رجل من القوم نعم والله إني لأرقي ولكن استضفناكم فأبيتم أن تضيفونا ما أنا براق حتى تجعلوا لي جعلا ‏.‏ فجعلوا له قطيعا من الشاء فأتاه فقرأ عليه أم الكتاب ويتفل حتى برأ كأنما أنشط من عقال ‏.‏ قال فأوفاهم جعلهم الذي صالحوهم عليه فقالوا اقتسموا ‏.‏ فقال الذي رقى لا تفعلوا حتى نأتي رسول الله صلى الله عليه وسلم فنستأمره ‏.‏ فغدوا على رسول الله صلى الله عليه وسلم فذكروا له فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أين علمتم أنها رقية أحسنتم اقتسموا واضربوا لي معكم بسهم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’d al-KHudri said :                      Some of the Companions of the Prophet (ﷺ) went on a journey. They alighted with a certain clan of the Arabs. Someone of them said : Our chief has been stung by a scorpion or bitten by a snake. Has any of you something which gives relief to our chief? A man of the people said : Yes, I swear by Allah. I shall apply charm ; but we asked you for hospitality and you denied it to us. I shall not apply charm until you give me some payment. So they promised to give some sheep to him. He came to him and recited Surat al-Fatihah over him and spat till he was cured, and ha seemed as if he were set free from a bond. So they gave him the payment that was agreed between them. They said : Apportion them. The man who applied charm said : Do not do it until we approach the Apostle of allah (ﷺ) said: From where did you learn that it was a charm ? you have done right. Apportion them, and give me a share along with you.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4459",
      "hadith_no": "4459",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بشر، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم في الرجل يأتي جارية امرأته قال ‏\"‏ إن كانت أحلتها له جلد مائة وإن لم تكن أحلتها له رجمته ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Prophet (ﷺ) said: about a man who had (unlawful) intercourse with his wife's slave girl: If she made her lawful for him, he will be flogged one hundred lashes; if she did not make her lawful for him, I shall stone him.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419",
        "18242",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-abi-daud-4711",
      "hadith_no": "4711",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم سئل عن أولاد المشركين فقال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas reported that when the Prophet (May peace be upon him) was questioned about the offspring of polytheists, he said :                      Allah knows best about what they were doing.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-5032",
      "hadith_no": "5032",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا تميم بن المنتصر، حدثنا إسحاق، - يعني ابن يوسف - عن أبي بشر، ورقاء، عن منصور، عن هلال بن يساف، عن خالد بن عرفجة، عن سالم بن عبيد الأشجعي، بهذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Salim ibn Ubayd al-Ashja'i:                     The tradition mentioned above (No. 5013) has also been mentioned by Salim ibn Ubayd al-Ashja'i to the same effect from the Prophet (ﷺ) through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "11419",
        "11067",
        "10835",
        "18241",
        "5045"
      ]
    },
    {
      "id": "jami-al-tirmidhi-165",
      "hadith_no": "165",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بوقت هذه الصلاة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     \"I am the most knowledgeable among the people about the prescribed time of this prayer: Allah's Messenger would pray it when the moon set on the third (of the month).\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "id": "jami-al-tirmidhi-166",
      "hadith_no": "166",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا عبد الرحمن بن مهدي، عن أبي عوانة، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى روى هذا الحديث، هشيم عن أبي بشر، عن حبيب بن سالم، عن النعمان بن بشير، ‏.‏ ولم يذكر فيه هشيم عن بشير بن ثابت، ‏.‏ وحديث أبي عوانة أصح عندنا لأن يزيد بن هارون روى عن شعبة، عن أبي بشر، نحو رواية أبي عوانة ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     A similar narration (from another chain linking to) this chain is also reported.",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20033",
        "20469",
        "20468",
        "11419",
        "11837",
        "274",
        "14038"
      ]
    },
    {
      "id": "jami-al-tirmidhi-438",
      "hadith_no": "438",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد شهر رمضان شهر الله المحرم وأفضل الصلاة بعد الفريضة صلاة الليل ‏\"‏ ‏.‏ قال وفي الباب عن جابر وبلال وأبي أمامة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ قال أبو عيسى وأبو بشر اسمه جعفر بن أبي وحشية واسم أبي وحشية إياس ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"The most virtuous fasting after the month of Ramadan is that of Allah's month of Al-Muharram. And the most virtuous Salat after the obligatory is the night prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11280",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-740",
      "hadith_no": "740",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد صيام شهر رمضان شهر الله المحرم ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"The most virtuous fasting after the month of Ramadan is Allah's month Al-Muharram.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11280",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1232-2",
      "hadith_no": "1232",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا هشيم، عن أبي بشر، عن يوسف بن ماهك، عن حكيم بن حزام، قال أتيت رسول الله صلى الله عليه وسلم فقلت يأتيني الرجل يسألني من البيع ما ليس عندي أبتاع له من السوق ثم أبيعه قال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمر ‏.‏",
      "text_en": " Narrated Hakim b. Hizam:                     \"I asked Messenger of Allah (ﷺ), I said: 'A man came to me asking to buy something that I did not have. Can I buy it from the market for him and then give it to him?' He said: 'Do not sell what is not with you.'\"He said: There are narrations on this topic from 'Abdullah bin 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20468",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1452",
      "hadith_no": "1452",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا علي بن حجر، حدثنا هشيم، عن أبي بشر، عن حبيب بن سالم، عن النعمان بن بشير، نحوه ‏.‏ قال وفي الباب عن سلمة بن المحبق، ‏.‏ قال أبو عيسى حديث النعمان في إسناده اضطراب ‏.‏ قال سمعت محمدا يقول لم يسمع قتادة من حبيب بن سالم هذا الحديث إنما رواه عن خالد بن عرفطة ‏.‏ ويروى عن قتادة أنه قال كتب به إلى حبيب بن سالم ‏.‏ وأبو بشر لم يسمع من حبيب بن سالم هذا أيضا إنما رواه عن خالد بن عرفطة ‏.‏ قال أبو عيسى وقد اختلف أهل العلم في الرجل يقع على جارية امرأته فروي عن غير واحد من أصحاب النبي صلى الله عليه وسلم منهم علي وابن عمر أن عليه الرجم ‏.‏ وقال ابن مسعود ليس عليه حد ولكن يعزر ‏.‏ وذهب أحمد وإسحاق إلى ما روى النعمان بن بشير عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " (Another chain) from An-Nu'man bin Bashir with similar.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20468",
        "11419",
        "11837",
        "274",
        "5071",
        "20278"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1468",
      "hadith_no": "1468",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن أبي بشر، قال سمعت سعيد بن جبير، يحدث عن عدي بن حاتم، قال قلت يا رسول الله أرمي الصيد فأجد فيه من الغد سهمي قال ‏\"‏ إذا علمت أن سهمك قتله ولم تر فيه أثر سبع فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وروى شعبة هذا الحديث عن أبي بشر وعبد الملك بن ميسرة عن سعيد بن جبير عن عدي بن حاتم وكلا الحديثين صحيح ‏.‏ وفي الباب عن أبي ثعلبة الخشني ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I said: 'O Messenger of Allah! I shoot some game and then find my arrow in it the next day.' He said: 'If you know that your arrow killed it, and you dont see any marks of predators, then eat it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11419",
        "11050",
        "212"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2204",
      "hadith_no": "2204",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن جعفر بن إياس، عن أبي نضرة، عن أبي سعيد الخدري، قال بعثنا رسول الله صلى الله عليه وسلم في سرية فنزلنا بقوم فسألناهم القرى فلم يقرونا فلدغ سيدهم فأتونا فقالوا هل فيكم من يرقي من العقرب قلت نعم أنا ولكن لا أرقيه حتى تعطونا غنما ‏.‏ قالوا فإنا نعطيكم ثلاثين شاة ‏.‏ فقبلنا فقرأت عليه ‏(‏الحمد لله ‏)‏ سبع مرات فبرأ وقبضنا الغنم ‏.‏ قال فعرض في أنفسنا منها شيء فقلنا لا تعجلوا حتى تأتوا رسول الله صلى الله عليه وسلم ‏.‏ قال فلما قدمنا عليه ذكرت له الذي صنعت قال ‏\"‏ وما علمت أنها رقية اقبضوا الغنم واضربوا لي معكم بسهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو نضرة اسمه المنذر بن مالك بن قطعة ‏.‏ ورخص الشافعي للمعلم أن يأخذ على تعليم القرآن أجرا ويرى له أن يشترط على ذلك ‏.‏ واحتج بهذا الحديث ‏.‏ وروى شعبة وأبو عوانة وغير واحد عن أبي بشر هذا الحديث عن أبي المتوكل عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " \"Abu Sa'eed narrated:                     \"The Messenger of Allah (s.a.w) dispatched us on a military expedition. We camped with some people and asked them to entertain us but they did not entertain us. Their leader was stung so they came to us saying: 'Is there anyone among you who can treat a scorpion sting with Ruqyah?' I said: 'Yes I can. But I will not do any Ruqyah until you give us some sheep.' They said: 'Then we shall give you thirty sheep.' We accepted that,and I recited Al-Hamda [Lillah] seven times. He became better and we took the sheep.\" He said: \"We became concerned about that being permissible and said: 'Do not be hasty until we reach the Messenger of Allah (S.A.W).\" He said: \"When we arrived with him I mentioned what I did to him. He(S.A.W)said: 'How did you know that it was a Ruqyah?  Take the sheep, and assign me a share among you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11419",
        "10721",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2205",
      "hadith_no": "2205",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثني عبد الصمد بن عبد الوارث، حدثنا شعبة، حدثنا أبو بشر، قال سمعت أبا المتوكل، يحدث عن أبي سعيد، أن ناسا، من أصحاب النبي صلى الله عليه وسلم مروا بحى من العرب فلم يقروهم ولم يضيفوهم فاشتكى سيدهم فأتونا فقالوا هل عندكم دواء قلنا نعم ولكن لم تقرونا ولم تضيفونا فلا نفعل حتى تجعلوا لنا جعلا ‏.‏ فجعلوا على ذلك قطيعا من الغنم ‏.‏ قال فجعل رجل منا يقرأ عليه بفاتحة الكتاب فبرأ فلما أتينا النبي صلى الله عليه وسلم ذكرنا ذلك له قال ‏\"‏ وما يدريك أنها رقية ‏\"‏ ‏.‏ ولم يذكر نهيا منه وقال ‏\"‏ كلوا واضربوا لي معكم بسهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح وهذا أصح من حديث الأعمش عن جعفر بن إياس ‏.‏ وهكذا روى غير واحد هذا الحديث عن أبي بشر جعفر بن أبي وحشية عن أبي المتوكل عن أبي سعيد ‏.‏ وجعفر بن إياس هو جعفر بن أبي وحشية ‏.‏",
      "text_en": " \"Abu Sa'eed Al Khudri narrated:                     \"Some of the Companions of the Messenger of Allah (S.A.W) came across a tribe of Bedouins that did not entertain them,nor behave hospitality with them. Their leader became ill, and they came to us saying: 'Do you have any medicine?'We said: ' Yes. But you did not entertain us nor have us as guests so we will not do anything until you give us something.' Then they gave sheep for that.\" He said: 'So a man from us began reciting the Opening of the Book (Surat Al-Fatihah) and he was cured. So when we came to the Messenger of Allah (S.A.W) we mentioned to him, He said: 'How did you know it was Ruqyah?'  And he did not mention any prohibition against it,and he said: 'Eat , and assign me a share among you from them (Sheep).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20250",
        "20020",
        "11419",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2711",
      "hadith_no": "2711",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، وأبو زرعة وغير واحد قالوا أخبرنا قبيصة، عن إسرائيل، عن هلال بن مقلاص الصيرفي، عن أبي بشر، عن أبي وائل، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل طيبا وعمل في سنة وأمن الناس بوائقه دخل الجنة ‏\"‏ ‏.‏ فقال رجل يا رسول الله إن هذا اليوم في الناس لكثير ‏.‏ قال ‏\"‏ وسيكون في قرون بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث إسرائيل ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (s.a.w) said:                     \"Whoever eats the Tayyib and acts in accordance with the Sunnah, and the people are safe from his harm, he will enter Paradise.\" So a man said: \"O Messenger of Allah! This is the case with many people today.\" So he said: \"It shall be so in the generation after me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20351",
        "20311",
        "11419",
        "11353",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3238",
      "hadith_no": "3238",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم بنحو ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3438",
      "hadith_no": "3438",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا سليمان بن داود، عن شعبة، عن أبي بشر، عن سعيد بن جبير، ولم يذكر عن ابن عباس، وهشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ‏:‏ ‏(‏ولا تجهر بصلاتك ‏)‏ قال نزلت بمكة كان رسول الله صلى الله عليه وسلم إذا رفع صوته بالقرآن سبه المشركون ومن أنزله ومن جاء به فأنزل الله ‏:‏ ‏(‏ولا تجهر بصلاتك ‏)‏ فيسبوا القرآن ومن أنزله ومن جاء به ‏:‏ ‏(‏ولا تخافت بها ‏)‏ عن أصحابك بأن تسمعهم حتى يأخذوا عنك القرآن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     from Ibn 'Abbas, regarding: 'And offer your Salat neither aloud nor in a low voice (17:110).\" He said: \"It was revealed in Makkah. When the Messenger of Allah (ﷺ) would raise his voice with the Qur'an, the idolaters would insult him, the One Who revealed it, and the one who came with it. So Allah revealed: And offer your Salat neither aloud so that they would not insult the Qur'an and the One who revealed it, and the one who came with it, nor in a low voice (too low) such that you can let your Companions hear it, and learn it from you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "30584",
        "20020",
        "11419",
        "11050",
        "17",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3439",
      "hadith_no": "3439",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، حدثنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، في قوله ‏:‏ ‏(‏ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا ‏)‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة وكان إذا صلى بأصحابه رفع صوته بالقرآن فكان المشركون إذا سمعوه شتموا القرآن ومن أنزله ومن جاء به فقال الله لنبيه ‏:‏ ‏(‏ولا تجهر بصلاتك ‏)‏ أى بقراءتك فيسمع المشركون فيسبوا القرآن ‏:‏ ‏(‏ولا تخافت بها ‏)‏ عن أصحابك ‏:‏ ‏(‏ وابتغ بين ذلك سبيلا ‏)‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     from Ibn 'Abbas regarding Allah's saying: \"And offer your Salat neither aloud nor in a low voice but follow a way between.\" He said: \"It was revealed when the Messenger of Allah (ﷺ) was hiding himself in Makkah, and when he led his Companions in Salat, he would raise his voice with the Qur'an. So when the idolaters heard it they would insult the Qur'an, the One Who revealed it, and the one who came with it. So Allah, Most High, said to His Prophet: 'And offer your Salat neither aloud' that is: Your recitation, so that the idolaters would not hear it and insult the Qur'an. 'Nor in a low voice (too low)' for your Companions, 'but follow a way between.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3641",
      "hadith_no": "3641",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثني أبو الوليد، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما قال ما قرأ رسول الله صلى الله عليه وسلم على الجن ولا رآهم انطلق رسول الله صلى الله عليه وسلم في طائفة من أصحابه عامدين إلى سوق عكاظ وقد حيل بين الشياطين وبين خبر السماء وأرسلت عليهم الشهب فرجعت الشياطين إلى قومهم فقالوا ما لكم قالوا حيل بيننا وبين خبر السماء وأرسلت علينا الشهب ‏.‏ فقالوا ما حال بيننا وبين خبر السماء إلا من أمر حدث فاضربوا مشارق الأرض ومغاربها فانظروا ما هذا الذي حال بينكم وبين خبر السماء قال فانطلقوا يضربون مشارق الأرض ومغاربها يبتغون ما هذا الذي حال بينهم وبين خبر السماء فانصرف أولئك النفر الذين توجهوا إلى نحو تهامة إلى رسول الله صلى الله عليه وسلم وهو بنخلة عامدا إلى سوق عكاظ وهو يصلي بأصحابه صلاة الفجر فلما سمعوا القرآن استمعوا له فقالوا هذا والله الذي حال بينكم وبين خبر السماء ‏.‏ قال فهنالك رجعوا إلى قومهم فقالوا يا قومنا ‏:‏ ‏(‏ إنا سمعنا قرآنا عجبا * يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا ‏)‏ فأنزل الله على نبيه ‏:‏ ‏(‏ قل أوحي إلى أنه استمع ‏)‏ وإنما أوحي إليه قول الجن ‏.‏",
      "text_en": " Ibn Abbas [may Allah be pleased with them] said:                     the Messenger of Allah did not recite for the jinns nor did he see them. The Messenger of Allah went out with a group of his Companions towards the Ukaz market. Something had been intervening between the Shayatin and the news from the heavens, and shooting stars has been sent upon them, so the Shayatin returned to their people and they said to them: ‘What is wrong with you?’ They replied: ‘Something has been intervening between us and the news of the heavens except that something has happened. So travel east and west in the earth and look for what is it that intervenes between you an between the news of the heavens.’” He said: “So they went traveling east and west on the earth, seeking whatever it was that had been intervening between them and the news of the heavens. A group of those who were traveling towards Tihamah headed in the direction of the Messenger of Allah, while he was at Nakhlah, enroute to the Ukaz market. He was performing Salat Al-Fajr with his Companions. When they heard the Quran they listened to it, and they said: ‘By Allah! This is what has been intervening between us and the news of the heavens.’” He said: “Then they returned to their people and said: ‘O our people! Verily we heard a wonderful Recitation! It guides to the Right Path, and we have believed therein, and we shall never join anything with our Lord.’ So Allah, Blessed is He and Most High, revealed to His Prophet: Say: ‘It has been revealed to me that a group of the jinn listened.’ So the saying of the jinns was only revealed to him.”",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20296",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3687",
      "hadith_no": "3687",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا سليمان بن داود، عن شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما قال كان عمر يسألني مع أصحاب النبي صلى الله عليه وسلم فقال له عبد الرحمن بن عوف أتسأله ولنا بنون مثله فقال له عمر إنه من حيث تعلم فسأله عن هذه الآية ‏:‏ ‏(‏ إذا جاء نصر الله والفتح ‏)‏ فقلت إنما هو أجل رسول الله صلى الله عليه وسلم أعلمه إياه وقرأ السورة إلى آخرها فقال له عمر والله ما أعلم منها إلا ما تعلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas said:                     “Umar used to ask me questions in front of the Companions of the Prophet. So Abdur-Rahman bin Awf said to him: ‘Why do you ask him, while we have children like him?’” He said: “Umar said to him: ‘It is because of what you know (about him).’ So he asked him about this Ayah: ‘When there comes the help of Allah and the Conquest.’ I said: “It is only regarding the (end of the) life span of the Messenger of Allah, informing him of it.” Then he recited the Surat until its end. So Umar said to him: “By Allah! I know not about it, but what you know.”",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "30584",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3688",
      "hadith_no": "3688",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي بشر، بهذا الإسناد نحوه إلا أنه قال فقال له عبد الرحمن بن عوف أتسأله ولنا ابن مثله ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3472-2",
      "hadith_no": "3472",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسين بن الأسود العجلي البغدادي، حدثنا يحيى بن آدم، عن الحسن بن صالح، عن أبي بشر، عن الزهري، قال تسبيحة في رمضان أفضل من ألف تسبيحة في غيره ‏.‏",
      "text_en": " Az-Zuhri said:                     “A Tasbihah in Ramadan is better than a thousand Tasbihah in other that it.”",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20647",
        "11419",
        "11013"
      ]
    },
    {
      "id": "sunan-an-nasai-525",
      "hadith_no": "525",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن أبي بشر، قال سمعت حسان بن بلال، عن رجل، من أسلم من أصحاب النبي صلى الله عليه وسلم أنهم كانوا يصلون مع نبي الله صلى الله عليه وسلم المغرب ثم يرجعون إلى أهاليهم إلى أقصى المدينة يرمون ويبصرون مواقع سهامهم ‏.‏",
      "text_en": " It was narrated from a man of Aslam, who was one of the Companions of the Prophet (ﷺ), that they used to pray Maghrib with the Prophet (ﷺ),then they would go back to their families in the furthest part of Al-Madinah, shooting arrows and seeing where they landed. [1][1] Because it was still bright enough.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "14077"
      ]
    },
    {
      "id": "sunan-an-nasai-533",
      "hadith_no": "533",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن رقبة، عن جعفر بن إياس، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بميقات هذه الصلاة عشاء الآخرة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                      \"I am the most knowledgeable of people about the time of the 'Isha' prayer. The Prophet (ﷺ) used to pray it when the moon set on the third night of the month.\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11419",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-534",
      "hadith_no": "534",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا عفان، قال حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال والله إني لأعلم الناس بوقت هذه الصلاة صلاة العشاء الآخرة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Bashir said:                      \"By Allah, I am the most knowledgeable of people about the time of the 'Isha' prayers. The Prophet (ﷺ) used to pray it when the moon set on the third night of the month.\"",
      "usc_msa_ref": "",
      "chain": [
        "11524",
        "30106",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-1012",
      "hadith_no": "1012",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن الأعمش، عن جعفر بن إياس، عن سعيد بن جبير، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يرفع صوته بالقرآن وكان المشركون إذا سمعوا صوته سبوا القرآن ومن جاء به فكان النبي صلى الله عليه وسلم يخفض صوته بالقرآن ما كان يسمعه أصحابه فأنزل الله عز وجل ‏{‏ ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Prophet (ﷺ) used to raise his voice when reciting Quran, and when the idolaters heard his voice they would insult the Quran and the one who had brought it. So the Prophet (ﷺ) began to lower his voice such that his companions would not hear him. Then Allah (SWT), the Mighty and Sublime, revealed: 'And offer your salah (prayer) neither aloud nor in a low voice, but follow a way between.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11060",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1084",
      "hadith_no": "1084",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن أبي بشر، قال سمعت يوسف، - وهو ابن ماهك - يحدث عن حكيم، قال بايعت رسول الله صلى الله عليه وسلم أن لا أخر إلا قائما ‏.‏",
      "text_en": " It was narrated that Abu Bushr said:                     \"I heard Yusuf-meaning Ibn Mahak- narrating that Hakim said: 'I gave my pledge of allegiance to the Messenger of Allah (ﷺ), pledging that I would go down (in prostration) only after standing up from bowing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11419",
        "11264"
      ]
    },
    {
      "id": "sunan-an-nasai-1557",
      "hadith_no": "1557",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثنا أبو بشر، عن أبي عمير بن أنس، عن عمومة، له أن قوما، رأوا الهلال فأتوا النبي صلى الله عليه وسلم فأمرهم أن يفطروا بعد ما ارتفع النهار وأن يخرجوا إلى العيد من الغد ‏.‏",
      "text_en": " It was narrated from 'Umair bin Anas from his paternal uncles, that :                     Some people saw the crescent moon and came to the Prophet (ﷺ), and he told them to break their fast after the sun has risen and to go out for 'Eid the (morning of the) following day.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11419"
      ]
    },
    {
      "id": "sunan-an-nasai-1613",
      "hadith_no": "1613",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن، - هو ابن عوف - عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصيام بعد شهر رمضان شهر الله المحرم وأفضل الصلاة بعد الفريضة صلاة الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid bin 'Abdur-Rahman- that is Ibn 'Awf, that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'The best fasting after the month of Ramadan is the month of Allah, Al-Muharram, and the best prayer is prayer at night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1951",
      "hadith_no": "1951",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عبد الرحمن، قال حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين فقال ‏\"‏ خلقهم الله حين خلقهم وهو يعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah was asked about the children of the idolators and he said: 'Allah created them when He created them, and He knows best what they would have done.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1952",
      "hadith_no": "1952",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني مجاهد بن موسى، عن هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال سئل النبي صلى الله عليه وسلم عن ذراري المشركين فقال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah was asked about he children of the idolators and he said: 'Allah knows best what they would have done.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30521",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2279",
      "hadith_no": "2279",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي بشر، عن هانئ بن الشخير، عن رجل، من بلحريش عن أبيه، قال كنت مسافرا فأتيت النبي صلى الله عليه وسلم وأنا صائم وهو يأكل قال ‏\"‏ هلم ‏\"‏ ‏.‏ قلت إني صائم ‏.‏ قال ‏\"‏ تعال ألم تعلم ما وضع الله عن المسافر ‏\"‏ ‏.‏ قلت وما وضع عن المسافر قال ‏\"‏ الصوم ونصف الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hani bin Ash-Shikhkhir, from a man from Balharish, that his father said:                     \"I was traveling and I came to the Prophet when I was fasting, and he was eating. He said:'Come (and eat).' I said: 'I am fasting.' He said: 'Come here; do you not know what Allah has waived for the traveler?' I said: 'What has Allah waived for the traveler?' He said: 'Fasting and half of the prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419"
      ]
    },
    {
      "id": "sunan-an-nasai-2280",
      "hadith_no": "2280",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا أبو داود، قال حدثنا أبو عوانة، عن أبي بشر، عن هانئ بن عبد الله بن الشخير، عن رجل، من بلحريش عن أبيه، قال كنا نسافر ما شاء الله فأتينا رسول الله صلى الله عليه وسلم وهو يطعم فقال ‏\"‏ هلم فاطعم ‏\"‏ ‏.‏ فقلت إني صائم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحدثكم عن الصيام إن الله وضع عن المسافر الصوم وشطر الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hani bin 'Abdullah bin Ash-Shikhkhir from Balharish,  from a man from Balharish, that his father said:                     \"we had been travelijng for as long as Allah willed, then we came to the Messenger of Allah and he was eating. He said: 'Come and eat.' I said: 'I am fasting.' The Messenger of Allah said: 'I will tell you about fasting. Allah has waived fasting and half of the prayer for the traveler.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20547",
        "20469",
        "11419"
      ]
    },
    {
      "id": "sunan-an-nasai-2281",
      "hadith_no": "2281",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن عبد الكريم، قال حدثنا سهل بن بكار، قال حدثنا أبو عوانة، عن أبي بشر، عن هانئ بن عبد الله بن الشخير، عن أبيه، قال كنت مسافرا فأتيت النبي صلى الله عليه وسلم وهو يأكل وأنا صائم فقال ‏\"‏ هلم ‏\"‏ ‏.‏ قلت إني صائم ‏.‏ قال ‏\"‏ أتدري ما وضع الله عن المسافر ‏\"‏ ‏.‏ قلت وما وضع الله عن المسافر قال ‏\"‏ الصوم وشطر الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hani bin 'Abdullah bin Shikhkhir that his father said:                     \"I was traveling and I came to the Prophet when he was eating and I was fasting. He said: 'Come and eat.' I said: 'I am fasting.' He said: 'Do you know what Allah has waived for the traveler?' he said: 'Do you know what Allah has waived for the traveler?' I said: 'What has Allah waived for the traveler?' He said: 'Fasting and half of the prayer.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20469",
        "11419"
      ]
    },
    {
      "id": "sunan-an-nasai-2346",
      "hadith_no": "2346",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يصوم حتى نقول لا يفطر ويفطر حتى نقول ما يريد أن يصوم وما صام شهرا متتابعا غير رمضان منذ قدم المدينة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah would fast until we said he would not break his fast, and he would not fast until we said he does not want to fast. And he never fasted any month in full apart from Ramadan, from the time he came to Al-Madinah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2632",
      "hadith_no": "2632",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن أبي بشر، قال سمعت سعيد بن جبير، يحدث عن ابن عباس، أن امرأة، نذرت أن تحج، فماتت فأتى أخوها النبي صلى الله عليه وسلم فسأله عن ذلك فقال ‏\"‏ أرأيت لو كان على أختك دين أكنت قاضيه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فاقضوا الله فهو أحق بالوفاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     a woman vowed to perform Hajj but she died. Her brother came to the Prophet and asked him about that, he said: 'Do yhou think that if your sister owed a debt you wouold pay it off?' He said: 'Yes.' He said: 'Then fulfill the right of Allah, for He is more deserving that His rights should be fulfilled.'''",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2713",
      "hadith_no": "2713",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، قال سمعت أبا بشر، يحدث عن سعيد بن جبير، عن ابن عباس، أن رجلا، وقع عن راحلته، فأقعصته فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر ويكفن في ثوبين خارجا رأسه ووجهه فإنه يبعث يوم القيامة ملبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     a man fell from his mount and it trampled him. The Messenger of Allah said: \"Wash him with water and lotus leaves, and he should be shrouded in two clothes, leaving his head and face bare, for he will be raised on the Day of Resurrection reciting the Talbiyah.\"(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2750",
      "hadith_no": "2750",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا أبو بشر، عن عبيد الله بن عبد الله بن عمر، عن أبيه، قال كانت تلبية رسول الله صلى الله عليه وسلم ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ وزاد فيه ابن عمر لبيك لبيك وسعديك والخير في يديك والرغباء إليك والعمل ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Umar that his father said:                     \"The Talbiyah of the Messenger of Allah was: \"Labbaika Allahumma Labbaik, Labbaika la sharika laka labbaik. Innal-hamda wan-ni'mata laka wal-mulk, la sharika lak (Here I am, O Allah, here I am. Here I am, You have no partner, here I am. Verily all praise and blessings are Yours, and all sovereignty, You have no partner).\" And Ibn 'Umar added: \"Labbaika Labbaika wasa'daika wal-khayr fi yadika, warraghba' ilaika wal-'aml (Here I am, here I am, and at Your service; all good is in Your hands, seeking Your pleasure and striving for Your sake).\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11817",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2853",
      "hadith_no": "2853",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، أن رجلا، كان مع النبي صلى الله عليه وسلم فوقصته ناقته وهو محرم فمات فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر وكفنوه في ثوبيه ولا تمسوه بطيب ولا تخمروا رأسه فإنه يبعث يوم القيامة ملبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That a man was with the Messenger of Allah, and his she-camel broke his neck when he was in Ihra, and he died. The Messenger of all said, Wash him with water and lote leaves, and shroud him in his two garments, and do not put any perfume on him or cover his head, for he will be raised on the Day of Resurrection reciting the Talbiyah.\".",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2854",
      "hadith_no": "2854",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن رجلا، محرما صرع عن ناقته، فأوقص ذكر أنه قد مات فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر وكفنوه في ثوبين ‏\"‏ ‏.‏ ثم قال على إثره ‏\"‏ خارجا رأسه ‏\"‏ ‏.‏ قال ‏\"‏ ولا تمسوه طيبا فإنه يبعث يوم القيامة ملبيا ‏\"‏ ‏.‏ قال شعبة فسألته بعد عشر سنين فجاء بالحديث كما كان يجيء به إلا أنه قال ‏\"‏ ولا تخمروا وجهه ورأسه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That a man in Ihram was thrown by his she-camel and his neck was broken. It was said that he had died, so the Prophet said: \"Wash him with water and lotus leaves, and shroud him in two cloths.\" Then he said: \"Do not put any perfume on him for he will be raised on the Day of Resurrection reciting the Talbiyah.\" Shubah said: \"Ten years later, I asked him (the narrator Abu Bishr) anbut that, and he narrated the Hadith as he had the first time, except that he said: 'And do not cover his face and head.'\".",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2857",
      "hadith_no": "2857",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن معاوية، قال حدثنا خلف، - يعني ابن خليفة - عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، أن رجلا، كان حاجا مع رسول الله صلى الله عليه وسلم وأنه لفظه بعيره فمات فقال رسول الله صلى الله عليه وسلم ‏\"‏ يغسل ويكفن في ثوبين ولا يغطى رأسه ووجهه فإنه يقوم يوم القيامة ملبيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     a man was performing Hajj with the Messenger of Allah and his she-camel threw him and he died. The Messenger of Allah said: \"Wash him and shroud him in two garments, and do not cover his head of his face, for he will be raised on the Day of Resurrection reciting Talbiyah.\".",
      "usc_msa_ref": "",
      "chain": [
        "20584",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3360",
      "hadith_no": "3360",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن أبي بشر، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم في الرجل يأتي جارية امرأته قال ‏\"‏ إن كانت أحلتها له جلدته مائة وإن لم تكن أحلتها له رجمته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that the Prophet said, concerning a man who had intercourse with his wife's slave woman:                      \"If she let him do that, I will flog him with one hundred stripes , and if she did not let him, I will stone him (to death).\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11419",
        "18242",
        "11837",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-3398",
      "hadith_no": "3398",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني زياد بن أيوب، قال حدثنا هشيم، قال أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عمر، أنه طلق امرأته وهي حائض فردها عليه رسول الله صلى الله عليه وسلم حتى طلقها وهي طاهر ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he divorced his wife when she was menstruating, but the Messenger of Allah told him to take her back, and divorce her when she was pure (not menstruating).",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4300",
      "hadith_no": "4300",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا هشيم، قال أنبأنا أبو بشر، عن سعيد بن جبير، عن عدي بن حاتم، قال قلت يا رسول الله إنا أهل الصيد وإن أحدنا يرمي الصيد فيغيب عنه الليلة والليلتين فيبتغي الأثر فيجده ميتا وسهمه فيه ‏.‏ قال ‏\"‏ إذا وجدت السهم فيه ولم تجد فيه أثر سبع وعلمت أن سهمك قتله فكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated tht 'Adiyy bin Hatim said:                     \"I said: 'O Messenger of Allah, we are a people who hunt, and one of us may shoot his arrow but (the game) gets way form him for a night or two. What if he follows its tracks, and finds it dead with his arrow in it?\" He said: 'If you find the arrow in it, and you do not find any sign of predators, and you know that your arrow killed it, then eat it.\"( Sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4301",
      "hadith_no": "4301",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، وإسماعيل بن مسعود، قالا حدثنا خالد، عن شعبة، عن أبي بشر، عن سعيد بن جبير، عن عدي بن حاتم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيت سهمك فيه ولم تر فيه أثرا غيره وعلمت أنه قتله فكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that the Messenger of Allah said:                     \"If you see your arrow in it. And you do not see any other mark, and you know that (Your arrow) killed it, then eat it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "34033",
        "20423",
        "20020",
        "11419",
        "11050",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4318",
      "hadith_no": "4318",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال أهدت خالتي إلى رسول الله صلى الله عليه وسلم أقطا وسمنا وأضبا فأكل من الأقط والسمن وترك الأضب تقذرا وأكل على مائدة رسول الله صلى الله عليه وسلم ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"My maternal aunt gave some cottage cheese, cooking fat, and mastigures to the Messenger of Allah He ate some of the cottage cheese and cooking fat, and left the mastigures, as he found them distasteful. But they were eaten upon the table-spread of the Messenger of Allah and if they were Haram they would not have been eaten upon the table-spread of the Messenger of Allah and he would not have told others to eat them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4319",
      "hadith_no": "4319",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا هشيم، قال أنبأنا أبو بشر، عن سعيد بن جبير، عن ابن عباس، أنه سئل عن أكل الضباب، فقال أهدت أم حفيد إلى رسول الله صلى الله عليه وسلم سمنا وأقطا وأضبا فأكل من السمن والأقط وترك الضباب تقذرا لهن فلو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم ولا أمر بأكلهن ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     he was asked about eating mastigures. He said: \"Umm Hufaid gave some cooking fat, cottage cheese, and mastigures to the Messenger of Allah and the ate some of the cooking fat and cottage cheese, but he did not eat the mastigures because he found them distasteful. If they were Haram they would not have been eaten at the table-spread of the Messenger of Allah and the would not have told others to eat them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4441",
      "hadith_no": "4441",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا هشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عمر، قال لعن رسول الله صلى الله عليه وسلم من اتخذ شيئا فيه الروح غرضا ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah cursed those who take anything that has a soul as a target.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20468",
        "11419",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4613",
      "hadith_no": "4613",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا زياد بن أيوب، قال حدثنا هشيم، قال حدثنا أبو بشر، عن يوسف بن ماهك، عن حكيم بن حزام، قال سألت النبي صلى الله عليه وسلم فقلت يا رسول الله يأتيني الرجل فيسألني البيع ليس عندي أبيعه منه ثم أبتاعه له من السوق ‏.‏ قال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"I asked the Prophet \"O Messenger of Allah, a man may come to me and ask me to sell him something that I do not have. Can I sell it to him then go and buy it from the market?' He said: 'Do not sell what you do not have.'''",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "id": "sunan-an-nasai-5042",
      "hadith_no": "5042",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي بشر، عن طلق بن حبيب، قال عشرة من السنة السواك وقص الشارب والمضمضة والاستنشاق وتوفير اللحية وقص الأظفار ونتف الإبط والختان وحلق العانة وغسل الدبر ‏.‏ قال أبو عبد الرحمن وحديث سليمان التيمي وجعفر بن إياس أشبه بالصواب من حديث مصعب بن شيبة ومصعب منكر الحديث ‏.‏",
      "text_en": " It was narrated that Talq bin Habib said:                     \"Ten things are from the Sunnah: Using the Siwak, trimming the mustache, rinsing the mouth, rinsing the nose, letting the beard grow, trimming the nails, plucking the armpit hairs, circumcision, shaving the pubes and washing one's backside.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "10692"
      ]
    },
    {
      "id": "sunan-an-nasai-5218",
      "hadith_no": "5218",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي بشر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم اتخذ خاتما من ذهب وكان فصه في باطن كفه فاتخذ الناس خواتيم من ذهب فطرحه رسول الله صلى الله عليه وسلم فطرح الناس خواتيمهم واتخذ خاتما من فضة فكان يختم به ولا يلبسه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] put on a ring of gold, and he used to wear its stone (Fass) next to his palm. Then the people started to wear rings of gold. Then the Messenger of Allah [SAW] discarded it, and the people discarded their rings. Then he acquired a ring of silver with which he used to seal letters, but he did not wear it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5292",
      "hadith_no": "5292",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن أبي بشر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم اتخذ خاتما من ذهب وكان جعل فصه في باطن كفه فاتخذ الناس خواتيم من ذهب فطرحه رسول الله صلى الله عليه وسلم فطرح الناس خواتيمهم واتخذ خاتما من فضة فكان يختم به ولا يلبسه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] put on a ring of gold, and he used to wear its stone (Fass) next to his palm. Then the people started to wear rings of gold too. Then the Messenger of Allah [SAW] threw it away, and the people threw their rings away too. Then he took a ring of silver and he used to seal letters with it, but he did not wear it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11419",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5421",
      "hadith_no": "5421",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا مبشر بن عبد الله، قال حدثنا سفيان بن حسين، عن جعفر بن إياس، عن عبد الرحمن بن أبي بكرة، - وكان عاملا على سجستان - قال كتب إلى أبو بكرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقضين أحد في قضاء بقضاءين ولا يقضي أحد بين خصمين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Bakrah, who was a governor in Sijistan, said:                     \"Abu Bakrah wrote to me, saying: 'I heard the Messenger of Allah [SAW] say: No one should pass two judgments on one issue, and no one should pass judgment between two disputing parties while he is angry.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38181",
        "20655",
        "11419",
        "11294"
      ]
    },
    {
      "id": "sunan-ibn-majah-719",
      "hadith_no": "719",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا شجاع بن مخلد أبو الفضل، قال حدثنا هشيم، أنبأنا أبو بشر، عن أبي المليح بن أسامة، عن عبد الله بن عتبة بن أبي سفيان، حدثتني عمتي أم حبيبة، أنها سمعت رسول الله  صلى الله عليه وسلم  يقول إذا كان عندها في يومها وليلتها فسمع المؤذن يؤذن قال كما يقول المؤذن ‏.‏",
      "text_en": " Umm Habibah narrated that :                     When the Messenger of Allah was with her on her day and night, and heard the Mu'adh-dhin calling the Adhan, she heard him saying what he said.",
      "usc_msa_ref": "",
      "chain": [
        "30506",
        "20468",
        "11419",
        "11453",
        "12236"
      ]
    },
    {
      "id": "sunan-ibn-majah-1641",
      "hadith_no": "1641",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو بشر قالا حدثنا قبيصة، ح وحدثنا أبو كريب، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن خلف العسقلاني، حدثنا الفريابي، وقبيصة، كلهم عن سفيان، عن عبد الله بن عثمان بن خثيم، عن عبد الرحمن بن بهمان، عن عبد الرحمن بن حسان بن ثابت، عن أبيه، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Hassan bin Thabit that hisfathersaid:                      “The Messenger of Allah (ﷺ) cursed women who visitgraves.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11419",
        "20351",
        "30216",
        "20665",
        "38502",
        "20034",
        "20351",
        "20012",
        "10644",
        "12272",
        "451",
        "452"
      ]
    },
    {
      "id": "sunan-ibn-majah-1722",
      "hadith_no": "1722",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، عن أبي بشر، عن أبي عمير بن أنس بن مالك، قال حدثني عمومتي، من الأنصار من أصحاب رسول الله  صلى الله عليه وسلم  قالوا أغمي علينا هلال شوال فأصبحنا صياما فجاء ركب من آخر النهار فشهدوا عند النبي  صلى الله عليه وسلم  أنهم رأوا الهلال بالأمس فأمرهم رسول الله  صلى الله عليه وسلم  أن يفطروا وأن يخرجوا إلى عيدهم من الغد ‏.‏",
      "text_en": " It wasnarrated that ‘Umair bin Anas bin Malik said:                      “My paternalunclesamong the Ansar who were among the Companions of the MessengerofAllah (ﷺ) told me: ‘The new crescent of Shawwal was covered withclouods, so we fasted the next day. Then some riders came at the endof the day and testified to the Prophet (ﷺ) that they had seen thenew crescent the night before. The Messenger of Allah (ﷺ) commandedthem to break their fast and to go out to offer the ‘Eid prayer thefollowing morning.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20468",
        "11419",
        "12632"
      ]
    },
    {
      "id": "sunan-ibn-majah-1782",
      "hadith_no": "1782",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يصوم حتى نقول لا يفطر ويفطر حتى نقول لا يصوم ‏.‏ وما صام شهرا متتابعا إلا رمضان منذ قدم المدينة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)usedto fast until we thought he would never stop fasting. And he usedtonot fast until we thought we would never fast. And he never fastedany compelte month apart from Ramadan, from the time he came toAl-Madinah.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2239",
      "hadith_no": "2239",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، حدثنا الأعمش، عن جعفر بن إياس، عن أبي نضرة، عن أبي سعيد الخدري، قال بعثنا رسول الله  صلى الله عليه وسلم  ثلاثين راكبا في سرية فنزلنا بقوم فسألناهم أن يقرونا فأبوا فلدغ سيدهم فأتونا فقالوا أفيكم أحد يرقي من العقرب فقلت نعم أنا ولكن لا أرقيه حتى تعطونا غنما ‏.‏ قالوا فإنا نعطيكم ثلاثين شاة ‏.‏ فقبلناها فقرأت عليه ‏(‏ الحمد ‏)‏ سبع مرات فبرئ وقبضنا الغنم فعرض في أنفسنا منها شىء فقلنا لا تعجلوا حتى نأتي النبي  صلى الله عليه وسلم  فلما قدمنا ذكرت له الذي صنعت فقال ‏\"‏ أو ما علمت أنها رقية اقتسموها واضربوا لي معكم سهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah (ﷺ) sent us, thirty horsemen, on a military campaign. We camped near some people and asked them for hospitality but they refused. Then their leader was stung by a scorpion and they said: 'Is there anyone among you who can recite Ruqyah for a scorpion sting?' I said: 'Yes, I can, but I will not recite Ruqyah for him until you give us some sheep.' They said: 'We will give you thirty sheep.' So we accepted them, and I recited Al-Hamd (i.e. Al-Fatihah) over him seven times. Then he recovered, and I took the sheep. Then some doubts occurred within ourselves. Then we said: 'Let us not hasten (to make a decision concerning the sheep) until we come to the Prophet (ﷺ)' So when we came back: 'I told him what I had done. He said: 'How did you know that it is a Ruqyah? Divide them up and give me a share as well.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20354",
        "11060",
        "11419",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2240",
      "hadith_no": "2240",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو كريب، حدثنا هشيم، حدثنا أبو بشر، عن أبي المتوكل، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  بنحوه ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏ قال أبو عبد الله والصواب هو أبو المتوكل إن شاء الله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20468",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2271",
      "hadith_no": "2271",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي بشر، قال سمعت يوسف بن ماهك، يحدث عن حكيم بن حزام، قال قلت يا رسول الله الرجل يسألني البيع وليس عندي أفأبيعه قال ‏\"‏ لا تبع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"I said: 'O Messenger of Allah, a man is asking me to sell him something that I do not possess; Shall I sell it to him?' He said: 'Do not sell what is not with you.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11419",
        "11264",
        "423"
      ]
    },
    {
      "id": "sunan-ibn-majah-3203",
      "hadith_no": "3203",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، مثله إلا أنه قال أعقصته راحلته ‏.‏ وقال ‏\"‏ لا تقربوه طيبا فإنه يبعث يوم القيامة ملبيا ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20020",
        "11419",
        "11050"
      ]
    },
    {
      "id": "sunan-ibn-majah-3540",
      "hadith_no": "3540",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن حذيفة، قال نهى رسول الله  صلى الله عليه وسلم  عن الشرب في آنية الذهب والفضة وقال ‏\"‏ هي لهم في الدنيا وهي لكم في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Hudhaifah said:                      “The Messenger of Allah (ﷺ)forbadedrinking from vessels of gold and silver. He said: “They areforthem in this world and for you in the Hereafter.’”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11419",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-3579",
      "hadith_no": "3579",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أسباط بن محمد، حدثنا الأعمش، عن جعفر بن إياس، عن شهر بن حوشب، عن أبي سعيد، وجابر، قالا قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الكمأة من المن وماؤها شفاء للعين والعجوة من الجنة وهي شفاء من السم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed and Jabir that the Messenger of Allah(ﷺ) said:                      “Truffles are a type of manna, and their water is ahealing for eye (diseases). And the ‘Ajwah* are from Paradise, andthey are healing for possession.”**",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20408",
        "11060",
        "11419",
        "11044",
        "38",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3580",
      "hadith_no": "3580",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن ميمون، ومحمد بن عبد الله الرقيان، قالا حدثنا سعيد بن مسلمة بن هشام، عن الأعمش، عن جعفر بن إياس، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11060",
        "11419",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3806",
      "hadith_no": "3806",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بشر، وعلي بن محمد، قالا حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (ﷺ) said: 'Two words which are light on the tongue and heavy in the Balance, and beloved to the Most Merciful: Subhan-Allah wa bi hamdihi, Subhan-Allahil-'Azim (Glory and praise is to Allah, glory is to Allah the Almighty).\"",
      "usc_msa_ref": "",
      "chain": [
        "11419",
        "38409",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    }
  ],
  "total_hadiths": 156
}