{
  "id": "11414",
  "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
  "full_name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "123",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Ayadi",
      "al-Qasayr",
      "al-Damashqi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Damascus",
        "ar": "دمشق",
        "ckb": "دیمەشق"
      }
    ],
    "tags_display": [
      {
        "en": "al-Ayadi",
        "ar": "al-Ayadi",
        "ckb": "al-Ayadi"
      },
      {
        "en": "al-Qasayr",
        "ar": "al-Qasayr",
        "ckb": "al-Qasayr"
      },
      {
        "en": "al-Damashqi",
        "ar": "al-Damashqi",
        "ckb": "al-Damashqi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "274",
      "name": "al-Nu'man bin Bashir ibn Sa'd ( النعمان بن بشير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4049",
      "name": "Wathla bin al-'Asqa' ( واثلة بن الأسقع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "10882",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن يزيد بن تميم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "5136",
      "name": "'Abdullah bin al-Dayli ( عبد الله بن فيروز الديلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "5122",
      "name": "'Abdullah bin Hawalah ( عبد الله بن حوالة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11669",
      "name": "Abu Kabsha al-Saluli أبو كبشة السلولي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "10963",
      "name": "Muslim bin Qrzh مسلم بن قرظة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "5144",
      "name": "'Abdullah al-Snabhy Mkhtlf ( عبد الله الصنابحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "17523",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20637",
      "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "27031",
      "name": "Frj bin Fdalh bin al-N'man فرج بن فضالة بن النعمان",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "28259",
      "name": "'Asim bin Rja'a bin Hywh عاصم بن رجاء بن حيوة الكندي الفلسطيني",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "27485",
      "name": "Yazid bin Rabi'yah Abu Kaml يزيد بن ربيعة أبو كامل الرحبي الدمشقي ال",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5536",
      "hadith_no": "5536",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، قال أخبرني ربيعة بن يزيد الدمشقي، عن أبي إدريس، عن أبي ثعلبة الخشني، قال قلت يا نبي الله إنا بأرض قوم أهل الكتاب، أفنأكل في آنيتهم وبأرض صيد، أصيد بقوسي وبكلبي الذي ليس بمعلم، وبكلبي المعلم، فما يصلح لي قال ‏\"‏ أما ما ذكرت من أهل الكتاب فإن وجدتم غيرها فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها وكلوا فيها، وما صدت بقوسك فذكرت اسم الله فكل، وما صدت بكلبك المعلم فذكرت اسم الله فكل، وما صدت بكلبك غير معلم فأدركت ذكاته فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take our meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and with my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He said, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other than theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat out of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt something with your trained hound after mentioning Allah's Name, eat of it, and if you hunt something with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"",
      "usc_msa_ref": "387",
      "chain": [
        "1945",
        "26010",
        "11414",
        "11027",
        "4056"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5546",
      "hadith_no": "5546",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة،‏.‏ وحدثني أحمد بن أبي رجاء، حدثنا سلمة بن سليمان، عن ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، قال أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني  رضى الله عنه  يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم أهل الكتاب، نأكل في آنيتهم، وأرض صيد أصيد بقوسي، وأصيد بكلبي المعلم، والذي ليس معلما، فأخبرني ما الذي يحل لنا من ذلك فقال ‏\"‏ أما ما ذكرت أنك بأرض قوم أهل الكتاب، تأكل في آنيتهم، فإن وجدتم غير آنيتهم، فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها ثم كلوا فيها، وأما ما ذكرت أنك بأرض صيد، فما صدت بقوسك، فاذكر اسم الله، ثم كل، وما صدت بكلبك المعلم، فاذكر اسم الله، ثم كل، وما صدت بكلبك الذي ليس معلما فأدركت ذكاته، فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to Allah's Apostle and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow and trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your saying that you are living in the land of the people of the Scripture and that you eat in their utensils, if you can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than theirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if you hung something with your bow, and have mentioned Allah's Name while hunting, then you can eat (the game). And if you hunt something with your trained hound, and have mentioned Allah's Name on sending it for hunting then you can eat (the game). But if you hunt something with your untrained hound and you were able to slaughter it before its death, you can eat of it.\"",
      "usc_msa_ref": "396",
      "chain": [
        "20241",
        "30300",
        "30340",
        "20025",
        "26010",
        "11414"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5554",
      "hadith_no": "5554",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة بن شريح، قال حدثني ربيعة بن يزيد الدمشقي، قال حدثني أبو إدريس الخولاني، قال حدثني أبو ثعلبة الخشني، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض أهل الكتاب، فنأكل في آنيتهم، وبأرض صيد، أصيد بقوسي، وأصيد بكلبي المعلم، وبكلبي الذي ليس بمعلم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما ما ذكرت أنك بأرض أهل كتاب فلا تأكلوا في آنيتهم، إلا أن لا تجدوا بدا، فإن لم تجدوا بدا فاغسلوها وكلوا، وأما ما ذكرت أنكم بأرض صيد، فما صدت بقوسك، فاذكر اسم الله وكل، وما صدت بكلبك المعلم، فاذكر اسم الله وكل، وما صدت بكلبك الذي ليس بمعلم، فأدركت ذكاته، فكله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to the Prophet and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture, and we take our meals in their utensils, and there is game in that land and I hunt with my bow and with my trained hound and with my untrained hound.\" The Prophet said, \"As for your saying that you are in the land of people of the Scripture, you should not eat in their utensils unless you find no alternative, in which case you must wash the utensils and then eat in them As for your saying that you are in the land of game, if you hunt something with your bow, mention Allah's Name (while hunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name on sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it and you can eat of it.\"",
      "usc_msa_ref": "404",
      "chain": [
        "20241",
        "26010",
        "11414",
        "11027"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-234-2",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-234-3",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1239",
      "hadith_no": "1239",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن معاوية بن صالح، يقول حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا ‏.‏ وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ‏.‏ ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported:                      Allah's Messenger (may peace be upon him) stood up (to pray) and we heard him say:\" I seek refuge in Allah from thee.\" Then said:\" curse thee with Allah's curse\" three times, then he stretched out his hand as though he was taking hold of something. When he finished the prayer, we said: Messenger of Allah, we heard you say something during the prayer which we have not heard you say before, and we saw you stretch out your hand. He replied: Allah's enemy Iblis came with a flame of fire to put it in my face, so I said three times:\" I Seek refuge in Allah from thee.\" Then I said three times:\" I curse thee with Allah's full curse.\" But he did not retreat (on any one of these) three occasions. Thereafter I meant to seize him. I swear by Allah that had it not been for the supplication of my brother Sulaiman he would have been bound, and made an object of sport for the children of Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2436",
      "hadith_no": "2436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، حدثني ربيعة بن يزيد الدمشقي، عن عبد الله بن عامر اليحصبي، قال سمعت معاوية، يقول إياكم وأحاديث إلا حديثا كان في عهد عمر فإن عمر كان يخيف الناس في الله عز وجل سمعت رسول الله صلى الله عليه وسلم وهو يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا خازن فمن أعطيته عن طيب نفس فيبارك له فيه ومن أعطيته عن مسألة وشره كان كالذي يأكل ولا يشبع ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya said:                      Be cautious about ahadith except those which were current during the reign of Umar, for he exhorted people to ftar Allah, the Exalted and majestic. I heard the Messenger of Allah (may peace be upon him) as saying: He upon whom Allah intends to bestow goodness, He confers upon him an insight in religion; and I heard the Messenger of Allah (way peace be upon him) as saying: I am the treasurer. To one whom I give out of (my own) sweet will, he would be blessed in that, but he whom I give (yielding to his constant begging and for his covetousness is like one who would eat, but would not be satisfied.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "10882",
        "27"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2450",
      "hadith_no": "2450",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4913",
      "hadith_no": "4913",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "قال مسلم ورواه معاوية بن صالح عن ربيعة بن يزيد، عن مسلم بن قرظة، عن عوف بن مالك، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11414",
        "10963",
        "10805"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5092",
      "hadith_no": "5092",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن المبارك، عن حيوة بن شريح، قال سمعت  ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني، يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم من أهل الكتاب نأكل في آنيتهم وأرض صيد أصيد بقوسي وأصيد بكلبي المعلم أو بكلبي الذي ليس بمعلم فأخبرني ما الذي يحل لنا من ذلك قال ‏\"‏ أما ما ذكرت أنكم بأرض قوم من أهل الكتاب تأكلون في آنيتهم فإن وجدتم غير آنيتهم فلا تأكلوا فيها وإن لم تجدوا فاغسلوها ثم كلوا فيها وأما ما ذكرت أنك بأرض صيد فما أصبت بقوسك فاذكر اسم الله ثم كل وما أصبت بكلبك المعلم فاذكر اسم الله ثم كل وما أصبت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported:                      I came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, we are in the land of the People of the Book, (so) we eat in their utensils, and (live) in a hunting region. where I hunt with, the help of my bow, and hunt with my trained dog, or with my dog which is not trained. So inform me what is lawful (Halal) for us out of that. He (the Holy Prophet) said: Regarding what you have mentioned of the fact that you live in the land belonging to the People of the Book and so you eat in their utensils, but if you can get utensils other than theirs, then don't eat in them; but if you do not find any, then wash them and eat in them. And regarding what you have mentioned about (your living) in a hunting region, what you hunt, (strike) with the help of your bow, recite the name of Allah (while shooting an arrow) and then eat; and what you catch with the help of your trained dog, recite the name of Allah (while letting oil) the dog and then eat it, and what you get with the help of your untrained dog, (if you find it alive) and slaughter it (according to the law of the Shari'ah), eat it.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6737",
      "hadith_no": "6737",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن بن بهرام الدارمي، حدثنا مروان، - يعني ابن محمد الدمشقي - حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم فيما روى عن الله، تبارك وتعالى أنه قال ‏\"‏ يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا يا عبادي كلكم ضال إلا من هديته فاستهدوني أهدكم يا عبادي كلكم جائع إلا من أطعمته فاستطعموني أطعمكم يا عبادي كلكم عار إلا من كسوته فاستكسوني أكسكم يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعا فاستغفروني أغفر لكم يا عبادي إنكم لن تبلغوا ضري فتضروني ولن تبلغوا نفعي فتنفعوني يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أتقى قلب رجل واحد منكم ما زاد ذلك في ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم كانوا على أفجر قلب رجل واحد ما نقص ذلك من ملكي شيئا يا عبادي لو أن أولكم وآخركم وإنسكم وجنكم قاموا في صعيد واحد فسألوني فأعطيت كل إنسان مسألته ما نقص ذلك مما عندي إلا كما ينقص المخيط إذا أدخل البحر يا عبادي إنما هي أعمالكم أحصيها لكم ثم أوفيكم إياها فمن وجد خيرا فليحمد الله ومن وجد غير ذلك فلا يلومن إلا نفسه ‏\"‏ ‏.‏ قال سعيد كان أبو إدريس الخولاني إذا حدث بهذا الحديث جثا على ركبتيه ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying that Allah, the Exalted and Glorious, said:                      My servants, I have made oppression unlawful for Me and unlawful for you, so do not commit oppression against one another. My servants, all of you are liable to err except one whom I guide on the right path, so seek right guidance from Me so that I should direct you to the right path. O My servants, all of you are hungry (needy) except one whom I feed, so beg food from Me, so that I may give that to you. O My servants, all of you are naked (need clothes) except one whom I provide garments, so beg clothes from Me, so that I should clothe you. O My servants, you commit error night and day and I am there to pardon your sins, so beg pardon from Me so that I should grant you pardon. O My servants, you can neither do Me any harm nor can you do Me any good. O My servants, even if the first amongst you and the last amongst you and even the whole of human race of yours, and that of jinns even, become (equal in) God-conscious like the heart of a single person amongst you, nothing would add to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of the Jinns too in unison become the most wicked (all beating) like the heart of a single person, it would cause no loss to My Power. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of jinns also all stand in one plain ground and you ask Me and I confer upon every person what he asks for, it would not. in any way, cause any loss to Me (even less) than that which is caused to the ocean by dipping the needle in it. My servants, these for you I shall reward you for thern, so he who deeds of yours which I am recording finds good should praise Allah and he who does not find that should not blame anyone but his ownself. Sa'id said that when Abu Idris Khaulini narrated this hadith he knelt upon his knees.",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "20638",
        "11414",
        "11027",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7112",
      "hadith_no": "7112",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني معاوية، - وهو ابن صالح - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يزال يستجاب للعبد ما لم يدع بإثم أو قطيعة رحم ما لم يستعجل ‏\"‏ ‏.‏ قيل يا رسول الله ما الاستعجال قال ‏\"‏ يقول قد دعوت وقد دعوت فلم أر يستجيب لي فيستحسر عند ذلك ويدع الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The supplication of the servant is granted in case he does not supplicate for sin or for severing the ties of blood, or he does not become impatient. It was said: Allah's Messenger, what does:\" If he does not grow impatient\" imply? He said: That he should say like this: I supplicated and I supplicated but I did not find it being responded. and theu he becomes frustrated and abandons supplication.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20675",
        "11414",
        "11027",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-906",
      "hadith_no": "906",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يتوضأ فيحسن الوضوء ويصلي ركعتين يقبل بقلبه ووجهه عليهما إلا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Uqbah. B Amir al-Juhani reported the Messenger of Allah(ﷺ) as saying:                      Any one performs ablution and performs the ablution perfectly and then offers two rak’ahs of prayers concentrating on them with his heart and face but paradise will necessarily fall to his lot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "20675",
        "11414",
        "11027",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1629",
      "hadith_no": "1629",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، حدثنا محمد بن المهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، حدثنا سهل ابن الحنظلية، قال قدم على رسول الله عيينة بن حصن والأقرع بن حابس فسألاه فأمر لهما بما سألا وأمر معاوية فكتب لهما بما سألا فأما الأقرع فأخذ كتابه فلفه في عمامته وانطلق وأما عيينة فأخذ كتابه وأتى النبي صلى الله عليه وسلم مكانه فقال يا محمد أتراني حاملا إلى قومي كتابا لا أدري ما فيه كصحيفة المتلمس ‏.‏ فأخبر معاوية بقوله رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وعنده ما يغنيه فإنما يستكثر من النار ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ من جمر جهنم ‏\"‏ ‏.‏ فقالوا يا رسول الله وما يغنيه وقال النفيلي في موضع آخر وما الغنى الذي لا تنبغي معه المسألة قال ‏\"‏ قدر ما يغديه ويعشيه ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ أن يكون له شبع يوم وليلة أو ليلة ويوم ‏\"‏ ‏.‏ وكان حدثنا به مختصرا على هذه الألفاظ التي ذكرت ‏.‏",
      "text_en": " Narrated Sahl ibn Hanzaliyyah:                     Uyaynah ibn Hisn and Aqra' ibn Habis came to the Messenger of Allah (ﷺ). They begged from him. He commanded to give them what they begged. He ordered Mu'awiyah to write a document to give what they begged. Aqra' took his document, wrapped it in his turban, and went away.  As for Uyaynah, he took his document and came to the Prophet (ﷺ) at his home, and said to him: Muhammad, do you see me? I am taking a document to my people, but I do not know what it contains, just like the document of al-Mutalammis. Mu'awiyah informed the Messenger of Allah (ﷺ) of his statement.  Thereupon the Messenger of Allah (ﷺ) said: He who begs (from people) when he has sufficient is simply asking for a large amount of Hell-fire. (An-Nufayl (a transmitter) said elsewhere: \"embers of Hell\".)  They asked: Messenger of Allah, what is a sufficiency? (Elsewhere an-Nufayl said: What is a sufficiency which makes begging unfitting?)  He replied: It is that which would provide a morning and an evening meal. (Elsewhere an-Nufayl said: It is when one has enough for a day and night, or for a night and a day.) He (an-Nufayl) narrated to us this tradition briefly in the words that I have mentioned.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "11414",
        "11669",
        "1824"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1642",
      "hadith_no": "1642",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو إلى فحبيب وأما هو عندي فأمين عوف بن مالك قال كنا عند رسول الله صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ وكنا حديث عهد ببيعة قلنا قد بايعناك حتى قالها ثلاثا فبسطنا أيدينا فبايعناه فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك قال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتصلوا الصلوات الخمس وتسمعوا وتطيعوا ‏\"‏ ‏.‏ وأسر كلمة خفية قال ‏\"‏ ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد كان بعض أولئك النفر يسقط سوطه فما يسأل أحدا أن يناوله إياه ‏.‏ قال أبو داود حديث هشام لم يروه إلا سعيد ‏.‏",
      "text_en": " Awf b. Malik said :                      We were with Messenger of Allah (May peace be upon him), seven or eight or nine.  He said : Do you take the oath of allegiance to the Messenger of Allah (May peace be upon him), and we shortly took the oath of allegiance.  We said: we have already taken the oath of allegiance to you.  He repeated the same words three times.  We then stretched our hands and took the oath of allegiance to him.  A man (or us) said : We took the oath of allegiance to you; now on what should we take the oath of allegiance, Messenger of Allah ?  He replied: That you should worship Allah, do not associate anything with Him, offer five times prayer, listen and obey.  He uttered a word quietly  : And do not beg from the people.  When the whip fell on the ground, none of that group asked anyone to pick up the whip for him.Abu Dawud said : The version of Hisham was not narrated by anyone except Sa'id.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20733",
        "20638",
        "11414",
        "11027",
        "11026"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2406",
      "hadith_no": "2406",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، - المعنى - قالا حدثنا ابن وهب، حدثني معاوية، عن ربيعة بن يزيد، أنه حدثه عن قزعة، قال أتيت أبا سعيد الخدري وهو يفتي الناس وهم مكبون عليه فانتظرت خلوته فلما خلا سألته عن صيام رمضان في السفر فقال خرجنا مع النبي صلى الله عليه وسلم في رمضان عام الفتح فكان رسول الله صلى الله عليه وسلم يصوم ونصوم حتى بلغ منزلا من المنازل فقال ‏\"‏ إنكم قد دنوتم من عدوكم والفطر أقوى لكم ‏\"‏ ‏.‏ فأصبحنا منا الصائم ومنا المفطر - قال - ثم سرنا فنزلنا منزلا فقال ‏\"‏ إنكم تصبحون عدوكم والفطر أقوى لكم فأفطروا ‏\"‏ ‏.‏ فكانت عزيمة من رسول الله صلى الله عليه وسلم ‏.‏ قال أبو سعيد ثم لقد رأيتني أصوم مع النبي صلى الله عليه وسلم قبل ذلك وبعد ذلك ‏.‏",
      "text_en": " Narrated Qaza'ah:                     I came to Abu Sa'id al-Khudri while he was giving his legal opinion to the people who bent down on him. So I waited to see hi when he was alone. When he became alone, I asked him about keeping fast while travelling. He said: we went out along with the Prophet (ﷺ) in Ramadan in the year of conquest of Mecca. The Messenger of Allah (ﷺ) fasted and we fasted until he reached a certain stage. He said: You have come near your enemy; the breaking of fast will bring you more strength. Then morning came when some of us fasted and other broke their fast. He (Abu Sa'id al-Khudri) said: We then proceeded and alighted at a stage. He said: You are going to attack your enemy tomorrow morning ; breaking the fast will bring you more strength ; so break your fast (i.e. do not keep fast). This resolution (of breaking the fast) took place (due to the announcement) from the Messenger of Allah (ﷺ). Abu Sa'id said: Then I found myself keeping fast along with the Prophet (ﷺ) before and after that.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "36063",
        "20029",
        "27",
        "11414"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2548",
      "hadith_no": "2548",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، - يعني ابن بكير - حدثنا محمد بن مهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، عن سهل ابن الحنظلية، قال ‏:‏ مر رسول الله صلى الله عليه وسلم ببعير قد لحق ظهره ببطنه، فقال ‏:‏ ‏\"‏ اتقوا الله في هذه البهائم المعجمة فاركبوها وكلوها صالحة ‏\"‏ ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     The Messenger of Allah (ﷺ) came upon an emaciated camel and said: Fear Allah regarding these dumb animals. Ride them when they are in good condition and feed them when they are in good condition.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20637",
        "11414",
        "11669",
        "1824"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2855",
      "hadith_no": "2855",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا هناد بن السري، عن ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس الخولاني، عائذ الله قال سمعت أبا ثعلبة الخشني، يقول قلت يا رسول الله إني أصيد بكلبي المعلم وبكلبي الذي ليس بمعلم قال ‏\"‏ ما صدت بكلبك المعلم فاذكر اسم الله وكل وما اصدت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Taa'labat b. al-Khushani:                     I said: Messenger of Allah, I hunt with my trained dog, and with my untrained dog? He said: 'What you hunt with your trained dog, mention Allah's names (on it) and eat; and what you hunt with your untrained dog, and you find in a position that you slaughter it, then eat.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414",
        "11027"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-55",
      "hadith_no": "55",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن محمد بن عمران الثعلبي الكوفي، حدثنا زيد بن حباب، عن معاوية بن صالح، عن ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله اللهم اجعلني من التوابين واجعلني من المتطهرين فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أنس وعقبة بن عامر ‏.‏ قال أبو عيسى حديث عمر قد خولف زيد بن حباب في هذا الحديث ‏.‏ قال وروى عبد الله بن صالح وغيره عن معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر عن عمر ‏.‏ وعن ربيعة عن أبي عثمان عن جبير بن نفير عن عمر ‏.‏ وهذا حديث في إسناده اضطراب ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب كبير شيء ‏.‏ قال محمد وأبو إدريس لم يسمع من عمر شيئا ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated that :                     Allah's Messenger said: 'Whoever performs Wudu, making Wudu well, then says: (Ashhadu an la ilaha illallah, wahdahu la sharika lahu, wa ashhadu anna Muhammadan-abduhu wa rasuluhu, Allahummajalni minat tawwabin, waj'alni minal mutatahhirin) 'I testify that none has the right to be worshipped but Allah Alone, there are no partners for Him. And I testify that Muhammad is His servant and Messenger. O Allah! Make me among the repentant, and make me among those who purify themselves.' Then eight gates of Paradise are opened for him, that may enter by whichever of them wishes.\"",
      "usc_msa_ref": "",
      "chain": [
        "10898",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "3"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1560-2",
      "hadith_no": "1560",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس الخولاني، عائذ الله بن عبيد الله قال سمعت أبا ثعلبة الخشني، يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم أهل كتاب نأكل في آنيتهم قال ‏\"‏ إن وجدتم غير آنيتهم فلا تأكلوا فيها فإن لم تجدوا فاغسلوها وكلوا فيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Another Chain fro Abu Idris Al-Khawlani 'Ai'dhullah bin 'Ubaidullah who said:                      \"I heard Abu Tha'labah Al-Khushani saying: 'I went to the Messenger of Allah (ﷺ) and said: \"O Messenger of Allah! We live in a land of the People of the Book and we eat from their containers.\" He said: \"If you find other containers than do not eat from them. If you do not find them, then wash them and eat from them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414",
        "11027"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2639",
      "hadith_no": "2639",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي النضر، حدثنا أبو النضر، حدثنا أبو عقيل الثقفي عبد الله بن عقيل، حدثنا عبد الله بن يزيد، حدثني ربيعة بن يزيد، وعطية بن قيس، عن عطية السعدي، وكان، من أصحاب النبي صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبلغ العبد أن يكون من المتقين حتى يدع ما لا بأس به حذرا لما به البأس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Rabi'ah bin Yazid and 'Atiyyah bin Qais narrated from 'Atiyyah As-Sa'di  - and he was one of the Companions of the Prophet (ﷺ) - that the Messenger of Allah (ﷺ) said:                      \"The servant shall not reach the state of being among the Muttaqin until he leaves what there is no harm in out of caution for its harm.\"",
      "usc_msa_ref": "",
      "chain": [
        "30528",
        "20390",
        "20723",
        "1945",
        "11414",
        "10877"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3549-2",
      "hadith_no": "3549",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا بذلك القاسم بن دينار الكوفي حدثنا إسحاق بن منصور الكوفي عن إسرائيل بهذا ‏.‏ حدثنا أحمد بن منيع، حدثنا أبو النضر، حدثنا بكر بن خنيس، عن محمد القرشي، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن بلال، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عليكم بقيام الليل فإنه دأب الصالحين قبلكم وإن قيام الليل قربة إلى الله ومنهاة عن الإثم وتكفير للسيئات ومطردة للداء عن الجسد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث بلال إلا من هذا الوجه ولا يصح من قبل إسناده ‏.‏ قال سمعت محمد بن إسماعيل يقول محمد القرشي هو محمد بن سعيد الشامي وهو ابن أبي قيس وهو محمد بن حسان وقد ترك حديثه ‏.‏ وقد روى هذا الحديث معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس الخولاني عن أبي أمامة عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ عليكم بقيام الليل فإنه دأب الصالحين قبلكم وهو قربة إلى ربكم ومكفرة للسيئات ومنهاة للإثم ‏\"‏ ‏.‏ قال أبو عيسى وهذا أصح من حديث أبي إدريس عن بلال ‏.‏",
      "text_en": " That was narrated to us by Al-Qasim bin Dinar Al-Kufi (who said):                     “Ishaq bin Mansur narrated to us, from Isra’il” with this(Another chain) Bilal narrated that the Messenger of Allah said: “Hold fast to Qiyam Al-Lail, for it is the practice of the righteous before you, and indeed Qiyam Al-Lail is a means of nearness to Allah, a means of prevention from sin, an expiation for bad deeds, and a barrier for the body against disease.”",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20311",
        "30242",
        "20390",
        "25031",
        "11414",
        "11027",
        "24"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4070",
      "hadith_no": "4070",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا حجين بن المثنى، حدثنا الليث بن سعد، عن معاوية بن صالح، عن ربيعة بن يزيد، عن عبد الملك بن عامر، عن النعمان بن بشير، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ يا عثمان إنه لعل الله يقمصك قميصا فإن أرادوك على خلعه فلا تخلعه لهم ‏\"‏ ‏.‏ قال وفي الحديث قصة طويلة ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) said: \"O 'Uthman! Indeed Allah may give you a shirt, and if they wish that you take it off, do not take it off for them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20382",
        "20023",
        "20675",
        "11414",
        "274",
        "53"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4174",
      "hadith_no": "4174",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن يزيد بن عميرة، قال لما حضر معاذ بن جبل الموت قيل له يا أبا عبد الرحمن أوصنا ‏.‏ قال أجلسوني ‏.‏ فقال إن العلم والإيمان مكانهما من ابتغاهما وجدهما يقول ذلك ثلاث مرات والتمسوا العلم عند أربعة رهط عند عويمر أبي الدرداء وعند سلمان الفارسي وعند عبد الله بن مسعود وعند عبد الله بن سلام الذي كان يهوديا فأسلم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه عاشر عشرة في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن سعد ‏.‏ قال وهذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Yazid bin 'Umairah:                     \"When death was upon Mu'adh bin Jabal, it was said to him: 'O Abu 'Abdur-Rahman, advise us.' He said: 'Sit me up.' So he said: 'Indeed, knowledge and faith are at their place, whoever desires them shall find them.' He said that three times. 'And seek knowledge from four men: 'Uwaimir Abu Ad-Darda, with Salman Al-Farisi, with 'Abdullah bin Mas'ud, and with 'Abdullah bin Salam who used to be a Jew and then accepted Islam. For indeed, I heard the Messenger of Allah (ﷺ) saying, \"Indeed he is the tenth of ten in Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11414",
        "11027"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4213",
      "hadith_no": "4213",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو مسهر عبد الأعلى بن مسهر، عن سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن عبد الرحمن بن أبي عميرة، وكان، من أصحاب رسول الله صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال لمعاوية ‏\"‏ اللهم اجعله هاديا مهديا واهد به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abu 'Umairah - and he was one of the Companions of the Messenger of Allah (ﷺ):                     from the Prophet (ﷺ), that he said to Mu'awiyah: \"O Allah, make him a guiding one, and guide (others) by him.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20638",
        "11414"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-149",
      "hadith_no": "149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن عقبة بن عامر الجهني، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then says: \"Ashhadu an la ilaha ill-Allah was ashhadu anna Muhammadan 'abduhu wa rasuluh (I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is his slave and Messenger),\" eight gates of Paradise will be opened for him, and he may enter through whichever one he wishes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38553",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "189",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-152",
      "hadith_no": "152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثنا ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم صلى ركعتين يقبل عليهما بقلبه ووجهه وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then prays two Rak'ahs in which his heart and face are focused, Paradise will be his.\"",
      "usc_msa_ref": "",
      "chain": [
        "35153",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-460",
      "hadith_no": "460",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال أخبرنا الحبيب الأمين، عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ فرددها ثلاث مرات فقدمنا أيدينا فبايعناه فقلنا يا رسول الله قد بايعناك فعلام قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وأسر كلمة خفية أن لا تسألوا الناس شيئا ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik Al-Ashja'i said:                      \"We were with the Messenger of Allah (ﷺ) and he said: 'Will you not pledge to the Messenger of Allah (ﷺ)?' And he repeated it three times. So we stretched forth our hands to give our pledge. We said: 'O Messenger of Allah, we are willing to give you our pledge, but on what?' He said: 'That you will worship Allah and not associate anything with him, and (offer) the five daily prayers.' And he said, very quietly: 'And you will not ask the people for anything.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "11026"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-693-2",
      "hadith_no": "693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن ابن الديلمي، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن سليمان بن داود صلى الله عليه وسلم لما بنى بيت المقدس سأل الله عز وجل خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه وسأل الله عز وجل حين فرغ من بناء المسجد أن لا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                      \"When Sulaiman bin Dawud finished building BAir Al-Maqdis, he asked Allah for three things: Judgement that was in harmony with His judgement, and he was given that. And he asked Allah for a dominion that no one after him would have, and he was given that. And when he finished building the Masjid he asked Allah, the Mighty and Sublime, that no one should come to it, intending only to pray there, but he would emerge free of sin as the day his mother bore him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "5136",
        "29"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1215",
      "hadith_no": "1215",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، عن ابن وهب، عن معاوية بن صالح، قال حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم يصلي فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ثلاث مرات ثم قلت ألعنك بلعنة الله فلم يستأخر ثلاث مرات ثم أردت أن آخذه والله لولا دعوة أخينا سليمان لأصبح موثقا بها يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                     \"The Messenger of Allah (ﷺ) stood praying, and we heard him say: 'I seek refuge with Allah from you.' Then he said: 'I curse you with the curse of Allah (SWT),' three times and stretched out his hand as if to take something. When he finished praying we said: 'O Messenger of Allah, we heard you say something in your prayer that we have never heard you say before, and we saw you stretch out your hand.' He said: 'The enemy of Allah (SWT), Iblis, came with a brand of fire to throw it in my face, so I said: I seek refuge with Allah from you three times, then I wanted to take hold of him. By Allah (SWT), were it not for the prayer of our brother Sulaiman, he would have been tied up this morning for the children of Al-Madinah to play with him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4266",
      "hadith_no": "4266",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني محمد بن عبيد بن محمد الكوفي المحاربي، قال حدثنا عبد الله بن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد، يقول أنبأنا أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني، يقول قلت يا رسول الله إنا بأرض صيد أصيد بقوسي وأصيد بكلبي المعلم وبكلبي الذي ليس بمعلم ‏.‏ فقال ‏\"‏ ما أصبت بقوسك فاذكر اسم الله عليه وكل وما أصبت بكلبك المعلم فاذكر اسم الله وكل وما أصبت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'labah Al-Khushani said:                     \"I said: 'O Messenger of Allah, we live in a land where people hunt, and I hunt with my bow and with my trained dog, and with trained dog, and with my dog which ins not trained.' He said: 'whatever you catch with your bow, mention the name of Allah over it and eat. Whatever you catch with the trained dog, mention the name of Allah over it and eat. Whatever you catch with your untrained dog and you reach it while it is still alive, then slaughter it, and eat.\"\"( Sahih",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20025",
        "26010",
        "11414"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5670",
      "hadith_no": "5670",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، قال حدثنا الأوزاعي، قال حدثني ربيعة بن يزيد، ح وأخبرني عمرو بن عثمان بن سعيد، عن بقية، عن أبي عمرو، - وهو الأوزاعي - عن ربيعة بن يزيد، عن عبد الله بن الديلمي، قال دخلت على عبد الله بن عمرو بن العاص وهو في حائط له بالطائف يقال له الوهط وهو مخاصر فتى من قريش يزن ذلك الفتى بشرب الخمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شرب الخمر شربة لم تقبل له توبة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم تقبل توبته أربعين صباحا فإن تاب تاب الله عليه فإن عاد كان حقا على الله أن يسقيه من طينة الخبال يوم القيامة ‏\"‏ ‏.‏ اللفظ لعمرو ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ad-Dailami said:                     \"I entered upon 'Abdullah bin 'Amr bin Al-'As when he was in a garden of his in At-Ta'if called Al-Waht. He was walking and holding hands with a young man of Quraish who was suspected of drinking Khamr. He said: 'I heard the Messenger of Allah [SAW] say: Whoever drinks Khamr once, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again (a fourth time), then it is a right upon Allah to make him drink from the mud of Khibal on the Day of Resurrection.\" This is the wording of 'Amr.",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "20389",
        "11049",
        "20024",
        "11414",
        "10581",
        "20644",
        "11414",
        "5136"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-117",
      "hadith_no": "117",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا الفرج بن فضالة، عن ربيعة بن يزيد الدمشقي، عن النعمان بن بشير، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا عثمان إن ولاك الله هذا الأمر يوما فأرادك المنافقون أن تخلع قميصك الذي قمصك الله فلا تخلعه ‏\"‏ ‏.‏ يقول ذلك ثلاث مرات ‏.‏ قال النعمان فقلت لعائشة ما منعك أن تعلمي الناس بهذا قالت أنسيته والله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     The Messenger of Allah said: \"O 'Uthman, if Allah places you in authority over this matter (as the caliph) some day and the hypocrites want to rid you of the garment with which Allah has clothed you (i.e., the position of caliph), do not take it off.\" He said that three times. (One of the narrators) Nu'man said: \"I said to 'Aishah: 'What kept you from telling the people that?' She said: 'I was made to forget it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "27031",
        "11414",
        "274",
        "53"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-874",
      "hadith_no": "874",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، حدثنا ربيعة بن يزيد، عن قزعة، قال سألت أبا سعيد الخدري عن صلاة، رسول الله  صلى الله عليه وسلم  فقال ليس لك في ذلك خير ‏.‏ قلت بين رحمك الله ‏.‏ قال كانت الصلاة تقام لرسول الله  صلى الله عليه وسلم  الظهر فيخرج أحدنا إلى البقيع فيقضي حاجته ويجيء فيتوضأ فيجد رسول الله  صلى الله عليه وسلم  في الركعة الأولى من الظهر ‏.‏",
      "text_en": " It wasnarrated that Qaza’ah said:                      “I asked Abu Sa’eed Al-Khudriaboutthe prayer of the Messenger of Allah (ﷺ). He said: ‘There isnothing good in that for you.’* I said: ‘Explain it, may Allahhavemercy on you.’ He said: ‘The Iqamah would be given for theZuhr prayerfor the Messenger of Allah (ﷺ), then one of us would goout to Al-Baqi’, relieve himself, then come back and performablution, and hewould find the Messenger of Allah (ﷺ) still in thefirst Rak’ah ofZuhr.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "38"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2977",
      "hadith_no": "2977",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا سعيد بن عبد العزيز التنوخي، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم، قال حدثني الحبيب الأمين، - أما هو إلى فحبيب وأما هو عندي فأمين - عوف بن مالك الأشجعي قال كنا عند النبي صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فبسطنا أيدينا فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك فقال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتقيموا الصلوات الخمس وتسمعوا وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد رأيت بعض أولئك النفر يسقط سوطه فلا يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " ‘Awfbin Malik Al-Ashja’i said:                      “We were with the Prophet (ﷺ) –seven or eight or nine of us – and he said: ‘Will you not givepledgeto the Messenger of Allah?’ So we stretched forth our handsandsomeone said: ‘O Messenger of Allah, we have already given youourpledge. On what basis shall we give this pledge?’ He said: ‘(Onthebasis that) you will worship Allah and not associate anythingwithHim, you will establish the five daily prayers, you will listenandobey’ – then he spoke some words under his breath – ‘andyou will notask the people for anything.’ He said: ‘I saw someof that group. Ifhe dropped his whip he would not ask anyone to pickit up for him.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20733",
        "20638",
        "11414",
        "11027"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3328",
      "hadith_no": "3328",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الضحاك بن مخلد، حدثنا حيوة بن شريح، حدثني ربيعة بن يزيد، أخبرني أبو إدريس الخولاني، عن أبي ثعلبة الخشني، قال أتيت رسول الله  صلى الله عليه وسلم  فقلت يا رسول الله إنا بأرض أهل كتاب نأكل في آنيتهم وبأرض صيد أصيد بقوسي وأصيد بكلبي المعلم وأصيد بكلبي الذي ليس بمعلم ‏.‏ قال فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أما ما ذكرت أنكم في أرض أهل كتاب فلا تأكلوا في آنيتهم إلا أن لا تجدوا منها بدا فإن لم تجدوا منها بدا فاغسلوها وكلوا فيها وأما ما ذكرت من أمر الصيد فما أصبت بقوسك فاذكر اسم الله وكل وما صدت بكلبك المعلم فاذكر اسم الله وكل وما صدت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Tha’labah Al-Khushani said:                      “I came to theMessenger of Allah (ﷺ) and said: ‘O Messenger of Allah, we livein aland of the People of the Book and we eat from their vessels.And welive in a land (where there is) game, so I hunt with my bowand withmy trained dog and with my untrained dog.’ The Messengerof Allah(ﷺ) said: ‘As for what you say about living in a land ofthe Peopleof the Book, do not eat from their vessels unless you canfind noalternative. If you can fidn no alternative then wash themand eatfrom them. With regard to what you say about hunting,whatever youcatch with your bow, say the Name of Allah over it andeat. Whateveryou catch with your trained dog, say the Name of Allahover it andeat. But whatever you catch with your untrained dog, thencatch it,slaughter it, then eat.’”",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "26010",
        "11414",
        "11027",
        "4056"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3502",
      "hadith_no": "3502",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن ربيعة بن يزيد، عن ابن الديلمي، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من شرب الخمر وسكر لم تقبل له صلاة أربعين صباحا وإن مات دخل النار فإن تاب تاب الله عليه وإن عاد فشرب فسكر لم تقبل له صلاة أربعين صباحا فإن مات دخل النار فإن تاب تاب الله عليه وإن عاد فشرب فسكر لم تقبل له صلاة أربعين صباحا فإن مات دخل النار فإن تاب تاب الله عليه وإن عاد كان حقا على الله أن يسقيه من ردغة الخبال يوم القيامة ‏\"‏ ‏.‏ قالوا يا رسول الله وما ردغة الخبال قال ‏\"‏ عصارة أهل النار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Messenger of Allah(ﷺ) said:                      “Whoever drinks wine and gets drunk, his prayer willnotbe accepted for forty days, and if he dies he will enter Hell,but ifhe repents, Allah will accept his repentance. If he drinkswine againand gets drunk, his prayer will not be accepted for fortydays, and ifhe dies he will enter Hell, but if he repents, Allahwill accept hisrepentance. If he drinks wine again and gets drunk,his prayer willnot be accepted for forty days, and if he dies hewill enter Hell, butif he repents Allah will accept his repentance.But if he does itagain, then Allah will most certainly make himdrink of the mire ofthe puss or sweat on the Day of Resurrection.”They said: “O Messengerof Allah, what is the mire of the pus orsweat? He said: “Thedrippings of the people of Hell.”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11414",
        "5136",
        "29"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 37,
  "grade_display": {
    "en": "Follower (Tabi') [4th Generation]",
    "ar": "تابعي [الجيل الرابع]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
  }
}