{
  "id": "11411",
  "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
  "full_name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "128",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Azdi",
      "Client",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4050",
      "name": "'Abdullah bin al-Harith al-Zubaidi ( عبد الله بن الحارث بن جزء الزبيدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16001",
      "name": "Aslm bin Yazid Abu أسلم بن يزيد أبو عمران",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10857",
      "name": "Khayr bin Na'eem خير بن نعيم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11204",
      "name": "'Arak bin Malik عراك بن مالك الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11427",
      "name": "Sa'id bin Abi Hnd سعيد بن أبي هند الفزاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11407",
      "name": "Ja'far bin Rabi'ya bin Shrhbyl جعفر بن ربيعة بن شرحبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10850",
      "name": "Bakr bin 'Amr al-Ma'fari بكر بن عمرو المعافري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10854",
      "name": "al-Harith bin Y'aqub الحارث بن يعقوب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11537",
      "name": "Muhammad bin 'Amr bin Halhala محمد بن عمرو بن حلحلة الديلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10605",
      "name": "'Imran bin Abi Anas عمران بن أبي أنس القرشي العامري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10619",
      "name": "Musa bin Sa'd bin Zayd موسى بن سعد بن زيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20623",
      "name": "'Abdullah bin 'Ayyash bin 'Abbas عبد الله بن عياش بن عباس القتباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "28",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، أن رجلا، سأل رسول الله صلى الله عليه وسلم أى الإسلام خير قال ‏\"‏ تطعم الطعام، وتقرأ السلام على من عرفت ومن لم تعرف ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Amr:                          A person asked Allah's Apostle . \"What (sort of) deeds in or (what      qualities of) Islam are good?\" He replied, \"To feed (the poor) and      greet those whom you know and those whom you don't know.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "29"
      ]
    },
    {
      "hadith_no": "828",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء،‏.‏ وحدثنا الليث، عن يزيد بن أبي حبيب، ويزيد بن محمد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب النبي صلى الله عليه وسلم فذكرنا صلاة النبي صلى الله عليه وسلم فقال أبو حميد الساعدي أنا كنت أحفظكم لصلاة رسول الله صلى الله عليه وسلم رأيته إذا كبر جعل يديه حذاء منكبيه، وإذا ركع أمكن يديه من ركبتيه، ثم هصر ظهره، فإذا رفع رأسه استوى حتى يعود كل فقار مكانه، فإذا سجد وضع يديه غير مفترش ولا قابضهما، واستقبل بأطراف أصابع رجليه القبلة، فإذا جلس في الركعتين جلس على رجله اليسرى ونصب اليمنى، وإذا جلس في الركعة الآخرة قدم رجله اليسرى ونصب الأخرى وقعد على مقعدته‏.‏ وسمع الليث يزيد بن أبي حبيب ويزيد من محمد بن حلحلة وابن حلحلة من ابن عطاء‏.‏ قال أبو صالح عن الليث كل فقار‏.‏ وقال ابن المبارك عن يحيى بن أيوب قال حدثني يزيد بن أبي حبيب أن محمد بن عمرو حدثه كل فقار‏.‏",
      "text_en": " Narrated Muhammad bin `Amr bin `Ata':                     I was sitting with some of the companions of Allah's Apostle and we were discussing about the way of praying of the Prophet. Abu Humaid As-Sa`idi said, \"I remember the prayer of Allah's Apostle better than any one of you. I saw him raising both his hands up to the level of the shoulders on saying the Takbir; and on bowing he placed his hands on both knees and bent his back straight, then he stood up straight from bowing till all the vertebrate took their normal positions. In prostrations, he placed both his hands on the ground with the forearms away from the ground and away from his body, and his toes were facing the Qibla. On sitting In the second rak`a he sat on his left foot and propped up the right one; and in the last rak`a he pushed his left foot forward and kept the other foot propped up and sat over the buttocks.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11168",
        "11537",
        "11220",
        "20023",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "834",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر الصديق  رضى الله عنه ‏.‏ أنه قال لرسول الله صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي‏.‏ قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني إنك أنت الغفور الرحيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr As-Siddiq:                     I asked Allah's Apostle to teach me an invocation so that I may invoke Allah with it in my prayer. He told me to say, \"Allahumma inni zalumtu nafsi zulman kathiran, Wala yaghfiru dh-dhunuba illa anta, fa ghfir li maghfiratan min `indika, wa r-hamni, innaka anta l-ghafuru r-rahim (O Allah! I have done great injustice to myself and none except You forgives sins, so bestow on me a forgiveness from You, and Have Mercy on me, You are the Forgiver, the Merciful).",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يزيد، قال حدثنا سعيد بن أبي أيوب، قال حدثني يزيد بن أبي حبيب، قال سمعت مرثد بن عبد الله اليزني، قال أتيت عقبة بن عامر الجهني فقلت ألا أعجبك من أبي تميم يركع ركعتين قبل صلاة المغرب‏.‏ فقال عقبة إنا كنا نفعله على عهد رسول الله صلى الله عليه وسلم‏.‏ قلت فما يمنعك الآن قال الشغل‏.‏",
      "text_en": " Narrated Marthad bin `Abdullah Al-Yazani:                     I went to `Uqba bin 'Amir Al-Juhani and said, \"Is it not surprising that Abi Tamim offers two rak`at before the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Apostle.\" I asked him, \"What prevents you from offering it now?\" He replied, \"Business.\"",
      "chain": [
        "1945",
        "20375",
        "11411",
        "11410"
      ]
    },
    {
      "hadith_no": "1344",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     One day the Prophet went out and offered the funeral prayers of the martyrs of Uhud and then went up the pulpit and said, \"I will pave the way for you as your predecessor and will be a witness on you. By Allah! I see my Fount (Kauthar) just now and I have been given the keys of all the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that you will worship others along with Allah after my death, but I am afraid that you will fight with one another for the worldly things.\"",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "1893",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، أن عراك بن مالك، حدثه أن عروة أخبره عن عائشة  رضى الله عنها  أن قريشا، كانت تصوم يوم عاشوراء في الجاهلية، ثم أمر رسول الله صلى الله عليه وسلم بصيامه حتى فرض رمضان وقال رسول الله صلى الله عليه وسلم ‏\"‏ من شاء فليصمه، ومن شاء أفطر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (The tribe of) Quraish used to fast on the day of Ashura' in the Pre-Islamic period, and then Allah's Apostle ordered (Muslims) to fast on it till the fasting in the month of Ramadan was prescribed; whereupon the Prophet said, \"He who wants to fast (on 'Ashura') may fast, and he who does not want to fast may not fast.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن عطاء بن أبي رباح، عن جابر بن عبد الله  رضى الله عنهما  أنه سمع رسول الله صلى الله عليه وسلم يقول عام الفتح، وهو بمكة ‏\"‏ إن الله ورسوله حرم بيع الخمر والميتة والخنزير والأصنام ‏\"‏‏.‏ فقيل يا رسول الله، أرأيت شحوم الميتة فإنها يطلى بها السفن، ويدهن بها الجلود، ويستصبح بها الناس‏.‏ فقال ‏\"‏ لا، هو حرام ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ قاتل الله اليهود، إن الله لما حرم شحومها جملوه ثم باعوه فأكلوا ثمنه ‏\"‏‏.‏   قال أبو عاصم حدثنا عبد الحميد، حدثنا يزيد، كتب إلى عطاء سمعت جابرا  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I heard Allah's Apostle, in the year of the Conquest of Mecca, saying, \"Allah and His Apostle made illegal the trade of alcohol, dead animals, pigs and idols.\" The people asked, \"O Allah's Apostle! What about the fat of dead animals, for it was used for greasing the boats and the hides; and people use it for lights?\" He said, \"No, it is illegal.\" Allah's Apostle further said, \"May Allah curse the Jews, for Allah made the fat (of animals) illegal for them, yet they melted the fat and sold it and ate its price.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2500",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته ضحايا، فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     that Allah's Apostle gave him some sheep to distribute among his companions in order to sacrifice them and a kid was left. He told the Prophet about it and the Prophet said to him, \"Sacrifice it on your behalf.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "2721",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحق الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle said, \"From among all the conditions which you have to fulfill, the conditions which make it legal for you to have sexual relations (i.e. the marriage contract) have the greatest right to be fulfilled.\"",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "3941",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن الصنابحي، عن عبادة بن الصامت  رضى الله عنه  أنه قال إني من النقباء الذين بايعوا رسول الله صلى الله عليه وسلم‏.‏ وقال بايعناه على أن لا نشرك بالله شيئا، ولا نسرق، ولا نزني، ولا نقتل النفس التي حرم الله، ولا ننتهب، ولا نعصي بالجنة إن فعلنا ذلك، فإن غشينا من ذلك شيئا كان قضاء ذلك إلى الله‏.‏",
      "text_en": " Narrated 'Ubada bin As Samit:                     I was one of the Naqibs who gave the ('Aqaba) Pledge of Allegiance to Allah's Apostle . We gave the pledge of allegiance to him that we would not worship anything other than Allah, would not steal, would not commit illegal sexual intercourse, would not kill a person whose killing Allah has made illegal except rightfully, would not rob each other, and we would not be promised Paradise jf we did the above sins, then if we committed one of the above sins, Allah will give His Judgment concerning it.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا زكرياء بن عدي، أخبرنا ابن المبارك، عن حيوة، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد بعد ثماني سنين، كالمودع للأحياء والأموات، ثم طلع المنبر فقال ‏\"‏ إني بين أيديكم فرط، وأنا عليكم شهيد، وإن موعدكم الحوض، وإني لأنظر إليه من مقامي هذا، وإني لست أخشى عليكم أن تشركوا، ولكني أخشى عليكم الدنيا أن تنافسوها ‏\"‏‏.‏ قال فكانت آخر نظرة نظرتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle offered the funeral prayers of the martyrs of Uhud eight years after (their death), as if bidding farewell to the living and the dead, then he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness on you, and your promised place to meet me will be Al- Haud (i.e. the Tank) (on the Day of Resurrection), and I am (now) looking at it from this place of mine. I am not afraid that you will worship others besides Allah, but I am afraid that worldly life will tempt you and cause you to compete with each other for it.\" That was the last look which I cast on Allah's Apostle.",
      "chain": [
        "30272",
        "30464",
        "20025",
        "26010",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4134",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     One day the Prophet went out and offered the (funeral) prayer for the people (i.e. martyrs) of Uhud as he used to offer a funeral prayer for any dead person, and then (after returning) he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness upon you, and I am looking at my Tank just now, and I have been given the keys of the treasures of the world (or the keys of the world). By Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will compete with each other for (the pleasures of) this world.\"",
      "chain": [
        "30237",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4341",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن عطاء بن أبي رباح، عن جابر بن عبد الله  رضى الله عنهما  أنه سمع رسول الله صلى الله عليه وسلم يقول عام الفتح وهو بمكة ‏\"‏ إن الله ورسوله حرم بيع الخمر ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That he heard Allah's Apostle saying in the year of the Conquest (of Mecca) while he was in Mecca, \"Allah and His Apostle have made the selling of wine (i.e. alcoholic drinks) unlawful.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4677",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد بن أبي حبيب، قال عطاء سمعت جابر بن عبد الله  رضى الله عنهما  سمعت النبي صلى الله عليه وسلم قال ‏\"‏ قاتل الله اليهود، لما حرم الله عليهم شحومها جملوه ثم باعوه فأكلوها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"May Allah curse the Jews! When Allah forbade them to eat the fat of animals, they melted it and sold it, and utilized its price! \"",
      "chain": [
        "30237",
        "20023",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5178",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، أن زينب ابنة أبي سلمة، أخبرته أن أم حبيبة قالت لرسول الله صلى الله عليه وسلم إنا قد تحدثنا أنك ناكح درة بنت أبي سلمة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعلى أم سلمة لو لم أنكح أم سلمة ما حلت لي، إن أباها أخي من الرضاعة ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Salama:                     Um Habiba said to Allah's Apostle \"We have heard that you want to marry Durra bint Abu-Salama.\" Allah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not married Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\" 'And there is no blame on you if you make hint of betrothal or conceal it in your hearts. Allah is Oft- Forgiving, Most Forbearing.' (2.235) Ibn `Abbas said, \"Hint your intention of marrying' is made by saying (to the widow) for example: \"I want to marry, and I wish that Allah will make a righteous lady available for me.' \" Al-Qasim said: One may say to the widow: 'I hold all respect for you, and I am interested in you; Allah will bring you much good, or something similar 'Ata said: One should hint his intention, and should not declare it openly. One may say: 'I have some need. Have good tidings. Praise be to Allah; you are fit to remarry.' She (the widow) may say in reply: I am listening to what you say,' but she should not make a promise. Her guardian should not make a promise (to somebody to get her married to him) without her knowledge. But if, while still in the Iddat period, she makes a promise to marry somebody, and he ultimately marries her, they are not to be separated by divorce (i.e., the marriage is valid).",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "244",
        "59"
      ]
    },
    {
      "hadith_no": "5206",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحق ما أوفيتم من الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     The Prophet said: \"The stipulations most entitled to be abided by are those with which you are given the right to enjoy the (women's) private parts (i.e. the stipulations of the marriage contract).",
      "chain": [
        "20296",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5287",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والدخول على النساء ‏\"‏‏.‏ فقال رجل من الأنصار يا رسول الله أفرأيت الحمو‏.‏ قال ‏\"‏ الحمو الموت ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     Allah's Apostle said, \"Beware of entering upon the ladies.\" A man from the Ansar said, \"Allah's Apostle! What about Al-Hamu the in-laws of the wife (the brothers of her husband or his nephews etc.)?\" The Prophet replied: The in-laws of the wife are death itself.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5861",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير، فلبسه، ثم صلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏ تابعه عبد الله بن يوسف عن الليث، وقال غيره فروج حرير‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     A silken Farruj was presented to Allah's Apostle and he put it on and offered the prayer in it. When he finished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit those who fear Allah!\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6207",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى، فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     We said, \"O Allah's Apostle! You send us out and it happens that we have to stay with such people as do not entertain us. What do you think about it?\" Allah's Apostle said to us, \"If you stay with some people and they entertain you as they should for a guest, accept is; but if they do not do then you should take from them the right of the guest, which they ought to give.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6502",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرطكم وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني قد أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     The Prophet went out and offered the funeral prayer for the martyrs of the (battle of) Uhud and then ascended the pulpit and said, \"I am your predecessor and I am a witness against you. By Allah, I am now looking at my Tank-lake (Al-Kauthar) and I have been given the keys of the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that after me you will worship others besides Allah, but I am afraid that you will start competing for (the pleasures of) this world.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6933",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني يزيد بن أبي حبيب، عن بكير بن عبد الله، عن سليمان بن يسار، عن عبد الرحمن بن جابر بن عبد الله، عن أبي بردة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ لا يجلد فوق عشر جلدات إلا في حد من حدود الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     The Prophet used to say, \"Nobody should be flogged more than ten stripes except if he is guilty of a crime, the legal punishment of which is assigned by Allah.\"",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11154",
        "11005",
        "11192",
        "11901"
      ]
    },
    {
      "hadith_no": "7266",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن عراك، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن شر الناس ذو الوجهين، الذي يأتي هؤلاء بوجه وهؤلاء بوجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostles said, \"The worst of all mankind is the double-faced one, who comes to some people with one countenance and to others, with another countenance.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، أن رجلا، سأل رسول الله صلى الله عليه وسلم أى الإسلام خير قال ‏\"‏ تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. 'Amr that a man asked the Messenger of Allah (may peace and blessings be upon him) which of the merits (is superior) in Islam. He (the Holy Prophet) remarked:                      That you provide food and extend greetings to one whom you know or do not know.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "29"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو الطاهر، أحمد بن عمرو بن عبد الله بن عمرو بن سرح المصري أخبرنا ابن وهب، عن عمرو بن الحارث، عن يزيد بن أبي حبيب، عن أبي الخير، أنه سمع عبد الله بن عمرو بن العاص، يقول إن رجلا سأل رسول الله صلى الله عليه وسلم أى المسلمين خير قال ‏\"‏ من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-As is reported to have said:                      Verily a person asked the Messenger of Allah (may peace and blessings be upon him) who amongst the Muslims was better. Upon this (the Holy Prophet) remarked: From whose hand and tongue the Muslims are safe.",
      "chain": [
        "20029",
        "20377",
        "11411",
        "11410",
        "29"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى العنزي، وأبو معن الرقاشي وإسحاق بن منصور كلهم عن أبي عاصم، - واللفظ لابن المثنى - حدثنا الضحاك، - يعني أبا عاصم - قال أخبرنا حيوة بن شريح، قال حدثني يزيد بن أبي حبيب، عن ابن شماسة المهري، قال حضرنا عمرو بن العاص وهو في سياقة الموت ‏.‏ فبكى طويلا وحول وجهه إلى الجدار فجعل ابنه يقول يا أبتاه أما بشرك رسول الله صلى الله عليه وسلم بكذا أما بشرك رسول الله صلى الله عليه وسلم بكذا قال فأقبل بوجهه ‏.‏ فقال إن أفضل ما نعد شهادة أن لا إله إلا الله وأن محمدا رسول الله إني قد كنت على أطباق ثلاث لقد رأيتني وما أحد أشد بغضا لرسول الله صلى الله عليه وسلم مني ولا أحب إلى أن أكون قد استمكنت منه فقتلته فلو مت على تلك الحال لكنت من أهل النار فلما جعل الله الإسلام في قلبي أتيت النبي صلى الله عليه وسلم فقلت ابسط يمينك فلأبايعك ‏.‏ فبسط يمينه - قال - فقبضت يدي ‏.‏ قال ‏\"‏ ما لك يا عمرو ‏\"‏ ‏.‏ قال قلت أردت أن أشترط ‏.‏ قال ‏\"‏ تشترط بماذا ‏\"‏ ‏.‏ قلت أن يغفر لي ‏.‏ قال ‏\"‏ أما علمت أن الإسلام يهدم ما كان قبله وأن الهجرة تهدم ما كان قبلها وأن الحج يهدم ما كان قبله ‏\"‏ ‏.‏ وما كان أحد أحب إلى من رسول الله صلى الله عليه وسلم ولا أجل في عيني منه وما كنت أطيق أن أملأ عينى منه إجلالا له ولو سئلت أن أصفه ما أطقت لأني لم أكن أملأ عينى منه ولو مت على تلك الحال لرجوت أن أكون من أهل الجنة ثم ولينا أشياء ما أدري ما حالي فيها فإذا أنا مت فلا تصحبني نائحة ولا نار فإذا دفنتموني فشنوا على التراب شنا ثم أقيموا حول قبري قدر ما تنحر جزور ويقسم لحمها حتى أستأنس بكم وأنظر ماذا أراجع به رسل ربي ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Shamasa Mahri that he said:                      We went to Amr b. al-As and he was about to die. He wept for a long time and turned his face towards the wall. His son said: Did the Messenger of Allah (may peace be upon him not give you tidings of this? Did the Messenger of Allah (may peace be upon him) not give you tidings of this? He (the narrator) said: He turned his face (towards the audience) and said: The best thing which we can count upon is the testimony that there is no god but Allah and that Muhammad is the Apostle of Allah. Verily I have passed through three phases. (The first one) in which I found myself averse to none else more than I was averse to the Messenger of Allah (may peace be upon him) and there was no other desire stronger in me than the one that I should overpower him and kill him. Had I died in this state, I would have been definitely one of the denizens of Fire. When Allah instilled the love of Islam in my heart, I came to the Apostle (may peace be upon him) and said: Stretch out your right hand so that may pledge my allegiance to you. He stretched out his right hand, I withdrew my hand, He (the Holy Prophet) said: What has happened to you, O 'Amr? replied: I intend to lay down some condition. He asked: What condition do you intend to put forward? I said: should be granted pardon. He (the Holy Prophet) observed: Are you not aware of the fact that Islam wipes out all the previous (misdeeds)? Verily migration wipes out all the previous (misdeeds), and verily the pilgrimage wipes out all the (previous) misdeeds. And then no one as or dear to me than the Messenger of Allah and none was more sublime in my eyes than he, Never could I, pluck courage to catch a full glimpse of his face due to its splendour. So if I am asked to describe his features, I cannot do that for I have not eyed him fully. Had I died in this state had every reason to hope that I would have bee among the dwellers of Paradise. Then we were responsible for certain things (in the light of which) I am unable to know what is in store for me. When I die, let neither female mourner nor fire accompany me. When you bury me, fill my grave well with earth, then stand around it for the time within which a camel is slaughtered and its meat is distributed so that I may enjoy your intimacy and (in your company) ascertain what answer I can give to the messengers (angels) of Allah.",
      "chain": [
        "30170",
        "30432",
        "26010",
        "11411"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، ح وحدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن جعفر، عن عراك، عن عروة، عن عائشة، أنها قالت إن أم حبيبة سألت رسول الله صلى الله عليه وسلم عن الدم فقالت عائشة رأيت مركنها ملآن دما فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ امكثي قدر ما كانت تحبسك حيضتك ثم اغتسلي وصلي ‏\"‏ ‏.‏",
      "text_en": " On the authority of 'A'isha:                      Umm Habiba asked the Messenger of Allah (may peace be upon him) about the blood (which flows beyond the period of menstruation). 'A'isha said: I saw her wash-tub full of blood. The Messenger of Allah (may peace be upon him) said: Remain away (from prayer) equal (to the length of time) that your menses prevented you. After this (after the period of usual courses) bathe yourself and offer prayer.",
      "chain": [
        "30490",
        "20023",
        "30367",
        "20023",
        "11411",
        "11407",
        "11204",
        "10511",
        "53",
        "59"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن أبا مرة، مولى عقيل حدثه أن أم هانئ بنت أبي طالب حدثته أنه، لما كان عام الفتح أتت رسول الله صلى الله عليه وسلم وهو بأعلى مكة ‏.‏ قام رسول الله صلى الله عليه وسلم إلى غسله فسترت عليه فاطمة ثم أخذ ثوبه فالتحف به ثم صلى ثمان ركعات سبحة الضحى ‏.‏",
      "text_en": " Umm Hani b. Abu Talib reported:                      It was the day of the conquest (of Mecca) that she went to the Messenger of Allah (may peace be upon him) and he was staying at a higher part (of that city). The Messenger of Allah (may peace be upon him) got up for his bath. Fatimah held a curtain around him (in order to provide him privacy). He then put on his garments and wrapped himself with that and then offered eight rak'ahs of the forenoon prayer.",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11427",
        "198"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني إسحاق بن منصور، وأبو بكر بن إسحاق قال أبو بكر حدثنا وقال ابن منصور، أخبرنا عمرو بن الربيع، أخبرنا يحيى بن أيوب، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه قال رأيت على ابن وعلة السبئي فروا فمسسته فقال ما لك تمسه قد سألت عبد الله بن عباس قلت إنا نكون بالمغرب ومعنا البربر والمجوس نؤتى بالكبش قد ذبحوه ونحن لا نأكل ذبائحهم ويأتونا بالسقاء يجعلون فيه الودك ‏.‏ فقال ابن عباس قد سألنا رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ دباغه طهوره ‏\"‏ ‏.‏",
      "text_en": " Abu al-Khair reported:                      I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah (may peace be upon him) about this and he said: Its tanning makes it pure.",
      "chain": [
        "30313",
        "11108",
        "20436",
        "20379",
        "11411",
        "17"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، ح وحدثني عيسى بن حماد المصري، أخبرنا الليث، عن يزيد بن أبي حبيب، ح قال وحدثني هارون بن عبد الله، حدثنا ابن أبي فديك، حدثنا الضحاك بن عثمان، ح قال وحدثنا المقدمي، حدثنا يحيى، - وهو القطان - عن ابن عجلان، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة بن زيد، ح قال وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - أخبرني محمد، وهو ابن عمرو ح قال وحدثني هناد بن السري، حدثنا عبدة، عن محمد بن إسحاق، كل هؤلاء عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، - إلا الضحاك وابن عجلان فإنهما زادا عن ابن عباس، عن علي، - عن النبي صلى الله عليه وسلم كلهم قالوا نهاني عن قراءة القرآن وأنا راكع ولم يذكروا في روايتهم النهى عنها في السجود كما ذكر الزهري وزيد بن أسلم والوليد بن كثير وداود بن قيس ‏.‏",
      "text_en": " This hadith has been narrated by some other narrators, Ibn 'Abbas and others, and they all reported that 'Ali said:                      The Apostle of Allah (may peace be upon him) forbade me to recite the Qur'an while I am in a state of bowing and prostration, and in their narration (there is a mention of) forbiddance from that (recital) in the state of prostration as it has been transmitted by Zuhri, Zaid b. Aslam, al-Wahid b. Kathir, and Dawud b. Qais.",
      "chain": [
        "30399",
        "11014",
        "20023",
        "11411",
        "30524",
        "20172",
        "20504",
        "20031",
        "10616",
        "30492"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن صفوان بن سليم، عن عبد الرحمن الأعرج، مولى بني مخزوم عن أبي هريرة، أنه قال سجد رسول الله صلى الله عليه وسلم في ‏{‏ إذا السماء انشقت‏}‏ و ‏{‏ اقرأ باسم ربك‏}‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) prostrated himself (while reciting these verses).\" When the heaven burst asunder\" ;\" Read in the name of Thy Lord\".",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11177",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1445",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن سواد العامري، ومحمد بن سلمة المرادي، وأحمد بن عيسى، - وألفاظهم متقاربة - قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، أن موسى بن سعد الأنصاري، حدثه عن حفص بن عبيد الله، عن أنس بن مالك، أنه قال صلى لنا رسول الله صلى الله عليه وسلم العصر فلما انصرف أتاه رجل من بني سلمة فقال يا رسول الله إنا نريد أن ننحر جزورا لنا ونحن نحب أن تحضرها ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فانطلق وانطلقنا معه فوجدنا الجزور لم تنحر فنحرت ثم قطعت ثم طبخ منها ثم أكلنا قبل أن تغيب الشمس ‏.‏ وقال المرادي حدثنا ابن وهب عن ابن لهيعة وعمرو بن الحارث في هذا الحديث ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) led us in the afternoon prayer. When he completed it, a person from Bani Salama came to him and said: Messenger of Allah, we intend to slaughter our came and we are desirous that you should also be present there (on this occasion). He (the Holy Prophet) said: Yes. He (the person) went and we also went along with him and we found that the camel had not been slaughtered yet. Then it was slaughtered, and it was cut into pieces and then some of those were cooked, and then we ate (them) before the setting of the sun. This hadith has also been narrated by another chain of transmitters.",
      "chain": [
        "30443",
        "30491",
        "30227",
        "11439",
        "20029",
        "20377",
        "11411",
        "19"
      ]
    },
    {
      "hadith_no": "1756",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، عن عروة، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم كان يصلي ثلاث عشرة ركعة بركعتى الفجر ‏.‏",
      "text_en": " Abu Salama b. Abd al-Rahman asked 'A'isha about the (night) prayer of the Messenger of Allah (may peace be upon him) during the month of Ramadan. She said:                      The Messenger of Allah (may peace be upon him) did not observe either in Ramadan or in other months more than eleven rak'ahs (of the night prayer). He (in the first instance) observed four rak'ahs. Ask not about their excellence and their length (i. e. these were matchless in perfection and length). He again observed four rak'ahs, and ask not about their excellence and their length. He would then observe three rak'ahs (of the Witr prayer). 'A'isha again said: I said: Messenger of Allah, do you sleep before observing the Witr prayer? He said: O 'A'isha, my eyes sleep but my heart does not sleep.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1965",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني يزيد بن أبي حبيب، عن خير بن نعيم الحضرمي، عن عبد الله بن هبيرة السبائي، - وكان ثقة - عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر ‏.‏ بمثله ‏.‏",
      "text_en": " Uqba b. 'Amir said:                      There were the times at which Allah's Messenger (may peace be upon him) forbade us to pray, or bury our dead: When the sun begins to rise till it is fully up, when the sun is at its height at midday till it passes over the meridian, and when the sun draws near to setting till it sets.",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11107",
        "11411",
        "10857",
        "10864",
        "10863",
        "4087"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، - قال ابن رمح أخبرنا الليث، - عن يزيد بن أبي حبيب، أن عراكا، أخبره أن عروة أخبره أن عائشة أخبرته أن قريشا كانت تصوم عاشوراء في الجاهلية ثم أمر رسول الله صلى الله عليه وسلم بصيامه حتى فرض رمضان فقال رسول الله صلى الله عليه وسلم ‏\"‏ من شاء فليصمه ومن شاء فليفطره ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that the Quraish used to observe fast on the day of Ashura during the pre-Islamic days. The Messenger of Allah (may peace be upog him) then commanded to fast on that day till (fasting) in Ramadan became obligatory. Then the Messenger of Allah (may peace be upon him) said:                      He who wished to fast should do so. and he who wished to break it may do so.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30490",
        "20023",
        "11411",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن أربع نسوة أن يجمع بينهن المرأة وعمتها والمرأة وخالتها ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      that Allah's Messenger (may peace be upon him) forbade combining of four women in marriage: a woman with her father's sister, and a woman with her mother's sister.",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن الليث، وغيره، عن يزيد بن، أبي حبيب عن عبد الرحمن بن شماسة، أنه سمع عقبة بن عامر، على المنبر يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ المؤمن أخو المؤمن فلا يحل للمؤمن أن يبتاع على بيع أخيه ولا يخطب على خطبة أخيه حتى يذر ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir said on the pulpit that Allah's Messenger (may peace be upon him) said:                      A believer is the brother of a believer, so it is not lawful for a believer to outbid his brother, and he should not propose an engagement when his brother has thus proposed until he gives it up.",
      "chain": [
        "20029",
        "20023",
        "11411",
        "10867",
        "189"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا هشيم، ح وحدثنا ابن نمير، حدثنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد، الله اليزني عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏ هذا لفظ حديث أبي بكر وابن المثنى ‏.‏ غير أن ابن المثنى قال ‏\"‏ الشروط ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word\" condition\" ) it is\" conditions\".",
      "chain": [
        "20379",
        "20468",
        "30212",
        "20032",
        "30201",
        "20326",
        "30170",
        "20031",
        "11875",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "3652",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن عراك، عن عروة، عن عائشة، أنها أخبرته أن عمها من الرضاعة - يسمى أفلح - استأذن عليها فحجبته فأخبرت رسول الله صلى الله عليه وسلم فقال لها ‏\"‏ لا تحتجبي منه فإنه يحرم من الرضاعة ما يحرم من النسب ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that her foster-uncle whose name was Aflah sought permission from her (to enter the house) but she observed seclusion from him, and informed Allah's Messenger (may peace be upon him) who said to her:                      Don't observe veil from him for he is Mahram (one with whom marriage cannot be contracted) on account of fosterage as one is Mahram on account of consanguinity.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4132",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن عطاء بن أبي، رباح عن جابر بن عبد الله، أنه سمع رسول الله صلى الله عليه وسلم يقول عام الفتح وهو بمكة ‏\"‏ إن الله ورسوله حرم بيع الخمر والميتة والخنزير والأصنام ‏\"‏ ‏.‏ فقيل يا رسول الله أرأيت شحوم الميتة فإنه يطلى بها السفن ويدهن بها الجلود ويستصبح بها الناس فقال ‏\"‏ لا هو حرام ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ قاتل الله اليهود إن الله عز وجل لما حرم عليهم شحومها أجملوه ثم باعوه فأكلوا ثمنه ‏\"‏‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying in the Year of Victory while he was in Mecca:                      Verily Allah and His Messenger have forbidden the sale of wine, carcass, swine and idols, It was said: Allah's Messenger, you see that the fat of the carcass is used for coating the boats and varnishing the hides and people use it for lighting purposes, whereupon he said: No, it is forbidden, Then Allah's Messenger (may peace be upon him) said: May Allah the Exalted and Majestic destroy the Jews; when Allah forbade the use of fat of the carcass for them, they melted it, and then sold it and made use of its price (received from it).",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4133",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو أسامة، عن عبد الحميد، بن جعفر عن يزيد بن أبي حبيب، عن عطاء، عن جابر، قال سمعت رسول الله صلى الله عليه وسلم عام الفتح ح وحدثنا محمد بن المثنى حدثنا الضحاك - يعني أبا عاصم - عن عبد الحميد حدثني يزيد بن أبي حبيب قال كتب إلى عطاء أنه سمع جابر بن عبد الله يقول سمعت رسول الله صلى الله عليه وسلم عام الفتح بمثل حديث الليث ‏.‏",
      "text_en": " Yazid b. Abu Habib reported:                      'Ata' reported to me that he heard Jabir (b. 'Abdullah) saying it that he had heard that from Allah's Messenger (may peace be upon him) in the Year of Victory.",
      "chain": [
        "30201",
        "30212",
        "20318",
        "11875",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - حدثني عبد الله بن عياش، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال نذرت أختي أن تمشي، إلى بيت الله حافية فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيته فقال ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      My sister took a vow that she would walk bare foot to the house of Allah (Ka'ba). She asked me to inquire from Allah's Messenger (may peace be upon him) about it. I sought his decision and he said: She should walk on foot and ride also.",
      "chain": [
        "30193",
        "20378",
        "778",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرنا سعيد، بن أبي أيوب أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، أنه قال نذرت أختي ‏.‏ فذكر بمثل حديث مفضل ولم يذكر في الحديث حافية ‏.‏ وزاد وكان أبو الخير لا يفارق عقبة ‏.‏ وحدثنيه محمد بن حاتم، وابن أبي خلف، قالا حدثنا روح بن عبادة، حدثنا ابن، جريج أخبرني يحيى بن أيوب، أن يزيد بن أبي حبيب، أخبره بهذا الإسناد، ‏.‏ مثل حديث عبد الرزاق ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Uqba b. Amir Juhani. but in this no mention has been made of\" barefoot\".",
      "chain": [
        "30375",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "4561",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن الصنابحي، عن عبادة بن الصامت، أنه قال إني لمن النقباء الذين بايعوا رسول الله صلى الله عليه وسلم وقال بايعناه على أن لا نشرك بالله شيئا ولا نزني ولا نسرق ولا نقتل النفس التي حرم الله إلا بالحق ولا ننتهب ولا نعصي فالجنة إن فعلنا ذلك فإن غشينا من ذلك شيئا كان قضاء ذلك إلى الله ‏.‏ وقال ابن رمح كان قضاؤه إلى الله ‏.‏",
      "text_en": " Ubida b. as-Samit repnrted:                      I was one of those headmen who swore allegiance to Allah's Messenger (may peace be upon him) that we will not associate anything with Allah, and will not commit adultery, and will not steal, and will not kill any soul which Allah has forbidden, but with justice nor plunder, nor disobey (Allah and His Apostle), then Paradise (will be the reward) in case we do these (acts) ; and if we commit any outrage (and that goes unpunished in the world), it is Allah Who would decide about it. Ibn Rumh said: Its judgment lies with Allah.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "4613",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      We said to Allah's Messenger (may peace be upon him): You send us out and we come to the people who do not give us hospitality, so what is your opinion? Thereupon Allah's Messenger (may peace be upon him) said: If you come to the people who order for you what is befitting a guest, accept it; but if they do not. take from them what befits them to give to a guest.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4823",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي شعيب بن الليث، حدثني الليث، بن سعد حدثني يزيد بن أبي حبيب، عن بكر بن عمرو، عن الحارث بن يزيد الحضرمي، عن ابن حجيرة الأكبر، عن أبي ذر، قال قلت يا رسول الله ألا تستعملني قال فضرب بيده على منكبي ثم قال ‏\"‏ يا أبا ذر إنك ضعيف وإنها أمانة وإنها يوم القيامة خزى وندامة إلا من أخذها بحقها وأدى الذي عليه فيها ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Dharr who said:                      I said to the Holy Prophet (may peace be upon him): Messenger of Allah, will you not appoint me to a public office? He stroked my shoulder with his hand and said: Abu Dharr, thou art weak and authority is a trust. and on the Day of judgment it is a cause of humiliation and repentance except for one who fulfils its obligations and (properly) discharges the duties attendant thereon.",
      "chain": [
        "30489",
        "20023",
        "11411",
        "10850",
        "10853",
        "23"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، عن يزيد بن أبي سعيد، مولى المهري عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث إلى بني لحيان ‏\"‏ ليخرج من كل رجلين رجل ‏\"‏ ‏.‏ ثم قال للقاعد ‏\"‏ أيكم خلف الخارج في أهله وماله بخير كان له مثل نصف أجر الخارج ‏\"‏ ‏.‏",
      "text_en": " It has been narrated (through a still different chain of transmitters) on the authority of Abu Sa'id Khudrl that the Messenger of Allah (may peace be upon him) despatched a force to Banu Lihyan. (and said:                      ) One man from every two should join the force. Then he said to those who stayed behind: Those of you who will look well after the family and wealth of those who are going on the expedition will be getting half the reward of the warriors.",
      "chain": [
        "30116",
        "20029",
        "20377",
        "11411",
        "38"
      ]
    },
    {
      "hadith_no": "5066",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، حدثنا  عمرو بن الحارث، حدثني يزيد بن أبي حبيب، حدثني عبد الرحمن بن شماسة المهري، قال كنت عند مسلمة بن مخلد وعنده عبد الله بن عمرو بن العاص فقال عبد الله لا تقوم الساعة إلا على شرار الخلق هم شر من أهل الجاهلية لا يدعون الله بشىء إلا رده عليهم ‏.‏ فبينما هم على ذلك أقبل عقبة بن عامر فقال له مسلمة يا عقبة اسمع ما يقول عبد الله ‏.‏ فقال عقبة هو أعلم وأما أنا فسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال عصابة من أمتي يقاتلون على أمر الله قاهرين لعدوهم لا يضرهم من خالفهم حتى تأتيهم الساعة وهم على ذلك ‏\"‏ ‏.‏ فقال عبد الله أجل ‏.‏ ثم يبعث الله ريحا كريح المسك مسها مس الحرير فلا تترك نفسا في قلبه مثقال حبة من الإيمان إلا قبضته ثم يبقى شرار الناس عليهم تقوم الساعة ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abd al-Rahman b. Shamasa al- Mahri who said:                      I was in the company of Maslama b. Mukhallad, and 'Abdullah b. 'Amr b. 'As was with him. 'Abdullah said: The Hour shall some oniy when the worst type of people are left on the earth. They will be worse than the people of pre-Islamic days. They will get whatever they ask of Allah. While we were yet sitting when 'Uqba b. 'Amir came, and Maslama said to him: 'Uqba, listen to what 'Abdullah says. 'Uqba said: He knows better; so far as I am concerned, I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to fight in obedience to the Command of Allah, remaining dominant over their enemies. Those who will oppose them shall not do them any harm. They will remain ill this condition until the Hour overtakes them. (At this) 'Abdullah said: Yes. Then Allah will raise a wild which will be fragrant like musk and whose touch will be like the touch of silk; (but) it will cause the death of all (faithful) persons, not leaving behind a single person with an iota of faith in his heart. Then only the worst of men will remain to be overwhelmed by the Hour.",
      "chain": [
        "30484",
        "20377",
        "11411",
        "10867"
      ]
    },
    {
      "hadith_no": "5196",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على أصحابه ضحايا فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏ ‏.‏ قال قتيبة على صحابته ‏.‏",
      "text_en": " Uqba b. 'Amir reported that Allah's Messenger (may peace be upon him) gave the gifts of goats to be distributed amongst his Companions. They sacrificed them, but a lamb of one year of age was left. (Someone) made a mention of that to the Messenger of Allah (may peace be upon him), whereupon he said:                      You sacrifice it.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5548",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير فلبسه ثم صلى فيه ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏.‏",
      "text_en": " Uqba b. 'Amir said:                      A silk go vn was presented to Allah's Messenger (may peace be upon him) and he wore it and observed prayer in it and then returned and put it off so violently as if he despised it. He then said: It does not befit the Godfearing persons.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    }
  ],
  "total_hadiths": 224
}