{
  "id": "11416",
  "name": "Aslam Client Of 'Umar أسلم مولى عمر",
  "full_name": "Aslam Client Of 'Umar أسلم مولى عمر",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "34",
      "date_gregorian": "NA",
      "date_display": [
        "34 BH"
      ],
      "place": "Abyssinia"
    },
    "death": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ع  -  مخضرم ]",
      "Fiqh"
    ],
    "tags": [
      "Ally B.'Adi",
      "Client",
      "Makhdaram"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1514",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن زيد بن أسلم، عن أبيه، قال سمعت عمر  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه، وظننت أنه يبيعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتر ولا تعد في صدقتك، وإن أعطاكه بدرهم، فإن العائد في صدقته كالعائد في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     Once I gave a horse in Allah's Cause (in charity) but that person did not take care of it. I intended to buy it, as I thought he would sell it at a low price. So, I asked the Prophet (p.b.u.h) about it. He said, \"Neither buy, nor take back your alms which you have given, even if the seller were willing to sell it for one Dirham, for he who takes back his alms is like the one who swallows his own vomit.\"",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1631",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  قال للركن أما والله إني لأعلم أنك حجر لا تضر ولا تنفع، ولولا أني رأيت النبي صلى الله عليه وسلم استلمك ما استلمتك‏.‏ فاستلمه، ثم قال فما لنا وللرمل إنما كنا راءينا به المشركين، وقد أهلكهم الله‏.‏ ثم قال شىء صنعه النبي صلى الله عليه وسلم فلا نحب أن نتركه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father who said:                     \"`Umar bin Al-Khattab addressed the Corner (Black Stone) saying, 'By Allah! I know that you are a stone and can neither benefit nor harm. Had I not seen the Prophet touching (and kissing) you, I would never have touched (and kissed) you.' Then he kissed it and said, 'There is no reason for us to do Ramal (in Tawaf) except that we wanted to show off before the pagans, and now Allah has destroyed them.' `Umar added, '(Nevertheless), the Prophet did that and we do not want to leave it (i.e. Ramal).'",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1636",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا يزيد بن هارون، أخبرنا ورقاء، أخبرنا زيد بن أسلم، عن أبيه، قال رأيت عمر بن الخطاب  رضى الله عنه  قبل الحجر وقال لولا أني رأيت رسول الله صلى الله عليه وسلم قبلك ما قبلتك‏.‏",
      "text_en": " Narrated Zaid bin Aslam that his father said:                     \"I saw `Umar bin Al-Khattab kissing the Black Stone and he then said, (to it) 'Had I not seen Allah's Apostle kissing you, (stone) I would not have kissed you.' \"",
      "chain": [
        "30297",
        "20472",
        "20363",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "1834",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد بن أسلم، عن أبيه، قال كنت مع عبد الله بن عمر  رضى الله عنهما  بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع فأسرع السير، حتى كان بعد غروب الشفق نزل، فصلى المغرب والعتمة، جمع بينهما، ثم قال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب، وجمع بينهما‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     I was with Ibn `Umar on the way to Mecca, and he got the news that Safiya bint Abu Ubaid was seriously ill. So, he hastened his pace, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha' prayers together. Then he said, \"I saw that whenever the Prophet had to hasten when traveling, he would delay the Maghrib prayer and join them together (i.e. offer the Maghrib and the `Isha prayers together).",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال اللهم ارزقني شهادة في سبيلك، واجعل موتي في بلد رسولك صلى الله عليه وسلم‏.‏ وقال ابن زريع عن روح بن القاسم، عن زيد بن أسلم، عن أمه، عن حفصة بنت عمر  رضى الله عنهما  قالت سمعت عمر، نحوه‏.‏ وقال هشام عن زيد، عن أبيه، عن حفصة، سمعت عمر، رضى الله عنه‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, O Allah! Grant me martyrdom in Your cause, and let my death be in the city of Your Apostle.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه  لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, \"But for the future Muslim generations, I would have distributed the land of the villages I conquer among the soldiers as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2623",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا مالك، عن زيد بن أسلم، عن أبيه، سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله، فأضاعه الذي كان عنده، فأردت أن أشتريه منه، وظننت أنه بائعه برخص، فسألت عن ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره، وإن أعطاكه بدرهم واحد، فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse in Allah's Cause. The person to whom it was given, did not look after it. I intended to buy it from him, thinking that he would sell it cheap. When I asked the Prophet he said, \"Don't buy it, even if he gives it to you for one Dirham, as the person who takes back what he has given in charity, is like a dog that swallows back its vomit.\"",
      "chain": [
        "30119",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2970",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال سمعت مالك بن أنس، سأل زيد بن أسلم، فقال زيد سمعت أبي يقول، قال عمر بن الخطاب  رضى الله عنه  حملت على فرس في سبيل الله، فرأيته يباع، فسألت النبي صلى الله عليه وسلم آشتريه فقال ‏\"‏ لا تشتره، ولا تعد في صدقتك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse to be used in Allah's Cause, but later on I saw it being sold. I asked the Prophet whether I could buy it. He said, \"Don't buy it and don't take back your gift of charity.\"",
      "chain": [
        "30418",
        "20005",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3000",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد  هو ابن أسلم  عن أبيه، قال كنت مع عبد الله بن عمر  رضى الله عنهما  بطريق مكة، فبلغه عن صفية بنت أبي عبيد شدة وجع، فأسرع السير حتى إذا كان بعد غروب الشفق، ثم نزل فصلى المغرب والعتمة، يجمع بينهما، وقال إني رأيت النبي صلى الله عليه وسلم إذا جد به السير أخر المغرب وجمع بينهما‏.‏",
      "text_en": " Narrated Aslam:                     While I was in the company of `Abdullah bin `Umar on the way to Mecca, he received the news of the severe illness of Safiya bint Abi Ubaid (i.e. his wife), so he proceeded at greater speed, and when the twilight disappeared, he dismounted and offered the Maghrib and `Isha 'prayers together and said, \" I saw the Prophet delaying the Maghrib prayer to offer it along with the `Isha' when he was in a hurry on a journey.\"",
      "chain": [
        "30232",
        "20173",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "3003",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب  رضى الله عنه  يقول حملت على فرس في سبيل الله فابتاعه  أو فأضاعه  الذي كان عنده، فأردت أن أشتريه، وظننت أنه بائعه برخص، فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ لا تشتره وإن بدرهم، فإن العائد في هبته كالكلب يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Aslam:                     I heard `Umar bin Al-Khattab saying, \"I gave a horse to be ridden in Allah's Cause and the person who got it intended to sell it or neglected it. So, I wanted to buy it as I thought he would sell it cheap. I consulted the Prophet who said, \"Do not buy it even if for one Dirham, because he who takes back his gift is like a dog swallowing its vomit.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3059",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب  رضى الله عنه  استعمل مولى له يدعى هنيا على الحمى فقال يا هنى، اضمم جناحك عن المسلمين، واتق دعوة المظلوم، فإن دعوة المظلوم مستجابة، وأدخل رب الصريمة ورب الغنيمة، وإياى ونعم ابن عوف، ونعم ابن عفان، فإنهما إن تهلك ماشيتهما يرجعا إلى نخل وزرع، وإن رب الصريمة ورب الغنيمة إن تهلك ماشيتهما يأتني ببنيه فيقول يا أمير المؤمنين‏.‏ أفتاركهم أنا لا أبا لك فالماء والكلأ أيسر على من الذهب والورق، وايم الله، إنهم ليرون أني قد ظلمتهم، إنها لبلادهم فقاتلوا عليها في الجاهلية، وأسلموا عليها في الإسلام، والذي نفسي بيده لولا المال الذي أحمل عليه في سبيل الله ما حميت عليهم من بلادهم شبرا‏.‏",
      "text_en": " Narrated Aslam:                     `Umar bin Al-Khattab appointed a freed slave of his, called Hunai, manager of the Hima (i.e. a pasture devoted for grazing the animals of the Zakat or other specified animals). He said to him, \"O Hunai! Don't oppress the Muslims and ward off their curse (invocations against you) for the invocation of the oppressed is responded to (by Allah); and allow the shepherd having a few camels and those having a few sheep (to graze their animals), and take care not to allow the livestock of `Abdur-Rahman bin `Auf and the livestock of (`Uthman) bin `Affan, for if their livestock should perish, then they have their farms and gardens, while those who own a few camels and those who own a few sheep, if their livestock should perish, would bring their dependents to me and appeal for help saying, 'O chief of the believers! O chief of the believers!' Would I then neglect them? (No, of course). So, I find it easier to let them have water and grass rather than to give them gold and silver (from the Muslims' treasury). By Allah, these people think that I have been unjust to them. This is their land, and during the prelslamic period, they fought for it and they embraced Islam (willingly) while it was in their possession. By Him in Whose Hand my life is! Were it not for the animals (in my custody) which I give to be ridden for striving in Allah's Cause, I would not have turned even a span of their land into a Hima.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3125",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Aslam:                     `Umar said, \"Were it not for those Muslims who have not come to existence yet, I would have distributed (the land of) every town I conquer among the fighters as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، هو ابن محمد أن زيد بن أسلم، حدثه عن أبيه، قال سألني ابن عمر عن بعض، شأنه  يعني عمر  فأخبرته‏.‏ فقال، ما رأيت أحدا قط بعد رسول الله صلى الله عليه وسلم من حين قبض كان أجد وأجود حتى انتهى من عمر بن الخطاب‏.‏",
      "text_en": " Narrated Aslam:                     Ibn `Umar asked me about some matters concerning `Umar. He said, \"Since Allah's Apostle died. I have never seen anybody more serious, hard working and generous than `Umar bin Al-Khattab (till the end of his life.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، قال خرجت مع عمر بن الخطاب  رضى الله عنه  إلى السوق، فلحقت عمر امرأة شابة فقالت يا أمير المؤمنين هلك زوجي وترك صبية صغارا، والله ما ينضجون كراعا، ولا لهم زرع ولا ضرع، وخشيت أن تأكلهم الضبع، وأنا بنت خفاف بن إيماء الغفاري، وقد شهد أبي الحديبية مع النبي صلى الله عليه وسلم، فوقف معها عمر، ولم يمض، ثم قال مرحبا بنسب قريب‏.‏ ثم انصرف إلى بعير ظهير كان مربوطا في الدار، فحمل عليه غرارتين ملأهما طعاما، وحمل بينهما نفقة وثيابا، ثم ناولها بخطامه ثم قال اقتاديه فلن يفنى حتى يأتيكم الله بخير‏.‏ فقال رجل يا أمير المؤمنين أكثرت لها‏.‏ قال عمر ثكلتك أمك، والله إني لأرى أبا هذه وأخاها قد حاصرا حصنا زمانا، فافتتحاه، ثم أصبحنا نستفيء سهمانهما فيه‏.‏",
      "text_en": " Narrated Aslam:                     Once I went with `Umar bin Al-Khattab to the market. A young woman followed `Umar and said, \"O chief of the believers! My husband has died, leaving little children. By Allah, they have not even a sheep's trotter to cook; they have no farms or animals. I am afraid that they may die because of hunger, and I am the daughter of Khufaf bin Ima Al-Ghafari, and my father witnessed the Pledge of allegiance) of Al-Hudaibiya with the Prophet.' `Umar stopped and did not proceed, and said, \"I welcome my near relative.\" Then he went towards a strong camel which was tied in the house, and carried on to it, two sacks he had loaded with food grains and put between them money and clothes and gave her its rope to hold and said, \"Lead it, and this provision will not finish till Allah gives you a good supply.\" A man said, \"O chief of the believers! You have given her too much.\" \"`Umar said disapprovingly. \"May your mother be bereaved of you! By Allah, I have seen her father and brother besieging a fort for a long time and conquering it, and then we were discussing what their shares they would have from that war booty.\"",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4228",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن يوسف، أخبرنا مالك، عن زيد بن أسلم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسير في بعض أسفاره، وعمر بن الخطاب يسير معه ليلا، فسأله عمر بن الخطاب عن شىء فلم يجبه رسول الله صلى الله عليه وسلم ثم سأله فلم يجبه، ثم سأله فلم يجبه وقال عمر بن الخطاب ثكلتك أمك يا عمر، نزرت رسول الله صلى الله عليه وسلم ثلاث مرات، كل ذلك لا يجيبك‏.‏ قال عمر فحركت بعيري ثم تقدمت أمام المسلمين، وخشيت أن ينزل في قرآن، فما نشبت أن سمعت صارخا يصرخ بي  قال  فقلت لقد خشيت أن يكون نزل في قرآن‏.‏ وجئت رسول الله صلى الله عليه وسلم فسلمت عليه فقال ‏\"‏ لقد أنزلت على الليلة سورة لهي أحب إلى مما طلعت عليه الشمس، ثم قرأ ‏{‏إنا فتحنا لك فتحا مبينا‏}‏‏.‏‏\"‏",
      "text_en": " Narrated Zaid bin Aslam:                     My father said, \"Allah's Apostle was proceeding at night on one of his journeys and `Umar bin Al- Khattab was going along with him. `Umar bin Al-Khattab asked him (about something) but Allah's Apostle did not answer him. `Umar asked him again, but he did not answer him. He asked him again (for the third time) but he did not answer him. On that `Umar bin Al-Khattab addressed himself saying, \"May your mother be bereaved of you, O `Umar, for you have asked Allah's Apostle thrice, yet he has not answered you.\" `Umar said, \"Then I made my camel run fast and took it in front of the other Muslims, and I was afraid that something might be revealed in my connection. I had hardly waited for a moment when I heard somebody calling me. I said, 'I was afraid that something might have been revealed about me.' Then I came to Allah's Apostle and greeted him. He (i.e. the Prophet) said, 'Tonight there has been revealed to me, a Sura which is dearer to me than (all the world) on which the sun rises,' and then he recited: 'Verily! We have granted you (O Muhammad) A manifest victory.\" (48.1)",
      "chain": [
        "30355",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4283",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن مهدي، عن مالك بن أنس، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال لولا آخر المسلمين ما فتحت عليهم قرية إلا قسمتها، كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated `Umar:                     But for the other Muslims (i.e. coming generations) I would divide (the land of) whatever villages the Muslims might conquer (among the fighters), as the Prophet divided (the land of) Khaibar.",
      "chain": [
        "30170",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4882",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسير في بعض أسفاره وعمر بن الخطاب يسير معه ليلا، فسأله عمر بن الخطاب عن شىء، فلم يجبه رسول الله صلى الله عليه وسلم ثم سأله فلم يجبه، ثم سأله فلم يجبه، فقال عمر بن الخطاب ثكلت أم عمر، نزرت رسول الله صلى الله عليه وسلم ثلاث مرات، كل ذلك لا يجيبك‏.‏ قال عمر فحركت بعيري، ثم تقدمت أمام الناس، وخشيت أن ينزل في القرآن، فما نشبت أن سمعت صارخا يصرخ بي فقلت لقد خشيت أن يكون نزل في قرآن‏.‏ فجئت رسول الله صلى الله عليه وسلم فسلمت عليه فقال ‏\"‏ لقد أنزلت على الليلة سورة لهي أحب إلى مما طلعت عليه الشمس ‏\"‏‏.‏ ثم قرأ ‏\"‏‏{‏إنا فتحنا لك فتحا مبينا‏}‏‏\"‏",
      "text_en": " Narrated Aslam:                     While Allah's Apostle was proceeding at night during one of his journeys and `Umar bin Al-Khattab was traveling beside him, `Umar asked him about something but Allah's Apostle did not reply. He asked again, but he did not reply, and then he asked (for the third time) but he did not reply. On that, `Umar bin Al-Khattab said to himself, \"Thakilat Ummu `Umar (May `Umar's mother lose her son)! I asked Allah's Apostle three times but he did not reply.\" `Umar then said, \"I made my camel run faster and went ahead of the people, and I was afraid that some Qur'anic Verses might be revealed about me. But before getting involved in any other matter. I heard somebody calling me. I said to myself, 'I fear that some Qur'anic Verses have been revealed about me,' and so I went to Allah's Apostle and greeted him. He (Allah's Apostle ) said, 'Tonight a Sura has been revealed to me, and it is dearer to me than that on which the sun rises (i.e. the world)' Then he recited: \"Verily, We have given you a manifest victory.\" (48.1)",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "5064",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن زيد بن أسلم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسير في بعض أسفاره وعمر بن الخطاب يسير معه ليلا فسأله عمر عن شىء فلم يجبه رسول الله صلى الله عليه وسلم ثم سأله فلم يجبه ثم سأله فلم يجبه، فقال عمر ثكلتك أمك نزرت رسول الله صلى الله عليه وسلم ثلاث مرات كل ذلك لا يجيبك، قال عمر فحركت بعيري حتى كنت أمام الناس وخشيت أن ينزل في قرآن فما نشبت أن سمعت صارخا يصرخ  قال  فقلت لقد خشيت أن يكون نزل في قرآن  قال  فجئت رسول الله صلى الله عليه وسلم فسلمت عليه فقال ‏\"‏ لقد أنزلت على الليلة سورة لهي أحب إلى مما طلعت عليه الشمس ‏\"‏‏.‏ ثم قرأ ‏{‏إنا فتحنا لك فتحا مبينا‏}‏",
      "text_en": " Narrated Aslam:                     Allah's Apostle was traveling on one of his journeys, and `Umar bin Al-Khattab was traveling along with him at night. `Umar asked him about something, but Allah's Apostle I did not answer him. He asked again, but he did not answer. He asked for the third time!, but he did not answer. On that, `Umar said to himself, \"May your mother lose you! You have asked Allah's Apostle three times, but he did not answer at all!\" `Umar said, \"So I made my camel go fast till I was ahead of the people, and I was afraid that something might be! revealed about me. After a little while I heard a call maker calling me, I said, 'I was afraid that some Qur'anic Verse might be revealed about me.' So I went to Allah's Apostle and greeted him. He said, 'Tonight there has been revealed to me a Surah which is dearer to me than that on which the sun shines (i.e. the world).' Then he recited: 'Verily! We have given you (O Muhammad I, a manifest victory.' \" (Surat al-Fath) No. (48.1).",
      "chain": [
        "30103",
        "20001",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "6065",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن أبيه، عن عمر بن الخطاب  رضى الله عنه  قدم على النبي صلى الله عليه وسلم سبى، فإذا امرأة من السبى قد تحلب ثديها تسقي، إذا وجدت صبيا في السبى أخذته فألصقته ببطنها وأرضعته، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ أترون هذه طارحة ولدها في النار ‏\"‏‏.‏ قلنا لا وهى تقدر على أن لا تطرحه‏.‏ فقال ‏\"‏ الله أرحم بعباده من هذه بولدها ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     Some Sabi (i.e. war prisoners, children and woman only) were brought before the Prophet and behold, a woman amongst them was milking her breasts to feed and whenever she found a child amongst the captives, she took it over her chest and nursed it (she had lost her child but later she found him) the Prophet said to us, \"Do you think that this lady can throw her son in the fire?\" We replied, \"No, if she has the power not to throw it (in the fire).\" The Prophet then said, \"Allah is more merciful to His slaves than this lady to her son.\"",
      "chain": [
        "30232",
        "20179",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "6867",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا يحيى بن بكير، حدثني الليث، قال حدثني خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أن رجلا، على عهد النبي صلى الله عليه وسلم كان اسمه عبد الله، وكان يلقب حمارا، وكان يضحك رسول الله صلى الله عليه وسلم، وكان النبي صلى الله عليه وسلم قد جلده في الشراب، فأتي به يوما فأمر به فجلد، فقال رجل من القوم اللهم العنه ما أكثر ما يؤتى به‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تلعنوه، فوالله ما علمت أنه يحب الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     During the lifetime of the Prophet there was a man called `Abdullah whose nickname was Donkey, and he used to make Allah's Apostle laugh. The Prophet lashed him because of drinking (alcohol). And one-day he was brought to the Prophet on the same charge and was lashed. On that, a man among the people said, \"O Allah, curse him ! How frequently he has been brought (to the Prophet on such a charge)!\" The Prophet said, \"Do not curse him, for by Allah, I know for he loves Allah and His Apostle.\"",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4248",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا مالك بن أنس، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب، قال حملت على فرس عتيق في سبيل الله فأضاعه صاحبه فظننت أنه بائعه برخص فسألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ لا تبتعه ولا تعد في صدقتك فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": "  Umar b. Khattab (Allah be pleased with him) reported:                      I donated a pedigree horse in the path of Allah. Its possesser made it languish. I thought that he would sell it at a cheap price. I asked Allah's Menengsr (may peace be upon him) about it, whereupon he said: Don't buy it and do not get back your charity, for one who gets back the charity is like a dog who swallows its vomit.",
      "chain": [
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4250",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - عن زيد بن أسلم، عن أبيه، عن عمر، أنه حمل على فرس في سبيل الله فوجده عند صاحبه وقد أضاعه وكان قليل المال فأراد أن يشتريه فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ لا تشتره وإن أعطيته بدرهم فإن مثل العائد في صدقته كمثل الكلب يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Aslam reported on the authority of his father that 'Umar (Allah be pleased with him) donated a horse in the path of Allah. He found that it had languished in the hand of its possessor, and he was a man of meagre resources He (Hadrat 'Umar) intended to buy it. He came to Allah's Messenger (may peace be upon him) and made a mention of that to him, whereupon he said:                      Don't buy that even if you get it for a dirham for he who gets back the charity is like a dog which swallows its vomit.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4901",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن علي، حدثنا ابن مهدي، ح وحدثنا محمد بن عمرو بن جبلة، حدثنا بشر بن عمر، قالا جميعا حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث نافع عن ابن عمر ‏.‏",
      "text_en": " The same tradition has been transmitted by a different chain of narrators.",
      "chain": [
        "30153",
        "20033",
        "38562",
        "20211",
        "20519",
        "11163",
        "11416",
        "18"
      ]
    },
    {
      "hadith_no": "7154",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني الحسن بن علي الحلواني، ومحمد بن سهل التميمي، - واللفظ لحسن - حدثنا ابن أبي مريم، حدثنا أبو غسان، حدثني زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أنه قال قدم على رسول الله صلى الله عليه وسلم بسبى فإذا امرأة من السبى تبتغي إذا وجدت صبيا في السبى أخذته فألصقته ببطنها وأرضعته فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أترون هذه المرأة طارحة ولدها في النار ‏\"‏ ‏.‏ قلنا لا والله وهي تقدر على أن لا تطرحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لله أرحم بعباده من هذه بولدها ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. Khattab reported that there were brought some prisoners to Allah's Messenger (may peace be upon him) amongst whom there was also a woman, who was searching (for someone) and when she found a child amongst the prisoners, she took hold of it, pressed it against her chest and provided it suck. Thereupon Allah's Messenger (may peace be upon him) said:                      Do you think this woman would ever afford to throw her child in the Fire? We said: By Allah, so far as it lies in her power, she would never throw the child in Fire. ' Thereupon Allah's Messenger (may peace be upon him) said: Allah is more kind to His servants than this woman is to her child.",
      "chain": [
        "30115",
        "30232",
        "20179",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن صالح، وعثمان بن أبي شيبة، - وهذا حديثه - قالا حدثنا الفضل بن دكين، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، - رضى الله عنه - يقول أمرنا رسول الله صلى الله عليه وسلم يوما أن نتصدق فوافق ذلك مالا عندي فقلت اليوم أسبق أبا بكر إن سبقته يوما فجئت بنصف مالي فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قلت مثله ‏.‏ قال وأتى أبو بكر - رضى الله عنه - بكل ما عنده فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قال أبقيت لهم الله ورسوله ‏.‏ قلت لا أسابقك إلى شىء أبدا ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     The Messenger of Allah (ﷺ) commanded us one day to give sadaqah. At that time I had some property. I said: Today I shall surpass AbuBakr if I surpass him any day. I, therefore, brought half my property. The Messenger of Allah (ﷺ) asked: What did you leave for your family? I replied: The same amount. AbuBakr brought all that he had with him. The Messenger of Allah (ﷺ) asked him: What did you leave for your family? He replied: I left Allah and His Apostle for them. I said: I shall never compete you in anything.",
      "chain": [
        "30226",
        "30203",
        "20348",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، يقول فيم الرملان اليوم والكشف عن المناكب، وقد أطأ الله الإسلام ونفى الكفر وأهله مع ذلك لا ندع شيئا كنا نفعله على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Aslam said:                      I heard Umar ibn al-Khattab say: What is the need of walking proudly (ramal) and moving the shoulders (while going round the Ka'bah)? Allah has now strengthened Islam and obliterated disbelief and the infidels. In spite of that we shall not forsake anything that we used to do during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "30007",
        "20443",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3020",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، عن عمر، قال لولا آخر المسلمين ما فتحت قرية إلا قسمتها كما قسم رسول الله صلى الله عليه وسلم خيبر ‏.‏",
      "text_en": " ‘Umar said “Had I not considered the last Muslim, I would have any town I conquered divided as the Apostle of Allaah(ﷺ) had divided Khaibar.”",
      "chain": [
        "30007",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4377",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن زيد بن أسلم، عن يزيد بن نعيم، عن أبيه، أن ماعزا، أتى النبي صلى الله عليه وسلم فأقر عنده أربع مرات فأمر برجمه وقال لهزال ‏\"‏ لو سترته بثوبك كان خيرا لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym:                     Ma'iz came to the Prophet (ﷺ) and admitted (having committed adultery) four times in his presence so he ordered him to be stoned to death, but said to Huzzal: If you had covered him with your garment, it would have been better for you.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "4702",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثنا ابن وهب، قال أخبرني هشام بن سعد، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن موسى قال يا رب أرنا آدم الذي أخرجنا ونفسه من الجنة فأراه الله آدم فقال أنت أبونا آدم فقال له آدم نعم ‏.‏ قال أنت الذي نفخ الله فيك من روحه وعلمك الأسماء كلها وأمر الملائكة فسجدوا لك قال نعم ‏.‏ قال فما حملك على أن أخرجتنا ونفسك من الجنة فقال له آدم ومن أنت قال أنا موسى ‏.‏ قال أنت نبي بني إسرائيل الذي كلمك الله من وراء الحجاب لم يجعل بينك وبينه رسولا من خلقه قال نعم ‏.‏ قال أفما وجدت أن ذلك كان في كتاب الله قبل أن أخلق قال نعم ‏.‏ قال ففيم تلومني في شىء سبق من الله تعالى فيه القضاء قبلي ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ فحج آدم موسى فحج آدم موسى ‏\"‏ ‏.‏",
      "text_en": " ‘Umar b. al-Khattab reported the Messenger of Allah (May peace be upon him) as saying :                      Moses said : My lord, show us Adam who caused us and himself to come out from Paradise. So Allah showed him Adam. He asked : Are you our father, Adam? Adam said to him : Yes. He said : Are you the one into whom Allah breathed of his spirit, taught you all the names, and commanded angels (to prostrate) and they prostrated to you? He replied : Yes. He asked : Then what moved you to cause us and yourself to come out from paradise? Adam asked him : And who are you? He said : Yes. He asked : Did you not find that was decreed in the book (records) of Allah before I was created? He replied : Yes. He asked : Then why do you blame me about a thing for which Divine decree had already passed before me ? The Messenger of Allah (May peace be upon him) said : So Adam got the better of Moses in argument (peace be upon him).",
      "chain": [
        "30226",
        "20029",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب، رضى الله عنه ضرب ابنا له تكنى أبا عيسى وأن المغيرة بن شعبة تكنى بأبي عيسى فقال له عمر أما يكفيك أن تكنى بأبي عبد الله فقال إن رسول الله صلى الله عليه وسلم كناني فقال إن رسول الله صلى الله عليه وسلم قد غفر له ما تقدم من ذنبه وما تأخر وإنا في جلجلتنا فلم يزل يكنى بأبي عبد الله حتى هلك ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Zayd ibn Aslam quoted his father as saying: Umar ibn al-Khattab (Allah be pleased with him) struck one of his sons who was given the kunyah AbuIsa, and al-Mughirah ibn Shu'bah had the kunyah AbuIsa. Umar said to him: Is it not sufficient for you that you are called by the kunyah AbuAbdullah? He replied: The Messenger of Allah (ﷺ) gave me this kunyah. Thereupon he said: The Messenger of Allah (ﷺ) was forgiven all his sins, past and those followed. But we are among the people similar to us. Henceforth he was called by the kunyah AbuAbdullah until he died.",
      "chain": [
        "38673",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1851",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، عن معمر، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا الزيت وادهنوا به فإنه من شجرة مباركة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث عبد الرزاق عن معمر وكان عبد الرزاق يضطرب في رواية هذا الحديث فربما ذكر فيه عن عمر عن النبي صلى الله عليه وسلم وربما رواه على الشك فقال أحسبه عن عمر عن النبي صلى الله عليه وسلم وربما قال عن زيد بن أسلم عن أبيه عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     That the Messenger of Allah (ﷺ) said: \"Eat olive and use its oil, for indeed it is a blessed tree.\"[Abu 'Eisa said:] We do not know of this Hadith except through the narration of 'Abdur-Razzaq from Ma'mar (narrators in the chain of this Hadith). 'Abdur-Razzaq would narrate this with Idtirab. Sometimes he mentioned in it: \"From 'Umar, from the Prophet (ﷺ)\" and sometimes he reported it indicating doubt, saying: \"I think it is from 'Umar from the Prophet (ﷺ).\" And sometimes he said: \"From Zaid bin Aslam, from his father, from the Prophet (ﷺ)\" in a Mursal form.",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "1851",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو داود، سليمان بن معبد حدثنا عبد الرزاق، عن معمر، عن زيد بن أسلم، عن أبيه، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عن عمر ‏.‏",
      "text_en": " Another chain from Zaid bin Aslam, from his father, from the Prophet (ﷺ) with similar. And he did not mention \"from 'Umar\" in it.",
      "chain": [
        "20121",
        "20115",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "2264",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا محمد بن أبي حميد، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخيار أمرائكم وشرارهم خيارهم الذين تحبونهم ويحبونكم وتدعون لهم ويدعون لكم وشرار أمرائكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث محمد بن أبي حميد ‏.‏ ومحمد يضعف من قبل حفظه ‏.‏",
      "text_en": " 'Umar bin Al-Khattab narrated that the Prophet(s.a.w) said:                     \"Shall I not inform you of the best of your leaders and the worst of them: The best of them are those whom you love and they love you, you supplicate for them, and they supplicate for you. And the evilest of your leaders are those who hate you, and you hate them, and they curse you and you curse them.\"",
      "chain": [
        "30160",
        "20443",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3572",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن خالد بن عثمة، حدثنا مالك بن أنس، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، رضى الله عنه يقول كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فكلمت رسول الله صلى الله عليه وسلم فسكت ثم كلمته فسكت ثم كلمته فسكت فحركت راحلتي فتنحيت وقلت ثكلتك أمك يا ابن الخطاب نزرت رسول الله صلى الله عليه وسلم ثلاث مرات كل ذلك لا يكلمك ما أخلقك أن ينزل فيك قرآن قال فما نشبت أن سمعت صارخا يصرخ بي قال فجئت رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا ابن الخطاب لقد أنزل على هذه الليلة سورة ما أحب أن لي بها ما طلعت عليه الشمس ‏:‏ ‏(‏إنا فتحنا لك فتحا مبينا ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ورواه بعضهم عن مالك مرسلا ‏.‏",
      "text_en": " Narrated Malik bin Anas:                     from Zaid bin Aslam, from his father who said: \"I heard 'Umar bin Al-Khattab [may Allah be pleased with him] saying: 'We were with the Messenger of Allah (ﷺ) during one of his journeys when I said something to him but he was silent. Then I said something again but he was silent. I quickened my pace of mount to go to the other wise. I said: \"May your mother lose you O Ibn Al-Khattab! You pestered the Messenger of Allah (ﷺ) three times, each time he did not reply to you! You deserve that something be revealed about you in the Qur'an.'\" He ('Umar) said: \"It was not long before I heard a voice calling me.' So I came to the Messenger of Allah (ﷺ) and he said: \"O Ibn Al-Khattab! A Surah was revealed to me last night which is dearer to me than what the sun rises upon: Verily, We have given you a manifest victory (48:1).'\"",
      "chain": [
        "30160",
        "30581",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3561",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن نافع الصائغ، قراءة عليه عن حماد بن أبي حميد، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أن النبي صلى الله عليه وسلم بعث بعثا قبل نجد فغنموا غنائم كثيرة وأسرعوا الرجعة فقال رجل ممن لم يخرج ما رأينا بعثا أسرع رجعة ولا أفضل غنيمة من هذا البعث ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا أدلكم على قوم أفضل غنيمة وأسرع رجعة قوم شهدوا صلاة الصبح ثم جلسوا يذكرون الله حتى طلعت عليهم الشمس فأولئك أسرع رجعة وأفضل غنيمة ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وحماد بن أبي حميد هو أبو إبراهيم الأنصاري المزني وهو محمد بن أبي حميد المدني وهو ضعيف في الحديث ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated:                     That the Prophet sent an expedition in the direction of Najd. They gained many spoils of war and returned quickly. A man among those who did not go out said: “We have not seen an expedition quicker in return or greater in spoils than this expedition.” So the Messenger of Allah said: “Should I not direct you to a group greater in spoils and quicker in return? A group who attended Salat As-Subh, then sat remembering Allah until the sun rose, for these are quicker in return and greater in spoils.”",
      "chain": [
        "30292",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4038",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا هارون بن عبد الله البزاز البغدادي، حدثنا الفضل بن دكين، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، يقول أمرنا رسول الله صلى الله عليه وسلم أن نتصدق فوافق ذلك عندي مالا فقلت اليوم أسبق أبا بكر إن سبقته يوما قال فجئت بنصف مالي فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قلت مثله وأتى أبو بكر بكل ما عنده فقال ‏\"‏ يا أبا بكر ما أبقيت لأهلك ‏\"‏ ‏.‏ قال أبقيت لهم الله ورسوله قلت والله لا أسبقه إلى شيء أبدا ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zaid bin Aslam:                     \"I heard 'Umar bin Al-Khattab saying: 'We were ordered by the Messenger of Allah (ﷺ) to give in charity, and that coincided with a time in which I had some wealth, so I said, \"Today I will beat Abu Bakr, if ever I beat him.\"' So I came with half of my wealth, and the Messenger of Allah (ﷺ) said: \"What did you leave for your family?\" I said: \"The like of it.\" And Abu Bakr came with everything he had, so he said: \"O Abu Bakr! What did you leave for your family?\" He said: \"I left Allah and His Messenger for them.\" I said: '[By Allah] I will never be able to beat him to something.'\"",
      "chain": [
        "20348",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا محمد بن بكر، عن ابن جريج، عن زيد بن أسلم، عن أبيه، عن عمر، أنه فرض لأسامة بن زيد في ثلاثة آلاف وخمسمائة وفرض لعبد الله بن عمر في ثلاثة آلاف قال عبد الله بن عمر لأبيه لم فضلت أسامة على فوالله ما سبقني إلى مشهد ‏.‏ قال لأن زيدا كان أحب إلى رسول الله صلى الله عليه وسلم من أبيك وكان أسامة أحب إلى رسول الله منك فآثرت حب رسول الله صلى الله عليه وسلم على حبي ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Zaid bin Aslam:                     from his father, from 'Umar, that he ('Umar) granted a stipend of three-thousand and five-hundred to Usamah bin Zaid, and he granted three-thousand to 'Abdullah bin 'Umar. So 'Abdullah bin 'Umar said to his father: \"Why have you given preference to Usamah over me? For by Allah, he has not preceded me to any battle.\" He said: \"Because Zaid used to be more beloved to the Messenger of Allah (ﷺ) than your father, and Usamah was more beloved to the Messenger of Allah (ﷺ) than you. So I gave preference to the beloved of the Messenger of Allah (ﷺ) over my beloved.\"",
      "chain": [
        "35047",
        "20277",
        "11070",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثنا مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر، يقول حملت على فرس في سبيل الله عز وجل فأضاعه الذي كان عنده وأردت أن أبتاعه منه وظننت أنه بائعه برخص فسألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا تشتره وإن أعطاكه بدرهم فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Aslam that his father said:                     \"I heard 'Umar say: 'I gave a horse to someone to ride in the cause of Allah, the Mighty and Sublime, and the one who kept it neglected it. I wanted to buy it back from him, and I thought that he would sell it at a cheap price. I asked the Messenger for Allah about that and he said: Do not buy it, even if he gives it to you for a Dirham. The one who takes back his charity is like the dog that goes back to its own vomit. \"'",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "446",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا رشدين بن سعد، أنبأنا الضحاك بن شرحبيل، عن زيد بن أسلم، عن أبيه، عن عمر، قال رأيت رسول الله  صلى الله عليه وسلم  في غزوة تبوك توضأ واحدة واحدة ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"I saw the Messenger of Allah during the campaign of Tabuk performing ablution, washing each part once.\"",
      "chain": [
        "30216",
        "26012",
        "16052",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2480",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تعد في صدقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that:                     the Messenger of Allah (ﷺ) said: “Do not take back your charity.”",
      "chain": [
        "30201",
        "20032",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3065",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، عن هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر، يقول فيم الرملان الآن وقد أطأ الله الإسلام ونفى الكفر وأهله وايم الله ما ندع شيئا كنا نفعله على عهد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Zaid bin Aslam that his father said:                      “I heard‘Umarsay: ‘Why do they perform Ramal now, when Allah has establishedIslam and done away with disbelief and its people? By Allah,* we willnot give up something that we used to do at the time of the Messengerof Allah (ﷺ).’”",
      "chain": [
        "30201",
        "20416",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3289",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن أبي عمر العدني، حدثنا سفيان بن عيينة، عن زيد بن أسلم، عن أبيه، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا فرعة ولا عتيرة ‏\"‏ ‏.‏ قال ابن ماجه هذا من فرائد العدني ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin Abu (‘Umar) ‘Adani that the Prophet(ﷺ) said:                      “There is no Far’ah and no ‘Atirah.”",
      "chain": [
        "20005",
        "11163",
        "11416",
        "18"
      ]
    },
    {
      "hadith_no": "3444",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا الحسين بن مهدي، حدثنا عبد الرزاق، أنبأنا معمر، عن زيد بن أسلم، عن أبيه، عن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ائتدموا بالزيت وادهنوا به فإنه من شجرة مباركة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Umar that the Messenger of Allah (ﷺ) said:                     ‘Season(your food) with olive oil and anoint yourselves with it, foritcomes from a blessed tree.”",
      "chain": [
        "34061",
        "20121",
        "20115",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4124",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني ابن لهيعة، عن عيسى بن عبد الرحمن، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أنه خرج يوما إلى مسجد رسول الله  صلى الله عليه وسلم  فوجد معاذ بن جبل قاعدا عند قبر النبي  صلى الله عليه وسلم  يبكي فقال ما يبكيك قال يبكيني شىء سمعته من رسول الله  صلى الله عليه وسلم  سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن يسير الرياء شرك وإن من عادى لله وليا فقد بارز الله بالمحاربة إن الله يحب الأبرار الأتقياء الأخفياء الذين إذا غابوا لم يفتقدوا وإن حضروا لم يدعوا ولم يعرفوا قلوبهم مصابيح الهدى يخرجون من كل غبراء مظلمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Umar bin Khattab that he went out one day tothe mosque of the Messenger of Allah (ﷺ), and he found Mu’adh binJabal sitting by the grave of the Prophet (ﷺ), weeping. He said:                     “Why are you weeping?” He said: “I am weeping because ofsomethingthat I heard from the Messenger of Allah (ﷺ). I heard theMessengerof Allah (ﷺ) say: ‘A little showing off is polytheismand whoevershows enmity towards a friend of Allah has declared waron Allah.Allah loves those who se righteousness and piety arehidden, thosewho, if they are absent, are not missed, and if theyare present, theyare not invited or acknowledged. Their hearts arelamps of guidanceand they get out of every trial and difficulty.’”",
      "chain": [
        "30487",
        "20029",
        "20624",
        "11163",
        "11416",
        "3"
      ]
    }
  ],
  "total_hadiths": 44
}