{
  "id": "11427",
  "name": "Sa'id bin Abi Hnd سعيد بن أبي هند الفزاري",
  "full_name": "Sa'id bin Abi Hnd سعيد بن أبي هند الفزاري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "116",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Fazari",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "198",
      "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28303",
      "name": "'Abdullah bin Muhammad bin Abi Yahya عبد الله بن محمد بن أبي يحيى - سحبل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14385",
      "name": "Musa bin Mysrh al-Bdy موسى بن ميسرة العبدي بصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11230",
      "name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6487",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا المكي بن إبراهيم، أخبرنا عبد الله بن سعيد  هو ابن أبي هند  عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ نعمتان مغبون فيهما كثير من الناس، الصحة والفراغ ‏\"‏‏.‏قال عباس العنبري حدثنا صفوان بن عيسى، عن عبد الله بن سعيد بن أبي هند، عن أبيه، سمعت ابن عباس، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"There are two blessings which many people lose: (They are) Health and free time for doing good.\"",
      "chain": [
        "20202",
        "11184",
        "11427",
        "17"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن أبا مرة، مولى عقيل حدثه أن أم هانئ بنت أبي طالب حدثته أنه، لما كان عام الفتح أتت رسول الله صلى الله عليه وسلم وهو بأعلى مكة ‏.‏ قام رسول الله صلى الله عليه وسلم إلى غسله فسترت عليه فاطمة ثم أخذ ثوبه فالتحف به ثم صلى ثمان ركعات سبحة الضحى ‏.‏",
      "text_en": " Umm Hani b. Abu Talib reported:                      It was the day of the conquest (of Mecca) that she went to the Messenger of Allah (may peace be upon him) and he was staying at a higher part (of that city). The Messenger of Allah (may peace be upon him) got up for his bath. Fatimah held a curtain around him (in order to provide him privacy). He then put on his garments and wrapped himself with that and then offered eight rak'ahs of the forenoon prayer.",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11427",
        "198"
      ]
    },
    {
      "hadith_no": "2568",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن رافع، حدثنا ابن أبي فديك، حدثني عبد الله بن أبي يحيى، عن سعيد بن أبي هند، قال قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏\"‏ تكون إبل للشياطين وبيوت للشياطين فأما إبل الشياطين فقد رأيتها يخرج أحدكم بجنيبات معه قد أسمنها فلا يعلو بعيرا منها ويمر بأخيه قد انقطع به فلا يحمله وأما بيوت الشياطين فلم أرها ‏\"‏ ‏.‏ كان سعيد يقول لا أراها إلا هذه الأقفاص التي يستر الناس بالديباج ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “There are Camels which belong to devils and there are houses which belong to devils. As for the Camels of the devils, I have seen them. One of you goes out with his side Camels which he has fattened neither riding any of them nor giving a lift to a tired brother when he meets. As regard the houses of the devils, I have not seen them. The narrator Sa’id says “I think they are those cages (Camel litters) which conceal people with brocade.”",
      "chain": [
        "30375",
        "20172",
        "11427",
        "13"
      ]
    },
    {
      "hadith_no": "4938",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن ميسرة، عن سعيد بن أبي هند، عن أبي موسى الأشعري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من لعب بالنرد فقد عصى الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     The Messenger of Allah (ﷺ) said: He who plays backgammon disobeys Allah and His Apostle.",
      "chain": [
        "20164",
        "20001",
        "14385",
        "11427",
        "41"
      ]
    },
    {
      "hadith_no": "1720",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا عبد الله بن نمير، حدثنا عبيد الله بن عمر، عن نافع، عن سعيد بن أبي هند، عن أبي موسى الأشعري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حرم لباس الحرير والذهب على ذكور أمتي وأحل لإناثهم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وعلي وعقبة بن عامر وأنس وحذيفة وأم هانئ وعبد الله بن عمرو وعمران بن حصين وعبد الله بن الزبير وجابر وأبي ريحانة وابن عمر وواثلة بن الأسقع ‏.‏ وحديث أبي موسى حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash'ari:                     That the Messenger of Allah (ﷺ) said: \"Wearing silk and gold has made unlawful for the males of my Ummah and lawful for its females.[Abu 'Eisa said:] There are narrations on this topic from 'Umar, 'Ali, 'Uqbah bin 'Amir, Anas, Umm Hani, Hudhaifah, 'Abdullah bin 'Amr, 'Imran bin Husain, 'Abdullah bin Az-Zubair, Jabir, Abu Raihanah, Ibn 'Umar, Al-Bara', and Wathilah bin Al-Asqa', and this Hadith is Hasan Sahih.",
      "chain": [
        "30313",
        "20331",
        "11201",
        "11014",
        "11427",
        "41"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا صالح بن عبد الله، وسويد بن نصر، قال صالح حدثنا وقال، سويد أخبرنا عبد الله بن المبارك، عن عبد الله بن سعيد بن أبي هند، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نعمتان مغبون فيهما كثير من الناس الصحة والفراغ ‏\"‏ ‏.‏  حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبد الله بن سعيد بن أبي هند، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال وفي الباب عن أنس بن مالك ‏.‏ وقال هذا حديث حسن صحيح ‏.‏ ورواه غير واحد عن عبد الله بن سعيد بن أبي هند فرفعوه وأوقفه بعضهم عن عبد الله بن سعيد بن أبي هند ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said:                     \"Two favors that many of the people squander are health and free time.\"",
      "chain": [
        "38265",
        "11176",
        "20025",
        "11184",
        "11427",
        "17"
      ]
    },
    {
      "hadith_no": "2645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، حدثني عبد الله بن سعيد بن أبي هند، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏ وفي الباب عن عمر وأبي هريرة ومعاوية هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"For whomever Allah wants good, he gives him understanding in the religion.",
      "chain": [
        "20387",
        "20155",
        "11184",
        "11427",
        "17"
      ]
    },
    {
      "hadith_no": "2230",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن مطرفا، - رجل من بني عامر بن صعصعة - حدثه أن عثمان بن أبي العاص دعا له بلبن ليسقيه فقال مطرف إني صائم فقال عثمان سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الصيام جنة كجنة أحدكم من القتال ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Saeed bin Abi Hind that Mutarrif a man from Banu 'Amir bin Sa'sa'ah told him that:                     'Uthman bin Abi Al-As called for milk to be given to him (Mutarrif) to drink. Mutarrif said: 'I heard the Messenger of Allah say: 'Fasting is a shield like the shield of any one of you in battle.\"' Abu Hurairah said: \"The Messenger of Allah said: 'Fasting is a shield.\"' (Sahih",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11427"
      ]
    },
    {
      "hadith_no": "2231",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن الحسين، قال حدثنا ابن أبي عدي، عن ابن إسحاق، عن سعيد بن أبي هند، عن مطرف، قال دخلت على عثمان بن أبي العاص فدعا بلبن فقلت إني صائم ‏.‏ فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الصوم جنة من النار كجنة أحدكم من القتال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"I entered upon 'Uthman bin Abi Al-As and he called for milk. I said: I am fasting; He said: \"I heard the Messenger of Allah say: 'Fasting is a shield like the of any one of you in battle.\"' Abu Hurairah said: \"The Messenger of Allah said: 'Fasting is a shield.\"' (Sahih",
      "chain": [
        "11045",
        "20276",
        "11107",
        "11427",
        "11395"
      ]
    },
    {
      "hadith_no": "2232",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا أبو مصعب، عن المغيرة، عن عبد الله بن سعيد بن أبي هند، عن محمد بن إسحاق، عن سعيد بن أبي هند، قال دخل مطرف على عثمان نحوه مرسل ‏.‏",
      "text_en": " It was narrated that Saeed bin Abi Hind said:                     \"Mutarrif entered upon 'Uthman\" and he narrated something similar in Mursal from. Abu Hurairah said: \"The Messenger of Allah said: 'Fasting is a shield.\"' (Sahih",
      "chain": [
        "30100",
        "166",
        "11184",
        "11107",
        "11427"
      ]
    },
    {
      "hadith_no": "2411",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن مطرفا، حدثه أن عثمان بن أبي العاص قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ صيام حسن ثلاثة أيام من الشهر ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin Abi Al-As said:                     \"I heard the Messenger of Allah say: 'It is a good fast to fast three days of each month\".",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11427",
        "11395",
        "3210"
      ]
    },
    {
      "hadith_no": "2412",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال أنبأنا أبو مصعب، عن مغيرة بن عبد الرحمن، عن عبد الله بن سعيد بن أبي هند، عن محمد بن إسحاق، عن سعيد بن أبي هند، قال عثمان بن أبي العاص نحوه مرسل ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Abi Hind said:                     \"Uthman bin Abi Al-As\" and he narrated something similar in Mursal form.",
      "chain": [
        "30100",
        "20182",
        "11184",
        "11107",
        "11427",
        "3210"
      ]
    },
    {
      "hadith_no": "5148",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن الحسين الدرهمي، قال حدثنا عبد الأعلى، عن سعيد، عن أيوب، عن نافع، عن سعيد بن أبي هند، عن أبي موسى، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أحل الذهب والحرير لإناث أمتي وحرم على ذكورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that :                     The Messenger of Allah [SAW] said: \"Gold and silk have been permitted for the females of my Ummah, and forbidden to the males.\"",
      "chain": [
        "11045",
        "20246",
        "11168",
        "11015",
        "11014",
        "11427",
        "41"
      ]
    },
    {
      "hadith_no": "5265",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، ويزيد، ومعتمر، وبشر بن المفضل، قالوا حدثنا عبيد الله، عن نافع، عن سعيد بن أبي هند، عن أبي موسى، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل أحل لإناث أمتي الحرير والذهب وحرمه على ذكورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that:                     The Messenger of Allah [SAW] said: \"Allah has permitted silk and gold to the females of my Ummah, and has forbidden them to the males.\"",
      "chain": [
        "30153",
        "20031",
        "20472",
        "20288",
        "20212",
        "11201",
        "11014",
        "11427",
        "41"
      ]
    },
    {
      "hadith_no": "502",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن أبا مرة، مولى عقيل حدثه أن أم هانئ بنت أبي طالب حدثته أنه، لما كان عام الفتح قام رسول الله  صلى الله عليه وسلم  إلى غسله فسترت عليه فاطمة ثم أخذ ثوبه فالتحف به ‏.‏",
      "text_en": " Umm Hani' bint Abu Talib narrated that :                     When it was the year of the Conquest (of Makkah), the Messenger of Allah got up to perform a bath and Fatimah screened him. Then he took his garment and wrapped himself in it (such that it became like the towel used to dry oneself).",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11427",
        "198"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن محمد بن إسحاق، عن سعيد بن أبي هند، عن مطرف بن عبد الله بن الشخير، قال سمعت عثمان بن أبي العاص، يقول كان آخر ما عهد إلى النبي  صلى الله عليه وسلم  حين أمرني على الطائف قال لي ‏\"‏ يا عثمان تجاوز في الصلاة واقدر الناس بأضعفهم فإن فيهم الكبير والصغير والسقيم والبعيد وذا الحاجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mutarrif bin ‘Abdullah bin Shikhkhir said:                      “Iheard‘Uthman bin Abul-‘As say: “The last thing that the Prophet(ﷺ)enjoined on me when he appointed me governor of Ta’if wasthat hesaid: “O ‘Uthman! Be tolerable in prayer and estimate thepeople basedupon the weakest among them, for among them are theelderly, theyoung, the sick, those who live far from the mosque, andthose whohave pressing needs.”",
      "chain": [
        "30201",
        "20208",
        "11107",
        "11427",
        "11305",
        "3210"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن رمح المصري، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن مطرفا، من بني عامر بن صعصعة حدثه أن عثمان بن أبي العاص الثقفي دعا له بلبن يسقيه فقال مطرف إني صائم ‏.‏ فقال عثمان سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الصيام جنة من النار كجنة أحدكم من القتال ‏\"‏ ‏.‏",
      "text_en": " Mutarrif, from the tribe of Banu ‘Amir bin Sa’sa’ah narratedthat‘Uthman bin Abul-‘As Ath-Thaqafi invited him to drink somemilk thathe poured for him. Mutarrif said:                      “I am fasting.”‘Uthman said: “Iheard the Messenger of Allah (ﷺ) say: ‘Fastingis a shield againstthe Fire just like the shield of anyone of youagainst fighting.’”",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11427"
      ]
    },
    {
      "hadith_no": "3762",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، وأبو أسامة عن عبيد الله بن عمر، عن نافع، عن سعيد بن أبي هند، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من لعب بالنرد فقد عصى الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah(ﷺ) said: 'Whoever plays backgammon has disobeyed Allah and His Messenger.'\"",
      "chain": [
        "30201",
        "20334",
        "20318",
        "11201",
        "11014",
        "11427",
        "41"
      ]
    }
  ],
  "total_hadiths": 18
}