{
  "id": "11428",
  "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
  "full_name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Makhzum",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10612",
      "name": "al-Q'qa' bin Hkym al-Knany القعقاع بن حكيم الكناني المدني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11542",
      "name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20252",
      "name": "'Abdul 'Aziz bin al-Mukhtar عبد العزيز بن المختار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20513",
      "name": "'Umar bin Muhammad bin al-Mnkdr عمر بن محمد بن المنكدر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-721",
      "hadith_no": "721",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الشهداء الغرق والمطعون والمبطون والهدم ‏\"‏‏.‏ وقال ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا ‏{‏إليه‏}‏ ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا، ولو يعلمون ما في الصف المقدم لاستهموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or of being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for the Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the Fajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward for the first row, they would draw lots for it.\"",
      "usc_msa_ref": "688",
      "chain": [
        "20241",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-796",
      "hadith_no": "796",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده‏.‏ فقولوا اللهم ربنا لك الحمد‏.‏ فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Imam says, \"Sami`a l-lahu liman hamidah,\" you should say, \"Allahumma Rabbana laka l-hamd.\" And if the saying of any one of you coincides with that of the angels, all his past sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-843",
      "hadith_no": "843",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبي بكر، قال حدثنا معتمر، عن عبيد الله، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال جاء الفقراء إلى النبي صلى الله عليه وسلم فقالوا ذهب أهل الدثور من الأموال بالدرجات العلا والنعيم المقيم، يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال يحجون بها، ويعتمرون، ويجاهدون، ويتصدقون قال ‏\"‏ ألا أحدثكم بأمر إن أخذتم به أدركتم من سبقكم ولم يدرككم أحد بعدكم، وكنتم خير من أنتم بين ظهرانيه، إلا من عمل مثله تسبحون وتحمدون، وتكبرون خلف كل صلاة ثلاثا وثلاثين ‏\"‏‏.‏ فاختلفنا بيننا فقال بعضنا نسبح ثلاثا وثلاثين، ونحمد ثلاثا وثلاثين، ونكبر أربعا وثلاثين‏.‏ فرجعت إليه فقال ‏\"‏ تقول سبحان الله، والحمد لله، والله أكبر، حتى يكون منهن كلهن ثلاثا وثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some poor people came to the Prophet and said, \"The wealthy people will get higher grades and will have permanent enjoyment and they pray like us and fast as we do. They have more money by which they perform the Hajj, and `Umra; fight and struggle in Allah's Cause and give in charity.\" The Prophet said, \"Shall I not tell you a thing upon which if you acted you would catch up with those who have surpassed you? Nobody would overtake you and you would be better than the people amongst whom you live except those who would do the same. Say \"Subhana l-lah\", \"Al hamdu li l-lah\" and \"Allahu Akbar\" thirty three times each after every (compulsory) prayer.\" We differed and some of us said that we should say, \"Subhan-al-lah\" thirty three times and \"Al hamdu li l-lah\" thirty three times and \"Allahu Akbar\" thirty four times. I went to the Prophet who said, \"Say, \"Subhan-al-lah\" and \"Al hamdu li l-lah\" and \"Allahu Akbar\" all together [??], thirty three times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-881",
      "hadith_no": "881",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة، ومن راح في الساعة الثانية فكأنما قرب بقرة، ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن، ومن راح في الساعة الرابعة فكأنما قرب دجاجة، ومن راح في الساعة الخامسة فكأنما قرب بيضة، فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) said, \"Any person who takes a bath on Friday like the bath of Janaba and then goes for the prayer (in the first hour i.e. early), it is as if he had sacrificed a camel (in Allah's cause); and whoever goes in the second hour it is as if he had sacrificed a cow; and whoever goes in the third hour, then it is as if he had sacrificed a horned ram; and if one goes in the fourth hour, then it is as if he had sacrificed a hen; and whoever goes in the fifth hour then it is as if he had offered an egg. When the Imam comes out (i.e. starts delivering the Khutba), the angels present themselves to listen to the Khutba.\"",
      "usc_msa_ref": "6",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1800",
      "hadith_no": "1800",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العمرة إلى العمرة كفارة لما بينهما، والحج المبرور ليس له جزاء إلا الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(The performance of) `Umra is an expiation for the sins committed (between it and the previous one). And the reward of Hajj Mabrur (the one accepted by Allah) is nothing except Paradise.\"",
      "usc_msa_ref": "1",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1833",
      "hadith_no": "1833",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ السفر قطعة من العذاب، يمنع أحدكم طعامه وشرابه ونومه، فإذا قضى نهمته فليعجل إلى أهله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping properly. So, when one's needs are fulfilled, one should return quickly to one's family.\"",
      "usc_msa_ref": "31",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2363",
      "hadith_no": "2363",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا رجل يمشي فاشتد عليه العطش، فنزل بئرا فشرب منها، ثم خرج فإذا هو بكلب يلهث، يأكل الثرى من العطش، فقال لقد بلغ هذا مثل الذي بلغ بي فملأ خفه ثم أمسكه بفيه، ثم رقي، فسقى الكلب فشكر الله له، فغفر له ‏\"‏‏.‏ قالوا يا رسول الله، وإن لنا في البهائم أجرا قال ‏\"‏ في كل كبد رطبة أجر ‏\"‏‏.‏ تابعه حماد بن سلمة والربيع بن مسلم عن محمد بن زياد‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While a man was walking he felt thirsty and went down a well and drank water from it. On coming out of it, he saw a dog panting and eating mud because of excessive thirst. The man said, 'This (dog) is suffering from the same problem as that of mine. So he (went down the well), filled his shoe with water, caught hold of it with his teeth and climbed up and watered the dog. Allah thanked him for his (good) deed and forgave him.\" The people asked, \"O Allah's Apostle! Is there a reward for us in serving (the) animals?\" He replied, \"Yes, there is a reward for serving any animate.\"",
      "usc_msa_ref": "551",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2472",
      "hadith_no": "2472",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق، وجد غصن شوك فأخذه، فشكر الله له، فغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While a man was on the way, he found a thorny branch of a tree there on the way and removed it. Allah thanked him for that deed and forgave him.\"",
      "usc_msa_ref": "652",
      "chain": [
        "20025",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2829",
      "hadith_no": "2829",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشهداء خمسة المطعون، والمبطون، والغرق وصاحب الهدم، والشهيد في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Five are regarded as martyrs: They are those who die because of plague, Abdominal disease, drowning or a falling building etc., and the martyrs in Allah's Cause.\"",
      "usc_msa_ref": "82",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3228",
      "hadith_no": "3228",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده‏.‏ فقولوا اللهم ربنا لك الحمد، فإنه من وافق قوله قول الملائكة، غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Imam, during the prayer, says, \"Allah hears him who praises Him', say: 'O Allah! Our Lord! All the praises are for You/, for if the saying of anyone of you coincides with the saying of the angels, his past sins will be forgiven.\"",
      "usc_msa_ref": "451",
      "chain": [
        "30103",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4515",
      "hadith_no": "4515",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام ‏{‏غير المغضوب عليهم ولا الضالين‏}‏ فقولوا آمين‏.‏ فمن وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When the Imam says: 'Ghair-il-Maghdubi `alaihim Walad-Dallin (i.e. not the path of those who earn Your Anger, nor the path of those who went astray (1.7)), then you must say, 'Ameen', for if one's utterance of 'Ameen' coincides with that of the angels, then his past sins will be forgiven.\"",
      "usc_msa_ref": "2",
      "chain": [
        "30355",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5484",
      "hadith_no": "5484",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو نعيم، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ السفر قطعة من العذاب، يمنع أحدكم نومه وطعامه، فإذا قضى نهمته من وجهه فليعجل إلى أهله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Traveling is a kind of torture, as it prevents one from sleeping and eating! So when one has finished his job, he should return quickly to his family.\"",
      "usc_msa_ref": "340",
      "chain": [
        "20348",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5792",
      "hadith_no": "5792",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المبطون شهيد، والمطعون شهيد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"He (a Muslim) who dies of an Abdominal disease is a a martyr, and he who dies of plague is a martyr.\"",
      "usc_msa_ref": "629",
      "chain": [
        "20241",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6403",
      "hadith_no": "6403",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثني إسحاق، أخبرنا يزيد، أخبرنا ورقاء، عن سمى، عن أبي صالح، عن أبي هريرة،‏.‏ قالوا يا رسول الله ذهب أهل الدثور بالدرجات والنعيم المقيم‏.‏ قال ‏\"‏ كيف ذاك ‏\"‏‏.‏ قال صلوا كما صلينا، وجاهدوا كما جاهدنا، وأنفقوا من فضول أموالهم، وليست لنا أموال‏.‏ قال ‏\"‏ أفلا أخبركم بأمر تدركون من كان قبلكم، وتسبقون من جاء بعدكم، ولا يأتي أحد بمثل ما جئتم، إلا من جاء بمثله، تسبحون في دبر كل صلاة عشرا، وتحمدون عشرا، وتكبرون عشرا ‏\"‏‏.‏ تابعه عبيد الله بن عمر عن سمى ورواه ابن عجلان عن سمى ورجاء بن حيوة‏.‏ ورواه جرير عن عبد العزيز بن رفيع عن أبي صالح عن أبي الدرداء‏.‏ ورواه سهيل عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people said, \"O Allah's Apostle! The rich people have got the highest degrees of prestige and the permanent pleasures (in this life and the life to come in the Hereafter).\" He said, \"How is that?\" They said, \"The rich pray as we pray, and strive in Allah's Cause as we do, and spend from their surplus wealth in charity, while we have no wealth (to spend likewise).\" He said, \"Shall I not tell you a thing, by doing which, you will catch up with those who are ahead of you and supersede those who will come after you; and nobody will be able to do such a good deed as you do except the one who does the same (deed as you do). That deed is to recite 'Subhan Allah ten times, and 'Al-Hamduli l-lah ten times, and 'AllahuAkbar' ten times after every prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20472",
        "20363",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6421",
      "hadith_no": "6421",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثني سمى، عن أبي صالح، عن أبي هريرة، كان رسول الله صلى الله عليه وسلم يتعوذ من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء‏.‏ قال سفيان الحديث ثلاث زدت أنا واحدة، لا أدري أيتهن هي‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle used to seek refuge with Allah from the difficult moment of a calamity and from being overtaken by destruction and from being destined to an evil end, and from the malicious joy of enemies. Sufyan said, \"This narration contained three items only, but I added one. I do not know which one that was.\"",
      "usc_msa_ref": "358",
      "chain": [
        "30026",
        "20005",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6477",
      "hadith_no": "6477",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد، وهو على كل شىء قدير‏.‏ في يوم مائة مرة، كانت له عدل عشر رقاب، وكتب له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزا من الشيطان يومه ذلك، حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا رجل عمل أكثر منه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said,\" Whoever says: \"La ilaha illal-lah wahdahu la sharika lahu, lahu-l-mulk wa lahul- hamd wa huwa 'ala kulli shai'in qadir,\" one hundred times will get the same reward as given for manumitting ten slaves; and one hundred good deeds will be written in his accounts, and one hundred sins will be deducted from his accounts, and it (his saying) will be a shield for him from Satan on that day till night, and nobody will be able to do a better deed except the one who does more than he.\"",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6480",
      "hadith_no": "6480",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال سبحان الله وبحمده‏.‏ في يوم مائة مرة حطت خطاياه، وإن كانت مثل زبد البحر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever says, 'Subhan Allah wa bihamdihi,' one hundred times a day, will be forgiven all his sins even if they were as much as the foam of the sea.",
      "usc_msa_ref": "414",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6698",
      "hadith_no": "6698",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعوذوا بالله من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Take refuge with Allah from the difficulties of severe calamities, from having an evil end and a bad fate and from the malicious joy of your enemies.\"",
      "usc_msa_ref": "613",
      "chain": [
        "30175",
        "20012",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-409-2",
      "hadith_no": "409",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده ‏.‏ فقولوا اللهم ربنا لك الحمد ‏.‏ فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When the Imam says:\" Allah listens to him who praises Him.\" you should say:\" O Allah, our Lord for Thee is the praise.\" for if what anyone says synchronises with what the angels say, his past sins will be forgiven.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1375",
      "hadith_no": "1375",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عاصم بن النضر التيمي، حدثنا المعتمر، حدثنا عبيد الله، ح قال وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن عجلان، كلاهما عن سمى، عن أبي صالح، عن أبي هريرة، - وهذا حديث قتيبة أن فقراء، المهاجرين أتوا رسول الله صلى الله عليه وسلم فقالوا ذهب أهل الدثور بالدرجات العلى والنعيم المقيم ‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا يصلون كما نصلي ويصومون كما نصوم ويتصدقون ولا نتصدق ويعتقون ولا نعتق ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلا أعلمكم شيئا تدركون به من سبقكم وتسبقون به من بعدكم ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ تسبحون وتكبرون وتحمدون دبر كل صلاة ثلاثا وثلاثين مرة ‏\"‏ ‏.‏ قال أبو صالح فرجع فقراء المهاجرين إلى رسول الله صلى الله عليه وسلم فقالوا سمع إخواننا أهل الأموال بما فعلنا ففعلوا مثله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذلك فضل الله يؤتيه من يشاء ‏\"‏ ‏.‏ وزاد غير قتيبة في هذا الحديث عن الليث عن ابن عجلان قال سمى فحدثت بعض أهلي هذا الحديث فقال وهمت إنما قال ‏\"‏ تسبح الله ثلاثا وثلاثين وتحمد الله ثلاثا وثلاثين وتكبر الله ثلاثا وثلاثين ‏\"‏ ‏.‏ فرجعت إلى أبي صالح فقلت له ذلك فأخذ بيدي فقال الله أكبر وسبحان الله والحمد لله والله أكبر وسبحان الله والحمد لله حتى تبلغ من جميعهن ثلاثة وثلاثين ‏.‏ قال ابن عجلان فحدثت بهذا الحديث رجاء بن حيوة فحدثني بمثله عن أبي صالح عن أبي هريرة عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Huraira reported:                      The poor amongst the emigrants came to the Messenger of Allah (may peace be upon him) and said: The possessors of great wealth have obtained the highest ranks and the lasting bliss. lie (the Holy Prophet) said: How Is that? They said: They pray as we pray, and they observe fast as we observe fast, and they give charity but we do not give charity, and they set slaves free but we do not set slaves free. Upon this the Messenger of Allah (may peace be upon him) said: Shall A not teach you something by which you will catch upon those who have preceded you, and get ahead of those who come after you, only those who do as you do being more excellent than you? They said: Yes, Messenger of Allah. He (the Holy Prophet) said: Extol Allah, declare His Greatness, and Praise Him thirty-three times after every prayer. Abu Salih said: The poor amongst the emigrants returned to the Messenger of Allah (may peace upon him) saying: Our brethren, the possessors, of property have heard what we have done and they did the same. So the Messenger of Allah (may peace be upon him) said: This is Allah's Grace which He gives to whom He wishes. Sumayy reported: I made a mention of this hadith to some members of my family (and one of them) said: You have forgotten; he (the Holy Prophet) had said (like this):.\" Extol Allah thirty-three time. praise Allah thirty-three times and declare His Greatness thirty-three times. Ibn 'Ajjan said: 1 made a mention of this hadith to Raja' b. Haiwata and he narrated to me a hadith like this from AbuSalih from the Messenger of Allah (may peace be upon him) on the authority of Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11201",
        "30367",
        "20023",
        "11428",
        "11161"
      ]
    },
    {
      "id": "sahih-muslim-3355",
      "hadith_no": "3355",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العمرة إلى العمرة كفارة لما بينهما والحج المبرور ليس له جزاء إلا الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      An Umra is an expiation for the sins committed between it and the next, and Hajj which is accepted will receive no other reward than Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5040",
      "hadith_no": "5040",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبد الرحمن بن سهم الأنطاكي، أخبرنا عبد الله بن المبارك، عن وهيب المكي، عن عمر بن محمد بن المنكدر، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات ولم يغز ولم يحدث به نفسه مات على شعبة من نفاق ‏\"‏ ‏.‏ قال ابن سهم قال عبد الله بن المبارك فنرى أن ذلك كان على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      One who died but did not fight in the way of Allah nor did he express any desire (or determination) for Jihid died the death of a hypocrite. 'Abdullah b. Mubarak said: We think the hadith pertained to the time of the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "20513",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5049",
      "hadith_no": "5049",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن سمى، عن أبي صالح، عن  أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي بطريق وجد غصن شوك على الطريق فأخره فشكر الله له فغفر له ‏\"‏ ‏.‏ وقال ‏\"‏ الشهداء خمسة المطعون والمبطون والغرق وصاحب الهدم والشهيد في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the, Messenger of Allah (may peace be upon him) said:                      While a man walks along a path, finds a thorny twig lying on the way and puts it aside, Allah would appreciate it and forgive him The Holy Prophet (may peace be upon him) said: The martyrs are of five kinds: one who dies of plague; one who dies of diarrhoea (or cholera) ; one who is drowned; one who is buried under debris and one who dies fighting in the way of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7018",
      "hadith_no": "7018",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن سمى، عن أبي صالح، عن  أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏.‏ في يوم مائة مرة ‏.‏ كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي ولم يأت أحد أفضل مما جاء به إلا أحد عمل أكثر من ذلك ‏.‏ ومن قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who uttered these words:\" There is no god but Allah, the One, having no partner with Him. Sovereignty belongs to Him and all the praise is due to Him, and He is Potent over everything\" one hundred times every day there is a reward of emancipating ten slaves for him, and there are recorded hundred virtues to his credit, and hundred vices are blotted out from his scroll, and that is a safeguard for him against the Satan on that day till evening and no one brings anything more excellent than this, except one who has done more than this (who utters these words more than one hundred times and does more good acts) and he who utters:\" Hallowed be Allah, and all praise is due to Him,\" one hundred times a day, his sins are obliterated even if they are equal to the extent of the foam of the ocean.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7019",
      "hadith_no": "7019",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني محمد بن عبد الملك الأموي، حدثنا عبد العزيز بن المختار، عن سهيل، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يصبح وحين يمسي سبحان الله وبحمده مائة مرة ‏.‏ لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who recites in the morning and in the evening (these words):\" Hallowed be Allah and all praise is due to Him\" one hundred times, he would not bring on the Day of Resurrection anything excellent than this except one who utters these words or utters more than these words.",
      "usc_msa_ref": "",
      "chain": [
        "20252",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7052",
      "hadith_no": "7052",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا سفيان بن عيينة، حدثني سمى، عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يتعوذ من سوء القضاء ومن درك الشقاء ومن شماتة الأعداء ومن جهد البلاء ‏.‏ قال عمرو في حديثه قال سفيان أشك أني زدت واحدة منها ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) used to seek refuge (in Allah) from the evil of destiny and from falling into the hand of calamity and from the mockery of (triumphant) enemies and from the hardship of misery. Abu Sufyan reported:                      I am in doubt that I have made an addition of one word in this supplication.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30022",
        "20005",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-351",
      "hadith_no": "351",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة ومن راح في الساعة الثانية فكأنما قرب بقرة ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن ومن راح في الساعة الرابعة فكأنما قرب دجاجة ومن راح في الساعة الخامسة فكأنما قرب بيضة فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      Whoever takes bath due to sexual defilement on Friday and goes out (for Friday prayer), is treated like one who offers a camel as sacrifice; he who goes out in the second instance as one who offers a cow; he who goes out in the third instance is treated as one who offers horned cow ; he who goes out in the fourth instance is treated as one who offers hen ; he who goes out in the fifth instance is treated as one who offers an egg. When the Imam comes out (for sermon), the angels too attend to listen to the sermon.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-848",
      "hadith_no": "848",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده فقولوا اللهم ربنا لك الحمد فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      When the Imam says: “Allah listens to him who praised Him,” say: “O Allah, our lord, to Thee be the praise, “ for if what anyone says synchronises with what the angels say, he will be forgiven his past sins.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-902",
      "hadith_no": "902",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، قال اشتكى أصحاب النبي صلى الله عليه وسلم إلى النبي صلى الله عليه وسلم مشقة السجود عليهم إذا انفرجوا فقال ‏\"‏ استعينوا بالركب ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Companions of the Prophet (ﷺ) complained to the Prophet (ﷺ) about the hardship when they kept their forearms far away from their sides while prostrating.  He said: Take help with the elbows (by spreading them on the ground and sticking them to the sides).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2365",
      "hadith_no": "2365",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي بكر بن عبد الرحمن، عن بعض، أصحاب النبي صلى الله عليه وسلم قال رأيت رسول الله صلى الله عليه وسلم أمر الناس في سفره عام الفتح بالفطر وقال ‏\"‏ تقووا لعدوكم ‏\"‏ ‏.‏ وصام رسول الله صلى الله عليه وسلم ‏.‏ قال أبو بكر قال الذي حدثني لقد رأيت رسول الله صلى الله عليه وسلم بالعرج يصب على رأسه الماء وهو صائم من العطش أو من الحر ‏.‏",
      "text_en": " Narrated A Companion of the Prophet:                     AbuBakr ibn AbdurRahman reported on the authority of a Companion of the Prophet (ﷺ): I saw the Prophet (ﷺ) commanding the people while he was travelling on the occasion of the conquest of Mecca not to observe fast. He said: Be strong for your enemy. The Messenger of Allah (ﷺ) fasted himself.Narrated AbuBakr:A man who narrated his tradition to me said: I have seen the Messenger of Allah (ﷺ) in al-Arj pouring water over his head while he was fasting, either because of thirst or because of heat.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11003"
      ]
    },
    {
      "id": "sunan-abi-daud-2502",
      "hadith_no": "2502",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبدة بن سليمان المروزي، أخبرنا ابن المبارك، أخبرنا وهيب، - قال عبدة ‏:‏ يعني ابن الورد - أخبرني عمر بن محمد بن المنكدر، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من مات ولم يغز ولم يحدث نفسه بالغزو مات على شعبة من نفاق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying “He who dies without having fought or having felt fighting (against the infidels) to be his duty will die guilty of a kind of hypocrisy.”",
      "usc_msa_ref": "",
      "chain": [
        "38365",
        "20025",
        "20299",
        "20513",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3168",
      "hadith_no": "3168",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن سمى، عن أبي صالح، عن أبي هريرة، يرويه قال من تبع جنازة فصلى عليها فله قيراط ومن تبعها حتى يفرغ منها فله قيراطان أصغرهما مثل أحد أو أحدهما مثل أحد ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     If anyone attends the funeral and prays over (the dead), he will get the reward of one qirat, and if anyone attends the funeral until the completion (of the burial), he will get the reward of two qirats, the smaller of them being equivalent of Uhud, or one of them being equivalent to Uhud.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20012",
        "11428",
        "11161"
      ]
    },
    {
      "id": "sunan-abi-daud-5029",
      "hadith_no": "5029",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا عطس وضع يده أو ثوبه على فيه وخفض أو غض بها صوته ‏.‏ شك يحيى ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) sneezed, he placed his hand or a garment on his mouth, and lessened the noise. The transmitter Yahya is doubtful about the exact words khafada or ghadda (lessened).",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5091",
      "hadith_no": "5091",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد، - يعني ابن زريع - حدثنا روح بن القاسم، عن سهيل، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يصبح سبحان الله العظيم وبحمده مائة مرة وإذا أمسى كذلك لم يواف أحد من الخلائق بمثل ما وافى ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      if anyone says a hundred times in the morning: “Glory be to Allah, the Sublime, and I begin with praise of him”, and says likewise in the evening, no one from the creatures will bring anything like the one which he will bring.",
      "usc_msa_ref": "",
      "chain": [
        "30173",
        "20304",
        "11586",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-267",
      "hadith_no": "267",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده ‏.‏ فقولوا ربنا ولك الحمد فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أن يقول الإمام سمع الله لمن حمده ربنا ولك الحمد ‏.‏ ويقول من خلف الإمام ربنا ولك الحمد ‏.‏ وبه يقول أحمد ‏.‏ وقال ابن سيرين وغيره يقول من خلف الإمام سمع الله لمن حمده ربنا ولك الحمد ‏.‏ مثل ما يقول الإمام ‏.‏ وبه يقول الشافعي وإسحاق ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"When the Imam says:  (Sami Allahu liman hamidah) 'Allah listens to those who praise Him. Then (all of you) say: (Rabbana wa lakal-hamd) 'O our Lord! And to You is the praise for whoever's saying concurs with the saying of the angels, then his past sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-286",
      "hadith_no": "286",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، قال اشتكى بعض أصحاب النبي صلى الله عليه وسلم إلى النبي صلى الله عليه وسلم مشقة السجود عليهم إذا تفرجوا فقال ‏\"‏ استعينوا بالركب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم إلا من هذا الوجه من حديث الليث عن ابن عجلان ‏.‏ وقد روى هذا الحديث سفيان بن عيينة وغير واحد عن سمى عن النعمان بن أبي عياش عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وكأن رواية هؤلاء أصح من رواية الليث ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"[Some of] the Companions of the Prophet complained [to the Prophet] about the hardship of the prostration on them, when they were so spread out, so he said: 'Use your knees.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-499",
      "hadith_no": "499",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة ومن راح في الساعة الثانية فكأنما قرب بقرة ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن ومن راح في الساعة الرابعة فكأنما قرب دجاجة ومن راح في الساعة الخامسة فكأنما قرب بيضة فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وسمرة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-933",
      "hadith_no": "933",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرة إلى العمرة تكفر ما بينهما والحج المبرور ليس له جزاء إلا الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated thatthe Messenger of Allahsaid:                      \"Umrah to 'Umrah atones for thesins between them, and for A1-HajjAl-Mabrur there is no rewardexcept Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20012",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1063",
      "hadith_no": "1063",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشهداء خمس المطعون والمبطون والغرق وصاحب الهدم والشهيد في سبيل الله ‏\"‏ ‏.‏ قال وفي الباب عن أنس وصفوان بن أمية وجابر بن عتيك وخالد بن عرفطة وسليمان بن صرد وأبي موسى وعائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"",
      "usc_msa_ref": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1666",
      "hadith_no": "1666",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا علي بن حجر، حدثنا الوليد بن مسلم، عن إسماعيل بن رافع، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لقي الله بغير أثر من جهاد لقي الله وفيه ثلمة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث الوليد بن مسلم عن إسماعيل بن رافع ‏.‏ وإسماعيل بن رافع قد ضعفه بعض أصحاب الحديث ‏.‏ قال وسمعت محمدا يقول هو ثقة مقارب الحديث ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وحديث سلمان إسناده ليس بمتصل محمد بن المنكدر لم يدرك سلمان الفارسي ‏.‏ وقد روي هذا الحديث عن أيوب بن موسى عن مكحول عن شرحبيل بن السمط عن سلمان عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whoever meets Allah without any traces from Jihad he meets Allah with a defect.[Abu 'Eisa said:] This Hadith is Gharib as a narration of Al-Walid bin Muslim from Isma'il bin Rafi'. Isma'il bin Rafi' was graded weak by some of the people of Hadith. I heard Muhammad saying: \"He is trustworthy, average (Muqarib) in Hadith.\"This Hadith has been reported from Abu Hurairah from the Prophet (ﷺ) through other than this route. Regarding the Hadith of Salman, its chain is not connected, Muhammad bin Al-Munkadir did not see Salman Al-Farisi.This Hadith has been reported from Ayyub bin Musa, from Makhul, from Shurahbil bin As-Simt from Salman, from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20733",
        "22024",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2085",
      "hadith_no": "2085",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل يمشي في طريق إذ وجد غصن شوك فأخره فشكر الله له فغفر له ‏\"‏ ‏.‏ وفي الباب عن أبي برزة وابن عباس وأبي ذر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said :                     \"When a man was walking on the road, he found a thorny branch and removed it. Allah appreciated his action by forgiving him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2969",
      "hadith_no": "2969",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا يحيى بن سعيد، عن محمد بن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان إذا عطس غطى وجهه بيده أو بثوبه وغض بها صوته ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that when the Prophet (ﷺ) would sneeze, he would cover his face with his hand or with his garment, and muffle the sound with it.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3466-2",
      "hadith_no": "3466",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا المحاربي، عن مالك بن أنس، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال سبحان الله وبحمده مائة مرة غفرت له ذنوبه وإن كانت مثل زبد البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: “Whoever says: ‘Glory is to Allah, and with His Praise (Subhan Allah, Wa Bihamdih)’ a hundred times, his sins are forgiven, even if they were like the foam of the sea.”",
      "usc_msa_ref": "",
      "chain": [
        "20333",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3468-2",
      "hadith_no": "3468",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير في يوم مائة مرة كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكان له حرزا من الشيطان يومه ذلك حتى يمسي ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال سبحان الله وبحمده مائة مرة حطت خطاياه وإن كانت أكثر من زبد البحر ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح.",
      "text_en": " Abu Hurairah narrates that:                     The Mesenger of Allah said: “Whoever says: ‘There is none worthy of worship except Allah, Alone, without partner, to Him belongs all that exists and to Him belongs the praise, He gives life and causes death, and He is Powerful over all things, (La Ilaha Illallah, Wahdahu La Sharika Lahi, Lahul-Mulku Wa Lahul-Hamdu, Yuhyi Wa Yumitu, Wa Huwa Ala Kulli Shai’in Qadir)’ a hundred times in a day, it will be for him the quivalent of freeing ten slaves, and there shall be written for him a hundred good deeds, and a hundred bad deeds shall be wiped out for him, and it will be a protection for him from Shaitan on that day, until he reaches the evening. And none has brought better than it, except for one who has done more than that.”And with this chain, from the Prophet, that he said: “Whoever says: ‘Glory is to Allah, and with His Praise (Subhan Allah, Wa Bihamdih)’ a hundred times, his sins are forgiven, even if they were like the foam of the sea.”",
      "usc_msa_ref": "",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3469-2",
      "hadith_no": "3469",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح وحين يمسي سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: “Whoever says in the morning and in the evening “Glory is to Allah and with His Praise (Subhan Allah, Wa Bihamdih)” a hundred times, none shall bring better than him on the Day of Judgment except one who did the same as him, or increased upon it.",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-545",
      "hadith_no": "545",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عتبة بن عبد الله، قال قرأت على مالك بن أنس والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا ولو يعلم الناس ما في التهجير لاستبقوا إليه ولو علموا ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"If the people knew what (virtue) there was in the call to prayer and the first row, and they not find any way to get to do that [1] other than by drawing lots, they would do that. If they knew what (virtue) there was in coming early to prayer, they would compete to be first in the Masjid. If they knew what (virtue) there was in Al-'Atamah and Subh, they would come to them even if they had to crawl.\"[1] Indicating the two mentioned items: that is the call to prayer and praying in the first row.",
      "usc_msa_ref": "",
      "chain": [
        "20342",
        "30234",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-679",
      "hadith_no": "679",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا عليه ولو يعلمون ما في التهجير لاستبقوا إليه ولو علموا ما في العتمة والصبح لأتوهما ولو حبوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"If the people knew what (virtue) there is in the call to prayer and the first row, and they had no other way but to draw lots concerning them, they would draw lots. If they knew what (virtue) there is in coming early for the prayer, they would compete in doing so. And if they knew what (virtue) there is in 'Atamah and Subh prayer, they would come even if they had to crawl.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-929",
      "hadith_no": "929",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقولوا آمين فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah, may Allah be pleased with him, that:                     The Messenger of Allah (ﷺ) said: \"When the Imam says: Not (the way) of those who earned Your anger, nor of those who went astray, say: 'Amin,' for if a person's Amin coincides with the Amin of the angels, his previous sins will be forgiven.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1063",
      "hadith_no": "1063",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده فقولوا ربنا ولك الحمد فإن من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"When the Imam says: 'Sami Allahu liman hamidah (Allah hears the one who praises Him),' then say: 'Rabbana wa lakal-hamd,' (Our Lord, and to You be the praise).' Whoever says that and it coincides with the angels saying it, his previous sins will be forgiven.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1137",
      "hadith_no": "1137",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، أنه سمع أبا صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه عز وجل وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"The closest that a person can be to his Lord, the Mighty and Sublime, is when he is prostrating, so increase in supplication then.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20377",
        "11894",
        "11428",
        "19291",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-24",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال أنبأنا الليث، عن ابن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تقعد الملائكة يوم الجمعة على أبواب المسجد يكتبون الناس على منازلهم فالناس فيه كرجل قدم بدنة وكرجل قدم بقرة وكرجل قدم شاة وكرجل قدم دجاجة وكرجل قدم عصفورا وكرجل قدم بيضة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"On Fridays the angels sit at the gates of the masjid writing down the peoples' names in the order in which they come. So the people are like a man who sacrifices a camel and like a man who sacrifices a camel, then like a man who sacrifices a cow and like a man who sacrifices a cow, then like a man who sacrifices a sheep and like a man who sacrifices a sheep, then like a man who sacrifices a chicken and like a man who sacrifices a chicken, then like a man who sacrifices a sparrow and like a man who sacrifices a sparrow, then like a man who sacrifices an egg and like a man who sacrifices an egg.\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-25",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة ومن راح في الساعة الثانية فكأنما قرب بقرة ومن راح في الساعة الثالثة فكأنما قرب كبشا ومن راح في الساعة الرابعة فكأنما قرب دجاجة ومن راح في الساعة الخامسة فكأنما قرب بيضة فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"Whoever performs ghusl as from janabah on Friday, then comes (to the masjid), it is as if he sacrificed a camel. Then the one who comes in the second hour, it is as if he sacrificed a cow. Then the one who comes in the third hour, it is as if he sacrificed a ram. Then the one who comes in the fourth hour, it is as if he sacrificed a chicken. Then the one who comes in the fifth hour, it is as if he sacrificed an egg. Then when the imam comes out, the angels attend to listen to the khutbah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2253",
      "hadith_no": "2253",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الله بن أحمد بن محمد بن حنبل، قال قرأت على أبي حدثكم ابن نمير، قال حدثنا سفيان، عن سمى، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام يوما في سبيل الله باعد الله بذلك اليوم النار عن وجهه سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                     \"The Messenger of Allah said: Whoever fasts a day in the cause of Allah, Allah will separate his face (a distance of) seventy autumns from the fire in return for that day.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20005",
        "11428",
        "11542",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2622",
      "hadith_no": "2622",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبدة بن عبد الله الصفار البصري، قال حدثنا سويد، - وهو ابن عمرو الكلبي - عن زهير، قال حدثنا سهيل، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحجة المبرورة ليس لها جزاء إلا الجنة والعمرة إلى العمرة كفارة لما بينهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Hajj al-Mabrur brings no reward other than Paradise, and from one 'Umrah to another is expiation for what came in between.\" (Shih)",
      "usc_msa_ref": "",
      "chain": [
        "30466",
        "20321",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2623",
      "hadith_no": "2623",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا حجاج، قال حدثنا شعبة، قال أخبرني سهيل، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحجة المبرورة ليس لها ثواب إلا الجنة ‏\"‏ ‏.‏ مثله سواء إلا أنه قال ‏\"‏ تكفر ما بينهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"Hajj Al-Mabrur brings no reward other than paradise,\" the report is the same except that he said, \"expiates for what came in between.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20219",
        "20020",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2629",
      "hadith_no": "2629",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرة إلى العمرة كفارة لما بينهما والحج المبرور ليس له جزاء إلا الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that abnu Hurairah said:                     \"The Messenger of Allah said: 'from one 'Umrah to another is an expiation for what comes in between, and Hajj al-Mabrur brings no reward less than Paradise.'''(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3097",
      "hadith_no": "3097",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبدة بن عبد الرحيم، قال حدثنا سلمة بن سليمان، قال أنبأنا ابن المبارك، قال أنبأنا وهيب، - يعني ابن الورد - قال أخبرني عمر بن محمد بن المنكدر، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من مات ولم يغز ولم يحدث نفسه بغزو مات على شعبة نفاق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"Whoever dies without having fought or thought of fighting, he dies on one of the branches of hypocrisy.\"",
      "usc_msa_ref": "",
      "chain": [
        "38366",
        "30340",
        "20025",
        "20527",
        "20513",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4200",
      "hadith_no": "4200",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عبد القدوس بن محمد بن عبد الكبير بن شعيب بن الحبحاب، قال حدثنا محمد بن جهضم، قال حدثنا إسماعيل بن جعفر، عن ابن عجلان، عن القعقاع بن حكيم، وعن سمى، وعن عبيد الله بن مقسم، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الدين النصيحة ‏\"‏ ‏.‏ قالوا لمن يا رسول الله قال ‏\"‏ لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Religion is sincerity (An-Nasihah).\" The said: \"To whom, O Messenger of Allah?\" he said: \"To Allah, to His Book, to His Messenger, to the imams of the Muslims and to their common folk.\"",
      "usc_msa_ref": "",
      "chain": [
        "30162",
        "20155",
        "10616",
        "10612",
        "11428",
        "11521",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5491",
      "hadith_no": "5491",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سفيان، عن سمى، عن أبي صالح، إن شاء الله عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يتعوذ من هذه الثلاثة من درك الشقاء وشماتة الأعداء وسوء القضاء وجهد البلاء ‏.‏ قال سفيان هو ثلاثة فذكرت أربعة لأني لا أحفظ الواحد الذي ليس فيه ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Prophet [SAW] used to seek refuge from these three: From being overtaken by destruction, from his enemies rejoicing in his misfortune, from being destined to an evil end, and from the difficult moment of a calamity.\" Sufyan (one of the narrators) said: \"There were three, and I mentioned four because I do not remember which one was not one of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20012",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5492",
      "hadith_no": "5492",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن سمى، عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يستعيذ من سوء القضاء وشماتة الأعداء ودرك الشقاء وجهد البلاء ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet [SAW] used to seek refuge from being destined to an evil end, from his enemies rejoicing in his misfortune, from being overtaken by destruction and from the difficult moment of a calamity.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2992",
      "hadith_no": "2992",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، وأبو مصعب الزهري وسويد بن سعيد قالوا حدثنا مالك بن أنس، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ السفر قطعة من العذاب يمنع أحدكم نومه وطعامه وشرابه فإذا قضى أحدكم نهمته من سفره فليعجل الرجوع إلى أهله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Traveling is a kind of torment, it keeps anyone of you from hissleep, food and drink. When anyone of you has fulfilled the purposefor which he travled, let him hasten to return to his family.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "30100",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3000",
      "hadith_no": "3000",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مصعب، حدثنا مالك بن أنس، عن سمى، - مولى أبي بكر بن عبد الرحمن - عن أبي صالح السمان، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ العمرة إلى العمرة كفارة ما بينهما والحج المبرور ليس له جزاء إلا الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Fromone‘Umrah to another is an expiation for the sins that came inbetweenthem, and Hajj Mabrur (an accepted Hajj) brings no less areward thanParadise.”",
      "usc_msa_ref": "",
      "chain": [
        "30100",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3812",
      "hadith_no": "3812",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا نصر بن عبد الرحمن الوشاء، حدثنا عبد الرحمن المحاربي، عن مالك بن أنس، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال سبحان الله وبحمده مائة مرة غفرت له ذنوبه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (ﷺ) said: \"Whoever says: Subhan Allahi wa bi hamdihi (Glory and praise is to Allah) one hundred times, his sins will be forgiven even if they were like the foam of the sea.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35157",
        "20333",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 63
}