{
  "id": "11429",
  "name": "Siyar Abu al-Hakam al-Anzi سيار أبو الحكم العنزي",
  "full_name": "Siyar Abu al-Hakam al-Anzi سيار أبو الحكم العنزي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "122",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Anzi",
      "al-Wasti",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "24229",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11665",
      "name": "Yazid bin S'hyb يزيد بن صهيب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18115",
      "name": "Jbr bin 'Ubaid'h جبر بن عبيدة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20552",
      "name": "al-S'q bin Hzn الصعق بن حزن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "335",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا هشيم، ح قال وحدثني سعيد بن النضر، قال أخبرنا هشيم، قال أخبرنا سيار، قال حدثنا يزيد  هو ابن صهيب الفقير  قال أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ أعطيت خمسا لم يعطهن أحد قبلي نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجدا وطهورا، فأيما رجل من أمتي أدركته الصلاة فليصل، وأحلت لي المغانم ولم تحل لأحد قبلي، وأعطيت الشفاعة، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس عامة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"I have been given five things which were not given to any one else before me. -1. Allah made me victorious by awe, (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me yet it was not lawful for anyone else before me. -4. I have been given the right of intercession (on the Day of Resurrection). -5. Every Prophet used to be sent to his nation only but I have been sent to all mankind.",
      "chain": [
        "34207",
        "20468",
        "30253",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا هشيم، قال حدثنا سيار  هو أبو الحكم  قال حدثنا يزيد الفقير، قال حدثنا جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي، نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجدا وطهورا، وأيما رجل من أمتي أدركته الصلاة فليصل، وأحلت لي الغنائم، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس كافة، وأعطيت الشفاعة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"I have been given five things which were not given to any amongst the Prophets before me. These are: -1. Allah made me victorious by awe (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum. Therefore my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me (and was not made so for anyone else). -4. Every Prophet used to be sent to his nation exclusively but I have been sent to all mankind. -5. I have been given the right of intercession (on the Day of Resurrection.)",
      "chain": [
        "34207",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "1546",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا سيار أبو الحكم، قال سمعت أبا حازم، قال سمعت أبا هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من حج لله فلم يرفث ولم يفسق رجع كيوم ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet (p.b.u.h) said, \"Whoever performs Hajj for Allah's pleasure and does not have sexual relations with his wife, and does not do evil or sins then he will return (after Hajj free from all sins) as if he were born anew.\"",
      "chain": [
        "20404",
        "20020",
        "11429",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3122",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن سنان، حدثنا هشيم، أخبرنا سيار، حدثنا يزيد الفقير، حدثنا جابر بن عبد الله  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحلت لي الغنائم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"Booty has been made legal for me.\"",
      "chain": [
        "34207",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "5135",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو النعمان، حدثنا هشيم، حدثنا سيار، عن الشعبي، عن جابر بن عبد الله، قال قفلنا مع النبي صلى الله عليه وسلم من غزوة فتعجلت على بعير لي قطوف، فلحقني راكب من خلفي، فنخس بعيري بعنزة كانت معه، فانطلق بعيري كأجود ما أنت راء من الإبل، فإذا النبي صلى الله عليه وسلم فقال ‏\"‏ ما يعجلك ‏\"‏‏.‏ قلت كنت حديث عهد بعرس‏.‏ قال ‏\"‏ بكرا أم ثيبا ‏\"‏‏.‏ قلت ثيب‏.‏ قال ‏\"‏ فهلا جارية تلاعبها وتلاعبك ‏\"‏‏.‏ قال فلما ذهبنا لندخل قال ‏\"‏ أمهلوا حتى تدخلوا ليلا  أى عشاء  لكى تمتشط الشعثة وتستحد المغيبة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While we were returning from a Ghazwa (Holy Battle) with the Prophet, I started driving my camel fast, as it was a lazy camel A rider came behind me and pricked my camel with a spear he had with him, and then my camel started running as fast as the best camel you may see. Behold! The rider was the Prophet himself. He said, 'What makes you in such a hurry?\" I replied, I am newly married \" He said, \"Did you marry a virgin or a matron? I replied, \"A matron.\" He said, \"Why didn't you marry a young girl so that you may play with her and she with you?\" When we were about to enter (Medina), the Prophet said, \"Wait so that you may enter (Medina) at night so that the lady of unkempt hair may comb her hair and the one whose husband has been absent may shave her pubic region.",
      "chain": [
        "20283",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5300",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، عن هشيم، عن سيار، عن الشعبي، عن جابر، قال كنت مع رسول الله صلى الله عليه وسلم في غزوة، فلما قفلنا تعجلت على بعير قطوف فلحقني راكب من خلفي، فالتفت فإذا أنا برسول الله صلى الله عليه وسلم قال ‏\"‏ ما يعجلك ‏\"‏‏.‏ قلت إني حديث عهد بعرس‏.‏ قال ‏\"‏ فبكرا تزوجت أم ثيبا ‏\"‏‏.‏ قلت بل ثيبا‏.‏ قال ‏\"‏ فهلا جارية تلاعبها وتلاعبك ‏\"‏‏.‏ قال فلما قدمنا ذهبنا لندخل فقال ‏\"‏ أمهلوا حتى تدخلوا ليلا  أى عشاء  لكى تمتشط الشعثة وتستحد المغيبة ‏\"‏‏.‏ قال وحدثني الثقة أنه قال في هذا الحديث ‏\"‏ الكيس الكيس يا جابر ‏\"‏‏.‏ يعني الولد‏.‏",
      "text_en": " Narrated Jabir:                     I was with Allah's Apostle in a Ghazwa, and when we returned, I wanted to hurry, while riding a slow camel. A rider came behind me. I looked back and saw that the rider was Allah's Apostle . He said (to me), \"What makes you in such a hurry?\" I replied, \"I am newly married.\" He said, \"Did you marry a virgin or a matron?\" I replied, \"(Not a virgin but) a matron.\" He said, \"Why didn't you marry a young girl with whom you could play and who could play with you?\" Then when we approached (Medina) and were going to enter (it), the Prophet said, \"Wait till you enter (your homes) at night (in the first part of the night) so that the ladies with unkempt hair may comb their hair, and those whose husbands have been absent (for a long time) may shave their pubic hair.\" (The sub-narrator, Hashim said: A reliable narrator told me that the Prophet added in this Hadith: \"(Seek to beget) children! Children, O Jabir!\")",
      "chain": [
        "30175",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5301",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، عن سيار، عن الشعبي، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخلت ليلا فلا تدخل على أهلك حتى تستحد المغيبة وتمتشط الشعثة ‏\"‏‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فعليك بالكيس الكيس ‏\"‏‏.‏ تابعه عبيد الله عن وهب عن جابر عن النبي صلى الله عليه وسلم في الكيس‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"If you enter (your town) at night (after coming from a journey), do not enter upon your family till the woman whose husband was absent (from the house) shaves her pubic hair and the woman with unkempt hair, combs her hair\" Allah's Apostle further said, \"(O Jabir!) Seek to have offspring, seek to have offspring!\"",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا سيار، عن الشعبي، عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في غزوة، فلما قفلنا كنا قريبا من المدينة تعجلت على بعير لي قطوف، فلحقني راكب من خلفي فنخس بعيري بعنزة كانت معه، فسار بعيري كأحسن ما أنت راء من الإبل، فالتفت فإذا أنا برسول الله صلى الله عليه وسلم فقلت يا رسول الله إني حديث عهد بعرس‏.‏ قال ‏\"‏ أتزوجت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أبكرا أم ثيبا ‏\"‏‏.‏ قال قلت بل ثيبا‏.‏ قال ‏\"‏ فهلا بكرا تلاعبها وتلاعبك ‏\"‏‏.‏ قال فلما قدمنا ذهبنا لندخل، فقال ‏\"‏ أمهلوا حتى تدخلوا ليلا  أى عشاء  لكى تمتشط الشعثة، وتستحد المغيبة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     We were with the Prophet in Ghazwa, and when we returned and approached Medina, I wanted to hurry while riding a slow camel. A rider overtook me and pricked my camel with a spear which he had, whereupon my camel started running as fast as any other fast camel you may see. I looked back, and behold, the rider was Allah's Apostle . I said, \"O Allah's Apostle! I am newly married \" He asked, \"Have you got married?\" I replied, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"(Not a virgin) but a matron\" He said, \"Why didn't you marry a young girl so that you could play with her and she with you?\" When we reached (near Medina) and were going to enter it, the Prophet said, \"Wait till you enter your home early in the night so that the lady whose hair is unkempt may comb her hair and that the lady whose husband has been away may shave her pubic hair.\"",
      "chain": [
        "20184",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "6320",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن سيار، عن ثابت البناني، عن أنس بن مالك  رضى الله عنه أنه مر على صبيان فسلم عليهم وقال كان النبي صلى الله عليه وسلم يفعله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that he passed by a group of boys and greeted them and said, \"The Prophet used to do so.\"",
      "chain": [
        "20386",
        "20020",
        "11429",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7290",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا سيار، عن الشعبي، عن جرير بن عبد الله، قال بايعت النبي صلى الله عليه وسلم على السمع والطاعة، فلقنني، فيما استطعت، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I gave the Pledge of allegiance to the Prophet that I would listen and obey, and he told me to add: 'As much as I can, and will give good advice to every Muslim.'",
      "chain": [
        "20184",
        "20468",
        "11429",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "210",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سريج بن يونس، ويعقوب الدورقي، قالا حدثنا هشيم، عن سيار، عن الشعبي، عن جرير، قال بايعت النبي صلى الله عليه وسلم على السمع والطاعة فلقنني ‏\"‏ فيما استطعت ‏\"‏ ‏.‏ والنصح لكل مسلم ‏.‏ قال يعقوب في روايته قال حدثنا سيار ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he observed:                      I owed allegiance to the Apostle of Allah (may peace and blessings be upon him) on hearing ( is commands) and obeying (them) and the Prophet) instructed me (to act) as lay in my power, and sincerity and goodwill for every Muslim.",
      "chain": [
        "30251",
        "30400",
        "20468",
        "11429",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "1191",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن سيار، عن يزيد الفقير، عن جابر بن عبد الله الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعطيت خمسا لم يعطهن أحد قبلي كان كل نبي يبعث إلى قومه خاصة وبعثت إلى كل أحمر وأسود وأحلت لي الغنائم ولم تحل لأحد قبلي وجعلت لي الأرض طيبة طهورا ومسجدا فأيما رجل أدركته الصلاة صلى حيث كان ونصرت بالرعب بين يدى مسيرة شهر وأعطيت الشفاعة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah al-Ansari reported:                      The Prophet (may peace be upon him) said: I have been conferred upon five (things) which were not granted to anyone before me (and these are): Every apostle wassent particularly to his own people, whereas I have been sent to all the red and the black the spoils of war have been made lawful for me, and these were never made lawful to anyone before me, and the earth has been made sacred and pure and mosque for me, so whenever the time of prayer comes for any one of you he should pray whenever he is, and I have been supported by awe (by which the enemy is overwhelmed) from the distance (which one takes) one month to cover and I have been granted intercession.",
      "chain": [
        "30399",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "1192",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، أخبرنا سيار، حدثنا يزيد الفقير، أخبرنا جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " Jabir b. 'Abdullah related that the Messenger of Allah (may peace be upon him) said, and he related like this.",
      "chain": [
        "30201",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "3359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، عن سيار، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "chain": [
        "30116",
        "20468",
        "11429",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3713",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن سيار، عن الشعبي، عن جابر بن عبد، الله قال كنا مع رسول الله صلى الله عليه وسلم في غزاة فلما أقبلنا تعجلت على بعير لي قطوف فلحقني راكب خلفي فنخس بعيري بعنزة كانت معه فانطلق بعيري كأجود ما أنت راء من الإبل فالتفت فإذا أنا برسول الله صلى الله عليه وسلم فقال ‏\"‏ ما يعجلك يا جابر ‏\"‏ ‏.‏ قلت يا رسول الله إني حديث عهد بعرس ‏.‏ فقال ‏\"‏ أبكرا تزوجتها أم ثيبا ‏\"‏ ‏.‏ قال قلت بل ثيبا ‏.‏ قال ‏\"‏ هلا جارية تلاعبها وتلاعبك ‏\"‏ ‏.‏ قال فلما قدمنا المدينة ذهبنا لندخل فقال ‏\"‏ أمهلوا حتى ندخل ليلا - أى عشاء - كى تمتشط الشعثة وتستحد المغيبة ‏\"‏ ‏.‏ قال وقال ‏\"‏ إذا قدمت فالكيس الكيس ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We were with Allah's Messenger (may peace be upon him) in an expedition. When we returned I urged my camel to move quickly as it was slow. There met me a rider from behind me and he goaded it with an iron-tipped stick which he had with him. My camel moved forward like the best that you have ever seen. As I turned (my face) I found him to be Allah's Messenger (may peace be upon him) He said: Jabir, what hastens you? I said: Messenger of Allah, I am newly wedded. whereupon he said: Is it a virgin that you have married or one previously married? I said: With one previously married. He said: Why not a young girl so that you could play with her and she could play with you? Then when we arrived at and were about to enter Medina he said: Wait, so that we may enter by night (i. e. in the evening) in order that the woman with dishevelled hair may comb it, and the woman whose husband had been away may get herself clean; and when you enter (then you have the) enjoyment (of tho wife's company).",
      "chain": [
        "30399",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "3778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثني زهير بن حرب، حدثنا هشيم، أخبرنا سيار، وحصين، ومغيرة، وأشعث، ومجالد وإسماعيل بن أبي خالد وداود كلهم عن الشعبي، قال دخلت على فاطمة بنت قيس فسألتها عن قضاء، رسول الله صلى الله عليه وسلم عليها فقالت طلقها زوجها البتة ‏.‏ فقالت فخاصمته إلى رسول الله صلى الله عليه وسلم في السكنى والنفقة - قالت - فلم يجعل لي سكنى ولا نفقة وأمرني أن أعتد في بيت ابن أم مكتوم ‏.‏",
      "text_en": " Sha'bi reported:                      I visited Fatima bint Qais and asked her about the verdict of Allah's Messenger (may peace be upon him) about (board and lodging during the 'Idda) and she said that her husband divorced her with an irrevocable divorce. She (further. said): I contended with him before Allah's Messerger (may peace be upon him) about lodging and maintenance allowance, and she said: He did not provide me with any lodging or maintenance allowance, and he commanded me to spend the 'Idda in the house of Ibn Umm Maktum.",
      "chain": [
        "30022",
        "20468",
        "11429",
        "15097",
        "11072",
        "11324",
        "11052"
      ]
    },
    {
      "hadith_no": "3780",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد بن الحارث الهجيمي، حدثنا قرة، حدثنا سيار، أبو الحكم حدثنا الشعبي، قال دخلنا على فاطمة بنت قيس فأتحفتنا برطب ابن طاب وسقتنا سويق سلت فسألتها عن المطلقة، ثلاثا أين تعتد قالت طلقني بعلي ثلاثا فأذن لي النبي صلى الله عليه وسلم أن أعتد في أهلي ‏.",
      "text_en": " Sha'bi reported:                      We visited Fitima hint Qais and she served us fresh dates and a drink of barley flour, and I asked where should a woman who has been divorced by three pronouncements, spend the period of her 'Idda. She said: My husband divorced me with three pronouncements, and Allah's Apostle (may peace be upon him) permitted me to spend my 'Idda period in my family (with my parents).",
      "chain": [
        "20226",
        "11301",
        "11429",
        "11052"
      ]
    },
    {
      "hadith_no": "5073",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني إسماعيل بن سالم، حدثنا هشيم، أخبرنا سيار، ح وحدثنا يحيى بن يحيى، - واللفظ له - حدثنا هشيم، عن سيار، عن الشعبي، عن جابر بن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم في غزاة فلما قدمنا المدينة ذهبنا لندخل فقال ‏\"‏ أمهلوا حتى ندخل ليلا - أى عشاء - كى تمتشط الشعثة وتستحد المغيبة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. 'Abdullah who said:                      We accompanied the Messenger of Allah (may peace be upon him) on an expedition. When we came (back) to Medina and were going to enter our houses, he said: Wait and enter (your houses) in the later part of the evening so that a woman with dishevelled hair may have used the comb, and a woman whose husband has been away from home may have removed the hair from her private parts.",
      "chain": [
        "30415",
        "20468",
        "11429",
        "30399",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5074",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا شعبة، عن سيار، عن عامر، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قدم أحدكم ليلا فلا يأتين أهله طروقا حتى تستحد المغيبة وتمتشط الشعثة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir that the Messenger of Allah (may peace be upon him) said:                      If one of you comes (back from a journey) at night. he should not enter his house as a night visitor (but should wait) until a woman whose husband has been away from house has removed the hair from her private parts and a woman with dishevelled hair has combed her hair.",
      "chain": [
        "30170",
        "20250",
        "20020",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "5075",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا روح بن عبادة، حدثنا شعبة، حدثنا سيار، بهذا الإسناد مثله ‏.‏",
      "text_en": " This tradition has been handed down through another chain of transmitters.",
      "chain": [
        "30459",
        "20229",
        "20020",
        "11429"
      ]
    },
    {
      "hadith_no": "5791",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن سيار، عن ثابت البناني، عن أنس، بن مالك أن رسول الله صلى الله عليه وسلم مر على غلمان فسلم عليهم ‏.‏",
      "text_en": " Anas b. Malik reported that when Allah's Messenger (may peace be upon him) happened to pass by young boys he would great them. This hadith has been narrated on the authority of Sayyar with the same chain of transmitters.",
      "chain": [
        "30399",
        "20468",
        "11429",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5793",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني عمرو بن علي، ومحمد بن الوليد، قالا حدثنا محمد بن جعفر، حدثنا  شعبة، عن سيار، قال كنت أمشي مع ثابت البناني فمر بصبيان فسلم عليهم ‏.‏ وحدث ثابت أنه كان يمشي مع أنس فمر بصبيان فسلم عليهم ‏.‏ وحدث أنس أنه كان يمشي مع رسول الله صلى الله عليه وسلم فمر بصبيان فسلم عليهم ‏.‏",
      "text_en": " Sayyar reported:                      I was walking with Thibit al-Bunani that he happened to pass by children and he greeted them. And Thibit reported that he walked with Anas and he happened to pass by children and he greeted them. and Anas reported that he walked with Allah's Apostle (may peace be upon. him) and he happened, to pass by children and he greeted them.",
      "chain": [
        "30153",
        "30174",
        "20173",
        "20020",
        "11429"
      ]
    },
    {
      "hadith_no": "7574",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث الهجيمي أبو عثمان، حدثنا قرة، حدثنا سيار أبو الحكم، حدثنا الشعبي، قال دخلنا على فاطمة بنت قيس فأتحفتنا برطب يقال له رطب ابن طاب وأسقتنا سويق سلت فسألتها عن المطلقة، ثلاثا أين تعتد قالت طلقني بعلي ثلاثا فأذن لي النبي صلى الله عليه وسلم أن أعتد في أهلي - قالت - فنودي في الناس إن الصلاة جامعة - قالت - فانطلقت فيمن انطلق من الناس - قالت - فكنت في الصف المقدم من النساء وهو يلي المؤخر من الرجال - قالت - فسمعت النبي صلى الله عليه وسلم وهو على المنبر يخطب فقال ‏\"‏ إن بني عم لتميم الداري ركبوا في البحر ‏\"‏ ‏.‏ وساق الحديث وزاد فيه قالت فكأنما أنظر إلى النبي صلى الله عليه وسلم وأهوى بمخصرته إلى الأرض وقال ‏\"‏ هذه طيبة ‏\"‏ ‏.‏ يعني المدينة ‏.‏",
      "text_en": " Al-Sha'bi reported:                      We visited Fatima b. Qais and she served us fresh dates which are called rutab and she also served us barley. I asked her about that woman in whose case three divorces had been pronounced as to how much time she should count as the waiting period. She said: My husband pronounced three divorces in my case and Allah's Messenger (may peace be upon him) permitted me to spend any waiting period in my family. (It was during this period) that announcement was made for the people to observe prayer in the bigger Mosque. I went there along with people and I was in the front row meant for women and it was adjacent to the last row of men and I heard Allah's Messenger (may peace be upon him) deliver sermon sitting on the pulpit. He said: The cousin of Tamim (Dari) sailed in the ocean. The rest of the hadith is the same but with this addition:\" (I see) as if I am looking to Allah's Apostle (may peace be upon him) pointing his rod towards the land (and saying): It is Taiba, i. e. Medina.\"",
      "chain": [
        "20226",
        "11301",
        "11429",
        "11052"
      ]
    },
    {
      "hadith_no": "758",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، عن عبد الرحمن بن إسحاق الكوفي، عن سيار أبي الحكم، عن أبي وائل، قال قال أبو هريرة أخذ الأكف على الأكف في الصلاة تحت السرة ‏.‏ قال أبو داود سمعت أحمد بن حنبل يضعف عبد الرحمن بن إسحاق الكوفي ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     (The established way of folding hands is) to hold the hands by the hands in prayer below the navel.Abu Dawud said: I heard Ahmad b. Hanbal say: The narrator 'Abd al-Rahman b. Ishaq al-Kufi is weak (i.e. not reliable).",
      "chain": [
        "30175",
        "20256",
        "11429",
        "11353",
        "30002"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، أخبرنا سيار، عن الشعبي، عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم في سفر فلما ذهبنا لندخل قال ‏\"‏ أمهلوا حتى ندخل ليلا لكى تمتشط الشعثة وتستحد المغيبة ‏\"‏ ‏.‏ قال أبو داود قال الزهري الطروق بعد العشاء ‏.‏ قال أبو داود وبعد المغرب لا بأس به ‏.‏",
      "text_en": " Jabir bin ‘Abd Allaah said “We were on a journey with the Apostle of Allaah(ﷺ). When we were going to come to our family, he said “Stay till we enter during the night, so that the disheveled woman combs herself and the woman whose husband has been away cleans herself.Abu Dawud aid “Al Zuhri said “(this prohibition applies) when one arrives after the night prayer.Abu dawud said “There is no harm in coming (to one’s family) after the sunset prayer.",
      "chain": [
        "30007",
        "20468",
        "11429",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبيد المحاربي الكوفي، حدثنا أسباط بن محمد، عن سليمان التيمي، عن سيار، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله فضلني على الأنبياء أو قال أمتي على الأمم وأحل لنا الغنائم ‏\"‏ ‏.‏ وفي الباب عن علي وأبي ذر وعبد الله بن عمرو وأبي موسى وابن عباس ‏.‏ قال أبو عيسى حديث أبي أمامة حديث حسن صحيح ‏.‏ وسيار هذا يقال له سيار مولى بني معاوية ‏.‏ وروى عنه سليمان التيمي وعبد الله بن بحير وغير واحد ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"",
      "chain": [
        "30213",
        "20408",
        "11289",
        "11429",
        "405"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن بشير أبي إسماعيل، عن سيار، عن طارق بن شهاب، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من نزلت به فاقة فأنزلها بالناس لم تسد فاقته ومن نزلت به فاقة فأنزلها بالله فيوشك الله له برزق عاجل أو آجل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:                     \"Whoever suffers from destitution and he beseeches the people for it, his destitution shall not end. And whoever suffers from destitution and he beseeches Allah for it, Allah will send provisions to him, sooner or later.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11429",
        "3680",
        "16"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا بشر بن هلال البصري، حدثنا جعفر بن سليمان، عن سعيد الجريري، ح قال وحدثنا هارون بن عبد الله البزاز، حدثنا سيار، حدثنا جعفر بن سليمان، عن سعيد الجريري المعنى، واحد، عن أبي عثمان النهدي، عن حنظلة الأسيدي، وكان، من كتاب النبي صلى الله عليه وسلم أنه مر بأبي بكر وهو يبكي فقال ما لك يا حنظلة قال نافق حنظلة يا أبا بكر نكون عند رسول الله صلى الله عليه وسلم يذكرنا بالنار والجنة كأنا رأى عين فإذا رجعنا إلى الأزواج والضيعة نسينا كثيرا ‏.‏ قال فوالله إنا لكذلك انطلق بنا إلى رسول الله صلى الله عليه وسلم ‏.‏ فانطلقنا فلما رآه رسول الله صلى الله عليه وسلم قال ‏\"‏ ما لك يا حنظلة ‏\"‏ ‏.‏ قال نافق حنظلة يا رسول الله نكون عندك تذكرنا بالنار والجنة كأنا رأى عين فإذا رجعنا عافسنا الأزواج والضيعة ونسينا كثيرا ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو تدومون على الحال الذي تقومون بها من عندي لصافحتكم الملائكة في مجالسكم وفي طرقكم وعلى فرشكم ولكن يا حنظلة ساعة وساعة وساعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu 'Uthman narrated from Hanzalah Al-Usaidi",
      "chain": [
        "30537",
        "20532",
        "11286",
        "11429",
        "20532",
        "11113"
      ]
    },
    {
      "hadith_no": "2696",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا أبو عتاب، سهل بن حماد حدثنا شعبة، عن سيار، قال كنت أمشي مع ثابت البناني فمر على صبيان فسلم عليهم فقال ثابت كنت مع أنس فمر على صبيان فسلم عليهم وقال أنس كنت مع رسول الله صلى الله عليه وسلم فمر على صبيان فسلم عليهم ‏.‏ قال أبو عيسى هذا حديث صحيح رواه غير واحد عن ثابت وروي من غير وجه عن أنس ‏.‏ حدثنا قتيبة حدثنا جعفر بن سليمان عن ثابت عن أنس عن النبي صلى الله عليه وسلم نحوه",
      "text_en": " Narrated Sayyar:                     \"I was walking with Thabit Al-Bunani. He passed by some boys, so he said Salam to them. Then Thabit said: 'I was with Anas when he passed by some boys and gave the Salam to them, and Anas said: I was with the Prophet (ﷺ) when he passed by some boys and he gave the Salam to them.'\"",
      "chain": [
        "20020",
        "11429"
      ]
    },
    {
      "hadith_no": "3444",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا جعفر بن سليمان، عن ثابت، عن أنس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني أريد سفرا فزودني ‏.‏ قال ‏\"‏ زودك الله التقوى ‏\"‏ ‏.‏ قال زدني ‏.‏ قال ‏\"‏ وغفر ذنبك ‏\"‏ ‏.‏ قال زدني بأبي أنت وأمي ‏.‏ قال ‏\"‏ ويسر لك الخير حيثما كنت ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Anas said:                     “A man came to the Messenger of Allah and said: ‘I intend to undertake a journey, so give me provision. He said: ‘May Allah grant you Taqwa as your provision (Zawwdak Allahut-Taqwa).’ He said: ‘Give me more.’ He said: ‘And may He forgive your sin (Wa Ghafara Dhanbak).’ He said: ‘Give me more, may my father be ransomed for you, and my mother.’ He said: ‘And may He make goodness easy for you wherever you are (Wa Yassara Lakal-Khaira Haithu Ma Kunta).’”",
      "chain": [
        "11429",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3462",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا عبد الواحد بن زياد، عن عبد الرحمن بن إسحاق، عن القاسم بن عبد الرحمن، عن أبيه، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقيت إبراهيم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏ قال وفي الباب عن أبي أيوب ‏.‏ قال هذا حديث حسن غريب من هذا الوجه من حديث ابن مسعود ‏.‏",
      "text_en": " Ibn Mas’ud narrated that:                     The Messenger of Allah said: “I met Ibrahim on the night of my ascent, so he said: ‘O Muhammad, recite Salam from me to your nation, and inform them that Paradise has pure soil and delicious water, and that it is a flat treeless plain, and that its sees are: “Glory is to Allah (Subhan Allah) [and] all praise is due to Allah (Al-Hamdulillah) and ‘none has the right to be worshipped but Allah’ (La ilaha Illallah), and Allah is the greatest (Allahu Akbar).”",
      "chain": [
        "11429",
        "20256",
        "11876",
        "19896",
        "16"
      ]
    },
    {
      "hadith_no": "3563",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يحيى بن حسان، حدثنا أبو معاوية، عن عبد الرحمن بن إسحاق، عن سيار، عن أبي وائل، عن علي، رضى الله عنه أن مكاتبا، جاءه فقال إني قد عجزت عن كتابتي فأعني ‏.‏ قال ألا أعلمك كلمات علمنيهن رسول الله صلى الله عليه وسلم لو كان عليك مثل جبل صير دينا أداه الله عنك قال ‏\"‏ قل اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Ali [may Allah be pleased with him] narrated:                     that a Mukatib came to him and said: “Indeed I am not capable of my Kitabah so aid me.” He said: “Should I not teach you words that the Messenger of Allah taught me? If you had a debt upon you similar to the mountain of Sir, Allah would fulfill it for you. He said: ‘Say: O Allah, suffice me with Your lawful against Your prohibited, and make me independent of all those besides You (Allahummakafini Bihalalika An Haramika, Wa Aghnini Bi Fadlika Amman Siwaka).’”",
      "chain": [
        "30025",
        "20300",
        "20354",
        "11876",
        "11429",
        "11353",
        "5"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا جعفر بن سليمان، حدثنا ثابت، وعلي بن زيد، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كم من أشعث أغبر ذي طمرين لا يؤبه له لو أقسم على الله لأبره منهم البراء بن مالك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح حسن من هذا الوجه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"How many are there with dishevelled hair, covered with dust, possessing two cloths, whom no one pays any mind to - if he swears by Allah then He shall fulfill it. Among them is Al-Bara bin Malik.\"",
      "chain": [
        "11429",
        "20532",
        "11269",
        "10664",
        "19"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا الحسن بن إسماعيل بن سليمان، قال حدثنا هشيم، قال أنبأنا سيار، عن يزيد الفقير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعطيت خمسا لم يعطهن أحد قبلي نصرت بالرعب مسيرة شهر وجعلت لي الأرض مسجدا وطهورا فأينما أدرك الرجل من أمتي الصلاة يصلي وأعطيت الشفاعة ولم يعط نبي قبلي وبعثت إلى الناس كافة وكان النبي يبعث إلى قومه خاصة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                      \"The Messenger of Allah (ﷺ) said: 'I have been given five things that were not given to anyone before me: I have been supported with fear being struck into the hearts of my enemy for a distance of one month's travel; the earth has been made a place of prostration and a means of purification for me, so wherever a man of my Ummah is when the time for prayer comes, let him pray; I have been given the intercession which was not given to any Prophet before me; and I have been sent to all of mankind whereas the Prophets before me were sent to their own people.\"",
      "chain": [
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "736",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا الحسن بن إسماعيل بن سليمان، قال حدثنا هشيم، قال حدثنا سيار، عن يزيد الفقير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ جعلت لي الأرض مسجدا وطهورا أينما أدرك رجل من أمتي الصلاة صلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                      \"The Messenger of Allah (ﷺ) said: 'The earth has been made for me a place of prostration and a means of purification, so wherever a man of my Ummah is when the time for prayer comes, let him pray.'\"",
      "chain": [
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "3041",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا علي بن الحسين، قال حدثنا أمية، عن شعبة، عن سيار، عن الشعبي، عن عروة بن مضرس، قال أتيت النبي صلى الله عليه وسلم بجمع فقلت يا رسول الله إني أقبلت من جبلى طيئ لم أدع حبلا إلا وقفت عليه فهل لي من حج فقال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى هذه الصلاة معنا وقد وقف قبل ذلك بعرفة ليلا أو نهارا فقد تم حجه وقضى تفثه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Urwah bin Mudarris said:                     \"I came to the Prohet in Jam (Al-Muzdalifah) and said: 'O Messenger of Allah, I have come from the two mountains of Tai and I did not leave any mountain but I stood on it; is there Hajj for me?' The Messenger of Allah said: 'Whoever offers this prayer with us, and stood before that in Arafatat by night or by day, his Hajj is complete, and he has completed the prescribed duties.'\"",
      "chain": [
        "11045",
        "20020",
        "11429",
        "11052",
        "4068"
      ]
    },
    {
      "hadith_no": "3173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني أحمد بن عثمان بن حكيم، قال حدثنا زكريا بن عدي، قال حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن سيار، ح قال وأنبأنا هشيم، عن سيار، عن جبر بن عبيدة، - وقال عبيد الله عن جبير، - عن أبي هريرة، قال وعدنا رسول الله صلى الله عليه وسلم غزوة الهند فإن أدركتها أنفق فيها نفسي ومالي فإن أقتل كنت من أفضل الشهداء وإن أرجع فأنا أبو هريرة المحرر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) promised us that we would invade India. If I live to see that, I will sacrifice myself and my wealth. If I am killed, I will be one of the best of the martyrs, and if I come back, I will be Abu Hurairah Al-Muharrar.\" [1][1] Al-Muharrar: The one freed (from the Fire).",
      "chain": [
        "30185",
        "30464",
        "30024",
        "11340",
        "11429",
        "20468",
        "11429",
        "18115",
        "11201",
        "13"
      ]
    },
    {
      "hadith_no": "3174",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "حدثني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا هشيم، قال حدثنا سيار أبو الحكم، عن جبر بن عبيدة، عن أبي هريرة، قال وعدنا رسول الله صلى الله عليه وسلم غزوة الهند فإن أدركتها أنفق فيها نفسي ومالي وإن قتلت كنت أفضل الشهداء وإن رجعت فأنا أبو هريرة المحرر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) promised that we would invade India. If I live to see that I will sacrifice myself and my wealth. If I am killed, I will be one of the best of the martyrs, and if I come back, I will be Abu Hurairah Al-Muharrar.\"",
      "chain": [
        "34188",
        "20472",
        "20468",
        "11429",
        "18115",
        "13"
      ]
    },
    {
      "hadith_no": "3548",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يعقوب بن ماهان، - بصري - عن هشيم، قال حدثنا سيار، وحصين، ومغيرة، وداود بن أبي هند، وإسماعيل بن أبي خالد، وذكر، آخرين عن الشعبي، قال دخلت على فاطمة بنت قيس فسألتها عن قضاء، رسول الله صلى الله عليه وسلم عليها فقالت طلقها زوجها البتة فخاصمته إلى رسول الله صلى الله عليه وسلم في السكنى والنفقة قالت فلم يجعل لي سكنى ولا نفقة وأمرني أن أعتد في بيت ابن أم مكتوم ‏.‏",
      "text_en": " It was narrated that Ash-Sha'bi said:                      \"I came to Fatimah bint Qais and asked her about the ruling of the Messenger of Allah concerning her. She said that her husband divorced her irrevocably, and she referred her dispute with him, concerning accommodation and maintenance, to the Messenger of Allah. She said: 'He did not give me (the right to) accommodation and maintenance, and he told me to observe my 'Iddah in the house of Ibn Umm Maktum,'\"",
      "chain": [
        "36690",
        "20468",
        "11429",
        "15097",
        "11072",
        "11585",
        "11418",
        "11052"
      ]
    },
    {
      "hadith_no": "3940",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا علي بن مسلم الطوسي، قال حدثنا سيار، قال حدثنا جعفر، قال حدثنا ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حبب إلى النساء والطيب وجعلت قرة عيني في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah said: 'Women and perfume have been made dear to me, but my comfort has been provided in prayer.'\"",
      "chain": [
        "30261",
        "11429",
        "11407",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4154",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمد بن الوليد، قال حدثنا محمد، قال حدثنا شعبة، عن سيار، ويحيى بن سعيد، أنهما سمعا عبادة بن الوليد، يحدث عن أبيه، - أما سيار فقال عن أبيه، وأما، يحيى فقال عن أبيه، عن جده، - قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في عسرنا ويسرنا ومنشطنا ومكرهنا وأثرة علينا وأن لا ننازع الأمر أهله وأن نقوم بالحق حيثما كان لا نخاف في الله لومة لائم ‏.‏ قال شعبة سيار لم يذكر هذا الحرف حيثما كان وذكره يحيى ‏.‏ قال شعبة إن كنت زدت فيه شيئا فهو عن سيار أو عن يحيى ‏.‏",
      "text_en": " It was narrated from Shu'bah, from Sayyar and Yahya bin Sa'eed that they heard 'Ubadah bin Al-Walid narrating from his father. Sayyar said:                     \"From his father,\" and Yahya said: \"From his father,\" from his grandfather, whom said: 'We pledged to the Messenger of Allah to hear and obey during our hardship and our ease, when we felt energetic and when we felt tired, and when others are preferred over us, that we would not contend with the orders of whomever was entrusted with it, that we would stand firm for the truth wherever it may be, and that we would not fear the blame of any blamer for the sake of Allah.\" (Sahih)Shu'bah said: \"Sayyar did not mention this statement: 'Wherever it may be' while Yahya mentioned it.\" Shu'bah said: \"If I have added anything to it, then it is from Sayyar or from Yahya.\"",
      "chain": [
        "30174",
        "20278",
        "20020",
        "11429",
        "11062",
        "12201",
        "631"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال حدثنا سيار، عن الشعبي، عن جرير بن عبد الله، قال بايعت النبي صلى الله عليه وسلم على السمع والطاعة فلقنني ‏\"‏ فيما استطعت والنصح لكل مسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir bin 'Abdullah said:                     \"I gave my pledge to the Prophet to hear and obey, and he told me to add the words.' In as much as you can, and to be since toward every Muslim\"'. (Sahih) '",
      "chain": [
        "20184",
        "20468",
        "11429",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "4196",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا بشير بن سلمان، عن سيار، عن طارق، عن عبد الله، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ بين يدى الساعة مسخ وخسف وقذف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah that the Prophet (ﷺ) said:                      “Justbefore the Hour comes there will be transformations, the earthcollapsing, and Qadhf. (i.e. the throwing of stones perhaps as ameansof punishment – maybe it refers to landslides).”",
      "chain": [
        "30395",
        "20355",
        "11429",
        "11355",
        "16"
      ]
    }
  ],
  "total_hadiths": 43
}