{
  "id": "11421",
  "name": "Hamran bin Aban حمران بن أبان",
  "full_name": "Hamran bin Aban حمران بن أبان",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Iran"
    },
    "death": {
      "date_hijri": "75",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      " Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "Ally B.Umayya"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      },
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "Ally B.Umayya",
        "ar": "Ally B.Umayya",
        "ckb": "Ally B.Umayya"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [1st Generation]",
        "ar": "تابعي [الجيل الأول]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11328",
      "name": "Jama' bin Shadad al-Maharbi جامع بن شداد المحاربي أبو صخرة",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "2706",
      "name": "Mu'adh bin 'Abdur Rahman bin 'Uthman ( معاذ بن عبد الرحمن بن عثمان التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11206",
      "name": "Ata'a bin Yazid al-Laithi al-Junda'i عطاء بن يزيد الليثي الجندعي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-159",
      "hadith_no": "159",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، قال حدثني إبراهيم بن سعد، عن ابن شهاب، أن عطاء بن يزيد، أخبره أن حمران مولى عثمان أخبره أنه، رأى عثمان بن عفان دعا بإناء، فأفرغ على كفيه ثلاث مرار فغسلهما، ثم أدخل يمينه في الإناء فمضمض، واستنشق، ثم غسل وجهه ثلاثا، ويديه إلى المرفقين ثلاث مرار، ثم مسح برأسه، ثم غسل رجليه ثلاث مرار إلى الكعبين، ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا، ثم صلى ركعتين، لا يحدث فيهما نفسه، غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Humran:                          (the slave of 'Uthman) I saw 'Uthman bin 'Affan asking for a tumbler      of water (and when it was brought) he poured water over his hands and      washed them thrice and then put his right hand in the water container      and rinsed his mouth, washed his nose by putting water in it and then      blowing it out. then he washed his face and forearms up to the      elbows thrice, passed his wet hands over his head and washed his feet      up to the ankles thrice. Then he said, \"Allah's Apostle said 'If      anyone performs ablution like that of mine and offers a two-rak'at      prayer during which he does not think of anything else (not related to     the present prayer) then his past sins will be forgiven.' \"",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11206",
        "11421"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-164",
      "hadith_no": "164",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عطاء بن يزيد، عن حمران، مولى عثمان بن عفان أنه رأى عثمان دعا بوضوء، فأفرغ على يديه من إنائه، فغسلهما ثلاث مرات، ثم أدخل يمينه في الوضوء، ثم تمضمض، واستنشق، واستنثر، ثم غسل وجهه ثلاثا ويديه إلى المرفقين ثلاثا، ثم مسح برأسه، ثم غسل كل رجل ثلاثا، ثم قال رأيت النبي صلى الله عليه وسلم يتوضأ نحو وضوئي هذا وقال ‏\"‏ من توضأ نحو وضوئي هذا ثم صلى ركعتين، لا يحدث فيهما نفسه، غفر الله له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Humran:                     (the freed slave of `Uthman bin `Affan) I saw `Uthman bin `Affan asking (for a tumbler of water) to perform ablution (and when it was brought) he poured water from it over his hands and washed them thrice and then put his right hand in the water container and rinsed his mouth and washed his nose by putting water in it and then blowing it out. Then he washed his face thrice and (then) forearms up to the elbows thrice, then passed his wet hands over his head and then washed each foot thrice. After that `Uthman said, \"I saw the Prophet performing ablution like this of mine, and he said, 'If anyone performs ablution like that of mine and offers a two-rak`at prayer during which he does not think of anything else (not related to the present prayer) then his past sins will be forgiven. '",
      "usc_msa_ref": "165",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11206",
        "11421"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-587",
      "hadith_no": "587",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن أبان، قال حدثنا غندر، قال حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، يحدث عن معاوية، قال إنكم لتصلون صلاة، لقد صحبنا رسول الله صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Muawiya:                     You offer a prayer which I did not see being offered by Allah's Apostle when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).",
      "usc_msa_ref": "561",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "11421",
        "27"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3812",
      "hadith_no": "3812",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عمرو بن عباس، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، عن معاوية  رضى الله عنه  قال إنكم لتصلون صلاة لقد صحبنا النبي صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Humran bin `Abbas:                     Muawiya said (to the people), \"You offer a prayer which we, who were the companions of the Prophet never saw the Prophet offering, and he forbade its offering,\" i.e. the two rak`at after the compulsory `Asr prayer.",
      "usc_msa_ref": "110",
      "chain": [
        "30152",
        "20173",
        "20020",
        "11317",
        "11421",
        "27"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-145",
      "hadith_no": "145",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن إسماعيل بن إبراهيم، - قال أبو بكر حدثنا ابن علية، - عن خالد، قال حدثني الوليد بن مسلم، عن حمران، عن عثمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Uthman that the Messenger of Allah (may peace be upon him) said. He who died knowing (fully well) that there is no god but Allah entered Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20436",
        "20208",
        "11282",
        "10725",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-146",
      "hadith_no": "146",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
      "text_en": " It is narrated on the authority of Humran that he heard Uthman saying this:                      I heard the Messenger of Allah (may peace be upon him) uttering these words (as stated above).",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20212",
        "11282",
        "10725",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-226-2",
      "hadith_no": "226",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن عبد الله بن عمرو بن سرح وحرملة بن يحيى التجيبي قالا أخبرنا ابن وهب، عن يونس، عن ابن شهاب، أن عطاء بن يزيد الليثي، أخبره أن حمران مولى عثمان أخبره أن عثمان بن عفان - رضى الله عنه - دعا بوضوء فتوضأ فغسل كفيه ثلاث مرات ثم مضمض واستنثر ثم غسل وجهه ثلاث مرات ثم غسل يده اليمنى إلى المرفق ثلاث مرات ثم غسل يده اليسرى مثل ذلك ثم مسح رأسه ثم غسل رجله اليمنى إلى الكعبين ثلاث مرات ثم غسل اليسرى مثل ذلك ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ نحو وضوئي هذا ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا ثم قام فركع ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال ابن شهاب وكان علماؤنا يقولون هذا الوضوء أسبغ ما يتوضأ به أحد للصلاة ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman, said:                      Uthman b. 'Affan called for ablution water and this is how he performed the ablution. He washed his hands thrice. He then rinsed his mouth and cleaned his nose with water (three times). He then washed his face three times, then washed his right arm up to the elbow three times, then washed his left arm like that, then wiped his head; then washed his right foot up to the ankle three times, then washed his left foot like that, and then said: I saw the Messenger of Allah (may peace be upon him) perform ablution like this ablution of mine. Then the Messenger of Allah (may peace be upon him) said: He who performs ablution like this ablution of mine and then stood up (for prayer) and offered two rak'ahs of prayer without allowing his thoughts to be distracted, all his previous sins are expiated. Ibn Shihab said: Our scholars remarked: This is the most complete of the ablutions performed for prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20475",
        "11013",
        "11206",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-226-3",
      "hadith_no": "226",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن حمران، مولى عثمان أنه رأى عثمان دعا بإناء فأفرغ على كفيه ثلاث مرار فغسلهما ثم أدخل يمينه في الإناء فمضمض واستنثر ثم غسل وجهه ثلاث مرات ويديه إلى المرفقين ثلاث مرات ثم مسح برأسه ثم غسل رجليه ثلاث مرات ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا ثم صلى ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman said:                      I saw Uthman call for a vessel (of water) and poured water over his hands three times and then washed them. Then he put his right hand in the vessel and rinsed his mouth and cleaned his nose. Then he washed his face three times and his hands up to the elbow three times; then wiped his head, then washed his feet three times. Then he said that the Messenger of Allah (may peace be upon him) had said: He who performed ablution like this ablution of mine and offered two raklahs of prayer without allowing his thoughts to be distracted, all his previous sins would be expiated.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11013",
        "11206",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-227-2",
      "hadith_no": "227",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن محمد بن أبي شيبة، وإسحاق بن إبراهيم الحنظلي، - واللفظ لقتيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن هشام بن عروة، عن أبيه، عن حمران، مولى عثمان قال سمعت عثمان بن عفان، وهو بفناء المسجد فجاءه المؤذن عند العصر فدعا بوضوء فتوضأ ثم قال والله لأحدثنكم حديثا لولا آية في كتاب الله ما حدثتكم إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يتوضأ رجل مسلم فيحسن الوضوء فيصلي صلاة إلا غفر الله له ما بينه وبين الصلاة التي تليها ‏\"‏ ‏.‏",
      "text_en": " Humran. the freed slave of 'Uthman. said:                      I heard from 'Uthman b. 'Affan and he was in the courtyard of the mosque, when the Mu'adhdhin (announcer of the prayer) came to him at the time of afternoon prayer. So the ('Uthman) called for the ablution water and performed ablution and then said: By Allah, I am narrating to you a hadith. If there were not a verse in the Book of Allah, I would have never narrated it to you. I heard Allah's Messenger (may peace be upon him) say: If a Muslim performs ablution and does it well and offers prayer, all his (sins) daring the period from one prayer to another would be pardoned by Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30203",
        "30123",
        "30312",
        "4057",
        "11065",
        "10511",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-227-3",
      "hadith_no": "227",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثنا زهير بن حرب، وأبو كريب قالا حدثنا وكيع، ح وحدثنا ابن أبي عمر، حدثنا سفيان، جميعا عن هشام، بهذا الإسناد وفي حديث أبي أسامة ‏\"‏ فيحسن وضوءه ثم يصلي المكتوبة ‏\"‏ ‏.‏",
      "text_en": " This hadith is also narrated on the authority with the same chain of transmitters and in the hadith of Abu Usama the words are:                     \" He who performed the ablution well and then offered the obligatory prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "30022",
        "30216",
        "20032",
        "30421",
        "20005",
        "11065",
        "10511",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-227-4",
      "hadith_no": "227",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، قال ابن شهاب ولكن عروة يحدث عن حمران، أنه قال فلما توضأ عثمان قال والله لأحدثنكم حديثا والله لولا آية في كتاب الله ما حدثتكموه إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يتوضأ رجل فيحسن وضوءه ثم يصلي الصلاة إلا غفر له ما بينه وبين الصلاة التي تليها ‏\"‏ ‏.‏ قال عروة الآية ‏{‏ إن الذين يكتمون ما أنزلنا من البينات والهدى‏}‏ إلى قوله ‏{‏ اللاعنون‏}‏",
      "text_en": " Humran reported when 'Uthman performed ablution he said:                      By Allah, I am narrating to you a hadith had there not been this verse in the Book of Allah. I would not have narrated it to you. Verily I heard the Messenger of Allah (may peace be upon him) say: Not a person is there who performed ablution, and did it well, then offered prayer, but his sins (which he committed) were not pardoned between the prayer that he offered and the next one. 'Urwa said: The verse is this:\" Those who suppress the clear proofs and the guidance which We have sent down\"... to His words:\" the Cursers\" (ii. 15).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11176",
        "11421"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-229-2",
      "hadith_no": "229",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن عبدة الضبي، قالا حدثنا عبد العزيز، - وهو الدراوردي - عن زيد بن أسلم، عن حمران، مولى عثمان قال أتيت عثمان بن عفان بوضوء فتوضأ ثم قال إن ناسا يتحدثون عن رسول الله صلى الله عليه وسلم أحاديث لا أدري ما هي إلا أني رأيت رسول الله صلى الله عليه وسلم توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ هكذا غفر له ما تقدم من ذنبه وكانت صلاته ومشيه إلى المسجد نافلة ‏\"‏ ‏.‏ وفي رواية ابن عبدة أتيت عثمان فتوضأ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman reported:                      I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (may peace be upon him) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (may peace be upon him) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30423",
        "20167",
        "11163",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-231-2",
      "hadith_no": "231",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء وإسحاق بن إبراهيم جميعا عن وكيع، قال أبو كريب حدثنا وكيع، عن مسعر، عن جامع بن شداد أبي صخرة، قال سمعت حمران بن أبان، قال كنت أضع لعثمان طهوره فما أتى عليه يوم إلا وهو يفيض عليه نطفة ‏.‏ وقال عثمان حدثنا رسول الله صلى الله عليه وسلم عند انصرافنا من صلاتنا هذه - قال مسعر أراها العصر - فقال ‏\"‏ ما أدري أحدثكم بشىء أو أسكت ‏\"‏ ‏.‏ فقلنا يا رسول الله إن كان خيرا فحدثنا وإن كان غير ذلك فالله ورسوله أعلم ‏.‏ قال ‏\"‏ ما من مسلم يتطهر فيتم الطهور الذي كتب الله عليه فيصلي هذه الصلوات الخمس إلا كانت كفارات لما بينها ‏\"‏ ‏.‏",
      "text_en": " Humran b. Abin reported:                      I used to fetch water for 'Uthman for his purification. Never was there a day that he did not take a bath with a small quantity of water. And Uthman said: The Messenger of Allah (may peace be upon him) at the time of our returning from our prayer told us (certain things pertaining to purification). Mis'ar said: I find that it was afternoon prayer. He said: I do not know whether I should tell you a thing or keep quiet. We said: Messenger of Allah, tell us if it is good and if it is otherwise, Allah and His Apostle know better. Upon this he said: A Muslim who purifies (himself) and completes purification as enjoined upon him by Allah and then offers the prayers, that will be expiatious (of his sins he committed) between these (prayers).",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20359",
        "11328",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-231-3",
      "hadith_no": "231",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، قالا جميعا حدثنا شعبة، عن جامع بن شداد، قال سمعت حمران بن أبان، يحدث أبا بردة في هذا المسجد في إمارة بشر أن عثمان بن عفان قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتم الوضوء كما أمره الله تعالى فالصلوات المكتوبات كفارات لما بينهن ‏\"‏ ‏.‏ هذا حديث ابن معاذ وليس في حديث غندر في إمارة بشر ولا ذكر المكتوبات ‏.‏",
      "text_en": " Jami' b. Shaddad reported:                      I heard Humran b. Aban narrate to Abu Burda in this very mosque during the governorship of Bishr that 'Uthman b. Alfan said: The Messenger of Allah (may peace be upon him) observed: He who completed ablution as Allah, the Exalted, enjoined upon him, his obligatory prayers would be explatious (for his minor sins that he would commit) during (the interval) between them. This hadith is transmitted by Ibn Mu'adh, and in the hadith narrated by Ghundar, the words\" during the governorship of Bishr\" are omitted and there is no mention of the obligatory prayers.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "30160",
        "20173",
        "20020",
        "11328",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-232-2",
      "hadith_no": "232",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال وأخبرني مخرمة بن بكير، عن أبيه، عن حمران، مولى عثمان قال توضأ عثمان بن عفان يوما وضوءا حسنا ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ فأحسن الوضوء ثم قال ‏\"‏ من توضأ هكذا ثم خرج إلى المسجد لا ينهزه إلا الصلاة غفر له ما خلا من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of Uthman reported:                      One day Uthman b. Affan performed the ablution well, and then said: I saw Allah's Messenger (may peace be upon him) perform ablution, the best ablution, and then observed: He who performed ablution like this and then went towards the mosque and nothing (but the love of) prayer urged him (to do so), all his previous (minor) sins would be expiated.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20517",
        "11154",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-232-3",
      "hadith_no": "232",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا أخبرنا عبد الله بن وهب، عن عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman b. 'Affan, reported on the authority of 'Uthman b. 'Affan that he heard Allah's Messenger (may peace be upon him) say:                      He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30493",
        "20029",
        "20377",
        "11059",
        "10929",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-245-2",
      "hadith_no": "245",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن معمر بن ربعي القيسي، حدثنا أبو هشام المخزومي، عن عبد الواحد، - وهو ابن زياد - حدثنا عثمان بن حكيم، حدثنا محمد بن المنكدر، عن حمران، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء خرجت خطاياه من جسده حتى تخرج من تحت أظفاره ‏\"‏ ‏.‏",
      "text_en": " Uthman b. 'Affan reported:                      The Messenger of Allah (way peace be upon him) said: He who performed ablution well, his sins would come out from his body, even coming out from under his nails.",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "11034",
        "20256",
        "11889",
        "11048",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-106",
      "hadith_no": "106",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عطاء بن يزيد الليثي، عن حمران بن أبان، مولى عثمان بن عفان قال رأيت عثمان بن عفان توضأ فأفرغ على يديه ثلاثا فغسلهما ثم تمضمض واستنثر ثم غسل وجهه ثلاثا وغسل يده اليمنى إلى المرفق ثلاثا ثم اليسرى مثل ذلك ثم مسح رأسه ثم غسل قدمه اليمنى ثلاثا ثم اليسرى مثل ذلك ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ مثل وضوئي هذا ثم صلى ركعتين لا يحدث فيهما نفسه غفر الله له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Humran b. Abban, the freed slave of ‘Uthman, said :                      I saw ‘ Uthman’ b. ‘Affan while he performed ablution. He poured water over his hands three times and  then washed them. He then rinsed his mouth and then cleansed his nose with water (three times). He then washed his right arm up to the elbow three times, then washed his left arm in a similar manner; then wiped his head; then washed  his right foot three times, then washed his left foot in a similar manner, and then said : I saw the Messenger of Allah (ﷺ) performing ablution like this ablution of mine. Then he (the Prophet) said: He who performs ablution like this ablution of mine and then offered two rakhahs of prayer without allowing his thoughts to be distracted, Allah will pardon all his past sins.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20115",
        "11013",
        "11206",
        "11421"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-107",
      "hadith_no": "107",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الضحاك بن مخلد، حدثنا عبد الرحمن بن وردان، حدثني أبو سلمة بن عبد الرحمن، حدثني حمران، قال رأيت عثمان بن عفان توضأ ‏.‏ فذكر نحوه ولم يذكر المضمضة والاستنشاق وقال فيه ومسح رأسه ثلاثا ثم غسل رجليه ثلاثا ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ هكذا وقال ‏\"‏ من توضأ دون هذا كفاه ‏\"‏ ‏.‏ ولم يذكر أمر الصلاة ‏.‏",
      "text_en": " Humran said :                      I saw ‘Uthman b. ‘Affan performing ablution. He then narrated the same tradition. In this version there is no mention of rinsing the mouth and snuffing up water. This traditions adds : “He wiped his head three times. He then washed his feet three times. He then said : I saw the Messenger of Allah (ﷺ) performing ablution in like manner. He (the Prophet) said: He who performs ablution less than this, it is sufficient for him. 73\tThe narrator did not mention prayer (in this version).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "10567",
        "11421"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2341",
      "hadith_no": "2341",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الصمد بن عبد الوارث، حدثنا حريث بن السائب، قال سمعت الحسن، يقول حدثني حمران بن أبان، عن عثمان بن عفان، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس لابن آدم حق في سوى هذه الخصال بيت يسكنه وثوب يواري عورته وجلف الخبز والماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو حديث الحريث بن السائب ‏.‏ وسمعت أبا داود سليمان بن سلم البلخي يقول قال النضر بن شميل جلف الخبز يعني ليس معه إدام ‏.‏",
      "text_en": " 'Uthman bin 'Affan narrated that the Prophet (s.a.w) said:                     \"There is no right for the son of Adam in other than these things: A house which he lives in, a garment which covers his nakedness, and Jilf (a piece of bread) and water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20250",
        "11016",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-84",
      "hadith_no": "84",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن معمر، عن الزهري، عن عطاء بن يزيد الليثي، عن حمران بن أبان، قال رأيت عثمان بن عفان - رضى الله عنه - توضأ فأفرغ على يديه ثلاثا فغسلهما ثم تمضمض واستنشق ثم غسل وجهه ثلاثا ثم غسل يده اليمنى إلى المرفق ثلاثا ثم اليسرى مثل ذلك ثم مسح برأسه ثم غسل قدمه اليمنى ثلاثا ثم اليسرى مثل ذلك ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ نحو وضوئي ثم قال ‏\"‏ من توضأ نحو وضوئي هذا ثم صلى ركعتين لا يحدث نفسه فيهما بشىء غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Humran bin Aban said:                      \"I saw 'Uthman bin 'Affan, may Allah be pleased with him, performing Wudu'. He poured water on his hands three times and washed them, then he rinsed his mouth and his nose, then he washed his face three times, then he washed his right arm to the elbow three times, then the left likewise. Then he wiped his head, then he washed his right foot three times, then the left likewise. Then he said: 'I saw the Messenger of Allah (ﷺ) performing Wudu' like I have just done. Then he said: 'Whoever performs Wudu' as I have done, then prays two rak'ahs without letting his thoughts wander, his previous sins will be forgiven.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "11206",
        "11421"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-85",
      "hadith_no": "85",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - هو ابن سعيد بن كثير بن دينار الحمصي عن - شعيب، - هو ابن أبي حمزة - عن الزهري، أخبرني عطاء بن يزيد، عن حمران، أنه رأى عثمان دعا بوضوء فأفرغ على يديه من إنائه فغسلها ثلاث مرات ثم أدخل يمينه في الوضوء فتمضمض واستنشق ثم غسل وجهه ثلاثا ويديه إلى المرفقين ثلاث مرات ثم مسح برأسه ثم غسل كل رجل من رجليه ثلاث مرات ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ وضوئي هذا ثم قال ‏\"‏ من توضأ مثل وضوئي هذا ثم قام فصلى ركعتين لا يحدث فيهما نفسه بشىء غفر الله له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humran that he saw 'Uthman call for (water for) Wudu', then he poured water on his hands from the vessel and washed them three times. Then he put his right hand in the water and rinsed his mouth and his nose. Then he washed his face three times, and his arms up to the elbow three times. Then he wiped his head, and washed each of his feet three times. Then he said:                      \"I saw the Messenger of Allah (ﷺ) performing Wudu' like I have just done.\" Then he said: \"Whoever performs Wudu' as I have done, then stands and prays two Rak'ahs without letting his thoughts wander, his previous sins will be forgiven.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11206",
        "11421"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-116",
      "hadith_no": "116",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن يونس، عن ابن شهاب، أن عطاء بن يزيد الليثي، أخبره أن حمران مولى عثمان أخبره أن عثمان دعا بوضوء فتوضأ فغسل كفيه ثلاث مرات ثم مضمض واستنشق ثم غسل وجهه ثلاث مرات ثم غسل يده اليمنى إلى المرفق ثلاث مرات ثم غسل يده اليسرى مثل ذلك ثم مسح برأسه ثم غسل رجله اليمنى إلى الكعبين ثلاث مرات ثم غسل رجله اليسرى مثل ذلك ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ نحو وضوئي هذا ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا ثم قام فركع ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Humran the freed slave of 'Uthman said:                      \"Uthman called for water for Wudu'. He washed his hands three times, then he rinsed his mouth and nose, then he washed his face three times, then washed his right hand up to the elbow three times. Then he washed his left hand likewise. Then he washed his left hand likewise. Then he wiped his head, then he washed his right foot up to the ankle three times, and he washed his left foot likewise, and he washed his left foot likewise. Then he said: 'I saw the Messenger of Allah (ﷺ) performing Wudu' as I have just done.' Then he said: \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' as I have just done, then prayes two Rak'ahs without letting his thoughts wander, his previous sins will be forgiven.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "36017",
        "20029",
        "20475",
        "11013",
        "11206",
        "11421"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-146",
      "hadith_no": "146",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، عن جامع بن شداد، قال سمعت حمران بن أبان، أخبر أبا بردة، في المسجد أنه سمع عثمان، يحدث عن رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أتم الوضوء كما أمره الله عز وجل فالصلوات الخمس كفارات لما بينهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jami' bin Shaddad said:                      \"I heard Humran bin Aban tell Abu Burdah in the Masjid that he heard 'Uthman narrating that the Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' completely as commanded by Allah, the five daily prayers will be an expiation for whatever comes in between them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11328",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-147",
      "hadith_no": "147",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن هشام بن عروة، عن أبيه، عن حمران، مولى عثمان أن عثمان، - رضى الله عنه - قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من امرئ يتوضأ فيحسن وضوءه ثم يصلي الصلاة إلا غفر له ما بينه وبين الصلاة الأخرى حتى يصليها ‏\"‏ ‏.‏",
      "text_en": " 'Uthman said:                      \"I heard the Messenger of Allah (ﷺ) say: 'There is no man who performs Wudu' and does it well, then prays, but when he prays it, he will be forgiven whatever (sins he commits) between that and the next prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11065",
        "10511",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-856",
      "hadith_no": "856",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Whoever does wudu' properly, then walks to (attend) the prescribed prayer, and prays with the people or with the congregation or in the Masjid, Allah will forgive him his sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11059",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-299",
      "hadith_no": "299",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا يحيى بن أبي كثير، حدثني محمد بن إبراهيم، حدثني شقيق بن سلمة، حدثني حمران، مولى عثمان بن عفان قال رأيت عثمان بن عفان قاعدا في المقاعد فدعا بوضوء فتوضأ ثم قال رأيت رسول الله  صلى الله عليه وسلم  في مقعدي هذا توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ مثل وضوئي هذا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ وقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ولا تغتروا ‏\"‏ ‏.‏",
      "text_en": " Humran the freed slave of 'Uthman bin 'Affan said:                     \"I saw 'Uthman bin 'Affan sitting in Maqa'id. He called for water and he performed ablution, the he said: 'I saw the Messenger of Allah sitting in this place where I am sitting, performing ablution as I have done. Then he said: \"Whoever performs ablution as I have done, his previous sins will be forgiven.\" And the Messenger of Allah said: \"And do not be conceited (due to this great virtue).\" (Sahih)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11449",
        "11213",
        "11353",
        "11421"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-300",
      "hadith_no": "300",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب، حدثنا الأوزاعي، حدثني يحيى، حدثني محمد بن إبراهيم، حدثني عيسى بن طلحة، حدثني حمران، عن عثمان، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20024",
        "11449",
        "11213",
        "10573",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-495",
      "hadith_no": "495",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن جامع بن شداد أبي صخرة، قال سمعت حمران، يحدث أبا بردة في المسجد أنه سمع عثمان بن عفان، يحدث عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من أتم الوضوء كما أمره الله فالصلوات المكتوبات كفارات لما بينهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jami' bin Shaddad - AbuSakhrah - said:                     \"I heard Humran telling Abu Burdah in the mosque that he had heard 'Uthman bin 'Affan narrating that the Prophet had said\" 'Whoever performs ablution perfectly as Allah has enjoined, then his prescribed prayer will serve as expiation for what is between them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11328",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 29,
  "grade_display": {
    "en": "Follower (Tabi') [2nd Generation]",
    "ar": "تابعي [الجيل الثاني]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
  }
}