{
  "id": "11420",
  "name": "Hafs bin 'Asim bin 'Umar حفص بن عاصم بن عمر",
  "full_name": "Hafs bin 'Asim bin 'Umar حفص بن عاصم بن عمر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.'Adi",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "563",
      "name": "'Asim bin 'Umar ( عاصم بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "19109",
      "name": "'Ubaidullah bin 'Asim bin 'Umar عبيد الله بن عاصم بن عمر",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "19563",
      "name": "Umm Maskayn أم مسكين بنت عاصم بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [
    {
      "id": "11533",
      "name": "'Isa bin Hafs bin 'Asim bin 'Umar عيسى بن حفص بن عاصم بن عمر - رباح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11905",
      "name": "'Umar bin Hafs bin 'Asim عمر بن حفص بن عاصم بن عمر بن الخطاب",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "563",
      "name": "'Asim bin 'Umar ( عاصم بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "923",
      "name": "al-Qasim bin Makhrama ( القاسم بن مخرمة بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11533",
      "name": "'Isa bin Hafs bin 'Asim bin 'Umar عيسى بن حفص بن عاصم بن عمر - رباح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11905",
      "name": "'Umar bin Hafs bin 'Asim عمر بن حفص بن عاصم بن عمر بن الخطاب",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-584",
      "hadith_no": "584",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن بيعتين وعن لبستين وعن صلاتين نهى عن الصلاة بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس، وعن اشتمال الصماء وعن الاحتباء في ثوب واحد يفضي بفرجه إلى السماء، وعن المنابذة والملامسة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade two kinds of sales, two kinds of dresses, and two prayers. He forbade offering prayers after the Fajr prayer till the rising of the sun and after the `Asr prayer till its setting. He also forbade \"Ishtimal-Assama [??] \" and \"al-Ihtiba\" in one garment in such a way that one's private parts are exposed towards the sky. He also forbade the sales called \"Munabadha\" and \"Mulamasa.\" (See Hadith No. 354 and 355 Vol. 3).",
      "usc_msa_ref": "558",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-588",
      "hadith_no": "588",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سلام، قال حدثنا عبدة، عن عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن صلاتين بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade the offering of two prayers: -1. after the morning prayer till the sunrises. -2. after the `Asr prayer till the sun sets.",
      "usc_msa_ref": "562",
      "chain": [
        "30376",
        "20337",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-660",
      "hadith_no": "660",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله في ظله يوم لا ظل إلا ظله الإمام العادل، وشاب نشأ في عبادة ربه، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل طلبته امرأة ذات منصب وجمال فقال إني أخاف الله‏.‏ ورجل تصدق أخفى حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will give shade, to seven, on the Day when there will be no shade but His. (These seven persons are) a just ruler, a youth who has been brought up in the worship of Allah (i.e. worships Allah sincerely from childhood), a man whose heart is attached to the mosques (i.e. to pray the compulsory prayers in the mosque in congregation), two persons who love each other only for Allah's sake and they meet and part in Allah's cause only, a man who refuses the call of a charming woman of noble birth for illicit intercourse with her and says: I am afraid of Allah, a man who gives charitable gifts so secretly that his left hand does not know what his right hand has given (i.e. nobody knows how much he has given in charity), and a person who remembers Allah in seclusion and his eyes are then flooded with tears.\"",
      "usc_msa_ref": "629",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-663",
      "hadith_no": "663",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي صلى الله عليه وسلم برجل‏.‏ قال وحدثني عبد الرحمن، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني سعد بن إبراهيم، قال سمعت حفص بن عاصم، قال سمعت رجلا، من الأزد يقال له مالك ابن بحينة أن رسول الله صلى الله عليه وسلم رأى رجلا وقد أقيمت الصلاة يصلي ركعتين، فلما انصرف رسول الله صلى الله عليه وسلم لاث به الناس، وقال له رسول الله صلى الله عليه وسلم ‏\"‏ الصبح أربعا، الصبح أربعا ‏\"‏‏.‏ تابعه غندر ومعاذ عن شعبة في مالك‏.‏ وقال ابن إسحاق عن سعد عن حفص عن عبد الله ابن بحينة‏.‏ وقال حماد أخبرنا سعد عن حفص عن مالك‏.‏",
      "text_en": " Narrated Malik Ibn Buhaina:                     Allah's Apostle passed by a man praying two rak`at after the Iqama (had been pronounced). When Allah's Apostle completed the prayer, the people gathered around him (the Prophet) or that man and Allah's Apostle said to him (protesting), Are there four rak`at in Fajr prayer? Are there four rak`at in Fajr prayer?\"",
      "usc_msa_ref": "632",
      "chain": [
        "30105",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sahih-bukhari-1101",
      "hadith_no": "1101",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد، أن حفص بن عاصم، حدثه قال سافر ابن عمر  رضى الله عنهما  فقال صحبت النبي صلى الله عليه وسلم فلم أره يسبح في السفر، وقال الله جل ذكره ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated Hafs bin `Asim:                     Ibn `Umar went on a journey and said, \"I accompanied the Prophet and he did not offer optional prayers during the journey, and Allah says: 'Verily! In Allah's Apostle you have a good example to follow.' \" (33.21)",
      "usc_msa_ref": "205",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11420",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1102",
      "hadith_no": "1102",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن عيسى بن حفص بن عاصم، قال حدثني أبي أنه، سمع ابن عمر، يقول صحبت رسول الله صلى الله عليه وسلم فكان لا يزيد في السفر على ركعتين، وأبا بكر وعمر وعثمان كذلك  رضى الله عنهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I accompanied Allah's Apostle and he never offered more than two rak`at during the journey. Abu Bakr, `Umar and `Uthman used to do the same.",
      "usc_msa_ref": "206",
      "chain": [
        "30175",
        "20031",
        "11533",
        "11420",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1196",
      "hadith_no": "1196",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، عن يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Between my house and my pulpit there is a garden of the gardens of Paradise, and my pulpit is on my fountain tank (i.e. Al-Kauthar).\"",
      "usc_msa_ref": "287",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1444",
      "hadith_no": "1444",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله تعالى في ظله يوم لا ظل إلا ظله إمام عدل، وشاب نشأ في عبادة الله، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل دعته امرأة ذات منصب وجمال فقال إني أخاف الله، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet (p.b.u.h) said, \"Seven people will be shaded by Allah under His shade on the day when there will be no shade except His. They are: (1) a just ruler; (2) a young man who has been brought up in the worship of Allah, (i.e. worship Allah (Alone) sincerely from his childhood), (3) a man whose heart is attached to the mosque (who offers the five compulsory congregational prayers in the mosque); (4) two persons who love each other only for Allah's sake and they meet and part in Allah's cause only; (5) a man who refuses the call of a charming woman of noble birth for an illegal sexual intercourse with her and says: I am afraid of Allah; (6) a person who practices charity so secretly that his left hand does not know what his right hand has given (i.e. nobody knows how much he has given in charity). (7) a person who remembers Allah in seclusion and his eyes get flooded with tears.\"",
      "usc_msa_ref": "504",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1909",
      "hadith_no": "1909",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا أنس بن عياض، قال حدثني عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Verily, Belief returns and goes back to Medina as a snake returns and goes back to its hole (when in danger).",
      "usc_msa_ref": "100",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1921",
      "hadith_no": "1921",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا مسدد، عن يحيى، عن عبيد الله بن عمر، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is a garden from the gardens of Paradise between my house and my pulpit, and my pulpit is on my Lake Fount (Al-Kauthar).",
      "usc_msa_ref": "112",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4514",
      "hadith_no": "4514",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي سعيد بن المعلى، قال كنت أصلي في المسجد فدعاني رسول الله صلى الله عليه وسلم فلم أجبه، فقلت يا رسول الله إني كنت أصلي‏.‏ فقال ‏\"‏ ألم يقل الله ‏{‏استجيبوا لله وللرسول إذا دعاكم‏}‏ ثم قال لي لأعلمنك سورة هي أعظم السور في القرآن قبل أن تخرج من المسجد ‏\"‏‏.‏ ثم أخذ بيدي، فلما أراد أن يخرج قلت له ألم تقل ‏\"‏ لأعلمنك سورة هي أعظم سورة في القرآن ‏\"‏‏.‏ قال ‏\"‏ ‏{‏الحمد لله رب العالمين‏}‏ هي السبع المثاني والقرآن العظيم الذي أوتيته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id bin Al-Mu'alla:                     While I was praying in the Mosque, Allah's Apostle called me but I did not respond to him. Later I said, \"O Allah's Apostle! I was praying.\" He said, \"Didn't Allah say'--\"Give your response to Allah (by obeying Him) and to His Apostle when he calls you.\" (8.24) He then said to me, \"I will teach you a Sura which is the greatest Sura in the Qur'an, before you leave the Mosque.\" Then he got hold of my hand, and when he intended to leave (the Mosque), I said to him, \"Didn't you say to me, 'I will teach you a Sura which is the greatest Sura in the Qur'an?' He said, \"Al-Hamdu-Li l-lah Rabbi-l-`alamin (i.e. Praise be to Allah, the Lord of the worlds) which is Al-Sab'a Al-Mathani (i.e. seven repeatedly recited Verses) and the Grand Qur'an which has been given to me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sahih-bukhari-4692",
      "hadith_no": "4692",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا روح، حدثنا شعبة، عن خبيب بن عبد الرحمن، سمعت حفص بن عاصم، يحدث عن أبي سعيد بن المعلى  رضى الله عنه  قال كنت أصلي فمر بي رسول الله صلى الله عليه وسلم فدعاني فلم آته حتى صليت، ثم أتيته فقال ‏\"‏ ما منعك أن تأتي ألم يقل الله ‏{‏يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم‏}‏ ثم قال لأعلمنك أعظم سورة في القرآن قبل أن أخرج ‏\"‏‏.‏ فذهب رسول الله صلى الله عليه وسلم ليخرج فذكرت له‏.‏",
      "text_en": " Narrated Abu Sa`id bin Al-Mu'alla:                     While I was praying, Allah's Apostle passed me and called me, but I did not go to him until I had finished the prayer. Then I went to him, and he said, \"What prevented you from coming to me? Didn't Allah say:-- \"O you who believe! Answer the call of Allah (by obeying Him) and His Apostle when He calls you?\" He then said, \"I will inform you of the greatest Sura in the Qur'an before I leave (the mosque).\" When Allah's Apostle got ready to leave (the mosque), I reminded him. He said, \"It is: 'Praise be to Allah, the Lord of the worlds.' (i.e. Surat-al-Fatiha) As-sab'a Al-Mathani (the seven repeatedly recited Verses).",
      "usc_msa_ref": "170",
      "chain": [
        "30312",
        "20229",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sahih-bukhari-4750",
      "hadith_no": "4750",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي سعيد بن المعلى، قال مر بي النبي صلى الله عليه وسلم وأنا أصلي فدعاني فلم آته حتى صليت ثم أتيت فقال ‏\"‏ ما منعك أن تأتي ‏\"‏‏.‏ فقلت كنت أصلي‏.‏ فقال ‏\"‏ ألم يقل الله ‏{‏يا أيها الذين آمنوا استجيبوا لله وللرسول‏}‏ ثم قال ألا أعلمك أعظم سورة في القرآن قبل أن أخرج من المسجد ‏\"‏ فذهب النبي صلى الله عليه وسلم ليخرج من المسجد فذكرته فقال ‏\"‏‏{‏الحمد لله رب العالمين‏}‏ هي السبع المثاني والقرآن العظيم الذي أوتيته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Mualla:                     While I was praying, the Prophet passed by and called me, but I did not go to him till I had finished my prayer. When I went to him, he said, \"What prevented you from coming?\" I said, \"I was praying.\" He said, \"Didn't Allah say\" \"O you who believes Give your response to Allah (by obeying Him) and to His Apostle.\" (8.24) Then he added, \"Shall I tell you the most superior Sura in the Qur'an before I go out of the mosque?\" When the Prophet intended to go out (of the Mosque), I reminded him and he said, \"That is: \"Al hamdu-li l-lahi Rabbil-`alamin (Surat-al-fatiha)' which is the seven oft repeated verses (Al-Mathani) and the Grand Qur'an which has been given to me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sahih-bukhari-5057",
      "hadith_no": "5057",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، حدثنا شعبة، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي سعيد بن المعلى، قال كنت أصلي فدعاني النبي صلى الله عليه وسلم فلم أجبه قلت يا رسول الله إني كنت أصلي‏.‏ قال ‏\"‏ ألم يقل الله ‏{‏استجيبوا لله وللرسول إذا دعاكم‏}‏ ثم قال ألا أعلمك أعظم سورة في القرآن قبل أن تخرج من المسجد ‏\"‏‏.‏ فأخذ بيدي فلما أردنا أن نخرج قلت يا رسول الله إنك قلت لأعلمنك أعظم سورة من القرآن‏.‏ قال ‏\"‏‏{‏الحمد لله رب العالمين‏}‏ هي السبع المثاني والقرآن العظيم الذي أوتيته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Mu'alla:                     While I was praying, the Prophet called me but I did not respond to his call. Later I said, \"O Allah's Apostle! I was praying.\" He said, \"Didn't Allah say: 'O you who believe! Give your response to Allah (by obeying Him) and to His Apostle when he calls you'?\" (8.24) He then said, \"Shall I not teach you the most superior Surah in the Qur'an?\" He said, '(It is), 'Praise be to Allah, the Lord of the worlds. ' (i.e., Surat Al-Fatiha) which consists of seven repeatedly recited Verses and the Magnificent Qur'an which was given to me.\"",
      "usc_msa_ref": "528",
      "chain": [
        "30026",
        "20031",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sahih-bukhari-5878",
      "hadith_no": "5878",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن الملامسة، والمنابذة، وعن صلاتين بعد الفجر حتى ترتفع الشمس، وبعد العصر حتى تغيب، وأن يحتبي بالثوب الواحد، ليس على فرجه منه شىء بينه وبين السماء، وأن يشتمل الصماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet had forbidden: (A) the Mulamasa and Munabadha (bargains), (B) the offering of two prayers, one after the morning compulsory prayer till the sun rises, and the others, after the `Asr prayer till the sun sets (C) He also forbade that one should sit wearing one garment, nothing of which covers his private parts (D) and prevent them from exposure to the sky; (E) he also forbade Ishtimalas- Samma'.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6557",
      "hadith_no": "6557",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، عن عبيد الله، قال حدثني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله، رجل ذكر الله ففاضت عيناه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said Allah will give shade to seven (types of people) under His Shade (on the Day of Resurrection). (one of them will be) a person who remembers Allah and his eyes are then flooded with tears.",
      "usc_msa_ref": "486",
      "chain": [
        "30160",
        "20031",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6668",
      "hadith_no": "6668",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا أنس بن عياض، عن عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Between my house and my pulpit there is a garden from amongst the gardens of Paradise, and my pulpit is over my Lake-Fount.\"",
      "usc_msa_ref": "588",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6894",
      "hadith_no": "6894",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا عبد الله، عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله يوم القيامة في ظله، يوم لا ظل إلا ظله إمام عادل، وشاب نشأ في عبادة الله، ورجل ذكر الله في خلاء ففاضت عيناه، ورجل قلبه معلق في المسجد، ورجلان تحابا في الله، ورجل دعته امرأة ذات منصب وجمال إلى نفسها قال إني أخاف الله‏.‏ ورجل تصدق بصدقة فأخفاها، حتى لا تعلم شماله ما صنعت يمينه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Seven (people) will be shaded by Allah by His Shade on the Day of Resurrection when there will be no shade except His Shade. (They will be), a just ruler, a young man who has been brought up in the worship of Allah, a man who remembers Allah in seclusion and his eyes are then flooded with tears, a man whose heart is attached to mosques (offers his compulsory congregational prayers in the mosque), two men who love each other for Allah's Sake, a man who is called by a charming lady of noble birth to commit illegal sexual intercourse with her, and he says, 'I am afraid of Allah,' and (finally), a man who gives in charity so secretly that his left hand does not know what his right hand has given.\"",
      "usc_msa_ref": "798",
      "chain": [
        "30376",
        "20025",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7204",
      "hadith_no": "7204",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا عقبة بن خالد، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن جده، حفص بن عاصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن كنز من ذهب، فمن حضره فلا يأخذ منه شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Soon the river \"Euphrates\" will disclose the treasure (the mountain) of gold, so whoever will be present at that time should not take anything of it.\" Al-A'raj narrated from Abii Huraira that the Prophet said the same but he said, \"It (Euphrates) will uncover a mountain of gold (under it).",
      "usc_msa_ref": "235",
      "chain": [
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7421",
      "hadith_no": "7421",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا مالك، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Between my house and my pulpit there is a garden from one of the gardens of Paradise, and my pulpit is over my Lake-Tank. (Kauthar);",
      "usc_msa_ref": "435",
      "chain": [
        "30153",
        "20033",
        "20001",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7",
      "hadith_no": "7",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، قالا حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كفى بالمرء كذبا أن يحدث بكل ما سمع ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sahih-muslim-8",
      "hadith_no": "8",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن حفص، حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20632",
        "20020",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-391",
      "hadith_no": "391",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Verily the faith would recede to Medina just as the serpent crawls back into its hole.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11201",
        "30212",
        "20331",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-385-2",
      "hadith_no": "385",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا أبو جعفر، محمد بن جهضم الثقفي حدثنا إسماعيل بن جعفر، عن عمارة بن غزية، عن خبيب بن عبد الرحمن بن إساف، عن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، عن جده، عمر بن الخطاب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قال المؤذن الله أكبر الله أكبر ‏.‏ فقال أحدكم الله أكبر الله أكبر ‏.‏ ثم قال أشهد أن لا إله إلا الله ‏.‏ قال أشهد أن لا إله إلا الله ثم قال أشهد أن محمدا رسول الله ‏.‏ قال أشهد أن محمدا رسول الله ‏.‏ ثم قال حى على الصلاة ‏.‏ قال لا حول ولا قوة إلا بالله ‏.‏ ثم قال حى على الفلاح ‏.‏ قال لا حول ولا قوة إلا بالله ‏.‏ ثم قال الله أكبر الله أكبر ‏.‏ قال الله أكبر الله أكبر ‏.‏ ثم قال لا إله إلا الله ‏.‏ قال لا إله إلا الله ‏.‏ من قلبه دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. al-Khattab reported:                      The Messenger of Allah (may peace be upon him) said: When the Mu'adhdhin says: Allah is the Greatest, Allah is the Greatest, and one of you should make this response: Allah is the Greatest, Allah is the Greatest; (and when the Mu'adhdhin) says: I testify that there is no god but Allah, one should respond: I testify that there is no god but Allah, and when he says: I testify that Muhammad is the Messenger of Allah, one should make a response: I testify that Muhammad is Allah's Messenger. When he (the Mu'adhdhin) says: Come to prayer, one should make a response: There is no might and no power except with Allah. When he (the Mu'adhdhin) says: Come to salvation, one should respond: There is no might and no power except with Allah, and when he (the Mu'adhdhin) says: Allah is the Greatest, Allah is the Greatest, then make a response: Allah is the Greatest, Allah is the Greatest. When he (the Mu'adhdhin) says: There is no god but Allah, and he who makes a re- sponse from the heart: There is no god but Allah, he will enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20155",
        "11894",
        "11420",
        "563",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-1611",
      "hadith_no": "1611",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا عيسى بن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، قال صحبت ابن عمر في طريق مكة - قال - فصلى لنا الظهر ركعتين ثم أقبل وأقبلنا معه حتى جاء رحله وجلس وجلسنا معه فحانت منه التفاتة نحو حيث صلى فرأى ناسا قياما فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا لأتممت صلاتي يا ابن أخي إني صحبت رسول الله صلى الله عليه وسلم في السفر فلم يزد على ركعتين حتى قبضه الله وصحبت أبا بكر فلم يزد على ركعتين حتى قبضه الله وصحبت عمر فلم يزد على ركعتين حتى قبضه الله ثم صحبت عثمان فلم يزد على ركعتين حتى قبضه الله وقد قال الله ‏{‏ لقد كان لكم في رسول الله أسوة حسنة‏}‏ ‏.‏",
      "text_en": " Hafs b. 'Asim said:                      I accompanied Ibn 'Umar on the road to Mecca and he led us in two rak'ahs at the noon prayer, then he went forward and we too went along with him to a place where he alighted, and he sat and we sat along with him, and he cast a glance to the side where he said prayer and he saw people standing and asked: What are they doing? I said: They are engaged in glorifying Allah, offering Sunnah prayer. He said: If I had done so I would have perfected my prayer; O my nephew! I accompanied the Messenger of Allah (may peace be upon him) on a journey, and he made no addittion to two rak'ahs, till Allah called him. I accompanied Abu Bakr and he made no addition to two rak'ahs till Allah caused him to die. I accompanied 'Umar and he made no addition to two rak'ahs till Allah caused him to die. I accompanied 'Uthman and he made no addition to two rak'ahs, till Allah caused him to die, and Allah has said:\" There is a model pattern for you in the Messenger of Allah\" (al-Qur'an, xxxiii. 21).",
      "usc_msa_ref": "",
      "chain": [
        "11533",
        "11420"
      ]
    },
    {
      "id": "sahih-muslim-1612",
      "hadith_no": "1612",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يزيد، - يعني ابن زريع - عن عمر بن محمد، عن حفص بن عاصم، قال مرضت مرضا فجاء ابن عمر يعودني قال وسألته عن السبحة، في السفر فقال صحبت رسول الله صلى الله عليه وسلم في السفر فما رأيته يسبح ولو كنت مسبحا لأتممت وقد قال الله تعالى ‏{‏ لقد كان لكم في رسول الله إسوة حسنة‏}‏",
      "text_en": " Hafs b. 'Asim reported:                      I fell ill and lbn 'Umar came to inquire after my health, and I asked him about the glorification of Allah (i. e. prayer) while travelling. Thereupon he said: I accompanied the Messenger of Allah (may peace be upon him) on a journey but I did not see him glorifying Him, and were I to glorify (Him). I would have completed the prayer. Allah, the Exalted, has said:\" Verily there is a model pattern for you in the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20304",
        "11530",
        "11420"
      ]
    },
    {
      "id": "sahih-muslim-1626",
      "hadith_no": "1626",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن خبيب بن عبد الرحمن، سمع حفص بن عاصم، عن ابن عمر، قال صلى النبي صلى الله عليه وسلم بمنى صلاة المسافر وأبو بكر وعمر وعثمان ثماني سنين أو قال ست سنين ‏.‏ قال حفص وكان ابن عمر يصلي بمنى ركعتين ثم يأتي فراشه ‏.‏ فقلت أى عم لو صليت بعدها ركعتين ‏.‏ قال لو فعلت لأتممت الصلاة ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The Apostle of Allah (may peace be upon him) said in Mina the prayer of a traveller (short prayer) ; Abu Bakr and 'Umar did the same and 'Uthmia did it for eight years or six years. Hafs (one of the narrators) said: Ibn 'Umar would also say two rak'ahs at Mina and then go to bed. I said to him: O uncle, I wish you could have said two rak'ahs (of Sunnah prayer after shorenting the Fard prayer). He said: Were I to do that, I would have completed the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11159",
        "11420",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1682",
      "hadith_no": "1682",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، أن رسول الله صلى الله عليه وسلم مر برجل يصلي وقد أقيمت صلاة الصبح فكلمه بشىء لا ندري ما هو فلما انصرفنا أحطنا نقول ماذا قال لك رسول الله صلى الله عليه وسلم قال قال لي ‏\"‏ يوشك أن يصلي أحدكم الصبح أربعا ‏\"‏ ‏.‏ قال القعنبي عبد الله بن مالك ابن بحينة عن أبيه ‏.‏ قال أبو الحسين مسلم وقوله عن أبيه في هذا الحديث خطأ ‏.‏",
      "text_en": " 'Abdullah b. Malik b. Buhaina reported:                      The Messenger of Allah (may peace be upon him) happened to pass by a person who was busy in praying while the (Fard of the) dawn prayer had commenced. He said something to him, which we do not know what it was. When we turned back we surrounded him and said: What is it that the Messenger of Allah (may peace be upon him) said to you? He replied: He (the Holy Prophet) had said to me that he perceived as if one of them was about to observe four (rak'ahs) of the dawn prayer. Qa'nabi reported that 'Abdullah b. Malik b. Buhaina narrated it on the authority of his father. (Abu'l-Husain Muslim said): His assertion that he has narrated this hadith on the authority of his father is not correct.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sahih-muslim-1683",
      "hadith_no": "1683",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن سعد بن إبراهيم، عن حفص بن عاصم، عن ابن بحينة، قال أقيمت صلاة الصبح فرأى رسول الله صلى الله عليه وسلم رجلا يصلي والمؤذن يقيم فقال ‏\"‏ أتصلي الصبح أربعا ‏\"‏ ‏.‏",
      "text_en": " Ibn Buhaina reported:                      The dawn prayer had commenced when the Messen- ger of Allah (may peace be upon him) saw a person observing prayer, whereas the Mu'adhdhin had pronounced the Iqama. Upon this he (the Holy Prophet) remarked: Do you say four (rak'ahs) of Fard in the dawn prayer?",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sahih-muslim-2427",
      "hadith_no": "2427",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني زهير بن حرب، ومحمد بن المثنى، جميعا عن يحيى القطان، - قال زهير حدثنا يحيى بن سعيد، - عن عبيد الله، أخبرني خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله في ظله يوم لا ظل إلا ظله الإمام العادل وشاب نشأ بعبادة الله ورجل قلبه معلق في المساجد ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه ورجل دعته امرأة ذات منصب وجمال فقال إني أخاف الله ‏.‏ ورجل تصدق بصدقة فأخفاها حتى لا تعلم يمينه ما تنفق شماله ورجل ذكر الله خاليا ففاضت عيناه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) had said:                      Seven are (the persons) whom Allah would give protection with His Shade on the Day when there would be no shade but that of Him (i. e. on the Day of Judgment, and they are): a just ruler, a youth who grew up with the worship of Allah; a person whose heart is attached to the mosques; two persons who love and meet each other and depart from each other for the sake of Allah; a man whom a beautiful woman of high rank seduces (for illicit relation), but he (rejects this offer by saying):\" I fear Allah\" ; a person who gives charity and conceals it (to such an extent) that the right hand does not know what the left has given: and a person who remembered Allah in privacy and his eyes shed tears.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "20031",
        "20321",
        "11062",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2428",
      "hadith_no": "2428",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي سعيد الخدري، - أو عن أبي هريرة، - أنه قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث عبيد الله ‏.‏ وقال ‏\"‏ ورجل معلق بالمسجد إذا خرج منه حتى يعود إليه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated, on the authority, of Abu Huraira (with this change of words).\" A person whose heart is attached to the mosque when he goes out of it till he returns to it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11159",
        "11420",
        "38",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3436",
      "hadith_no": "3436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد، عن عبيد، الله ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص، بن عاصم عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ومنبري على حوضي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      That which exists between my house and my pulpit is a garden from the gardens of Paradise, and my pulpit is upon my cistern.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "20031",
        "11201",
        "30212",
        "20331",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3876",
      "hadith_no": "3876",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، وأبو أسامة ح وحدثنا محمد، بن عبد الله بن نمير حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، كلهم عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) a hadith like this through another chain cf transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20318",
        "30212",
        "20331",
        "30170",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7340",
      "hadith_no": "7340",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وعبد الله بن نمير، وعلي بن مسهر، عن عبيد الله بن عمر، ح وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا  عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سيحان وجيحان والفرات والنيل كل من أنهار الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Saihan, Jaihan, Euphrates and Nile are all among the rivers of Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20331",
        "20345",
        "11201",
        "30212",
        "20352",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7456",
      "hadith_no": "7456",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو مسعود، سهل بن عثمان حدثنا عقبة بن خالد السكوني، عن عبيد، الله عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن كنز من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The Last Hour would not come unless the Euphrates would uncover a treasure of gold, so he who finds it should not take anything out of that.",
      "usc_msa_ref": "",
      "chain": [
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-527",
      "hadith_no": "527",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثني محمد بن جهضم، حدثنا إسماعيل بن جعفر، عن عمارة بن غزية، عن خبيب بن عبد الرحمن بن إساف، عن حفص بن عاصم بن عمر، عن أبيه، عن جده، عمر بن الخطاب - رضي الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال المؤذن الله أكبر الله أكبر فقال أحدكم الله أكبر الله أكبر فإذا قال أشهد أن لا إله إلا الله ‏.‏ قال أشهد أن لا إله إلا الله ‏.‏ فإذا قال أشهد أن محمدا رسول الله قال أشهد أن محمدا رسول الله ثم قال حى على الصلاة قال لا حول ولا قوة إلا بالله ثم قال حى على الفلاح قال لا حول ولا قوة إلا بالله ثم قال الله أكبر الله أكبر قال الله أكبر الله أكبر ثم قال لا إله إلا الله قال لا إله إلا الله من قلبه دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " ‘Umar b. al-khattab reported the Messenger of Allah (May peace be upon him) as saying; When the MU’ADHDHIN says:                      “Allah is most great, Allah is most great”, and one of you says in response: “Allah is most great”, Allah is most great; then says: “ I testify tht there is no god but Allah”, and he says in response: “I testify that there is no god but Allah”, then say:” I testify that Muhammad is the Messenger of Allah”, and he makes the response: “ I testify that Muhammad is the Messenger of Allah”, then says: “Come to prayer”, and he makes the response: “There is no might and no power except in Allah”: then says: “ Allah is most great, Allah is most great”, and he makes the response: “Allah is most great”, then says: “There is no god but Allah”, if he says this from his heart, he enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30162",
        "20155",
        "11894",
        "11420",
        "563",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-1223",
      "hadith_no": "1223",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا القعنبي، حدثنا عيسى بن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، قال صحبت ابن عمر في طريق - قال - فصلى بنا ركعتين ثم أقبل فرأى ناسا قياما فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا أتممت صلاتي يا ابن أخي إني صحبت رسول الله صلى الله عليه وسلم في السفر فلم يزد على ركعتين حتى قبضه الله عز وجل وصحبت أبا بكر فلم يزد على ركعتين حتى قبضه الله عز وجل وصحبت عمر فلم يزد على ركعتين حتى قبضه الله تعالى وصحبت عثمان فلم يزد على ركعتين حتى قبضه الله تعالى وقد قال الله عز وجل ‏{‏ لقد كان لكم في رسول الله أسوة حسنة ‏}‏ ‏.‏",
      "text_en": " Narrated Hafs b. 'Asim:                     I accompanied Ibn 'Umar on the way (on a journey). He led us in two rak'ah's of (the noon) prayer. Then he proceeded and saw some people standing. He asked: What are they doing ? I replied: They are glorifying Allah (i.e. offering supererogatory prayer). He said: If I had offered the supererogatory prayer (while travelling), I would have completed prayer, my cousin. I accompanied the Messenger of Allah (ﷺ) during the journey, he did not pray more than two raka'at until his death. I also accompanied Abu Bakr, and he prayed two raka'at and nothing more until he died. I also accompanied 'Umar, and he prayed two raka'at and nothing more until he died. I also accompanied 'Uthman, and he prayed two raka'at and nothing more until he died. Indeed Allah, the Exalted, said: \"Certainly you have in the Messenger of Allah an excellent exemplar\"",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "11533",
        "11420"
      ]
    },
    {
      "id": "sunan-abi-daud-1458",
      "hadith_no": "1458",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا خالد، حدثنا شعبة، عن خبيب بن عبد الرحمن، قال سمعت حفص بن عاصم، يحدث عن أبي سعيد بن المعلى، أن النبي صلى الله عليه وسلم مر به وهو يصلي فدعاه قال فصليت ثم أتيته قال فقال ‏\"‏ ما منعك أن تجيبني ‏\"‏ ‏.‏ قال كنت أصلي ‏.‏ قال ‏\"‏ ألم يقل الله عز وجل ‏{‏ يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم ‏}‏ لأعلمنك أعظم سورة من القرآن أو في القرآن ‏\"‏ ‏.‏ شك خالد ‏\"‏ قبل أن أخرج من المسجد ‏\"‏ ‏.‏ قال قلت يا رسول الله قولك ‏.‏ قال ‏\"‏ ‏{‏ الحمد لله رب العالمين ‏}‏ وهي السبع المثاني التي أوتيت والقرآن العظيم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id b. al-Mu'alla said that when he was praying the Prophet (ﷺ) passed by him and he called him. He said:                      I prayed ant then I came to him. He asked: What prevented you from answering me ? He replied: I was praying. He said: Has not Allah said: \"O you who believe, respond to Allah and the Apostle when he calls you to that which gives you life ? (8:24) Let me teach you the greatest surah from the Qur'an or in the Qur'an (the narrator Khalid doubted) before I leave the mosque. I said: (I shall memorize) your saying. He said: It is: \"Praise be to Allah, the Lord of the Universe\" which is the seven oft-repeated verses, and the mighty Qur'an.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20423",
        "20020",
        "11159",
        "11420",
        "1535"
      ]
    },
    {
      "id": "sunan-abi-daud-4313",
      "hadith_no": "4313",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثني عقبة بن خالد السكوني، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن كنز من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The Euphrates is soon to uncover a treasure of the gold, but those who are present must not take any of it.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4992",
      "hadith_no": "4992",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا محمد بن الحسين، حدثنا علي بن حفص، قال حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، - قال ابن حسين في حديثه - عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ كفى بالمرء إثما أن يحدث بكل ما سمع ‏\"‏ ‏.‏ قال أبو داود ولم يذكر حفص أبا هريرة ‏.‏ قال أبو داود ولم يسنده إلا هذا الشيخ يعني علي بن حفص المدائني ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is enough falsehood for a man to relate everything he hears.Abu Dawud said: Hafs did not mention Abu Hurairah (in his version).Abu Dawud said: No other transmitter except this old man, that is, 'Ali b. Hafs al-Mada'ini related the perfect chain of this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "20632",
        "20020",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2391",
      "hadith_no": "2391",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أو عن أبي سعيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله في ظله يوم لا ظل إلا ظله إمام عادل وشاب نشأ بعبادة الله ورجل كان قلبه معلقا بالمسجد إذا خرج منه حتى يعود إليه ورجلان تحابا في الله فاجتمعا على ذلك وتفرقا ورجل ذكر الله خاليا ففاضت عيناه ورجل دعته امرأة ذات حسب وجمال فقال إني أخاف الله ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهكذا روي هذا الحديث عن مالك بن أنس من غير وجه مثل هذا وشك فيه وقال عن أبي هريرة أو عن أبي سعيد وعبيد الله بن عمر رواه عن خبيب بن عبد الرحمن ولم يشك فيه يقول عن أبي هريرة ‏.‏  حدثنا سوار بن عبد الله العنبري، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد، عن عبيد الله بن عمر، حدثني خبيب، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو حديث مالك بن أنس بمعناه إلا أنه قال ‏\"‏ كان قلبه معلقا بالمساجد ‏\"‏ ‏.‏ وقال ‏\"‏ ذات منصب وجمال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hafs bin 'Asim narrated from Abu Hurairah or Abu Sa'eed that the Messenger of Allah (s.a.w) said:                     \"Seven shall be shaded by Allah under his shade on a day in which there is no shade except His Shade: A just Imam, a young person raised upon worshiping  Allah, a man whose heart is attached to the Masjid when he leaves from it until he returns from it, two men who love each other for Allah's sake, coming together upon that, and parting upon that, a man who remembers Allah in privacy and his eyes swell with tears, a man invited by a woman of status and beauty, but he says: 'I fear Allah, Mighty and Sublime is He,' and a man who conceals the charity he gives such that his left hand does not know what his right hand has spent.\"",
      "usc_msa_ref": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11159",
        "11420",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2769",
      "hadith_no": "2769",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، حدثنا عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن جده، حفص بن عاصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات يحسر عن كنز من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"The Euphrates shall soon uncover a treasure of gold, so whoever witnesses it, let him not take anything from it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-867",
      "hadith_no": "867",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن سعد بن إبراهيم، عن حفص بن عاصم، عن ابن بحينة، قال أقيمت صلاة الصبح فرأى رسول الله صلى الله عليه وسلم رجلا يصلي والمؤذن يقيم فقال ‏\"‏ أتصلي الصبح أربعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Buhainah said:                      \"The Iqamah for Subh prayer was said, and the Messenger of Allah (ﷺ) saw a man praying while the Mu'adhdhin saying the Iqamah. He said: 'Are you praying Subh with fourRak'ahs?\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sunan-an-nasai-913",
      "hadith_no": "913",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن خبيب بن عبد الرحمن، قال سمعت حفص بن عاصم، يحدث عن أبي سعيد بن المعلى، أن النبي صلى الله عليه وسلم مر به وهو يصلي فدعاه - قال - فصليت ثم أتيته فقال ‏\"‏ ما منعك أن تجيبني ‏\"‏ قال كنت أصلي ‏.‏ قال ‏\"‏ ألم يقل الله عز وجل ‏{‏ يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم ‏}‏ ألا أعلمك أعظم سورة قبل أن أخرج من المسجد ‏\"‏ ‏.‏ قال فذهب ليخرج قلت يا رسول الله قولك ‏.‏ قال ‏\"‏ الحمد لله رب العالمين هي السبع المثاني الذي أوتيت والقرآن العظيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed bin Al-Mu'alla that:                     The Prophet (ﷺ) passed by him when he was praying, and called him. He said: \"I finished praying, then I came to him, and he said: 'What kept you from answering me?' He said: 'I was praying.' He said: 'Does not Allah say: O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he calls you to that which will give you life? Shall I not teach you the greatest surah before I leave the masjid?' Then he went to leave, and I said: 'O Messenger of Allah, what about what you said?' He said: \"All praise and thanks be to Allah, Lord of all that exists. These are the seven oft-recited that I have been given, and the Grand Quran.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sunan-an-nasai-1458",
      "hadith_no": "1458",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرني نوح بن حبيب، قال حدثنا يحيى بن سعيد، قال حدثنا عيسى بن حفص بن عاصم، قال حدثني أبي قال، كنت مع ابن عمر في سفر فصلى الظهر والعصر ركعتين ثم انصرف إلى طنفسة له فرأى قوما يسبحون قال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مصليا قبلها أو بعدها لأتممتها صحبت رسول الله صلى الله عليه وسلم فكان لا يزيد في السفر على الركعتين وأبا بكر حتى قبض وعمر وعثمان - رضى الله عنهم - كذلك ‏.‏",
      "text_en": " 'Eisa bin Hafs bin 'Asim said:                     \"My father told me: 'I was with Ibn Umar on a journey, and he prayed Zuhr and 'Asr with two rak'ahs each, then he went and sat on his carpet. He saw some people offering voluntary prayers and said: What are these people doing? I said: They are offering voluntary prayers. He said: If I had wanted to pray before and after (the obligatory prayer) I would have offered it in full. I accompanied the Messenger of Allah (ﷺ) and he did not pray more than two rak'ahs when traveling, and Abu Bakr (did likewise) until he died, as did 'Umar and 'Uthman, may Allah (SWT) be pleased with them all.\"",
      "usc_msa_ref": "",
      "chain": [
        "38671",
        "20031",
        "11533",
        "11420"
      ]
    },
    {
      "id": "sunan-an-nasai-4517",
      "hadith_no": "4517",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى عن بيعتين أما البيعتان فالمنابذة والملامسة وزعم أن الملامسة أن يقول الرجل للرجل أبيعك ثوبي بثوبك ولا ينظر واحد منهما إلى ثوب الآخر ولكن يلمسه لمسا وأما المنابذة أن يقول أنبذ ما معي وتنبذ ما معك ليشتري أحدهما من الآخر ولا يدري كل واحد منهما كم مع الآخر ونحوا من هذا الوصف ‏.‏",
      "text_en": " It was narrated from Hafs bin 'Asim, from Abu Hurairah that the Prophet forbade two kids of transactions:                      Munabadhah and Mulamasha. And he said that Mulamasah means when one man says to another: \"I will sell you my garment for your garment,\" and neither of them looks at the garment of the others, rather he just touches it. And Munabadhah is when he says: \"I will throw what I have and you throw what you have,\" so that they buy from one another, and neither of them knows how much the other has, and so on.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5380",
      "hadith_no": "5380",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله عز وجل يوم القيامة يوم لا ظل إلا ظله إمام عادل وشاب نشأ في عبادة الله عز وجل ورجل ذكر الله في خلاء ففاضت عيناه ورجل كان قلبه معلقا في المسجد ورجلان تحابا في الله عز وجل ورجل دعته امرأة ذات منصب وجمال إلى نفسها فقال إني أخاف الله عز وجل ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما صنعت يمينه ‏\"‏‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Messenger of Allah [SAW] said: \"There are seven whom Allah, the Mighty and Sublime, will shade with His shade on the Day of Resurrection, the Day when there will be no shade but His: A just ruler, a young man who grows up worshipping Allah, the Mighty and Sublime; a man who remembers Allah when he is alone and his eyes flow (with tears); a man whose heart is attached to the Masjid; two men who love each other for the sake of Allah, the Mighty and Sublime; a man who is called (to commit sin) by a woman of high status and beauty, but he says: 'I fear Allah'; and a man who gives charity and conceals it, so that his left hand does not know what his right hand is doing.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1124",
      "hadith_no": "1124",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا أبو عامر، عن عيسى بن حفص بن عاصم بن عمر بن الخطاب، حدثني أبي قال، كنا مع ابن عمر في سفر فصلى بنا ثم انصرفنا معه وانصرف ‏.‏ قال فالتفت فرأى أناسا يصلون فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا لأتممت صلاتي يا ابن أخي إني صحبت رسول الله  صلى الله عليه وسلم  فلم يزد على ركعتين في السفر حتى قبضه الله ثم صحبت أبا بكر فلم يزد على ركعتين ثم صحبت عمر فلم يزد على ركعتين ثم صحبت عثمان فلم يزد على ركعتين حتى قبضهم الله والله يقول ‏{لقد كان لكم في رسول الله أسوة حسنة ‏}‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Isa bin Hafs bin ‘Asim bin ‘Umar bin Khattabthat his father told him:                      “We were with Ibn ‘Umar on a journey,and he led us in prayer. Then we finished with him and he finishedturning around, and saw some people praying. He said: ‘What arethese people doing?’ I said: ‘Glorifying Allah.’* He said: ‘IfI wanted to glorify Allah (perform voluntary prayer) I would havecompleted my prayer. O son of my brother! I accompanied the Messengerof Allah (ﷺ) and he never prayed more than two Rak’ah when he wastraveling, until Allah took his soul. Then I accompanied Abu Bakr andhe never prayed more than two Rak’ah (when he was traveling), untilAllah took his soul. Then I accompanied ‘Umar and he never prayedmore than two Rak’ah, until Allah took his soul. Then I accompanied‘Uthman and he never prayed more than two Rak’ah, until Allahtook his soul. Allah says: ‘Indeed in the Messnger of Allah(Muhammad (ﷺ)) you have a good example to follow.’” [33:21]",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "20443",
        "11533",
        "11420"
      ]
    },
    {
      "id": "sunan-ibn-majah-1208",
      "hadith_no": "1208",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي  صلى الله عليه وسلم  برجل وقد أقيمت صلاة الصبح وهو يصلي فكلمه بشىء لا أدري ما هو فلما انصرف أحطنا به نقول له ماذا قال لك رسول الله  صلى الله عليه وسلم  قال قال لي ‏\"‏ يوشك أحدكم أن يصلي الفجر أربعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Malik bin Buhainah said:                      “TheProphet(ﷺ) passed by a man who was praying when the Iqamah for Subhprayerhad been called, and he said something to him, I do not knowwhat hesaid. When he finished, we surrounded the man and asked him:‘Whatdid the Messenger of Allah (ﷺ) say to you?’ He said: ‘He saidto me: “Soon one of you will pray Fajr with four Rak’ah.’”",
      "usc_msa_ref": "",
      "chain": [
        "32032",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "id": "sunan-ibn-majah-1306",
      "hadith_no": "1306",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  نهى عن صلاتين عن الصلاة بعد الفجر حتى تطلع الشمس وبعد العصر حتى تغرب الشمس ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)forbadetwo prayers:                      prayer after the Fajr until the sun has risen,andprayer after ‘Asr until the sun has set.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2253",
      "hadith_no": "2253",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  عن بيعتين عن الملامسة والمنابذة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) forbade two kinds of transactions: Mulimasah and Mundbadhah.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3230",
      "hadith_no": "3230",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏ ‏.‏",
      "text_en": " it wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Faith will retreat to Al-Madinah as a snake retreats to itshole.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3689",
      "hadith_no": "3689",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، ‏.‏ أن رسول الله  صلى الله عليه وسلم  نهى عن لبستين عن اشتمال الصماء وعن الاحتباء في الثوب الواحد يفضي بفرجه إلى السماء ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)forbadetwo kinds of dress:                      Ishtimalus-Samma’ and Ihtiba’, exposingone’sprivate part to the sky.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11201",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sunan-ibn-majah-3785-2",
      "hadith_no": "3785",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي سعيد بن المعلى، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا أعلمك أعظم سورة في القرآن قبل أن أخرج من المسجد ‏\"‏ ‏.‏ قال فذهب النبي  صلى الله عليه وسلم  ليخرج فأذكرته فقال ‏\"‏ ‏{‏ الحمد لله رب العالمين}‏ وهي السبع المثاني والقرآن العظيم الذي أوتيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed bin Mu'alla said:                     \"The Messenger of Allah(ﷺ) said to me: 'Shall I not teach you the greatest Surah in the QUran before I leave the masjid?' Then the Propeht(ﷺ) went to leave, so I reminded him, and he said: Al-hamdulillahi Rabbil-Alameen (All the praise is to Allah, the Lord of all that exists). It is the Seven Oft-Recited Verses, and it is the Grand Quran that has been given to me.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11159",
        "11420"
      ]
    }
  ],
  "total_hadiths": 54
}