{
  "id": "11433",
  "name": "'Abdullah bin Tawus عبد الله بن طاوس",
  "full_name": "'Abdullah bin Tawus عبد الله بن طاوس",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yemen"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Yemen"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Yemeni",
      "Client",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "28521",
      "name": "Muhammad bin 'Abdullah bin Tawus محمد بن عبد الله بن طاوس",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10949",
      "name": "'Ali bin 'Abdullah bin 'Abbas علي بن عبد الله بن عباس بن عبد المطلب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19944",
      "name": "al-Muttalib bin 'Abdullah bin Hantab المطلب بن عبد الله بن حنطب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11102",
      "name": "Wahb bin Munabbih al-Abnavi وهب بن منبه الأبناوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11709",
      "name": "'Ikrama bin Khalid bin al-Aas عكرمة بن خالد بن العاص بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "28521",
      "name": "Muhammad bin 'Abdullah bin Tawus محمد بن عبد الله بن طاوس",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10636",
      "name": "Zm'h bin Salah زمعة بن صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24459",
      "name": "al-Nadr bin Kathir al-Sa'dy النضر بن كثير السعدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "329",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال رخص للحائض أن تنفر، إذا حاضت‏.‏   وكان ابن عمر يقول في أول أمره إنها لا تنفر‏.‏ ثم سمعته يقول تنفر إن رسول الله صلى الله عليه وسلم رخص لهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar formerly used to say that she should not leave but later on I heard him saying, \"She may leave, since Allah's Apostle gave them the permission to leave (after Tawaf-Al-Ifada).\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17",
        "18"
      ]
    },
    {
      "hadith_no": "812",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، رضى الله عنهما قال قال النبي صلى الله عليه وسلم ‏\"‏ أمرت أن أسجد على سبعة أعظم على الجبهة  وأشار بيده على أنفه  واليدين، والركبتين وأطراف القدمين، ولا نكفت الثياب والشعر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I have been ordered to prostrate on seven bones i.e. on the forehead along with the tip of the nose and the Prophet pointed towards his nose, both hands, both knees and the toes of both feet and not to gather the clothes or the hair.\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "897",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا وهيب، قال حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون السابقون يوم القيامة، أوتوا الكتاب من قبلنا، وأوتيناه من بعدهم، فهذا اليوم الذي اختلفوا فيه فهدانا الله، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏ فسكت‏.‏ ثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏\tثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said \"We are the last (to come amongst the nations)      but (will be) the foremost on the Day of Resurrection. They were given     the Holy Scripture before us and we were given the Quran after them.      And this was the day (Friday) about which they differed and Allah gave     us the guidance (for that). So tomorrow (i.e. Saturday) is the Jews'      (day), and the day after tomorrow (i.e. Sunday) is the Christians'.\"      The Prophet (p.b.u.h) remained silent (for a while) and then said, \"It     is obligatory for every Muslim that he should take a bath once in      seven days, when he should wash his head and body.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1339",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  قال ‏\"‏ أرسل ملك الموت إلى موسى  عليهما السلام  فلما جاءه صكه فرجع إلى ربه فقال أرسلتني إلى عبد لا يريد الموت‏.‏ فرد الله عليه عينه وقال ارجع فقل له يضع يده على متن ثور، فله بكل ما غطت به يده بكل شعرة سنة‏.‏ قال أى رب، ثم ماذا قال ثم الموت‏.‏ قال فالآن‏.‏ فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر ‏\"‏‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فلو كنت ثم لأريتكم قبره إلى جانب الطريق عند الكثيب الأحمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The angel of death was sent to Moses and when he went to him, Moses slapped him severely, spoiling one of his eyes. The angel went back to his Lord, and said, \"You sent me to a slave who does not want to die.\" Allah restored his eye and said, \"Go back and tell him (i.e. Moses) to place his hand over the back of an ox, for he will be allowed to live for a number of years equal to the number of hairs coming under his hand.\" (So the angel came to him and told him the same). Then Moses asked, \"O my Lord! What will be then?\" He said, \"Death will be then.\" He said, \"(Let it be) now.\" He asked Allah that He bring him near the Sacred Land at a distance of a stone's throw. Allah's Apostle (p.b.u.h) said, \"Were I there I would show you the grave of Moses by the way near the red sand hill.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1465",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ مثل البخيل والمتصدق كمثل رجلين، عليهما جبتان من حديد ‏\"‏‏.‏ وحدثنا أبو اليمان أخبرنا شعيب حدثنا أبو الزناد أن عبد الرحمن حدثه أنه سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثل البخيل والمنفق كمثل رجلين، عليهما جبتان من حديد، من ثديهما إلى تراقيهما، فأما المنفق فلا ينفق إلا سبغت  أو وفرت  على جلده حتى تخفي بنانه وتعفو أثره، وأما البخيل فلا يريد أن ينفق شيئا إلا لزقت كل حلقة مكانها، فهو يوسعها ولا تتسع ‏\"‏‏.‏ تابعه الحسن بن مسلم عن طاوس في الجبتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The example of a miser and an almsgiver is like the example of two persons wearing iron cloaks.\" Allah's Apostle also said, \"The example of an almsgiver and a miser is like the example of two persons who have two iron cloaks on them from their breasts to their collar bones, and when the almsgiver wants to give in charity, the cloak becomes capacious till it covers his whole body to such an extent that it hides his fingertips and covers his footprints (obliterates his tracks). (1) And when the miser wants to spend, it (the iron cloak) sticks and every ring gets stuck to its place and he tries to widen it, but it did not become wide.",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1549",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، قال إن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لهن ولمن أتى عليهن من غيرهن، ممن أراد الحج والعمرة، ومن كان دون ذلك فمن حيث أنشأ، حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle (p.b.u.h) made Dhul-Huiaifa as the Miqat for the people of Medina; Al-Juhfa for the people of Sham; Qarn-al-Manazil for the people of Najd; and Yalamlam for the people of Yemen; and these Mawaqit are for the people at those very places, and besides them for those who come thorough those places with the intention of performing Hajj and `Umra; and whoever is living within these boundaries can assume lhram from the place he starts, and the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1555",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لأهلهن ولكل آت أتى عليهن من غيرهم ممن أراد الحج والعمرة فمن كان دون ذلك، فمن حيث أنشأ حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet (p.b.u.h) fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa for the people of Sham, Qarn-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen; and these Mawaqit are for those living at those very places, and besides them for those whom come through them with the intention of performing Hajj and Umra; and whoever is living within these Mawaqit should assume lhram from where he starts, and the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1589",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال كانوا يرون أن العمرة في أشهر الحج من أفجر الفجور في الأرض، ويجعلون المحرم صفرا ويقولون إذا برأ الدبر، وعفا الأثر، وانسلخ صفر، حلت العمرة لمن اعتمر‏.‏ قدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج، فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏\"‏ حل كله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people (of the Pre-Islamic Period) used to think that to perform `Umra during the months of Hajj was one of the major sins on earth. And also used to consider the month of Safar as a forbidden (i.e. sacred) month and they used to say, \"When the wounds of the camel's back heal up (after they return from Hajj) and the signs of those wounds vanish and the month of Safar passes away then (at that time) `Umra is permissible for the one who wishes to perform it.\" In the morning of the 4th of Dhul- Hijja, the Prophet and his companions reached Mecca, assuming Ihram for Hajj and he ordered his companions to make their intentions of the Ihram for `Umra only (instead of Hajj) so they considered his order as something great and were puzzled, and said, \"O Allah's Apostle! What kind (of finishing) of Ihram is allowed?\" The Prophet replied, \"Finish the Ihram completely like a non-Muhrim (you are allowed everything).\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1761",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قيل له في الذبح والحلق والرمى والتقديم والتأخير فقال ‏\"‏ لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was asked about the slaughtering, shaving (of the head), and the doing of Rami before or after the due times. He said, \"There is no harm in that.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1782",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال أمر الناس أن يكون آخر عهدهم بالبيت، إلا أنه خفف عن الحائض‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people were ordered to perform the Tawaf of the Ka`ba (Tawaf-al-Wada`) as the lastly thing, before leaving (Mecca), except the menstruating women who were excused.",
      "chain": [
        "30175",
        "20012",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال رخص للحائض أن تنفر إذا أفاضت‏.‏   قال وسمعت ابن عمر، يقول إنها لا تنفر‏.‏ ثم سمعته يقول بعد إن النبي صلى الله عليه وسلم رخص لهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a subnarrator) said from his father, \"I heard Ibn `Umar saying that she would not depart. Then later I heard him saying that the Prophet had allowed them (menstruating women) to depart.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لهن ولكل آت أتى عليهن من غيرهم ممن أراد الحج والعمرة، فمن كان دون ذلك فمن حيث أنشأ، حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, and Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit are for those people and also for those who come through these Mawaqit (from places other than the above-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these Mawaqit can assume Ihram from the place where they start; even the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2132",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم نهى أن يبيع الرجل طعاما حتى يستوفيه‏.‏ قلت لابن عباس كيف ذاك قال ذاك دراهم بدراهم والطعام مرجأ‏.‏   قال أبو عبد الله  مرجئون  مؤخرون",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle forbade the selling of foodstuff before its measuring and transferring into one's possession.\" I asked Ibn `Abbas, \"How is that?\" Ibn `Abbas replied, \"It will be just like selling money for money, as the foodstuff has not been handed over to the first purchaser who is the present seller.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2158",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا عبد الواحد، حدثنا معمر، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تلقوا الركبان ولا يبيع حاضر لباد ‏\"‏‏.‏ قال فقلت لابن عباس ما قوله لا يبيع حاضر لباد قال لا يكون له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle said, 'Do not go to meet the caravans on the way (for buying their goods without letting them know the market price); a town dweller should not sell the goods of a desert dweller on behalf of the latter.' I asked Ibn `Abbas, 'What does he mean by not selling the goods of a desert dweller by a town dweller?' He said, 'He should not become his broker.' \"",
      "chain": [
        "30140",
        "20256",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2163",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني عياش بن الوليد، حدثنا عبد الأعلى، حدثنا معمر، عن ابن طاوس، عن أبيه، قال سألت ابن عباس  رضى الله عنهما  ما معنى قوله ‏\"‏ لا يبيعن حاضر لباد ‏\"‏‏.‏ فقال لا يكن له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     I asked Ibn `Abbas, \"What is the meaning of, 'No town dweller should sell (or buy) for a desert dweller'?\" Ibn `Abbas said, \"It means he should not become his broker.\"",
      "chain": [
        "30157",
        "20246",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2274",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  نهى رسول الله صلى الله عليه وسلم أن يتلقى الركبان، ولا يبيع حاضر لباد‏.‏ قلت يا ابن عباس ما قوله لا يبيع حاضر لباد قال لا يكون له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"The Prophet forbade the meeting of caravans (on the way) and ordained that no townsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the meaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \"He should not work as a broker for him.\"",
      "chain": [
        "30175",
        "20256",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2278",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال احتجم النبي صلى الله عليه وسلم، وأعطى الحجام أجره‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet was cupped, he paid the man who cupped him his wages.",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2589",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ العائد في هبته كالكلب يقيء، ثم يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"One who takes back his gift (which he has already given) is like a dog that swallows its vomit.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2917",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل البخيل والمتصدق مثل رجلين عليهما جبتان من حديد، قد اضطرت أيديهما إلى تراقيهما، فكلما هم المتصدق بصدقته اتسعت عليه حتى تعفي أثره، وكلما هم البخيل بالصدقة انقبضت كل حلقة إلى صاحبتها وتقلصت عليه وانضمت يداه إلى تراقيه ‏\"‏‏.‏ فسمع النبي صلى الله عليه وسلم يقول ‏\"‏ فيجتهد أن يوسعها فلا تتسع ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The example of a miser and the one who gives in charity, is like the example of two men wearing iron cloaks so tightly that their arms are raised forcibly towards their collar-bones. So, whenever a charitable person wants to give in charity, his cloak spreads over his body so much so that it wipes out his traces, but whenever the miser wants to give in charity, the rings (of the iron cloak) come closer to each other and press over his body, and his hands gets connected to his collarbones. Abu Huraira heard the Prophet saying. \"The miser then tries to widen it but in vain.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3347",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فتح الله من ردم يأجوج ومأجوج مثل هذا ‏\"‏‏.‏ وعقد بيده تسعين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah has made an opening in the wall of the Gog and Magog (people) like this, and he made with his hand (with the help of his fingers).",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3407",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  قال أرسل ملك الموت إلى موسى  عليهما السلام  فلما جاءه صكه، فرجع إلى ربه، فقال أرسلتني إلى عبد لا يريد الموت‏.‏ قال ارجع إليه، فقل له يضع يده على متن ثور، فله بما غطت يده بكل شعرة سنة‏.‏ قال أى رب، ثم ماذا قال ثم الموت‏.‏ قال فالآن‏.‏ قال فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر‏.‏ قال أبو هريرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو كنت ثم لأريتكم قبره إلى جانب الطريق تحت الكثيب الأحمر ‏\"‏‏.‏ قال وأخبرنا معمر عن همام حدثنا أبو هريرة عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Angel of Death was sent to Moses when he came to Moses, Moses slapped him on the eye. The angel returned to his Lord and said, \"You have sent me to a Slave who does not want to die.\" Allah said, \"Return to him and tell him to put his hand on the back of an ox and for every hair that will come under it, he will be granted one year of life.\" Moses said, \"O Lord! What will happen after that?\" Allah replied, \"Then death.\" Moses said, \"Let it come now.\" Moses then requested Allah to let him die close to the Sacred Land so much so that he would be at a distance of a stone's throw from it.\" Abu Huraira added, \"Allah's Apostle said, 'If I were there, I would show you his grave below the red sand hill on the side of the road.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3486",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، قال حدثني ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون يوم القيامة، بيد كل أمة أوتوا الكتاب من قبلنا وأوتينا من بعدهم، فهذا اليوم الذي اختلفوا، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏   ‏\"‏على كل مسلم فى كل سبعة أيام يوم يغسل رأسه وجسده‏\"‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"We are the last (to come) but we will be the foremost on the Day of Resurrection, nations were given the Book (i.e. Scripture) before us, and we were given the Holy Book after them. This (i.e. Friday) is the day about which they differed. So the next day (i.e. Saturday) was prescribed for the Jews and the day after it (i.e. Sunday) for the Christians. It is incumbent on every Muslim to wash his head and body on a Day (i.e. Friday) (at least) in every seven days.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3880",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال كانوا يرون أن العمرة في أشهر الحج من الفجور في الأرض، وكانوا يسمون المحرم صفرا ويقولون إذا برا الدبر، وعفا الأثر، حلت العمرة لمن اعتمر‏.‏ قال فقدم رسول الله صلى الله عليه وسلم وأصحابه رابعة مهلين بالحج وأمرهم النبي صلى الله عليه وسلم أن يجعلوها عمرة‏.‏ قالوا يا رسول الله، أى الحل قال ‏\"‏ الحل كله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people used to consider the performance of `Umra in the months of Hajj an evil deed on the earth, and they used to call the month of Muharram as Safar and used to say, \"When (the wounds over) the backs (of the camels) have healed and the foot-marks (of the camels) have vanished (after coming from Hajj), then `Umra becomes legal for the one who wants to perform `Umra.\" Allah's Apostle and his companions reached Mecca assuming Ihram for Hajj on the fourth of Dhul-Hijja. The Prophet ordered his companions to perform `Umra (with that lhram instead of Hajj). They asked, \"O Allah's Apostle! What kind of finishing of Ihram?\" The Prophet said, \"Finish the Ihram completely.'",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري، عن سالم، عن ابن عمر، قال وأخبرني ابن طاوس، عن عكرمة بن خالد، عن ابن عمر، قال دخلت على حفصة ونسواتها تنطف، قلت قد كان من أمر الناس ما ترين، فلم يجعل لي من الأمر شىء‏.‏ فقالت الحق فإنهم ينتظرونك، وأخشى أن يكون في احتباسك عنهم فرقة‏.‏ فلم تدعه حتى ذهب، فلما تفرق الناس خطب معاوية قال من كان يريد أن يتكلم في هذا الأمر فليطلع لنا قرنه، فلنحن أحق به منه ومن أبيه‏.‏ قال حبيب بن مسلمة فهلا أجبته قال عبد الله فحللت حبوتي وهممت أن أقول أحق بهذا الأمر منك من قاتلك وأباك على الإسلام‏.‏ فخشيت أن أقول كلمة تفرق بين الجمع، وتسفك الدم، ويحمل عني غير ذلك، فذكرت ما أعد الله في الجنان‏.‏ قال حبيب حفظت وعصمت‏.‏ قال محمود عن عبد الرزاق ونوساتها‏.‏",
      "text_en": " Narrated `Ikrima bin Khalid:                     Ibn `Umar said, \"I went to Hafsa while water was dribbling from her twined braids. I said, 'The condition of the people is as you see, and no authority has been given to me.' Hafsa said, (to me), 'Go to them, and as they (i.e. the people) are waiting for you, and I am afraid your absence from them will produce division amongst them.' \" So Hafsa did not leave Ibn `Umar till we went to them. When the people differed. Muawiya addressed the people saying, \"'If anybody wants to say anything in this matter of the Caliphate, he should show up and not conceal himself, for we are more rightful to be a Caliph than he and his father.\" On that, Habib bin Masalama said (to Ibn `Umar), \"Why don't you reply to him (i.e. Muawiya)?\" `Abdullah bin `Umar said, \"I untied my garment that was going round my back and legs while I was sitting and was about to say, 'He who fought against you and against your father for the sake of Islam, is more rightful to be a Caliph,' but I was afraid that my statement might produce differences amongst the people and cause bloodshed, and my statement might be interpreted not as I intended. (So I kept quiet) remembering what Allah has prepared in the Gardens of Paradise (for those who are patient and prefer the Hereafter to this worldly life).\" Habib said, \"You did what kept you safe and secure (i.e. you were wise in doing so).",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11011",
        "18",
        "11433",
        "11709",
        "18"
      ]
    },
    {
      "hadith_no": "5297",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال ‏\"‏ قال سليمان بن داود  عليهما السلام  لأطوفن الليلة بمائة امرأة، تلد كل امرأة غلاما، يقاتل في سبيل الله، فقال له الملك قل إن شاء الله‏.‏ فلم يقل ونسي، فأطاف بهن، ولم تلد منهن إلا امرأة نصف إنسان ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله لم يحنث، وكان أرجى لحاجته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     (The Prophet) Solomon son of (the Prophet) David said, \"Tonight I will go round (i.e. have sexual relations with) one hundred women (my wives) everyone of whom will deliver a male child who will fight in Allah's Cause.\" On that an Angel said to him, \"Say: 'If Allah will.' \" But Solomon did not say it and forgot to say it. Then he had sexual relations with them but none of them delivered any child except one who delivered a half person. The Prophet said, \"If Solomon had said: 'If Allah will,' Allah would have fulfilled his (above) desire and that saying would have made him more hopeful.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11433",
        "11053",
        "13",
        "30584"
      ]
    },
    {
      "hadith_no": "5419",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن طاوس، عن أبيه، وأبو الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خير نساء ركبن الإبل نساء قريش  وقال الآخر صالح نساء قريش  أحناه على ولد في صغره، وأرعاه على زوج في ذات يده ‏\"‏‏.‏ ويذكر عن معاوية وابن عباس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The best women among the camel riders, are the women of Quraish.\" (Another narrator said) The Prophet said, \"The righteous among the women of Quraish are those who are kind to their young ones and who look after their husband's property . \"",
      "chain": [
        "30026",
        "20005",
        "11433",
        "11053",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5753",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم احتجم وأعطى الحجام أجره واستعط‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was cupped and he paid the wages to the one who had cupped him and then took Su'ut (Medicine sniffed by nose).",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6315",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال لم أر شيئا أشبه باللمم من قول أبي هريرة‏.‏ حدثني محمود أخبرنا عبد الرزاق أخبرنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن الله كتب على ابن آدم حظه من الزنا، أدرك ذلك لا محالة، فزنا العين النظر، وزنا اللسان المنطق، والنفس تمنى وتشتهي، والفرج يصدق ذلك كله ويكذبه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I have not seen a thing resembling 'lamam' (minor sins) than what Abu Huraira 'narrated from the Prophet who said \"Allah has written for Adam's son his share of adultery which he commits inevitably. The adultery of the eyes is the sight (to gaze at a forbidden thing), the adultery of the tongue is the talk, and the inner self wishes and desires and the private parts testify all this or deny it.\"",
      "chain": [
        "30418",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6601",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يحشر الناس على ثلاث طرائق، راغبين راهبين واثنان على بعير، وثلاثة على بعير، وأربعة على بعير، وعشرة على بعير ويحشر بقيتهم النار، تقيل معهم حيث قالوا، وتبيت معهم حيث باتوا، وتصبح معهم حيث أصبحوا، وتمسي معهم حيث أمسوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The people will be gathered in three ways: (The first way will be of) those who will wish or have a hope (for Paradise) and will have a fear (of punishment), (The second batch will be those who will gather) riding two on a camel or three on a camel or ten on a camel. (The third batch) the rest of the people will be urged to gather by the Fire which will accompany them at the time of their afternoon nap and stay with them where they will spend the night, and will be with them in the morning wherever they may be then, and will be with them in the afternoon wherever they may be then.\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "6692",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن الله كتب على ابن آدم حظه من الزنا، أدرك ذلك لا محالة، فزنا العين النظر، وزنا اللسان المنطق، والنفس تمنى وتشتهي، والفرج يصدق ذلك، ويكذبه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I did not see anything so resembling minor sins as what Abu Huraira said from the Prophet, who said, \"Allah has written for the son of Adam his inevitable share of adultery whether he is aware of it or not: The adultery of the eye is the looking (at something which is sinful to look at), and the adultery of the tongue is to utter (what it is unlawful to utter), and the innerself wishes and longs for (adultery) and the private parts turn that into reality or refrain from submitting to the temptation.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ]
    },
    {
      "hadith_no": "6693",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "وقال شبابة حدثنا ورقاء، عن ابن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "20426",
        "20363",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "6810",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إياكم والظن فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا، ولا تباغضوا، ولا تدابروا، وكونوا عباد الله إخوانا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, 'Beware of suspicion, for it is the worst of false tales and don't look for the other's faults and don't spy and don't hate each other, and don't desert (cut your relations with) one another O Allah's slaves, be brothers!\" (See Hadith No. 90)",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "6818",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها، فما بقي فهو لأولى رجل ذكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to those who are entitled to receive it. Then whatever remains, should be given to the closest male relative of the deceased .\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6821",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألحقوا الفرائض بأهلها فما بقي فهو لأولى رجل ذكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"Give the Fara'id (shares prescribed in the Qur'an) to those who are entitled to receive it; and whatever remains, should be given to the closest male relative of the deceased.'",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6823",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها فما بقي فلأولى رجل ذكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Give the Fara'id, (the shares prescribed in the Qur'an) to those who are entitled to receive it, and then whatever remains, should be given to the closest male relative of the deceased.\"",
      "chain": [
        "20193",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6832",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أمية بن بسطام، حدثنا يزيد بن زريع، عن روح، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها، فما تركت الفرائض فلأولى رجل ذكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Give the Fara'id (the shares of the inheritance that are prescribed in the Qur'an) to those who are entitled to receive it; and whatever is left should be given to the closest male relative of the deceased.\"",
      "chain": [
        "30124",
        "20304",
        "20229",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "7223",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يفتح الردم ردم يأجوج ومأجوج مثل هذه ‏\"‏‏.‏ وعقد وهيب تسعين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A hole has been opened in the dam of Gog and Magog.\" Wuhaib (the sub-narrator) made the number 90 (with his index finger and thumb).",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "18",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن عبد الله بن عمرو بن العاص، قال إن في البحر شياطين مسجونة أوثقها سليمان يوشك أن تخرج فتقرأ على الناس قرآنا ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "29"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال إنما كنا نحفظ الحديث والحديث يحفظ عن رسول الله صلى الله عليه وسلم فأما إذ ركبتم كل صعب وذلول فهيهات ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن ابن طاوس، عن أبيه، عن ابن عباس، أمر النبي صلى الله عليه وسلم أن يسجد على سبع ونهي أن يكفت الشعر والثياب ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) had been commanded to prostrate on seven (bones) and forbidden to fold back hair and clothing.",
      "chain": [
        "30263",
        "20005",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة أعظم الجبهة - وأشار بيده على أنفه - واليدين والرجلين وأطراف القدمين ولا نكفت الثياب ولا الشعر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that the Messenger of Allah (may peace be upon him) said:                      I have been commanded to prostrate myself on seven bones:\" forehead,\" and then pointed with his hand towards his nose, hands, feet, and the extremities of the feet; and we were forbidden to fold back clothing and hair.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الطاهر، أخبرنا عبد الله بن وهب، حدثني ابن جريج، عن عبد الله بن طاوس، عن أبيه، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبع ولا أكفت الشعر ولا الثياب الجبهة والأنف واليدين والركبتين والقدمين ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Messenger of Allah (may peace be upon him) said: I was commanded to prostrate myself on the seven (bones) and forbidden to fold back hair and clothing. (The seven bones are): forehead, nose, hands, knees and feet.",
      "chain": [
        "20029",
        "11070",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1358",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Ibn Tawus from his father on the authority of AbuHuraira.",
      "chain": [
        "30377",
        "20005",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1408",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حسن بن الربيع، حدثنا عبد الله بن المبارك، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك ومن أدرك من الفجر ركعة قبل أن تطلع الشمس فقد أدرك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who finds (gets) a rak'ah of the afternoon (prayer) before the setting of the sun, he in fact gets (the full prayer), and he who gets a rak'ah of the morning (prayer) before the rising of the sun he in fact gets (the full prayer).",
      "chain": [
        "20025",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ]
    },
    {
      "hadith_no": "1968",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن عائشة، أنها قالت وهم عمر إنما نهى رسول الله صلى الله عليه وسلم أن يتحرى طلوع الشمس وغروبها ‏.‏",
      "text_en": " 'A'isha said that the Messenger of Allah (may peace be upon him) did not abandon observing two rak'ahs after 'Asr, but she reported Allah's Messenger (may peace be upon him) as saying:                      Do not get used to observe prayer at the time of the rising sun and at the time of its setting and (exhorted the Muslims) to pray at their times.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "1969",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حسن الحلواني، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن عائشة، أنها قالت لم يدع رسول الله صلى الله عليه وسلم الركعتين بعد العصر ‏.‏ قال فقالت عائشة قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تتحروا طلوع الشمس ولا غروبها فتصلوا عند ذلك ‏\"‏ ‏.‏",
      "text_en": " Kuraib, the freed slave of Ibn 'Abbas, reported that 'Abdullah b. 'Abbas, 'Abd al-Rahman b. Azhar, al-Miswar b. Makhrama sent him to 'A'isha, the wife of the Messenger of Allah (may peace be upon him), telling him to give her their greetings, and ask her about the two rak'ahs after the afternoon prayer, (for)\" we have heard that you observe them whereas it has been conveyed to us that the Messenger of Allah (may peace be upon him) prohibited their observance.\" Ibn 'Abbas said:                      I along with 'Umar b. al-Khattab dissuaded people to do so (to observe two rak'ahs of prayer). Kuraib said: I went to her ('A'isha) and conveyed to her the message with which I was sent. She said: (Better) ask Umm Salama. So I went to them (those who had sent him to Hadrat 'A'isha) and informed them about what she had said. They sent me back to Umm Salama with that with which I was sent to 'A'isha. Umm Salama said: I beard the Messenger of Allah (may peace be upon him) prohibiting them, and then afterwards I saw him observing them. And when he observed them (two rak'ahs) he had already observed the 'Asr prayer. Then he (the Holy Prophet) came, while there were with me ladies of Banu Haram, a tribe of the Ansar and he (the Holy Prophet) observed them (the two rak'ahs). I sent a slave-girl to him asking her to stand by his side and say to him that Umm Salama says: Messenger of Allah, I heard you prohibiting these two rak'ahs, whereas I saw you observing them; and if he (the Holy Prophet) points with his hand (to wait), then do wait. The slave-girl did like that. He (the Holy Prophet) pointed out with his hand and she got aside and waited, and when he had finished (the prayer) he said: Daughter of Abu Umayya. you have asked about the two rak'ahs after the 'Asr prayer. Some people of 'Abu al-Qais came to me for embracing Islam and hindered me from observing the two rak'ahs which come after the noon prayer. So those are the two I have been praying.",
      "chain": [
        "130115",
        "20121",
        "20115",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "2000",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ حق لله على كل مسلم أن يغتسل في كل سبعة أيام يغسل رأسه وجسده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2016",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، وابن طاوس عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون ونحن السابقون يوم القيامة ‏\"‏ ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      We are the last and would be the first on the Day of Resurrection.",
      "chain": [
        "30421",
        "20005",
        "11061",
        "11197",
        "13",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2408",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن إسحاق الحضرمي، عن وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل البخيل والمتصدق مثل رجلين عليهما جنتان من حديد إذا هم المتصدق بصدقة اتسعت عليه حتى تعفي أثره وإذا هم البخيل بصدقة تقلصت عليه وانضمت يداه إلى تراقيه وانقبضت كل حلقة إلى صاحبتها ‏\"‏ ‏.‏ قال فسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فيجهد أن يوسعها فلا يستطيع ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira reported Allah's Messenger (may peace be upon him) as-saying:                     . The similitude of a miserly man and the giver of charity is that of two persons with coatsof mail over them; when the giver of charity intends to give charity, it expands over him (to much so) that the footprints are also obliterated. And when the miserly man intends to give charity, it contracts over him, and his hands are tied up to his collar bone, and every ring is fixed up to another. He (the narrator) said: I heard the Messenger of Allah (may peace be upon him) as saying: He would try to expand it. but he would not be able to do so.",
      "chain": [
        "30201",
        "20528",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2861",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا وهيب، حدثنا عبد الله، بن طاوس عن أبيه، عن ابن عباس، - رضى الله عنهما - أن رسول الله صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة ولأهل الشام الجحفة ولأهل نجد قرن المنازل ولأهل اليمن يلملم ‏.‏ وقال ‏\"‏ هن لهم ولكل آت أتى عليهن من غيرهن ممن أراد الحج والعمرة ومن كان دون ذلك فمن حيث أنشأ حتى أهل مكة من مكة ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) specified Dhu'l-Hulaifa for the people of Medina; Juhfa for the people of Syria, Qarn al-Manazil for the people of Najd, Yalamlam for the people of Yemen (as their respective Mawaqit), and he also said:                      These are (Mawaqit) of them too (who live there) and everyone who comes from outside (through) their (directions) for the sake of Hajj and 'Umra and for those who live within (those bounds their Miqat is that) from which they commenced (their journey), and for the people of Mecca, Mecca itself is (the Miqat).",
      "chain": [
        "30201",
        "20364",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن عائشة، - رضى الله عنها - أنها أهلت بعمرة فقدمت ولم تطف بالبيت حتى حاضت فنسكت المناسك كلها ‏.‏ وقد أهلت بالحج ‏.‏ فقال لها النبي صلى الله عليه وسلم يوم النفر ‏\"‏ يسعك طوافك لحجك وعمرتك ‏\"‏ ‏.‏ فأبت فبعث بها مع عبد الرحمن إلى التنعيم فاعتمرت بعد الحج ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that she put on Ihram for, Umra and arrived 'at Mecca) but did not circumambulate the House as she had entered in the period of menses, and then put on Ihram for Hajj and performed all the rituals concerning it (except circumambulating the House). The Apostle of Allah (may peace be upon him) said to her on the day of march (when pilgrims come to Mina):                      Your circumambulation would suffice both Hajj and Umra. She, however, felt reluc- tant. Thereupon the Holy Prophet (may peace be upon him) sent her with 'Abd al- Rahman to Tan'im and she performed Umra (with separate rituals) after Hajj.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "3068",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، - رضى الله عنهما - قال كانوا يرون أن العمرة في أشهر الحج من أفجر الفجور في الأرض ويجعلون المحرم صفر ويقولون إذا برأ الدبر وعفا الأثر وانسلخ صفر حلت العمرة لمن اعتمر ‏.‏ فقدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏\"‏ الحل كله ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that they (the Arabs of pre-Islamic days) looked upon Umra during the months of Hajj as the greatest of sins on the earth. So they intercalated the month of Muharram for Safar and said:                      When the backs of their camels would become all right and traces (if the pilgrims) would be effaced (from the paths) and the month of Safar would be over, then Umra would be permissible for one who wants to perform it. When Allah's Apostle (may peace be upon him) and his Companions came in the state of Ihram for performing Hajj on the fourth (of Dhu'l-Hijja) he (Allah's Apostle) commanded them to change their state of Ihram (from Hajj) to that of 'Umra. It was something inconceivable for them. So they said: Messenger of Allah, is it a complete freedom (of the obligation) of Ihram? Thereupon he said: It is a complete freedom (from Ihram).",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم قيل له في الذبح والحلق والرمى والتقديم والتأخير فقال ‏\"‏ لا حرج ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that it was said to Allah's Apostle (may peace be upon him) about sacrificing of animals, shaving of one's head, throwing of pebbles, and (the order of) precedence and succession, and he said:                      There is no harm in it.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة - واللفظ لسعيد - قالا حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال أمر الناس أن يكون، آخر عهدهم بالبيت إلا أنه خفف عن المرأة الحائض ‏.‏",
      "text_en": " Ibn Abbas reported:                      The people were commanded (by the Holy Prophet) to perform the last circumambulation round the House, but menstruating women were exempted.",
      "chain": [
        "30116",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3742",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن طاوس، عن أبيه، أنه سمع ابن عمر، يسأل عن رجل، طلق امرأته حائضا فقال أتعرف عبد الله بن عمر قال نعم ‏.‏ قال فإنه طلق امرأته حائضا فذهب عمر إلى النبي صلى الله عليه وسلم فأخبره الخبر فأمره أن يراجعها قال لم أسمعه يزيد على ذلك لأبيه‏.‏",
      "text_en": " Ibn Tawus narrated on the authority of his father that Ibn 'Umar (Allah be pleased with them) was asked about the person who divorced his wife in the state of menses, whereupon he said:                      Do you know 'Abdullah b. Umar? He said: Yes. He said: It was he who divorced his wife jn the state of menses and 'Umar went to Allah's Apostle (may peace be upon him) and gave him this information. and he commanded him that he should take her back; and he (Abu Tawus) said: I did not hear any addition to this (hadith) from my father.",
      "chain": [
        "30123",
        "20121",
        "11070",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "3746",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، - واللفظ لابن رافع - قال إسحاق أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال كان الطلاق على عهد رسول الله صلى الله عليه وسلم وأبي بكر وسنتين من خلافة عمر طلاق الثلاث واحدة فقال عمر بن الخطاب إن الناس قد استعجلوا في أمر قد كانت لهم فيه أناة فلو أمضيناه عليهم ‏.‏ فأمضاه عليهم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that the (pronouncement) of three divorces during the lifetime of Allah's Messenger (may peace be upon him) and that of Abu Bakr and two years of the caliphate of Umar (Allah be pleased with him) (was treated) as one. But Umar b. Khattab (Allah be pleased with him) said:                      Verily the people have begun to hasten in the matter in which they are required to observe respite. So if we had imposed this upon them, and he imposed it upon them.",
      "chain": [
        "30123",
        "30375",
        "30312",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا روح بن عبادة، أخبرنا ابن جريج، ح وحدثنا ابن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن طاوس، عن أبيه، أن أبا الصهباء، قال لابن عباس أتعلم أنما كانت الثلاث تجعل واحدة على عهد النبي صلى الله عليه وسلم وأبي بكر وثلاثا من إمارة عمر ‏.‏ فقال ابن عباس نعم ‏.‏",
      "text_en": " Abu Sahba' said toIbn 'Abbas (Allah be pleased with them):                      Do you know that three (divorces) were treated as one during the lifetime of Allah's Apostle (may peace be upon him), and that of Abu Bakr, and during three (years) of the caliphate of Umar (Allah be pleased with him)? Ibn Abbas (Allah be pleased with them) said: Yes.",
      "chain": [
        "30123",
        "20229",
        "11070",
        "20121",
        "11070",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "3900",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم أن تتلقى الركبان وأن يبيع حاضر لباد ‏.‏ قال فقلت لابن عباس ما قوله حاضر لباد قال لا يكن له سمسارا.",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      The riders (carrying merchandise) should not be met in the way, and townsman should not sell for a man of the desert. The narrator reported. I said to Ibn 'Abbas: What do these words really imply-\" The townsman for the man of the desert\"? He said: That he should work as a broker on his behalf.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3915",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏ قال ابن عباس وأحسب كل شىء بمنزلة الطعام ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who buys food-rain should not sell it until he has taken possession of it. Ibn Abbas (Allah be pleased with them) said: I regard everything like food (so far as this principle is concerned).",
      "chain": [
        "30123",
        "30375",
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم قال إسحاق أخبرنا وقال الآخران، حدثنا وكيع، عن سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يكتاله ‏\"‏ ‏.‏ فقلت لابن عباس لم فقال ألا تراهم يتبايعون بالذهب والطعام مرجأ ولم يقل أبو كريب مرجأ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who buys foodgrain should not sell it, until he has weighed it (and then taken possession of it). I (Tawus) said to Ibn Abbas (Allah be pleased with them): Why is it so? Thereupon he said: Don't you see that they (the people) sell foodgrains against gold for the stipulated time. Abu Kuraib did not make any mention of the stipulated time.",
      "chain": [
        "30201",
        "30312",
        "20032",
        "20012",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4040",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن عمرو، وابن، طاوس عن طاوس، أنه كان يخابر قال عمرو فقلت له يا أبا عبد الرحمن لو تركت هذه المخابرة فإنهم يزعمون أن النبي صلى الله عليه وسلم نهى عن المخابرة ‏.‏ فقال أى عمرو أخبرني أعلمهم بذلك يعني ابن عباس أن النبي صلى الله عليه وسلم لم ينه عنها إنما قال ‏\"‏ يمنح أحدكم أخاه خير له من أن يأخذ عليها خرجا معلوما ‏\"‏ ‏.‏",
      "text_en": " Tawus reported that he let out his land on rent, whereupon Amr said:                      I said to him: Abu Abd al-Rahrman, I wish if you abandon this renting of land, for they alleged that Allah's Apostle (may peace be upon him) forbade Mukhabara. He siad: Amr, one who has informed me has the best knowledge of it among them (he meant Ibn Abbas). (He said) that Allah's Apostle (may peace be upon him) did not prohibit it altogether, but said: Lending of land by one among you to his brother is better for him than getting a specified amount of produce from it.",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "4042",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني عبد بن حميد، ومحمد بن رافع، - قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ لأن يمنح أحدكم أخاه أرضه خير له من أن يأخذ عليها كذا وكذا ‏\"‏ ‏.‏ لشىء معلوم ‏.‏ قال وقال ابن عباس هو الحقل وهو بلسان الأنصار المحاقلة.",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      If one among you lets out land to his brother, that is better for him than if he receives such and such (the definite thing). Ibn 'Abbis (Allah be pleased with them) said: It is Haql, and in the parlance of the Ansr it is Muhaqala.",
      "chain": [
        "30553",
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4124",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان بن مسلم، ح وحدثنا إسحاق بن إبراهيم، أخبرنا المخزومي، كلاهما عن وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم احتجم وأعطى الحجام أجره واستعط ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) got himself cupped and he paid the clipper his charges and he put medicine in his nostrils.",
      "chain": [
        "30201",
        "30106",
        "30123",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4174",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عفان، ح وحدثني محمد بن حاتم، حدثنا بهز، قالا حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ربا فيما كان يدا بيد ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas; (Allah be pleased with them) reported on the authority of Usama b. Zaid Allah's Messenger (may peace be upon him) as having said this:                      There is no element of interest when the money or commodity is exchanged hand to hand.",
      "chain": [
        "30022",
        "30106",
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "17",
        "50"
      ]
    },
    {
      "hadith_no": "4226",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الأعلى بن حماد، - وهو النرسي - حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألحقوا الفرائض بأهلها فما بقي فهو لأولى رجل ذكر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      Give the shares to those who are entitled to them, and what remains over goes to the nearest male heir.",
      "chain": [
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا أمية بن بسطام العيشي، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها فما تركت الفرائض فلأولى رجل ذكر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      Give the shares to those who are entitled to them, and what is left from those wno are entitled to it goes to the nearest male heir.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4228",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قال إسحاق حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقسموا المال بين أهل الفرائض على كتاب الله فما تركت الفرائض فلأولى رجل ذكر ‏\"‏ ‏.‏",
      "text_en": " Tawus reported on the authority of his father Ibn Abbas (Allah be pleased with them) narrating that Allah's Messenger (may peace be upon him) said:                      Distribute the property amongst Ahl al-Fara'id, according to the Book of Allah, and what is left out of them goes to the nearest male heir.",
      "chain": [
        "30123",
        "30375",
        "30553",
        "30312",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا المخزومي، حدثنا وهيب، حدثنا عبد الله، بن طاوس عن أبيه، عن ابن عباس، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ العائد في هبته كالكلب يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Tawus reported on the authority of his father who reported from Ibn Abas (Allah be pleased with them) who reported from Allah's Messenger 'may peace be upon him) that he said:                      One who gets back his gift is like a dog which vomits and then swallows that vomit.",
      "chain": [
        "30123",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق بن همام، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال قال سليمان بن داود لأطيفن الليلة على سبعين امرأة تلد كل امرأة منهن غلاما يقاتل في سبيل الله ‏.‏ فقيل له قل إن شاء الله ‏.‏ فلم يقل ‏.‏ فأطاف بهن فلم تلد منهن إلا امرأة واحدة نصف إنسان ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله ‏.‏ لم يحنث وكان دركا لحاجته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Sulaiman b. Dawud said:                      I will certainly have intercourse with seventy wives during the night, and every wife amongst them will give birth to a child, who will fight in the cause of Allah. It was said to him: Say:\" Insha' Allah\" (God willing), but he did not say so and forgot it. He went round them but none of them give birth to a child except one woman and that too was an incomplete person. Upon this Allah's Messenger (may peace be upon him) said: If he had said\" Insha' Allah.\" he would not have failed, and his desire must have been fulfilled.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "13",
        "30584"
      ]
    },
    {
      "hadith_no": "5308",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن طاوس، عن أبيه، عن ابن عمر، أن رجلا، جاءه فقال أنهى النبي صلى الله عليه وسلم أن ينبذ في الجر والدباء قال نعم ‏.‏",
      "text_en": " Ibn 'Umar reported that a person came to him and said:                      Did Allah's Apostle (may peace be upon him) forbid the preparation of Nabidh in a green pitcher (besmeared with pitch and) in varnished jar? He said: Yes.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11433",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "5309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الجر والدباء ‏.‏",
      "text_en": " Ibn 'Umar reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch) and in varnished jar.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "5831",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، وحجاج بن الشاعر، وأحمد بن خراش، قال عبد الله أخبرنا وقال الآخران، حدثنا مسلم بن إبراهيم، قال حدثنا وهيب، عن ابن، طاوس عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ العين حق ولو كان شىء سابق القدر سبقته العين وإذا استغسلتم فاغسلوا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported Allah's Messenger (may peace be upon him) as saying:                      The influence of an evil eye is a fact; if anything would precede the destiny it would be the influence of an evil eye, and when you are asked to take bath (as a cure) from the influence of an evil eye, you should take bath.",
      "chain": [
        "30025",
        "38834",
        "18",
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "5879",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان بن هلال، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وأعطى الحجام أجره واستعط ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Apostle (may peace be upon him) got himself cupped and gave to the cupper his wages and he put the medicine in the nostril.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6297",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا  عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال أرسل ملك الموت إلى موسى عليه السلام فلما جاءه صكه ففقأ عينه فرجع إلى ربه فقال أرسلتني إلى عبد لا يريد الموت - قال - فرد الله إليه عينه وقال ارجع إليه فقل له يضع يده على متن ثور فله بما غطت يده بكل شعرة سنة قال أى رب ثم مه قال ثم الموت ‏.‏ قال فالآن فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلو كنت ثم لأريتكم قبره إلى جانب الطريق تحت الكثيب الأحمر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Angel of Death was sent to Moses (peace be upon him) to inform of his Lord's summons. When he came, he (Moses) boxed him and his eye was knocked out. He (the Angel of Death) came back to the Lord and said:                      You sent me to a servant. who did not want to die. Allah restored his eye to its proper place (and revived his eyesight), and then said: Go back to him and tell him that if he wants life he must place his hand on the back of an ox, and he would be granted as many years of life as the number of hair covered by his hand. He (Moses) said: My Lord what would happen then He said: Then you must court death. He said: Let it be now. And he supplicated Allah to bring him close to the sacred land. Thereupon Allah's Messenger (may peace be upon him) said: If I were there, I would have shown you his grave beside the road at the red mound.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "6618",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن  أبي هريرة، وعن ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير نساء ركبن الإبل - قال أحدهما صالح نساء قريش ‏.‏ وقال الآخر نساء قريش - أحناه على يتيم في صغره وأرعاه على زوج في ذات يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Good amongst the women are those who ride camels. One of them said: They are pious women of the Quraish, and the other one said: The women of the Quraish are kind to the orphans in their childhood and look after the wealth of their spouses.",
      "chain": [
        "30421",
        "20005",
        "11061",
        "11197",
        "13",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "6622",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال عبد، أخبرنا  عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، ح",
      "text_en": "",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "6924",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، - واللفظ لإسحاق - قالا أخبرنا  عبد الرزاق، حدثنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله كتب على ابن آدم حظه من الزنى أدرك ذلك لا محالة فزنى العينين النظر وزنى اللسان النطق والنفس تمنى وتشتهي والفرج يصدق ذلك أو يكذبه ‏\"‏ ‏.‏ قال عبد في روايته ابن طاوس عن أبيه سمعت ابن عباس ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      Verily Allah has fixed the very portion of adultery which a man will indulge in, and which he of necessity must comrriit. The adultery of the eye is the lustful look, and the adultery of the tongue is the licentious speech, the heart desires and yearns, which the parts may or may not put into effect.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ]
    },
    {
      "hadith_no": "7381",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني زهير بن حرب، حدثنا أحمد بن إسحاق، ح وحدثني محمد بن حاتم، حدثنا  بهز، قالا جميعا حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ يحشر الناس على ثلاث طرائق راغبين راهبين واثنان على بعير وثلاثة على بعير وأربعة على بعير وعشرة على بعير وتحشر بقيتهم النار تبيت معهم حيث باتوا وتقيل معهم حيث قالوا وتصبح معهم حيث أصبحوا وتمسي معهم حيث أمسوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying, The people will be assembled in three categories. Those desirous (of Paradise), fearing (Hell), coming two upon the came], three upon the camel, four upon the camel, ten upon the camel and the rest will be assembled, Hell-Fire being with them when they are at midday where they would spend the night and where they would spend the morning and where they would spend the evening.",
      "chain": [
        "30022",
        "30289",
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "7420",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن إسحاق، حدثنا وهيب، حدثنا عبد، الله بن طاوس عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فتح اليوم من ردم يأجوج ومأجوج مثل هذه ‏\"‏ ‏.‏ وعقد وهيب بيده تسعين ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      Today the wall (barrier) of Gog and Magog has been opened so much, and WUhaib (in order to explain it) made the figure of ninety with the help of his hand.",
      "chain": [
        "30201",
        "30289",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن الربيع، حدثني ابن المبارك، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك ومن أدرك من الفجر ركعة قبل أن تطلع الشمس فقد أدرك ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone says a rak'ah of the 'Asr prayer before sunset, he has observed (the 'Asr prayer), and if anyone performs a rak'ah of the Fajr prayer, he has observed (the Fajr prayer).",
      "chain": [
        "30189",
        "20025",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ]
    },
    {
      "hadith_no": "1365",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا نوح بن حبيب، ويحيى بن موسى، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن عكرمة بن خالد، عن ابن عباس، قال ‏:‏ بت عند خالتي ميمونة فقام النبي صلى الله عليه وسلم يصلي من الليل فصلى ثلاث عشرة ركعة منها ركعتا الفجر، حزرت قيامه في كل ركعة بقدر ‏{‏ يا أيها المزمل ‏}‏ لم يقل نوح ‏:‏ منها ركعتا الفجر ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     I spent a night with my maternal aunt Maymunah. The Prophet (ﷺ) got up to pray at night. He prayed thirteen rak'ahs including two rak'ahs of the dawn prayer. I guessed that he stood in every rak'ah as long as one could recite Surah al-Muzzammil (73).",
      "chain": [
        "38671",
        "30221",
        "20121",
        "20115",
        "11433",
        "11709",
        "17"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عمرو بن دينار، عن طاوس، عن ابن عباس، وعن ابن طاوس، عن أبيه، قالا وقت رسول الله صلى الله عليه وسلم بمعناه قال أحدهما ولأهل اليمن يلملم ‏.‏ وقال أحدهما ألملم قال ‏\"‏ فهن لهم ولمن أتى عليهن من غير أهلهن ممن كان يريد الحج والعمرة ومن كان دون ذلك ‏.‏ - قال ابن طاوس - من حيث أنشأ قال وكذلك حتى أهل مكة يهلون منها ‏\"‏ ‏.‏",
      "text_en": " Ibn `Abbas and Tawus reported :                      The Messenger of Allah (SWAS) appointed places for putting on Ihram and narrated the rest of the tradition to the same effect (as mentioned above).  One of them said and Yalamlam for the people of Yemen.  The other narrator said Alamlam.  These (places for Ihram) are appointed for these regions and for people of other regions who come to them intending to perform Hajj and `Umrah.  The place where those who live nearer to Makkah should put on Ihram from where they start and so on up to the inhabitants of Makkah itself who put on Ihram in it. This is the version of Ibn Tawus.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11053",
        "17",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن علي، ومخلد بن خالد، ومحمد بن يحيى، - المعنى - قالوا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، أن معاوية، قال له أما علمت أني قصرت عن رسول الله صلى الله عليه وسلم بمشقص أعرابي على المروة - زاد الحسن في حديثه - لحجته ‏.‏",
      "text_en": " Ibn Abbas said that Mu'awiyah told him:                      do you not know that I clipped the hair of the head of the Messenger of Allah (ﷺ) with a broad iron arrowhead at al-Marwah? Al-Hasan added in his version: \"during his hajj.\"",
      "chain": [
        "30",
        "30567",
        "11222",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "hadith_no": "1987",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد بن السري، عن ابن أبي زائدة، حدثنا ابن جريج، ومحمد بن إسحاق، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال والله ما أعمر رسول الله صلى الله عليه وسلم عائشة في ذي الحجة إلا ليقطع بذلك أمر أهل الشرك فإن هذا الحى من قريش ومن دان دينهم كانوا يقولون إذا عفا الوبر وبرأ الدبر ودخل صفر فقد حلت العمرة لمن اعتمر ‏.‏ فكانوا يحرمون العمرة حتى ينسلخ ذو الحجة والمحرم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     By Allah, the Messenger of Allah (ﷺ) did not make Aisha perform umrah during Dhul-Hijjah but to discontinue the practice of the idolaters (in Arabia before Islam), for this clan of Quraysh and those who followed them used to say: When the fur of the camel abounds, and the wounds on the back of the camels are recovered and the month of Safar begins, umrah becomes lawful for one who performs umrah. They considered performing umrah unlawful till the months of Dhul-Hijjah and al-Muharram passed away.",
      "chain": [
        "30480",
        "20366",
        "11070",
        "11107",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا ابن ثور، عن معمر، أخبرنا ابن طاوس، عن أبيه، عن ابن عباس، قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن الله كتب على ابن آدم حظه من الزنا أدرك ذلك لا محالة فزنا العينين النظر وزنا اللسان المنطق والنفس تمنى وتشتهي والفرج يصدق ذلك ويكذبه ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “I did not see anything more resembling to minor sins than what Abu Hurairah reported from the Prophet (ﷺ) who said “Allaah has decreed for the children of Adam a share in adultery, he will get it by all means, the adultery of eyes is looking; the adultery of tongue is speaking; the soul desires and has a passion; the private parts confirms or falsifies it.”",
      "chain": [
        "30213",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن طاوس، عن أبيه، أن أبا الصهباء، قال لابن عباس أتعلم إنما كانت الثلاث تجعل واحدة على عهد النبي صلى الله عليه وسلم وأبي بكر وثلاثا من إمارة عمر قال ابن عباس نعم ‏.‏",
      "text_en": " Tawus said:                      Abu al-Sahba' said to Ibn Abbas: Do you know that a divorce by three pronouncements was made a single one during the time of the Prophet (ﷺ), and of AbuBakr and in the early days of the caliphate of Umar? He replied: Yes.",
      "chain": [
        "30226",
        "20121",
        "11070",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن صالح، ومخلد بن خالد، - وهذا حديث مخلد وهو الأشبع - قال حدثنا عبد الرزاق حدثنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقسم المال بين أهل الفرائض على كتاب الله فما تركت الفرائض فلأولى ذكر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Divide the property among those whose share have been prescribed in the Book of Allah, and what remains from the prescribed shares goes to the nearest male heirs.",
      "chain": [
        "30226",
        "30567",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم أن يبيع حاضر لباد ‏.‏ فقلت ما يبيع حاضر لباد قال لا يكون له سمسارا ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) forbade a townsman to sell for a man from the desert. I asked: What do you mean by the selling of a townsman for a man from the desert ? He replied: He should not be a broker for him.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا وكيع، عن سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يكتاله ‏\"‏ ‏.‏ زاد أبو بكر قال قلت لابن عباس لم قال ألا ترى أنهم يتبايعون بالذهب والطعام مرجى ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) as saying: If anyone buys grain, he should not sell it until he measures it. Abu Bakr added in his version: I asked Ibn 'Abbas: Why ? He replied: Do you not see that they sell (grain) for gold, but the grain is still with the seller.",
      "chain": [
        "20436",
        "20032",
        "20012",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3811",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن ابن طاوس، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله صلى الله عليه وسلم يوم خيبر عن لحوم الحمر الأهلية وعن الجلالة عن ركوبها وأكل لحمها ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     On the day of Khaybar the Messenger of Allah (may pease be upon him) forbade (eating) the flesh of domestic asses, and the animal which feeds on filth: riding it and eating its flesh.",
      "chain": [
        "30138",
        "20299",
        "11433",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3867",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أحمد بن إسحاق، حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم استعط ‏.‏",
      "text_en": " Ibn’Abbas said:                      The Messenger of Allah (ﷺ) snuffed medicine.",
      "chain": [
        "30203",
        "30289",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4211",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا إسحاق بن منصور، حدثنا محمد بن طلحة، عن حميد بن وهب، عن ابن طاوس، عن طاوس، عن ابن عباس، قال مر على النبي صلى الله عليه وسلم رجل قد خضب بالحناء فقال ‏\"‏ ما أحسن هذا ‏\"‏ ‏.‏ قال فمر آخر قد خضب بالحناء والكتم فقال ‏\"‏ هذا أحسن من هذا ‏\"‏ ‏.‏ قال فمر آخر قد خضب بالصفرة فقال ‏\"‏ هذا أحسن من هذا كله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When a man who had dyed himself with henna passed by the Prophet (ﷺ), he said: How fine this is! When another man who had dyed himself with henna and katam passed by, he said: This is better than that. Then another man who had dyed himself with yellow dye, passed by, he said: This is better than all that.",
      "chain": [
        "30203",
        "30313",
        "20604",
        "23013",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين فقال إن شاء الله لم يحنث ‏\"‏ ‏.‏ قال أبو عيسى سألت محمد بن إسماعيل عن هذا فقال هذا حديث خطأ أخطأ فيه عبد الرزاق اختصره من حديث معمر عن ابن طاوس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ إن سليمان بن داود قال لأطوفن الليلة على سبعين امرأة تلد كل امرأة غلاما ‏.‏ فطاف عليهن فلم تلد امرأة منهن إلا امرأة نصف غلام ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله لكان كما قال ‏\"‏ ‏.‏ هكذا روي عن عبد الرزاق عن معمر عن ابن طاوس عن أبيه هذا الحديث بطوله وقال ‏\"‏ سبعين امرأة ‏\"‏ ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود لأطوفن الليلة على مائة امرأة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whoever swears [about an oath] and says: 'If Allah wills (Insha Allah), then he will not have broken it.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2203",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش البغدادي، حدثنا أحمد بن إسحاق الحضرمي، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان شيء سابق القدر لسبقته العين وإذا استغسلتم فاغسلوا ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عمرو ‏.‏ وهذا حديث حسن صحيح غريب ‏.‏ وحديث حية بن حابس حديث غريب ‏.‏ وروى شيبان عن يحيى بن أبي كثير عن حية بن حابس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وعلي بن المبارك وحرب بن شداد لا يذكران فيه عن أبي هريرة ‏.‏",
      "text_en": " \" Ibn 'Abbas narrated  that  the Messenger of Allah (s.a.w) said:                     \"If there was anything that could overcome the Decree then the (evil) eye would overcome it, and when you are requested to wash (due to it) then wash.\"",
      "chain": [
        "30292",
        "20528",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2243",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها فما بقي فهو لأولى رجل ذكر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah(S.A.W) said:                     \"Give the shares of inheritance to those who are entitled to them. As for what remains, then it is for the closet male relative.'",
      "chain": [
        "30025",
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2244",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى هذا حديث حسن وقد روى بعضهم عن ابن طاوس عن أبيه عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": "",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2166",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا إبراهيم بن ميمون، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يد الله مع الجماعة ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه من حديث ابن عباس إلا من هذا الوجه ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said:                     \"Allah's Hand is with the Jama'ah.\"",
      "chain": [
        "30221",
        "20121",
        "15005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3621",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "قال معمر فأخبرني ابن طاوس، عن أبيه، قال ما مست يد رسول الله صلى الله عليه وسلم يد امرأة إلا امرأة يملكها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "20115",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "519",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، قال سمعت معمرا، عن ابن طاوس، عن أبيه، عن ابن عباس، عن أبي هريرة، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعتين من صلاة العصر قبل أن تغرب الشمس أو ركعة من صلاة الصبح قبل أن تطلع الشمس فقد أدرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah, may Allah be pleased with him, that the Prophet (ﷺ) said:                      \"Whoever catches up with two Rak'ahs of 'Asr prayer before the sun sets, or one Rak'ah of the Subh prayer before the sun rises, has caught it.\"",
      "chain": [
        "30449",
        "20288",
        "20115",
        "11433",
        "11053",
        "17",
        "13"
      ]
    },
    {
      "hadith_no": "575",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك المخرمي، قال حدثنا الفضل بن عنبسة، قال حدثنا وهيب، عن ابن طاوس، عن أبيه، قال قالت عائشة رضى الله عنها أوهم عمر - رضى الله عنه - إنما نهى رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تتحروا بصلاتكم طلوع الشمس ولا غروبها فإنها تطلع بين قرنى شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Tawus that his father said:                      \"'Aishah, may Allah be please with her, said: 'Umar, may Allah be please with him, is not correct, rather the Messenger of Allah (ﷺ) only prohibited, as he said: 'Do no deliberately seek to pray when the sun is rising or when it is setting, for it rises between the horns of a Shaitan.\"",
      "chain": [
        "30271",
        "30366",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "576",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا الفضل بن عنبسة، قال أنبأنا وهيب، عن ابن طاوس، عن أبيه، قال قالت عائشة أوهم عمر - رضى الله عنه - إنما نهى رسول الله صلى الله عليه وسلم أن يتحرى طلوع الشمس أو غروبها ‏.‏",
      "text_en": "",
      "chain": [
        "30366",
        "20299",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "958",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبد الملك بن عبد الحميد بن ميمون بن مهران، قال حدثنا ابن حنبل، قال حدثنا إبراهيم بن خالد، قال حدثنا رباح، عن معمر، عن ابن طاوس، عن عكرمة بن خالد، عن جعفر بن المطلب بن أبي وداعة، عن أبيه، قال قرأ رسول الله صلى الله عليه وسلم بمكة سورة النجم فسجد وسجد من عنده فرفعت رأسي وأبيت أن أسجد ولم يكن يومئذ أسلم المطلب ‏.‏",
      "text_en": " It was narrated from Ja'far bin Al-Muttalib bin Abi Wada'ah that:                     His father said: \"The Messenger of Allah (ﷺ) recited Surat An-Najm in Makkah and prostrated, and those who were with him prostrated. I raised my head and refused to prostrate.\" At that time Al-Muttalib had not yet accepted Islam.",
      "chain": [
        "38072",
        "20115",
        "11433",
        "11709",
        "2018"
      ]
    },
    {
      "hadith_no": "1096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، ويونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن ابن جريج، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة - لا أكف الشعر ولا الثياب - الجبهة والأنف واليدين والركبتين والقدمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     The Messenger of Allah (ﷺ) said: \"I have been commanded to prostrate on seven, and not to tuck up my hair nor my garment: the forehead, the nose, the hands, the knees and the feet.\"",
      "chain": [
        "30485",
        "30493",
        "36017",
        "20029",
        "11070",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1097",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عمرو بن منصور النسائي، قال حدثنا المعلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة أعظم على الجبهة وأشار بيده على الأنف واليدين والركبتين وأطراف القدمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Prophet (ﷺ) said: \"I have been commanded to prostrate on seven bones: on the forehead\"- and he pointed with his hand- \"on the nose, the hands, the knees and the ends of the feet.\"",
      "chain": [
        "38433",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1098",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن منصور المكي، وعبد الله بن محمد بن عبد الرحمن الزهري، قالا حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، أمر النبي صلى الله عليه وسلم أن يسجد على سبع - ونهي أن يكفت الشعر والثياب - على يديه وركبتيه وأطراف أصابعه ‏.‏ قال سفيان قال لنا ابن طاوس ووضع يديه على جبهته وأمرها على أنفه ‏.‏ قال هذا واحد واللفظ لمحمد ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     \"The Prophet (ﷺ) was commanded to prostrate on seven-and he was forbidden to tuck up his hair and garment-on his hands, his knees, the edges of his feet.\" Sufyan said: \"Ibn Tawus said to us: 'He put his hand on his forehead and moved it down to his nose and said: This one thing.'\"",
      "chain": [
        "36658",
        "20005",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا سعيد بن عبد الرحمن المخزومي، قال حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، وابن، طاوس عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون السابقون بيد أنهم أوتوا الكتاب من قبلنا وأوتيناه من بعدهم وهذا اليوم الذي كتب الله عز وجل عليهم فاختلفوا فيه فهدانا الله عز وجل له - يعني يوم الجمعة - فالناس لنا فيه تبع اليهود غدا والنصارى بعد غد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'We are the last (to come) but will be the foremost on the Day of Resurrection, but they were given the Book before us and we were given it after them. They differed concerning this day which Allah (SWT), the Mighty and Sublime, had prescribed for them and Allah (SWT), the Mighty and Sublime, guided us to\"--meaning Friday--\"so the people follow us, the Jews the next day and the Christians the day after that.'\"",
      "chain": [
        "38231",
        "20005",
        "11061",
        "11197",
        "13",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2085",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو هشام، قال حدثنا وهيب بن خالد أبو بكر، قال حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يحشر الناس يوم القيامة على ثلاث طرائق راغبين راهبين اثنان على بعير وثلاثة على بعير وأربعة على بعير وعشرة على بعير وتحشر بقيتهم النار تقيل معهم حيث قالوا وتبيت معهم حيث باتوا وتصبح معهم حيث أصبحوا وتمسي معهم حيث أمسوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'The people will be gathered on the Day of Resurrection in three ways. (the first will be) those who have the hope (of Paradise) and the fear (of punishment). (the second will be) those who come riding two on a camel, or three on a camel, or four on a camel, or the on a camel, or four on a camel, or ten on a camel or ten o a camel. And the rest of them will be gathered by the Fire which will accompany them, stopping with them where they rest in the afternoon, and staying with them where they stop overnight, and staying with them wherever they are in the morning, and in the evening.\"\"",
      "chain": [
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2089",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن رافع، عن عبد الرزاق، قال حدثنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال أرسل ملك الموت إلى موسى عليه السلام فلما جاءه صكه ففقأ عينه فرجع إلى ربه فقال أرسلتني إلى عبد لا يريد الموت ‏.‏ فرد الله عز وجل إليه عينه وقال ارجع إليه فقل له يضع يده على متن ثور فله بكل ما غطت يده بكل شعرة سنة ‏.‏ قال أى رب ثم مه قال الموت ‏.‏ قال فالآن ‏.‏ فسأل الله عز وجل أن يدنيه من الأرض المقدسة رمية بحجر ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فلو كنت ثم لأريتكم قبره إلى جانب الطريق تحت الكثيب الأحمر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The angel of death was sent to Musa. Peace be upon him, and when he came to him, he slapped him and put his eye out he went back to his Lord and said: 'Go back to him and tell him to put his hand on the back of a bull, and of every hair that his hand covers he will have one year.' He said: 'O Lord, then what?' He said; 'Death.' He said: 'Let me go now.' And he (Musa) asked his Lord to bring him within a stone's throw of the Holy Land, the distance of a stone's throw. The Messenger of Allah said: 'If I where there, I would show you his grave, beside the road beneath a red dune.\"'",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2548",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا وهيب، قال حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل البخيل والمتصدق مثل رجلين عليهما جنتان من حديد قد اضطرت أيديهما إلى تراقيهما فكلما هم المتصدق بصدقة اتسعت عليه حتى تعفي أثره وكلما هم البخيل بصدقة تقبضت كل حلقة إلى صاحبتها وتقلصت عليه وانضمت يداه إلى تراقيه ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فيجتهد أن يوسعها فلا تتسع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"The parable of the miser and the one who gives in charity is that of two men wearing coats of mail with their hands tied to their collarbones. Every time the one who gives thinks of giving in charity, the (coat of mail) expands until it obliterates his traces, and every time the miser thinks of giving charity, every circle (of the coat of mail) contracts and sticks to him, and his hand is tied up to his collarbones.\" I heard the Messenger of Allah say: \"He tries to expand it, but he cannot.\"",
      "chain": [
        "38022",
        "30106",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2636",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا سعيد بن عبد الرحمن أبو عبيد الله المخزومي، قال حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، مثله ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     (Another chain) with a similar report narrated from Ibn 'Abbas. (sahih)",
      "chain": [
        "20012",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "2654",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا الربيع بن سليمان، صاحب الشافعي قال حدثنا يحيى بن حسان، قال حدثنا وهيب، وحماد بن زيد، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة ولأهل الشام الجحفة ولأهل نجد قرنا ولأهل اليمن يلملم وقال ‏\"‏ هن لهن ولكل آت أتى عليهن من غيرهن فمن كان أهله دون الميقات حيث ينشئ حتى يأتي ذلك على أهل مكة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah designated Dhul-Hulaifah as the Miqat for the people of Al-Madinah Al-Juhfah for the people of Najd, and Yalmlam for the people of Yemen. He said: \"They are for them, and for anyone who comes to them from elsewhere. If a person's place of residence is within the boundary of the Miqat, then (he should enter into Ihram) from where he starts his journey, and this also applies to the people of Makkah.''(Sihah)",
      "chain": [
        "30583",
        "20300",
        "20299",
        "20022",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2657",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، عن محمد بن جعفر، قال حدثنا معمر، قال أخبرني عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة ولأهل الشام الجحفة ولأهل نجد قرنا ولأهل اليمن يلملم قال ‏\"‏ هن لهم ولمن أتى عليهن ممن سواهن لمن أراد الحج والعمرة ومن كان دون ذلك من حيث بدأ حتى يبلغ ذلك أهل مكة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of 'Allah designated Dhul-Hulaifah as the Miqat for the people of Al-Madinah, Al-Juhfah for the people of Ash-sham, Qarn for the people of Najd, and Yalamalam for the people of Yemen. He aid: \"They are for them and for those who pass by them who are not of their people who intend to perform Hajj and 'Umrah. If a person's place of residence is within the boundary of the Miqat, then (he should enter into Ihram) from where he starts his journey, and this also applies to the people of Makkah.''",
      "chain": [
        "30400",
        "20173",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2813",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الأعلى بن واصل بن عبد الأعلى، قال حدثنا أبو أسامة، عن وهيب بن خالد، قال حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال كانوا يرون أن العمرة، في أشهر الحج من أفجر الفجور في الأرض ويجعلون المحرم صفر ويقولون إذا برأ الدبر وعفا الوبر وانسلخ صفر - أو قال دخل صفر - فقد حلت العمرة لمن اعتمر فقدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏\"‏ الحل كله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"They used to think that performing 'Umrah during the months of Hajj was one of the worst of evil actions on Earth, and they used to call Muharram 'Safar,' and say: 'When the sore on the backs of the camels have healed and when their hair grows back and when Safar is over' - or he said: 'When Safar beings - then 'Umrah becomes permissible for whoever wants to do it.' Then the Prophet and his companions came on the morning of the fourth of Dhul-Hijjah, reciting the Talbiyah for Hajj, He told them to make it 'Umrah, and they found it too difficult to do that. They said: 'O Messenger of Allah, to what degree should we exit Ihram?' He said: 'Completely.'\"",
      "chain": [
        "20318",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2988",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن معاوية، قال قصرت عن رسول الله صلى الله عليه وسلم على المروة بمشقص أعرابي ‏.‏",
      "text_en": " It was narrated that Muawiyah said:                     \"I cut the hair of the Messenger of Allah at Al-Marwah with the edge of a Bedouin arrow.",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "hadith_no": "3406",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا أبو عاصم، عن ابن جريج، عن ابن طاوس، عن أبيه، أن أبا الصهباء، جاء إلى ابن عباس فقال يا ابن عباس ألم تعلم أن الثلاث، كانت على عهد رسول الله صلى الله عليه وسلم وأبي بكر وصدرا من خلافة عمر رضي الله عنهما ترد إلى الواحدة قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn Tawus, from his father, that Abu As-Sahba' came to Ibn 'Abbas and said:                      \"O Ibn 'Abbas! Did you not know that the threefold divorce during the time of the Messenger of Allah and Abu Bakr, and during the early part of 'Umar's Caliphate, used to be counted as one divorce?\" He said: \"Yes.\"",
      "chain": [
        "20241",
        "11070",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "3691",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن عبد الله الخلنجي المقدسي، قال حدثنا أبو سعيد، - وهو مولى بني هاشم - عن وهيب، قال حدثنا ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العائد في هبته كالكلب يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah said: 'The one who takes back his gift is like the dog which vomits then goes back to its vomit.'\"",
      "chain": [
        "20195",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3701",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا إسحاق، قال حدثنا المخزومي، قال حدثنا وهيب، قال حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العائد في هبته كالكلب يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Tawus, from his father, from Ibn 'Abbas, that the Messenger of Allah said:                      \"The one who takes back his gift, is like the dog which vomits then goes back to its vomit.\"",
      "chain": [
        "30021",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3716",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن ابن طاوس، عن أبيه، عن حجر المدري، عن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى للوارث ‏\"‏ ‏.‏",
      "text_en": " Sufyan narrated from Ibn Tawus, from his father, from Hujr Al-Madari, from Zaid, who said:                      \"The Messenger of Allah said: 'Umra (a gift given for life) is for the heir.'\"",
      "chain": [
        "20012",
        "11433",
        "11053",
        "15"
      ]
    },
    {
      "hadith_no": "3717",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن عبيد، قال حدثنا عبد الله بن المبارك، عن معمر، عن ابن طاوس، عن أبيه، عن حجر المدري، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ العمرى جائزة ‏\"‏ ‏.‏",
      "text_en": " Ma'mar narrated from Ibn Tawus, from his father, from Hujr Al-Madari, from Zaid bin Thabit, from Prophet, who said:                      \"'Umra (a gift given for life) is permissible.\"",
      "chain": [
        "30213",
        "20025",
        "20115",
        "11433",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا نوح بن حبيب، قال أنبأنا عبد الرزاق، قال أنبأنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فقال إن شاء الله فقد استثنى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'Whoever swears an oath and says: \"If Allah wills, then he has made an exception.\"'\"",
      "chain": [
        "38671",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3856",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، رفعه ‏\"‏ قال سليمان لأطوفن الليلة على تسعين امرأة تلد كل امرأة منهن غلاما يقاتل في سبيل الله فقيل له قل إن شاء الله ‏.‏ فلم يقل فطاف بهن فلم تلد منهن إلا امرأة واحدة نصف إنسان ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله لم يحنث وكان دركا لحاجته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah, who attributed it to the Prophet:                      \"Sulaiman said: 'I will certainly go around to ninety women tonight, each of whom will bear a child who will fight in the cause of Allah.' It was said to him: 'Say: If Allah wills' but he did not say it. He went around to them but none of them bore a child except for one woman who bore half a person.\" The Messenger of Allah said: \"If he had said: 'If Allah wills,' he would not have broken his vow, and this would have been a means to help him to get what he wanted.\"",
      "chain": [
        "30437",
        "20121",
        "20115",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الفضل بن موسى، قال حدثنا معمر، عن ابن طاوس، عن أبيه، عن ابن الزبير، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شهر سيفه ثم وضعه فدمه هدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Az-Zubair that:                     The Messenger of Allah [SAW] said: \"Whoever unsheathes his sword and starts to strike the people with it, it is permissible to shed his blood.\"",
      "chain": [
        "30123",
        "20452",
        "20115",
        "11433",
        "11053",
        "106"
      ]
    },
    {
      "hadith_no": "4099",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو عاصم، عن ابن جريج، عن ابن طاوس، عن أبيه، عن ابن الزبير، قال من رفع السلاح ثم وضعه فدمه هدر ‏.‏",
      "text_en": " It was narrated that Ibn Az-Zubair said:                     \"Whoever wields a weapon and starts to strike (the people) with it, it is permissible to shed his blood.\"",
      "chain": [
        "30002",
        "20241",
        "11070",
        "11433",
        "11053",
        "106"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرني محمد بن داود، قال حدثنا معلى بن أسد، قال حدثنا وهيب بن خالد، عن عبد الله بن طاوس، عن أبيه، عن صفوان بن أمية، قال قلت يا رسول الله إنهم يقولون إن الجنة لا يدخلها إلا مهاجر ‏.‏ قال ‏\"‏ لا هجرة بعد فتح مكة ولكن جهاد ونية فإذا استنفرتم فانفروا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Safwan bin Umayyah said:                     \"I said: 'O Messenger of Allah, they are saying that no one will enter Paradise except a Muhajir.\"' He said: \"There is no more emigration  (Hijrah) after the Conquest of Makkah, rather there is Jihad and intention. When you are called to moblize (for Jihad) then do so.\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "449"
      ]
    },
    {
      "hadith_no": "4447",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني عثمان بن عبد الله، قال حدثني سهل بن بكار، قال حدثنا وهيب بن خالد، عن ابن طاوس، عن عمرو بن شعيب، عن أبيه، محمد بن عبد الله بن عمرو قال مرة عن أبيه، وقال، مرة عن جده، أن رسول الله صلى الله عليه وسلم نهى يوم خيبر عن لحوم الحمر الأهلية وعن الجلالة وعن ركوبها وعن أكل لحمها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his father Muhammad bin 'Abdullah bin 'Amr - or on one occasion he said:                     from his father, form his grandfather - the on the Day of Kahaibar, the Messenger of Allah forbade the flesh of domesticated donkeys and of al-Jallalah (animals that eat dung), and (he forbade) riding them and eating their mat.\"",
      "chain": [
        "11524",
        "30138",
        "20299",
        "11433",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4500",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن رافع، قال أنبأنا عبد الرزاق، قال أنبأنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم أن يتلقى الركبان وأن يبيع حاضر لباد ‏.‏ قلت لابن عباس ما قوله حاضر لباد قال لا يكون له سمسارا ‏.‏",
      "text_en": " It was narrate from Ibn Tawus, from his father, that Ibn 'Abbas said;\"The Messenger of Allah forbade meeting the riders, and for a town-dweller.\" I said to Ibn 'Abbas:                      \"What does a town-dweller (selling) for a desert-dweller mean?\" he said: \"He should not act as a broker for him,\"",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، عن سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبيعه حتى يكتاله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'Whoever buys food, let him not sell it until he has checked its weight.\"\"",
      "chain": [
        "38011",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4599",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن ابن طاوس، عن طاوس، قال سمعت ابن عباس، يقول أما الذي نهى عنه رسول الله صلى الله عليه وسلم أن يباع حتى يستوفى الطعام ‏.‏",
      "text_en": " It was narrated that Tawus said:                     \"I heard Ibn 'Abbas say: 'As for that which the Messenger of Allah forbade, (it is) selling before taking possession of food.\"'",
      "chain": [
        "30367",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4600",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا عبد الرزاق، قال حدثنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبيعه حتى يقبضه ‏\"‏ ‏.‏ قال ابن عباس فأحسب أن كل شىء بمنزلة الطعام ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'Whoever buys food let him not sell it until he takes possession of it. Ibn 'Abbas said: \"I think the same applies to everything else as to food.\"",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "5317",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني حاجب بن سليمان، عن ابن أبي رواد، قال حدثنا ابن جريج، عن ابن طاوس، عن أبيه، عن عبد الله بن عمرو، أنه أتى النبي صلى الله عليه وسلم وعليه ثوبان معصفران فغضب النبي صلى الله عليه وسلم وقال ‏\"‏ اذهب فاطرحهما عنك ‏\"‏ ‏.‏ قال أين يا رسول الله قال ‏\"‏ في النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that:                     He came to the Prophet [SAW] wearing two garments dyed with safflower. The Prophet [SAW] got angry and said: \"Go and take them off.\" He said: \"Where should I throw them, O Messenger of Allah?\" He said: \"In the fire.\"",
      "chain": [
        "38136",
        "11070",
        "11433",
        "11053",
        "29"
      ]
    },
    {
      "hadith_no": "5605",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا نصر بن علي، قال أخبرني أبي قال، حدثنا إبراهيم بن نافع، عن ابن طاوس، عن أبيه، عن ابن عمر، قال خطب رسول الله صلى الله عليه وسلم فذكر آية الخمر فقال رجل يا رسول الله أرأيت المزر قال ‏\"‏ وما المزر ‏\"‏ ‏.‏ قال حبة تصنع باليمن ‏.‏ فقال ‏\"‏ تسكر ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] delivered a Khutbah and quoted the Verse about Khamr. A man said: 'O Messenger of Allah, what do you think about Al-Mizr (beer)?' He said: 'What is beer?' He said: 'A (drink) from grains that is made in Yemen.' He said: 'Does it intoxicate?' He said: 'Yes.' He said: 'Every intoxicant is unlawful.'\"",
      "chain": [
        "30395",
        "20264",
        "20189",
        "11433",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "5625",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا جعفر بن مسافر، قال حدثنا يحيى بن حسان، قال حدثنا وهيب، قال حدثنا ابن طاوس، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الدباء ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] forbade Ad-Dubba' (gourds).",
      "chain": [
        "38132",
        "20300",
        "20299",
        "11433",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "5712",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الجارود بن معاذ، - هو باوردي - قال حدثنا أبو سفيان، محمد بن حميد عن معمر، عن ابن طاوس، عن أبيه، أنه كان يكره أن يبيع الزبيب، لمن يتخذه نبيذا ‏.‏",
      "text_en": " It was narrated from Ibn Tawus, from his father, that:                     He disliked to sell raisins to one who would use them to make Nabidh.",
      "chain": [
        "20115",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أنبأنا معمر، عن ابن طاوس، عن أبيه، قال سمعت ابن عباس، يقول إنما كنا نحفظ الحديث والحديث يحفظ عن رسول الله  صلى الله عليه وسلم  فأما إذا ركبتم الصعب والذلول فهيهات ‏.‏",
      "text_en": " It was narrated from Ibn Tawus that his father said:                     \"I heard Ibn 'Abbas saying: 'We used to memorize Ahadith, and Ahadith were memorized from the Messenger of Allah (ﷺ). But if you go to the extremes of either exaggeration or negligence (in narrating Ahadith), there is no way we can trust your Ahadith.'\"",
      "chain": [
        "30437",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "914",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أيوب بن محمد الهاشمي، حدثنا عمر بن رياح، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  كان يرفع يديه عند كل تكبيرة ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)used toraise his hands at every Takbir (saying Allahu Akbar).",
      "chain": [
        "34035",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "934",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أسجد على سبع ولا أكف شعرا ولا ثوبا ‏\"‏ ‏.‏ قال ابن طاوس فكان أبي يقول اليدين والركبتين والقدمين وكان يعد الجبهة والأنف واحدا ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      The Messenger of Allah (ﷺ)said:“I have been commanded to prostrate on seven, but not to tuck upmyhair or my garment.”",
      "chain": [
        "30288",
        "20012",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أنبأنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حلف فقال إن شاء الله فله ثنياه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     'Whoever swears an oath and says In sha' Allah, he will have made an exception.\"(2)",
      "chain": [
        "30437",
        "20121",
        "20115",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2246",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن أبي عمر العدني، حدثنا سفيان بن عيينة، عن ابن طاوس، عن أبيه، عن ابن عباس، أن النبي  صلى الله عليه وسلم  احتجم وأعطاه أجره ‏.‏ قال ابن ماجه تفرد به ابن أبي عمر وحده ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Prophet (ﷺ) was treated with cupping and he gave him (the cupper) his wages. (Sahih)Ibn Abu 'Umar was alone in narrating it. That was said by Ibn Majah. [1]",
      "chain": [
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2261",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أنبأنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  أن يبيع حاضر لباد ‏.‏ قلت لابن عباس ما قوله حاضر لباد قال لا يكون له سمسارا ‏.‏",
      "text_en": " Ibn Tawus narrated from his father that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) forbade a city-dweller to sell for a Bedouin.\" (Sahih)I (Tawus) said to Ibn 'Abbas: \"What is meant by the words: 'A city-dweller selling for a Bedouin?' He said: \"He should not be a broker for him.\"",
      "chain": [
        "30437",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2551",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أنبأنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يمنح أحدكم أخاه أرضه خير له من أن يأخذ عليها كذا وكذا ‏\"‏ ‏.‏ لشىء معلوم ‏.‏ وقال ابن عباس هو الحقل وهو بلسان الأنصار المحاقلة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:                     “If one of you were to lend his brother his land, it would be better for him than taking such and such rent for it.”",
      "chain": [
        "30437",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2845",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا عبد الرزاق، أنبأنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقسموا المال بين أهل الفرائض على كتاب الله فما تركت الفرائض فلأولى رجل ذكر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: ‘Distribute wealth among those who are entitled to shares ofinheritance, according to the Book of Allah, then whatever is leftover goes to the nearest male relative.’”",
      "chain": [
        "30437",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3758",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا إسحاق بن منصور، حدثنا محمد بن طلحة، عن حميد بن وهب، عن ابن طاوس، عن طاوس، عن ابن عباس، قال مر النبي  صلى الله عليه وسلم  على رجل قد خضب بالحناء فقال ‏\"‏ ما أحسن هذا ‏\"‏ ‏.‏ ثم مر بآخر قد خضب بالحناء والكتم فقال ‏\"‏ هذا أحسن من هذا ‏\"‏ ‏.‏ ثم مر بآخر قد خضب بالصفرة فقال ‏\"‏ هذا أحسن من هذا كله ‏\"‏ ‏.‏ قال وكان طاوس يصفر ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) passed by amanwho had dyed his hair with henna and said: ‘How handsome this is!’Then he passed by another who had dyed his hair with henna and Katam,and said: ‘This one is more handsome than that one.’ Then hepassed byanother who had dyed his hair yellow and said: ‘This oneis morehandsome than all of them.’”",
      "chain": [
        "20436",
        "30313",
        "20604",
        "23013",
        "11433",
        "11053",
        "17"
      ]
    }
  ],
  "total_hadiths": 142
}