{
  "id": "11430",
  "name": "Shbyb bin Ghrqd'h شبيب بن غرقدة",
  "full_name": "Shbyb bin Ghrqd'h شبيب بن غرقدة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5176",
      "name": "'Urwa bin al-Ja'd / Abi al-Ja'd ( عروة بن الجعد / بن أبي الجعد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19868",
      "name": "Sulaiman bin 'Amr bin al-Ahws سليمان بن عمرو بن الأحوص",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10784",
      "name": "'Abdullah bin Shhab عبد الله بن شهاب الخولاني أبو الجزل",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25053",
      "name": "al-Hasan bin Amarh الحسن بن عمارة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3685",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا سفيان، حدثنا شبيب بن غرقدة، قال سمعت الحى، يحدثون عن عروة، أن النبي صلى الله عليه وسلم أعطاه دينارا يشتري به شاة، فاشترى له به شاتين، فباع إحداهما بدينار وجاءه بدينار وشاة، فدعا له بالبركة في بيعه، وكان لو اشترى التراب لربح فيه‏.‏ قال سفيان كان الحسن بن عمارة جاءنا بهذا الحديث عنه، قال سمعه شبيب من عروة، فأتيته فقال شبيب إني لم أسمعه من عروة، قال سمعت الحى يخبرونه عنه‏.‏   ولكن سمعته يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الخير معقود بنواصي الخيل إلى يوم القيامة ‏\"‏‏.‏ قال وقد رأيت في داره سبعين فرسا‏.‏ قال سفيان يشتري له شاة كأنها أضحية‏.‏",
      "text_en": " Narrated `Urwa:                     That the Prophet gave him one Dinar so as to buy a sheep for him. `Urwa bought two sheep for him with the money. Then he sold one of the sheep for one Dinar, and brought one Dinar and a sheep to the Prophet. On that, the Prophet invoked Allah to bless him in his deals. So `Urwa used to gain (from any deal) even if he bought dust. (In another narration) `Urwa said, \"I heard Allah's Apostle saying, \"There is always goodness in horses till the Day of Resurrection.\" (The subnarrator added, \"I saw 70 horses in `Urwa's house.') (Sufyan said, \"The Prophet asked `Urwa to buy a sheep for him as a sacrifice.\")",
      "chain": [
        "30026",
        "20005",
        "11430",
        "10511"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أحمد بن جواس الحنفي أبو عاصم، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن عبد الله بن شهاب الخولاني، قال كنت نازلا على عائشة فاحتلمت في ثوبى فغمستهما في الماء فرأتني جارية لعائشة فأخبرتها فبعثت إلى عائشة فقالت ما حملك على ما صنعت بثوبيك قال قلت رأيت ما يرى النائم في منامه ‏.‏ قالت هل رأيت فيهما شيئا ‏.‏ قلت لا ‏.‏ قالت فلو رأيت شيئا غسلته لقد رأيتني وإني لأحكه من ثوب رسول الله صلى الله عليه وسلم يابسا بظفري ‏.‏",
      "text_en": " Abdullah b. Shihab al-Khaulani reported:                      I stayed in the house of 'A'isha and had a wet dream (and perceived its effect on my garment), so (in the morning) I dipped both (the clothes) in water. This (act of mine) was watched by a maid-servant of A'isha and she informed her. She (Hadrat A'isha) sent me a message: Whatprompted you to act like this with your clothes? He (the narrator) said: I told that I saw in a dream what a sleeper sees. She said: Did you find (any mark of the fluid) on your clothes? I said: No. She said: Had you found anything you should have washed it. Incase I found that (semen) on the garment of the Messenger of Allah (may peace be upon him) dried up, I scraped it off with my nails.",
      "chain": [
        "30461",
        "20327",
        "11430",
        "10784"
      ]
    },
    {
      "hadith_no": "4960",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، وأبو بكر بن أبي شيبة جميعا عن أبي، الأحوص ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر، كلاهما عن سفيان، جميعا عن  شبيب بن غرقدة، عن عروة البارقي، عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكر الأجر والمغنم ‏.‏ وفي حديث سفيان سمع عروة البارقي سمع النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of 'Urwat al-Bariqi does not mention (the words):                     \" reward and booty\".",
      "chain": [
        "30399",
        "30503",
        "20327",
        "30123",
        "30421",
        "11430",
        "5176"
      ]
    },
    {
      "hadith_no": "3334",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا شبيب بن غرقدة، عن سليمان بن عمرو، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم في حجة الوداع يقول ‏\"‏ ألا إن كل ربا من ربا الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون ‏.‏ ألا وإن كل دم من دم الجاهلية موضوع وأول دم أضع منها دم الحارث بن عبد المطلب ‏\"‏ ‏.‏ كان مسترضعا في بني ليث فقتلته هذيل ‏.‏ قال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ قالوا نعم ‏.‏ ثلاث مرات ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " Narrated Sulaiman b. 'Amr:                     On the authority of his father: I heard the Messenger of Allah (ﷺ) say in the Farewell Pilgrimage: \"Lo, all claims to usury of the pre-Islamic period have been abolished. You shall have your capital sums, deal not unjustly and you shall not be dealt with unjustly. Lo, all claims for blood-vengeance belonging to the pre-Islamic period have been abolished. The first of those murdered among us whose blood-vengeance I remit is al-Harith ibn AbdulMuttalib, who suckled among Banu Layth and killed by Hudhayl.\" He then said: O Allah, have I conveyed the message? They said: Yes, saying it three times. He then said: O Allah, be witness, saying it three times.",
      "chain": [
        "30175",
        "20327",
        "11430"
      ]
    },
    {
      "hadith_no": "3384",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن شبيب بن غرقدة، حدثني الحى، عن عروة، - يعني ابن أبي الجعد البارقي - قال أعطاه النبي صلى الله عليه وسلم دينارا يشتري به أضحية أو شاة فاشترى شاتين فباع إحداهما بدينار فأتاه بشاة ودينار فدعا له بالبركة في بيعه فكان لو اشترى ترابا لربح فيه ‏.‏",
      "text_en": " Narrated Urwah ibn AbulJa'd al-Bariqi:                     The Prophet (ﷺ) gave him a dinar to buy a sacrificial animal or a sheep. He bought two sheep, sold one of them for a dinar, and brought him a sheep and dinar. So he invoked a blessing on him in his business dealing, and he was such that if had he bought dust he would have made a profit from it.",
      "chain": [
        "30175",
        "20012",
        "11430"
      ]
    },
    {
      "hadith_no": "1196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، قال حدثني أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ فذكر في الحديث قصة فقال ‏\"‏ ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم ألا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى قوله ‏\"‏ عوان عندكم ‏\"‏ ‏.‏ يعني أسرى في أيديكم ‏.‏",
      "text_en": " Sulaiman bin Amr bin Al-Ahwas said:                      “My father narrated to me that he witnessed the farewell Hajj with the Messenger of Allah. So he thanked and praised Allah and he reminded and gave admonition. He mentioned a story in his narration and he (the Prophet) said: “And indeed I order you to be good to the women, for they are but captives with you over whom you have no power than that, except if they come with manifest Fahishah (evil behavior). If they do that, then abandon their beds and beat them with a beating that is not harmful. And if they obey you then you have no cause against them. Indeed you have rights over your women, and your women have rights over you. As for your rights over your women, then they must not allow anyone whom you dislike to treat on your bedding (furniture), nor to admit anyone in your home that you dislike. And their rights over you are that you treat them well in clothing them and feeding them.”",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "2159",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول في حجة الوداع للناس ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ قالوا يوم الحج الأكبر ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا في بلدكم هذا ألا لا يجني جان إلا على نفسه ألا لا يجني جان على ولده ولا مولود على والده ألا وإن الشيطان قد أيس من أن يعبد في بلادكم هذه أبدا ولكن ستكون له طاعة فيما تحتقرون من أعمالكم فسيرضى به ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي بكرة وابن عباس وجابر وحذيم بن عمرو السعدي ‏.‏ وهذا حديث حسن صحيح ‏.‏ وروى زائدة عن شبيب بن غرقدة نحوه ولا نعرفه إلا من حديث شبيب بن غرقدة ‏.‏",
      "text_en": " Sulaiman bin 'Amr bin Al-Ahwas narrated from his father who said:                      \"During the Farewell Pilgrimage, I heard the Messenger of Allah(s.a.w) saying:'Which day is this?' They said:'The day of Al-Hajj Al-Akbar.'He said:'Indeed your blood, your wealth, your honour is sacred to each other, just as this day of yours is sacred in this city of yours. Indeed, no one commits a crime except against himself. Indeed none commits a crime for which his son is accountable, nor does a child commit a crime for which his father is held accountable. Indeed Ash-Shaitan has lost hope of ever being worshipped in this city of yours, but he will have compliance in what deeds of yours you consider insignificant, which he will be content with.\"'",
      "chain": [
        "30480",
        "20327",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "3367",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا حسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، حدثنا أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ أى يوم أحرم أى يوم أحرم أى يوم أحرم ‏\"‏ ‏.‏ قال فقال الناس يوم الحج الأكبر يا رسول الله ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في بلدكم هذا في شهركم هذا ألا لا يجني جان إلا على نفسه ولا يجني والد على ولده ولا ولد على والده ألا إن المسلم أخو المسلم فليس يحل لمسلم من أخيه شيء إلا ما أحل من نفسه ألا وإن كل ربا في الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون غير ربا العباس بن عبد المطلب فإنه موضوع كله ألا وإن كل دم كان في الجاهلية موضوع وأول دم أضع من دماء الجاهلية دم الحارث بن عبد المطلب كان مسترضعا في بني ليث فقتلته هذيل ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم من تكرهون ألا وإن حقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه أبو الأحوص عن شبيب بن غرقدة ‏.‏",
      "text_en": " Narrated Sulaiman bin 'Amr bin Al-Ahwas:                     \"My father narrated to me that he attended the Farewell Hajj with the Messenger of Allah (ﷺ). He (ﷺ) expressed his gratitude to Allah and praised Him, and reminded and exhorted, then he said: 'Which day is most sacred? Which day is most sacred? Which day is most sacred?' He said: \"So the people said: 'The day of Al-Hajj Al-Akbar O Messenger of Allah!' So he said: 'Indeed, your blood, your wealth, your honor, is as sacred for you as the sacredness of this day of yours, in this city of yours, in this month of yours. Behold! None commits a crime but against himself, none offends a father for a son, nor a son for a father. Behold! Indeed the Muslim is the brother of the Muslim, so it is not lawful for the Muslim to do anything to his brother, which is not lawful to be done to himself. Behold! All Riba from Jahiliyyah is invalid, for you is the principle of your wealth, but your are not to wrong nor be wronged - except in the case of Riba of Al-'Abbas bin 'Abdul-Muttalib - otherwise it is all invalid. Behold! All retribution regarding cases of blood during Jahiliyyah are invalid. The first case of blood retribution invalidated among those of Jahiliyyah, is the blood of Al-Harith bin 'Abdul-Muttalib who was nursed among Banu Laith and killed by Hudhail. Behold! I order you to treat women well, for they are but like captives with you, you have no sovereignty beyond this over them, unless they manifest lewdness. If they do that, then abandon their beds, and beat them with a beating that is not painful. Then if they obey you, then there is no cause for you against them beyond that. Behold! There are rights for you upon your women, and rights for your women upon you. As for your rights upon them,then they are not to allow anyone on your bedding whom you dislike, nor to permit anyone whom you dislike in your homes. Behold! Indeed their rights upon you are that you treat them well in clothing them and feeding them.'\"",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "1924",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن شبيب بن غرقدة البارقي، عن سليمان بن عمرو بن الأحوص، حدثني أبي أنه، شهد حجة الوداع مع رسول الله  صلى الله عليه وسلم  فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ استوصوا بالنساء خيرا فإنما هن عندكم عوان ‏.‏ ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا إن لكم من نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Sulaiman bin Amr bin Ahwas said: “My father told me that he was present on the Farewell pilgrimage with the Messenger of Allah. He praised and glorified Allah, and reminder and exhorted (the people). The he said: 'I enjoin good treatment of women, for they are prisoners with you, and you have no right to treat them otherwise, unless they commit clear indecency. If they do that, then forsake them in their beds and hit them, but without causing injury or leaving a mark if they obey you, then do not seek means of annoyance against them. You have rights over your women and you women have rights over you. Your rights over you women are that they are not to allow anyone whom you dislike on treat on your bedding (furniture), not allow anyone whom you dislike to enter your houses. And their right over you are that should treat them kindly with regard to their clothing and food.' ”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن شبيب بن غرقدة، عن عروة البارقي، أن النبي صلى الله عليه وسلم أعطاه دينارا يشتري له شاة فاشترى له شاتين فباع إحداهما بدينار فأتى النبي صلى الله عليه وسلم بدينار وشاة فدعا له رسول الله صلى الله عليه وسلم بالبركة ‏.‏ قال فكان لو اشترى التراب لربح فيه ‏.‏",
      "text_en": " It was narrated from 'Urwah  Al-Bariqi that :                     the Prophet (ﷺ) gave him a Dinar to buy him a sheep, and he bought two sheep for him, then he sold one of them for a Dinar, and bought a Dinar and a sheep to the Prophet (ﷺ). The Messenger of Allah (ﷺ) prayed for blessing for him.",
      "chain": [
        "30201",
        "20005",
        "11430",
        "5176"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول في حجة الوداع ‏\"‏ ألا لا يجني جان إلا على نفسه لا يجني والد على ولده ولا مولود على والده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Amr bin Ahwas that his father said:                     I heard the Messenger of Allah (ﷺ) saying during the Farewell pilgrimage: “No criminal commits a crime but he brings. (the punishment for that) upon himself. No father can bring punishment upon his son by his crime, and no son can bring punishment upon his father.”",
      "chain": [
        "30201",
        "20327",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "2892",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن عروة البارقي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الخير معقود بنواصي الخيل إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Urwah Al-Bariqi that the Messenger of Allah(ﷺ)said:                      “Goodness is tied to the forelocks of horses until the DayofResurrection.”",
      "chain": [
        "30201",
        "20327",
        "11430",
        "5176"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، عن أبيه، قال سمعت النبي  صلى الله عليه وسلم  يقول في حجة الوداع ‏\"‏ يا أيها الناس ألا أى يوم أحرم ‏\"‏ ‏.‏ ثلاث مرات قالوا يوم الحج الأكبر ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا لا يجني جان إلا على نفسه ولا يجني والد على ولده ولا مولود على والده ‏.‏ ألا إن الشيطان قد أيس أن يعبد في بلدكم هذا أبدا ولكن سيكون له طاعة في بعض ما تحتقرون من أعمالكم فيرضى بها ألا وكل دم من دماء الجاهلية موضوع وأول ما أضع منها دم الحارث بن عبد المطلب - كان مسترضعا في بني ليث فقتلته هذيل - ألا وإن كل ربا من ربا الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون ألا يا أمتاه هل بلغت ‏\"‏ ‏.‏ ثلاث مرات قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his fathersaid:                      “Iheard the Prophet (ﷺ) say, during the Farewell Pilgrimage:‘Opeople! Which day is the most sacred?’ three times. They said: ‘Theday of the greatest Hajj.’ He said: ‘Your blood and your wealthandyour honor are sacred to one another, as sacred as this day ofyours,in this land of your. No sinner commits a sin but it isagainsthimself. No father is to be punished for the sins of hischild, and nochild is to be punished for the sins of his father.Satan hasdespaired of ever being worshipping in this land of yours,but he willbe obeyed in some matters which you regard asinsignificant, and hewill be content with that. All the blood feudsof the Ignorance daysare abolished, and the first of them that Iabolish is the blood feudof Harith bin ‘Abdul-Muttalib, who wasnursed among Banu Laith andkilled by Hudhail. All the usuries of theIgnorance days areabolished, but you will have your capital. Do notwrong others and youwill not be wronged. O my nation, have Iconveyed (the message)?’ (Heasked this) three times. They said:‘Yes.’ He said: ‘O Allah, bearwitness!’ three times.”",
      "chain": [
        "30201",
        "30480",
        "20327",
        "11430",
        "19868"
      ]
    }
  ],
  "total_hadiths": 13
}