{
  "id": "11432",
  "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
  "full_name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Aslami",
      "al-Mervazi"
    ]
  },
  "parents": [
    {
      "id": "3131",
      "name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10916",
      "name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [
    {
      "id": "18434",
      "name": "Skhr bin 'Abdullah صخر بن عبد الله بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "3131",
      "name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3242",
      "name": "'Abdullah bin Mughfal al-Mazni ( عبد الله بن مغفل المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "394",
      "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14113",
      "name": "Dghfl bin Hnzlh bin Zayd دغفل بن حنظلة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11578",
      "name": "Bashyr bin Ka'b bin Aby بشير بن كعب بن أبي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11280",
      "name": "Hameed bin 'Abdur Rahman حميد بن عبد الرحمن الحميري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11114",
      "name": "Abu al-Aswad al-Du'ali أبو الأسود الديلي/الدؤلي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11842",
      "name": "Hanzalah bin 'Ali bin al-Aslami حنظلة بن علي بن الأسقع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11316",
      "name": "Yahya bin Y'amar يحيى بن يعمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "10747",
      "name": "Bashyr bin al-Mhajr بشير بن المهاجر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14052",
      "name": "Thwab bin 'Utba al-Mhry al-Bsry ثواب بن عتبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28094",
      "name": "Hjyr bin 'Abdullah حجير بن عبد الله الكندي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20424",
      "name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "18434",
      "name": "Skhr bin 'Abdullah صخر بن عبد الله بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11344",
      "name": "Sa'd bin 'Ubaida al-Salmi سعد بن عبيدة السلمي أبو حمزة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10785",
      "name": "'Abdullah bin Ata'a عبد الله بن عطاء الطائفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28306",
      "name": "'Abdullah bin Muslim al-Salmi عبد الله بن مسلم السلمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "18681",
      "name": "'Ubaidullah bin 'Abdullah, Abu al-Munayb عبيد الله بن عبد الله أبو المنيب العتكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11600",
      "name": "'Uthman bin Ghyath عثمان بن غياث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11606",
      "name": "'Ali bin Suwayd bin Mnjwf علي بن سويد بن منجوف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11389",
      "name": "Maharab bin Dithar محارب بن دثار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10719",
      "name": "Matr bin Tahman al-Waraq مطر بن طهمان الوراق أبو رجاء الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14411",
      "name": "al-Waleed bin Tha'laba الوليد بن ثعلبة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "332",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن أبي سريج، قال أخبرنا شبابة، قال أخبرنا شعبة، عن حسين المعلم، عن ابن بريدة، عن سمرة بن جندب، أن امرأة، ماتت في بطن، فصلى عليها النبي صلى الله عليه وسلم فقام وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet offered the funeral prayer for the dead body of a woman who died during delivery (i.e. childbirth) and he stood by the middle of her body.",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو معمر  هو عبد الله بن عمرو  قال حدثنا عبد الوارث، عن الحسين، قال حدثنا عبد الله بن بريدة، قال حدثني عبد الله المزني، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم المغرب ‏\"‏‏.‏ قال الأعراب وتقول هي العشاء‏.‏",
      "text_en": " Narrated `Abdullah Al-Muzani:                     The Prophet said, \"Do not be influenced by bedouins regarding the name of your Maghrib prayer which is called `Isha' by them.\"",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "624",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن ابن بريدة، عن عبد الله بن مغفل المزني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بين كل أذانين صلاة  ثلاثا  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal Al-Muzani:                     Allah's Apostle said thrice, \"There is a prayer between the two Adhans (Adhan and Iqama),\" and added, \"For the one who wants to pray.\"",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "627",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يزيد، قال حدثنا كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال النبي صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة  ثم قال في الثالثة  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     The prophet said, \"There is a prayer between the two Adhans (Adhan and Iqama), there is a prayer between the two Adhans.\" And then while saying it the third time he added, \"For the one who wants to (pray).",
      "chain": [
        "1945",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1115",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن منصور، قال أخبرنا روح بن عبادة، أخبرنا حسين، عن عبد الله بن بريدة، عن عمران بن حصين  رضى الله عنه  أنه سأل نبي الله صلى الله عليه وسلم‏.‏ أخبرنا إسحاق قال أخبرنا عبد الصمد قال سمعت أبي قال حدثنا الحسين عن ابن بريدة قال حدثني عمران بن حصين  وكان مبسورا  قال سألت رسول الله صلى الله عليه وسلم عن صلاة الرجل قاعدا فقال ‏\"‏ إن صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     (who had piles) I asked Allah's Apostle about the praying of a man while sitting. He said, \"If he prays while standing it is better and he who prays while sitting gets half the reward of that who prays standing; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
      "chain": [
        "30313",
        "20229",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا حسين المعلم، عن عبد الله بن بريدة، أن عمران بن حصين  وكان رجلا مبسورا  وقال أبو معمر مرة عن عمران، قال سألت النبي صلى الله عليه وسلم عن صلاة الرجل وهو قاعد فقال ‏\"‏ من صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏ قال أبو عبد الله نائما عندي مضطجعا ها هنا‏.‏",
      "text_en": " Narrated `Abdullah bin Buraida:                     `Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked the Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray standing; and whoever prays sitting gets half the reward of that who prays while standing; and whoever prays while Lying gets half the reward of that who prays while sitting.' \"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "123",
        "123"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبدان، عن عبد الله، عن إبراهيم بن طهمان، قال حدثني الحسين المكتب، عن ابن بريدة، عن عمران بن حصين  رضى الله عنه  قال كانت بي بواسير فسألت النبي صلى الله عليه وسلم عن الصلاة فقال ‏\"‏ صل قائما، فإن لم تستطع فقاعدا، فإن لم تستطع فعلى جنب ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     had piles, so I asked the Prophet about the prayer. He said, \"Pray while standing and if you can't, pray while sitting and if you cannot do even that, then pray Lying on your side.\"",
      "chain": [
        "30349",
        "20025",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1183",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، قال حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلوا قبل صلاة المغرب ‏\"‏‏.‏  قال في الثالثة  لمن شاء كراهية أن يتخذها الناس سنة‏.‏",
      "text_en": " Narrated `Abdullah Al-Muzni:                     The Prophet said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third time, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to take it as a tradition.",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن سمرة  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها، فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا حسين، عن ابن بريدة، حدثنا سمرة بن جندب  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1368",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عفان بن مسلم، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن أبي الأسود، قال قدمت المدينة وقد وقع بها مرض، فجلست إلى عمر بن الخطاب  رضى الله عنه  فمرت بهم جنازة فأثني على صاحبها خيرا فقال عمر  رضى الله عنه  وجبت‏.‏ ثم مر بأخرى فأثني على صاحبها خيرا، فقال عمر  رضى الله عنه  وجبت‏.‏ ثم مر بالثالثة، فأثني على صاحبها شرا فقال وجبت‏.‏ فقال أبو الأسود فقلت وما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ فقلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ فقلنا واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
      "text_en": " Narrated Abu Al-Aswad:                     I came to Medina when an epidemic had broken out. While I was sitting with `Umar bin Al-Khattab a funeral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to him.\" And another funeral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to him.\" A third (funeral procession) passed by and the people spoke badly of the deceased. He said, \"It has been affirmed to him.\" I (Abu Al-Aswad) asked, \"O chief of the believers! What has been affirmed?\" He replied, \"I said the same as the Prophet had said, that is: if four persons testify the piety of a Muslim, Allah will grant him Paradise.\" We asked, \"If three persons testify his piety?\" He (the Prophet) replied, \"Even three.\" Then we asked, \"If two?\" He replied, \"Even two.\" We did not ask him regarding one witness.",
      "chain": [
        "30106",
        "20424",
        "11432",
        "11105"
      ]
    },
    {
      "hadith_no": "2643",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن أبي الأسود، قال أتيت المدينة وقد وقع بها مرض، وهم يموتون موتا ذريعا، فجلست إلى عمر  رضى الله عنه  فمرت جنازة فأثني خير فقال عمر وجبت‏.‏ ثم مر بأخرى فأثني خيرا فقال وجبت‏.‏ ثم مر بالثالثة فأثني شرا، فقال وجبت‏.‏ فقلت ما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ قلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ قلت واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
      "text_en": " Narrated Abu Al-Aswad:                     Once I went to Medina where there was an outbreak of disease and the people were dying rapidly. I was sitting with `Umar and a funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed.\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed (Paradise).\" Then a third funeral procession passed by and the people talked badly of the deceased. `Umar said, \"It has been affirmed (Hell).\" I asked `Umar, \"O chief of the believers! What has been affirmed?\" He said, \"I have said what the Prophet said. He said, 'Allah will admit into paradise any Muslim whose good character is attested by four persons.' We asked the Prophet, 'If there were three witnesses only?' He said, 'Even three.' We asked, 'If there were two only?' He said, 'Even two.' But we did not ask him about one witness.\"",
      "chain": [
        "20040",
        "20424",
        "11432",
        "11105"
      ]
    },
    {
      "hadith_no": "3474",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت سألت رسول الله صلى الله عليه وسلم عن الطاعون، فأخبرني ‏\"‏ أنه عذاب يبعثه الله على من يشاء، وأن الله جعله رحمة للمؤمنين، ليس من أحد يقع الطاعون فيمكث في بلده صابرا محتسبا، يعلم أنه لا يصيبه إلا ما كتب الله له، إلا كان له مثل أجر شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) I asked Allah's Apostle about the plague. He told me that it was a Punishment sent by Allah on whom he wished, and Allah made it a source of mercy for the believers, for if one in the time of an epidemic plague stays in his country patiently hoping for Allah's Reward and believing that nothing will befall him except what Allah has written for him, he will get the reward of a martyr.\"",
      "chain": [
        "20040",
        "20424",
        "11432",
        "11316",
        "53"
      ]
    },
    {
      "hadith_no": "3548",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، قال حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر، ومن ادعى قوما ليس له فيهم فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet said, \"If somebody claims to be the son of any other than his real father knowingly, he but disbelieves in Allah, and if somebody claims to belong to some folk to whom he does not belong, let such a person take his place in the (Hell) Fire.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "4393",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا روح بن عبادة، حدثنا علي بن سويد بن منجوف، عن عبد الله بن بريدة، عن أبيه  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم عليا إلى خالد ليقبض الخمس وكنت أبغض عليا، وقد اغتسل، فقلت لخالد ألا ترى إلى هذا فلما قدمنا على النبي صلى الله عليه وسلم ذكرت ذلك له فقال ‏\"‏ يا بريدة أتبغض عليا ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ لا تبغضه فإن له في الخمس أكثر من ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Buraida:                     The Prophet sent `Ali to Khalid to bring the Khumus (of the booty) and I hated `Ali, and `Ali had taken a bath (after a sexual act with a slave-girl from the Khumus). I said to Khalid, \"Don't you see this (i.e. `Ali)?\" When we reached the Prophet I mentioned that to him. He said, \"O Buraida! Do you hate `Ali?\" I said, \"Yes.\" He said, \"Do you hate him, for he deserves more than that from the Khumlus.\"",
      "chain": [
        "30160",
        "20229",
        "11606",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4513",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5537",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يوسف بن راشد، حدثنا وكيع، ويزيد بن هارون  واللفظ ليزيد  عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، أنه رأى رجلا يخذف فقال له لا تخذف فإن رسول الله صلى الله عليه وسلم نهى عن الخذف  أو كان يكره الخذف  وقال ‏\"‏ إنه لا يصاد به صيد ولا ينكى به عدو، ولكنها قد تكسر السن وتفقأ العين ‏\"‏‏.‏ ثم رآه بعد ذلك يخذف فقال له أحدثك عن رسول الله صلى الله عليه وسلم أنه نهى عن الخذف‏.‏ أو كره الخذف، وأنت تخذف لا أكلمك كذا وكذا‏.‏",
      "text_en": " Narrated `Abdullah bin Maghaffal:                     that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw stones, for Allah's Apostle has forbidden throwing stones, or e used to dislike it.\" `Abdullah added: Throwing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or gouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I tell you that Allah's Apostle has forbidden or disliked the throwing the stones (in such a way), yet you are throwing stones! I shall not talk to you for such-and-such a period.\"",
      "chain": [
        "30224",
        "20032",
        "20472",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "5793",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، عن عائشة، زوج النبي صلى الله عليه وسلم أنها أخبرتنا أنها سألت رسول الله صلى الله عليه وسلم عن الطاعون فأخبرها نبي الله صلى الله عليه وسلم ‏\"‏ أنه كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، فليس من عبد يقع الطاعون فيمكث في بلده صابرا، يعلم أنه لن يصيبه إلا ما كتب الله له، إلا كان له مثل أجر الشهيد ‏\"‏‏.‏ تابعه النضر عن داود‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that she asked Allah's Apostle about plague, and Allah's Apostle informed her saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made it a blessing for the believers. None (among the believers) remains patient in a land in which plague has broken out and considers that nothing will befall him except what Allah has ordained for him, but that Allah will grant him a reward similar to that of a martyr.\"",
      "chain": [
        "30312",
        "20218",
        "20424",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "5886",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، عن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر  رضى الله عنه  حدثه قال أتيت النبي صلى الله عليه وسلم وعليه ثوب أبيض وهو نائم، ثم أتيته وقد استيقظ فقال ‏\"‏ ما من عبد قال لا إله إلا الله‏.‏ ثم مات على ذلك، إلا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق على رغم أنف أبي ذر ‏\"‏‏.‏ وكان أبو ذر إذا حدث بهذا قال وإن رغم أنف أبي ذر‏.‏ قال أبو عبد الله هذا عند الموت أو قبله، إذا تاب وندم وقال لا إله إلا الله‏.‏ غفر له‏.‏",
      "text_en": " Narrated Abu Dharr:                     I came to the Prophet while he was wearing white clothes and sleeping. Then I went back to him again after he had got up from his sleep. He said, \"Nobody says: 'None has the right to be worshipped but Allah' and then later on he dies while believing in that, except that he will enter Paradise.' I said, \"Even It he had committed illegal sexual intercourse and theft.\" I said. \"Even if he had committed illegal sexual intercourse and theft? He said. 'Even If he had committed illegal sexual intercourse and theft,\" I said, 'Even it he had committed illegal sexual intercourse and thefts.' He said, \"Even If he had committed Illegal sexual intercourse and theft, inspite of the Abu Dharrs dislikeness. Abu `Abdullah said, \"This is at the time of death or before it if one repents and regrets and says \"None has the right to be worshipped but Allah. He will be forgiven his sins.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "6114",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن عبد الله بن بريدة، حدثني يحيى بن يعمر، أن أبا الأسود الديلي، حدثه عن أبي ذر  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا يرمي رجل رجلا بالفسوق، ولا يرميه بالكفر، إلا ارتدت عليه، إن لم يكن صاحبه كذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     That he heard the Prophet saying, \"If somebody accuses another of Fusuq (by calling him 'Fasiq' i.e. a wicked person) or accuses him of Kufr, such an accusation will revert to him (i.e. the accuser) if his companion (the accused) is innocent.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "6379",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، حدثنا عبد الله بن بريدة، عن بشير بن كعب العدوي، قال حدثني شداد بن أوس  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ سيد الاستغفار أن تقول اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك على وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت ‏\"‏‏.‏ قال ‏\"‏ ومن قالها من النهار موقنا بها، فمات من يومه قبل أن يمسي، فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها، فمات قبل أن يصبح، فهو من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Shaddad bin Aus:                     The Prophet said \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta Rabbi la ilaha illa anta, Anta Khalaqtani wa ana `Abduka, wa ana 'ala ahdika wa wa'dika mastata'tu, A`udhu bika min Sharri ma sana'tu, abu'u Laka bini'matika 'alaiya, wa abu'u laka bidhanbi faghfir lee fa innahu la yaghfiru adhdhunuba illa anta.\" The Prophet added. \"If somebody recites it during the day with firm faith in it, and dies on the same day before the evening, he will be from the people of Paradise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will be from the people of Paradise.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "6396",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن بشير بن كعب، عن شداد بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ سيد الاستغفار اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أبوء لك بنعمتك، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت، أعوذ بك من شر ما صنعت‏.‏ إذا قال حين يمسي فمات دخل الجنة  أو كان من أهل الجنة  وإذا قال حين يصبح فمات من يومه ‏\"‏‏.‏ مثله‏.‏",
      "text_en": " Narrated Shaddad bin 'Aus:                     The Prophet said, \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta Rabbi la ilaha illa anta. Khalaqtani wa ana `Abduka, wa ana 'ala 'ahdika wa Wa'dika mastata'tu abu'u Laka bi ni 'matika wa abu'u Laka bidhanbi; faghfirli fa'innahu la yaghfiru-dh-dhunuba ill a ant a. A'uidhu bika min sharri ma sana'tu.' If somebody recites this invocation during the night, and if he should die then, he will go to Paradise (or he will be from the people of Paradise). And if he recites it in the morning, and if he should die on the same day, he will have the same fate.\"",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "6701",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا النضر، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن يحيى بن يعمر، أن عائشة  رضى الله عنها  أخبرته أنها، سألت رسول الله صلى الله عليه وسلم عن الطاعون فقال ‏\"‏ كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، ما من عبد يكون في بلد يكون فيه، ويمكث فيه، لا يخرج من البلد، صابرا محتسبا، يعلم أنه لا يصيبه إلا ما كتب الله له، إلا كان له مثل أجر شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked Allah's Apostle about the plague. He said, \"That was a means of torture which Allah used to send upon whom-so-ever He wished, but He made it a source of mercy for the believers, for anyone who is residing in a town in which this disease is present, and remains there and does not leave that town, but has patience and hopes for Allah's reward, and knows that nothing will befall him except what Allah has written for him, then he will get such reward as that of a martyr.\"",
      "chain": [
        "30021",
        "20291",
        "20424",
        "11432",
        "11316",
        "53"
      ]
    },
    {
      "hadith_no": "7456",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلوا قبل صلاة المغرب  قال في الثالثة  لمن شاء ‏\"‏‏.‏ كراهية أن يتخذها الناس سنة‏.‏",
      "text_en": " Narrated `Abdullah Al Muzam:                     The Prophet said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and the third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna (tradition). (See Hadith No. 277, Vol. 2)",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "7472",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا حسين المعلم، حدثني عبد الله بن بريدة، عن يحيى بن يعمر، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ أعوذ بعزتك الذي لا إله إلا أنت، الذي لا يموت والجن والإنس يموتون ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to say, \"I seek refuge (with YOU) by Your 'Izzat, None has the right to be worshipped but You Who does not die while the Jinns and the human beings die.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11316",
        "17"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو خيثمة، زهير بن حرب حدثنا وكيع، عن كهمس، عن عبد الله بن بريدة، عن يحيى بن يعمر، ح وحدثنا عبيد الله بن معاذ العنبري، - وهذا حديثه - حدثنا أبي، حدثنا كهمس، عن ابن بريدة، عن يحيى بن يعمر، قال كان أول من قال في القدر بالبصرة معبد الجهني فانطلقت أنا وحميد بن عبد الرحمن الحميري حاجين أو معتمرين فقلنا لو لقينا أحدا من أصحاب رسول الله صلى الله عليه وسلم فسألناه عما يقول هؤلاء في القدر فوفق لنا عبد الله بن عمر بن الخطاب داخلا المسجد فاكتنفته أنا وصاحبي أحدنا عن يمينه والآخر عن شماله فظننت أن صاحبي سيكل الكلام إلى فقلت أبا عبد الرحمن إنه قد ظهر قبلنا ناس يقرءون القرآن ويتقفرون العلم - وذكر من شأنهم - وأنهم يزعمون أن لا قدر وأن الأمر أنف ‏.‏ قال فإذا لقيت أولئك فأخبرهم أني بريء منهم وأنهم برآء مني والذي يحلف به عبد الله بن عمر لو أن لأحدهم مثل أحد ذهبا فأنفقه ما قبل الله منه حتى يؤمن بالقدر ثم قال حدثني أبي عمر بن الخطاب قال بينما نحن عند رسول الله صلى الله عليه وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال يا محمد أخبرني عن الإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ‏.‏ قال صدقت ‏.‏ قال فعجبنا له يسأله ويصدقه ‏.‏ قال فأخبرني عن الإيمان ‏.‏ قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال فأخبرني عن الإحسان ‏.‏ قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال فأخبرني عن الساعة ‏.‏ قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فأخبرني عن أمارتها ‏.‏ قال ‏\"‏ أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال ثم انطلق فلبثت مليا ثم قال لي ‏\"‏ يا عمر أتدري من السائل ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه جبريل أتاكم يعلمكم دينكم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Yahya b. Ya'mur that the first man who discussed about Qadr (Divine Decree) in Basra was Ma'bad al-Juhani. I along with Humaid b. 'Abdur-Rahman Himyari set out for prilgrimage or for 'Umrah and said:                      Should it so happen that we come into contact with one of the Companions of the Messenger of Allah (peace be upon him) we shall ask him a bout what is talked about Taqdir (Division Decree). Accidentally we came across Abdullah ibn Umar ibn al-Khattab, while he was entering the mosque. My companion and I surrounded him. One of us (stood) on his right and the other stood on his left. I expected that my companion would authorize me to speak. I therefore said: Abu Abdur Rahman! there have appeared some people in our land who recite the Holy Qur'an and pursue knowledge. And then after talking about their affairs, added: They (such people) claim that there is no such thing as Divine Decree and events are not predestined. He (Abdullah ibn Umar) said: When you happen to meet such people tell them that I have nothing to do with them and they have nothing to do with me. And verily they are in no way responsible for my (belief). Abdullah ibn Umar swore by Him (the Lord) (and said): If any one of them (who does not believe in the Divine Decree) had with him gold equal to the bulk of (the mountain) Uhud and then, it (in the way of Allah), Allah would not accept it unless he affirmed his faith in Divine Decree. He further said: My father, Umar ibn al-Khattab, told me: One day we were sitting in the company of Allah's Apostle (peace be upon him) when there appeared before us a man dressed in pure white clothes, his hair extraordinarily black. There were no signs of travel on him. None amongst us recognized him. At last he sat with the Apostle (peace be upon him) He knelt before him placed his palms on his thighs and said: Muhammad, inform me about al-Islam. The Messenger of Allah (peace be upon him) said: Al-Islam implies that you testify that there is no god but Allah and that Muhammad is the messenger of Allah, and you establish prayer, pay Zakat, observe the fast of Ramadan, and perform pilgrimage to the (House) if you are solvent enough (to bear the expense of) the journey. He (the inquirer) said: You have told the truth. He (Umar ibn al-Khattab) said: It amazed us that he would put the question and then he would himself verify the truth. He (the inquirer) said: Inform me about Iman (faith). He (the Holy Prophet) replied: That you affirm your faith in Allah, in His angels, in His Books, in His Apostles, in the Day of Judgment, and you affirm your faith in the Divine Decree about good and evil. He (the inquirer) said: You have told the truth. He (the inquirer) again said: Inform me about al-Ihsan (performance of good deeds). He (the Holy Prophet) said: That you worship Allah as if you are seeing Him, for though you don't see Him, He, verily, sees you. He (the enquirer) again said: Inform me about the hour (of the Doom). He (the Holy Prophet) remarked: One who is asked knows no more than the one who is inquiring (about it). He (the inquirer) said: Tell me some of its indications. He (the Holy Prophet) said: That the slave-girl will give birth to her mistress and master, that you will find barefooted, destitute goat-herds vying with one another in the construction of magnificent buildings. He (the narrator, Umar ibn al-Khattab) said: Then he (the inquirer) went on his way but I stayed with him (the Holy Prophet) for a long while. He then, said to me: Umar, do you know who this inquirer was? I replied: Allah and His Apostle knows best. He (the Holy Prophet) remarked: He was Gabriel (the angel). He came to you in order to instruct you in matters of religion.",
      "chain": [
        "30022",
        "20032",
        "11303",
        "11432",
        "11316",
        "11303",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "103",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن عبيد الغبري، وأبو كامل الجحدري وأحمد بن عبدة قالوا حدثنا حماد بن زيد، عن مطر الوراق، عن عبد الله بن بريدة، عن يحيى بن يعمر، قال لما تكلم معبد بما تكلم به في شأن القدر أنكرنا ذلك ‏.‏ قال فحججت أنا وحميد بن عبد الرحمن الحميري حجة ‏.‏ وساقوا الحديث بمعنى حديث كهمس وإسناده ‏.‏ وفيه بعض زيادة ونقصان أحرف ‏.‏",
      "text_en": " It is narrated on the authority of Yahya b. Ya'mur that when Ma'bad discussed the problem pertaining to Divine Decree, we refuted that. He (the narrator) said:                      I and Humaid b. Abdur-Rahman Himyari argued. And they carried on the conversation about the purport of the hadith related by Kahmas and its chain of transmission too, and there is some variation of words.",
      "chain": [
        "30213",
        "30559",
        "20022",
        "10719",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "104",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، حدثنا عثمان بن غياث، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، وحميد بن عبد الرحمن، قالا لقينا عبد الله بن عمر فذكرنا القدر وما يقولون فيه ‏.‏ فاقتص الحديث كنحو حديثهم عن عمر - رضى الله عنه - عن النبي صلى الله عليه وسلم وفيه شىء من زيادة وقد نقص منه شيئا ‏.‏",
      "text_en": " It is narrated on the authority of Yahya b. Ya'mur and Humaid b. 'Abdur-Rahman that they said:                      We met Abdullah b. 'Umar and we discussed about the Divine Decree, and what they talked about it and he narrated the hadith that has been transmitted by 'Umar (may Allah be pleased with him) from the Apostle (may peace be upon him). There is a slight variation in that.",
      "chain": [
        "38487",
        "20031",
        "11600",
        "11432",
        "11316",
        "10561",
        "3"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا حسين المعلم، عن ابن بريدة، عن يحيى بن يعمر، أن أبا الأسود، حدثه عن أبي ذر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر ومن ادعى ما ليس له فليس منا وليتبوأ مقعده من النار ومن دعا رجلا بالكفر أو قال عدو الله ‏.‏ وليس كذلك إلا حار عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Dharr that he heard the Messenger of Allah (may peace and blessings be upon him) saying:                      No person who claimed knowingly anyone else as his father besides (his own) committed nothing but infidelity, and he who made a claim of anything, which (in fact) did not belong to him, is not amongst us; he should make his abode in Fire, and he who labeled anyone with unbelief or called him the enemy of Allah, and he was in fact not so, it rebounded on him.",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "283",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وأحمد بن خراش، قالا حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي قال، حدثني حسين المعلم، عن ابن بريدة، أن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر حدثه قال أتيت النبي صلى الله عليه وسلم وهو نائم عليه ثوب أبيض ثم أتيته فإذا هو نائم ثم أتيته وقد استيقظ فجلست إليه فقال ‏\"‏ ما من عبد قال لا إله إلا الله ثم مات على ذلك إلا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ ثلاثا ثم قال في الرابعة ‏\"‏ على رغم أنف أبي ذر ‏\"‏ قال فخرج أبو ذر وهو يقول وإن رغم أنف أبي ذر ‏.‏",
      "text_en": " Abu Dharr reported,:                      I came to the Apostle (may peace be upon him ) and he was asleep with a white mantle over him. I again came, he was still asleep, I came again and he had awakened. I sat by his side and (the Holy Prophet) observed: There is none among the bondsmen who affirmed his faith in La illaha ill-Allah there is no God but Allah) and died in this state and did not enter Paradise. I (Abu Dharr) said: Even if he committed adultery and theft? He (the Holy Prophet) replied: (Yes) even though he committed adultery and theft. I (again said): Even if he committed adultery and theft? He replied: (Yes) even though he committed adultery and theft. (Th Holy Prophet repeated it three times) and said for the fourth time: In defiance of Abu Dharr. Abu Dharr then went out and he repeated (these words): In defiance of Abu Dharr.",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "1292",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن محمد بن شيبة، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال جاء أعرابي بعد ما صلى النبي صلى الله عليه وسلم صلاة الفجر ‏.‏ فأدخل رأسه من باب المسجد فذكر ‏.‏ بمثل حديثهما ‏.‏ قال مسلم هو شيبة بن نعامة أبو نعامة روى عنه مسعر وهشيم وجرير وغيرهم من الكوفيين ‏.‏",
      "text_en": " Ibn Buraida narrated it on the authority of his father that a Bedouin came when the Apostle of Allah (may peace be upon him) had completed the morning prayer. He thrust his head in the door of the mosque, and then the hadith (as narrated above) was narrated.This hadith has been reported by another chain of transmitters.",
      "chain": [
        "30367",
        "20028",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك، - وهو ابن مغول - عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن عبد الله بن قيس أو الأشعري أعطي مزمارا من مزامير آل داود ‏\"‏ ‏.‏",
      "text_en": " Abu Burda narrated on the authority of Abu Musa that the Messenger of Allah (may peace be upon him) had said to Abu Musa:                      If you were to see me, as I was listening to your recitation (of the Qur'an) yester-night (you would have felt delighted). You are in fact endowed with a sweet voice like that of David himself.",
      "chain": [
        "30201",
        "20331",
        "30212",
        "20331",
        "20358",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1977",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ووكيع، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة - قالها ثلاثا قال في الثالثة - لمن شاء ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Abdullah b. Mughaffal by another chain of transmitters, but with this variation that he (the Holy Prophet) said at the fourth time:                     \" He who wishes (may do to).\"",
      "chain": [
        "30201",
        "20318",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن عبد الله، بن بريدة عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم ‏.‏ مثله إلا أنه قال في الرابعة ‏\"‏ لمن شاء ‏\"‏ ‏.‏",
      "text_en": " Salim b. Abdullah b. 'Umar reported:                      The Messenger of Allah (may peace he upon him) led on* of the two groups In one rak'ah of prayer in danger, while the other group faced the -enemy. Then they (the members of the first group) went back and replaced their companions who were facing the enemy. and then they (the members of the second group) came and the Apostle of Allah (may peace be upon him) led them in one rak'ah of prayer. Then the Apostle of Allah (may peace be upon him) pronounced salutation, and then they (the members of the Ant group) completed the rak'ah and they (the members of the second group) completed the rak'ah. This hadith has been narrated by another chain of tranamitters.",
      "chain": [
        "30201",
        "20246",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "2279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا عبد الوارث بن سعيد، عن حسين بن، ذكوان قال حدثني عبد الله بن بريدة، عن سمرة بن جندب، قال صليت خلف النبي صلى الله عليه وسلم وصلى على أم كعب ماتت وهي نفساء فقام رسول الله صلى الله عليه وسلم للصلاة عليها وسطها ‏.‏",
      "text_en": " Samura b. Jundub said:                      I prayed behind the Messenger of Allah (may peace be upon him) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.",
      "chain": [
        "30399",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "2281",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، وعقبة بن مكرم العمي، قالا حدثنا ابن أبي عدي، عن حسين، عن عبد الله بن بريدة، قال قال سمرة بن جندب لقد كنت على عهد رسول الله صلى الله عليه وسلم غلاما فكنت أحفظ عنه فما يمنعني من القول إلا أن ها هنا رجالا هم أسن مني وقد صليت وراء رسول الله صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها رسول الله صلى الله عليه وسلم في الصلاة وسطها ‏.‏ وفي رواية ابن المثنى قال حدثني عبد الله بن بريدة قال فقام عليها للصلاة وسطها ‏.‏",
      "text_en": " Samura b. Jundub said:                      I was a young boy during the time of the Holy Prophet (may peace be upon him) and I retained in my mind (what I learnt from him), and nothing restrained me from speaking except the fact that there were persons far more advanced in age than I. Verily, I said prayer behind the Messenger of Allah (may peace be upon him) over a woman who had died in the state of delivery, and the Messenger of Allah (may peace be upon him) stood up to say prayer in front of the middle part of her body. And in the tradition narrated on the authority of Ibn Muthanna the words are:\" (The Holy Prophet) stood in the middle part of her body for offering prayer for her.\"",
      "chain": [
        "30170",
        "30441",
        "20276",
        "11278",
        "11432"
      ]
    },
    {
      "hadith_no": "2305",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، ومحمد بن المثنى، - واللفظ لأبي بكر وابن نمير - قالوا حدثنا محمد بن فضيل، عن أبي سنان، - وهو ضرار بن مرة - عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏ قال ابن نمير في روايته عن عبد الله بن بريدة عن أبيه ‏.‏",
      "text_en": " Ibn Buraida reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
      "chain": [
        "30201",
        "30212",
        "30170",
        "20356",
        "10776",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن زبيد اليامي، عن محارب بن دثار، عن ابن بريدة، أراه عن أبيه، - الشك من أبي خيثمة - عن النبي صلى الله عليه وسلم ح . وحدثنا أبو بكر بن أبي شيبة، حدثنا قبيصة بن عقبة، عن سفيان، عن علقمة، بن مرثد عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم ح . وحدثنا ابن أبي عمر، ومحمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، عن معمر، عن عطاء الخراساني، قال حدثني عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم كلهم بمعنى حديث أبي سنان ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30399",
        "30022",
        "11335",
        "11389",
        "11432"
      ]
    },
    {
      "hadith_no": "2753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر أبو الحسن، عن عبد الله، بن عطاء عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال بينا أنا جالس، عند رسول الله صلى الله عليه وسلم إذ أتته امرأة فقالت إني تصدقت على أمي بجارية وإنها ماتت - قال - فقال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنه كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت إنها لم تحج قط أفأحج عنها قال ‏\"‏ حجي عنها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      When we were sitting with the Messenger of Allah (may peace be upon him), a woman came to him and said: I had gifted to my mother a maid-servant, and now she (the mother) has died. Thereupon he (the Holy Prophet) said: There is a definite reward for you and she (the maid-servant) has been returned to you as an inheritance. She (that woman) again said: Fasts of a month (of Ramadan) are due upon her; should I observe them on her behalf? He (the Holy Prophet) said: Observe fasts on her behalf. She (again) said: She did not perform Hajj, should I perform it on her behalf? He (the Holy Prophet) said: Perform Hajj on her behalf.",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2754",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال كنت جالسا عند النبي صلى الله عليه وسلم ‏.‏ بمثل حديث ابن مسهر غير أنه قال صوم شهرين ‏.‏",
      "text_en": " 'Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      I was sitting with the Apostle of Allah (may peace be upon him) ; the rest of the hadith is the same but with this variation that the (the narrator) said:\" Fasts of two months.\"",
      "chain": [
        "30201",
        "20331",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا الثوري، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، - رضى الله عنه - قال جاءت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثله وقال صوم شهر ‏.‏",
      "text_en": "  Ibn Buraida (Allah be pleased with him) reported on the authority of his father:                      A woman came to the Apostle of Allah (may peace be upon him), and the rest of the hadith is the same, but he said:\" Fasting of one month.\"",
      "chain": [
        "30553",
        "20121",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4528",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا محمد بن عبد، الله بن نمير - وتقاربا في لفظ الحديث - حدثنا أبي، حدثنا بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، أن ماعز بن مالك الأسلمي، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني قد ظلمت نفسي وزنيت وإني أريد أن تطهرني ‏.‏ فرده فلما كان من الغد أتاه فقال يا رسول الله إني قد زنيت ‏.‏ فرده الثانية فأرسل رسول الله صلى الله عليه وسلم إلى قومه فقال ‏\"‏ أتعلمون بعقله بأسا تنكرون منه شيئا ‏\"‏ ‏.‏ فقالوا ما نعلمه إلا وفي العقل من صالحينا فيما نرى فأتاه الثالثة فأرسل إليهم أيضا فسأل عنه فأخبروه أنه لا بأس به ولا بعقله فلما كان الرابعة حفر له حفرة ثم أمر به فرجم ‏.‏ قال فجاءت الغامدية فقالت يا رسول الله إني قد زنيت فطهرني ‏.‏ وإنه ردها فلما كان الغد قالت يا رسول الله لم تردني لعلك أن تردني كما رددت ماعزا فوالله إني لحبلى ‏.‏ قال ‏\"‏ إما لا فاذهبي حتى تلدي ‏\"‏ ‏.‏ فلما ولدت أتته بالصبي في خرقة قالت هذا قد ولدته ‏.‏ قال ‏\"‏ اذهبي فأرضعيه حتى تفطميه ‏\"‏ ‏.‏ فلما فطمته أتته بالصبي في يده كسرة خبز فقالت هذا يا نبي الله قد فطمته وقد أكل الطعام ‏.‏ فدفع الصبي إلى رجل من المسلمين ثم أمر بها فحفر لها إلى صدرها وأمر الناس فرجموها فيقبل خالد بن الوليد بحجر فرمى رأسها فتنضح الدم على وجه خالد فسبها فسمع نبي الله صلى الله عليه وسلم سبه إياها فقال ‏\"‏ مهلا يا خالد فوالذي نفسي بيده لقد تابت توبة لو تابها صاحب مكس لغفر له ‏\"‏ ‏.‏ ثم أمر بها فصلى عليها ودفنت ‏.‏",
      "text_en": " 'Abdullah b. Buraida reported on the authority of his father that Ma'iz b. Malik al-Aslami came to Allah's Messenger (may peace be upon him) and said:                      Allah's Messenger, I have wronged myself; I have committed adultery and I earnestly desire that you should purify me. He turned him away. On the following day, he (Ma'iz) again came to him and said: Allah's Messenger, I have committed adultery. Allah's Messenger (may peace be upon him) turned him away for the second time, and sent him to his people saying: Do you know if there is anything wrong with his mind. They denied of any such thing in him and said: We do not know him but as a wise good man among us, so far as we can judge. He (Ma'iz) came for the third time, and he (the Holy Prophet) sent him as he had done before. He asked about him and they informed him that there was nothing wrong with him or with his mind. When it was the fourth time, a ditch was dug for him and he (the Holy Prophet) pronounced judg- ment about him and he wis stoned. He (the narrator) said: There came to him (the Holy Prophet) a woman from Ghamid and said: Allah's Messenger, I have committed adultery, so purify me. He (the Holy Prophet) turned her away. On the following day she said: Allah's Messenger, Why do you turn me away? Perhaps, you turn me away as you turned away Ma'iz. By Allah, I have become pregnant. He said: Well, if you insist upon it, then go away until you give birth to (the child). When she was delivered she came with the child (wrapped) in a rag and said: Here is the child whom I have given birth to. He said: Go away and suckle him until you wean him. When she had weaned him, she came to him (the Holy Prophet) with the child who was holding a piece of bread in his hand. She said: Allah's Apostle, here is he as I have weaned him and he eats food. He (the Holy Prophet) entrusted the child to one of the Muslims and then pronounced punishment. And she was put in a ditch up to her chest and he commanded people and they stoned her. Khalid b Walid came forward with a stone which he flung at her head and there spurted blood on the face of Khalid and so he abused her. Allah's Apostle (may peace be upon him) heard his (Khalid's) curse that he had huried upon her. Thereupon he (the Holy Prophet) said: Khalid, be gentle. By Him in Whose Hand is my life, she has made such a repentance that even if a wrongful tax-collector were to repent, he would have been forgiven. Then giving command regarding her, he prayed over her and she was buried.",
      "chain": [
        "30201",
        "20331",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4798",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، ح وحدثنا سعيد بن محمد، الجرمي حدثنا أبو تميلة، قالا جميعا حدثنا حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، ‏.‏ قال غزا رسول الله صلى الله عليه وسلم تسع عشرة غزوة قاتل في ثمان منهن ‏.‏ ولم يقل أبو بكر منهن ‏.‏ وقال في حديثه حدثني عبد الله بن بريدة ‏.‏",
      "text_en": " It has been narrated on the authority of Buraida (who heard the tradition from his father) that the Messenger of Allah (may peace be upon him) conducted nineteen military campaigns and he (actually) fought in eight of them.",
      "chain": [
        "30201",
        "20650",
        "30195",
        "20183",
        "20648",
        "11432"
      ]
    },
    {
      "hadith_no": "4799",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، أنه قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة ‏.‏",
      "text_en": " It has been narrated by Buraida who heard it from his father that he joined the Messenger of Allah (may peace be upon him) in sixteen military campaigns",
      "chain": [
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5018",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مسعر، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال قال - يعني النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث الثوري ‏.‏",
      "text_en": " This tradition has been narrated by the same authority through different chain of transmitters.",
      "chain": [
        "30375",
        "20364",
        "20359",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا كهمس، عن ابن بريدة، قال رأى عبد الله بن المغفل رجلا من أصحابه يخذف فقال له لا تخذف فإن رسول الله صلى الله عليه وسلم كان يكره - أو قال - ينهى عن الخذف فإنه لا يصطاد به الصيد ولا ينكأ به العدو ولكنه يكسر السن ويفقأ العين ‏.‏ ثم رآه بعد ذلك يخذف فقال له أخبرك أن رسول الله صلى الله عليه وسلم كان يكره أو ينهى عن الخذف ثم أراك تخذف لا أكلمك كلمة كذا وكذا ‏.‏",
      "text_en": " Ibn Buraida reported that Abdullah b. al-Mughaffal saw a person from amongst his companions throwing small pebbles, whereupon he said:                      Don't throw pebbles. for Allah's Messenger (may peace be upon him) did not like it, or he forbade flinging of pebbles since neither the game is taken thereby, nor an enemy defeated. but it may break a tooth or put out an eye. He, afterwards, again saw him flinging pebbles, and said to him: I inform you that the Messenger of Allah (may peace be upon him) did not approve or he forbade flinging of pebbles, but if I see you again flinging pebbles. I will not speak with you.",
      "chain": [
        "30150",
        "20286",
        "11303",
        "11432"
      ]
    },
    {
      "hadith_no": "5227",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، قالا حدثنا محمد بن فضيل، قال أبو بكر عن أبي سنان، وقال ابن المثنى، عن ضرار بن مرة، عن محارب، عن ابن بريدة، عن أبيه، ح",
      "text_en": "",
      "chain": [
        "30201",
        "30170",
        "20356",
        "20436",
        "11389",
        "11432"
      ]
    },
    {
      "hadith_no": "5228",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن فضيل، حدثنا ضرار بن مرة، أبو سنان عن محارب بن دثار، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida reported on the authority of his father that Allah's Messenger (may peace be upon him) said this:                      I prohibited you from visiting the graves, but (now) you may visit them, and I prohibited you (from eating) the flesh of sacrific- ed animals beyond three days, but now keep it as long as you like. I prohibited you from the use of Nabidh except (that preoared) in dry waterskins. Now drink (Nabidh prepared in any utensil), but do not drink when it becomes intoxicant.",
      "chain": [
        "30212",
        "20356",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا الضحاك بن مخلد، عن سفيان، عن علقمة، بن مرثد عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كنت نهيتكم ‏\"‏ ‏.‏ فذكر بمعنى حديث أبي سنان ‏.‏",
      "text_en": " Ibn Buraida, on the authority of his father, reported Allah's Messenger (may peace be upon him) having said this:                      I used to forbid you. The rest of the hadith is the same.",
      "chain": [
        "38834",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5324",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، قالا حدثنا محمد بن فضيل، قال أبو بكر عن أبي سنان، وقال ابن المثنى، عن ضرار بن مرة، عن محارب، عن ابن بريدة، عن أبيه، ح",
      "text_en": "",
      "chain": [
        "30201",
        "30170",
        "20356",
        "20436",
        "11389",
        "11432"
      ]
    }
  ],
  "total_hadiths": 204
}