{
  "id": "11436",
  "name": "'Ubaidullah bin Abi Bakr عبيد الله بن أبي بكر بن أنس",
  "full_name": "'Ubaidullah bin Abi Bakr عبيد الله بن أبي بكر بن أنس",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "17943",
      "name": "al-N'uman bin Abi Bakr bin Ans النعمان بن أبي بكر بن أنس بن مالك",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20551",
      "name": "Shadad bin Sa'id شداد بن سعيد أبو طلحة الراسبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14262",
      "name": "'Utba bin Hameed al-Dby عتبة بن حميد الضبي أبو معاذ",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20566",
      "name": "Muhammad bin 'Abdul 'Aziz al-Jarmi محمد بن عبد العزيز الجرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24420",
      "name": "Marjji bin Raja'a مرجي بن رجاء اليشكري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "318",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن عبيد الله بن أبي بكر، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله  عز وجل  وكل بالرحم ملكا يقول يا رب نطفة، يا رب علقة، يا رب مضغة‏.‏ فإذا أراد أن يقضي خلقه قال أذكر أم أنثى شقي أم سعيد فما الرزق والأجل فيكتب في بطن أمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O Lord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel asks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision be? And what will his age be?' So all that is written while the child is still in the mother's womb.\"",
      "chain": [
        "30175",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "953",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، قال حدثنا هشيم، قال أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس، قال كان رسول الله صلى الله عليه وسلم لا يغدو يوم الفطر حتى يأكل تمرات‏.‏ وقال مرجى بن رجاء حدثني عبيد الله قال حدثني أنس عن النبي صلى الله عليه وسلم ويأكلهن وترا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle never proceeded (for the prayer) on the Day of `Id-ul-Fitr unless he had eaten some dates. Anas also narrated: The Prophet used to eat odd number of dates.",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "2443",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، وحميد الطويل، سمعا أنس بن مالك  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Help your brother, whether he is an oppressor or he is an oppressed one.\"",
      "chain": [
        "30203",
        "20468",
        "11436",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2653",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن منير، سمع وهب بن جرير، وعبد الملك بن إبراهيم، قالا حدثنا شعبة، عن عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  قال سئل النبي صلى الله عليه وسلم عن الكبائر قال ‏\"‏ الإشراك بالله، وعقوق الوالدين، وقتل النفس، وشهادة الزور ‏\"‏‏.‏ تابعه غندر وأبو عامر وبهز وعبد الصمد عن شعبة‏.‏",
      "text_en": " Narrated Anas:                     The Prophet was asked about the great sins He said, \"They are:-- (1 ) To join others in worship with Allah, (2) To be undutiful to one's parents. (3) To kill a person (which Allah has forbidden to kill) (i.e. to commit the crime of murdering). (4) And to give a false witness.\"",
      "chain": [
        "30353",
        "20298",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "3333",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله وكل في الرحم ملكا فيقول يا رب نطفة، يا رب علقة، يا رب مضغة، فإذا أراد أن يخلقها قال يا رب، أذكر أم يا رب أنثى يا رب شقي أم سعيد فما الرزق فما الأجل فيكتب كذلك في بطن أمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Allah has appointed an angel in the womb, and the angel says, 'O Lord! A drop of discharge (i.e. of semen), O Lord! a clot, O Lord! a piece of flesh.' And then, if Allah wishes to complete the child's creation, the angel will say. 'O Lord! A male or a female? O Lord! wretched or blessed (in religion)? What will his livelihood be? What will his age be?' The angel writes all this while the child is in the womb of its mother.\"",
      "chain": [
        "20283",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6043",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، قال حدثني عبيد الله بن أبي بكر، قال سمعت أنس بن مالك  رضى الله عنه  قال ذكر رسول الله صلى الله عليه وسلم الكبائر، أو سئل عن الكبائر فقال ‏\"‏ الشرك بالله، وقتل النفس، وعقوق الوالدين ‏\"‏‏.‏ فقال ‏\"‏ ألا أنبئكم بأكبر الكبائر  قال  قول الزور  أو قال  شهادة الزور ‏\"‏‏.‏ قال شعبة وأكثر ظني أنه قال ‏\"‏ شهادة الزور ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle mentioned the greatest sins or he was asked about the greatest sins. He said, \"To join partners in worship with Allah; to kill a soul which Allah has forbidden to kill; and to be undutiful or unkind to one's parents.\" The Prophet added, \"Shall I inform you of the biggest of the great sins? That is the forged statement or the false witness.\" Shu`ba (the sub-narrator) states that most probably the Prophet said, \"the false witness.\"",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6314",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عبيد الله بن أبي بكر، عن أنس بن مالك، أن رجلا، اطلع من بعض حجر النبي صلى الله عليه وسلم فقام إليه النبي صلى الله عليه وسلم بمشقص  أو بمشاقص  فكأني أنظر إليه يختل الرجل ليطعنه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man peeped into a room of the Prophet. The Prophet stood up, holding an arrow head. It is as if I am just looking at him, trying to stab the man.",
      "chain": [
        "30175",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6331",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، حدثنا أنس بن مالك  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     the Prophet said, \"If the people of the Scripture greet you, then you should say (in reply), 'Wa'alaikum (And on you).' \"",
      "chain": [
        "30203",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6675",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ وكل الله بالرحم ملكا فيقول أى رب نطفة، أى رب علقة، أى رب مضغة‏.‏ فإذا أراد الله أن يقضي خلقها قال أى رب ذكر أم أنثى أشقي أم سعيد فما الرزق فما الأجل فيكتب كذلك في بطن أمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Allah puts an angel in charge of the uterus and the angel says, 'O Lord, (it is) semen! O Lord, (it is now ) a clot! O Lord, (it is now) a piece of flesh.' And then, if Allah wishes to complete its creation, the angel asks, 'O Lord, (will it be) a male or a female? A wretched (an evil doer) or a blessed (doer of good)? How much will his provisions be? What will his age be?' So all that is written while the creature is still in the mother's womb.\"",
      "chain": [
        "20193",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6955",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عبيد الله بن أبي بكر، سمع أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر ‏\"‏‏.‏ وحدثنا عمرو حدثنا شعبة عن ابن أبي بكر عن أنس بن مالك عن النبي صلى الله عليه وسلم قال ‏\"‏ أكبر الكبائر الإشراك بالله وقتل النفس، وعقوق الوالدين، وقول الزور ‏\"‏‏.‏ أو قال ‏\"‏ وشهادة الزور ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"The biggest of Al-Ka`ba'ir (the great sins) are (1) to join others as partners in worship with Allah, (2) to murder a human being, (3) to be undutiful to one's parents (4) and to make a false statement,\" or said, \"to give a false witness.\"",
      "chain": [
        "30313",
        "20250",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6985",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  أن رجلا، اطلع في بعض حجر النبي صلى الله عليه وسلم فقام إليه بمشقص أو بمشاقص وجعل يختله ليطعنه‏.‏",
      "text_en": "      Narrated Anas:                          A man peeped into one of the dwelling places of the Prophet. The      Prophet got up and aimed a sharp-edged arrow head (or wooden stick) at     him to poke him stealthily.",
      "chain": [
        "20283",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "7038",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا سعيد بن سليمان، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏ فقال رجل يا رسول الله أنصره إذا كان مظلوما، أفرأيت إذا كان ظالما كيف أنصره قال ‏\"‏ تحجزه أو تمنعه من الظلم، فإن ذلك نصره ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"Help your brother whether he is an oppressor or an oppressed,\" A man said, \"O Allah's Apostle! I will help him if he is oppressed, but if he is an oppressor, how shall I help him?\" The Prophet said, \"By preventing him from oppressing (others), for that is how to help him.\"",
      "chain": [
        "30272",
        "30252",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - وهو ابن الحارث - حدثنا شعبة، أخبرنا عبيد الله بن أبي بكر، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏\"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏",
      "text_en": " Anas narrated from the Apostle (may peace be upon him) about the major sins. He (the Holy Prophet) observed:                      Associating anyone with Allah, disobedience to parents, killing a person and false utterance.",
      "chain": [
        "20226",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، قال حدثني عبيد الله بن أبي بكر، قال سمعت أنس بن مالك، قال ذكر رسول الله صلى الله عليه وسلم الكبائر - أو سئل عن الكبائر - فقال ‏\"‏ الشرك بالله وقتل النفس وعقوق الوالدين ‏\"‏ ‏.‏ وقال ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏ ‏.‏ قال ‏\"‏ قول الزور ‏\"‏ ‏.‏ أو قال ‏\"‏ شهادة الزور ‏\"‏ ‏.‏ قال شعبة وأكبر ظني أنه شهادة الزور ‏.‏",
      "text_en": " Ubaidullah b. Abu Bakr said:                      I heard Anas b. Malik saying: The Messenger of Allah (may peace be upon him) talked about the major sins, or he was asked about the major sins. Upon this he observed: Associating anyone with Allah, killing of a person, disobedience to parents. He (the Holy Prophet further) said: Should I not inform you about the gravest of the major sins, and (in this connection) observed: False utterance or false testimony. Shu'ba said. It was most probably\" false testimony\".",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "5767",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو كامل فضيل بن حسين وقتيبة بن سعيد - واللفظ ليحيى وأبي كامل - قال يحيى أخبرنا وقال الآخران، حدثنا حماد بن زيد، عن عبيد، الله بن أبي بكر عن أنس بن مالك، أن رجلا، اطلع من بعض حجر النبي صلى الله عليه وسلم فقام إليه بمشقص أو مشاقص فكأني أنظر إلى رسول الله صلى الله عليه وسلم يختله ليطعنه ‏.‏",
      "text_en": " Anas b. Malik reported that a person peeped in some of the holes (in the doors) of Allah's Messenger (may peace be upon him) (and he found him) standing up (lifting) an arrow or some arrows. The narrator said:                      I perceived as if Allah's Messenger (may peace be upon him) was going to pierce (his eyes).",
      "chain": [
        "30399",
        "20031",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "5779",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن عبيد الله بن أبي بكر، قال سمعت  أنسا، يقول قال رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30399",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "5780",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني إسماعيل بن سالم، حدثنا هشيم، أخبرنا عبيد الله بن أبي بكر، عن  جده، أنس بن مالك أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا سلم عليكم أهل الكتاب فقولوا وعليكم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying:                      When the People of the Book offer you salutations, you should say: The same to you.",
      "chain": [
        "30415",
        "20468",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6864",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا محمد بن عبد العزيز، عن  عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عال جاريتين حتى تبلغا جاء يوم القيامة أنا وهو ‏\"‏ ‏.‏ وضم أصابعه ‏.‏",
      "text_en": " Malik reported Allah's Messenger (may peace be upon him) as saying:                      He, who brought up two girls properly till they grew up, he and I would come (together) (very closely) on the Day of Resurrection, and he interlaced his fingers (for explaining the point of nearness between him and that person).",
      "chain": [
        "30263",
        "20355",
        "30380",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6900",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني أبو كامل، فضيل بن حسين الجحدري حدثنا حماد بن زيد، حدثنا عبيد، الله بن أبي بكر عن أنس بن مالك، ورفع الحديث، أنه قال ‏\"‏ إن الله عز وجل قد وكل بالرحم ملكا فيقول أى رب نطفة أى رب علقة أى رب مضغة ‏.‏ فإذا أراد الله أن يقضي خلقا - قال - قال الملك أى رب ذكر أو أنثى شقي أو سعيد فما الرزق فما الأجل فيكتب كذلك في بطن أمه ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported directly from Allah's Messenger (may peace be upon him) that he said:                      Allah, the Exlated and Glorious, has appointed an angel as the caretaker of the womb, and he would say: My Lord, it is now a drop of semen; my Lord, It is now a clot of blood; my Lord, it has now become a lump of flesh, and when Allah decides to give it a final shape, the angel says: My Lord, would it be male or female or would he be an evil or a good person? What about his livelihood and his age? And it is all written as he is in the womb of his mother.",
      "chain": [
        "30559",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا أبو معاوية، عن عتبة، عن أبي معاذ، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، أنه كان يكتحل وهو صائم ‏.‏",
      "text_en": " 'Ubaid Allah b. Abu Bakr b. Anas reported on the authority of Anas b. Malik that he used to apply collyrium when he was fasting.",
      "chain": [
        "30569",
        "20354",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "5171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا حماد، عن عبيد الله بن أبي بكر، عن أنس بن مالك، أن رجلا، اطلع من بعض حجر النبي صلى الله عليه وسلم فقام إليه رسول الله صلى الله عليه وسلم بمشقص أو مشاقص - قال - فكأني أنظر إلى رسول الله صلى الله عليه وسلم يختله ليطعنه ‏.‏",
      "text_en": " Anas b. malik said :                      A man peeped into some of the apartment of the prophet (May peace be upon him). The prophet (May peace be upon him) got up taking an arrowhead or arrowheads. He said: I can still picture myself looking at the Messenger of Allah (May peace be upon him) when he was exploring to pierce him.",
      "chain": [
        "30213",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا خالد بن الحارث، عن شعبة، حدثنا عبيد الله بن أبي بكر بن أنس، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏\"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏ قال وفي الباب عن أبي بكرة وأيمن بن خريم وابن عمر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Anas narrated that the Prophet (ﷺ) said about the major sins:                      \"Associating partners with Allah, disobeying parents, killing oneself, and false speech.\"He said: There are narrations on this topic from Abu Bakrah, Ayman bin Khuraim, and Ibn 'UmarAbu 'Eisa said: The Hadith of Anas is a Hasan Sahih Gharib Hadith.",
      "chain": [
        "20226",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن حماد بن سلمة، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا ابن آدم وهذا أجله ‏\"‏ ‏.‏ ووضع يده عند قفاه ثم بسطها فقال ‏\"‏ وثم أمله وثم أمله وثم أمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي سعيد ‏.‏",
      "text_en": " Anas bin Malik narrated that that the Messenger of Allah(s.a.w) said:                     \"This is the son of Adam, and this is his life-span.\" And he placed his hand at the (height of the) nape of his neck, then he extended it (higher) and said:\" From there is what is hoped for, from there is what is hoped for.\"",
      "chain": [
        "38265",
        "20025",
        "20021",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "2798",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن رافع، حدثنا أبو داود، عن مبارك بن فضالة، عن عبيد الله بن أبي بكر بن أنس، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يقول الله أخرجوا من النار من ذكرني يوما أو خافني في مقام ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Anas said that the Prophet (s.a.w) said:                     \"Allah will say: 'Remove from the Fire whoever remembered Me one day, or feared Me while in a state of sinning.\"",
      "chain": [
        "30375",
        "20547",
        "14352",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا خالد بن الحارث، عن شعبة، حدثنا عبيد الله بن أبي بكر بن أنس، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏\"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ ورواه روح بن عبادة عن شعبة وقال عن عبد الله بن أبي بكر ولا يصح ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Abi Bakr [bin Anas]:                     from Anas bin Malik, that the Prophet (ﷺ) [said] about the major sins: \"Shirk with Allah, disobeying the parents, taking the life, and false statement.\"",
      "chain": [
        "20226",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "4010",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن عبيد الله بن أبي بكر، عن أنس، عن النبي صلى الله عليه وسلم ح وأنبأنا إسحاق بن إبراهيم، قال أنبأنا النضر بن شميل، قال حدثنا شعبة، عن عبيد الله بن أبي بكر، قال سمعت أنسا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ الكبائر الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubaidullah bin Abi Bakr said:                     \"I heard Anas say: 'The Messenger of Allah [SAW] said: The major sins are: Associating others with Allah (Shirk), disobeying one's parents, killing a soul (murder) and speaking falsely.'\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "4867",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن شميل، قال حدثنا شعبة، عن عبيد الله بن أبي بكر، قال سمعت أنسا، يقول قال رسول الله صلى الله عليه وسلم ح وأخبرنا محمد بن عبد الأعلى قال حدثنا خالد قال حدثنا شعبة عن عبيد الله بن أبي بكر عن أنس عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubaidullah bin abi Bakr said:                     \"I heard Ana's say: 'The Messenger of Allah said: 'the major sins are; associating others with Allah (shirk), disobeying one's parents, killing a soul (murder) and speaking falsely.",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "1826",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا هشيم، عن عبيد الله بن أبي بكر، عن أنس بن مالك، قال كان النبي  صلى الله عليه وسلم  لا يخرج يوم الفطر حتى يطعم تمرات ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “The Prophet (ﷺ) wouldnot goout on the Day of Fitr until he had eaten some dates.”",
      "chain": [
        "35021",
        "20468",
        "11436",
        "19"
      ]
    }
  ],
  "total_hadiths": 28
}