{
  "id": "11446",
  "name": "Hisham bin 'Amr al-Fzary هشام بن عمرو الفزاري",
  "full_name": "Hisham bin 'Amr al-Fzary هشام بن عمرو الفزاري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ع  -  مقبول ]"
    ],
    "tags": [
      "al-Fazari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1427",
      "hadith_no": "1427",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم كان يقول في آخر وتره ‏\"‏ اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏ قال أبو داود هشام أقدم شيخ لحماد وبلغني عن يحيى بن معين أنه قال لم يرو عنه غير حماد بن سلمة ‏.‏ قال أبو داود روى عيسى بن يونس عن سعيد بن أبي عروبة عن قتادة عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب أن رسول الله صلى الله عليه وسلم قنت - يعني في الوتر - قبل الركوع ‏.‏ قال أبو داود روى عيسى بن يونس هذا الحديث أيضا عن فطر بن خليفة عن زبيد عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن أبى عن النبي صلى الله عليه وسلم مثله وروي عن حفص بن غياث عن مسعر عن زبيد عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب أن رسول الله صلى الله عليه وسلم قنت في الوتر قبل الركوع ‏.‏ قال أبو داود حديث سعيد عن قتادة رواه يزيد بن زريع عن سعيد عن قتادة عن عزرة عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم لم يذكر القنوت ولا ذكر أبيا وكذلك رواه عبد الأعلى ومحمد بن بشر العبدي وسماعه بالكوفة مع عيسى بن يونس ولم يذكروا القنوت وقد رواه أيضا هشام الدستوائي وشعبة عن قتادة ولم يذكرا القنوت وحديث زبيد رواه سليمان الأعمش وشعبة وعبد الملك بن أبي سليمان وجرير بن حازم كلهم عن زبيد لم يذكر أحد منهم القنوت إلا ما روي عن حفص بن غياث عن مسعر عن زبيد فإنه قال في حديثه إنه قنت قبل الركوع ‏.‏ قال أبو داود وليس هو بالمشهور من حديث حفص نخاف أن يكون عن حفص عن غير مسعر ‏.‏ قال أبو داود ويروى أن أبيا كان يقنت في النصف من شهر رمضان ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) used to say at the end of his witr: \"O Allah, I seek refuge in Thy good pleasure from Thy anger, and in Thy forgiveness from Thy punishment, and I seek refuge in Thy mercy from Thy wrath. I cannot reckon the praise due to Thee. Thou art as Thou hast praised Thyself.\"Abu Dawud said: Hisham is the earliest teacher of Hammad. Yahya b. Ma'in said: No one is reported to have narrated traditions form him except Hammad b. Salamah.Abu Dawud said: Ubayy b. Ka'b said: The Messenger of Allah (ﷺ) recited supplication in the witr before bowing.Abu Dawud said: This tradition has also been narrated by 'Isa b. Yunus through a different chain of narrators from Ubayy b. Ka'b. He also narrated it through a different chain of narrators on the authority of Ubayy b. Ka'b that the Messenger of Allah (ﷺ) recited the supplication in the witr before bowing.Abu Dawud said: The chain of narrators of the tradition of Sa'id from Qatadah goes: Yazid b. Zurai' narrated from Sa'id, from Qatadah, from 'Azrah, from Sa'id b. 'Abd al-Rahman b. Abza, on the authority of his father, from the Prophet (ﷺ). This version does not mention the supplication and the name of Ubayy. This tradition has also been narrated by 'Abd al-A'la and Muhammad b. Bishr al-'Abdi. He heard the traditions from 'Isa b. Yunus at Kufah. They did not mention the supplication in their version.This tradition has also been narrated by Hisham al-Dastuwa'i and Shu'bah from Qatadah. They did not mention the supplication in their version. The tradition of Zubaid has been narrated by Sulaiman al-A'mash, Shu'bah, 'Abd al-Malik b. Abi Sulaiman, and Jarir b. Hazim; all of them narrated on the authority of Zubaid. None of them mention the supplication in his version, except in the tradition transmitted by Hafs b. Ghiyath from Mis'ar from Zubaid; he narrated in his version that he (the Prophet) recited supplication before bowing.Abu Dawud said: This version of tradition is not well know. There is doubt that Hafs might have narrated this tradition from some other narrator than Mis'ar.Abu Dawud said: It is reported that Ubayy (b. Ka'b) used to recited the supplication )in the witr) in the second half of Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20021",
        "11446",
        "448",
        "5"
      ]
    }
  ],
  "total_hadiths": 1
}