{
  "id": "11447",
  "name": "Hamam bin Munabbih همام بن منبه بن كامل",
  "full_name": "Hamam bin Munabbih همام بن منبه بن كامل",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'",
      " Yemen"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Sana'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11102",
      "name": "Wahb bin Munabbih al-Abnavi وهب بن منبه الأبناوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11102",
      "name": "Wahb bin Munabbih al-Abnavi وهب بن منبه الأبناوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "28405",
      "name": "Aqyl bin Ma'ql bin Mnbh عقيل بن معقل بن منبه اليماني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "42",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن منصور، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحسن أحدكم إسلامه، فكل حسنة يعملها تكتب له بعشر أمثالها إلى سبعمائة ضعف، وكل سيئة يعملها تكتب له بمثلها ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If any one of you improve (follows strictly)      his Islamic religion then his good deeds will be rewarded ten times to     seven hundred times for each good deed and a bad deed will be recorded     as it is.\"",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "113",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني وهب بن منبه، عن أخيه، قال سمعت أبا هريرة، يقول ما من أصحاب النبي صلى الله عليه وسلم أحد أكثر حديثا عنه مني، إلا ما كان من عبد الله بن عمرو فإنه كان يكتب ولا أكتب‏.‏ تابعه معمر عن همام عن أبي هريرة‏.‏",
      "text_en": " Narrated Abu Huraira:                     There is none among the companions of the Prophet who has narrated more Hadiths than I except `Abdullah bin `Amr (bin Al-`As) who used to write them and I never did the same.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11102",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "135",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، قال أخبرنا عبد الرزاق، قال أخبرنا معمر، عن همام بن منبه، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقبل صلاة من أحدث حتى يتوضأ ‏\"‏‏.‏ قال رجل من حضرموت ما الحدث يا أبا هريرة قال فساء أو ضراط‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not accepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is 'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن محمد، قال أخبرنا عبد الله، قال أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل كلم يكلمه المسلم في سبيل الله يكون يوم القيامة كهيئتها إذ طعنت، تفجر دما، اللون لون الدم، والعرف عرف المسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A wound which a Muslim receives in Allah's cause will appear on the Day of Resurrection as it was at the time of infliction; blood will be flowing from the wound and its color will be that of the blood but will smell like musk.\"",
      "chain": [
        "30304",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا عبد الرزاق، عن معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كانت بنو إسرائيل يغتسلون عراة، ينظر بعضهم إلى بعض، وكان موسى يغتسل وحده، فقالوا والله ما يمنع موسى أن يغتسل معنا إلا أنه آدر، فذهب مرة يغتسل، فوضع ثوبه على حجر، ففر الحجر بثوبه، فخرج موسى في إثره يقول ثوبي يا حجر‏.‏ حتى نظرت بنو إسرائيل إلى موسى، فقالوا والله ما بموسى من بأس‏.‏ وأخذ ثوبه، فطفق بالحجر ضربا ‏\"‏‏.‏ فقال أبو هريرة والله إنه لندب بالحجر ستة أو سبعة ضربا بالحجر‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, 'The (people of) Bani Israel used to take bath naked (all together) looking at each other. The Prophet Moses used to take a bath alone. They said, 'By Allah! Nothing prevents Moses from taking a bath with us except that he has a scrotal hernia.' So once Moses went out to take a bath and put his clothes over a stone and then that stone ran away with his clothes. Moses followed that stone saying, \"My clothes, O stone! My clothes, O stone! till the people of Bani Israel saw him and said, 'By Allah, Moses has got no defect in his body. Moses took his clothes and began to beat the stone.\" Abu Huraira added, \"By Allah! There are still six or seven marks present on the stone from that excessive beating.\"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "416",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قام أحدكم إلى الصلاة فلا يبصق أمامه، فإنما يناجي الله ما دام في مصلاه، ولا عن يمينه، فإن عن يمينه ملكا، وليبصق عن يساره أو تحت قدمه، فيدفنها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Prophet said, \"If anyone of you stands for prayer, he should not spit in front of him because in prayer he is speaking in private to Allah and he should not spit on his right as there is an angel, but he can spit either on his left or under his left foot and bury it (i.e. expectoration).",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنما جعل الإمام ليؤتم به فلا تختلفوا عليه، فإذا ركع فاركعوا، وإذا قال سمع الله لمن حمده‏.‏ فقولوا ربنا لك الحمد‏.‏ وإذا سجد فاسجدوا، وإذا صلى جالسا فصلوا جلوسا أجمعون، وأقيموا الصف في الصلاة، فإن إقامة الصف من حسن الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Imam is (appointed) to be followed. So do not differ from him, bow when he bows, and say, \"Rabbana-lakal hamd\" if he says \"Sami`a l-lahu liman hamidah\"; and if he prostrates, prostrate (after him), and if he prays sitting, pray sitting all together, and straighten the rows for the prayer, as the straightening of the rows is amongst those things which make your prayer a correct and perfect one. (See Hadith No. 657).",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1966",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والوصال ‏\"‏‏.‏ مرتين قيل إنك تواصل‏.‏ قال ‏\"‏ إني أبيت يطعمني ربي ويسقين، فاكلفوا من العمل ما تطيقون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said twice, \"(O you people) Be cautious! Do not practice Al-Wisal.\" The people said to him, \"But you practice Al-Wisal?\" The Prophet replied, \"My Lord gives me food and drink during my sleep. Do that much of deeds which is within your ability.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2066",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني يحيى بن جعفر، حدثنا عبد الرزاق، عن معمر، عن همام، قال سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفقت المرأة من كسب زوجها عن غير أمره، فله نصف أجره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If a woman gives something (i.e. in charity) from her husband's earnings without his permission, she will get half his reward.\"",
      "chain": [
        "30397",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2073",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن داود  عليه السلام  كان لا يأكل إلا من عمل يده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Prophet David used not to eat except from the earnings of his manual labor.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2156",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا حسان بن أبي عباد، حدثنا همام، قال سمعت نافعا، يحدث عن عبد الله بن عمر  رضى الله عنهما أن عائشة  رضى الله عنها  ساومت بريرة فخرج إلى الصلاة، فلما جاء قالت إنهم أبوا أن يبيعوها، إلا أن يشترطوا الولاء‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنما الولاء لمن أعتق ‏\"‏‏.‏ قلت لنافع حرا كان زوجها أو عبدا فقال ما يدريني",
      "text_en": " Narrated `Abdullah bin `Umar:                     Aisha wanted to buy Buraira and he (the Prophet ) went out for the prayer. When he returned, she told him that they (her masters) refused to sell her except on the condition that her Wala' would go to them. The Prophet replied, 'The Wala' would go to him who manumits.' \" Hammam asked Nafi` whether her (Buraira's) husband was a free man or a slave. He replied that he did not know.",
      "chain": [
        "18179",
        "11447",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2400",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا عبد الأعلى، عن معمر، عن همام بن منبه، أخي وهب بن منبه أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ مطل الغني ظلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"",
      "chain": [
        "30175",
        "20246",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2432",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأنقلب إلى أهلي، فأجد التمرة ساقطة على فراشي فأرفعها لآكلها، ثم أخشى أن تكون صدقة فألفيها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                      The Prophet said, \"Sometimes when I return home and find a date fallen on my bed, I pick it up in order to eat it, but I fear that it might be from a Sadaqa, so I throw it.\"",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2552",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، أنه سمع أبا هريرة  رضى الله عنه  يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يقل أحدكم أطعم ربك، وضئ ربك، اسق ربك‏.‏ وليقل سيدي مولاى‏.‏ ولا يقل أحدكم عبدي أمتي‏.‏ وليقل فتاى وفتاتي وغلامي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"You should not say, 'Feed your lord (Rabbaka), help your lord in performing ablution, or give water to your lord, but should say, 'my master (e.g. Feed your master instead of lord etc.) (Saiyidi), or my guardian (Maulai), and one should not say, my slave (Abdi), or my girl-slave (Amati), but should say, my lad (Fatai), my lass (Fatati), and 'my boy (Ghulami).",
      "chain": [
        "30213",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2674",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم عرض على قوم اليمين فأسرعوا، فأمر أن يسهم بينهم في اليمين أيهم يحلف‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet asked some people to take an oath, and they hurried for it. The Prophet ordered that lots should be drawn amongst them as to who would take an oath first.",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل سلامى من الناس عليه صدقة، كل يوم تطلع فيه الشمس يعدل بين الناس صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There is a Sadaqa to be given for every joint of the human body; and for every day on which the sun rises there is a reward of a Sadaqa (i.e. charitable gift) for the one who establishes justice among people.\"",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2746",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا حسان بن أبي عباد، حدثنا همام، عن قتادة، عن أنس  رضى الله عنه  أن يهوديا، رض رأس جارية بين حجرين، فقيل لها من فعل بك، أفلان أو فلان حتى سمي اليهودي، فأومأت برأسها، فجيء به، فلم يزل حتى اعترف، فأمر النبي صلى الله عليه وسلم فرض رأسه بالحجارة‏.‏",
      "text_en": " Narrated Anas:                     A Jew crushed the head of a girl between two stones. She was asked, \"Who has done so to you, soand- so? So-and-so?\" Till the name of the Jew was mentioned, whereupon she nodded (in agreement). So the Jew was brought and was questioned till he confessed. The Prophet then ordered that his head be crushed with stones.",
      "chain": [
        "18179",
        "11447",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2891",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ كل سلامى عليه صدقة كل يوم، يعين الرجل في دابته يحامله عليها أو يرفع عليها متاعه صدقة، والكلمة الطيبة، وكل خطوة يمشيها إلى الصلاة صدقة، ودل الطريق صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Charity is obligatory everyday on every joint of a human being. If one helps a person in matters concerning his riding animal by helping him to ride it or by lifting his luggage on to it, all this will be regarded charity. A good word, and every step one takes to offer the compulsory Congregational prayer, is regarded as charity; and guiding somebody on the road is regarded as charity.\"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2989",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل سلامى من الناس عليه صدقة كل يوم تطلع فيه الشمس، يعدل بين الاثنين صدقة، ويعين الرجل على دابته، فيحمل عليها، أو يرفع عليها متاعه صدقة، والكلمة الطيبة صدقة، وكل خطوة يخطوها إلى الصلاة صدقة، ويميط الأذى عن الطريق صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There is a (compulsory) Sadaqa (charity) to be given for every joint of the human body (as a sign of gratitude to Allah) everyday the sun rises. To judge justly between two persons is regarded as Sadaqa, and to help a man concerning his riding animal by helping him to ride it or by lifting his luggage on to it, is also regarded as Sadaqa, and (saying) a good word is also Sadaqa, and every step taken on one's way to offer the compulsory prayer (in the mosque) is also Sadaqa and to remove a harmful thing from the way is also Sadaqa.\"",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3027",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ هلك كسرى ثم لا يكون كسرى بعده، وقيصر ليهلكن ثم لا يكون قيصر بعده، ولتقسمن كنوزها في سبيل الله ‏\"‏‏.‏   وسمى الحرب خدعة",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Khosrau will be ruined, and there will be no Khosrau after him, and Caesar will surely be ruined and there will be no Caesar after him, and you will spend their treasures in Allah's Cause.\" He called, \"War is deceit'.",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3029",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أصرم، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  قال سمى النبي صلى الله عليه وسلم الحرب خدعة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle called,: \"War is deceit\".",
      "chain": [
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3124",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ غزا نبي من الأنبياء فقال لقومه لا يتبعني رجل ملك بضع امرأة وهو يريد أن يبني بها ولما يبن بها، ولا أحد بنى بيوتا ولم يرفع سقوفها، ولا أحد اشترى غنما أو خلفات وهو ينتظر ولادها‏.‏ فغزا فدنا من القرية صلاة العصر أو قريبا من ذلك فقال للشمس إنك مأمورة وأنا مأمور، اللهم احبسها علينا‏.‏ فحبست، حتى فتح الله عليه، فجمع الغنائم، فجاءت  يعني النار  لتأكلها، فلم تطعمها، فقال إن فيكم غلولا، فليبايعني من كل قبيلة رجل‏.‏ فلزقت يد رجل بيده فقال فيكم الغلول‏.‏ فلتبايعني قبيلتك، فلزقت يد رجلين أو ثلاثة بيده فقال فيكم الغلول، فجاءوا برأس مثل رأس بقرة من الذهب فوضعوها، فجاءت النار فأكلتها، ثم أحل الله لنا الغنائم، رأى ضعفنا وعجزنا فأحلها لنا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A prophet amongst the prophets carried out a holy military expedition, so he said to his followers, 'Anyone who has married a woman and wants to consummate the marriage, and has not done so yet, should not accompany me; nor should a man who has built a house but has not completed its roof; nor a man who has sheep or shecamels and is waiting for the birth of their young ones.' So, the prophet carried out the expedition and when he reached that town at the time or nearly at the time of the `Asr prayer, he said to the sun, 'O sun! You are under Allah's Order and I am under Allah's Order O Allah! Stop it (i.e. the sun) from setting.' It was stopped till Allah made him victorious. Then he collected the booty and the fire came to burn it, but it did not burn it. He said (to his men), 'Some of you have stolen something from the booty. So one man from every tribe should give me a pledge of allegiance by shaking hands with me.' (They did so and) the hand of a man got stuck over the hand of their prophet. Then that prophet said (to the man), 'The theft has been committed by your people. So all the persons of your tribe should give me the pledge of allegiance by shaking hands with me.' The hands of two or three men got stuck over the hand of their prophet and he said, \"You have committed the theft.' Then they brought a head of gold like the head of a cow and put it there, and the fire came and consumed the booty. The Prophet added: Then Allah saw our weakness and disability, so he made booty legal for us.\"",
      "chain": [
        "30216",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3245",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول زمرة تلج الجنة صورتهم على صورة القمر ليلة البدر، لا يبصقون فيها ولا يمتخطون ولا يتغوطون، آنيتهم فيها الذهب، أمشاطهم من الذهب والفضة، ومجامرهم الألوة، ورشحهم المسك، ولكل واحد منهم زوجتان، يرى مخ سوقهما من وراء اللحم، من الحسن، لا اختلاف بينهم ولا تباغض، قلوبهم قلب واحد، يسبحون الله بكرة وعشيا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The first group (of people) who will enter Paradise will be (glittering) like the moon when it is full. They will not spit or blow their noses or relieve nature. Their utensils will be of gold and their combs of gold and silver; in their centers the aloe wood will be used, and their sweat will smell like musk. Everyone of them will have two wives; the marrow of the bones of the wives' legs will be seen through the flesh out of excessive beauty. They ( i.e. the people of Paradise) will neither have differences nor hatred amongst themselves; their hearts will be as if one heart and they will be glorifying Allah in the morning and in the evening.\"",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3326",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خلق الله آدم وطوله ستون ذراعا، ثم قال اذهب فسلم على أولئك من الملائكة، فاستمع ما يحيونك، تحيتك وتحية ذريتك‏.‏ فقال السلام عليكم‏.‏ فقالوا السلام عليك ورحمة الله‏.‏ فزادوه ورحمة الله‏.‏ فكل من يدخل الجنة على صورة آدم، فلم يزل الخلق ينقص حتى الآن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created Adam, making him 60 cubits tall. When He created him, He said to him, \"Go and greet that group of angels, and listen to their reply, for it will be your greeting (salutation) and the greeting (salutations of your offspring.\" So, Adam said (to the angels), As-Salamu Alaikum (i.e. Peace be upon you). The angels said, \"As-salamu Alaika wa Rahmatu-l-lahi\" (i.e. Peace and Allah's Mercy be upon you). Thus the angels added to Adam's salutation the expression, 'Wa Rahmatu-l-lahi,' Any person who will enter Paradise will resemble Adam (in appearance and figure). People have been decreasing in stature since Adam's creation.",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3330",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم نحوه يعني ‏\"‏ لولا بنو إسرائيل لم يخنز اللحم، ولولا حواء لم تخن أنثى زوجها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"But for the Israelis, meat would not decay and but for Eve, wives would never betray their husbands.\"",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما أيوب يغتسل عريانا خر عليه رجل جراد من ذهب، فجعل يحثي في ثوبه، فنادى ربه يا أيوب، ألم أكن أغنيتك عما ترى قال بلى يا رب، ولكن لا غنى لي عن بركتك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While Job was naked, taking a bath, a swarm of gold locusts fell on him and he started collecting them in his garment. His Lord called him, 'O Job! Have I not made you rich enough to need what you see? He said, 'Yes, O Lord! But I cannot dispense with your Blessing.\"'",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3399",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لولا بنو إسرائيل لم يخنز اللحم، ولولا حواء لم تخن أنثى زوجها الدهر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Were it not for Bani Israel, meat would not decay; and were it not for Eve, no woman would ever betray her husband.\"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3402",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن سعيد الأصبهاني، أخبرنا ابن المبارك، عن معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما سمي الخضر أنه جلس على فروة بيضاء فإذا هي تهتز من خلفه خضراء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Al-Khadir was named so because he sat over a barren white land, it turned green with plantation after (his sitting over it.\"",
      "chain": [
        "30210",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3403",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام بن منبه، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ قيل لبني إسرائيل ادخلوا الباب سجدا وقولوا حطة‏.‏ فبدلوا فدخلوا يزحفون على أستاههم، وقالوا حبة في شعرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"It was said to Bani Israel, Enter the gate (of the town) with humility (prostrating yourselves) and saying: \"Repentance\", but they changed the word and entered the town crawling on their buttocks and saying: \"A wheat grain in the hair.\"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خفف على داود  عليه السلام  القرآن، فكان يأمر بدوابه فتسرج، فيقرأ القرآن قبل أن تسرج دوابه، ولا يأكل إلا من عمل يده ‏\"‏‏.‏   رواه موسى بن عقبة عن صفوان، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The reciting of the Zabur (i.e. Psalms) was made easy for David. He used to order that his riding animals be saddled, and would finish reciting the Zabur before they were saddled. And he would never eat except from the earnings of his manual work.\"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3444",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "وحدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ رأى عيسى ابن مريم رجلا يسرق، فقال له أسرقت قال كلا والله الذي لا إله إلا هو‏.‏ فقال عيسى آمنت بالله وكذبت عيني ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Jesus, seeing a man stealing, asked him, 'Did you steal?, He said, 'No, by Allah, except Whom there is None who has the right to be worshipped' Jesus said, 'I believe in Allah and suspect my eyes.\"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3472",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن نصر، أخبرنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ اشترى رجل من رجل عقارا له، فوجد الرجل الذي اشترى العقار في عقاره جرة فيها ذهب، فقال له الذي اشترى العقار خذ ذهبك مني، إنما اشتريت منك الأرض، ولم أبتع منك الذهب‏.‏ وقال الذي له الأرض إنما بعتك الأرض وما فيها، فتحاكما إلى رجل، فقال الذي تحاكما إليه ألكما ولد قال أحدهما لي غلام‏.‏ وقال الآخر لي جارية‏.‏ قال أنكحوا الغلام الجارية، وأنفقوا على أنفسهما منه، وتصدقا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A man bought a piece of and from another man, and the buyer found an earthenware jar filled with gold in the land. The buyer said to the seller. 'Take your gold, as I have bought only the land from you, but I have not bought the gold from you.' The (former) owner of the land said, \"I have sold you the land with everything in it.' So both of them took their case before a man who asked, 'Do you have children?' One of them said, \"I have a boy.' The other said, \"I have a girl.' The man said, 'Marry the girl to the boy and spend the money on both of them and give the rest of it in charity.' \"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3632",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقاتلوا خوزا وكرمان من الأعاجم، حمر الوجوه، فطس الأنوف، صغار الأعين، وجوههم المجان المطرقة، نعالهم الشعر ‏\"‏‏.‏ تابعه غيره عن عبد الرزاق‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour will not be established till you fight with the Khudh and the Kirman from among the non-Arabs. They will be of red faces, flat noses and small eyes; their faces will look like flat shields, and their shoes will be of hair.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3652",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى يقتتل فئتان، فيكون بينهما مقتلة عظيمة، دعواهما واحدة، ولا تقوم الساعة حتى يبعث دجالون كذابون قريبا من ثلاثين، كلهم يزعم أنه رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Hour will not be established till there is a war between two groups among whom there will be a great number of casualties, though the claims (or religion) of both of them will be one and the same. And the Hour will not be established till there appear about thirty liars, all of whom will be claiming to be the messengers of Allah. \"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3704",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن أبي الطيب، حدثنا إسماعيل بن مجالد، حدثنا بيان بن بشر، عن وبرة بن عبد الرحمن، عن همام، قال سمعت عمارا، يقول رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar:                     I saw Allah's Apostle and there was none with him but five slaves, two women and Abu Bakr (i.e. those were the only converts to Islam then).",
      "chain": [
        "30240",
        "20314",
        "11326",
        "11662",
        "11447",
        "25"
      ]
    },
    {
      "hadith_no": "4122",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ اشتد غضب الله على قوم فعلوا بنبيه  يشير إلى رباعيته  اشتد غضب الله على رجل يقتله رسول الله صلى الله عليه وسلم في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (pointing to his broken canine tooth) said, \"Allah's Wrath has become severe on the people who harmed His Prophet. Allah's Wrath has become severe on the man who is killed by the Apostle of Allah in Allah's Cause.\"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4418",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم أتيت بخزائن الأرض، فوضع في كفي سواران من ذهب، فكبرا على فأوحي إلى أن انفخهما، فنفختهما فذهبا فأولتهما الكذابين اللذين أنا بينهما صاحب صنعاء، وصاحب اليمامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While I was sleeping, I was given the treasures of the earth and two gold bangles were put in my hands, and I did not like that, but I received the inspiration that I should blow on them, and I did so, and both of them vanished. I interpreted it as referring to the two liars between whom I am present; the ruler of Sana and the Ruler of Yamaha.\"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4519",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، حدثنا عبد الرحمن بن مهدي، عن ابن المبارك، عن معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ قيل لبني إسرائيل ‏{‏ادخلوا الباب سجدا وقولوا حطة‏}‏ فدخلوا يزحفون على أستاههم، فبدلوا وقالوا حطة، حبة في شعرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"It was said to the children of Israel, 'Enter the gate (of the town), prostrate (in humility) and say: Hittatun (i.e. repentance) i.e. O Allah! Forgive our sins.' But they entered by dragging themselves on their buttocks, so they did something different (from what they had been ordered to do) and said, 'Hittatun,' but added, \"A grain in a hair.\"",
      "chain": [
        "30213",
        "20033",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4681",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت ورآها الناس آمنوا أجمعون، وذلك حين لا ينفع نفسا إيمانها ‏\"‏‏.‏ ثم قرأ الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The hour will not be established till the sun rises from the West; and when it rises (from the West) and the people see it, they all will believe. And that is (the time) when no good will it do to a soul to believe then.\" Then he recited the whole Verse (6.158)",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4686",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ قيل لبني إسرائيل ‏{‏ادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم‏}‏ فبدلوا فدخلوا يزحفون على أستاههم وقالوا حبة في شعرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"It was said to the children of Israel, 'Enter the gate in prostration and say Hitatun. (7.161) We shall forgive you, your faults.' But they changed (Allah's Order) and entered, dragging themselves on their buttocks and said, 'Habatun (a grain) in a Sha'ratin (hair).",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4760",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خفف على داود القراءة، فكان يأمر بدابته لتسرج، فكان يقرأ قبل أن يفرغ ‏\"‏‏.‏ يعني القرآن‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The recitation of Psalms (David's Qur'an) was made light and easy for David that he used to have his ridding animal be saddled while he would finish the recitation before the servant had saddled it.\"",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4899",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، رضى الله عنه قال قال النبي صلى الله عليه وسلم ‏\"‏ تحاجت الجنة والنار فقالت النار أوثرت بالمتكبرين والمتجبرين‏.‏ وقالت الجنة ما لي لا يدخلني إلا ضعفاء الناس وسقطهم‏.‏ قال الله تبارك وتعالى للجنة أنت رحمتي أرحم بك من أشاء من عبادي‏.‏ وقال للنار إنما أنت عذاب أعذب بك من أشاء من عبادي‏.‏ ولكل واحدة منهما ملؤها، فأما النار فلا تمتلئ حتى يضع رجله فتقول قط قط قط‏.‏ فهنالك تمتلئ ويزوى بعضها إلى بعض، ولا يظلم الله  عز وجل  من خلقه أحدا، وأما الجنة فإن الله عز وجل ينشئ لها خلقا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Paradise and the Fire (Hell) argued, and the Fire (Hell) said, \"I have been given the privilege of receiving the arrogant and the tyrants.' Paradise said, 'What is the matter with me? Why do only the weak and the humble among the people enter me?' On that, Allah said to Paradise. 'You are My Mercy which I bestow on whoever I wish of my servants.' Then Allah said to the (Hell) Fire, 'You are my (means of) punishment by which I punish whoever I wish of my slaves. And each of you will have its fill.' As for the Fire (Hell), it will not be filled till Allah puts His Foot over it whereupon it will say, 'Qati! Qati!' At that time it will be filled, and its different parts will come closer to each other; and Allah will not wrong any of His created beings. As regards Paradise, Allah will create a new creation to fill it with.\"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5027",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن منصور، قال وحدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله كذبني ابن آدم ولم يكن له ذلك، وشتمني ولم يكن له ذلك، أما تكذيبه إياى أن يقول إني لن أعيده كما بدأته، وأما شتمه إياى أن يقول اتخذ الله ولدا، وأنا الصمد الذي لم ألد ولم أولد ولم يكن لي كفؤا أحد ‏\"‏‏.‏ ‏{‏لم يلد ولم يولد * ولم يكن له كفؤا أحد‏}‏ كفؤا وكفيئا وكفاء واحد‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said:-- 'The son of Adam tells a lie against Me and he hasn't the right to do so; and he abuses me and he hasn't the right to do so. His telling a lie against Me is his saying that I will not recreate him as I created him for the first time; and his abusing Me is his saying that Allah has begotten children, while I am the self-sufficient Master, Whom all creatures need, Who begets not nor was He begotten, and there is none like unto Me.\"",
      "chain": [
        "30313",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5212",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ غزا نبي من الأنبياء فقال لقومه لا يتبعني رجل ملك بضع امرأة وهو يريد أن يبني بها ولم يبن بها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A prophet among the prophets went for a military expedition and said to his people: \"A man who has married a lady and wants to consummate his marriage with her and he has not done so yet, should not accompany me.' \"",
      "chain": [
        "30216",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5247",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ لا تصوم المرأة وبعلها شاهد إلا بإذنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A woman should not fast (optional fasts) except with her husband's permission if he is at home (staying with her).",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5414",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، قال سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفقت المرأة من كسب زوجها عن غير أمره فله نصف أجره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If the wife gives of her husband's property (something in charity) without his permission, he will get half the reward.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5799",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ العين حق ‏\"‏‏.‏ ونهى عن الوشم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The effect of an evil eye is a fact.\" And he prohibited tattooing.",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6007",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العين حق ‏\"‏‏.‏ ونهى عن الوشم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The evil eye is a fact,\" and he forbade tattooing.",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6125",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن منصور، عن إبراهيم، عن همام، قال كنا مع حذيفة فقيل له إن رجلا يرفع الحديث إلى عثمان‏.‏ فقال حذيفة سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قتات ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     I heard the Prophet saying, \"A Qattat will not enter Paradise.\"",
      "chain": [
        "20348",
        "20012",
        "11067",
        "11051",
        "11447"
      ]
    },
    {
      "hadith_no": "6133",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا، ولا تحاسدوا، ولا تدابروا، ولا تباغضوا، وكونوا عباد الله إخوانا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Beware of suspicion, for suspicion is the worst of false tales; and do not look for the others' faults and do not spy, and do not be jealous of one another, and do not desert (cut your relation with) one another, and do not hate one another; and O Allah's worshipers! Be brothers (as Allah has ordered you!\")",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6299",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ خلق الله آدم على صورته، طوله ستون ذراعا، فلما خلقه قال اذهب فسلم على أولئك النفر من الملائكة جلوس، فاستمع ما يحيونك، فإنها تحيتك وتحية ذريتك‏.‏ فقال السلام عليكم‏.‏ فقالوا السلام عليك ورحمة الله‏.‏ فزادوه ورحمة الله، فكل من يدخل الجنة على صورة آدم، فلم يزل الخلق ينقص بعد حتى الآن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created Adam in His picture, sixty cubits (about 30 meters) in height. When He created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they will say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went and) said, 'As-Salamu alaikum (Peace be upon you).' They replied, 'AsSalamu-'Alaika wa Rahmatullah (Peace and Allah's Mercy be on you) So they increased 'Wa Rahmatullah' The Prophet added 'So whoever will enter Paradise, will be of the shape and picture of Adam Since then the creation of Adam's (offspring) (i.e. stature of human beings is being diminished continuously) to the present time.\"",
      "chain": [
        "30397",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6303",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسلم الصغير على الكبير، والمار على القاعد، والقليل على الكثير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The young should greet the old, the passer by should greet the sitting one, and the small group of persons should greet the large group of persons. \"",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6369",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا حسان بن أبي عباد، حدثنا همام، عن عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أطفئوا المصابيح بالليل إذا رقدتم، وغلقوا الأبواب، وأوكوا الأسقية، وخمروا الطعام والشراب ‏\"‏‏.‏  قال همام وأحسبه قال  ‏\"‏ ولو بعود ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     Allah s Apostle said, \"When you intend going to bed at night, put out the lights, close the doors, tie the mouths of the water skins, and cover your food and drinks.\" Hamrnam said, \"I think he (the other narrator) added, 'even with piece of wood across the utensil.'",
      "chain": [
        "18179",
        "11447",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "6679",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مولود إلا يولد على الفطرة، فأبواه يهودانه وينصرانه، كما تنتجون البهيمة، هل تجدون فيها من جدعاء حتى تكونوا أنتم تجدعونها ‏\"‏‏.‏ قالوا يا رسول الله أفرأيت من يموت وهو صغير قال ‏{‏الله أعلم بما كانوا عاملين‏}‏",
      "text_en": "      Narrated Abu Huraira:                      Allah's Apostle said, \"No child is born but has      the Islamic Faith, but its parents turn it into a Jew or a Christian.      It is as you help the animals give birth. Do you find among their      offspring a mutilated one before you mutilate them yourself?\" The      people said, \"O Allah's Apostle! What do you think about those (of      them) who die young?\" The Prophet said, \"Allah knows what they would      have done (were they to live).\"",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6689",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يأتي ابن آدم النذر بشىء لم يكن قد قدرته، ولكن يلقيه القدر وقد قدرته له، أستخرج به من البخيل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said (that Allah said), \"Vowing does not bring to the son of Adam anything I have not already written in his fate, but vowing is imposed on him by way of fore ordainment. Through vowing I make a miser spend of his wealth.\"",
      "chain": [
        "30318",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6706",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"We (Muslims) are the last in the world, but will be foremost on the Day of Resurrection.\" Allah's Apostle also said, \"By Allah, if anyone of you insists on fulfilling an oath by which he may harm his family, he commits a greater sin in Allah's sight than that of dissolving his oath and making expiation for it.\"",
      "chain": [
        "30123",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6718",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام   هو ابن يوسف  عن معمر، عن همام، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ والذي نفس محمد بيده لو تعلمون ما أعلم لبكيتم كثيرا، ولضحكتم قليلا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Abu-l-Qasim (the Prophet) said, \"By Him in Whose Hand Muhammad's soul is, if you know that which I know, you would weep much and laugh little.\"",
      "chain": [
        "30309",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7040",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثني إسحاق، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقبل الله صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah does not accept prayer of anyone of you if he does Hadath (passes wind) till he performs the ablution (anew).",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7043",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثني إسحاق، حدثنا عبد الرزاق، حدثنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون كنز أحدكم يوم القيامة شجاعا أقرع، يفر منه صاحبه فيطلبه ويقول أنا كنزك‏.‏ قال والله لن يزال يطلبه حتى يبسط يده فيلقمها فاه ‏\"‏‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ما رب النعم لم يعط حقها، تسلط عليه يوم القيامة، تخبط وجهه بأخفافها ‏\"‏‏.‏ وقال بعض الناس في رجل له إبل، فخاف أن تجب عليه الصدقة، فباعها بإبل مثلها، أو بغنم، أو ببقر، أو بدراهم، فرارا من الصدقة بيوم، احتيالا فلا بأس عليه، وهو يقول إن زكى إبله قبل أن يحول الحول بيوم أو بسنة، جازت عنه‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"On the Day of Resurrection the Kanz (Treasure or wealth of which, Zakat has not been paid) of anyone of you will appear in the shape of a huge bald headed poisonous male snake and its owner will run away from it, but it will follow him and say, 'I am your Kanz.'\" The Prophet added, \"By Allah, that snake will keep on following him until he stretches out his hand and let the snake swallow it.\" Allah's Apostle added, \"If the owner of camels does not pay their Zakat, then, on the Day of Resurrection those camels will come to him and will strike his face with their hooves.\" Some people said: Concerning a man who has camels, and is afraid that Zakat will be due so he sells those camels for similar camels or for sheep or cows or money one day before Zakat becomes due in order to avoid payment of their Zakat cunningly! \"He has not to pay anything.\" The same scholar said, \"If one pays Zakat of his camels one day or one year prior to the end of the year (by the end of which Zakat becomes due), his Zakat will be valid.\"",
      "chain": [
        "30312",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7108",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إسحاق بن إبراهيم، حدثنا عبد الرزاق، عن معمر، عن همام، أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم رأيت أني على حوض أسقي الناس، فأتاني أبو بكر فأخذ الدلو من يدي ليريحني، فنزع ذنوبين وفي نزعه ضعف والله يغفر له، فأتى ابن الخطاب فأخذ منه، فلم يزل ينزع، حتى تولى الناس والحوض يتفجر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"While I was sleeping, I saw myself standing over a tank (well) giving water to the people to drink. Then Abu Bakr came to me and took the bucket from me in order to relieve me and he pulled out one or two full buckets, and there was weakness in his pulling --may Allah forgive him. Then Ibn Al-Khattab took it from him and went on drawing water till the people left (after being satisfied) while the tank was over flowing with water.\"",
      "chain": [
        "30123",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7122",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"We (Muslims) are the last (to come) but (will be) the foremost (on the Day of Resurrection).\" Allah's Apostle further said, ''While sleeping, I was given the treasures of the world and two golden bangles were put in my hands, but I felt much annoyed, and those two bangles distressed me very much, but I was inspired that I should blow them off, so I blew them and they flew away. Then I interpreted that those two bangles were the liars between whom I was (i.e., the one of San`a' and the one of Yamama).",
      "chain": [
        "30021",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "7159",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد، أخبرنا عبد الرزاق، عن معمر، عن همام، سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يشير أحدكم على أخيه بالسلاح، فإنه لا يدري لعل الشيطان ينزع في يده، فيقع في حفرة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should point out towards his Muslim brother with a weapon, for he does not know, Satan may tempt him to hit him and thus he would fall into a pit of fire (Hell)\"",
      "chain": [
        "30213",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7313",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو كان عندي أحد ذهبا، لأحببت أن لا يأتي ثلاث وعندي منه دينار، ليس شىء أرصده في دين على أجد من يقبله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If I had gold equal to the mountain of Uhud, I would love that, before three days had passed, not a single Dinar thereof remained with me if I found somebody to accept it excluding some amount that I would keep for the payment of my debts.''",
      "chain": [
        "30311",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7368",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن همام، عن حذيفة، قال يا معشر القراء استقيموا فقد سبقتم سبقا بعيدا فإن أخذتم يمينا وشمالا، لقد ضللتم ضلالا بعيدا‏.‏",
      "text_en": " Narrated Hammam:                     Hudhaifa said, \"O the Group of Al-Qurra! Follow the straight path, for then you have taken a great lead (and will be the leaders), but if you divert right or left, then you will go astray far away.\"",
      "chain": [
        "20348",
        "20012",
        "11060",
        "11051",
        "11447",
        "145"
      ]
    },
    {
      "hadith_no": "7486",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا فضيل، عن منصور، عن إبراهيم، عن همام، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم قلت أرسل كلابي المعلمة‏.‏ قال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله فأمسكن فكل، وإذا رميت بالمعراض فخزق فكل ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked the Prophet, \"I send off (for a game) my trained hunting dogs; (what is your verdict concerning the game they hunt?\" He said, \"If you send off your trained hunting dogs and mention the Name of Allah, then, if they catch some game, eat (thereof). And if you hit the game with a mi'rad (a hunting tool) and it wounds it, you can eat (it).",
      "chain": [
        "20164",
        "20271",
        "11067",
        "11051",
        "11447",
        "212"
      ]
    },
    {
      "hadith_no": "7508",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، حدثنا أبو هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن يمين الله ملأى لا يغيضها نفقة سحاء الليل والنهار، أرأيتم ما أنفق منذ خلق السموات والأرض فإنه لم ينقص ما في يمينه، وعرشه على الماء وبيده الأخرى الفيض  أو القبض  يرفع ويخفض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Right (Hand) of Allah Is full, and (Its fullness) is not affected by the continuous spending night and day. Do you see what He has spent since He created the Heavens and the Earth? Yet all that has not decreased what is in His Right Hand. His Throne is over the water and in His other Hand is the Bounty or the Power to bring about death, and He raises some people and brings others down.\" (See Hadith No. 508)",
      "chain": [
        "30026",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7567",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن همام، سمع أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقل أحدكم اللهم اغفر لي إن شئت، ارحمني إن شئت، ارزقني إن شئت، وليعزم مسألته، إنه يفعل ما يشاء، لا مكره له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should say: 'O Allah! Forgive me if You wish,' or 'Bestow Your Mercy on me if You wish,' or 'Provide me with means of subsistence if You wish,' but he should be firm in his request, for Allah does what He will and nobody can force Him (to do anything).",
      "chain": [
        "30020",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7585",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما أيوب يغتسل عريانا خر عليه رجل جراد من ذهب فجعل يحثي في ثوبه، فنادى ربه يا أيوب ألم أكن أغنيتك عما ترى قال بلى يا رب ولكن لا غنى بي عن بركتك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Once while Job (Aiyub) was taking a bath in a naked state. Suddenly a great number of gold locusts started falling upon him and he started collecting them in his clothes. His Lord called him, 'O Job! Didn't I make you rich enough to dispense with what you see now?' Job said, 'Yes, O Lord! But I cannot dispense with Your Blessings.'",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7590",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ قال الله أعددت لعبادي الصالحين ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     the Prophet said, \"Allah said, \"I have prepared for My righteous slaves (such excellent things) as no eye has ever seen, nor an ear has ever heard nor a human heart can ever think of.' \"",
      "chain": [
        "30176",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "215",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "351",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل إذا تحدث عبدي بأن يعمل حسنة فأنا أكتبها له حسنة ما لم يعمل فإذا عملها فأنا أكتبها بعشر أمثالها وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ما لم يعملها فإذا عملها فأنا أكتبها له بمثلها ‏\"‏ ‏.‏  وقال رسول الله صلى الله عليه وسلم ‏\"‏ قالت الملائكة رب ذاك عبدك يريد أن يعمل سيئة - وهو أبصر به - فقال ارقبوه فإن عملها فاكتبوها له بمثلها ‏.‏ وإن تركها فاكتبوها له حسنة - إنما تركها من جراى ‏\"‏ ‏.‏  وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحسن أحدكم إسلامه فكل حسنة يعملها تكتب بعشر أمثالها إلى سبعمائة ضعف وكل سيئة يعملها تكتب بمثلها حتى يلقى الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Muhammad, the Messenger of Allah (may peace be upon him), said:                      When it occurs to my bondsman that he should do a good deed but he actually does not do it, record one good to him, but if he puts it into practice, I make an entry of ten good acts in his favour. When it occurs to him to do evil, but he does not commit it, I forgive that. But if he commits it, I record one evil against his name. The Messenger of Allah (may peace be upon him) observed. The angels said: That bondsman of Yours intends to commit evil. though His Lord is more Vigilant than he. Upon this He (the Lord) said: Watch him; if he commits (evil), write it against his name but if he refrains from doing it, write one good deed or him, for he desisted from doing it for My sake. The Messenger of Allah said: He who amongst you is good of faith, all his good acts are multiplied from ten to seven hundred times (and are recorded in his name) and all the evils that he commits are recorded as such (i, e. without increase) till he meets Allah.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "416",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث العلاء عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أدنى مقعد أحدكم من الجنة أن يقول له تمن ‏.‏ فيتمنى ويتمنى فيقول له هل تمنيت فيقول نعم ‏.‏ فيقول له فإن لك ما تمنيت ومثله معه ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      This is what Abu Huraira transmitted to us from the Messenger of Allah (may peace be upon him), and he narrated many of them;- one of them was: The Messenger of Allah (may peace be upon him) said: The lowest in rank among you in Paradise would be asked: Desire (whatever you like). And he would express his desire and again and again express a desire. tHe would be asked: Have you expressed your desire? He would say: Yes. Then He (Allah) would say: For thee is (granted) what thou desirest, and the like of it along with it.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق بن همام، حدثنا معمر بن راشد، عن همام بن منبه، أخي وهب بن منبه قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقبل صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih who is the brother of Wahb b. Munabbih said:                      This is what has been transmitted to us by Abu Huraira from Muhammad, the Messenger of Allah (may peace be upon him) and then narrated a hadith out of them and observed that the Messenger of Allah (may peace be upon him) said: The prayer of none amongst you would be accepted in a state of impurity until he performs ablution.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق بن همام، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا توضأ أحدكم فليستنشق بمنخريه من الماء ثم لينتثر ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira transmitted to us from Muhammad, the Messenger of Allah (may peace be upon him), and he mentioned a number of a hadith, of which this is one: that the Messenger of Allah (may peace be upon him) said: When anyone amongst you (performs ablution) he must snuff his nostrils with water and then clean them.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "272",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وإسحاق بن إبراهيم، وأبو كريب جميعا عن أبي معاوية، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، - واللفظ ليحيى - قال أخبرنا أبو معاوية، عن الأعمش، عن إبراهيم، عن همام، قال بال جرير ثم توضأ ومسح على خفيه فقيل تفعل هذا ‏.‏ فقال نعم رأيت رسول الله صلى الله عليه وسلم بال ثم توضأ ومسح على خفيه ‏.‏ قال الأعمش قال إبراهيم كان يعجبهم هذا الحديث لأن إسلام جرير كان بعد نزول المائدة ‏.‏",
      "text_en": " Hummam reported:                      Jarir urinated, then performed ablution and wiped over the socks. It was said to him: Do you do like this? He said: Yes, I saw that the Messenger of Allah (may peace be upon him) urinated, then performed ablution and then wiped over his shoes. A'mash said: Ibrahim had observed that this hadith was a surprise for them (the people) because Jarir had embraced Islam after the revelation of Surat al-Ma'ida.",
      "chain": [
        "30399",
        "30123",
        "20354",
        "30201",
        "20354",
        "20354",
        "11060",
        "11051",
        "11447"
      ]
    },
    {
      "hadith_no": "279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ طهور إناء أحدكم إذا ولغ الكلب فيه أن يغسله سبع مرات ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      Of the a hadith narrated by Abu Huraira from Muhammad, the Messenger of Allah (may peace be upon him), one is this: The Messenger of Allah (may peace be upon him) said: The purification of the utensil belonging to one amongst you, after it is licked by a dog, lies in washing it seven times.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبل في الماء الدائم الذي لا يجري ثم تغتسل منه ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      Of the ahadith narrated to us by Abfi Huraira from Muhammad the Messenger of Allah (may peace be upon him) one is this: The Messenger or Allah (may peace be upon him) said: You should not urinate in standing water, that is not flowing, then wash in it.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الأعمش، عن إبراهيم، عن الأسود، وهمام، عن عائشة، في المني قالت كنت أفركه من ثوب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Al-Aawad and Hammam reported A'isha as saying:                      I used to scrape off the (drop of) semen from the garment of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "11447"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا ابن عيينة، عن منصور، عن إبراهيم، عن همام، عن عائشة، بنحو حديثهم ‏.‏",
      "text_en": " Hammam narrated the hadith from A'isha like the (above-mentioned) traditions.",
      "chain": [
        "38487",
        "20005",
        "11067",
        "11051",
        "11447"
      ]
    },
    {
      "hadith_no": "339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ كانت بنو إسرائيل يغتسلون عراة ينظر بعضهم إلى سوأة بعض وكان موسى - عليه السلام - يغتسل وحده فقالوا والله ما يمنع موسى أن يغتسل معنا إلا أنه آدر - قال - فذهب مرة يغتسل فوضع ثوبه على حجر ففر الحجر بثوبه - قال - فجمح موسى بإثره يقول ثوبي حجر ثوبي حجر ‏.‏ حتى نظرت بنو إسرائيل إلى سوأة موسى قالوا والله ما بموسى من بأس ‏.‏ فقام الحجر حتى نظر إليه - قال - فأخذ ثوبه فطفق بالحجر ضربا ‏\"‏ ‏.‏ قال أبو هريرة والله إنه بالحجر ندب ستة أو سبعة ضرب موسى بالحجر ‏.‏",
      "text_en": " Amongst the traditions narrated from Muhammad, the Messenger of Allah (may peace be upon him) on the authority of Abu Huraira, the one is that Banu Isra'il used to take a bath naked, and they looked at the private parts of one another. Moses (peace be upon him), however, took a bath alone (in privacy) ; and they said (tauntingly):                      By Allah, nothing prohibits Moses to take a bath along with us, but sacrotal hernia. He (Moses) once went for a bath and placed his clothes on a stone and the stone moved on with his clothes. Moses ran after it saying: 0 stone, my clothes,0 stone, my clothes, and Banu Isra'il had the chance to see the private parts of Moses, and said: By Allah, Moses does not suffer from any ailment. The stone then stopped, till Moses had been seen by them, and he then took hold of his clothes and struck the stone. Abu Huraira said: By Allah, there are the marks of six or seven strokes made by Moses on the stone.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله غير أنه قال ‏\"‏ حتى يظل الرجل إن يدري كيف صلى ‏\"‏ ‏.‏",
      "text_en": " A hadith like it has been narrated by Abu Huraira but for these words:                     \" He (the man saying the prayer) does not know how much he has prayed.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " 'A hadith like this is transmitted by Ma'mar from Hammam b. Munabbih on the authority of Abu Huraira who reported it from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "414",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Hammam b. Munabbih from the Apostle of Allah (may peace be upon him) on the authority of Abu Huraira.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله وزاد ‏\"‏ في الصلاة ‏\"‏ ‏.‏",
      "text_en": " This hadith is transmitted by Muhammad b. Rafi', Abu'I-Razzaq. Ma'mar, Hammam on the authority of Abu Huraira with the addition of (the word)\" prayer\".",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال ‏\"‏ أقيموا الصف في الصلاة فإن إقامة الصف من حسن الصلاة ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what was transmitted to us by Abu Huraira from the Messenger of Allah (may peace be upon him) and, while making a mention of a few ahadith, said: (The Messengerof Allah directed us thus): Establish rows in prayer, for the making of a row (straight) is one of the merits of prayer.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ما قام أحدكم للناس فليخفف الصلاة فإن فيهم الكبير وفيهم الضعيف وإذا قام وحده فليطل صلاته ما شاء ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira transmitted to us from Muhammad the Messenger of Allah (may peace be upon him), and he narrated (some) ahadith out of (these narrations and one of them is this): The Messenger of Allah (may peace be upon him) said: When any one of you stands to lead people In prayer, he should shorten it, for amongst them are the aged, and amongst them are the weak, but when he prays by himself, he may prolong his prayer as he likes.",
      "chain": [
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1200",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ نصرت بالرعب وأوتيت جوامع الكلم ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      That is what Abu Huraira reported to us from the Messenger of Allah (may peace be upon him) and he narrated (some) ahadith one of which is that the Messenger of Allah (may peace be upon him) said: I have been helped by terror (in the hearts of enemies) and I have been given words which are concise but comprehensive in meaning.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1391",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا نودي بالصلاة فأتوها وأنتم تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported ahadith from the Messenger of Allah (may peace be upon him), and one of them is that the Messenger of Allah (may peace be upon), said:                      When the call is made for prayer come to it walking with tranquillity, and pray what you are in time for, and complete what you have missed.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا ابن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ أبردوا عن الحر في الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira narrated to us from the Holy Prophet and he transmitted some ahadith-one of them was that the Messenger of Allah (may peace be upon him) said: Let the heat become less severe before prayer, for the intensity of heat is from the exhalation of Hell.",
      "chain": [
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ والملائكة يتعاقبون فيكم ‏\"‏ ‏.‏ بمثل حديث أبي الزناد ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Angels take turns among you by night and by day, and the rest of the hadith is the same.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1515",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن آمر فتياني أن يستعدوا لي بحزم من حطب ثم آمر رجلا يصلي بالناس ثم تحرق بيوت على من فيها ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira reported to us from the Messenger of Allah (may peace be upon him) and (in this connection) he narrated some ahadith, one of them is: The Messenger of Allah (may peace be upon him) said: I intend that I should command my young men to gather bundles fuel for me, and then order a person to lead people in prayer, and then burn the houses with their inmates (who have not joined the congregation).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1544",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحو هذا ‏.‏",
      "text_en": " A hadith like this has been narrated by Hammam b. Munabbih on the authority of Abu Huraira.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم من الليل فاستعجم القرآن على لسانه فلم يدر ما يقول فليضطجع ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Apostle of Allah (may peace be upon him) heard a person reciting the Qur'an at night. Upon this he said:                      May Allah show mercy to him; he has reminded me of such and such a verse which I had missed in such and such a surah.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2011",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثناه محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ ولم يقل وهي ساعة خفيفة ‏.‏",
      "text_en": " Hammam b. Munabbih reported this hadith from Abu Huraira who reported from the Apostle of Allah (may peace be upon him) but he did not say:                     \" That time is short.\"",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2018",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، أخي وهب بن منبه قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون السابقون يوم القيامة بيد أنهم أوتوا الكتاب من قبلنا وأوتيناه من بعدهم وهذا يومهم الذي فرض عليهم فاختلفوا فيه فهدانا الله له فهم لنا فيه تبع فاليهود غدا والنصارى بعد غد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Muhammad, the Messenger of Allah (may peace be upon him), as saying:                      We who are the last would be the first on the Day of Resurrection but they (other Ummahs) were given the Book before us and we were given after them, and this was the day that was prescribed for them but they disagreed on it. And Allah guided us to it. and they came after us with regard to it, the Jews observing the next day and the Christians the day following that.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2356",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق بن همام، حدثنا معمر بن راشد، عن همام بن منبه، أخي وهب بن منبه قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها ‏.‏ وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله قال لي أنفق أنفق عليك ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ يمين الله ملأى لا يغيضها سحاء الليل والنهار أرأيتم ما أنفق مذ خلق السماء والأرض فإنه لم يغض ما في يمينه ‏\"‏ ‏.‏ قال ‏\"‏ وعرشه على الماء وبيده الأخرى القبض يرفع ويخفض ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that Allah said to him:                     \" Spend, I will bestow upon you.\" And the Messenger of Allah (may peace be upon him) said: The right hand of Allah is full and spending (the riches) liberally during day and night will not diminish (the resources of Allah). Don't you see what (an enormous amount of resources) He has spent since He created the heaven and the earth, and what is in His right hand has not decreased? His Throne is upon the water. And in His other hand is death, and He elevates and degrades (whom He likes).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2382",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق بن همام، حدثنا معمر، عن همام بن، منبه قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ كل سلامى من الناس عليه صدقة كل يوم تطلع فيه الشمس - قال - تعدل بين الاثنين صدقة وتعين الرجل في دابته فتحمله عليها أو ترفع له عليها متاعه صدقة - قال - والكلمة الطيبة صدقة وكل خطوة تمشيها إلى الصلاة صدقة وتميط الأذى عن الطريق صدقة ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported that-this is out of (those ahadith) which Abu Huraira narrated to us from Muhammad, the Messenger of Allah (may peace be upon him). And he while making a mention of ahadith reported from Allah's Messenger (may peace be upon him) said this:                      Sadaqa is due on every joint of a person, every day the sun rises. Administering of justice between two men is also a Sadaqa. And assisting a man to ride upon his beast, or helping him load his luggage upon it, is a Sadaqa; and a good word is a Sadaqa; and every step that you take towards prayer is a Sadaqa, and removing of harmful things from the pathway is a Sadaqa.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصم المرأة وبعلها شاهد إلا بإذنه ولا تأذن في بيته وهو شاهد إلا بإذنه وما أنفقت من كسبه من غير أمره فإن نصف أجره له ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      These are some of the a hadith of Muhammad. the Messenger of Allah (may peace be upon him), transmitted to us on the authority of Abu Huraira. So he narrated one hadith out of them (as this): The Messenger of Allah (may peace be upon him) said: No woman should observe fast when her spouse is present (in the house) but with his permission. And she should not admit any (mahram) in his house, while he (her husband) is present, but with his permission. And whatever she spends from his earnings without his sanction, for him is half the reward.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن أبي عمر المكي، حدثنا سفيان، عن عمرو بن دينار، حدثني وهب بن، منبه - ودخلت عليه في داره بصنعاء فأطعمني من جوزة في داره - عن أخيه قال سمعت معاوية بن أبي سفيان يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ فذكر مثله ‏.‏",
      "text_en": " 'Amr b. Dinar reported from Wahb b. Munabbih:                      I went to his house in San'a' and he offered me nuts grown in his house to eat. And his brother said: I heard Mu'awiya b. Abu Sufyan saying that he had heard the Messenger of Allah (may peace be upon him) as saying, and then he made a mention (of a hadith) like one mentioned above.",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11102",
        "11447",
        "27"
      ]
    },
    {
      "hadith_no": "2526",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق بن همام، حدثنا معمر، عن همام بن، منبه قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ والله إني لأنقلب إلى أهلي فأجد التمرة ساقطة على فراشي - أو في بيتي - فأرفعها لآكلها ثم أخشى أن تكون صدقة - أو من الصدقة - فألقيها ‏\"‏ ‏.‏",
      "text_en": " Out of so many ahadith which Hammam b. Munabbih narrated on the authority of Abu Huraira from the Messenger of Allah (may peace be upon him) one is this that the Messenger of Allah (may peace be upon him) said:                      I go back to my family and I find a date lying on my bed or in my house, and I take it up to eat it, but then I throw it away fearing that it may be a Sadaqa or from Sadaqa.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3273",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال بينما رجل يسوق بدنة مقلدة قال له رسول الله صلى الله عليه وسلم ‏\"‏ ويلك اركبها ‏\"‏ ‏.‏ فقال بدنة يا رسول الله ‏.‏ قال ‏\"‏ ويلك اركبها ويلك اركبها ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      It is one out of these (narrations) that Abu Huraira (Allah be pleased with him) narrated to us from Muhammad the Messenger of Allah (may peace be upon him), and he narrated to us traditions out of which is that he said: When there was a person who was driving a garlanded sacrificial camel, Allah's Messenger (may peace be upon him) said to him: Woe to you; ride on it. He said: Messenger of Allah, it is a sacrificial animal, whereupon Allah's Messenger (may peace be upon him) said: Woe to you, ride on it; woe to you, ride on it.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لولا بنو إسرائيل لم يخبث الطعام ولم يخنز اللحم ولولا حواء لم تخن أنثى زوجها الدهر ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      These are some of the ahadith which Abu Huraira (Allah be pleased with him) narrated to us from Allah's Messenger (may peace be upon him), and one of these (this one): Allah's Messenger (may peace be upon him) said: Had it not been for Bani Isra'il, food would not have become stale, and meal would not have gone bad; and had it not been for Eve, a woman would never have acted unfaithfully toward her husband.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3912",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ما أحدكم اشترى لقحة مصراة أو شاة مصراة فهو بخير النظرين بعد أن يحلبها إما هي وإلا فليردها وصاعا من تمر ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      Out of the ahadith which Abu Huraira (Allah be pleased with him) reported to us from Allah's Messenger (may peace be upon him) one is this that Allah's Messenger (may peace be upon him) said: If one among you buys a she-camel having its udder tied up he has the two options for him after milking it either (to retain it) or return it with a sa' of dates.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4086",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، قالا جميعا حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Abu Huraira (Allah be pleased with him).",
      "chain": [
        "30123",
        "20347",
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4245",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى الناس بالمؤمنين في كتاب الله عز وجل فأيكم ما ترك دينا أو ضيعة فادعوني فأنا وليه وأيكم ما ترك مالا فليؤثر بماله عصبته من كان ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira (Allah be pleased with him) narrated to us from Allah's Messenger (may peace he upon him). And he narrated many ahadith, and one was this: Allah's Messenger (may peace be upon him said: I am, according to the Book of Allah, the Exalted and Majestic, nearest to the believers of all the human beings. So whoever amongst you dies in debt or leaves behind destitute children, you should call me (for help) ), for I am his guardian. And who amongst you leaves property, his inheritor is entitled to get it, whoever he is.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4381",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ والله لأن يلج أحدكم بيمينه في أهله آثم له عند الله من أن يعطي كفارته التي فرض الله ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira reported to us from Allah's Messenger (may peace be upon him), and he narrated a hadith and (one) of them is that Allah's Messenger (may peace be upon him) said: I swear by Allah, it is more sinful in Allah's sight for one of you to persist in an oath regarding his family than payment of its expiation which Allah has imposed upon him (for breaking the oath).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4414",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ نعما للمملوك أن يتوفى يحسن عبادة الله وصحابة سيده نعما له ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      It is good for a slave that he worships Allah well, and serves his master (well). It is good for him.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4458",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن أنس بن مالك، أن جارية، وجد رأسها قد رض بين حجرين فسألوها من صنع هذا بك فلان فلان حتى ذكروا يهوديا فأومت برأسها فأخذ اليهودي فأقر فأمر به رسول الله صلى الله عليه وسلم أن يرض رأسه بالحجارة ‏.‏",
      "text_en": " Anas b. Malik reported:                      A girl was found with her head crushed between two stones. They asked her as to who had done that-has so and so (done it) until they mentioned a Jew. She indicated with the nod of her head (that it was so). So the Jew was caught, and he made confession (of his guilt). And Allah's Messenger (may peace be upon him) commanded that his head be smashed with stones.",
      "chain": [
        "11447",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4594",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ اشترى رجل من رجل عقارا له فوجد الرجل الذي اشترى العقار في عقاره جرة فيها ذهب فقال له الذي اشترى العقار خذ ذهبك مني إنما اشتريت منك الأرض ولم أبتع منك الذهب ‏.‏ فقال الذي شرى الأرض إنما بعتك الأرض وما فيها - قال - فتحاكما إلى رجل فقال الذي تحاكما إليه ألكما ولد فقال أحدهما لي غلام وقال الآخر لي جارية ‏.‏ قال أنكحوا الغلام الجارية وأنفقوا على أنفسكما منه وتصدقا ‏\"‏ ‏.‏",
      "text_en": " Hammim b. Munabbih said:                      Abu Huraira reported (so many) ahadith of Allah's Messenger (may peace be upon him), and one of them is this: A person bought from another person a piece of land, and the person who had, bought that land found in it an earthen ware which contained gold. The person who had bought the land said (to the seller of the land): Take your gold from me, for I bought only the land from you and not the gold. The man who had sold the land said: I sold the land to you and whatever was in it. They referred the matter to a person. One who was made as a judge said to them: Have you any issue? One of them said: I have a boy, and the other said: I have a young daughter He (the judge) said: Marry this young boy with the girl, and spend something on yourselves and also give (some) charity out of it.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا محمد بن عبد الرحمن بن سهم، أخبرنا عبد الله بن المبارك، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏الحرب خدعة ‏\"‏ ‏.‏",
      "text_en": " This hadith has also been narrated on the authority of Abu Huraira.",
      "chain": [
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4653",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا ابن المبارك، عن معمر، ح وحدثنا محمد، بن رافع - واللفظ له - حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ غزا نبي من الأنبياء فقال لقومه لا يتبعني رجل قد ملك بضع امرأة وهو يريد أن يبني بها ولما يبن ولا آخر قد بنى بنيانا ولما يرفع سقفها ولا آخر قد اشترى غنما أو خلفات وهو منتظر ولادها ‏.‏ قال فغزا فأدنى للقرية حين صلاة العصر أو قريبا من ذلك فقال للشمس أنت مأمورة وأنا مأمور اللهم احبسها على شيئا ‏.‏ فحبست عليه حتى فتح الله عليه - قال - فجمعوا ما غنموا فأقبلت النار لتأكله فأبت أن تطعمه فقال فيكم غلول فليبايعني من كل قبيلة رجل ‏.‏ فبايعوه فلصقت يد رجل بيده فقال فيكم الغلول فلتبايعني قبيلتك ‏.‏ فبايعته - قال - فلصقت بيد رجلين أو ثلاثة فقال فيكم الغلول أنتم غللتم - قال - فأخرجوا له مثل رأس بقرة من ذهب - قال - فوضعوه في المال وهو بالصعيد فأقبلت النار فأكلته ‏.‏ فلم تحل الغنائم لأحد من قبلنا ذلك بأن الله تبارك وتعالى رأى ضعفنا وعجزنا فطيبها لنا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      One of the Prophets made a holy war. He said to his followers: One who has married a woman and wants to consummate to his marriage but has not yet done so; another who has built a house but has not yet erected its roof; and another who has bought goats and pregnantshe-camels and is waiting for their offspring-will not accommpany me. So he marched on and approached a village at or about the time of the Asr prayers. He said to the sun: Thou art subserviant (to Allah) and so am I. O Allah, stop it for me a little. It was stopped for him until Allah granted him victory. The people gathered the spoils of war (at one place). A fire approached the spoils to devour them, but it did not devour them. He (the Holy Prophet) said: Some of you have been guilty of misappropriation. So one man from each tribe should swear fealty to me. The did so (putting their hands into his). The hand of one man stuck to his hand and the Prophet (may peace be upon him) said: Your tribe is guilty of misappropriation. Let all the members of your tribe swear fealty to me one by one. They did so, when the hands of two or three persons got stuck with his hand. He said: You have misappropriated. So they took out gold equal in volume to the head of a cow. They-placed it among the spoils on the earth. Then the fire approached the spoils and devoured them. The spoils of war were not made lawful for any people before us, This is because Allah saw our weakness and humility and made them lawful for us.",
      "chain": [
        "30216",
        "20025",
        "20115",
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن رافع، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما قرية أتيتموها وأقمتم فيها فسهمكم فيها وأيما قرية عصت الله ورسوله فإن خمسها لله ولرسوله ثم هي لكم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      If you come to a township (which has surrendered without a formal war) and stay therein, you have a share (that will be in the form of an award) in (the properties obtained from) it. If a township disobeys Allah and His Messenger (and actually fights against the Muslims) one-fifth of the booty seized therefrom is for Allah and His Apostle and the rest is for you.",
      "chain": [
        "30007",
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4749",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ اشتد غضب الله على قوم فعلوا هذا برسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ وهو حينئذ يشير إلى رباعيته وقال رسول الله صلى الله عليه وسلم ‏\"‏ اشتد غضب الله على رجل يقتله رسول الله في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Hammam b. Munabbih who said:                      This is what has been related to us by Abu Huraira from the Messenger of Allah (may peace be upon him). (With this introduction) he narrated a number of traditions. One of these was that the Messenger of Allah (may peace be upon him) said: Great is the wrath of Allah upon a people who have done this to the Messenger of Allah (may peace be upon him), and he was at that time pointing to his front teeth. The Messenger of Allah (may peace be upon him) also said: Great is the wrath of Allah upon a person who has been killed by the Messenger of Allah (may peace be upon him) in the way of Allah, the Exalted and Glorious.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4805",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ الناس تبع لقريش في هذا الشأن مسلمهم تبع لمسلمهم وكافرهم تبع لكافرهم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hammam b. Munabbih who said:                      This is one of the traditions narrated by Abu Huraira from the Messenger of Allah (may peace be upon him) who said: People are subservient to the Quraish: the Muslims among them being subservient to the Muslims among them, and the disbelievers among them being subservient to the disbelievers among them.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4858",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديثهم ‏.‏",
      "text_en": " Hammam b. Munabbih has transmitted this hadith on the authority of Abu Huraira.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4971",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ كل كلم يكلمه المسلم في سبيل الله ثم تكون يوم القيامة كهيئتها إذا طعنت تفجر دما اللون لون دم والعرف عرف المسك ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفس محمد في يده لولا أن أشق على المؤمنين ما قعدت خلف سرية تغزو في سبيل الله ولكن لا أجد سعة فأحملهم ولا يجدون سعة فيتبعوني ولا تطيب أنفسهم أن يقعدوا بعدي ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Haraira that the Messenger of Allah (may peace be upon him) said:                      Every wound received by a Muslim in the way of Allah will appear on the Day of Judgment in the same condition as it was when it was inflicted, and would be bleeding profusely. The colour (of its discharge) will be the colour of blood, but its smell will be the smell of musk. By the Being in Whose Hand is Muhammad's life, if it were not hard upon the Muslims, I would not lag behind any expedition undertaken for Jihad, but I do not possess abundant means to provide the Mujahids with riding animals, nor do they (i. e. all of them) have abundant means (to provide themselves with all the means of Jihad) to follow me, nor would it please their hearts to stay behind me.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5002",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ يضحك الله لرجلين يقتل أحدهما الآخر كلاهما يدخل الجنة ‏\"‏ قالوا كيف يا رسول الله قال ‏\"‏ يقتل هذا فيلج الجنة ثم يتوب الله على الآخر فيهديه إلى الإسلام ثم يجاهد في سبيل الله فيستشهد ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      God laughs at the two men one of whom kills the other; both of them will enter Paradise. They (the Companions) said: How, Messenger of Allah? He said: One is slain (in the way of Allah) and enters Paradise. Then God forgives the other and guides him to Islam; then he fights in the way of Allah and dies a martyr.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن أنس، أن النبي صلى الله عليه وسلم زجر عن الشرب قائما ‏.‏",
      "text_en": " Anas reported Allah's Apostle (may peace be upon him) disapproved the drinking of water while standing.",
      "chain": [
        "11447",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5589",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قالهذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقالرسول الله صلى الله عليه وسلم ‏\"‏ بينما رجل يتبختر في بردين ‏\"‏ ‏.‏ ثم ذكر بمثله ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira but with a slight variation of wording:                      While there was a man who strutted in his two mantles.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5735",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ أغيظ رجل على الله يوم القيامة وأخبثه وأغيظه عليه رجل كان يسمى ملك الأملاك لا ملك إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) so many ahadith and one of them was this that Allah's Messenger (may peace be upon him) said:                      The most wretched person in the sight of Allah on the Day of Resurrection and the worst person and target of His wrath would of the person who is called Malik al-Amlak (the King of Kings) for there is no king but Allah.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5830",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported so many abidith from Allah's Messenger (may peace be upon him) and he reported Allah's Messenger (may peace be upon him) as saying:                      The influence of an evil eye is a fact.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5988",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ نزل نبي من الأنبياء تحت شجرة فلدغته نملة فأمر بجهازه فأخرج من تحتها وأمر بها فأحرقت في النار - قال - فأوحى الله إليه فهلا نملة واحدة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported so many ahadith and one of them was this that Allah' Messenger (may peace be upon him) said:                      When an Apostle from amongst the Apostles of Allah came to sit under a tree an ant bit him. He commanded his luggage to be removed from under the tree and he commanded it to be burnt in the fire and Allah revealed to him:\" Why one ant (which had bitten you) was not killed (and why did you burn the others)?",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "5995",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم نحو حديثهم ‏.‏",
      "text_en": " Hammam b. Manabbih reported this hadith on the authority of Abu Huraira.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6008",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "وحدثنا ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقولن أحدكم للعنب الكرم ‏.‏ إنما الكرم الرجل المسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) various ahadith, one of which is this that he said:                      None of you should use the word al-karm for 'Inab, for karm (worthy of respect) is a Muslim person.",
      "chain": [
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6014",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقل أحدكم اسق ربك أطعم ربك وضئ ربك ‏.‏ ولا يقل أحدكم ربي ‏.‏ وليقل سيدي مولاى ولا يقل أحدكم عبدي أمتي ‏.‏ وليقل فتاى فتاتي غلامي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) so many ahadith and one of them is this that Allah's Messenaer (may peace be upon him) said:                      None of you should say: Supply drink to your lord, feed your lord, hell) your lord in performing ablution, and none of you should say: My Lord. He should say: My chief, my patron; and none of you should say: My bondman, my slave-girl, but simply say: My boy, my girl, my servant.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6052",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث عبد الله بن يحيى بن أبي كثير عن أبيه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huiaira through another chain of transmitters.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6075",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم أتيت خزائن الأرض فوضع في يدى أسوارين من ذهب فكبرا على وأهماني فأوحي إلى أن انفخهما فنفختهما فذهبا فأولتهما الكذابين اللذين أنا بينهما صاحب صنعاء وصاحب اليمامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      While I was sleeping, the treasures of the earth were presented to me and I was made to wear in my hands two gold bangles. I felt a sort of burden upon me and I was disturbed and it was suggested to me that I should blow over them, so I blew and both of them disappeared. I interpreted them as two great liars who would appear at any time, one is the inhabitant of Sana' and the other is that of Yamama.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6097",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ مثلي كمثل رجل استوقد نارا فلما أضاءت ما حولها جعل الفراش وهذه الدواب التي في النار يقعن فيها وجعل يحجزهن ويغلبنه فيتقحمن فيها قال فذلكم مثلي ومثلكم أنا آخذ بحجزكم عن النار هلم عن النار هلم عن النار فتغلبوني تقحمون فيها ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      Abu Huraira reported us some ahadith from Allah's Messenger (may peace be upon him) amongst many, (and) one is this that Allah's Messenger (may peace be upon him) said: A person lit fire and when the atmosphere was aglow, moths and insects began to fall into the fire, but I am there to hold them back, but they are plunging into it despite my efforts, and he further added: That is your example and mine. I am there to hold you back from fire and to save you from it, but you are plunging into it despite my efforts.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6100",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال أبو القاسم صلى الله عليه وسلم ‏\"‏ مثلي ومثل الأنبياء من قبلي كمثل رجل ابتنى بيوتا فأحسنها وأجملها وأكملها إلا موضع لبنة من زاوية من زواياها فجعل الناس يطوفون ويعجبهم البنيان فيقولون ألا وضعت ها هنا لبنة فيتم بنيانك ‏\"‏ ‏.‏ فقال محمد صلى الله عليه وسلم ‏\"‏ فكنت أنا اللبنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of mine and that of the Apostles before me is that of a person who built a house quite imposing and beautiful and he made it complete but for one brick in one of its corners. People began to walk round it, and the building pleased them and they would say: But for this brick your building would have been perfect. Muhammad (may peace be upon him) said: And I am that final brick.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6264",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن  أبي هريرة، كلهم قال عن النبي صلى الله عليه وسلم ‏\"‏ ذروني ما تركتكم ‏\"‏ ‏.‏ وفي حديث همام ‏\"‏ ما تركتم فإنما هلك من كان قبلكم ‏\"‏ ‏.‏ ثم ذكروا نحو حديث الزهري عن سعيد وأبي سلمة عن أبي هريرة ‏.‏",
      "text_en": " This hadith has been narrated by Abu Huraira through a different chain of transmitters (and the words are) that he reported Allah's Messenger (may peace be upon him) having said:                      Abandon that which I have asked you to abandon, for the people before you went to their doom (for asking too many questions).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6278",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفس محمد في يده ليأتين على أحدكم يوم ولا يراني ثم لأن يراني أحب إليه من أهله وماله معهم ‏\"‏ ‏.‏ قال أبو إسحاق المعنى فيه عندي لأن يراني معهم أحب إليه من أهله وماله وهو عندي مقدم ومؤخر ‏.‏",
      "text_en": " Abu Huraira reported so many 'ahadith from Allah's Messenger (may peace be upon him) and one among them was that Allah's Messenger (may peace be upon him) is reported to have said:                      By Him in Whose Hand is the life of Muhammad, a day would come to you when you would not be able to see me, and the glimpse of my face would be dearer to one than one's own family, one's property and in fact everything. This hadith has been transmitted on the authority of Ishaq with a slight variation of wording.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6281",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى الناس بعيسى ابن مريم في الأولى والآخرة ‏\"‏ ‏.‏ قالوا كيف يا رسول الله قال ‏\"‏ الأنبياء إخوة من علات وأمهاتهم شتى ودينهم واحد فليس بيننا نبي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported many ahadith from Allah's Messenger (may peace be upon him) and one is that Allah's Messenger (may peace be upon him) said:                      I am most close to Jesus, son of Mary, among the whole of mankind in this worldly life and the next life. They said: Allah's Messenger how is it? Thereupon he said: Prophets are brothers in faith, having different mothers. Their religion is, however, one and there is no Apostle between us (between I and Jesus Christ).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6286",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ رأى عيسى ابن مريم رجلا يسرق فقال له عيسى سرقت قال كلا والذي لا إله إلا هو ‏.‏ فقال عيسى آمنت بالله وكذبت نفسي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported ahadith from the Messenger of Allah (may peace be upon him) (and one of them was) that Allah's Messenger (may peace be upon him) said Jesus son of Mary saw a person committing theft; thereupon Jesus said to him:                      You committed theft. He said: Nay. By Him besides Whom there is no god (I have not committed theft). Thereupon Jesus said: I affirm my faith in Allah It is my ownself that deceived me.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6295",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ كانت بنو إسرائيل يغتسلون عراة ينظر بعضهم إلى سوأة بعض وكان موسى عليه السلام يغتسل وحده فقالوا والله ما يمنع موسى أن يغتسل معنا إلا أنه آدر ‏.‏ قال فذهب مرة يغتسل فوضع ثوبه على حجر ففر الحجر بثوبه - قال - فجمح موسى بأثره يقول ثوبي حجر ثوبي حجر ‏.‏ حتى نظرت بنو إسرائيل إلى سوأة موسى فقالوا والله ما بموسى من بأس ‏.‏ فقام الحجر بعد حتى نظر إليه - قال - فأخذ ثوبه فطفق بالحجر ضربا ‏\"‏ ‏.‏ قال أبو هريرة والله إنه بالحجر ندب ستة أو سبعة ضرب موسى عليه السلام بالحجر ‏.‏",
      "text_en": " Hammam b. Munabbih reported that Abu Huraira reported many ahadith from Allah's Messenger (may peace be upon him) and one, of them speaks that Allah's Messenger (may peace be upon him) is reported to have said:                      Banu Isra'il used to take bath (together) naked and thus saw private parts of one another, but Moses (peace be upon him) used to take bath alone (in privacy), and they said: By Allah, nothing prevents Moses to take bath along with us; but scrotal hernia. One day when he (Moses) was taking bath (alone) he placed his clothes upon a stone, but the stone began to move along with his clothes. Moses raced after it saying: My garment, stone; until (some of the people) of Banu Isra'il looked at the private parts of Moses, and they said: By Allah, there is no trouble with Moses. The stone stopped after he (Moses) had been seen. He took hold of his garments and struck the stone. Abu Huraira said: I swear by Allah that there were six or seven scars on the stone because of the striking of stone by Moses (peace be upon him).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6298",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ جاء ملك الموت إلى موسى عليه السلام فقال له أجب ربك - قال - فلطم موسى عليه السلام عين ملك الموت ففقأها - قال - فرجع الملك إلى الله تعالى فقال إنك أرسلتني إلى عبد لك لا يريد الموت وقد فقأ عيني - قال - فرد الله إليه عينه وقال ارجع إلى عبدي فقل الحياة تريد فإن كنت تريد الحياة فضع يدك على متن ثور فما توارت يدك من شعرة فإنك تعيش بها سنة قال ثم مه قال ثم تموت ‏.‏ قال فالآن من قريب رب أمتني من الأرض المقدسة رمية بحجر ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ والله لو أني عنده لأريتكم قبره إلى جانب الطريق عند الكثيب الأحمر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) having said that the Angel of Death came to Moses and said:                      Respond (to the call) of Allah (i. e. be prepared for death). Moses (peace be upon him) gave a blow at the eye of the Angel of Death and knocked it out. The Angel went back to Allah (the Exalted) and said: You sent me to your servant who does not like to die and he knocked out my eye. Allah restored his eye to its proper place (and revived his eyesight) and said: Go to My servant and say: Do you want life? And in case you want life, keep your hand on the body of the ox and you would live such number of years as the (number of) hair your hand covers. He (Moses) said: What, then? He said: Then you would die, whereupon he (Moses) said: Then why not now? (He then prayed): Allah, cause me to die close to the sacred land. Allah's Messenger (may peace be upon him) said: Had I been near that place I would have shown his grave by the side of the path at the red mound. This hadith has been transmitted on the authority of Ma'mar.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6623",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير نساء ركبن الإبل صالح نساء قريش أحناه على ولد في صغره وأرعاه على زوج في ذات يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The best women who ride the camels are the pious women of the Quraish; they treat with affection children in their childhood and keep a strict watch on the wealth of their spouses.",
      "chain": [
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6834",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يشير أحدكم إلى أخيه بالسلاح فإنه لا يدري أحدكم لعل الشيطان ينزع في يده فيقع في حفرة من النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported a hadith from Allah's Messenger (may peace be upon him) ; (one of them was this) that Allah's Messenger (may peace be upon him) said:                      None amongst you should point a weapon towards his brother, for he does not know that Satan might cause the weapon (to slip) from his hand and (he may injure anyone) and thus he may fall into Hell-Fire.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6845",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ دخلت امرأة النار من جراء هرة لها - أو هر - ربطتها فلا هي أطعمتها ولا هي أرسلتها ترمم من خشاش الأرض حتى ماتت هزلا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) A hadith out of which one was this that Allah's Messenger (may peace be upon him) said:                      A woman got into Hell-Fire because of a cat whom she had tied, and thus it could not eat, and she did not let it free so that it could devour the insects of the earth, until it died.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6917",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "وحدثنا ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي، هريرة عن النبي صلى الله عليه وسلم بمعنى حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
      "chain": [
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6931",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ من يولد يولد على هذه الفطرة فأبواه يهودانه وينصرانه كما تنتجون الإبل فهل تجدون فيها جدعاء حتى تكونوا أنتم تجدعونها ‏\"‏ ‏.‏ قالوا يا رسول الله أفرأيت من يموت صغيرا قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upom him) many ahadith and one amongst them is that he is reported to have said:                      An infant is born according to his (true) nature. It is his parents Who make him a Jew, a Christian, just as a she-camel gives birth to its young ones. Do you find any deficiency in their limbs? You cut their ears (i. e. after birth). They (the Companions of the Holy Prophet) said: What is your opinion about him who dies in infancy? Thereupon Allah's Apostle (may peace be upon him) said: It is Allah alone Who knows best what they would be doing.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6969",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن  أبي هريرة، ح",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "6983",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله قال إذا تلقاني عبدي بشبر تلقيته بذراع وإذا تلقاني بذراع تلقيته بباع وإذا تلقاني بباع أتيته بأسرع ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported so many ahadith from Abu Huraira and one out of them is this that Allah's Messenger (may peace be upon him) said that Allah thus stated:                      When My servant draws close to me by the span of a palm, I draw close to him by the space of a cubit, and when he draws close to Me by the space of a cubit, I draw close to him by the space (covered) by two hands, and when he draws close to Me by the space (covered by) two hands, I go in hurry towards him.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6986",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن أيوب، عن ابن سيرين، عن أبي هريرة، وعن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن لله تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة ‏\"‏ ‏.‏ وزاد همام عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إنه وتر يحب الوتر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      Verily, there are ninety-nine names for Allah, i. e. hundred excepting one. He who enumerates them would get into Paradise. And Hammam has made this addition on the authority of Abu Huraira who reported it from Allah's Apostle (may peace be upon him) that he said:\" He is Odd (one) and loves odd number.\"",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11015",
        "11035",
        "13",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6995",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يتمنى أحدكم الموت ولا يدع به من قبل أن يأتيه إنه إذا مات أحدكم انقطع عمله وإنه لا يزيد المؤمن عمره إلا خيرا ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      Abu Huraira narrated to us ahadith from Allah's Messenger (may peace be upon him) and out of these one is that Allah's Messenger (may peace be upon him) said: None amongst you should make a request for death, and do not call for it before it comes, for when any one of you dies, he ceases (to do good) deeds and the life of a believer is not prolonged but for goodness.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7130",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7330",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ أول زمرة تلج الجنة صورهم على صورة القمر ليلة البدر لا يبصقون فيها ولا يمتخطون ولا يتغوطون فيها آنيتهم وأمشاطهم من الذهب والفضة ومجامرهم من الألوة ورشحهم المسك ولكل واحد منهم زوجتان يرى مخ ساقهما من وراء اللحم من الحسن لا اختلاف بينهم ولا تباغض قلوبهم قلب واحد يسبحون الله بكرة وعشيا ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      These are some of the ahidith which Abu Huraira reported from Allah's Messenger (may peace be upon him) and one is this that he is reported to have said: The (members of the) first group that would be admitted to Paradise would have their faces as bright as full moon during the night. They would neither spit nor suffer catarrh, nor void excrement. They would have their utensils and their combs made of gold and silver and the fuel of their braziers would be aloes and their sweat would be musk and every one of them would have two spouses (so beautiful) that the marrow of their shanks would be visible through the flesh. There would be no dissension amongst them and no enmity in their hearts. Their hearts would be like one heart, glorifying Allah morning and evening.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7342",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ خلق الله عز وجل آدم على صورته طوله ستون ذراعا فلما خلقه قال اذهب فسلم على أولئك النفر وهم نفر من الملائكة جلوس فاستمع ما يجيبونك فإنها تحيتك وتحية ذريتك قال فذهب فقال السلام عليكم فقالوا السلام عليك ورحمة الله - قال - فزادوه ورحمة الله - قال - فكل من يدخل الجنة على صورة آدم وطوله ستون ذراعا فلم يزل الخلق ينقص بعده حتى الآن ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and Glorious, created Adam in His own image with His length of sixty cubits, and as He created him He told him to greet that group, and that was a party of angels sitting there, and listen to the response that they give him, for it would form his greeting and that of his offspring. He then went away and said: Peace be upon you! They (the angels) said: May there be peace upon you and the Mercy of Allah, and they made an addition of\" Mercy of Allah\". So he who would get into Paradise would get in the form of Adarn, his length being sixty cubits, then the people who followed him continued to diminish in size up to this day.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "7345",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي الزناد غير أنه قال ‏\"‏ كلهن مثل حرها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abn Huraira through another chain of transmitters with a slight variation of wording.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7354",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ تحاجت الجنة والنار فقالت النار أوثرت بالمتكبرين والمتجبرين ‏.‏ وقالت الجنة فما لي لا يدخلني إلا ضعفاء الناس وسقطهم وغرتهم قال الله للجنة إنما أنت رحمتي أرحم بك من أشاء من عبادي ‏.‏ وقال للنار إنما أنت عذابي أعذب بك من أشاء من عبادي ‏.‏ ولكل واحدة منكما ملؤها فأما النار فلا تمتلئ حتى يضع الله تبارك وتعالى رجله تقول قط قط قط ‏.‏ فهنالك تمتلئ ويزوى بعضها إلى بعض ولا يظلم الله من خلقه أحدا وأما الجنة فإن الله ينشئ لها خلقا ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported that Abu Huraira narrated to them some ahadith of Allah's Messenger (may peace be upon him) and one of them is this that Allah's Messenger (may peace be upon him) said:                      The Paradise and the Hell fell into dispute and the Hell said: 1 have been distinguished for accommodating (the haughty and proud in me), and the Paradise said: What is the matter that the meek and the humble and the downtrodden and simple would find an abode in me? Thereupon Allah said to Paradise: You are a (means) of My Mercy. 1 shall show mercy through you to one whom I will from amongst My servants. And lie said to the Hell: You are a (sign) of My chastisement and I shall chastise through you anyone whom I will from amongst My servants and both of you, would be full. And as regards the Hell it would not be full until Allah, the Exalted and Glorious, places His foot therein, and it would say: Enough, enough, enough, and it would be then full and the one part would draw very close to the other one and Allah would not treat unjustly anyone amongst His creation and He would create another creation for the Paradise (to accommodate it).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7438",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تقتتل فئتان عظيمتان وتكون بينهما مقتلة عظيمة ودعواهما واحدة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) many ahadith and one of them was this:                      The last Hour will not come until the two parties (of Muslims) confront each other and there is a large-scale massacre amongst them and the claim of both of them is the same.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7513",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ هلك كسرى ثم لا يكون كسرى بعده وقيصر ليهلكن ثم لا يكون قيصر بعده ولتقسمن كنوزهما في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira reported from Allah's messenger (may peace be upon him) and in this connection he reported so many hadith (and one of them was this): Allah's Messenger (may peace be upon him) said: Kisra would die and then there would be no Kisra after him. Qaisar would die and there would be no Qaisar after him, but you will distribute their threasuers in thecause of Allah.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7527",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال ينبعث ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7605",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن في الإنسان عظما لا تأكله الأرض أبدا فيه يركب يوم القيامة ‏\"‏ ‏.‏ قالوا أى عظم هو يا رسول الله قال ‏\"‏ عجب الذنب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported so many ahadith from Allah's Apostle (may peace be upon him) and amongst these one was this that Allah's Messenger (may peace be upon him) said:                      There is a bone in the human being which the earth would never consume and it is from this that new bodies would be reconstituted (on the Day of Resurrection). They said: Allah's Messenger, which bone is that? Thereupon he said: It is the spinal bone.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7618",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي الزناد سواء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "7699",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا عبد الرحمن، عن سفيان، عن  منصور، ح وحدثنا عثمان بن أبي شيبة، حدثنا الأشجعي، عبيد الله بن عبيد الرحمن عن  سفيان الثوري، عن الأعمش، ومنصور، عن إبراهيم، عن همام، عن المقداد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Miqdad through another chain of transmitters.",
      "chain": [
        "30170",
        "30160",
        "20033",
        "20012",
        "11067",
        "30203",
        "20012",
        "11060",
        "11067",
        "11051",
        "11447",
        "163"
      ]
    },
    {
      "hadith_no": "7708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ قيل لبني إسرائيل ‏{‏ ادخلوا الباب سجدا وقولوا حطة يغفر لكم خطاياكم‏}‏ فبدلوا فدخلوا الباب يزحفون على أستاههم وقالوا حبة في شعرة\"‏ ‏.‏",
      "text_en": " Hammim b. Munabbih reported:                      This is what Abu Huraira reported to us from Allah's Messenger (may peace be upon him) and in this connection he narrated some of the ahadith and Allah's Messenger (may peace be upon him) said: It was said to people of Israel: Enter this land saying Hitta (Remove Thou from us the burden of our sins), whereupon We would forgive you your sins, but they twisted (this statement) and entered the gate dragging upon their breech and said: The\" grain in the ear.\"",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "60",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقبل الله صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) said : Allaah, the Exalted, does not accept the prayer of any of you when you are defiled until you performed ablution.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سنان، وأحمد بن الفرات أبو مسعود الرازي، - المعنى - قالا حدثنا يعلى، حدثنا الأعمش، عن إبراهيم، عن همام، أن حذيفة أم الناس، بالمدائن على دكان فأخذ أبو مسعود بقميصه فجبذه فلما فرغ من صلاته قال ألم تعلم أنهم كانوا ينهون عن ذلك قال بلى قد ذكرت حين مددتني ‏.‏",
      "text_en": " Hammam said:                      Hudhaifah led the people in prayer in al-Mada’in standing on the shop(or a bench). Abu Mas’ud took him by his shirt, and brought him down. When he( Abu Mas’ud) finished his prayer, he said: Do you not know that they(the people) were prohibited to do so. He said: Yes, I remembered when you pulled me down.",
      "chain": [
        "30297",
        "20372",
        "11060",
        "11051",
        "11447"
      ]
    },
    {
      "hadith_no": "799",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يزيد بن هارون، أخبرنا همام، وأبان بن يزيد العطار، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، ببعض هذا وزاد في الأخريين بفاتحة الكتاب ‏.‏ وزاد عن همام قال وكان يطول في الركعة الأولى ما لا يطول في الثانية وهكذا في صلاة العصر وهكذا في صلاة الغداة ‏.‏",
      "text_en": " The above mentioned tradition as been reported by Abu Qatadah through a different chain of narrators. This version adds:                      He would recite Fatihat al-kitab in the last two surahs. Hammam added: He would prolong the first rak’ah but would not prolong the second so much; and he did so similarly in the afternoon prayer, and so in the morning prayer.",
      "chain": [
        "30115",
        "20472",
        "20297",
        "20205",
        "11449",
        "11804",
        "11447"
      ]
    },
    {
      "hadith_no": "1311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم من الليل فاستعجم القرآن على لسانه فلم يدر ما يقول فليضطجع ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) as saying: When one of you gets up by night (to pray), and falters in reciting the Qur'an (due to sleep), and he does not understand what he utters, he should sleep.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "1620",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا علي بن الحسن الدرابجردي، حدثنا عبد الله بن يزيد، حدثنا همام، حدثنا بكر، - هو ابن وائل - عن الزهري، عن ثعلبة بن عبد الله، أو قال عبد الله بن ثعلبة عن النبي صلى الله عليه وسلم ح وحدثنا محمد بن يحيى النيسابوري، حدثنا موسى بن إسماعيل، حدثنا همام، عن بكر الكوفي، قال محمد بن يحيى هو بكر بن وائل بن داود أن الزهري، حدثهم عن عبد الله بن ثعلبة بن صعير، عن أبيه، قال قام رسول الله صلى الله عليه وسلم خطيبا فأمر بصدقة الفطر صاع تمر أو صاع شعير عن كل رأس زاد علي في حديثه أو صاع بر أو قمح بين اثنين - ثم اتفقا - عن الصغير والكبير والحر والعبد ‏.‏",
      "text_en": " 'Abd Allah bin Tha'labah ibn Su'ayr reported on the authority of his father:                      The Messenger of Allah (ﷺ) stood and gave a sermon; he commanded to give sadaqah, at the end of Ramadan when the fasting is closed, one sa' of dried dates or of barley payable by every person. The narrator Ali added in his version: \"or one sa' of wheat to be taken from every two.\" Both the chains of narrators are then agreed upon the version: \"payable by young and old, freeman and slave.\"",
      "chain": [
        "1945",
        "11447",
        "20579",
        "11013"
      ]
    },
    {
      "hadith_no": "1687",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أنفقت المرأة من كسب زوجها من غير أمره فلها نصف أجره ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported The Messenger of Allah (ﷺ) as saying When a woman gives something her husband has earned without being commanded by him to do so, she has half his reward.",
      "chain": [
        "30115",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، ح وحدثنا محمد بن كثير، أخبرنا همام، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - المعنى - عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيما امرأة زوجها وليان فهي للأول منهما وأيما رجل باع بيعا من رجلين فهو للأول منهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) said: Any woman who is married by two guardians (to two different men) belongs to the first woman who is married by two guardians (to two different men) belongs to the first of them and anything sold by a man to two persons belongs to the first of them.",
      "chain": [
        "20285",
        "20295",
        "28531",
        "11447",
        "20040",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2458",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصوم المرأة وبعلها شاهد إلا بإذنه غير رمضان ولا تأذن في بيته وهو شاهد إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      It is not allowable for a woman to keep (voluntary) fast when her husband is present without his permission, and she may not allow anyone to enter his house without his permission.",
      "chain": [
        "30115",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2657",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا عبد الرحمن، عن همام، حدثني مطر، عن قتادة، عن أبي بردة، عن أبيه، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Abu Bardah on the authority of his father from the Prophet (ﷺ).",
      "chain": [
        "11201",
        "10530",
        "11447",
        "11019",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2847",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا جرير، عن منصور، عن إبراهيم، عن همام، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم قلت إني أرسل الكلاب المعلمة فتمسك على أفآكل قال ‏\"‏ إذا أرسلت الكلاب المعلمة وذكرت اسم الله فكل مما أمسكن عليك ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ما لم يشركها كلب ليس منها ‏\"‏ ‏.‏ قلت أرمي بالمعراض فأصيب أفآكل قال ‏\"‏ إذا رميت بالمعراض وذكرت اسم الله فأصاب فخزق فكل وإن أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abi b. Hatim:                     I asked the Prophet (ﷺ) ,and said: I set off my trained dogs, and they catch (something) for me: may I eat (it)? He said: When you set off trained dogs and mention Allah's name, eat what they catch for you. I said: Even if they killed (the game)? He said: Even if they killed (the game) as long as another dog does not join it. I said: I shoot with a featherless arrow, and it strikes the target, may I eat (it) ? He said: If you shoot with a featherless arrow and mention Allah's name, and it strikes the aim, and pierce it, eat it ; and if it strikes with its middle, do not eat (it).",
      "chain": [
        "31167",
        "20028",
        "11067",
        "11051",
        "11447",
        "212"
      ]
    },
    {
      "hadith_no": "2949",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أوتيكم من شىء وما أمنعكموه إن أنا إلا خازن أضع حيث أمرت ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not on my own that I give you or withhold from you: I am just a treasure, putting it where I have been commanded.",
      "chain": [
        "30417",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "3036",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، عن رسول الله صلى الله عليه وسلم وقال رسول الله صلى الله عليه وسلم ‏\"‏ أيما قرية أتيتموها وأقمتم فيها فسهمكم فيها وأيما قرية عصت الله ورسوله فإن خمسها لله وللرسول ثم هي لكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “Whatever town you come to and stay in , your portion is in it, but whatever town disobeys Allaah and His Apostle a fifth of it goes to Allaah and His Apostle and what remains is yours.”",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن حنبل، وسلمة بن شبيب، قالا حدثنا عبد الرزاق، - قال أحمد قال - حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كره الاثنان اليمين أو استحباها فليستهما عليها ‏\"‏ ‏.‏ قال سلمة قال أخبرنا معمر وقال إذا أكره الاثنان على اليمين ‏.‏",
      "text_en": " Abu hurairah reported the holy prophet (peace be upon him) as saying:                      When two men dislike the oath or like it,lots will be cost about it. Salamah said on the authority of Ma’mar who said: when the two are compelled to take an oath.",
      "chain": [
        "30007",
        "30417",
        "20121",
        "30007",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3879",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying :                      The evil is genuine.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3933",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا همام، ح وحدثنا محمد بن كثير، - المعنى - أخبرنا همام، عن قتادة، عن أبي المليح، - قال أبو الوليد - عن أبيه، أن رجلا، أعتق شقصا له من غلام فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ ليس لله شريك ‏\"‏ ‏.‏ زاد ابن كثير في حديثه فأجاز النبي صلى الله عليه وسلم عتقه ‏.‏",
      "text_en": " Narrated Abu al-Malih:                     On his father's authority (this is AbulWalid's version): A man emancipated a share in a slave and the matter was mentioned to the Prophet (ﷺ). He said: Allah has no partner. Ibn Kathir added in his version: The Prophet (ﷺ) allowed his emancipation.",
      "chain": [
        "20296",
        "20297",
        "28531",
        "11447",
        "11019",
        "11453",
        "20296"
      ]
    },
    {
      "hadith_no": "4594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، ح وحدثنا جعفر بن مسافر التنيسي، حدثنا زيد بن المبارك، حدثنا عبد الملك الصنعاني، كلاهما عن معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ النار جبار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: No recompense may be demanded if the fire spreads.",
      "chain": [
        "38581",
        "20121",
        "38132",
        "38224",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4804",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن منصور، عن إبراهيم، عن همام، قال جاء رجل فأثنى على عثمان في وجهه فأخذ المقداد بن الأسود ترابا فحثا في وجهه وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا لقيتم المداحين فاحثوا في وجوههم التراب ‏\"‏ ‏.‏",
      "text_en": " HAMMAM SAID :                      A MAN CAME AND PRAISED ‘UTHMAN IN HIS FACE,AL-MIQDAD B. AL-ASWAD TOOK DUST AND THREW IT ON HIS FACE, SAYING : THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) SAID : WHEN YOU SEE THOSE WHO ARE GIVEN TO PRAISING PEOPLE, THROW DUST IN THEIR FACES.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11067",
        "11051",
        "11447"
      ]
    },
    {
      "hadith_no": "4871",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وأبو بكر بن أبي شيبة قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن همام، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah reported the Messenger of Allah (May peace be upon him) as saying :                      A mischief-maker will not enter paradise.",
      "chain": [
        "30175",
        "30201",
        "20354",
        "11060",
        "11051",
        "11447",
        "145"
      ]
    },
    {
      "hadith_no": "5132",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن وهب بن منبه، عن أخيه، عن معاوية، اشفعوا تؤجروا فإني لأريد الأمر فأؤخره كيما تشفعوا فتؤجروا فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ اشفعوا تؤجروا ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     Make intercession, you will be rewarded, for I purposely delay a matter so that you intercede and then you are rewarded. The Messenger of Allah (ﷺ) said: If you make intercession, you will be rewarded.",
      "chain": [
        "30226",
        "30485",
        "20005",
        "11081",
        "11102",
        "11447"
      ]
    },
    {
      "hadith_no": "5198",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الصغير على الكبير والمار على القاعد والقليل على الكثير ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      The young should salute the old, the one who is passing by should salute the one who is sitting, and a small company should salute a large one.",
      "chain": [
        "30007",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "68",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، عن معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يبولن أحدكم في الماء الدائم ثم يتوضأ منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن جابر ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Let none of you urinate [in still water, then perform Wudu with it.\"1",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله لا يقبل صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Indeed Allah does not accept the prayer of one of you when he commits Hadath, until he performs Wudu.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال أحدكم في صلاة ما دام ينتظرها ولا تزال الملائكة تصلي على أحدكم ما دام في المسجد اللهم اغفر له اللهم ارحمه ما لم يحدث ‏\"‏ ‏.‏ فقال رجل من حضرموت وما الحدث يا أبا هريرة قال فساء أو ضراط ‏.‏ قال وفي الباب عن علي وأبي سعيد وأنس وعبد الله بن مسعود وسهل بن سعد ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"One of you does not cease to be in Salat as long as he is waiting for it. And the angels do not cease praying for one of you as long as he remains in the Masjid (saying): 'Allah! Forgive him. O Allah! Have mercy upon him' - as long as he does not commit Hadath.\" A man from Hadramawt said: \"And just what is Hadath Abu Hurairah?\" He said: \"Breaking wind, or passing gas.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2218",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى ينبعث دجالون كذابون قريب من ثلاثين كلهم يزعم أنه رسول الله ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن جابر بن سمرة وابن عمر ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"The Hour shall not be established until nearly thirty imposters, Dajjal appear, each of them claiming that he is the Messenger of Allah.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2733",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول زمرة تلج الجنة صورتهم على صورة القمر ليلة البدر لا يبصقون فيها ولا يمتخطون ولا يتغوطون آنيتهم فيها الذهب وأمشاطهم من الذهب والفضة ومجامرهم من الألوة ورشحهم المسك ولكل واحد منهم زوجتان يرى مخ سوقهما من وراء اللحم من الحسن لا اختلاف بينهم ولا تباغض قلوبهم قلب رجل واحد يسبحون الله بكرة وعشيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ والألوة هو العود ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"The first batch to enter Paradise will appear like the moon of a night that it is full, they do not spit, nor do their noses run, nor do they defecate. Their vessels are of gold, their combs are of silver and gold, their perfume is of Aluwwah, and their sweat is musk. Each one of them has two wives, so beautiful that the marrow of their shins can be seen through the flesh. There is no differing among them nor mutual hatred, and their hearts are like the heart of one man, and they glorify Allah morning and evening.\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2792",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ناركم هذه التي يوقد بنو آدم جزء واحد من سبعين جزءا من حر جهنم ‏\"‏ ‏.‏ قالوا والله إن كانت لكافية يا رسول الله ‏.‏ قال ‏\"‏ فإنها فضلت بتسعة وستين جزءا كلهن مثل حرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهمام بن منبه هو أخو وهب بن منبه وقد روى عنه وهب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"This Fire of yours, which the sons  of Adam kindle, is one part from seventy parts of the heat of the Hell.\" They said: \"By Allah! Would it not have been enough O Messenger of Allah?!\" He said: \"It is sixty-nine parts more",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2668",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن وهب بن منبه، عن أخيه، وهو همام بن منبه قال سمعت أبا هريرة، يقول ليس أحد من أصحاب رسول الله صلى الله عليه وسلم أكثر حديثا عن رسول الله صلى الله عليه وسلم مني إلا عبد الله بن عمرو فإنه كان يكتب وكنت لا أكتب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ووهب بن منبه عن أخيه هو همام بن منبه ‏.‏",
      "text_en": " Narrated Hammam bin Munabbih:                     that the heard Abu Hurairah say: \"None of the Companions of the Messenger of Allah (ﷺ) narrated more Ahadith from him than me, except 'Abdullah bin 'Amr. For he used to write them down and I did not write.\"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11102",
        "11447",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد بن نصر، أنبأنا عبد الله بن المبارك، أنبأنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسلم الصغير على الكبير والمار على القاعد والقليل على الكثير ‏\"‏ ‏.‏ قال وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Hammam bin Munabbih:                     from Abu Hurairah that the Prophet (ﷺ) said: \"The young one gives the Salam to the elder, the one passing the by to the one sitting and the few to the many.\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2729",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد، أخبرنا عبد الله، أخبرنا همام، عن قتادة، قال قلت لأنس بن مالك هل كانت المصافحة في أصحاب رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Qatadah:                     that he asked Anas bin Malik: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake each other's hand?\" He said, \"Yes.\"",
      "chain": [
        "16",
        "11447",
        "11019"
      ]
    },
    {
      "hadith_no": "3013",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، حدثنا شعبة، وهمام، عن قتادة، عن عكرمة، عن ابن عباس، قال لعن رسول الله صلى الله عليه وسلم المتشبهات بالرجال من النساء والمتشبهين بالنساء من الرجال ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11447",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3214",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ادخلوا الباب سجدا ‏)‏ قال ‏\"‏ دخلوا متزحفين على أوراكهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said, regarding Allah's saying: Enter the gate in prostration (2:58): \"They entered dragging their behinds\" meaning they distorted it, and with this chain, from the Prophet (ﷺ): But those who did wrong changed the word from that which had been told to them for another (2:59) - \"They said: Habbah (a seed) in Sha'irah (in barely).\"",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3444",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما سمي الخضر لأنه جلس على فروة بيضاء فاهتزت تحته خضراء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"He was called Al-Khadir because he sat on a barren Farwah and it turned green beneath him.\"",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن وهب بن منبه، عن أخيه، همام بن منبه عن أبي هريرة، رضى الله عنه قال ليس أحد أكثر حديثا عن رسول الله صلى الله عليه وسلم مني إلا عبد الله بن عمرو فإنه كان يكتب وكنت لا أكتب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah [may Allah be pleased with him] :                     \"There is none with more Ahadith from the Messenger of Allah (ﷺ) than I, except for 'Abdullah bin 'Amr, for he used to write, (the Ahadith) and I did not used to write.\"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11102",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حفص، عن الأعمش، عن إبراهيم، عن همام، عن جرير بن عبد الله، أنه توضأ ومسح على خفيه فقيل له أتمسح فقال قد رأيت رسول الله صلى الله عليه وسلم يمسح ‏.‏ وكان أصحاب عبد الله يعجبهم قول جرير وكان إسلام جرير قبل موت النبي صلى الله عليه وسلم بيسير ‏.‏",
      "text_en": " It was narrated from Jarir bin 'Abdullah that he performed Wudu' and wiped over his Khuffs. it was said to him:                      \"Are you wiping (over you Khuffs)?\" He said: \"I saw the Messenger of Allah (ﷺ) wiping (over his Khuffs).\" The companions of 'Abdullah liked what Jarir said, because Jarir became Muslim shortly before the Prophet (ﷺ) died.[1][1]In the narration recorded by At-Tirmidhi Nos. 93,94) this comment is attributed to Ibrahim, one of the narrators.",
      "chain": [
        "30367",
        "20317",
        "11060",
        "11051",
        "11447",
        "4057"
      ]
    },
    {
      "hadith_no": "300",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الحسين بن حريث، أنبأنا سفيان، عن منصور، عن إبراهيم، عن همام، عن عائشة، قالت كنت أفركه من ثوب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I used to rub it off from the garment of the Messenger of Allah (ﷺ).\"",
      "chain": [
        "30325",
        "20005",
        "11067",
        "11051",
        "11447",
        "53"
      ]
    },
    {
      "hadith_no": "301",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا شعيب بن يوسف، عن يحيى بن سعيد، عن الأعمش، عن إبراهيم، عن همام، عن عائشة، قالت كنت أراه في ثوب رسول الله صلى الله عليه وسلم فأحكه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I used to see it on the garment of the Messenger of Allah (ﷺ) and scratch it off.\"",
      "chain": [
        "20031",
        "11060",
        "11051",
        "11447",
        "53"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏‏\"‏‏ لا يبولن الرجل في الماء الدائم ثم يغتسل منه أو يتوضأ ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"None of you should urinate into standing water and then perform Ghusl or Wudu' with it.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن سليمان، عن إبراهيم، عن همام، قال رأيت جريرا بال ثم دعا بماء فتوضأ ومسح على خفيه ثم قام فصلى فسئل عن ذلك فقال رأيت النبي صلى الله عليه وسلم صنع مثل هذا ‏.‏",
      "text_en": " It was narrated that Hammam said:                      \"I saw Jarir urinate, then he called for water and performed wudhu, and wiped over his Khuffs, then he stood up and prayed. He was asked about that and he said: 'I saw the Prophet(ﷺ) do exactly like this.'\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11060",
        "11051",
        "11447"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ أبو يحيى، بمكة - وهو بصري - قال حدثنا أبي قال، حدثنا همام، قال حدثنا إسحاق بن عبد الله بن أبي طلحة، أن علي بن يحيى بن خلاد بن مالك بن رافع بن مالك، حدثه عن أبيه، عن عمه، رفاعة بن رافع قال بينما رسول الله صلى الله عليه وسلم جالس ونحن حوله إذ دخل رجل فأتى القبلة فصلى فلما قضى صلاته جاء فسلم على رسول الله صلى الله عليه وسلم وعلى القوم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك اذهب فصل فإنك لم تصل ‏\"‏ ‏.‏ فذهب فصلى فجعل رسول الله صلى الله عليه وسلم يرمق صلاته ولا يدري ما يعيب منها فلما قضى صلاته جاء فسلم على رسول الله صلى الله عليه وسلم وعلى القوم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك اذهب فصل فإنك لم تصل ‏\"‏ ‏.‏ فأعادها مرتين أو ثلاثا فقال الرجل يا رسول الله ما عبت من صلاتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها لم تتم صلاة أحدكم حتى يسبغ الوضوء كما أمره الله عز وجل فيغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ثم يكبر الله عز وجل ويحمده ويمجده ‏\"‏ ‏.‏ قال همام وسمعته يقول ‏\"‏ ويحمد الله ويمجده ويكبره ‏\"‏ ‏.‏ قال فكلاهما قد سمعته يقول قال ‏\"‏ ويقرأ ما تيسر من القرآن مما علمه الله وأذن له فيه ثم يكبر ويركع حتى تطمئن مفاصله وتسترخي ثم يقول سمع الله لمن حمده ثم يستوي قائما حتى يقيم صلبه ثم يكبر ويسجد حتى يمكن وجهه ‏\"‏ ‏.‏ وقد سمعته يقول ‏\"‏ جبهته حتى تطمئن مفاصله وتسترخي ويكبر فيرفع حتى يستوي قاعدا على مقعدته ويقيم صلبه ثم يكبر فيسجد حتى يمكن وجهه ويسترخي فإذا لم يفعل هكذا لم تتم صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi' said:                     \"While the Messenger of Allah (ﷺ) was sitting with us around him, a man came in, turned towards the Qiblah and prayed. When he had finished his prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with Salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' So he went and prayed, and the Messenger of Allah (ﷺ) started watching him, and he (the man) did not know what was wrong with it. When he had finished the prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' He repeated it two or three times, then the man said: 'O Messenger of Allah, what is wrong with my prayer?' The Messenger of Allah (ﷺ) said: 'The prayer of any of you is not complete unless he performs wudu properly as enjoined by Allah, the Mighty and Sublime. So he should wash his face, his arms up to the elbows, and wipe his head, and (wash) his feet up to the ankles. Then he should magnify Allah (SWT) and praise Him and glorify Him.'\" - (One of the narrators) Hammam said: \"I heard him say: 'He should praise Allah and glorify Him and magnify Him.\" He said: \"I heard both of them.\" -\"He (the Prophet (ﷺ)) said: 'He should recite whatever is easy for him of the Quran that Allah has taught him and permitted him in it (the prayer). Then he should say the Takbir and bow until his joints settle and he is relaxed. Then he should say: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)' and stand up straight until his backbone is straight (and at ease). Then he should say Takbir and prostrate until he has placed his face firmly on the ground.\" \"I heard him say: his forehead, until his joints settle and he is relaxed. Then he should say the Takbir and sit up until his backbone is straight (and at ease). Then he should prostrate until he has placed his face firmly on the ground and he is relaxed. If he does not do that then he has not completed his prayer.\"",
      "chain": [
        "11447",
        "11151",
        "422",
        "323"
      ]
    },
    {
      "hadith_no": "1945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا أبي قال، حدثنا همام، قال حدثنا سفيان، ومنصور، وزياد، وبكر، - هو ابن وائل - كلهم ذكروا أنهم سمعوا من الزهري، يحدث أن سالما، أخبره أن أباه أخبره أنه، رأى النبي صلى الله عليه وسلم وأبا بكر وعمر وعثمان يمشون بين يدى الجنازة ‏.‏ بكر وحده لم يذكر عثمان ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب مرسل ‏.‏",
      "text_en": " Salim narrated:                     That his father told him that he was the Prophet, Abu Bakr, 'Umar and 'Uthman walking in front of the Janazah.",
      "chain": [
        "11447",
        "20005",
        "11067",
        "11339",
        "20579",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2593",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا سفيان، عن عمرو، عن وهب بن منبه، عن أخيه، عن معاوية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تلحفوا في المسألة ولا يسألني أحد منكم شيئا وأنا له كاره فيبارك له فيما أعطيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that the Messenger of Allah said:                     \"Do not be demanding when asking. If one of you asks me for anything and I give it reluctantly, there will be no blessing in it.\"",
      "chain": [
        "30325",
        "20005",
        "11081",
        "11102",
        "11447",
        "27"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني محمد بن قدامة، عن جرير، عن منصور، عن إبراهيم، عن همام، عن عدي بن حاتم، قال قلت يا رسول الله إني أرسل الكلاب المعلمة فتمسك على فآكل منه قال ‏\"‏ إذا أرسلت الكلاب - يعني المعلمة - وذكرت اسم الله فأمسكن عليك فكل ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ما لم يشركها كلب ليس منها ‏\"‏ ‏.‏ قلت وإني أرمي الصيد بالمعراض فأصيب فآكل قال ‏\"‏ إذا رميت بالمعراض وسميت فخزق فكل وإذا أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " t was narrated that 'Adiyy bin Hatim said:                     \"I said: 'O Messenger of Allah, I release my trained dogs and they catch (the game) for me - should I eat of it?\" he said: 'If you release your trained dogs, and mention the name of Allah, and they catch it for your, then eat.' I said: 'Even if they kill it?' He said:\" 'Even if they kill it, so long as another, strange dog has not joined them 'I said: 'And I shoot the game with the Mirad and I hit it - should I eat?' He said: ''If you shoot the and it penetrates (the target), then eat, but if it hits it with its broad edge, then do not6 eat it.\"\"",
      "chain": [
        "20028",
        "11067",
        "11051",
        "11447",
        "212"
      ]
    },
    {
      "hadith_no": "4564",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن المثنى، ويعقوب بن إبراهيم، قالا حدثنا عمرو بن عاصم، قال حدثنا همام، قال حدثنا قتادة، عن أبي الخليل، عن مسلم المكي، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب تبره وعينه وزنا بوزن والفضة بالفضة تبره وعينه وزنا بوزن والملح بالملح والتمر بالتمر والبر بالبر والشعير بالشعير سواء بسواء مثلا بمثل فمن زاد أو ازداد فقد أربى ‏\"‏ ‏.‏ واللفظ لمحمد لم يذكر يعقوب ‏\"‏ والشعير بالشعير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The messenger of Allah said: 'Gold for gold, of equal measure; silver for silver, of equal measure; salt for salt, dates for dates wheat for wheat, barley for barley, like for like. Whoever gives more or  takes more has engaged in Riba.\"' (Sahih)The wording is that of Muhammad Yaqub did not mention - \"Wheat for wheat\".",
      "chain": [
        "30170",
        "20184",
        "20267",
        "11447",
        "11019",
        "11291",
        "13118",
        "10917",
        "40"
      ]
    },
    {
      "hadith_no": "2192",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا محمد بن حميد المعمري، عن معمر، عن همام، قال سمعت أبا هريرة، يقول قال أبو القاسم  صلى الله عليه وسلم  ‏\"‏ إذا استلج أحدكم في اليمين فإنه آثم له عند الله من الكفارة التي أمر بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hammam heard Abu Hurairah saying that 'Abul-Qasim (ﷺ) said:                     \"If anyone of you insists on fulfilling what he swore to (after learning that it is wrong) then it is more sinful before Allah than (breaking the oath for which) the expiation that has been enjoined upon him.\"",
      "chain": [
        "35047",
        "38495",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2235",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا عمر بن هارون، عن همام، عن فرقد السبخي، عن يزيد بن عبد الله بن الشخير، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أكذب الناس الصباغون والصواغون ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"The most dishonest of people are the dyers and the goldsmiths. \"[1]",
      "chain": [
        "18792",
        "11447",
        "14313",
        "11318",
        "13"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ النار جبار والبئر جبار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “(The injuries caused by) a fire are without liability, and by falling into a well.”",
      "chain": [
        "38001",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    }
  ],
  "total_hadiths": 203
}