{
  "id": "11453",
  "name": "Abu al-Malih bin Usama أبو المليح بن أسامة",
  "full_name": "Abu al-Malih ('Amir) bin Usama أبو المليح بن أسامة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "98",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hadhli"
    ]
  },
  "parents": [
    {
      "id": "4001",
      "name": "Usama bin 'Umayr al-Hadhali ( أسامة بن عمير الهذلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "22905",
      "name": "Muhammad bin Abi al-Mlyh محمد بن أبي المليح",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22951",
      "name": "Mbshr bin Abi al-Mlyh مبشر بن أبي المليح",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "29598",
      "name": "'Abdur Rahman bin Abi al-Mlyh عبد الرحمن بن أبي المليح",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "4001",
      "name": "Usama bin 'Umayr al-Hadhali ( أسامة بن عمير الهذلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3120",
      "name": "Ma'qil bin Yasar al-Mazni ( معقل بن يسار المزني البصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5310",
      "name": "Nabaysha al-Hadhli ( نبيشة الخير الهذلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4049",
      "name": "Wathla bin al-'Asqa' ( واثلة بن الأسقع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3131",
      "name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12236",
      "name": "'Abdullah bin 'Utba عبد الله بن عتبة بن أبي سفيان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12221",
      "name": "'Abdullah bin Slyt عبد الله بن سليط",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "22905",
      "name": "Muhammad bin Abi al-Mlyh محمد بن أبي المليح",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22951",
      "name": "Mbshr bin Abi al-Mlyh مبشر بن أبي المليح",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "29598",
      "name": "'Abdur Rahman bin Abi al-Mlyh عبد الرحمن بن أبي المليح",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11419",
      "name": "Ja'far bin Iyas جعفر بن إياس / بن أبي وحشية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11342",
      "name": "Salm bin Abi al-Ja'd سالم بن أبي الجعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11597",
      "name": "Tarayf bin Mujalad, Abu Tamayma طريف بن مجالد أبو تميمة الهجيمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11319",
      "name": "Yazid bin Abi Yazid, al-Rashk يزيد بن أبي يزيد الضبعي الرشك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24516",
      "name": "Abu 'Abd al-Da'im أبو عبد الدائم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10719",
      "name": "Matr bin Tahman al-Waraq مطر بن طهمان الوراق أبو رجاء الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14087",
      "name": "al-Hakam bin Frwkh الحكم بن فروخ",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-553",
      "hadith_no": "553",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن أبي قلابة، عن أبي المليح، قال كنا مع بريدة في غزوة في يوم ذي غيم فقال بكروا بصلاة العصر فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر فقد حبط عمله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Mahh [??]:                     We were with Buraida in a battle on a cloudy day and he said, \"Offer the `Asr prayer early as the Prophet said, \"Whoever leaves the `Asr prayer, all his (good) deeds will be annulled.\"",
      "usc_msa_ref": "528",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sahih-bukhari-594",
      "hadith_no": "594",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى  هو ابن أبي كثير  عن أبي قلابة، أن أبا المليح، حدثه قال كنا مع بريدة في يوم ذي غيم فقال بكروا بالصلاة فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر حبط عمله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abu Malih [??]:                     I was with Buraida on a cloudy day and he said, \"Offer the `Asr prayer earlier as the Prophet said, 'Whoever leaves the `Asr prayer will have all his (good) deeds annulled.\" (See Hadith No. 527 and 528)",
      "usc_msa_ref": "568",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sahih-bukhari-1980",
      "hadith_no": "1980",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك على عبد الله بن عمرو فحدثنا أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على، فألقيت له وسادة من أدم، حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه‏.‏ فقال ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قال قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود  عليه السلام  شطر الدهر، صم يوما، وأفطر يوما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle was informed about my fasts, and he came to me and I spread for him a leather cushion stuffed with palm fires, but he sat on the ground and the cushion remained between me and him, and then he said, \"Isn't it sufficient for you to fast three days a month?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Five?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Seven?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Nine (days per month)?\" I replied, \"O Allah's Apostle! (I can fast more)\" He said, \"Eleven (days per month)?\" And then the Prophet said, \"There is no fast superior to that of the Prophet David it was for half of the year. So, fast on alternate days.\"",
      "usc_msa_ref": "201",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sahih-bukhari-6351",
      "hadith_no": "6351",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، حدثنا خالد،‏.‏ وحدثني عبد الله بن محمد، حدثنا عمرو بن عون، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك زيد على عبد الله بن عمرو فحدثنا أن النبي صلى الله عليه وسلم ذكر له صومي، فدخل على، فألقيت له وسادة من أدم حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه، فقال لي ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ لا صوم فوق صوم داود، شطر الدهر، صيام يوم، وإفطار يوم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The news of my fasting was mentioned to the Prophet . So he entered upon me and I put for him a leather cushion stuffed with palm-fibres. The Prophet sat on the floor and the cushion was between me and him. He said to me, \"Isn't it sufficient for you (that you fast) three days a month?\" I said, \"O Allah's Apostle! (I can fast more than this).\" He said, \"You may fast) five days a month.\" I said, \"O Allah's Apostle! (I can fast more than this).\" He said, \"(You may fast) seven days.\" I said, \"O Allah's Apostle!\" He said, \"Nine.\" I said, \"O Allah's Apostle!\" He said, \"Eleven.\" I said, \"O Allah's Apostle!\" He said, \"No fasting is superior to the fasting of (the Prophet David) which was one half of a year, and he used, to fast on alternate days. (See Hadith No. 300, Vol 3)",
      "usc_msa_ref": "294",
      "chain": [
        "30312",
        "30351",
        "30154",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sahih-muslim-383",
      "hadith_no": "383",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن أبي المليح، أن عبيد الله بن زياد، عاد معقل بن يسار في مرضه فقال له معقل إني محدثك بحديث لولا أني في الموت لم أحدثك به سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من أمير يلي أمر المسلمين ثم لا يجهد لهم وينصح إلا لم يدخل معهم الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Malih that Ubaidullah b. Ziyad visited Ma'qil b. Yasar in his illness. Ma'qil said to him:                      I am narrating to you a hadith which I would have never narrated to you had I not been in death-bed. I heard Allah's apostle (may peace be upon him) say: A ruler who has been entrusted with the affairs of the Muslims but he makes no endeavors ( for the material and moral uplift) and does not sincerely mean (their welfare) would not enter Paradise along with them.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "30123",
        "30312",
        "20287",
        "20295",
        "11019",
        "11453"
      ]
    },
    {
      "id": "sahih-muslim-2733",
      "hadith_no": "2733",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا سريج بن يونس، حدثنا هشيم، أخبرنا خالد، عن أبي المليح، عن نبيشة، الهذلي قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيام التشريق أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " Nubaisha al-Hudhali reported Allah's Messenger (may peace be upon him) as saying:                      The days of Tashriq are the days of eating and drinking.",
      "usc_msa_ref": "",
      "chain": [
        "30251",
        "20468",
        "11282",
        "11453",
        "5310"
      ]
    },
    {
      "id": "sahih-muslim-2734",
      "hadith_no": "2734",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا إسماعيل، - يعني ابن علية - عن خالد الحذاء، حدثني أبو قلابة، عن أبي المليح، عن نبيشة، قال خالد فلقيت أبا المليح فسألته فحدثني به، فذكر عن النبي صلى الله عليه وسلم بمثل حديث هشيم وزاد فيه ‏\"‏ وذكر لله ‏\"‏ ‏.‏",
      "text_en": " Nabaisha reported that Khalid said:                      I met Abu Malih and asked him and he narrated it to me from the Apostle of Allah (may peace be upon him). a hadith like one (narrated above) with this addition:\" And remembrance of Allah\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20208",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sahih-muslim-2798",
      "hadith_no": "2798",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك على عبد الله بن عمرو فحدثنا أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على فألقيت له وسادة من أدم حشوها ليف فجلس على الأرض وصارت الوسادة بيني وبينه فقال لي ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ خمسا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ سبعا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ تسعا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ أحد عشر ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود شطر الدهر صيام يوم وإفطار يوم ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada reported that Abu al Malih informed me:                      I went along with your father to 'Abdullah b. Amr, and he narrated to us that the Messenger of Allah (may peace be upon him) was informed about my fasting and he came to me, and I placed a leather cushion filled with fibre of date-palms for him. He sat down upon the ground and there was that cushion between me and him, and he said to me: Does three days' fasting in a month not suffice you? I said: Messenger of Allah, (I am capable of observing more fasts). He said: (Would) five (not suffice for you)? I said: Messenger of Allah, (I am capable of observing more fasts) He said: (Would) seven (fasts) not suffice you? I said: Messenger of Allah, (I am capable of observing more fasts). He (the Holy Prophet) then said: (Would) nine (fasts not suffice you)? I said: Messenger of Allah, (I am capable of observing more fasts). He said: (Would) eleven (fasts not suffice you)? I said: Messenger of Allah, (I am capable of observing more fasts than these). Thereupon the Apostle of Allah (may peace be upon him) said: There is no fasting (better than) the fasting of David which comprises half of the age, fasting a day and not fasting a day.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sunan-abi-daud-59",
      "hadith_no": "59",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن قتادة، عن أبي المليح، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقبل الله عز وجل صدقة من غلول ولا صلاة بغير طهور ‏\"‏ ‏.‏",
      "text_en": " Narrated AbulMalih:                     The Prophet (ﷺ) said: Allah does not accept charity from goods acquired by embezzlement as He does not accept prayer without purification.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20020",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-abi-daud-145",
      "hadith_no": "145",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو توبة، - يعني الربيع بن نافع - حدثنا أبو المليح، عن الوليد بن زوران، عن أنس يعني ابن مالك، أن رسول الله صلى الله عليه وسلم كان إذا توضأ أخذ كفا من ماء فأدخله تحت حنكه فخلل به لحيته وقال ‏\"‏ هكذا أمرني ربي عز وجل ‏\"‏ ‏.‏ قال أبو داود ابن زوران روى عنه حجاج بن حجاج وأبو المليح الرقي ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     Whenever the Messenger of Allah (ﷺ) performed ablution, he took a handful of water, and, putting it under his chin, made it go through his beard, saying: Thus did my Lord command me.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "11453",
        "19128",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-549",
      "hadith_no": "549",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا أبو المليح، حدثني يزيد بن يزيد، حدثني يزيد بن الأصم، سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن آمر فتيتي فيجمعوا حزما من حطب ثم آتي قوما يصلون في بيوتهم ليست بهم علة فأحرقها عليهم ‏\"‏ ‏.‏ قلت ليزيد بن الأصم يا أبا عوف الجمعة عنى أو غيرها قال صمتا أذناى إن لم أكن سمعت أبا هريرة يأثره عن رسول الله صلى الله عليه وسلم ما ذكر جمعة ولا غيرها ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      I thought about giving orders to some youths for gathering a bundle of firewood, then going off to some people who their prayers in their homes without any excuse, and burning down their houses over them.I (Yazid b. Yazid) said: I asked Yazid b. al-Asamm: Abu ‘Awf did he mean Friday (prayer) or any other? He replied: may my ears become deaf if I have not heard Abu Hurairah narrating it from the Messenger of Allah (May peace be upon him); He did not mention Friday (prayer) or any other.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "11453",
        "10842",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1057",
      "hadith_no": "1057",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا همام، عن قتادة، عن أبي المليح، عن أبيه، أن يوم، حنين كان يوم مطر فأمر النبي صلى الله عليه وسلم مناديه أن الصلاة في الرحال ‏.‏",
      "text_en": " Narrated Usamah ibn Umayr al-Huzali:                     The rain was falling on the day when the Battle of Hunayn took place. The Prophet (ﷺ), therefore, commanded that the people should offer their prayer in their camps.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20297",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-abi-daud-1059",
      "hadith_no": "1059",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، قال سفيان بن حبيب خبرنا عن خالد الحذاء، عن أبي قلابة، عن أبي المليح، عن أبيه، أنه شهد النبي صلى الله عليه وسلم زمن الحديبية في يوم جمعة وأصابهم مطر لم تبتل أسفل نعالهم فأمرهم أن يصلوا في رحالهم ‏.‏",
      "text_en": " Narrated Usamah ibn Umayr al-Huzali:                     Usamah attended the Prophet (ﷺ) on the occasion of the treaty of al-Hudaybiyyah on Friday. The rain fell as little as the soles of the shoes of the people were not set. He (the Prophet) commanded them to offer Friday prayer in their dwellings.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20711",
        "11282",
        "11047",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-abi-daud-2813",
      "hadith_no": "2813",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي المليح، عن نبيشة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنا كنا نهيناكم عن لحومها أن تأكلوها فوق ثلاث لكى تسعكم فقد جاء الله بالسعة فكلوا وادخروا واتجروا ألا وإن هذه الأيام أيام أكل وشرب وذكر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Nubayshah:                     The Prophet (ﷺ) said: We forbade you to eat their meat for more than three days in order that you  might have abundance; now Allah has produced abundance, so you may eat, store up and seek reward. Beware, these days are days of eating, drinking and remembrance of Allah, Most High.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11453"
      ]
    },
    {
      "id": "sunan-abi-daud-2830",
      "hadith_no": "2830",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، ح وحدثنا نصر بن علي، عن بشر بن المفضل، - المعنى - حدثنا خالد الحذاء، عن أبي قلابة، عن أبي المليح، قال قال نبيشة نادى رجل رسول الله صلى الله عليه وسلم إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا قال ‏\"‏ اذبحوا لله في أى شهر كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏ قال إنا كنا نفرع فرعا في الجاهلية فما تأمرنا قال ‏\"‏ في كل سائمة فرع تغذوه ماشيتك حتى إذا استحمل ‏\"‏ ‏.‏ قال نصر ‏\"‏ استحمل للحجيج ذبحته فتصدقت بلحمه ‏\"‏ ‏.‏ قال خالد أحسبه قال ‏\"‏ على ابن السبيل فإن ذلك خير ‏\"‏ ‏.‏ قال خالد قلت لأبي قلابة كم السائمة قال مائة ‏.‏",
      "text_en": " Narrated Nubayshah:                     A man called the Messenger of Allah (ﷺ): We used to sacrifice Atirah in pre-Islamic days during Rajab; so what do you command us? He said: Sacrifice for the sake of Allah in any month whatever; obey Allah, Most High, and feed(the people). He said: We used to sacrifice a Fara' in pre-Islamic days, so what do you command us? He said: On every pasturing animal there is a Fara' which is fed by your cattle till it becomes strong and capable of carrying load.  The narrator Nasr said (in his version): When it becomes capable of carrying load of the pilgrims, you may slaughter it and give its meat as charity (sadaqah). The narrator Khalid's version says: You (may give it) to the travellers, for it is better. Khalid said: I asked AbuQilabah: How many pasturing animals? He replied: One hundred.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30395",
        "20212",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sunan-abi-daud-3090",
      "hadith_no": "3090",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، وإبراهيم بن مهدي المصيصي، - المعنى - قالا حدثنا أبو المليح، عن محمد بن خالد، - قال أبو داود قال إبراهيم بن مهدي السلمي - عن أبيه، عن جده، وكانت، له صحبة من رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد إذا سبقت له من الله منزلة لم يبلغها بعمله ابتلاه الله في جسده أو في ماله أو في ولده ‏\"‏ ‏.‏ قال أبو داود زاد ابن نفيل ‏\"‏ ثم صبره على ذلك ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ حتى يبلغه المنزلة التي سبقت له من الله تعالى ‏\"‏ ‏.‏",
      "text_en": " Narrated Muhammad ibn Khalid as-Sulami:                     on his father's authority said his grandfather reported: He was a Companion of the Messenger of Allah (ﷺ) said: I heard the Messenger of Allah (ﷺ) say: When Allah has previously decreed for a servant a rank which he has not attained by his action, He afflicts him in his body, or his property or his children.Abu Dawud said: Ibn Nufail added in his version: \"He then enables him to endure that.\" The agreed version goes: \"So that He may bring him to the rank previously decreed from him by Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "11453",
        "38496",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-3933",
      "hadith_no": "3933",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا همام، ح وحدثنا محمد بن كثير، - المعنى - أخبرنا همام، عن قتادة، عن أبي المليح، - قال أبو الوليد - عن أبيه، أن رجلا، أعتق شقصا له من غلام فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ ليس لله شريك ‏\"‏ ‏.‏ زاد ابن كثير في حديثه فأجاز النبي صلى الله عليه وسلم عتقه ‏.‏",
      "text_en": " Narrated Abu al-Malih:                     On his father's authority (this is AbulWalid's version): A man emancipated a share in a slave and the matter was mentioned to the Prophet (ﷺ). He said: Allah has no partner. Ibn Kathir added in his version: The Prophet (ﷺ) allowed his emancipation.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20297",
        "28531",
        "11447",
        "11019",
        "11453",
        "20296"
      ]
    },
    {
      "id": "sunan-abi-daud-4010",
      "hadith_no": "4010",
      "source": "Sunan Abi Da'ud",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن قدامة، حدثنا جرير، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، - جميعا - عن منصور، عن سالم بن أبي الجعد، - قال ابن المثنى - عن أبي المليح، قال دخل نسوة من أهل الشام على عائشة - رضى الله عنها - فقالت ممن أنتن قلن من أهل الشام ‏.‏ قالت لعلكن من الكورة التي تدخل نساؤها الحمامات قلن نعم ‏.‏ قالت أما إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من امرأة تخلع ثيابها في غير بيتها إلا هتكت ما بينها وبين الله تعالى ‏\"‏ ‏.‏ قال أبو داود هذا حديث جرير وهو أتم ولم يذكر جرير أبا المليح قال قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     AbulMalih said: Some women of Syria came to Aisha. She asked them: From whom are you? They replied: From the people of Syria. She said: Perhaps you belong to the place where women enter hot baths (for washing ). The said: Yes. She said: I heard the Messenger of Allah (ﷺ) say: If a woman puts off her clothes in a place other than her house, she tears the veil between her and Allah, the Exalted.Abu Dawud said: This is the tradition narrated by Jarir, and it is more perfect. Jarir did not mention Abu al-Malih. He said (on the authority of 'A'ishah) that the Messenger of Allah (ﷺ) said.",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "30170",
        "20173",
        "20020",
        "11067",
        "11342",
        "30170",
        "11453"
      ]
    },
    {
      "id": "sunan-abi-daud-4132",
      "hadith_no": "4132",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد بن مسرهد، أن يحيى بن سعيد، وإسماعيل بن إبراهيم، حدثاهم - المعنى، - عن سعيد بن أبي عروبة، عن قتادة، عن أبي المليح بن أسامة، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " Abu al-Malih b. Usamah quoting his father said:                      The Messenger of Allah (ﷺ) forbade (the use of) the skins of beasts of prey.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20208",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-abi-daud-4926",
      "hadith_no": "4926",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن إبراهيم، قال حدثنا عبد الله بن جعفر الرقي، قال حدثنا أبو المليح، عن ميمون، عن نافع، قال كنا مع ابن عمر فسمع صوت، زامر فذكر نحوه ‏.‏ قال أبو داود وهذا أنكرها ‏.‏",
      "text_en": " Nafi said :                      When we were with Ibn ‘Umar, he heard the sound of a man who was blowing a pipe. He then mentioned a similar tradition.Abu Dawud said : This is more rejected.",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "30346",
        "11453",
        "11014",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-4982",
      "hadith_no": "4982",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، - يعني ابن عبد الله - عن خالد، - يعني الحذاء - عن أبي تميمة، عن أبي المليح، عن رجل، قال كنت رديف النبي صلى الله عليه وسلم فعثرت دابته فقلت تعس الشيطان ‏.‏ فقال ‏\"‏ لا تقل تعس الشيطان فإنك إذا قلت ذلك تعاظم حتى يكون مثل البيت ويقول بقوتي ولكن قل بسم الله فإنك إذا قلت ذلك تصاغر حتى يكون مثل الذباب ‏\"‏ ‏.‏",
      "text_en": " Abu al-Malih reported on the authority of a man :                      I was riding on a mount behind the prophet (May peace be upon him). It stumbled. Thereupon I said: May the devil perish! He said: do not say; may the devil perish! For you say that, he will swell so much so that he will be like a house, and say: by my power. But say: in the name of Allah; for when you say that, he will diminish so much so that he will be like a fly.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "11282",
        "11453"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1770-3",
      "hadith_no": "1770",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، حدثنا ابن المبارك، ومحمد بن بشر، وعبد الله بن إسماعيل بن أبي خالد، عن سعيد بن أبي عروبة، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع أن تفترش ‏.‏",
      "text_en": " Narrated Abu Al-Malih:                     From his father: \"The Prophet (ﷺ) prohibited using predator skins as a spread.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "20352",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1770-4",
      "hadith_no": "1770",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سعيد، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " Another chain from Abu Al-Malih from his father:                      \"The Prophet (ﷺ) prohibited predator skins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11168",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1770-5",
      "hadith_no": "1770",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي المليح، أنه كره جلود السباع ‏.‏ قال أبو عيسى ولا نعلم أحدا قال عن أبي المليح، عن أبيه، غير سعيد بن أبي عروبة ‏.‏",
      "text_en": " Another chain from Abu Al-Malik, that he (ﷺ) disliked predator skins. Abu 'Eisa said:                      We do not know anyone who said: \"From Abu Al-Malih, from his father\" except for Sa'eed bin Abi 'Arubah.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11453",
        "11453"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1771",
      "hadith_no": "1771",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد الرشك، عن أبي المليح، عن النبي صلى الله عليه وسلم أنه نهى عن جلود السباع ‏.‏ وهذا أصح ‏.‏",
      "text_en": " Narrated Abu Al-Malih:                     \"The Prophet (ﷺ) prohibited predator skins.\" And this chain is more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11319",
        "11453"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2299",
      "hadith_no": "2299",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن منيع، وعلي بن حجر، - المعنى واحد قالا حدثنا إسماعيل بن إبراهيم، عن أيوب، عن أبي المليح بن أسامة، عن أبي عزة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قضى الله لعبد أن يموت بأرض جعل له إليها حاجة أو قال بها حاجة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وأبو عزة له صحبة واسمه يسار بن عبد وأبو المليح اسمه عامر بن أسامة بن عمير الهذلي ويقال زيد بن أسامة ‏.‏",
      "text_en": " Abu 'Azzah narrated that the Messenger of Allah (s.a.w) said:                     \"When Allah decrees that a slave (of His) is to die in a land, He makes him have some need from it.\"Or, he said: \"In it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20387",
        "20208",
        "11015",
        "11453"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2628",
      "hadith_no": "2628",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن سعيد، عن قتادة، عن أبي المليح، عن عوف بن مالك الأشجعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني آت من عند ربي فخيرني بين أن يدخل نصف أمتي الجنة وبين الشفاعة فاخترت الشفاعة وهي لمن مات لا يشرك بالله شيئا ‏\"‏ ‏.‏ وقد روي عن أبي المليح عن رجل آخر من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم ولم يذكر عن عوف بن مالك وفي الحديث قصة طويلة ‏.‏",
      "text_en": " Abu Al-Malih  narrated from 'Awf bin Malik Al-Ashja'i who said:                      \"The Messenger of Allah (s.a.w) said'Someone came to me from myLord to give me choice between the half of my Ummah being admitted into Paradise or intercession. So I chose the   intercession,and it is for whoever dies and he did not associate anything with Allah.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11168",
        "11019",
        "11453",
        "3051"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2629",
      "hadith_no": "2629",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن قتادة، عن أبي المليح، عن عوف بن مالك، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11019",
        "11453",
        "10805"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3033",
      "hadith_no": "3033",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن منصور، قال سمعت سالم بن أبي الجعد، يحدث عن أبي المليح الهذلي، أن نساء، من أهل حمص أو من أهل الشام دخلن على عائشة فقالت أنتن اللاتي يدخلن نساؤكن الحمامات سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من امرأة تضع ثيابها في غير بيت زوجها إلا هتكت الستر بينها وبين ربها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Al-Malih Al-Hudhali:                     that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "11342",
        "11453"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3373-2",
      "hadith_no": "3373",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن أبي المليح، عن أبي صالح، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لم يسأل الله يغضب عليه ‏\"‏ ‏.‏ قال وروى وكيع وغير واحد عن أبي المليح هذا الحديث ولا نعرفه إلا من هذا الوجه وأبو المليح اسمه صبيح سمعت محمدا يقوله وقال يقال له الفارسي ‏.‏",
      "text_en": " Abu Hurairah [may Allah be pleased with him] narrated that :                     the Messenger of Allah said: “Indeed, he who does not ask Allah, he gets angry with him.”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11453",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-140",
      "hadith_no": "140",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن قتادة، عن أبي المليح، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقبل الله صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Malih, that his father said:                      \"The Messenger of Allah (ﷺ) said: 'Allah does not accept Salah without purification, nor charity from Ghulul.'\" [1][1] That which is taken from the spoils of war prior to their distribution.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-an-nasai-474",
      "hadith_no": "474",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثني يحيى، عن هشام، قال حدثني يحيى بن أبي كثير، عن أبي قلابة، قال حدثني أبو المليح، قال كنا مع بريدة في يوم ذي غيم فقال بكروا بالصلاة فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر فقد حبط عمله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Qilabah said:                      \"Abu Al-Malih narrated to me: 'We were with Buraidah on a cloudy day and he said: \"Pray early, for the Messenger of Allah (ﷺ) said: 'Whoever abandons Salat Al-'Asr, his good deeds will perish.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11065",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sunan-an-nasai-854",
      "hadith_no": "854",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن قتادة، عن أبي المليح، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم بحنين فأصابنا مطر فنادى منادي رسول الله صلى الله عليه وسلم أن صلوا في رحالكم ‏.‏",
      "text_en": " It was narrated from Abu Al Malih that his father said:                      \"We were with the Messenger of Allah (ﷺ) in Hunain and it rained. The caller of the Messenger of Allah (ﷺ)called out, telling us: 'Pray whereyou are.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-an-nasai-2402",
      "hadith_no": "2402",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكرياء بن يحيى، قال حدثنا وهب بن بقية، قال أنبأنا خالد، عن خالد، - وهو الحذاء - عن أبي قلابة، عن أبي المليح، قال دخلت مع أبيك زيد على عبد الله بن عمرو فحدث أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على فألقيت له وسادة أدم ربعة حشوها ليف فجلس على الأرض وصارت الوسادة فيما بيني وبينه قال ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ خمسا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ سبعا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ تسعا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود شطر الدهر صيام يوم وفطر يوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Al-Malih said:                     \"I entered with Zaid upon 'Abdullah bin Amr and he narrated: 'The Messenger of Allah was told about my fasting, so the entered upon me and I gave him an average-sized leather pillow that was stuffed with palm fibvers. He sat in the ground with the pillow between myself and him, and said: \"Whill it not be sufficient for you to fast three days each months?\" I said: O Messenger of Allah! He said: \"O Messenger of Allah!\" He said: \"Eleven.\" I said: \"O Messenger of Allah!\" Then the Prophet said: \"There is not fast better than the fast of Dawud, half of a lifetime, fasting one day and not next.\"",
      "usc_msa_ref": "",
      "chain": [
        "30193",
        "30569",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sunan-an-nasai-2524",
      "hadith_no": "2524",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن محمد الذارع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا شعبة، ‏.‏ قال وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا شعبة، - واللفظ لبشر - عن قتادة، عن أبي المليح، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل لا يقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Malib that his father said:                     \"I heard the Messenger of Allah say: 'Allah, the Mighty and Sublime, does not accept prayer without purification or charity from Ghulul.\"",
      "usc_msa_ref": "",
      "chain": [
        "34059",
        "20304",
        "34033",
        "20212",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-an-nasai-4228",
      "hadith_no": "4228",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن ابن عون، قال حدثنا جميل، عن أبي المليح، عن نبيشة، قال ذكر للنبي صلى الله عليه وسلم قال كنا نعتر في الجاهلية ‏.‏ قال ‏\"‏ اذبحوا لله عز وجل في أى شهر ما كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nubaishah said:                     \"It was said to the prophet: 'During the Jahiliyyah we used to offer the 'Atirah.' He said: 'Slaughter for the sake of Allah, the Mighty and sublime, no matter what month it is; do good for the sake of Allah, the Mighty and sublime, and feed the poor.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11453"
      ]
    },
    {
      "id": "sunan-an-nasai-4229",
      "hadith_no": "4229",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، - وهو ابن المفضل - عن خالد، وربما، قال عن أبي المليح، وربما، ذكر أبا قلابة عن نبيشة، قال نادى رجل وهو بمنى فقال يا رسول الله إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا يا رسول الله قال ‏\"‏ اذبحوا في أى شهر ما كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏ قال إنا كنا نفرع فرعا فما تأمرنا قال ‏\"‏ في كل سائمة فرع تغذوه ماشيتك حتى إذا استحمل ذبحته وتصدقت بلحمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nubaishah said:                     \"A man called out while he was in Mina and said: 'O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?' He said: 'Sacrifice during whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' They said: 'O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of you flock until it reaches an age where it could be used carry loads, then sacrifice it, and give its meat in charity.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20212",
        "11282",
        "11453",
        "11047"
      ]
    },
    {
      "id": "sunan-an-nasai-4230",
      "hadith_no": "4230",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا غندر، عن شعبة، عن خالد، عن أبي قلابة، عن أبي المليح، وأحسبني، قد سمعته من أبي المليح، عن نبيشة، - رجل من هذيل - عن النبي صلى الله عليه وسلم قال ‏\"‏ إني كنت نهيتكم عن لحوم الأضاحي فوق ثلاث كيما تسعكم فقد جاء الله عز وجل بالخير فكلوا وتصدقوا وادخروا وإن هذه الأيام أيام أكل وشرب وذكر الله عز وجل ‏\"‏ ‏.‏ فقال رجل إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا قال ‏\"‏ اذبحوا لله عز وجل في أى شهر ما كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏ فقال رجل يا رسول الله إنا كنا نفرع فرعا في الجاهلية فما تأمرنا قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ في كل سائمة من الغنم فرع تغذوه غنمك حتى إذا استحمل ذبحته وتصدقت بلحمه على ابن السبيل فإن ذلك هو خير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nubaishah, a man of Hudhail, that the Prophet said:                     \"I used to forbid you to store the meat of the sacrifices for more than three days so that there would be enough for everyone. But now Allah, the mighty and sublime, has bestowed plenty upon us, so eat some, give some in charity and store some, For these days are the days of eating, drinking and remembering Allah.\" A man said: \"O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?\" He said: \"Sacrifice to Allah, the Mighty and Sublime, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).\" He said: \"O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?\" He said: \"For every flock of grazing animals, feed the firstborn as you feed the rest of your flock, until it reaches an age where it could be used to carry loads, then sacrifice it, and give its meat in charity to the wayfarer, for that is good.\"",
      "usc_msa_ref": "",
      "chain": [
        "20278",
        "20020",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "id": "sunan-an-nasai-4231",
      "hadith_no": "4231",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا أبو الأشعث، أحمد بن المقدام قال حدثنا يزيد، - وهو ابن زريع - قال أنبأنا خالد، عن أبي المليح، عن نبيشة، قال نادى النبي صلى الله عليه وسلم رجل فقال إنا كنا نعتر عتيرة يعني في الجاهلية في رجب فما تأمرنا قال ‏\"‏ اذبحوها في أى شهر كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏ قال إنا كنا نفرع فرعا في الجاهلية ‏.‏ قال ‏\"‏ في كل سائمة فرع حتى إذا استحمل ذبحته وتصدقت بلحمه فإن ذلك هو خير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nubaishah said:                     \"A man called out to the Prophet and said: 'We used to sacrifice the 'Atirah - i.e., during the Jahiliyyah - in Rajab; what do you command us to do?' He said: 'Sacrifice, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' He said: 'We used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of your flock until it reaches an age where it could be used to carry loads, then sacrifice it, and give its meat in charity, for that is good.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20304",
        "11282",
        "11453"
      ]
    },
    {
      "id": "sunan-an-nasai-4253",
      "hadith_no": "4253",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن ابن أبي عروبة، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " It was narrated from Abu Al-Malih, from his father, that:                     the Prophet forbade (the use of) the hides of Predators. (Hassan)",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-ibn-majah-283",
      "hadith_no": "283",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، ح وحدثنا بكر بن خلف أبو بشر، ختن المقرئ حدثنا يزيد بن زريع، قالوا حدثنا شعبة، عن قتادة، عن أبي المليح بن أسامة، عن أبيه، أسامة بن عمير الهذلي قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقبل الله صلاة إلا بطهور ولا يقبل صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usamah bin 'Umair Al-Hudhali said:                     \"The Messenger of Allah said: 'Allah does not accept any prayer without purification and He does not accept any charity from Ghulul.'\" (Sahih)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "34043",
        "20304",
        "20020",
        "11019",
        "11453"
      ]
    },
    {
      "id": "sunan-ibn-majah-573",
      "hadith_no": "573",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله، عن عبيد الله الهذلي، - قال محمد بن يحيى وهو عندنا ابن أبي حميد - أنبأنا أبو المليح الهذلي، عن واثلة بن الأسقع، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فقال اللهم ارحمني ومحمدا ولا تشرك في رحمتك إيانا أحدا ‏.‏ فقال ‏\"‏ لقد حظرت واسعا ويحك - أو ويلك - ‏\"‏ ‏.‏ قال فشج يبول فقال أصحاب النبي  صلى الله عليه وسلم  مه ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ دعوه ‏\"‏ ‏.‏ ثم دعا بسجل من ماء فصب عليه ‏.‏",
      "text_en": " It was narrated that Wathilah bin Asqa' said:                     \"A Bedouin came to the Prophet and said: 'O Allah, have mercy on me and Muhammed, and do not allow anyone else to share in your Mercy.' The Prophet said: 'You have placed restrictions on something that is vast, woe to you!' Then he (the Bedouin) spread his legs and urinated, and the Companions of the Prophet told him to stop, but the Messenger of Allah said: 'Let him be,' then he called for a vessel of water and poured it over (the urine).\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30561",
        "11222",
        "11453",
        "4049"
      ]
    },
    {
      "id": "sunan-ibn-majah-719",
      "hadith_no": "719",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا شجاع بن مخلد أبو الفضل، قال حدثنا هشيم، أنبأنا أبو بشر، عن أبي المليح بن أسامة، عن عبد الله بن عتبة بن أبي سفيان، حدثتني عمتي أم حبيبة، أنها سمعت رسول الله  صلى الله عليه وسلم  يقول إذا كان عندها في يومها وليلتها فسمع المؤذن يؤذن قال كما يقول المؤذن ‏.‏",
      "text_en": " Umm Habibah narrated that :                     When the Messenger of Allah was with her on her day and night, and heard the Mu'adh-dhin calling the Adhan, she heard him saying what he said.",
      "usc_msa_ref": "",
      "chain": [
        "30506",
        "20468",
        "11419",
        "11453",
        "12236"
      ]
    },
    {
      "id": "sunan-ibn-majah-989",
      "hadith_no": "989",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل بن إبراهيم، عن خالد الحذاء، عن أبي المليح، قال خرجت في ليلة مطيرة فلما رجعت استفتحت فقال أبي من هذا قال أبو المليح ‏.‏ قال لقد رأيتنا مع رسول الله  صلى الله عليه وسلم  يوم الحديبية وأصابتنا سماء لم تبل أسافل نعالنا فنادى منادي رسول الله  صلى الله عليه وسلم  ‏\"‏ صلوا في رحالكم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Malih said:                      “I went out on a rainy night(forcongregational prayer), and when I came back I asked for the doortobe opened. My father said: ‘Who is this?’ I said: ‘Abu Malih.’Hesaid: ‘We were with the Messenger of Allah (ﷺ) at Hudaybiyahand itrained a little, such that the soles of our sandals did notget wet.The announcer of the Messenger of Allah (ﷺ) called out:‘Performyour prayer at your camps.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11282",
        "11453"
      ]
    },
    {
      "id": "sunan-ibn-majah-3280",
      "hadith_no": "3280",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن خالد الحذاء، عن أبي المليح، عن نبيشة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كنت نهيتكم عن لحوم الأضاحي فوق ثلاثة أيام فكلوا وادخروا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Nubaishah that the Messenger of Allah (ﷺ)said:                      “Iused to forbid you to store the meat of the sacrifices formore thanthree days, but (now) eat some and store some.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20246",
        "11282",
        "11453"
      ]
    },
    {
      "id": "sunan-ibn-majah-3287",
      "hadith_no": "3287",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، عن خالد الحذاء، عن أبي المليح، عن نبيشة، قال نادى رجل رسول الله  صلى الله عليه وسلم  فقال يا رسول الله إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا قال ‏\"‏ اذبحوا لله عز وجل في أى شهر ما كان وبروا الله وأطعموا ‏\"‏ ‏.‏ قالوا يا رسول الله إنا كنا نفرع فرعا في الجاهلية فما تأمرنا قال ‏\"‏ في كل سائمة فرع تغذوه ماشيتك حتى إذا استحمل ذبحته فتصدقت بلحمه - أراه قال - على ابن السبيل فإن ذلك هو خير ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Nubaishah said:                      “A man called the Messenger ofAllah(ﷺ) and said: ‘O Messenger of Allah, we used to sacrifice the‘Atirah during the Ignorance days in Rajab,; what do you command ustodo?’ He said: “Sacrifice to Allah whatever month it is, dogood forthe sake of Allah and feed (the poor).’ They said: ‘OMessenger ofAllah, we used to sacrifice the Far’ah during theIgnorance days; whatdo you command us to do?’ He said: ‘Forevery Sa’imah* (flock ofgrazing animals), feed the firstborn asyou feed the rest of yourflock until it reaches an age where itcould be used to carry loads,then sacrifice it, and give its meat incharity’ – I** think he said –‘to the wayfarer, for that isgood.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11282",
        "11453"
      ]
    },
    {
      "id": "sunan-ibn-majah-3750-2",
      "hadith_no": "3750",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن منصور، عن سالم بن أبي الجعد، عن أبي المليح الهذلي، أن نسوة، من أهل حمص استأذن على عائشة فقالت لعلكن من اللواتي يدخلن الحمامات سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ أيما امرأة وضعت ثيابها في غير بيت زوجها فقد هتكت ستر ما بينها وبين الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Malih AL-HUdhail that some women from the people of Hims asked permission to enter upon Aisha. She said:                     \"Perhaps you are among those (women) who enter bathhouses? I heard the Messenger of Allah(ﷺ) say: 'Any woman who takes off her clothes anywhere but in her husband's house, has torn the screen between her and Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11067",
        "11342",
        "11453"
      ]
    }
  ],
  "total_hadiths": 47
}