{
  "id": "11455",
  "name": "'Umarh bint 'Abdur Rahman عمرة بنت عبد الرحمن بن سعد بن زرارة",
  "full_name": "'Umarh bint 'Abdur Rahman عمرة بنت عبد الرحمن بن سعد بن زرارة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "98",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Female",
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar"
    ]
  },
  "parents": [
    {
      "id": "1204",
      "name": "'Abdur Rahman bin Sa'd bin Zurara ( عبد الرحمن بن سعد بن زرارة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11219",
      "name": "Muhammad bin 'Abdur Rahman bin Sa'd محمد بن عبد الرحمن بن سعد بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [
    {
      "id": "10959",
      "name": "Muhammad bin 'Abdur Rahman bin Haritha محمد بن عبد الرحمن بن حارثة - أبو الرجال",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1259",
      "name": "Umm Hisham bint Haritha bin al-Nu'man ( أم هشام بنت حارثة بن النعمان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1264",
      "name": "Habiba bint Sahl bin Tha'laba ( حبيبة بنت سهل بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "72",
      "name": "Hamnah bint Jahsh ( حمنة بنت جحش الأسدية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10959",
      "name": "Muhammad bin 'Abdur Rahman bin Haritha محمد بن عبد الرحمن بن حارثة - أبو الرجال",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11219",
      "name": "Muhammad bin 'Abdur Rahman bin Sa'd محمد بن عبد الرحمن بن سعد بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11104",
      "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "327",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا معن، قال حدثني ابن أبي ذئب، عن ابن شهاب، عن عروة، وعن عمرة، عن عائشة، زوج النبي صلى الله عليه وسلم أن أم حبيبة استحيضت سبع سنين، فسألت رسول الله صلى الله عليه وسلم عن ذلك، فأمرها أن تغتسل فقال ‏\"‏ هذا عرق ‏\"‏‏.‏ فكانت تغتسل لكل صلاة‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Um Habiba got bleeding in between the periods for seven years. She asked Allah's Apostle about it. He ordered her to take a bath (after the termination of actual periods) and added that it was (from) a blood vessel. So she used to take a bath for every prayer.",
      "chain": [
        "30308",
        "30112",
        "20177",
        "11013",
        "10511",
        "11455"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت لرسول الله صلى الله عليه وسلم يا رسول الله، إن صفية بنت حيى قد حاضت‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلها تحبسنا، ألم تكن طافت معكن ‏\"‏‏.‏ فقالوا بلى‏.‏ قال ‏\"‏ فاخرجي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) I told Allah's Apostle that Safiya bint Huyai had got her menses. He said, \"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that the Prophet told her to depart.",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "11455"
      ]
    },
    {
      "hadith_no": "456",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن يحيى، عن عمرة، عن عائشة، قالت أتتها بريرة تسألها في كتابتها فقالت إن شئت أعطيت أهلك ويكون الولاء لي‏.‏ وقال أهلها إن شئت أعطيتها ما بقي  وقال سفيان مرة إن شئت أعتقتها ويكون الولاء لنا  فلما جاء رسول الله صلى الله عليه وسلم ذكرته ذلك فقال ‏\"‏ ابتاعيها فأعتقيها، فإن الولاء لمن أعتق ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم على المنبر  وقال سفيان مرة فصعد رسول الله صلى الله عليه وسلم على المنبر  فقال ‏\"‏ ما بال أقوام يشترطون شروطا ليست في كتاب الله، من اشترط شرطا ليس في كتاب الله فليس له، وإن اشترط مائة مرة ‏\"‏‏.‏ قال علي قال يحيى وعبد الوهاب عن يحيى عن عمرة‏.‏ وقال جعفر بن عون عن يحيى قال سمعت عمرة قالت سمعت عائشة‏.‏ رواه مالك عن يحيى عن عمرة أن بريرة‏.‏ ولم يذكر صعد المنبر‏.‏",
      "text_en": " Narrated `Aisha:                     Barira came to seek my help regarding her manumission. I told herself you like I would pay your price to your masters but your Wala' (allegiance) would be for me.\" Her masters said, \"If you like, you can pay what remains (of the price of her manumission), (Sufyan the sub-narrator once said), or if you like you can manumit her, but her (inheritance) Al-Wala would be for us. \"When Allah's Apostle came, I spoke to him about it. He said, \"Buy her and manumit her. No doubt Al-Wala' is for the manumitted.\" Then Allah's Apostle stood on the pulpit (or Allah's Apostle ascended the pulpit as Sufyan once said), and said, \"What about some people who impose conditions which are not present in Allah's Book (Laws)? Whoever imposes conditions which are not in Allah's Book (Laws), his conditions will be invalid even if he imposed them a hundred times.\"",
      "chain": [
        "30026",
        "20005",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد، قال أخبرنا عبدة، عن يحيى بن سعيد الأنصاري، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل في حجرته، وجدار الحجرة قصير، فرأى الناس شخص النبي صلى الله عليه وسلم فقام أناس يصلون بصلاته، فأصبحوا فتحدثوا بذلك، فقام ليلة الثانية، فقام معه أناس يصلون بصلاته، صنعوا ذلك ليلتين أو ثلاثة، حتى إذا كان بعد ذلك جلس رسول الله صلى الله عليه وسلم فلم يخرج، فلما أصبح ذكر ذلك الناس فقال ‏\"‏ إني خشيت أن تكتب عليكم صلاة الليل ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to pray in his room at night. As the wall of the room was LOW, the people saw him and some of them stood up to follow him in the prayer. In the morning they spread the news. The following night the Prophet stood for the prayer and the people followed him. This went on for two or three nights. Thereupon Allah's Apostle did not stand for the prayer the following night, and did not come out. In the morning, the people asked him about it. He replied, that he way afraid that the night prayer might become compulsory.",
      "chain": [
        "30213",
        "20337",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "867",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، ح وحدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح، فينصرف النساء متلفعات بمروطهن، ما يعرفن من الغلس‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle finished the Fajr prayer, the women would leave covered in their sheets and were not recognized owing to the darkness.",
      "chain": [
        "20164",
        "20001",
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "869",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة  رضى الله عنها  قالت لو أدرك رسول الله صلى الله عليه وسلم ما أحدث النساء لمنعهن كما منعت نساء بني إسرائيل‏.‏ قلت لعمرة أو منعن قالت نعم‏.‏",
      "text_en": " Narrated `Aisha:                     Had Allah's Apostle known what the women were doing, he would have forbidden them from going to the mosque as the women of Bani Israel had been forbidden. Yahya bin Sa`id (a sub-narrator) asked `Amra (another sub-narrator), \"Were the women of Bani Israel forbidden?\" She replied \"Yes.\"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "903",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يحيى بن سعيد، أنه سأل عمرة عن الغسل، يوم الجمعة فقالت قالت عائشة  رضى الله عنها  كان الناس مهنة أنفسهم، وكانوا إذا راحوا إلى الجمعة راحوا في هيئتهم فقيل لهم لو اغتسلتم‏.‏",
      "text_en": " Narrated Yahya bin Sa`id:                     I asked `Amra about taking a bath on Fridays. She replied, \" Aisha said, 'The people used to work (for their livelihood) and whenever they went for the Jumua prayer, they used to go to the mosque in the same shape as they had been in work. So they were asked to take a bath on Friday.' \"",
      "chain": [
        "30349",
        "20025",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1050",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن يهودية جاءت تسألها فقالت لها أعاذك الله من عذاب القبر‏.‏ فسألت عائشة  رضى الله عنها  رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فخسفت الشمس، فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام يصلي، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد، ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع فسجد وانصرف، فقال ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     A Jewess came to ask `Aisha (the wife of the Prophet) about something. She said to her, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha ' asked Allah's Apostle \"Would the people be punished in their graves?\" Allah's Apostle after seeking refuge with Allah from the punishment of the grave (and thus replied in the affirmative). Then one day, Allah's Apostle rode to go to some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the dwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood up for a long period and then performed a prolonged bowing which was shorter than the first bowing. Then he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but the standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was shorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but shorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised his head and prostrated and finished the prayer and (then delivered the sermon and) said as much as Allah wished. And then he ordered the people to seek refuge with Allah from the punishment of the grave.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "1056",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها أن يهودية، جاءت تسألها فقالت أعاذك الله من عذاب القبر‏.‏ فسألت عائشة رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فكسفت الشمس فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام فصلى، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد سجودا طويلا ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم قام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد وهو دون السجود الأول، ثم انصرف فقال رسول الله صلى الله عليه وسلم ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     A Jewess came to `Aisha to ask her about something and then she said, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha asked Allah's Apostle, \"Would the people be punished in their graves?\" Allah's Apostle asked Allah's refuge from the punishment of the grave (indicating an affirmative reply). Then one day Allah's Apostle rode (to leave for some place) but the sun eclipsed. He returned on the forenoon and passed through the rear of the dwellings (of his wives) and stood up and started offering the (eclipse) prayer and the people stood behind him. He stood for a long period and then performed a long bowing and then stood straight for a long period which was shorter than that of the first standing, then he performed a prolonged bowing which was shorter than the first bowing, then he raised his head and prostrated for a long time and then stood up (for the second rak`a) for a long while, but the standing was shorter than the standing of the first rak`a. Then he performed a prolonged bowing which was shorter than that of the first one. He then stood up for a long time but shorter than the first, then again performed a long bowing which was shorter than the first and then prostrated for a shorter while than that of the first prostration. Then he finished the prayer and delivered the sermon and) said what Allah wished; and ordered the people to seek refuge with Allah from the punishment of the grave.",
      "chain": [
        "30103",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1064",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمود، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن يحيى، عن عمرة، عن عائشة  رضى الله عنها أن النبي صلى الله عليه وسلم صلى بهم في كسوف الشمس أربع ركعات في سجدتين، الأول الأول أطول‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet led us and performed four bowing in two rak`at during the solar eclipse and the first rak`a was longer.",
      "chain": [
        "30277",
        "20355",
        "20012",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرة بنت عبد الرحمن، أنها أخبرته أنها، سمعت عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت إنما مر رسول الله صلى الله عليه وسلم على يهودية يبكي عليها أهلها فقال ‏\"‏ إنهم ليبكون عليها، وإنها لتعذب في قبرها ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Once Allah's Apostle passed by (the grave of) a Jewess whose relatives were weeping over her. He said, \"They are weeping over her and she is being tortured in her grave.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  قالت لما جاء النبي صلى الله عليه وسلم قتل ابن حارثة وجعفر وابن رواحة جلس يعرف فيه الحزن، وأنا أنظر من صائر الباب  شق الباب  فأتاه رجل، فقال إن نساء جعفر، وذكر بكاءهن، فأمره أن ينهاهن، فذهب ثم أتاه الثانية، لم يطعنه فقال انههن‏.‏ فأتاه الثالثة قال والله غلبننا يا رسول الله فزعمت أنه قال ‏\"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، لم تفعل ما أمرك رسول الله صلى الله عليه وسلم ولم تترك رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet got the news of the death of Ibn Haritha, Ja`far and Ibn Rawaha he sat down and looked sad and I was looking at him through the chink of the door. A man came and told him about the crying of the women of Ja`far. The Prophet ordered him to forbid them. The man went and came back saying that he had told them but they did not listen to him. The Prophet (p.b.u.h) said, \"Forbid them.\" So again he went and came back for the third time and said, \"O Allah's Apostle! By Allah, they did not listen to us at all.\" (`Aisha added): Allah's Apostle ordered him to go and put dust in their mouths. I said, (to that man) \"May Allah stick your nose in the dust (i.e. humiliate you)! You could neither (persuade the women to) fulfill the order of Allah's Apostle nor did you relieve Allah's Apostle from fatigue. \"",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1305",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول لما جاء قتل زيد بن حارثة وجعفر وعبد الله بن رواحة، جلس النبي صلى الله عليه وسلم يعرف فيه الحزن، وأنا أطلع من شق الباب، فأتاه رجل فقال يا رسول الله إن نساء جعفر وذكر بكاءهن فأمره بأن ينهاهن، فذهب الرجل ثم أتى فقال قد نهيتهن، وذكر أنهن لم يطعنه، فأمره الثانية أن ينهاهن، فذهب، ثم أتى، فقال والله لقد غلبنني أو غلبننا الشك من محمد بن حوشب  فزعمت أن النبي صلى الله عليه وسلم قال ‏\"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، فوالله ما أنت بفاعل وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated Aisha:                     When the news of the martyrdom of Zaid bin Haritha, Ja`far and `Abdullah bin Rawaha came, the Prophet sat down looking sad, and I was looking through the chink of the door. A man came and said, \"O Allah's Apostle! The women of Ja`far,\" and then he mentioned their crying . The Prophet (p.b.u.h) ordered him to stop them from crying. The man went and came back and said, \"I tried to stop them but they disobeyed.\" The Prophet (p.b.u.h) ordered him for the second time to forbid them. He went again and came back and said, \"They did not listen to me, (or \"us\": the sub-narrator Muhammad bin Haushab is in doubt as to which is right). \" (`Aisha added: The Prophet said, \"Put dust in their mouths.\" I said (to that man), \"May Allah stick your nose in the dust (i.e. humiliate you).\" By Allah, you could not (stop the women from crying) to fulfill the order, besides you did not relieve Allah's Apostle from fatigue.\"",
      "chain": [
        "20174",
        "20259",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1722",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا ابن شهاب، عن عروة، وعن عمرة بنت عبد الرحمن، أن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يهدي من المدينة، فأفتل قلائد هديه، ثم لا يجتنب شيئا مما يجتنبه المحرم‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to send the Hadi from Medina and I used to twist the garlands for his Hadi and he did not keep away from any of these things which a Muhrim keeps away from.",
      "chain": [
        "30355",
        "20023",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1724",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عمرة بنت عبد الرحمن، أنها أخبرته أن زياد بن أبي سفيان كتب إلى عائشة  رضى الله عنها  إن عبد الله بن عباس  رضى الله عنهما  قال من أهدى هديا حرم عليه ما يحرم على الحاج حتى ينحر هديه‏.‏ قالت عمرة فقالت عائشة  رضى الله عنها  ليس كما قال ابن عباس، أنا فتلت قلائد هدى رسول الله صلى الله عليه وسلم بيدى، ثم قلدها رسول الله صلى الله عليه وسلم بيديه، ثم بعث بها مع أبي فلم يحرم على رسول الله صلى الله عليه وسلم شىء أحله الله حتى نحر الهدى‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Bakr bin `Amr bin Hazm:                     That `Amra bint `Abdur-Rahman had told him, \"Zaid bin Abu Sufyan wrote to `Aisha that `Abdullah bin `Abbas had stated, 'Whoever sends his Hadi (to the Ka`ba), all the things which are illegal for a (pilgrim) become illegal for that person till he slaughters it (i.e. till the 10th of Dhul-Hijja).' \" `Amra added, `Aisha said, 'It is not like what Ibn `Abbas had said: I twisted the garlands of the Hadis of Allah's Apostle with my own hands. Then Allah's Apostle put them round their necks with his own hands, sending them with my father; Yet nothing permitted by Allah was considered illegal for Allah's Apostle till he slaughtered the Hadis.' \"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11455"
      ]
    },
    {
      "hadith_no": "1734",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، قالت سمعت عائشة  رضى الله عنها  تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس بقين من ذي القعدة، لا نرى إلا الحج، فلما دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى، إذا طاف وسعى بين الصفا والمروة أن يحل، قالت فدخل علينا يوم النحر بلحم بقر‏.‏ فقلت ما هذا قال نحر رسول الله صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرته للقاسم، فقال أتتك بالحديث على وجهه‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     I heard `Aisha saying, \"Five days before the end of Dhul-Qa'da we set out from Medina in the company of Allah's Apostle with the intention of performing Hajj only. When we approached Mecca, Allah's Apostle ordered those who had no Hadi with them to finish their lhram after performing Tawaf of the Ka`ba and (Sa`i) and between Safa and Marwa.\" `Aisha added, \"On the day of Nahr (slaughtering of sacrifice) beef was brought to us. I asked, 'What is this?' The reply was, 'Allah's Apostle (p.b.u.h) has slaughtered (sacrifices) on behalf of his wives.' \"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1746",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني يحيى، قال حدثتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس بقين من ذي القعدة، ولا نرى إلا الحج، حتى إذا دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى إذا طاف بالبيت ثم يحل‏.‏ قالت عائشة  رضى الله عنها  فدخل علينا يوم النحر بلحم بقر فقلت ما هذا فقيل ذبح النبي صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرت هذا الحديث للقاسم‏.‏ فقال أتتك بالحديث على وجهه‏.‏",
      "text_en": " Narrated `Amra:                     I heard `Aisha saying, \"We set out (from Medina) along with Allah's Apostle five days before the end of Dhul-Qa'da with the intention of performing Hajj only. When we approached Mecca, Allah's Apostle ordered those who had no Hadi along with them to finish the lhram after performing Tawaf of the Ka`ba, (Safa and Marwa). `Aisha added, \"Beef was brought to us on the Day of Nahr and I said, 'What is this?' Somebody said, 'The Prophet has slaughtered (cows) on behalf of his wives.' \"",
      "chain": [
        "30463",
        "20160",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2029",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا ليث، عن ابن شهاب، عن عروة، وعمرة بنت عبد الرحمن، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت وإن كان رسول الله صلى الله عليه وسلم ليدخل على رأسه وهو في المسجد فأرجله، وكان لا يدخل البيت إلا لحاجة، إذا كان معتكفا",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Allah's Apostle used to let his head in (the house) while he was in the mosque and I would comb and oil his hair. When in I`tikaf he used not to enter the house except for a need.",
      "chain": [
        "30367",
        "20023",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2033",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا يحيى، عن عمرة، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يعتكف في العشر الأواخر من رمضان، فكنت أضرب له خباء فيصلي الصبح ثم يدخله، فاستأذنت حفصة عائشة أن تضرب خباء فأذنت لها، فضربت خباء، فلما رأته زينب ابنة جحش ضربت خباء آخر، فلما أصبح النبي صلى الله عليه وسلم رأى الأخبية فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فأخبر فقال النبي صلى الله عليه وسلم ‏\"‏ آلبر ترون بهن ‏\"‏‏.‏ فترك الاعتكاف ذلك الشهر، ثم اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Amra:                     Aisha said, \"the Prophet used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a tent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the permission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab bint Jahsh saw it, she pitched another tent. In the morning the Prophet noticed the tents. He said, 'What is this?\" He was told of the whole situation. Then the Prophet said, \"Do you think that they intended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and practiced I`tikaf for ten days in the month of Shawwal.\"",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2034",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم أراد أن يعتكف، فلما انصرف إلى المكان الذي أراد أن يعتكف إذا أخبية خباء عائشة، وخباء حفصة، وخباء زينب، فقال ‏\"‏ آلبر تقولون بهن ‏\"‏‏.‏ ثم انصرف، فلم يعتكف، حتى اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet intended to practice I`tikaf and when he reached the place where he intended to perform I`tikaf, he saw some tents, the tents of `Aisha, Hafsa and Zainab. So, he said, \"Do you consider that they intended to do righteousness by doing this?\" And then he went away and did not perform I`tikaf (in Ramadan) but performed it in the month of Shawwal for ten days.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد، أخبرنا محمد بن فضيل بن غزوان، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يعتكف في كل رمضان، وإذا صلى الغداة دخل مكانه الذي اعتكف فيه  قال  فاستأذنته عائشة أن تعتكف فأذن لها فضربت فيه قبة، فسمعت بها حفصة، فضربت قبة، وسمعت زينب بها، فضربت قبة أخرى، فلما انصرف رسول الله صلى الله عليه وسلم من الغد أبصر أربع قباب، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فأخبر خبرهن، فقال ‏\"‏ ما حملهن على هذا آلبر انزعوها فلا أراها ‏\"‏‏.‏ فنزعت، فلم يعتكف في رمضان حتى اعتكف في آخر العشر من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle used to practice I`tikaf every year in the month of Ramadan. And after offering the morning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice I`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also pitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the morning, Allah's Apostle had finished the morning prayer, he saw four tents and asked, \"What is this?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove the tents, for I do not want to see them.\" So, the tents were removed. The Prophet did not perform I`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.",
      "chain": [
        "30213",
        "20356",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2045",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن سعيد، قال حدثتني عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم ذكر أن يعتكف العشر الأواخر من رمضان، فاستأذنته عائشة فأذن لها، وسألت حفصة عائشة أن تستأذن لها ففعلت فلما رأت ذلك زينب ابنة جحش أمرت ببناء فبني لها قالت وكان رسول الله صلى الله عليه وسلم إذا صلى انصرف إلى بنائه فبصر بالأبنية فقال ‏\"‏ ما هذا ‏\"‏‏.‏ قالوا بناء عائشة وحفصة وزينب‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آلبر أردن بهذا ما أنا بمعتكف ‏\"‏‏.‏ فرجع، فلما أفطر اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked his permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for her, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it was pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents ans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's Apostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" So he returned home. When the fasting month was over, he performed Itikar for ten days in the month of Shawwal.",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2317",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن عبد الله بن أبي بكر بن حزم، عن عمرة بنت عبد الرحمن، أنها أخبرته قالت، عائشة  رضى الله عنها  أنا فتلت، قلائد هدى رسول الله صلى الله عليه وسلم بيدى، ثم قلدها رسول الله صلى الله عليه وسلم بيديه، ثم بعث بها مع أبي، فلم يحرم على رسول الله صلى الله عليه وسلم شىء أحله الله له حتى نحر الهدى‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands of the Hadis (i.e. animals for sacrifice) of Allah's Apostle with my own hands. Then Allah's Apostle put them around their necks with his own hands, and sent them with my father (to Mecca). Nothing legal was regarded illegal for Allah's Apostle till the animals were slaughtered.",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2564",
      "source": " Sahih Bukhari ",
      "chapter": "Makaatib - كتاب المكاتب",
      "chapter_no": "50",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، أن بريرة، جاءت تستعين عائشة أم المؤمنين  رضى الله عنها  فقالت لها إن أحب أهلك أن أصب لهم ثمنك صبة واحدة فأعتقك فعلت‏.‏ فذكرت بريرة ذلك لأهلها، فقالوا لا‏.‏ إلا أن يكون ولاؤك لنا‏.‏ قال مالك قال يحيى فزعمت عمرة أن عائشة ذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ اشتريها وأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     Buraira went to Aisha, the mother of the faithful believers to seek her help in her emancipation Aisha said to her, \"If your masters agree, I will pay them your price in a lump sum and manumit you.\" Buraira mentioned that offer to her masters but they refused to sell her unless the Wala' was for them. `Aisha told Allah's Apostle about it. He said, \"Buy and manumit her as the Wala' is for the liberator.\"",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "2646",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عمرة بنت عبد الرحمن، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت رجل يستأذن في بيت حفصة‏.‏ قالت عائشة فقلت يا رسول الله أراه فلانا‏.‏ لعم حفصة من الرضاعة‏.‏ فقالت عائشة يا رسول الله، هذا رجل يستأذن في بيتك‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ أراه فلانا ‏\"‏‏.‏ لعم حفصة من الرضاعة‏.‏ فقالت عائشة لو كان فلان حيا  لعمها من الرضاعة  دخل على فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم، إن الرضاعة تحرم ما يحرم من الولادة ‏\"‏‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     That `Aisha the wife of the Prophet told her uncle that once, while the Prophet was in her house, she heard a man asking Hafsa's permission to enter her house. `Aisha said, \"I said, 'O Allah's Apostle! I think the man is Hafsa's foster uncle.' \" `Aisha added, \"O Allah's Apostle! There is a man asking the permission to enter your house.\" Allah's Apostle replied, \"I think the man is Hafsa's foster uncle.\" `Aisha said, \"If so-and-so were living (i.e. her foster uncle) would he be allowed to visit me?\" Allah's Apostle said, \"Yes, he would, as the foster relations are treated like blood relations (in marital affairs).",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2705",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن أبي الرجال، محمد بن عبد الرحمن أن أمه، عمرة بنت عبد الرحمن قالت سمعت عائشة  رضى الله عنها  تقول سمع رسول الله صلى الله عليه وسلم صوت خصوم بالباب عالية أصواتهما، وإذا أحدهما يستوضع الآخر، ويسترفقه في شىء وهو يقول والله لا أفعل‏.‏ فخرج عليهما رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين المتألي على الله لا يفعل المعروف ‏\"‏‏.‏ فقال أنا يا رسول الله، وله أى ذلك أحب‏.‏",
      "text_en": " Narrated Aisha:                     Once Allah's Apostle heard the loud voices of some opponents quarreling at the door. One of them was appealing to the other to deduct his debt and asking him to be lenient but the other was saying, \"By Allah I will not do so.\" Allah's Apostle went out to them and said, \"Who is the one who was swearing by Allah that he would not do a favor?\" That man said, \"I am that person, O Allah's Apostle! I will give my opponent whatever he wishes.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10959",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن يحيى، عن عمرة، عن عائشة  رضى الله عنها  قالت أتتها بريرة تسألها في كتابتها، فقالت إن شئت أعطيت أهلك ويكون الولاء لي‏.‏ فلما جاء رسول الله صلى الله عليه وسلم ذكرته ذلك قال النبي صلى الله عليه وسلم ‏\"‏ ابتاعيها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم على المنبر فقال ‏\"‏ ما بال أقوام يشترطون شروطا ليست في كتاب الله من اشترط شرطا ليس في كتاب الله فليس له، وإن اشترط مائة شرط ‏\"‏‏.‏",
      "text_en": " Narrated `Amra:                     Aisha said that Buraira came to seek her help in the writing of her emancipation. `Aisha said to her, \"If you wish, I will pay your masters (your price) and the wala' will be for me.\" When Allah's Apostle came, she told him about it. The Prophet said to her, \"Buy her (i.e. Buraira) and manumit her, for the Wala is for the one who manumits.\" Then Allah's Apostle ascended the pulpit and said, \"What about those people who stipulate conditions which are not in Allah's Laws? Whoever stipulates such conditions as are not in Allah's Laws, then those conditions are invalid even if he stipulated a hundred such conditions.\"",
      "chain": [
        "30026",
        "20005",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2952",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، أنها سمعت عائشة  رضى الله عنها  تقول خرجنا مع رسول الله صلى الله عليه وسلم لخمس ليال بقين من ذي القعدة، ولا نرى إلا الحج، فلما دنونا من مكة أمر رسول الله صلى الله عليه وسلم من لم يكن معه هدى إذا طاف بالبيت وسعى بين الصفا والمروة أن يحل‏.‏ قالت عائشة فدخل علينا يوم النحر بلحم بقر فقلت ما هذا فقال نحر رسول الله صلى الله عليه وسلم عن أزواجه‏.‏ قال يحيى فذكرت هذا الحديث للقاسم بن محمد فقال أتتك والله بالحديث على وجهه‏.‏",
      "text_en": " Narrated `Aisha:                     We set out in the company of Allah's Apostle five days before the end of Dhul Qa'da intending to perform Hajj only. When we approached Mecca Allah's Apostle ordered those who did not have the Hadi (i.e. an animal for sacrifice) with them, to perform the Tawaf around the Ka`ba, and between Safa and Marwa and then finish their Ihram. Beef was brought to us on the day of (i.e. the days of slaughtering) and I asked, \"What is this?\" Somebody said, Allah's Apostle has slaughtered (a cow) on behalf of his wives.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3105",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عمرة ابنة عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت إنسان يستأذن في بيت حفصة فقلت يا رسول الله، هذا رجل يستأذن في بيتك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أراه فلانا، لعم حفصة من الرضاعة، الرضاعة تحرم ما تحرم الولادة ‏\"‏‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     `Aisha, the wife of the Prophet told her that once Allah's Apostle was with her and she heard somebody asking permission to enter Hafsa's house. She said, \"O Allah's Apostle! This man is asking permission to enter your house.\" Allah's Apostle replied, \"I think he is so-and-so (meaning the foster uncle of Hafsa). What is rendered illegal because of blood relations, is also rendered illegal because of the corresponding foster-relations.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11455"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال قال الليث عن يحيى بن سعيد، عن عمرة، عن عائشة، رضى الله عنها قالت سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الأرواح جنود مجندة، فما تعارف منها ائتلف، وما تناكر منها اختلف ‏\"‏‏.‏ وقال يحيى بن أيوب حدثني يحيى بن سعيد بهذا‏.‏",
      "text_en": " Narrated Aishah (ra):                      I heard the Prophet (), \"Souls are like recruited troops: Those who are like qualities are inclined to each other, but those who have dissimilar qualities, differ.\"",
      "chain": [
        "20023",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "4308",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول لما جاء قتل ابن حارثة وجعفر بن أبي طالب وعبد الله بن رواحة  رضى الله عنهم  جلس رسول الله صلى الله عليه وسلم يعرف فيه الحزن  قالت عائشة  وأنا أطلع من صائر الباب  تعني من شق الباب  فأتاه رجل فقال أى رسول الله إن نساء جعفر قال وذكر بكاءهن، فأمره أن ينهاهن قال فذهب الرجل ثم أتى فقال قد نهيتهن‏.‏ وذكر أنه لم يطعنه قال فأمر أيضا فذهب ثم أتى فقال والله لقد غلبننا‏.‏ فزعمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فاحث في أفواههن من التراب ‏\"‏ قالت عائشة فقلت أرغم الله أنفك، فوالله ما أنت تفعل، وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated `Amra:                     I heard `Aisha saying, \"When the news of the martyrdom of Ibn Haritha, Ja`far bin Abi Talib and `Abdullah bin Rawaka reached, Allah's Apostle sat with sorrow explicit on his face.\" `Aisha added, \"I was then peeping through a chink in the door. A man came to him and said, \"O Allah's Apostle! The women of Ja`far are crying.' Thereupon the Prophet told him to forbid them to do so. So the man went away and returned saying, \"I forbade them but they did not listen to me.\" The Prophet ordered him again to go (and forbid them). He went again and came saying, 'By Allah, they overpowered me (i.e. did not listen to me).\" `Aisha said that Allah's Apostle said (to him), \"Go and throw dust into their mouths.\" Aisha added, \"I said, May Allah put your nose in the dust! By Allah, neither have you done what you have been ordered, nor have you relieved Allah's Apostle from trouble.\"",
      "chain": [
        "30367",
        "20259",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5155",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن أبي بكر، عن عمرة بنت عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها، وأنها سمعت صوت رجل يستأذن في بيت حفصة، قالت فقلت يا رسول الله هذا رجل يستأذن في بيتك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أراه فلانا ‏\"‏‏.‏ لعم حفصة من الرضاعة‏.‏ قالت عائشة لو كان فلان حيا، لعمها من الرضاعة دخل على فقال ‏\"‏ نعم الرضاعة تحرم ما تحرم الولادة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that while Allah's Apostle was with her, she heard a voice of a man asking permission to enter the house of Hafsa. `Aisha added: I said, \"O Allah's Apostle! This man is asking permission to enter your house.\" The Prophet said, \"I think he is so-and-so,\" naming the foster-uncle of Hafsa. `Aisha said, \"If so-and-so,\" naming her foster uncle, \"were living, could he enter upon me?\" The Prophet said, \"Yes, for foster suckling relations make all those things unlawful which are unlawful through corresponding birth (blood) relations.\"",
      "chain": [
        "30103",
        "20001",
        "11104",
        "11455"
      ]
    },
    {
      "hadith_no": "5629",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  قالت الضحية كنا نملح منه، فنقدم به إلى النبي صلى الله عليه وسلم بالمدينة فقال ‏\"‏ لا تأكلوا إلا ثلاثة أيام ‏\"‏‏.‏ وليست بعزيمة، ولكن أراد أن يطعم منه والله أعلم‏.‏",
      "text_en": " Narrated `Aisha:                     We used to salt some of the meat of sacrifice and present it to the Prophet at Medina. Once he said, \"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he wanted us to feed of it to others, Allah knows better.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5804",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال حدثني عبد ربه بن سعيد، عن عمرة، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان يقول للمريض ‏\"‏ بسم الله، تربة أرضنا‏.‏ بريقة بعضنا، يشفى سقيمنا بإذن ربنا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to say to the patient, \"In the Name of Allah The earth of our land and the saliva of some of us cure our patient.\"",
      "chain": [
        "30026",
        "20005",
        "11191",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5805",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني صدقة بن الفضل، أخبرنا ابن عيينة، عن عبد ربه بن سعيد، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يقول في الرقية ‏\"‏ تربة أرضنا، وريقة بعضنا، يشفى سقيمنا، بإذن ربنا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to read in his Ruqya, \"In the Name of Allah\" The earth of our land and the saliva of some of us cure our patient with the permission of our Lord.\" with a slight shower of saliva) while treating with a Ruqya.",
      "chain": [
        "30343",
        "20005",
        "11191",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6082",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني مالك، عن يحيى بن سعيد، قال أخبرني أبو بكر بن محمد، عن عمرة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما زال يوصيني جبريل بالجار حتى ظننت أنه سيورثه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said \"Gabriel continued to recommend me about treating the neighbors Kindly and politely so much so that I thought he would order me to make them as my heirs.",
      "chain": [
        "30103",
        "20001",
        "11062",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6876",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن عمرة، عن عائشة، قال النبي صلى الله عليه وسلم ‏\"‏ تقطع اليد في ربع دينار فصاعدا ‏\"‏‏.‏ تابعه عبد الرحمن بن خالد وابن أخي الزهري ومعمر عن الزهري‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The hand should be cut off for stealing something that is worth a quarter of a Dinar or more.\"",
      "chain": [
        "20164",
        "20150",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6877",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن ابن وهب، عن يونس، عن ابن شهاب، عن عروة بن الزبير، وعمرة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تقطع يد السارق في ربع دينار ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The hand of a thief should be cut off for stealing a quarter of a Dinar.\"",
      "chain": [
        "30103",
        "20029",
        "20475",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "6878",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا الحسين، عن يحيى، عن محمد بن عبد الرحمن الأنصاري، عن عمرة بنت عبد الرحمن، حدثته أن عائشة  رضى الله عنها  حدثتهم عن النبي صلى الله عليه وسلم قال ‏\"‏ يقطع في ربع دينار ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The hand should be cut off for stealing a quarter of a Dinar.\"",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11449",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا اعتكف يدني إلى رأسه فأرجله وكان لا يدخل البيت إلا لحاجة الإنسان ‏.‏",
      "text_en": " It is reported from 'A'isha that she observed:                      When the Messenger of Allah (may peace be upon him) was in I'tikaf, he inclined his head towards me and I combedhis hair, and he did not enter the house but for the natural calls (for relieving himself).",
      "chain": [
        "30399",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، قال أخبرنا الليث، عن ابن شهاب، عن عروة، وعمرة بنت عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم قالت إن كنت لأدخل البيت للحاجة والمريض فيه فما أسأل عنه إلا وأنا مارة وإن كان رسول الله صلى الله عليه وسلم ليدخل على رأسه وهو في المسجد فأرجله وكان لا يدخل البيت إلا لحاجة إذا كان معتكفا ‏.‏ وقال ابن رمح إذا كانوا معتكفين ‏.‏",
      "text_en": " 'Amra daughter of 'Abd al-Rahman reported:                      'A'isha, wife of the Apostle of Allah (may peace be upon him) observed: When I was (in I'tikaf), I entered the house for the call of nature, and while passing I inquired after the health of the sick (in the. family), and when the Messenger of Allah (may peace be upon him) was (in I'tikaf), he put out his head towards me, while he himself was in the mosque, and I combed his hair; and he did not enter the house except for the call of nature so long as he was In I'tikaf; and Ibn Rumh stated: As long as they (the Prophet and his wives) were among the observers of I'tikaf.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11013",
        "10511",
        "11455"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن ابن شهاب، عن عروة بن الزبير، وعمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن أم حبيبة بنت جحش - ختنة رسول الله صلى الله عليه وسلم وتحت عبد الرحمن بن عوف - استحيضت سبع سنين فاستفتت رسول الله صلى الله عليه وسلم في ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذه ليست بالحيضة ولكن هذا عرق فاغتسلي وصلي ‏\"‏ ‏.‏ قالت عائشة فكانت تغتسل في مركن في حجرة أختها زينب بنت جحش حتى تعلو حمرة الدم الماء ‏.‏ قال ابن شهاب فحدثت بذلك أبا بكر بن عبد الرحمن بن الحارث بن هشام فقال يرحم الله هندا لو سمعت بهذه الفتيا والله إن كانت لتبكي لأنها كانت لا تصلي ‏.‏",
      "text_en": " 'A'isha, the wife of the Messenger of Allah (may peace be upon him) reported:                      Umm Habiba b. Jahsh who was the sister-in-law of the Messenger of Allah (may peace be upon him) and the wife of 'Abd al-Rahman b. Auf, remained mustahada for seven years, and she, therefore, asked for the verdict of Shari'ah from the Messenger of Allah (may peace be upon him) about it The Messenger of Allah (may peace be upon him) said: This is not menstruation, but (blood from) a vein: so bathe yourself and offer prayer. 'A'isha said: She took a bath in the wash-tub placed in the apartment of her sister Zainab b. Jahsh, till the redness of the blood came over the water. Ibn Shihab said: I narrated it to Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham about it who observed: May Allah have mercy on Hinda! would that she listened to this verdict. By Lord, she wept for not offering prayer.",
      "chain": [
        "30491",
        "20029",
        "20377",
        "11013",
        "10511",
        "11455"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني أبو عمران، محمد بن جعفر بن زياد أخبرنا إبراهيم، - يعني ابن سعد - عن ابن شهاب، عن عمرة بنت عبد الرحمن، عن عائشة، قالت جاءت أم حبيبة بنت جحش إلى رسول الله صلى الله عليه وسلم وكانت استحيضت سبع سنين بمثل حديث عمرو بن الحارث إلى قوله تعلو حمرة الدم الماء ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " This hadith has been thus reported by another chain of transmitters:                      Umm Habiba b. Jahsh came to the Messenger of Allah (may peace be upon him) and she had been a mustahada for seven years, and the rest of the hadith was narrated like that of 'Amr b. al-Harith up to the words:\" There came the redness of the blood over water.\" and nothing was narrated beyond it.",
      "chain": [
        "20150",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا سفيان بن عيينة، عن الزهري، عن عمرة، عن عائشة، أن ابنة جحش، كانت تستحاض سبع سنين بنحو حديثهم ‏.‏",
      "text_en": " The hadith has been narrated by 'A'isha through another chain of transmitters (in these words):                      I The daughter of jahsh had been mustabida for seven years,\" and the rest of the hadith is the same (as mentioned above).",
      "chain": [
        "30170",
        "20005",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "445",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن يحيى، - وهو ابن سعيد - عن عمرة بنت عبد الرحمن، أنها سمعت عائشة، زوج النبي صلى الله عليه وسلم تقول لو أن رسول الله صلى الله عليه وسلم رأى ما أحدث النساء لمنعهن المسجد كما منعت نساء بني إسرائيل ‏.‏ قال فقلت لعمرة أنساء بني إسرائيل منعن المسجد قالت نعم ‏.‏",
      "text_en": " 'Amra, daughter of Abd al-Rahmin, reported:                      I heard 'A'isha, the wife of the Apostle of Allah (may peace be upon him). say: If the Messenger of Allah (may peace be upon him) had seen what new things the women have introduced (in their way of life) he would have definitely prevented them from going to the mosque, as the women of BaniIsra'il were prevented.",
      "chain": [
        "20160",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وإسحاق بن موسى الأنصاري، قالا حدثنا معن، عن مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء متلفعات بمروطهن ما يعرفن من الغلس ‏.‏ وقال الأنصاري في روايته متلففات ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to observe the morning prayer, and the women would go back wrapped in their mantles being unrecognisable because of the darkness before dawn. (Ishaq b. Musa) al-Ansari (one of the transmitters in this chain of narration) narrated\" wrapped\" (only) in his narration. (No mention was made of mantles.)",
      "chain": [
        "30395",
        "30410",
        "30112",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1718",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن محمد بن عبد الرحمن الأنصاري، سمع عمرة بنت عبد الرحمن، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر صلى ركعتين أقول هل يقرأ فيهما بفاتحة الكتاب ‏.‏",
      "text_en": " 'A'isha reported:                      When it was dawn, the Messenger of Allah (may peace be upon him) observed two rak'ahs, and I would say: Does he recite only the opening chapter of the Qur'an in it?",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا إسماعيل ابن علية، عن الوليد بن أبي هشام، عن أبي بكر بن محمد، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقرأ وهو قاعد فإذا أراد أن يركع قام قدر ما يقرأ إنسان أربعين آية ‏.‏",
      "text_en": " Alqama b. Waqqas reported:                      I asked 'A'isha how the Messenger of Allah (may peace be upon him) did in the two rak'ahs as he (observed them) sitting. She said: He would recite (the Qur'an) in them, and when he intended to bow, he would stand up and then bowed.",
      "chain": [
        "30201",
        "30123",
        "20436",
        "20208",
        "10622",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1996",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا محمد بن رمح، أخبرنا الليث، عن يحيى بن سعيد، عن عمرة، عن عائشة، أنها قالت كان الناس أهل عمل ولم يكن لهم كفاة فكانوا يكون لهم تفل فقيل لهم لو اغتسلتم يوم الجمعة ‏.‏",
      "text_en": " 'Aisha reported:                      The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday.",
      "chain": [
        "30490",
        "20023",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2049",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى بن حسان، حدثنا سليمان، بن بلال عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن أخت، لعمرة قالت أخذت ‏{‏ ق والقرآن المجيد‏}‏ من في رسول الله صلى الله عليه وسلم يوم الجمعة وهو يقرأ بها على المنبر في كل جمعة ‏.‏",
      "text_en": " 'Amra daughter of Abd al-Rahman reported on the authority of the sister of Amra, I memorised (surah) Qaf=surah l.):                     \" By the glorious Qur'an\" from the mouth of the Messenger of Allah (may peace be upon him) on Friday for he recited it on the pulpit on-every Friday.",
      "chain": [
        "30025",
        "20300",
        "20160",
        "11062",
        "11455"
      ]
    }
  ],
  "total_hadiths": 189
}