{
  "id": "11450",
  "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
  "full_name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Aslami",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3141",
      "name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24490",
      "name": "Yahya bin Rashid يحيى بن راشد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20224",
      "name": "Hmad bin Ms'd'h al-Tmymy حماد بن مسعدة التميمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20553",
      "name": "Safwan bin 'Isa al-Zhry صفوان بن عيسى الزهري أبو محمد البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20202",
      "name": "Makki bin Ibrahim bin Bashayr مكي بن إبراهيم بن بشير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-109",
      "hadith_no": "109",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من يقل على ما لم أقل فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     I heard the Prophet saying, \"Whoever (intentionally) ascribes to me what I have not said then (surely) let him occupy his seat in Hell-fire.\"",
      "usc_msa_ref": "109",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-497",
      "hadith_no": "497",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا المكي، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال كان جدار المسجد عند المنبر ما كادت الشاة تجوزها‏.‏",
      "text_en": " Narrated Salama:                     The distance between the wall of the mosque and the pulpit was hardly enough for a sheep to pass through.",
      "usc_msa_ref": "476",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-502",
      "hadith_no": "502",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، قال كنت آتي مع سلمة بن الأكوع فيصلي عند الأسطوانة التي عند المصحف‏.‏ فقلت يا أبا مسلم أراك تتحرى الصلاة عند هذه الأسطوانة‏.‏ قال فإني رأيت النبي صلى الله عليه وسلم يتحرى الصلاة عندها‏.‏",
      "text_en": " Narrated Yazid bin Al `Ubaid:                     I used to accompany Salama bin Al-Akwa` and he used to pray behind the pillar which was near the place where the Qur'ans were kept. I said, \"O Abu Muslim! I see you always seeking to pray behind this pillar.\" He replied, \"I saw Allah's Apostle always seeking to pray near that pillar.\"",
      "usc_msa_ref": "481",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-561",
      "hadith_no": "561",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا يزيد بن أبي عبيد، عن سلمة، قال كنا نصلي مع النبي صلى الله عليه وسلم المغرب إذا توارت بالحجاب‏.‏",
      "text_en": " Narrated Salama:                     We used to pray the Maghrib prayer with the Prophet when the sun disappeared from the horizon.",
      "usc_msa_ref": "536",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-1924",
      "hadith_no": "1924",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم بعث رجلا ينادي في الناس، يوم عاشوراء ‏\"‏ أن من أكل فليتم أو فليصم، ومن لم يأكل فلا يأكل ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once the Prophet ordered a person on 'Ashura' (the tenth of Muharram) to announce, \"Whoever has eaten, should not eat any more, but fast, and who has not eaten should not eat, but complete his fast (till the end of the day).",
      "usc_msa_ref": "147",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2289",
      "hadith_no": "2289",
      "source": "Sahih Bukhari",
      "chapter": "Transferance of a Debt from One Person to Another (Al-Hawaala) - كتاب الحوالات",
      "chapter_no": "38",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال كنا جلوسا عند النبي صلى الله عليه وسلم إذ أتي بجنازة، فقالوا صل عليها‏.‏ فقال ‏\"‏ هل عليه دين ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ فهل ترك شيئا ‏\"‏‏.‏ قالوا لا‏.‏ فصلى عليه ثم أتي بجنازة أخرى، فقالوا يا رسول الله، صل عليها‏.‏ قال ‏\"‏ هل عليه دين ‏\"‏‏.‏ قيل نعم‏.‏ قال ‏\"‏ فهل ترك شيئا ‏\"‏‏.‏ قالوا ثلاثة دنانير‏.‏ فصلى عليها، ثم أتي بالثالثة، فقالوا صل عليها‏.‏ قال ‏\"‏ هل ترك شيئا ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ فهل عليه دين ‏\"‏‏.‏ قالوا ثلاثة دنانير‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏‏.‏ قال أبو قتادة صل عليه يا رسول الله، وعلى دينه‏.‏ فصلى عليه‏.‏",
      "text_en": "      Narrated Salama bin Al-Akwa:                          Once, while we were sitting in the company of Prophet, a dead man was      brought. The Prophet was requested to lead the funeral prayer for the      deceased. He said, \"Is he in debt?\" The people replied in the      negative. He said, \"Has he left any wealth?\" They said, \"No.\" So, he      led his funeral prayer. Another dead man was brought and the people      said, \"O Allah's Apostle! Lead his funeral prayer.\" The Prophet said,      \"Is he in debt?\" They said, \"Yes.\" He said, \"Has he left any wealth?\"      They said, ''Three Dinars.\" So, he led the prayer. Then a third dead      man was brought and the people said (to the Prophet ), Please lead his     funeral prayer.\" He said, \"Has he left any wealth?\" They said, \"No.\"      He asked, \"Is he in debt?\" They said, (\"Yes! He has to pay) three      Diners.', He (refused to pray and) said, \"Then pray for your (dead)      companion.\" Abu Qatada said, \"O Allah's Apostle! Lead his funeral      prayer, and I will pay his debt.\" So, he led the prayer.",
      "usc_msa_ref": "488",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2295",
      "hadith_no": "2295",
      "source": "Sahih Bukhari",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بجنازة، ليصلي عليها، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا لا‏.‏ فصلى عليه، ثم أتي بجنازة أخرى، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏‏.‏ قال أبو قتادة على دينه يا رسول الله‏.‏ فصلى عليه‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     A dead person was brought to the Prophet so that he might lead the funeral prayer for him. He asked, \"Is he in debt?\" When the people replied in the negative, he led the funeral prayer. Another dead person was brought and he asked, \"Is he in debt?\" They said, \"Yes.\" He (refused to lead the prayer and) said, \"Lead the prayer of your friend.\" Abu Qatada said, \"O Allah's Apostle! I undertake to pay his debt.\" Allah's Apostle then led his funeral prayer.",
      "usc_msa_ref": "492",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2477",
      "hadith_no": "2477",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى نيرانا توقد يوم خيبر‏.‏ قال ‏\"‏ على ما توقد هذه النيران ‏\"‏‏.‏ قالوا على الحمر الإنسية‏.‏ قال ‏\"‏ اكسروها، وأهرقوها ‏\"‏‏.‏ قالوا ألا نهريقها ونغسلها قال ‏\"‏ اغسلوا ‏\"‏‏.‏ قال أبو عبد الله كان ابن أبي أويس يقول الحمر الأنسية بنصب الألف والنون",
      "text_en": " Narrated Salama bin Al-Akwa`:                     On the day of Khaibar the Prophet saw fires being lighted. He asked, \"Why are these fires being lighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and throw away their contents.\" The people said, \"Shall we throw away their contents and wash the pots (rather than break them)?\" He said, \"Wash them.\"",
      "usc_msa_ref": "657",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2484",
      "hadith_no": "2484",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا بشر بن مرحوم، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة  رضى الله عنه  قال خفت أزواد القوم وأملقوا، فأتوا النبي صلى الله عليه وسلم في نحر إبلهم فأذن لهم، فلقيهم عمر فأخبروه فقال ما بقاؤكم بعد إبلكم، فدخل على النبي صلى الله عليه وسلم فقال يا رسول الله ما بقاؤهم بعد إبلهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ناد في الناس فيأتون بفضل أزوادهم ‏\"‏‏.‏ فبسط لذلك نطع، وجعلوه على النطع‏.‏ فقام رسول الله صلى الله عليه وسلم فدعا وبرك عليه ثم دعاهم بأوعيتهم فاحتثى الناس حتى فرغوا، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله وأني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Once the journey food diminished and the people were reduced to poverty. They went to the Prophet and asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him about it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the Prophet and said, \"O Allah's Apostle! How would they survive after slaughtering their camels?\" Allah's Apostle ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A leather sheet was spread and al I the journey food was collected and heaped over it. Allah's Apostle stood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and they started taking from it till all of them got what was sufficient for them. Allah's Apostle then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
      "usc_msa_ref": "664",
      "chain": [
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2899",
      "hadith_no": "2899",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع  رضى الله عنه  قال مر النبي صلى الله عليه وسلم على نفر من أسلم ينتضلون فقال النبي صلى الله عليه وسلم ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا ارموا وأنا مع بني فلان ‏\"‏‏.‏ قال فأمسك أحد الفريقين بأيديهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم لا ترمون ‏\"‏‏.‏ قالوا كيف نرمي وأنت معهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ارموا فأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet passed by some people of the tribe of Bani Aslam who were practicing archery. The Prophet said, \"O Bani Isma`il ! Practice archery as your father Isma`il was a great archer. Keep on throwing arrows and I am with Bani so-and-so.\" So one of the parties ceased throwing. Allah's Apostle said, \"Why do you not throw?\" They replied, \"How should we throw while you are with them (i.e. on their side)?\" On that the Prophet said, \"Throw, and I am with all of you.\"",
      "usc_msa_ref": "148",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2960",
      "hadith_no": "2960",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، عن سلمة  رضى الله عنه  قال بايعت النبي صلى الله عليه وسلم ثم عدلت إلى ظل الشجرة، فلما خف الناس قال ‏\"‏ يا ابن الأكوع، ألا تبايع ‏\"‏‏.‏ قال قلت قد بايعت يا رسول الله‏.‏ قال ‏\"‏ وأيضا ‏\"‏‏.‏ فبايعته الثانية،‏.‏ فقلت له يا أبا مسلم، على أى شىء كنتم تبايعون يومئذ قال على الموت‏.‏",
      "text_en": " Narrated Yazid bin Ubaid:                     Salama said, \"I gave the Pledge of allegiance (Al-Ridwan) to Allah's Apostle and then I moved to the shade of a tree. When the number of people around the Prophet diminished, he said, 'O Ibn Al-Akwa` ! Will you not give to me the pledge of Allegiance?' I replied, 'O Allah's Apostle! I have already given to you the pledge of Allegiance.' He said, 'Do it again.' So I gave the pledge of allegiance for the second time.\" I asked 'O Abu Muslim! For what did you give he pledge of Allegiance on that day?\" He replied, \"We gave the pledge of Allegiance for death.\"",
      "usc_msa_ref": "207",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2975",
      "hadith_no": "2975",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال كان علي  رضى الله عنه  تخلف عن النبي صلى الله عليه وسلم في خيبر، وكان به رمد، فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم فخرج علي فلحق بالنبي صلى الله عليه وسلم، فلما كان مساء الليلة التي فتحها في صباحها، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية  أو قال ليأخذن  غدا رجل يحبه الله ورسوله  أو قال يحب الله ورسوله  يفتح الله عليه ‏\"‏‏.‏ فإذا نحن بعلي، وما نرجوه، فقالوا هذا علي، فأعطاه رسول الله صلى الله عليه وسلم، ففتح الله عليه‏.‏",
      "text_en": "      Narrated Salama bin Al-Akwa:                          Ali remained behind the Prophet during the battle of Khaibar as he way     suffering from some eye trouble but then he said, \"How should I stay      behind Allah's Apostle?\" So, he set out till he joined the Prophet. On     the eve of the day of the conquest of Khaibar, Allah's Apostle said,      \"(No doubt) I will give the flag or, tomorrow, a man whom Allah and      His Apostle love or who loves Allah and His apostle will take the      flag. Allah will bestow victory upon him.\" Suddenly 'Ali joined us      though we were not expecting him. The people said, \"Here is 'Ali. \"So,     Allah's Apostle gave the flag to him and Allah bestowed victory upon      him.",
      "usc_msa_ref": "219",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2982",
      "hadith_no": "2982",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا بشر بن مرحوم، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة  رضى الله عنه قال خفت أزواد الناس وأملقوا، فأتوا النبي صلى الله عليه وسلم في نحر إبلهم، فأذن لهم، فلقيهم عمر فأخبروه فقال ما بقاؤكم بعد إبلكم فدخل عمر على النبي صلى الله عليه وسلم فقال يا رسول الله ما بقاؤهم بعد إبلهم قال رسول الله صلى الله عليه وسلم ‏\"‏ ناد في الناس يأتون بفضل أزوادهم ‏\"‏‏.‏ فدعا وبرك عليه، ثم دعاهم بأوعيتهم، فاحتثى الناس حتى فرغوا، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله، وأني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Once the journey-food of the people ran short and they were in great need. So, they came to the Prophet to take his permission for slaughtering their camels, and he permitted them. Then `Umar met them and they informed him about it. He said, \"What will sustain you after your camels (are finished)?\" Then `Umar went to the Prophet and said, \"O Allah's Apostle! What will sustain them after their camels (are finished)?\" Allah's Apostle said, \"Make an announcement amongst the people that they should bring all their remaining food (to me).\" (They brought it and) the Prophet invoked Allah and asked for His Blessings for it. Then he asked them to bring their food utensils and the people started filling their food utensils with their hands till they were satisfied. Allah's Apostle then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
      "usc_msa_ref": "225",
      "chain": [
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3041",
      "hadith_no": "3041",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا المكي بن إبراهيم، أخبرنا يزيد بن أبي عبيد، عن سلمة، أنه أخبره قال خرجت من المدينة ذاهبا نحو الغابة، حتى إذا كنت بثنية الغابة لقيني غلام لعبد الرحمن بن عوف قلت ويحك، ما بك قال أخذت لقاح النبي صلى الله عليه وسلم‏.‏ قلت من أخذها قال غطفان وفزارة‏.‏ فصرخت ثلاث صرخات أسمعت ما بين لابتيها يا صباحاه، يا صباحاه‏.‏ ثم اندفعت حتى ألقاهم وقد أخذوها، فجعلت أرميهم وأقول أنا ابن الأكوع، واليوم يوم الرضع، فاستنقذتها منهم قبل أن يشربوا، فأقبلت بها أسوقها، فلقيني النبي صلى الله عليه وسلم فقلت يا رسول الله، إن القوم عطاش، وإني أعجلتهم أن يشربوا سقيهم، فابعث في إثرهم، فقال ‏\"‏ يا ابن الأكوع، ملكت فأسجح‏.‏ إن القوم يقرون في قومهم ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     I went out of Medina towards Al-Ghaba. When I reached the mountain path of Al-Ghaba, a slave of `Abdur-Rahman bin `Auf met me. I said to him, \"Woe to you! What brought you here?\" He replied, \"The she-camels of the Prophet have been taken away.\" I said, \"Who took them?\" He said, \"Ghatafan and Fazara.\" So, I sent three cries, \"O Sabaha-h ! O Sabahah !\" so loudly that made the people in between its (i.e. Medina's) two mountains hear me. Then I rushed till I met them after they had taken the camels away. I started throwing arrows at them saying, \"I am the son of Al-Akwa`\"; and today perish the mean people!\" So, I saved the she-camels from them before they (i.e. the robbers) could drink water. When I returned driving the camels, the Prophet met me, I said, \"O Allah's Apostle Those people are thirsty and I have prevented them from drinking water, so send some people to chase them.\" The Prophet said, \"O son of Al-Akwa`, you have gained power (over your enemy), so forgive (them). (Besides) those people are now being entertained by their folk.\"",
      "usc_msa_ref": "278",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3373",
      "hadith_no": "3373",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال مر النبي صلى الله عليه وسلم على نفر من أسلم ينتضلون، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا، وأنا مع بني فلان ‏\"‏‏.‏ قال فأمسك أحد الفريقين بأيديهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم لا ترمون ‏\"‏‏.‏ فقالوا يا رسول الله، نرمي وأنت معهم قال ‏\"‏ ارموا وأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet passed by some persons of the tribe of Aslam practicing archery (i.e. the throwing of arrows) Allah's Apostle said, \"O offspring of Ishmael! Practice archery (i.e. arrow throwing) as your father was a great archer (i.e. arrow-thrower). I am with (on the side of) the son of so-and-so-.\" Hearing that, one of the two teams stopped throwing. Allah's Apostle asked them, ' Why are you not throwing?\" They replied, \"O Allah's Apostle! How shall we throw when you are with the opposite team?\" He said, \"Throw, for I am with you all.\"",
      "usc_msa_ref": "592",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3547",
      "hadith_no": "3547",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن يزيد بن أبي عبيد، حدثنا سلمة  رضى الله عنه  قال خرج رسول الله صلى الله عليه وسلم على قوم من أسلم، يتناضلون بالسوق، فقال ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا، وأنا مع بني فلان ‏\"‏‏.‏ لأحد الفريقين، فأمسكوا بأيديهم فقال ‏\"‏ ما لهم ‏\"‏‏.‏ قالوا وكيف نرمي وأنت مع بني فلان‏.‏ قال ‏\"‏ ارموا وأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Allah's Apostle passed by some people from the tribe of Aslam practicing archery. He said, \"O children of Ishmael! Throw (arrows), for your father was an archer. I am on the side of Bani so-andso,\" meaning one of the two teams. The other team stopped throwing, whereupon the Prophet said, \"What has happened to them?\" They replied, \"How shall we throw while you are with Bani so-andso?\" He said, \"Throw for I am with all of you.\"",
      "usc_msa_ref": "710",
      "chain": [
        "30175",
        "20031",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-3749",
      "hadith_no": "3749",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة، قال كان علي قد تخلف عن النبي صلى الله عليه وسلم في خيبر وكان به رمد فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم فخرج علي فلحق بالنبي صلى الله عليه وسلم، فلما كان مساء الليلة التي فتحها الله في صباحها، قال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية  أو ليأخذن الراية  غدا رجلا يحبه الله ورسوله  أو قال يحب الله ورسوله  يفتح الله عليه ‏\"‏‏.‏ فإذا نحن بعلي وما نرجوه، فقالوا هذا علي‏.‏ فأعطاه رسول الله صلى الله عليه وسلم ففتح الله عليه‏.‏",
      "text_en": " Narrated Salama:                     `Ali happened to stay behind the Prophet and (did not join him) during the battle of Khaibar for he was having eye trouble. Then he said, \"How could I remain behind Allah's Apostle?\" So `Ali set out following the Prophet , When it was the eve of the day in the morning of which Allah helped (the Muslims) to conquer it, Allah's Apostle said, \"I will give the flag (to a man), or tomorrow a man whom Allah and His Apostle love will take the flag,\" or said, \"A man who loves Allah and His Apostle; and Allah will grant victory under his leadership.\" Suddenly came `Ali whom we did not expect. The people said, \"This is `Ali.\" Allah's Apostle gave him the flag and Allah granted victory under his leadership.",
      "usc_msa_ref": "52",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4220",
      "hadith_no": "4220",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال قلت لسلمة بن الأكوع على أى شىء بايعتم رسول الله صلى الله عليه وسلم يوم الحديبية‏.‏ قال على الموت‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     I said to Salama bin Al-Akwa`, \"For what did you give the Pledge of allegiance to Allah's Apostle on the day of Al-Hudaibiya?\" He replied, \"For death (in the Cause of Islam.).",
      "usc_msa_ref": "487",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "id": "sahih-bukhari-4243",
      "hadith_no": "4243",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى، وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد  قال  فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم قلت من أخذها قال غطفان‏.‏ قال فصرخت ثلاث صرخات  يا صباحاه  قال فأسمعت ما بين لابتى المدينة، ثم اندفعت على وجهي حتى أدركتهم وقد أخذوا يستقون من الماء، فجعلت أرميهم بنبلي، وكنت راميا، وأقول أنا ابن الأكوع، اليوم يوم الرضع‏.‏ وأرتجز حتى استنقذت اللقاح منهم، واستلبت منهم ثلاثين بردة، قال وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله قد حميت القوم الماء وهم عطاش، فابعث إليهم الساعة‏.‏ فقال ‏\"‏ يا ابن الأكوع، ملكت فأسجح ‏\"‏‏.‏ قال ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once I went (from Medina) towards (Al-Ghaba) before the first Adhan of the Fajr Prayer. The shecamels of Allah's Apostle used to graze at a place called Dhi-Qarad. A slave of `Abdur-Rahman bin `Auf met me (on the way) and said, \"The she-camels of Allah's Apostle had been taken away by force.\" I asked, \"Who had taken them?\" He replied \"(The people of) Ghatafan.\" I made three loud cries (to the people of Medina) saying, \"O Sabahah!\" I made the people between the two mountains of Medina hear me. Then I rushed onward and caught up with the robbers while they were watering the camels. I started throwing arrows at them as I was a good archer and I was saying, \"I am the son of Al-Akwa`, and today will perish the wicked people.\" I kept on saying like that till I restored the shecamels (of the Prophet), I also snatched thirty Burda (i.e. garments) from them. Then the Prophet and the other people came there, and I said, \"O Allah's Prophet! I have stopped the people (of Ghatafan) from taking water and they are thirsty now. So send (some people) after them now.\" On that the Prophet said, \"O the son of Al-Akwa`! You have over-powered them, so forgive them.\" Then we all came back and Allah's Apostle seated me behind him on his she-camel till we entered Medina.",
      "usc_msa_ref": "507",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4245",
      "hadith_no": "4245",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر يا عامر ألا تسمعنا من هنيهاتك‏.‏ وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما أبقينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أبينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏‏.‏ قال رجل من القوم وجبت يا نبي الله، لولا أمتعتنا به‏.‏ فأتينا خيبر، فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله تعالى فتحها عليهم، فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة، فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا لحم حمر الإنسية‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله، أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر قصيرا فتناول به ساق يهودي ليضربه، ويرجع ذباب سيفه، فأصاب عين ركبة عامر، فمات منه قال فلما قفلوا، قال سلمة رآني رسول الله صلى الله عليه وسلم وهو آخذ بيدي، قال ‏\"‏ ما لك ‏\"‏‏.‏ قلت له فداك أبي وأمي، زعموا أن عامرا حبط عمله‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين  وجمع بين إصبعيه  إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏‏.‏ حدثنا قتيبة حدثنا حاتم قال ‏\"‏ نشأ بها ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     We went out to Khaibar in the company of the Prophet. While we were proceeding at night, a man from the group said to 'Amir, \"O 'Amir! Won't you let us hear your poetry?\" 'Amir was a poet, so he got down and started reciting for the people poetry that kept pace with the camels' footsteps, saying:-- \"O Allah! Without You we Would not have been guided On the right path Neither would be have given In charity, nor would We have prayed. So please forgive us, what we have committed (i.e. our defects); let all of us Be sacrificed for Your Cause And send Sakina (i.e. calmness) Upon us to make our feet firm When we meet our enemy, and If they will call us towards An unjust thing, We will refuse. The infidels have made a hue and Cry to ask others' help Against us.\" The Prophet on that, asked, \"Who is that (camel) driver (reciting poetry)?\" The people said, \"He is 'Amir bin Al-Akwa`.\" Then the Prophet said, \"May Allah bestow His Mercy on him.\" A man amongst the people said, \"O Allah's Prophet! has (martyrdom) been granted to him. Would that you let us enjoy his company longer.\" Then we reached and besieged Khaibar till we were afflicted with severe hunger. Then Allah helped the Muslims conquer it (i.e. Khaibar). In the evening of the day of the conquest of the city, the Muslims made huge fires. The Prophet said, \"What are these fires? For cooking what, are you making the fire?\" The people replied, \"(For cooking) meat.\" He asked, \"What kind of meat?\" They (i.e. people) said, \"The meat of donkeys.\" The Prophet said, \"Throw away the meat and break the pots!\" Some man said, \"O Allah's Apostle! Shall we throw away the meat and wash the pots instead?\" He said, \"(Yes, you can do) that too.\" So when the army files were arranged in rows (for the clash), 'Amir's sword was short and he aimed at the leg of a Jew to strike it, but the sharp blade of the sword returned to him and injured his own knee, and that caused him to die. When they returned from the battle, Allah's Apostle saw me (in a sad mood). He took my hand and said, \"What is bothering you?\" I replied, \"Let my father and mother be sacrificed for you! The people say that the deeds of 'Amir are lost.\" The Prophet said, \"Whoever says so, is mistaken, for 'Amir has got a double reward.\" The Prophet raised two fingers and added, \"He (i.e. Amir) was a persevering struggler in the Cause of Allah and there are few 'Arabs who achieved the like of (good deeds) 'Amir had done.\"",
      "usc_msa_ref": "509",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4255",
      "hadith_no": "4255",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، قال رأيت أثر ضربة في ساق سلمة، فقلت يا أبا مسلم، ما هذه الضربة قال هذه ضربة أصابتني يوم خيبر، فقال الناس أصيب سلمة‏.‏ فأتيت النبي صلى الله عليه وسلم فنفث فيه ثلاث نفثات، فما اشتكيتها حتى الساعة‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     I saw the trace of a wound in Salama's leg. I said to him, \"O Abu Muslim! What is this wound?\" He said, \"This was inflicted on me on the day of Khaibar and the people said, 'Salama has been wounded.' Then I went to the Prophet and he puffed his saliva in it (i.e. the wound) thrice., and since then I have not had any pain in it till this hour.\"",
      "usc_msa_ref": "517",
      "chain": [
        "20202",
        "11450"
      ]
    },
    {
      "id": "sahih-bukhari-4258",
      "hadith_no": "4258",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة، رضى الله عنه قال كان علي  رضى الله عنه  تخلف عن النبي صلى الله عليه وسلم في خيبر، وكان رمدا فقال أنا أتخلف عن النبي صلى الله عليه وسلم فلحق، فلما بتنا الليلة التي فتحت قال ‏\"‏ لأعطين الراية غدا  أو ليأخذن الراية غدا  رجل يحبه الله ورسوله، يفتح عليه ‏\"‏‏.‏ فنحن نرجوها فقيل هذا علي، فأعطاه ففتح عليه‏.‏",
      "text_en": " Narrated Salama:                     `Ali remained behind the Prophet during the Ghazwa of Khaibar as he was suffering from eye trouble. He then said, \"(How can) I remain behind the Prophet ,\" and followed him. So when he slept on the night of the conquest of Khaibar, the Prophet said, \"I will give the flag tomorrow, or tomorrow the flag will be taken by a man who is loved by Allah and His Apostle , and (Khaibar) will be conquered through him, (with Allah's help)\" While every one of us was hopeful to have the flag, it was said, \"Here is `Ali\" and the Prophet gave him the flag and Khaibar was conquered through him (with Allah's Help).",
      "usc_msa_ref": "520",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4315",
      "hadith_no": "4315",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع، يقول غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وخرجت فيما يبعث من البعوث تسع غزوات، مرة علينا أبو بكر، ومرة علينا أسامة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     I fought in seven Ghazwat (i.e. battles) along with the Prophet and fought in nine battles, fought by armies dispatched by the Prophet. Once Abu Bakr was our commander and at another time, Usama was our commander. Narrated Salama in another narration: I fought seven Ghazwat (i.e. battles) along with the Prophet and also fought in nine battles, fought by armies sent by the Prophet . Once Abu Bakr was our commander and another time, Usama was (our commander).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4316",
      "hadith_no": "4316",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عمر بن حفص بن غياث حدثنا أبي، عن يزيد بن أبي عبيد، قال سمعت سلمة، يقول غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وخرجت فيما يبعث من البعث تسع غزوات، علينا مرة أبو بكر، ومرة أسامة‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30204",
        "20317",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4318",
      "hadith_no": "4318",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حماد بن مسعدة، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات‏.‏ فذكر خيبر والحديبية ويوم حنين ويوم القرد‏.‏ قال يزيد ونسيت بقيتهم‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     Salama bin Al-Akwa` said, \"I fought in seven Ghazwat along with the Prophet.\" He then mentioned Khaibar, Al-Hudaibiya, the day (i.e. battle) of Hunain and the day of Al-Qurad. I forgot the names of the other Ghazwat.",
      "usc_msa_ref": "571",
      "chain": [
        "30561",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5555",
      "hadith_no": "5555",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثني يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال لما أمسوا يوم فتحوا خيبر أوقدوا النيران، قال النبي صلى الله عليه وسلم ‏\"‏ على ما أوقدتم هذه النيران ‏\"‏‏.‏ قالوا لحوم الحمر الإنسية‏.‏ قال ‏\"‏ أهريقوا ما فيها، واكسروا قدورها ‏\"‏‏.‏ فقام رجل من القوم فقال نهريق ما فيها ونغسلها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أو ذاك ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqwa':                     In the evening of the day of the conquest of Khaibar, the army made fires (for cooking). The Prophet said, \"For what have you made these fires?\" They said, \"For cooking the meat of domestic donkeys.\" He said, \"Throw away what is in the cooking pots and break the pots.\" A man from the people got up and said, \"Shall we throw the contents of the cooking pots and then wash the pots (instead of breaking them)?\" The Prophet said, \"Yes, you can do either.'",
      "usc_msa_ref": "405",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5628",
      "hadith_no": "5628",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال قال النبي صلى الله عليه وسلم ‏\"‏ من ضحى منكم فلا يصبحن بعد ثالثة وفي بيته منه شىء ‏\"‏‏.‏ فلما كان العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام الماضي قال ‏\"‏ كلوا وأطعموا وادخروا فإن ذلك العام كان بالناس جهد فأردت أن تعينوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqua':                     The Prophet said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after three days.\" When it was the next year the people said, \"O Allah's Apostle! Shall we do as we did last year?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having a hard time and I wanted you to help (the needy).",
      "usc_msa_ref": "476",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-6218",
      "hadith_no": "6218",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك، قال وكان عامر رجلا شاعرا، فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ فقال ‏\"‏ يرحمه الله ‏\"‏‏.‏ فقال رجل من القوم وجبت يا نبي الله، لو أمتعتنا به‏.‏ قال فأتينا خيبر فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله فتحها عليهم، فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران، على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا على لحم حمر إنسية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهرقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر فيه قصر، فتناول به يهوديا ليضربه، ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه، فلما قفلوا قال سلمة رآني رسول الله صلى الله عليه وسلم شاحبا‏.‏ فقال لي ‏\"‏ ما لك ‏\"‏‏.‏ فقلت فدى لك أبي وأمي زعموا أن عامرا حبط عمله‏.‏ قال ‏\"‏ من قاله ‏\"‏‏.‏ قلت قاله فلان وفلان وفلان وأسيد بن الحضير الأنصاري‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين  وجمع بين إصبعيه  إنه لجاهد مجاهد، قل عربي نشأ بها مثله ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqwa:                     We went out with Allah's Apostle to Khaibar and we travelled during the night. A man amongst the people said to 'Amir bin Al-Aqwa', \"Won't you let us hear your poetry?\" 'Amir was a poet, and so he got down and started (chanting Huda) reciting for the people, poetry that keep pace with the camel's foot steps, saying, \"O Allah! Without You we would not have been guided on the right path, neither would we have given in charity, nor would we have prayed. So please forgive us what we have committed. Let all of us be sacrificed for Your cause and when we meet our enemy, make our feet firm and bestow peace and calmness on us and if they (our enemy) will call us towards an unjust thing we will refuse. The infidels have made a hue and cry to ask others help against us. Allah's Apostle said, \"Who is that driver (of the camels)?\" They said, \"He is 'Amir bin Al-Aqwa.\"' He said, \"May Allah bestow His mercy on him.\" A man among the people said, Has Martyrdom been granted to him, O Allah's Prophet! Would that you let us enjoy his company longer.\" We reached (the people of) Khaibar and besieged them till we were stricken with severe hunger but Allah helped the Muslims conquer Khaibar. In the evening of its conquest the people made many fires. Allah's Apostle asked, \"What are those fires? For what are you making fires?\" They said, \"For cooking meat.\" He asked, \"What kind of meat?\" They said, \"Donkeys' meat.\" Allah's Apostle said, \"Throw away the meat and break the cooking pots.\" A man said, O Allah's Apostle! Shall we throw away the meat and wash the cooking pots?\" He said, \"You can do that too.\" When the army files aligned in rows (for the battle), 'Amir's sword was a short one, and while attacking a Jew with it in order to hit him, the sharp edge of the sword turned back and hit 'Amir's knee and caused him to die. When the Muslims returned (from the battle), Salama said, Allah's Apostle saw me pale and said, 'What is wrong with you?\"' I said, \"Let my parents be sacrificed for you! The people claim that all the deeds of Amir have been annulled.\" The Prophet asked, \"Who said so?\" I replied, \"So-and-so and soand- so and Usaid bin Al-Hudair Al-Ansari said, 'Whoever says so is telling a lie. Verily, 'Amir will have double reward.\"' (While speaking) the Prophet put two of his fingers together to indicate that, and added, \"He was really a hard-working man and a Mujahid (devout fighter in Allah's Cause) and rarely have there lived in it (i.e., Medina or the battle-field) an \"Arab like him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-6975",
      "hadith_no": "6975",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا المكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، عن سلمة، قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر فقال رجل منهم أسمعنا يا عامر من هنيهاتك‏.‏ فحدا بهم، فقال النبي صلى الله عليه وسلم ‏\"‏ من السائق ‏\"‏ قالوا عامر‏.‏ فقال ‏\"‏ رحمه الله ‏\"‏‏.‏ فقالوا يا رسول الله هلا أمتعتنا به‏.‏ فأصيب صبيحة ليلته فقال القوم حبط عمله، قتل نفسه‏.‏ فلما رجعت وهم يتحدثون أن عامرا حبط عمله، فجئت إلى النبي صلى الله عليه وسلم فقلت يا نبي الله فداك أبي وأمي، زعموا أن عامرا حبط عمله‏.‏ فقال ‏\"‏ كذب من قالها، إن له لأجرين اثنين، إنه لجاهد مجاهد، وأى قتل يزيده عليه ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     We went out with the Prophet to Khaibar. A man (from the companions) said, \"O 'Amir! Let us hear some of your Huda (camel-driving songs.)\" So he sang some of them (i.e. a lyric in harmony with the camels walk). The Prophet said, \"Who is the driver (of these camels)?\" They said, \"Amir.\" The Prophet said, \"May Allah bestow His Mercy on him !\" The people said, \"O Allah's Apostle! Would that you let us enjoy his company longer!\" Then 'Amir was killed the following morning. The people said, \"The good deeds of 'Amir are lost as he has killed himself.\" I returned at the time while they were talking about that. I went to the Prophet and said, \"O Allah's Prophet! Let my father be sacrificed for you! The people claim that 'Amir's good deeds are lost.\" The Prophet said, \"Whoever says so is a liar, for 'Amir will have a double reward as he exerted himself to obey Allah and fought in Allah's Cause. No other way of killing would have granted him greater reward.\"",
      "usc_msa_ref": "29",
      "chain": [
        "20202",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7176",
      "hadith_no": "7176",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو‏.‏ وعن يزيد بن أبي عبيد قال لما قتل عثمان بن عفان خرج سلمة بن الأكوع إلى الربذة، وتزوج هناك امرأة وولدت له أولادا، فلم يزل بها حتى قبل أن يموت بليال، فنزل المدينة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your heels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but Allah's Apostle allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: When `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- Rabadha and married there and begot children, and he stayed there till a few nights before his death when he came to Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7294",
      "hadith_no": "7294",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، قال بايعنا النبي صلى الله عليه وسلم تحت الشجرة فقال لي ‏\"‏ يا سلمة ألا تبايع ‏\"‏‏.‏ قلت يا رسول الله قد بايعت في الأول‏.‏ قال ‏\"‏ وفي الثاني ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     We gave the oath of allegiance to the Prophet under the tree. He said to me, \"O Salama! Will you not give the oath of allegiance?\" I replied, \"O Allah's Apostle! I have already given the oath of allegiance for the first time.\" He said, (Give it again) for the second time.",
      "usc_msa_ref": "315",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7351",
      "hadith_no": "7351",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن يزيد بن أبي عبيد، حدثنا سلمة بن الأكوع، أن رسول الله صلى الله عليه وسلم قال لرجل من أسلم ‏\"‏ أذن في قومك  أو في الناس  يوم عاشوراء أن من أكل فليتم بقية يومه، ومن لم يكن أكل فليصم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Allah's Apostle said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the people) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the rest of the day; and whoever has not eaten anything, should complete his fast.' \"",
      "usc_msa_ref": "370",
      "chain": [
        "30175",
        "20031",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-509-2",
      "hadith_no": "509",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، - واللفظ لابن المثنى - قال إسحاق أخبرنا وقال ابن المثنى، حدثنا حماد بن مسعدة، - عن يزيد، - يعني ابن أبي عبيد - عن سلمة، - وهو ابن الأكوع أنه كان يتحرى موضع مكان المصحف يسبح فيه ‏.‏ وذكر أن رسول الله صلى الله عليه وسلم كان يتحرى ذلك المكان وكان بين المنبر والقبلة قدر ممر الشاة ‏.‏",
      "text_en": " Salama b. Akwa' reported:                      He sought the place (in the mosque) where the copies of the Qur'an were kept and glorified Allah there, and the narrator made a mention that the Messenger of Allah (may peace be upon him) sought that place and that was between the pulpit and the qibla-a place where a goat could pass.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30170",
        "30312",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-1472",
      "hadith_no": "1472",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أن رسول الله صلى الله عليه وسلم كان يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ‏.‏",
      "text_en": " Salama b. al-Akwa' reported that the Messenger of Allah (may peace be upon him) used to say the evening prayer when the sun had set and disappeared (behind the horizon).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-2416",
      "hadith_no": "2416",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - يعني ابن أبي عبيد - قال سمعت عميرا، مولى آبي اللحم قال أمرني مولاى أن أقدد، لحما فجاءني مسكين فأطعمته منه فعلم بذلك مولاى فضربني فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فدعاه ‏.‏ فقال ‏\"‏ لم ضربته ‏\"‏ ‏.‏ فقال يعطي طعامي بغير أن آمره ‏.‏ فقال ‏\"‏ الأجر بينكما ‏\"‏ ‏.‏",
      "text_en": " 'Umair, the freed slave of Abi'l-Lahm, said:                      My master commanded me to cut some meat in strips; (as I was doing it) a poor man came to me and I gave him some of it to eat. My master came to know of that, and he beat me. I came to the Messenger of Allah (may peace be upon him) and narrated it to him. He (the Holy Prophet) summoned him and said: Why did you beat him? He (Abi'l-Lahm) said: He gives away my food without being commanded to do so. Upon this he (the Holy Prophet) sbid: The reward would be shared by you two.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "id": "sahih-muslim-2724",
      "hadith_no": "2724",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، - رضى الله عنه - أنه قال بعث رسول الله صلى الله عليه وسلم رجلا من أسلم يوم عاشوراء فأمره أن يؤذن في الناس ‏\"‏ من كان لم يصم فليصم ومن كان أكل فليتم صيامه إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Salama b. al-Akwa' (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) sent a person of the tribe of Aslam on the day of 'Ashura and commanded him to declare to the people to observe fast in case they had not observed it, and to complete fast till evening if they had taken food",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4778",
      "hadith_no": "4778",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد - قال - فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم فقلت من أخذها قال غطفان قال فصرخت ثلاث صرخات يا صباحاه ‏.‏ قال فأسمعت ما بين لابتى المدينة ثم اندفعت على وجهي حتى أدركتهم بذي قرد وقد أخذوا يسقون من الماء فجعلت أرميهم بنبلي وكنت راميا وأقول أنا ابن الأكوع واليوم يوم الرضع فأرتجز حتى استنقذت اللقاح منهم واستلبت منهم ثلاثين بردة - قال - وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله إني قد حميت القوم الماء وهم عطاش فابعث إليهم الساعة فقال ‏\"‏ يا ابن الأكوع ملكت فأسجح ‏\"‏ ‏.‏ - قال - ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة ‏.‏",
      "text_en": " It has been narrated on the authority of Yazid b. Abu 'Ubaid who said that he heard Salama b. al-Akwa' say:                      I went out before the Adhan for the morning prayer had been delivered. The milch she-camels of the Messenger of Allah (may peace be upon him) were grazing at Dhu Qarad. 'Abd al-Rahman b. Auf's slave met me and said: The milch she-camels of the Messenger of Allah (may peace be upon him) had been taken away. I said: Who has taken them away? He said: (the people belonging to the tribe of) Ghatafan. I cried thrice: Help! I made the whole city between the two lavas hear my cry. Then I ran straight in their pursuit until I overtook them at Dhu Qarad where they were just going to water their animals. I, being an archer, began to shoot them with my arrows and was saying: I am the son of al-Akwa'. And today is the day when the cowards will meet their doom. I continued to chant until I rescued the milch she-camels from them, and snatched from them thirty mantles. Now, the Messenger of Allah (may peace be upon him) and some other people came along. I said: Prophet of Allah, I have prevented them from water while they were thirsty. So you should send a force (to punish them). He (the Holy Prophet) said: Ibn al-Akwa', you have taken (what, you have taken). Now let them go. Then we returned and the Messenger of Allah (may peace be upon him) made me mount behind him on his she-camel until we entered Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4800",
      "hadith_no": "4800",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - وهو ابن أبي عبيد قال سمعت سلمة، يقول غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات وخرجت فيما يبعث من البعوث تسع غزوات مرة علينا أبو بكر ومرة علينا أسامة بن زيد ‏.‏",
      "text_en": " It has been narrated on the authority of Salama who said:                      I joined seven military expeditions led by the Messenger of Allah himself (may peace be upon him), and nine expeditions which he sent out once under Abu Bakr and once under Usama b. Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-4932",
      "hadith_no": "4932",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو ‏.‏",
      "text_en": " It has been narrated by Salama b. al-Akwa' that he visited al-Hajjaj who said to him:                      O son of al-Akwa', you have turned apostate and have come to live again in the desert with the Bedouins (after your migration). He said: No, but the Messenger of Allah (may peace be upon him) has permitted me to live in the desert.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5130",
      "hadith_no": "5130",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن عباد، وقتيبة بن سعيد، قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر ثم إن الله فتحها عليهم فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ قالوا على لحم ‏.‏ قال ‏\"‏ على أى لحم ‏\"‏ ‏.‏ قالوا على لحم حمر إنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " Salama b. Akwa' reported:                      We went to Khaibar with Allah's Messenger (may peace be upon him). Then Allah granted (us) victory over them. On that very evening of the day when they had been granted victory, they lit many fires. Thereupon Allah's Messenger (may peace be upon him) said: What are those fires and what for those have been lit? They said: (These have been lit) for (cooking) the flesh. Thereupon he said: Of what flesh? They said: For the flesh of the domestic asses. Thereupon Allah's Messenger (may peace bo upon him) said: Throw that away and break them (the earthen pots in which the fiesa was being cooked). A person said: Messenger of Allah, should we throw it away and wash them (the cooking pots)? He said: You may do so.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5222",
      "hadith_no": "5222",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، بن الأكوع أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ضحى منكم فلا يصبحن في بيته بعد ثالثة شيئا ‏\"‏ ‏.‏ فلما كان في العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام أول فقال ‏\"‏ لا إن ذاك عام كان الناس فيه بجهد فأردت أن يفشو فيهم ‏\"‏ ‏.‏",
      "text_en": " Salama b. al-Akwa' reported Allah's Messenger (way peace be upon him) having said:                      He who sacrifices (animal) among you nothing should be left in his house (out of its flesh) on the morning of the third day. When it was the next year they (his Companions) said: Should we do this year as we did daring the previous year? Thereupon he said: Don't do that, for that was a year when the people were hard pressed (on account of poverty). so I wanted that the (flesh) might be distributed amongst them.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-6377",
      "hadith_no": "6377",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، قال كان علي قد تخلف عن النبي صلى الله عليه وسلم في خيبر وكان رمدا فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم ‏.‏ فخرج علي فلحق بالنبي صلى الله عليه وسلم فلما كان مساء الليلة التي فتحها الله في صباحها قال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية - أو ليأخذن بالراية - غدا رجل يحبه الله ورسوله أو قال يحب الله ورسوله يفتح الله عليه ‏\"‏ ‏.‏ فإذا نحن بعلي وما نرجوه فقالوا هذا علي ‏.‏ فأعطاه رسول الله صلى الله عليه وسلم الراية ففتح الله عليه ‏.‏",
      "text_en": " Salama b. Akwa' reported that it was 'Ali whom Allah's Apostle (may peace be upon him) left behind him (in the charge of his family and the Islamic State) on the occasion of the campaign of Khaibar, and his eyes were inflamed and he said:                      Is it for me to remain behind Allah's Messenger (may peace be upon him)? So he went forth and rejoined Allah's Apostle (may peace be upon him) and on the evening of that night (after which) next morning Allah granted victory. Allah's Messenger (may peace be upon him) said: I will certainly give this standard to a man whom Allah and His Messenger love. or he said: Who loves Allah or His Messenger and Allah will grant him victory through him, and, lo, we saw 'Ali whom we least expected (to be present on that occasion). They (the Companions) said: Here is 'Ali. Thereupon Allah's Messenger (may peace be upon hin) gave him the standard. Allah granted victory at his hand.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-417",
      "hadith_no": "417",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن علي، عن صفوان بن عيسى، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان النبي صلى الله عليه وسلم يصلي المغرب ساعة تغرب الشمس إذا غاب حاجبها ‏.‏",
      "text_en": " Salamah b. al-Akwa' said:                      The Prophet (ﷺ) used to say the Maghrib prayer immediately after the sun had set when its upper side would disappear.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20553",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-1082",
      "hadith_no": "1082",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان بين منبر رسول الله صلى الله عليه وسلم وبين الحائط كقدر ممر الشاة ‏.‏",
      "text_en": " Salamah b. al-Akwa' said:                      The space between the pulpit of the Messenger of Allah (ﷺ) and the wall (of the mosque) was such that a goat could pass.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-3894",
      "hadith_no": "3894",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، أخبرنا مكي بن إبراهيم، حدثنا يزيد بن أبي عبيد، قال رأيت أثر ضربة في ساق سلمة فقلت ما هذه قال أصابتني يوم خيبر فقال الناس أصيب سلمة فأتي بي رسول الله صلى الله عليه وسلم فنفث في ثلاث نفثات فما اشتكيتها حتى الساعة ‏.‏",
      "text_en": " Yazid b. Abi ‘Ubaid said :                      I saw a sign of injury in the shin of Salamah. I asked : What is this ? He replied : I was afflicted. I was afflicted by it on the day of Khaibar. The people said : Salamah has been afflicted. I was then brought to the Prophet (ﷺ). He blew on me three times. I did not feel any pain up till now.",
      "usc_msa_ref": "",
      "chain": [
        "30298",
        "20202",
        "11450"
      ]
    },
    {
      "id": "jami-al-tirmidhi-164",
      "hadith_no": "164",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان رسول الله صلى الله عليه وسلم يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ‏\"‏ ‏.‏ قال وفي الباب عن جابر والصنابحي وزيد بن خالد وأنس ورافع بن خديج وأبي أيوب وأم حبيبة وعباس بن عبد المطلب وابن عباس ‏.‏ وحديث العباس قد روي موقوفا عنه وهو أصح ‏.‏ والصنابحي لم يسمع من النبي صلى الله عليه وسلم وهو صاحب أبي بكر رضى الله عنه ‏.‏ قال أبو عيسى حديث سلمة بن الأكوع حديث حسن صحيح ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين اختاروا تعجيل صلاة المغرب وكرهوا تأخيرها حتى قال بعض أهل العلم ليس لصلاة المغرب إلا وقت واحد وذهبوا إلى حديث النبي صلى الله عليه وسلم حيث صلى به جبريل ‏.‏ وهو قول ابن المبارك والشافعي ‏.‏",
      "text_en": " Salmah bin AI-Akwa narrated:                     \"Allah's Messenger prayed Maghrib when the sun had set and it (the sun) had hidden in the veil (of darkness).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1592",
      "hadith_no": "1592",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، قال قلت لسلمة بن الأكوع على أى شيء بايعتم رسول الله صلى الله عليه وسلم يوم الحديبية قال على الموت ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Yazid bin Abi 'Ubaid:                     \"I said to Salamah bin Al-Akwa': \"For what did you pledge to the Messenger of Allah (ﷺ) on the Day of Al-Hudaibiyyah?\" He said: \"For death.\"This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "id": "sunan-an-nasai-1961",
      "hadith_no": "1961",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى، قال حدثنا يزيد بن أبي عبيد، قال حدثنا سلمة، - يعني ابن الأكوع - قال أتي النبي صلى الله عليه وسلم بجنازة فقالوا يا نبي الله صل عليها ‏.‏ قال ‏\"‏ هل ترك عليه دينا ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ هل ترك من شىء ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏ ‏.‏ قال رجل من الأنصار يقال له أبو قتادة صل عليه وعلى دينه ‏.‏ فصلى عليه ‏.‏",
      "text_en": " Salamah -  meaning, bin Al-Akwa' - said:                     \"A Janazah was brought to the Prophet and they said: \" O Prophet of Allah, pray for him.' He said: \"Did he leave any debt behind?' They said: \"Yes.' He said 'Did he leave anything?' They said: No. He said; 'Pray fro your companion.' A man among the Ansar who was called Abu Qatadah said: 'Pray for him and I will pay off his debt.' So he prayed for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30170",
        "20031",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-2537",
      "hadith_no": "2537",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت عميرا، مولى آبي اللحم قال أمرني مولاى أن أقدد، لحما فجاء مسكين فأطعمته منه فعلم بذلك مولاى فضربني فأتيت رسول الله صلى الله عليه وسلم فدعاه فقال ‏\"‏ لم ضربته ‏\"‏ ‏.‏ فقال يطعم طعامي بغير أن آمره وقال مرة أخرى بغير أمري قال ‏\"‏ الأجر بينكما ‏\"‏ ‏.‏",
      "text_en": " Narrated:                     'Umair, the freed slave of commanded me to cut up some meat, then a poor man came so I gave him some. When my master fund out about that, he beat me, so I went to the Messenger of Allah and he came to him and said: 'Do not beat him.' He said: 'He gave away my food without me telling him to.' He said:  'The reward will be shared between you both.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "id": "sunan-an-nasai-4159",
      "hadith_no": "4159",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، قال قلت لسلمة بن الأكوع على أى شىء بايعتم النبي صلى الله عليه وسلم يوم الحديبية قال على الموت ‏.‏",
      "text_en": " It was narrated that Yazid bin Abi 'Ubaid said:                     \"I said to Salamah bin Al-Akwa': 'What pledge did you make to the Prophet on the Day of Al-Hudaibiyyah?' He said: 'For death.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "id": "sunan-an-nasai-4186",
      "hadith_no": "4186",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك وذكر كلمة معناها وبدوت ‏.‏ قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو ‏.‏",
      "text_en": " It was narrated from Salamah bin Al-Akwa ' that he entered upon Al-Hajjaj who said:                     O son of Al-Akwa, you have turned on your heels (i.e., deserted Islam) by staying in the desert with the Bedouins.\" He said: \"No; the Messenger of Allah gave me permission to stay in the desert with the Bedouins.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-688-2",
      "hadith_no": "688",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يصلي مع النبي  صلى الله عليه وسلم  المغرب إذا توارت بالحجاب ‏.‏",
      "text_en": " It was narrated from Salamah bin Akwa' that:                     He used to pray the Maghrib with the Messenger of Allah when the sun set.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-1497",
      "hadith_no": "1497",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن المخزومي، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يأتي إلى سبحة الضحى فيعمد إلى الأسطوانة دون المصحف فيصلي قريبا منها فأقول له ألا تصلي ها هنا وأشير إلى بعض نواحي المسجد فيقول إني رأيت رسول الله  صلى الله عليه وسلم  يتحرى هذا المقام ‏.‏",
      "text_en": " It wasnarrated from Yazid bin Abu ‘Ubaid that Salamah bin Al-Akwa’usedto offer the Duha prayer, and he would come to the pillar thatwasnear the Mushaf. I said to him:                      “Why do you not pray over there?”And I pointed to some corner of the mosque. He said: “I saw theMessenger of Allah (ﷺ) seeking out this place.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "11034",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-3316",
      "hadith_no": "3316",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزونا مع رسول الله  صلى الله عليه وسلم  غزوة خيبر فأمسى الناس قد أوقدوا النيران فقال النبي  صلى الله عليه وسلم  ‏\"‏ علام توقدون ‏\"‏ ‏.‏ قالوا على لحوم الحمر الإنسية فقال ‏\"‏ أهريقوا ما فيها واكسروها ‏\"‏ ‏.‏ فقال رجل من القوم أو نهريق ما فيها ونغسلها فقال النبي  صلى الله عليه وسلم  ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salamah bin Akwa’ said:                      “We went out with theMessenger of Allah (ﷺ) on the campaign of Khaibar, and in theevening the people lit their fires. The Prophet (ﷺ) said: ‘Whatareyou cooking?’ They said: ‘The meat of domesticated donkeys.’He said:‘Throw out what is in them (the pots) and break them.’ Aman said: ‘Orcan we throw out what is in them and wash them?’The Prophet (ﷺ)said: ‘Or (do) that.’”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    }
  ],
  "total_hadiths": 54
}