{
  "id": "11456",
  "name": "Mu'adhah bint 'Abdullah معاذة بنت عبد الله",
  "full_name": "Mu'adhah bint 'Abdullah معاذة بنت عبد الله",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Female",
      "B.Adi",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "14630",
      "name": "Sala bin Ashaym al-Advi صلة بن أشيم العدوي أبو الصهباء",
      "grade": "Follower(Tabi')"
    }
  ],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1331",
      "name": "Hisham bin 'Amir bin Umayya ( هشام بن عامر بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19554",
      "name": "Umm 'Amr bint 'Abdullah أم عمرو بنت عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11319",
      "name": "Yazid bin Abi Yazid, al-Rashk يزيد بن أبي يزيد الضبعي الرشك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11575",
      "name": "Ishaq bin Suwayd bin Hubayra إسحاق بن سويد بن هبيرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "28702",
      "name": "Umm al-Hasan Grandmother أم الحسن جدة أبي بكر العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "321",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا همام، قال حدثنا قتادة، قال حدثتني معاذة، أن امرأة، قالت لعائشة أتجزي إحدانا صلاتها إذا طهرت فقالت أحرورية أنت كنا نحيض مع النبي صلى الله عليه وسلم فلا يأمرنا به‏.‏ أو قالت فلا نفعله‏.‏",
      "text_en": " Narrated Mu`adha:                     A woman asked `Aisha, \"Should I offer the prayers that which I did not offer because of menses\" `Aisha said, \"Are you from the Huraura' (a town in Iraq?) We were with the Prophet and used to get our periods but he never ordered us to offer them (the Prayers missed during menses).\" `Aisha perhaps said, \"We did not offer them.\"",
      "chain": [
        "20040",
        "20297",
        "11019",
        "11456"
      ]
    },
    {
      "hadith_no": "4836",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، أخبرنا عاصم الأحول، عن معاذة، عن عائشة  رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يستأذن في يوم المرأة منا بعد أن أنزلت هذه الآية ‏{‏ترجئ من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك‏}‏‏.‏ فقلت لها ما كنت تقولين قالت كنت أقول له إن كان ذاك إلى فإني لا أريد يا رسول الله أن أوثر عليك أحدا‏.‏ تابعه عباد بن عباد سمع عاصما‏.‏",
      "text_en": " Narrated Mu`adha:                     `Aisha said, \"Allah's Apostle used to take the permission of that wife with whom he was supposed to stay overnight if he wanted to go to one other than her, after this Verse was revealed:-- \"You (O Muhammad) can postpone (the turn of) whom you will of them (your wives) and you may receive any (of them) whom you will; and there is no blame on you if you invite one whose turn you have set aside (temporarily). (33.51) I asked Aisha, \"What did you use to say (in this case)?\" She said, \"I used to say to him, \"If I could deny you the permission (to go to your other wives) I would not allow your favor to be bestowed on any other person.\"",
      "chain": [
        "30322",
        "20025",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "5895",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال لنا أبو معمر حدثنا عبد الوارث، عن يزيد، قالت معاذة أخبرتني أم عمرو بنت عبد الله، سمعت عبد الله بن الزبير، سمع عمر، سمع النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     Allah's Apostle said, \"None wears silk in this world, but he who will have no share in the Hereafter.\"",
      "chain": [
        "30315",
        "20258",
        "20472",
        "11456",
        "19554",
        "106",
        "3"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن عاصم الأحول، عن معاذة، عن عائشة، قالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء - بيني وبينه - واحد فيبادرني حتى أقول دع لي دع لي ‏.‏ قالت وهما جنبان ‏.‏",
      "text_en": " 'A'isha reported:                      I and the Messenger of Allah (may peace be upon him) took a bath from one vessel which was placed between me and him and he would get ahead of me, so that I would say: Spare (some water for) me, spare (some water for) me; and she said that they had had sexual intercourse.",
      "chain": [
        "30399",
        "30022",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد، عن أيوب، عن أبي قلابة، عن معاذة، ح وحدثنا حماد، عن يزيد الرشك، عن معاذة، أن امرأة، سألت عائشة فقالت أتقضي إحدانا الصلاة أيام محيضها فقالت عائشة أحرورية أنت قد كانت إحدانا تحيض على عهد رسول الله صلى الله عليه وسلم ثم لا تؤمر بقضاء ‏.‏",
      "text_en": " Mu'adha reported:                      A woman asked 'A'isha: Should one amongst us complete prayers abandoned during the period of menses? 'A'isha said: Are you a Haruriya? When any one of us during the time of the Messenger of Allah (may peace be upon him) was in her menses (and abandoned prayer) she was not required to complete them.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "11047",
        "11456",
        "20022",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد، قال سمعت معاذة، أنها سألت عائشة أتقضي الحائض الصلاة فقالت عائشة أحرورية أنت قد كن نساء رسول الله صلى الله عليه وسلم يحضن أفأمرهن أن يجزين قال محمد بن جعفر تعني يقضين ‏.‏",
      "text_en": " It is reported from Mu'adha that she asked 'A'isha:                      Should a menstruating woman complete the prayer (abandoned during the menstrual period)? 'A'isha said: Are you a Hurariya? The wives of the Messenger of Allah (may peace be upon him) have had their monthly courses, (but) did he order them to make compensation (for the abandoned prayers)? Muhammad b. Ja'far said: (Compensation) denotes their completion.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "20304",
        "11456"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن عاصم، عن معاذة، قالت سألت عائشة فقلت ما بال الحائض تقضي الصوم ولا تقضي الصلاة فقالت أحرورية أنت قلت لست بحرورية ولكني أسأل ‏.‏ قالت كان يصيبنا ذلك فنؤمر بقضاء الصوم ولا نؤمر بقضاء الصلاة ‏.‏",
      "text_en": " Mu'adha said:                      I asked 'A'isha: What is the reason that a menstruating woman completes the fasts (that she abandons during her monthly course). but she does not complete the prayers? She (Hadrat 'A'isha) said: Are you a Haruriya? I said: I am not a Haruriya, but I simply want to inquire. She said: We passed through this (period of menstruation), and we were ordered to complete the fasts, but were not ordered to complete the prayers.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11080",
        "11456"
      ]
    },
    {
      "hadith_no": "1696",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، حدثنا يزيد، - يعني الرشك - حدثتني معاذة، أنها سألت عائشة - رضى الله عنها - كم كان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت أربع ركعات ويزيد ما شاء ‏.‏",
      "text_en": " Mu'adha asked 'A'isha (Allah be pleased with her) how many rak'ahs Allah's Messenger (may peace be upon him) prayed at the forenoon prayer. She replied:                      Four rak'ahs, but sometimes more as he pleased.",
      "chain": [
        "20656",
        "20258",
        "11319",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "2801",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن يزيد الرشك، قال حدثتني معاذة، العدوية أنها سألت عائشة زوج النبي صلى الله عليه وسلم أكان رسول الله صلى الله عليه وسلم يصوم من كل شهر ثلاثة أيام قالت نعم ‏.‏ فقلت لها من أى أيام الشهر كان يصوم قالت لم يكن يبالي من أى أيام الشهر يصوم ‏.‏",
      "text_en": " Mu'adha al-'Adawiyya reported that she asked 'A'isha, the wife of the Apostle of Allah (may peace be upon him), whether the Messenger of Allah (may peace be upon him) observed fasts for three days during every month. She said:                      Yes I said to her: Which were (the particular) days of the month on which he observed fast? She said: He was not particular about the days of the month on which to observe fast.",
      "chain": [
        "20656",
        "20258",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "3755",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا سريج بن يونس، حدثنا عباد بن عباد، عن عاصم، عن معاذة العدوية، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستأذننا إذا كان في يوم المرأة منا بعد ما نزلت ‏{‏ ترجي من تشاء منهن وتؤوي إليك من تشاء‏}‏ فقالت لها معاذة فما كنت تقولين لرسول الله صلى الله عليه وسلم إذا استأذنك قالت كنت أقول إن كان ذاك إلى لم أوثر أحدا على نفسي ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) sought our permission when he had a (turn to spend) a day with (one of his wives) amongst us (whereas he wanted to visit his other wives too). It was after this that this verse was revealed:                     \" Thou mayest put off whom thou pleasest of them, and take for thee whom thou pleasest\" (xxxiii. 5). Mu'adha said to her: What did you say to Allah's Messenger (may peace be upon him) when he sought your permission? She said: I used to say: If it had the option in this I would not have (allowed anyone) to have precedence over me.",
      "chain": [
        "30251",
        "20243",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "5291",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا إسحاق بن سويد، عن معاذة، عن عائشة، قالت نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والنقير والمزفت ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) forbidding (the preparation of Nabidh) in varnished jar, green pitcher, gourd, and hollow stump,",
      "chain": [
        "20184",
        "20208",
        "11575",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، عن معاذة، أن امرأة، سألت عائشة أتقضي الحائض الصلاة فقالت أحرورية أنت لقد كنا نحيض عند رسول الله صلى الله عليه وسلم فلا نقضي ولا نؤمر بالقضاء ‏.‏",
      "text_en": " Mu’adhah reported :                      A woman asked ‘A’ishah: should a menstruating woman complete the prayer abandoned during the period of menses? ‘A’ishah said: Are you a Haruriyyah? During menstruation in the time of the Messenger of Allah (May peace be upon him) we would not complete (the abandoned prayers), nor were we commanded to complete them.",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11047",
        "11456"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن عمرو، أخبرنا سفيان، - يعني ابن عبد الملك - عن ابن المبارك، عن معمر، عن أيوب، عن معاذة العدوية، عن عائشة، بهذا الحديث ‏.‏ قال أبو داود وزاد فيه فنؤمر بقضاء الصوم ولا نؤمر بقضاء الصلاة ‏.‏",
      "text_en": " This tradition has also been narrated through a different chain of  the authority of Mu’adhah al-‘Adawiyyah from ‘A’ishah. This version adds; we were commanded to complete the (abandoned) fast, but were commanded to complete the (abandoned) prayer.",
      "chain": [
        "11624",
        "30543",
        "20025",
        "20115",
        "11015",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا عبد الصمد بن عبد الوارث، حدثني أبي، حدثتني أم الحسن، - يعني جدة أبي بكر العدوي - عن معاذة، قالت سألت عائشة - رضى الله عنها - عن الحائض يصيب ثوبها الدم ‏.‏ قالت تغسله فإن لم يذهب أثره فلتغيره بشىء من صفرة ‏.‏ قالت ولقد كنت أحيض عند رسول الله صلى الله عليه وسلم ثلاث حيض جميعا لا أغسل لي ثوبا ‏.‏",
      "text_en": " Mu'adhah said that 'Aishah was asked about (washing) the clothes of a menstruating woman smeared with blood. She said:                      She should wash it; in case mark is not removed she should change it by applying some yellow color. I had three menstruations together while I lives with the Messenger of Allah (ﷺ), but I did not wash my clothes.",
      "chain": [
        "30494",
        "20250",
        "20258",
        "28702",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "2136",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن معين، ومحمد بن عيسى، - المعنى - قالا حدثنا عباد بن عباد، عن عاصم، عن معاذة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستأذننا إذا كان في يوم المرأة منا بعد ما نزلت ‏{‏ ترجي من تشاء منهن وتؤوي إليك من تشاء ‏}‏ قالت معاذة فقلت لها ما كنت تقولين لرسول الله صلى الله عليه وسلم قالت كنت أقول إن كان ذلك إلى لم أوثر أحدا على نفسي ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to aske our permission on the day he had to stay with one of his wives (by turns) after the following Qur'anic verse was revealed: \"You may distance those whom you like, and draw close to those whom you like\" [33:51]. The narrator Mu'adhah said: I said to her: What did you say to the Messenger of Allah (ﷺ) ? She said: I used to say: If had an option for that, I would not preferred anyone to myself.",
      "chain": [
        "30020",
        "31167",
        "20243",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "2453",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن يزيد الرشك، عن معاذة، قالت قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصوم من كل شهر ثلاثة أيام قالت نعم ‏.‏ قلت من أى شهر كان يصوم قالت ما كان يبالي من أى أيام الشهر كان يصوم ‏.‏",
      "text_en": " Mu'adhah (al-'Adawiyyah) said:                      I asked 'Aishah: Would the Messenger of Allah (ﷺ) fast three days every month ? She replied: Yes. I asked: Which days in the month he used to fast ? She replied: He did not care which days of the month he fasted.",
      "chain": [
        "30175",
        "20258",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "19",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، ومحمد بن عبد الملك بن أبي الشوارب البصري، قالا حدثنا أبو عوانة، عن قتادة، عن معاذة، عن عائشة، قالت مرن أزواجكن أن يستطيبوا، بالماء فإني أستحييهم فإن رسول الله صلى الله عليه وسلم كان يفعله ‏\"‏ ‏.‏ وفي الباب عن جرير بن عبد الله البجلي وأنس وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعليه العمل عند أهل العلم يختارون الاستنجاء بالماء وإن كان الاستنجاء بالحجارة يجزئ عندهم فإنهم استحبوا الاستنجاء بالماء ورأوه أفضل ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Aishah said:                     \"Encourage your Husbands to clean themselves with water, for I am too shy of them, and Allah's Messenger would do that.\"",
      "chain": [
        "30367",
        "30450",
        "20469",
        "11019",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن معاذة، أن امرأة، سألت عائشة قالت أتقضي إحدانا صلاتها أيام محيضها فقالت أحرورية أنت قد كانت إحدانا تحيض فلا تؤمر بقضاء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن عائشة من غير وجه أن الحائض لا تقضي الصلاة ‏.‏ وهو قول عامة الفقهاء لا اختلاف بينهم في أن الحائض تقضي الصوم ولا تقضي الصلاة ‏.‏",
      "text_en": " Mu'adhah narrated that :                     a woman asked Aishah: \"Shouldn't one of us make up her prayers the days of her menstruation?\" So she said, \"Are you one of the Haruriyyah? Indeed we would menstruate, and we were not ordered to make up.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "763",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن يزيد الرشك، قال سمعت معاذة، قالت قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصوم ثلاثة أيام من كل شهر قالت نعم ‏.‏ قلت من أيه كان يصوم قالت كان لا يبالي من أيه صام ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال ويزيد الرشك هو يزيد الضبعي وهو يزيد بن القاسم وهو القسام والرشك هو القسام بلغة أهل البصرة ‏.‏",
      "text_en": " Yazid Ar-Rishk said:                     \"I heard Mu'adhah saying to Aishah: 'Did the Messenger of Allah fast three days of every month?' She replied in the affirmative. So she said: 'Which of them would he fast?' She said: 'Which of them he would fast was not noticeable.'\"",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "46",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن قتادة، عن معاذة، عن عائشة، أنها قالت مرن أزواجكن أن يستطيبوا بالماء فإني أستحييهم منه إن رسول الله صلى الله عليه وسلم كان يفعله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Tell your husbands to clean themselves with water, for I am too shy to tell them myself. The Messenger of Allah (ﷺ) used to do that.\"",
      "chain": [
        "30367",
        "20469",
        "11019",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن عاصم، ح وأخبرنا سويد بن نصر، أنبأنا عبد الله، عن عاصم، عن معاذة، عن عائشة، - رضى الله عنها - قالت كنت أغتسل أنا ورسول الله صلى الله عليه وسلم من إناء واحد يبادرني وأبادره حتى يقول ‏\"‏ دعي لي ‏\"‏ ‏.‏ وأقول أنا دع لي ‏.‏ قال سويد يبادرني وأبادره فأقول دع لي دع لي ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from one vessel. He would compete with me and I would with him until he would say: 'Leave me some' and I would say: 'Leave me some.'\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11080",
        "38265",
        "20025",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عمرو بن زرارة، قال أنبأنا إسماعيل، عن أيوب، عن أبي قلابة، عن معاذة العدوية، قالت سألت امرأة عائشة أتقضي الحائض الصلاة فقالت أحرورية أنت قد كنا نحيض عند رسول الله صلى الله عليه وسلم فلا نقضي ولا نؤمر بقضاء ‏.‏",
      "text_en": " It was narrated that Mu'adhah Al-'Adawiyyah said:                      \"A woman asked 'Aishah: 'Should a menstruating woman make up the Salah she misses? She said: 'Are you a Haruri? [1] We used to menstruate during the time of Allah's Messenger (ﷺ) but we did not make up the missed Salah nor were we commanded to do so.'\"[1] Meaning are you one of the Khawarij. Harura is a place associated with a group of the Khawarij.",
      "chain": [
        "30365",
        "20208",
        "11015",
        "11047",
        "11456"
      ]
    },
    {
      "hadith_no": "414",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، حدثنا شعبة، عن عاصم، ح وأخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عاصم، عن معاذة، عن عائشة، قالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد أبادره ويبادرني حتى يقول ‏‏\"‏‏ دعي لي ‏‏\"‏‏ ‏‏.‏‏ وأقول أنا دع لي ‏‏.‏‏ قال سويد يبادرني وأبادره فأقول دع لي دع لي ‏‏.‏‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I used to perform Ghusl - the Messenger of Allah (ﷺ) and I - from one vessel. He would compete with me and I would with him (to take the water) until he would say: 'Leave me some,' and I would say, 'Leave me some.'\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11080",
        "38265",
        "20025",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "2318",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا علي، - يعني ابن مسهر - عن سعيد، عن قتادة، عن معاذة العدوية، أن امرأة، سألت عائشة أتقضي الحائض الصلاة إذا طهرت قالت أحرورية أنت كنا نحيض على عهد رسول الله صلى الله عليه وسلم ثم نطهر فيأمرنا بقضاء الصوم ولا يأمرنا بقضاء الصلاة ‏.‏",
      "text_en": " It was narrated from Muadhah Al-Adawiyyah that a woman asked 'Aishah:                     \"Should a menstruating woman make up the prayers when she becomes pure?\" she said: \"Are youa Haruri? We used to menstruate at the time of the Messenger of Allah then we would become pure. He told us to make up the fast, but he did not tell us to make up the prayers.\"",
      "chain": [
        "20387",
        "20345",
        "11168",
        "11019",
        "11456"
      ]
    },
    {
      "hadith_no": "5639",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا ابن علية، قال حدثنا إسحاق بن سويد، عن معاذة، عن عائشة، رضى الله عنها قالت نهى عن الدباء، بذاته ‏.‏",
      "text_en": " It was narrated that 'Aishah, may Allah be pleased with her, said:                     \"He forbade Ad-Dubba' (gourds) specifically.\"",
      "chain": [
        "30249",
        "20208",
        "11575",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "5640",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت إسحاق، - وهو ابن سويد - يقول حدثتني معاذة، عن عائشة، أن رسول الله صلى الله عليه وسلم نهى عن نبيذ النقير والمقير والدباء والحنتم ‏.‏ في حديث ابن علية قال إسحاق وذكرت هنيدة عن عائشة مثل حديث معاذة وسمت الجرار ‏.‏ قلت لهنيدة أنت سمعتيها سمت الجرار قالت نعم ‏.‏",
      "text_en": " It was narrated from Ishaq - he is Ibn Suwaid - that he said:                     \"Mu'adhah narrated to me from 'Aishah, that the Messenger of Allah [SAW] forbade Nabidh made in An-Naqir, Al-Muqayyar, Ad-Dubba', and Al-Hantam.\" And in the narration of Ibn 'Ulayyah, Ishaq said: \"And Hunaidah mentioned from 'Aishah similar to the narration of Mu'adhah, and she named earthenware containers. I said to Hunaidah: 'Did you hear her say earthenware containers?' She said: 'Yes.'\"",
      "chain": [
        "30449",
        "20288",
        "11575",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن سعيد بن أبي عروبة، عن قتادة، عن معاذة العدوية، عن عائشة، أن امرأة، سألتها أتقضي الحائض الصلاة قالت لها عائشة أحرورية أنت قد كنا نحيض عند النبي  صلى الله عليه وسلم  ثم نطهر ولم يأمرنا بقضاء الصلاة ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     A woman asked her: \"Does a woman who menstruates have to make up for the prayers she misses?\" 'Aisha said to her: \"Are you a Haruriyyah? We used to menstruate with the Prophet and then become pure, and he did not tell us to make up for the prayers we missed.\"",
      "chain": [
        "30201",
        "20345",
        "11073",
        "11019",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "1444",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن يزيد الرشك، عن معاذة العدوية، قالت سألت عائشة أكان النبي  صلى الله عليه وسلم  يصلي الضحى قالت نعم أربعا ويزيد ما شاء الله ‏.‏",
      "text_en": " Mu’adhahAl-‘Adawiyyah said:                      “I asked ‘Aishah: ‘Did the Prophet (ﷺ)pray Duha?’ She said: ‘Yes; four (Rak’ah) and he would addwhateverAllah willed.’”",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11319",
        "11456"
      ]
    },
    {
      "hadith_no": "1780",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن يزيد الرشك، عن معاذة العدوية، عن عائشة، أنها قالت كان رسول الله  صلى الله عليه وسلم  يصوم ثلاثة أيام من كل شهر ‏.‏ قلت من أيه قالت لم يكن يبالي من أيه كان ‏.‏",
      "text_en": " It wasnarrated from Mu’adhah Al-‘Adawiyyah that ‘Aishah said:                      “TheMessenger of Allah (ﷺ) used to fast three days of each month.” Isaid: “Which were they?” She said: “He did not care which daystheywere.”",
      "chain": [
        "30201",
        "20278",
        "20020",
        "11319",
        "11456",
        "53"
      ]
    }
  ],
  "total_hadiths": 29
}