{
  "id": "11501",
  "name": "Ja'far bin 'Amr bin Umayya جعفر بن عمرو بن أمية",
  "full_name": "Ja'far bin 'Amr bin Umayya جعفر بن عمرو بن أمية",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "96",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "18293",
      "name": "al-Zbrqan bin 'Amr bin Umayya الزبرقان بن عمرو بن أمية",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "242",
      "name": "Wahshy ibn Harb ( وحشي بن حرب الحبشي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "18293",
      "name": "al-Zbrqan bin 'Amr bin Umayya الزبرقان بن عمرو بن أمية",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "18292",
      "name": "al-Zabrqan bin 'Abdullah al-Damri الزبرقان بن عبد الله الضمري",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "28653",
      "name": "Y'aqub bin 'Amr bin 'Abdullah bin 'Amr يعقوب بن عمرو بن عبد الله بن عمرو",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "22187",
      "name": "Muhammad bin 'Abdullah bin 'Amr محمد بن عبد الله بن عمرو الديباج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-204",
      "hadith_no": "204",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو بن أمية الضمري، أن أباه، أخبره أنه، رأى النبي صلى الله عليه وسلم يمسح على الخفين‏.‏ وتابعه حرب بن شداد وأبان عن يحيى‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya Ad-Damri:                     My father said, \"I saw the Prophet passing wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "usc_msa_ref": "",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-205",
      "hadith_no": "205",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا الأوزاعي، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يمسح على عمامته وخفيه‏.‏ وتابعه معمر عن يحيى عن أبي سلمة عن عمرو قال رأيت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ja`far bin `Amr:                     My father said, \"I saw the Prophet passing wet hands over his turban and Khuffs (socks made from thick fabric or leather).",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "20025",
        "20024",
        "11449",
        "10567",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-208",
      "hadith_no": "208",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني جعفر بن عمرو بن أمية، أن أباه، أخبره أنه، رأى رسول الله صلى الله عليه وسلم يحتز من كتف شاة، فدعي إلى الصلاة فألقى السكين فصلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya:                     My father said, \"I saw Allah's Apostle taking a piece of (cooked) mutton from the shoulder region and then he was called for prayer. He put his knife down and prayed without repeating ablution.\"",
      "usc_msa_ref": "207",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-675",
      "hadith_no": "675",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثنا إبراهيم، عن صالح، عن ابن شهاب، قال أخبرني جعفر بن عمرو بن أمية، أن أباه، قال رأيت رسول الله صلى الله عليه وسلم يأكل ذراعا يحتز منها، فدعي إلى الصلاة فقام فطرح السكين، فصلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya:                     My father said, \"I saw Allah's Apostle eating a piece of meat from the shoulder of a sheep and he was called for the prayer. He stood up, put down the knife and prayed but did not perform ablution.''",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2923",
      "hadith_no": "2923",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم بن سعد، عن ابن شهاب، عن جعفر بن عمرو بن أمية، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يأكل من كتف يحتز منها، ثم دعي إلى الصلاة فصلى ولم يتوضأ‏.‏ حدثنا أبو اليمان أخبرنا شعيب عن الزهري وزاد فألقى السكين‏.‏",
      "text_en": " Narrated Umaiya Ad-Damri:                     I saw the Prophet eating of a shoulder (of a sheep) by cutting from it and then he was called to prayer and he prayed without repeating his ablution.Narrated Az-Zuhri:as above (Hadith No. 173...) and added that the Prophet put the knife down.",
      "usc_msa_ref": "",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4121",
      "hadith_no": "4121",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أبو جعفر، محمد بن عبد الله حدثنا حجين بن المثنى، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن الفضل، عن سليمان بن يسار، عن جعفر بن عمرو بن أمية الضمري، قال خرجت مع عبيد الله بن عدي بن الخيار، فلما قدمنا حمص قال لي عبيد الله هل لك في وحشي نسأله عن قتل حمزة قلت نعم‏.‏ وكان وحشي يسكن حمص فسألنا عنه فقيل لنا هو ذاك في ظل قصره، كأنه حميت‏.‏ قال فجئنا حتى وقفنا عليه بيسير، فسلمنا، فرد السلام، قال وعبيد الله معتجر بعمامته، ما يرى وحشي إلا عينيه ورجليه، فقال عبيد الله يا وحشي أتعرفني قال فنظر إليه ثم قال لا والله إلا أني أعلم أن عدي بن الخيار تزوج امرأة يقال لها أم قتال بنت أبي العيص، فولدت له غلاما بمكة، فكنت أسترضع له، فحملت ذلك الغلام مع أمه، فناولتها إياه، فلكأني نظرت إلى قدميك‏.‏ قال فكشف عبيد الله عن وجهه ثم قال ألا تخبرنا بقتل حمزة قال نعم، إن حمزة قتل طعيمة بن عدي بن الخيار ببدر، فقال لي مولاى جبير بن مطعم إن قتلت حمزة بعمي فأنت حر، قال فلما أن خرج الناس عام عينين  وعينين جبل بحيال أحد، بينه وبينه واد  خرجت مع الناس إلى القتال، فلما اصطفوا للقتال خرج سباع فقال هل من مبارز قال فخرج إليه حمزة بن عبد المطلب فقال يا سباع يا ابن أم أنمار مقطعة البظور، أتحاد الله ورسوله صلى الله عليه وسلم قال ثم شد عليه فكان كأمس الذاهب  قال  وكمنت لحمزة تحت صخرة فلما دنا مني رميته بحربتي، فأضعها في ثنته حتى خرجت من بين وركيه  قال  فكان ذاك العهد به، فلما رجع الناس رجعت معهم فأقمت بمكة، حتى فشا فيها الإسلام، ثم خرجت إلى الطائف، فأرسلوا إلى رسول الله صلى الله عليه وسلم رسولا، فقيل لي إنه لا يهيج الرسل  قال  فخرجت معهم حتى قدمت على رسول الله صلى الله عليه وسلم فلما رآني قال ‏\"‏ آنت وحشي ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أنت قتلت حمزة ‏\"‏‏.‏ قلت قد كان من الأمر ما بلغك‏.‏ قال ‏\"‏ فهل تستطيع أن تغيب وجهك عني ‏\"‏‏.‏ قال فخرجت، فلما قبض رسول الله صلى الله عليه وسلم فخرج مسيلمة الكذاب قلت لأخرجن إلى مسيلمة لعلي أقتله فأكافئ به حمزة  قال  فخرجت مع الناس، فكان من أمره ما كان  قال  فإذا رجل قائم في ثلمة جدار، كأنه جمل أورق ثائر الرأس  قال  فرميته بحربتي، فأضعها بين ثدييه حتى خرجت من بين كتفيه  قال  ووثب إليه رجل من الأنصار، فضربه بالسيف على هامته‏.‏ قال قال عبد الله بن الفضل فأخبرني سليمان بن يسار أنه سمع عبد الله بن عمر يقول فقالت جارية على ظهر بيت وا أمير المؤمنين، قتله العبد الأسود‏.‏",
      "text_en": " Narrated Jafar bin `Amr bin Umaiya:                     I went out with 'Ubaidullah bin `Adi Al-Khaiyar. When we reached Hims (i.e. a town in Syria), 'Ubaidullah bin `Adi said (to me), \"Would you like to see Wahshi so that we may ask him about the killing of Hamza?\" I replied, \"Yes.\" Wahshi used to live in Hims. We enquired about him and somebody said to us, \"He is that in the shade of his palace, as if he were a full water skin.\" So we went up to him, and when we were at a short distance from him, we greeted him and he greeted us in return. 'Ubaidullah was wearing his turban and Wahshi could not see except his eyes and feet. 'Ubaidullah said, \"O Wahshi! Do you know me?\" Wahshi looked at him and then said, \"No, by Allah! But I know that `Adi bin Al-Khiyar married a woman called Um Qital, the daughter of Abu Al-Is, and she delivered a boy for him at Mecca, and I looked for a wet nurse for that child. (Once) I carried that child along with his mother and then I handed him over to her, and your feet resemble that child's feet.\" Then 'Ubaidullah uncovered his face and said (to Wahshi), \"Will you tell us (the story of) the killing of Hamza?\" Wahshi replied \"Yes, Hamza killed Tuaima bin `Adi bin Al-Khaiyar at Badr (battle) so my master, Jubair bin Mut`im said to me, 'If you kill Hamza in revenge for my uncle, then you will be set free.\" When the people set out (for the battle of Uhud) in the year of 'Ainain ..'Ainain is a mountain near the mountain of Uhud, and between it and Uhud there is a valley.. I went out with the people for the battle. When the army aligned for the fight, Siba' came out and said, 'Is there any (Muslim) to accept my challenge to a duel?' Hamza bin `Abdul Muttalib came out and said, 'O Siba'. O Ibn Um Anmar, the one who circumcises other ladies! Do you challenge Allah and His Apostle?' Then Hamza attacked and killed him, causing him to be non-extant like the bygone yesterday. I hid myself under a rock, and when he (i.e. Hamza) came near me, I threw my spear at him, driving it into his umbilicus so that it came out through his buttocks, causing him to die. When all the people returned to Mecca, I too returned with them. I stayed in (Mecca) till Islam spread in it (i.e. Mecca). Then I left for Taif, and when the people (of Taif) sent their messengers to Allah's Apostle, I was told that the Prophet did not harm the messengers; So I too went out with them till I reached Allah's Apostle. When he saw me, he said, 'Are you Wahshi?' I said, 'Yes.' He said, 'Was it you who killed Hamza?' I replied, 'What happened is what you have been told of.' He said, 'Can you hide your face from me?' So I went out when Allah's Apostle died, and Musailamah Al-Kadhdhab appeared (claiming to be a prophet). I said, 'I will go out to Musailamah so that I may kill him, and make amends for killing Hamza. So I went out with the people (to fight Musailamah and his followers) and then famous events took place concerning that battle. Suddenly I saw a man (i.e. Musailamah) standing near a gap in a wall. He looked like an ash-colored camel and his hair was dishevelled. So I threw my spear at him, driving it into his chest in between his breasts till it passed out through his shoulders, and then an Ansari man attacked him and struck him on the head with a sword. `Abdullah bin `Umar said, 'A slave girl on the roof of a house said: Alas! The chief of the believers (i.e. Musailamah) has been killed by a black slave.\"",
      "usc_msa_ref": "399",
      "chain": [
        "20382",
        "20026",
        "11187",
        "11005",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5463",
      "hadith_no": "5463",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني جعفر بن عمرو بن أمية، أن أباه، عمرو بن أمية أخبره أنه، رأى النبي صلى الله عليه وسلم يحتز من كتف شاة في يده، فدعي إلى الصلاة فألقاها والسكين التي يحتز بها، ثم قام فصلى، ولم يتوضأ‏.‏",
      "text_en": " Narrated `Amr bin Umaiyya:                     that he saw the Prophet holding a shoulder piece of mutton in his hand and cutting part of it with a knife. Then he was called for the prayer whereupon he put down the shoulder piece and the knife with which he was cutting it, and then stood for prayer without performing ablution again.",
      "usc_msa_ref": "",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5477",
      "hadith_no": "5477",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يحتز من كتف شاة، فأكل منها، فدعي إلى الصلاة، فقام فطرح السكين فصلى، ولم يتوضأ‏.‏",
      "text_en": " Narrated `Amr bin Umaiyay Ad-Damri:                     I saw Allah's Apostle cutting part of the shoulder of mutton with a knife. He ate of it and then was called for prayer whereupon he got up and put down the knife and offered the prayer without performing new ablution.",
      "usc_msa_ref": "333",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5518",
      "hadith_no": "5518",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، قال أخبرني جعفر بن عمرو بن أمية، أن أباه، عمرو بن أمية أخبره أنه، رأى رسول الله صلى الله عليه وسلم يحتز من كتف شاة في يده، فدعي إلى الصلاة فألقاها والسكين التي كان يحتز بها، ثم قام فصلى، ولم يتوضأ‏.‏",
      "text_en": " Narrated `Amr bin Umaiyya:                     That he saw Allah's Apostle cutting a piece of mutton from its shoulder part he was carrying in his hand. When he was called for prayer, he put it down and the knife with which he was cutting it. Then he stood up and offered the prayer without performing new ablution.",
      "usc_msa_ref": "372",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20023",
        "20475",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-355-2",
      "hadith_no": "355",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن الصباح، حدثنا إبراهيم بن سعد، حدثنا الزهري، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، أنه رأى رسول الله صلى الله عليه وسلم يحتز من كتف يأكل منها ثم صلى ولم يتوضأ ‏.‏",
      "text_en": " Ja'far b. Amr b. Umayya al-Damari reported on the authority of his father who said:                      I saw the Messenger of Allah (may peace be upon him) take slices from goat's shoulder, and then eat them, and then offer prayer without having performed ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20150",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-355-3",
      "hadith_no": "355",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني أحمد بن عيسى، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن ابن شهاب، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يحتز من كتف شاة فأكل منها فدعي إلى الصلاة فقام وطرح السكين وصلى ولم يتوضأ ‏.‏ قال ابن شهاب وحدثني علي بن عبد الله بن عباس عن أبيه عن رسول الله صلى الله عليه وسلم بذلك ‏.‏",
      "text_en": " Ja'far b. 'Amr b. Umayya al-Damari reported on the authority of his father who said:                      I saw the Messenger of Allah (may peace be upon him) take slices from goat's shoulder and then eat them. He was called for prayer and he got'up, leaving aside the knife, and offered prayer but did not perform ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30227",
        "20029",
        "20377",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "jami-al-tirmidhi-1836",
      "hadith_no": "1836",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، أنه رأى النبي صلى الله عليه وسلم احتز من كتف شاة فأكل منها ثم مضى إلى الصلاة ولم يتوضأ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن المغيرة بن شعبة ‏.‏",
      "text_en": " Narrated Ja'far bin 'Amr bin Umayyah Ad-Damri:                     From his father who said that he saw the Prophet (ﷺ) making incisions (with a knife) into a piece of a lamb shoulder which he ate from, then he went to perform Salat without performing Wudu'.[Abu 'Eisa said:] This Hadith is Hasan Sahih and there is something on this topic from Al-Mughirah bin Shu'bah.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11013",
        "11501"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-119",
      "hadith_no": "119",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الرحمن، قال حدثنا حرب بن شداد، عن يحيى بن أبي كثير، عن أبي سلمة، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، أنه رأى رسول الله صلى الله عليه وسلم توضأ ومسح على الخفين ‏.‏",
      "text_en": " It was narrated from Ja'far bin 'Amr bin Umayyah Ad-Damri that his father saw the Messenger of Allah (ﷺ) performing Wudu' and wiping over his Khuffs.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20033",
        "20220",
        "11449",
        "10567",
        "11501"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2268",
      "hadith_no": "2268",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا الوليد، عن الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو قلابة، قال حدثني جعفر بن عمرو بن أمية الضمري، عن أبيه، قال قدمت على رسول الله صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا تنتظر الغداء يا أبا أمية ‏\"‏ ‏.‏ قلت إني صائم ‏.‏ فقال ‏\"‏ تعال أخبرك عن المسافر إن الله وضع عنه الصيام ونصف الصلاة ‏\"‏ ‏.‏",
      "text_en": " Jafar bin 'Amr bin Umayyah Ad-Damri narrated that his father said:                     \"I came to the Messenger of Allah and the Messenger of Allah said to me: 'Stay and have a meal for breakfast, O Abu Umayyah.' I said: I am fasting.' He said: 'Come and I will tell you about the traveler. Allah has waived meaning the fasting and half the prayer for him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20733",
        "20024",
        "11449",
        "11047",
        "11501"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5346",
      "hadith_no": "5346",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن أبان، قال حدثنا أبو أسامة، عن مساور الوراق، عن جعفر بن عمرو بن أمية، عن أبيه، قال كأني أنظر الساعة إلى رسول الله صلى الله عليه وسلم على المنبر وعليه عمامة سوداء قد أرخى طرفها بين كتفيه ‏.‏",
      "text_en": " It was narrated from Ja'far bin 'Amr bin Umayyah that his father said:                     \"It is as if I am looking now at the Messenger of Allah [SAW] on the Minbar, wearing a black turban, the end of which he has let hang down between his shoulders.\"",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20318",
        "20607",
        "11501"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-605",
      "hadith_no": "605",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا دحيم، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن مصعب، حدثنا الأوزاعي، حدثنا يحيى بن أبي كثير، حدثنا أبو سلمة، عن جعفر بن عمرو، عن أبيه، قال رأيت رسول الله  صلى الله عليه وسلم  يمسح على الخفين والعمامة ‏.‏",
      "text_en": " It was narrated from Ja'far bin 'Amr that his father said:                     \"I saw the Messenger of Allah wiping over his leather socks and turban.\"",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "30201",
        "28536",
        "20024",
        "11449",
        "10567",
        "11501"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 16,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}