{
  "id": "11507",
  "name": "Zuhrah bin Ma'bad bin 'Abdullah زهرة بن معبد بن عبد الله بن هشام",
  "full_name": "Zuhrah bin Ma'bad bin 'Abdullah زهرة بن معبد بن عبد الله بن هشام",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "127",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "al-Madni",
      "Egypt"
    ]
  },
  "parents": [
    {
      "id": "19020",
      "name": "Ma'bd bin 'Abdullah bin Hisham معبد بن عبد الله بن هشام بن زهرة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5141",
      "name": "'Abdullah bin Hisham ( عبد الله بن هشام بن زهرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19020",
      "name": "Ma'bd bin 'Abdullah bin Hisham معبد بن عبد الله بن هشام بن زهرة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2501",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أصبغ بن الفرج، قال أخبرني عبد الله بن وهب، قال أخبرني سعيد، عن زهرة بن معبد، عن جده عبد الله بن هشام  وكان قد أدرك النبي صلى الله عليه وسلم  وذهبت به أمه زينب بنت حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه‏.‏ فقال ‏\"‏ هو صغير ‏\"‏‏.‏ فمسح رأسه ودعا له‏.‏ وعن زهرة بن معبد، أنه كان يخرج به جده عبد الله بن هشام إلى السوق فيشتري الطعام فيلقاه ابن عمر وابن الزبير  رضى الله عنهم  فيقولان له أشركنا، فإن النبي صلى الله عليه وسلم قد دعا لك بالبركة فيشركهم، فربما أصاب الراحلة كما هي، فيبعث بها إلى المنزل‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     that his mother Zainab bint Humaid took him to the Prophet and said, \"O Allah's Apostle! Take the pledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his hand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated that he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn `Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet invoked Allah to bless you.\" So, he would be their partner, and very often he would win a camel's load and send it home.",
      "chain": [
        "30228",
        "20029",
        "11168",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were with the Prophet while he was holding `Umar bin Al-Khattab by the hand.",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "6337",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were in the company of the Prophet and he was holding the hand of `Umar bin Al-Khattab.",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "6714",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني حيوة، قال حدثني أبو عقيل، زهرة بن معبد أنه سمع جده عبد الله بن هشام، قال كنا مع النبي صلى الله عليه وسلم وهو آخذ بيد عمر بن الخطاب فقال له عمر يا رسول الله لأنت أحب إلى من كل شىء إلا من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا والذي نفسي بيده حتى أكون أحب إليك من نفسك ‏\"‏‏.‏ فقال له عمر فإنه الآن والله لأنت أحب إلى من نفسي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الآن يا عمر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     We were with the Prophet and he was holding the hand of `Umar bin Al-Khattab. `Umar said to Him, \"O Allah's Apostle! You are dearer to me than everything except my own self.\" The Prophet said, \"No, by Him in Whose Hand my soul is, (you will not have complete faith) till I am dearer to you than your own self.\" Then `Umar said to him, \"However, now, by Allah, you are dearer to me than my own self.\" The Prophet said, \"Now, O `Umar, (now you are a believer).",
      "chain": [
        "30220",
        "20029",
        "26010",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "7296",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا عبد الله بن يزيد، حدثنا سعيد  هو ابن أبي أيوب  قال حدثني أبو عقيل، زهرة بن معبد عن جده عبد الله بن هشام، وكان، قد أدرك النبي صلى الله عليه وسلم وذهبت به أمه زينب ابنة حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو صغير ‏\"‏ فمسح رأسه ودعا له، وكان يضحي بالشاة الواحدة عن جميع أهله‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     who was born during the lifetime of the Prophet that his mother, Zainab bint Humaid had taken him to Allah's Apostle and said, \"O Allah's Apostle! Take his Pledge of allegiance (for Islam).\" The Prophet said, \"He (`Abdullah bin Hisham) is a little child,\" and passed his hand over his head and invoked Allah for him. `Abdullah bin Hisham used to slaughter one sheep as a sacrifice on behalf of all of his family.",
      "chain": [
        "30026",
        "1945",
        "20375",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، حدثني أبو عقيل، زهرة بن معبد عن جده عبد الله بن هشام، قال وكان قد أدرك النبي صلى الله عليه وسلم وذهبت به أمه زينب بنت حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو صغير ‏\"‏ ‏.‏ فمسح رأسه ‏.‏",
      "text_en": " Narrated 'Abd Alla b. Hisham, :                     who was a Companion, reported that his mother Zainab daughter of Humain went to the Messenger of Allah (ﷺ) and said: Messenger of Allah,  receive the oath of allegiance from him. The Messenger of Allah (ﷺ) said: He is Minor. He then wiped his head.",
      "chain": [
        "30024",
        "1945",
        "20375",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "1667",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا هشام بن عبد الملك، حدثنا الليث بن سعد، حدثني أبو عقيل، زهرة بن معبد عن أبي صالح، مولى عثمان بن عفان قال سمعت عثمان، وهو على المنبر يقول إني كتمتكم حديثا سمعته من رسول الله صلى الله عليه وسلم كراهية تفرقكم عني ثم بدا لي أن أحدثكموه ليختار امرؤ لنفسه ما بدا له سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ رباط يوم في سبيل الله خير من ألف يوم فيما سواه من المنازل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقال محمد بن إسماعيل أبو صالح مولى عثمان اسمه تركان ‏.‏",
      "text_en": " Narrated Abu Salih, the Freed slave of Uthman :                     \"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"",
      "chain": [
        "30115",
        "20023",
        "11507",
        "4"
      ]
    },
    {
      "hadith_no": "3169",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن زهرة بن معبد، قال حدثني أبو صالح، مولى عثمان قال سمعت عثمان بن عفان، رضى الله عنه يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ رباط يوم في سبيل الله خير من ألف يوم فيما سواه من المنازل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zurah bin Ma'bad:                      \"Abu Salih, the freed slave of 'Uthman, said: 'I heard 'Uthman bin 'Affan say: I heard the Messenger of Allah (ﷺ) say: Ribat (guarding the frontier) for one day in the cause of Allah is better in rank than a thousand days spent within the residence.'\"",
      "chain": [
        "38433",
        "30355",
        "20023",
        "11507",
        "4"
      ]
    },
    {
      "hadith_no": "3170",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا ابن المبارك، قال حدثنا أبو معن، قال حدثنا زهرة بن معبد، عن أبي صالح، مولى عثمان قال قال عثمان بن عفان رضي الله عنه سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يوم في سبيل الله خير من ألف يوم فيما سواه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salih, the freed slace of 'Uthman, said:                      \"uthman bin 'Affan said: 'I heard the Messenger of Allah (ﷺ) say: A day in the cause of Allah is better than a thousand days doing anything else.'\"",
      "chain": [
        "30153",
        "20033",
        "20025",
        "11507",
        "19291",
        "4"
      ]
    },
    {
      "hadith_no": "2872",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا عبد الله بن وهب، أخبرني الليث، عن زهرة بن معبد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات مرابطا في سبيل الله أجرى عليه أجر عمله الصالح الذي كان يعمل وأجرى عليه رزقه وأمن من الفتان وبعثه الله يوم القيامة آمنا من الفزع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever dies being prepared in the cause of Allah, will begivencontinuously the reward for the good deeds that he used to do,and hewill be rewarded with provision, and he will be kept safe fromFattan,* and Allah will raise him on the Day of Resurrection free offright.”",
      "chain": [
        "30493",
        "20029",
        "20023",
        "11507",
        "19020",
        "13"
      ]
    }
  ],
  "total_hadiths": 10
}