{
  "id": "11509",
  "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
  "full_name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Damascus",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "al-Madni",
      "al-Damashqi",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "10602",
      "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "18061",
      "name": "Umayya bin 'Amr bin Sa'id bin al-Aas أمية بن عمرو بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "13125",
      "name": "Musa bin 'Amr bin Sa'id bin al-Aas موسى بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18046",
      "name": "Isma'il bin 'Amr bin Sa'id bin al-Aas إسماعيل بن عمرو بن سعيد",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [
    {
      "id": "20309",
      "name": "Ishaq bin Sa'id bin 'Amr bin Sa'id إسحاق بن سعيد بن عمرو بن سعيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20422",
      "name": "Khalid bin Sa'id bin 'Amr bin Sa'id خالد بن سعيد بن عمرو بن سعيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "teachers": [
    {
      "id": "10602",
      "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20309",
      "name": "Ishaq bin Sa'id bin 'Amr bin Sa'id إسحاق بن سعيد بن عمرو بن سعيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20422",
      "name": "Khalid bin Sa'id bin 'Amr bin Sa'id خالد بن سعيد بن عمرو بن سعيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20198",
      "name": "'Amr bin Yahya bin Sa'id bin 'Amr عمرو بن يحيى بن سعيد بن عمرو",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11323",
      "name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "155",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن محمد المكي، قال حدثنا عمرو بن يحيى بن سعيد بن عمرو المكي، عن جده، عن أبي هريرة، قال اتبعت النبي صلى الله عليه وسلم وخرج لحاجته، فكان لا يلتفت فدنوت منه فقال ‏\"‏ ابغني أحجارا أستنفض بها  أو نحوه  ولا تأتني بعظم ولا روث ‏\"‏‏.‏ فأتيته بأحجار بطرف ثيابي فوضعتها إلى جنبه وأعرضت عنه، فلما قضى أتبعه بهن‏.‏",
      "text_en": " Narrated Abu Huraira:                     I followed the Prophet while he was going out to answer the call of nature. He used not to look this way or that. So, when I approached near him he said to me, \"Fetch for me some stones for ' cleaning the privates parts (or said something similar), and do not bring a bone or a piece of dung.\" So I brought the stones in the corner of my garment and placed them by his side and I then went away from him. When he finished (from answering the call of nature) he used, them .",
      "chain": [
        "30305",
        "20198",
        "11509",
        "13"
      ]
    },
    {
      "hadith_no": "967",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن يعقوب، قال حدثني إسحاق بن سعيد بن عمرو بن سعيد بن العاص، عن أبيه، قال دخل الحجاج على ابن عمر وأنا عنده، فقال كيف هو فقال صالح‏.‏ فقال من أصابك قال أصابني من أمر بحمل السلاح في يوم لا يحل فيه حمله، يعني الحجاج‏.‏",
      "text_en": " Narrated Sa`id bin `Amr bin Sa`id bin Al-`Aas:                     Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" Ibn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The person who allowed arms to be carried on the day on which it was forbidden to carry them (he meant Al-Hajjaj).\"",
      "chain": [
        "20307",
        "20309",
        "11509"
      ]
    },
    {
      "hadith_no": "1913",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الأسود بن قيس، حدثنا سعيد بن عمرو، أنه سمع ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنا أمة أمية، لا نكتب ولا نحسب الشهر هكذا وهكذا ‏\"‏‏.‏ يعني مرة تسعة وعشرين، ومرة ثلاثين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"We are an illiterate nation; we neither write, nor know accounts. The month is like this and this, i.e. sometimes of 29 days and sometimes of thirty days.\"",
      "chain": [
        "20404",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "3071",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزبرني أبي قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله ‏\"‏ أبلي وأخلفي، ثم أبلي وأخلفي، ثم أبلي وأخلفي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏",
      "text_en": " Narrated Um Khalid:                     (the daughter of Khalid bin Sa`id) I went to Allah's Apostle with my father and I was Nearing a yellow shirt. Allah's Apostle said, \"Sanah, Sanah!\" (`Abdullah, the narrator, said that 'Sanah' meant 'good' in the Ethiopian language). I then started playing with the seal of Prophethood (in between the Prophet's shoulders) and my father rebuked me harshly for that. Allah's Apostle said. \"Leave her,\" and then Allah's Apostle (invoked Allah to grant me a long life) by saying (thrice), \"Wear this dress till it is worn out and then wear it till it is worn out, and then wear it till it is worn out.\" (The narrator adds, \"It is said that she lived for a long period, wearing that (yellow) dress till its color became dark because of long wear.\")",
      "chain": [
        "30322",
        "20025",
        "20422",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "3180",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "قال أبو موسى حدثنا هاشم بن القاسم، حدثنا إسحاق بن سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  قال كيف أنتم إذا لم تجتبوا دينارا ولا درهما فقيل له وكيف ترى ذلك كائنا يا أبا هريرة قال إي والذي نفس أبي هريرة بيده عن قول الصادق المصدوق‏.‏ قالوا عم ذاك قال تنتهك ذمة الله وذمة رسوله صلى الله عليه وسلم، فيشد الله عز وجل قلوب أهل الذمة، فيمنعون ما في أيديهم‏.‏",
      "text_en": " Narrated Sa`id:                      Abu Huraira once said (to the people), \"What will your state be when you can get no Dinar or Dirhan (i.e. taxes from the Dhimmis)?\" on that someone asked him, \"What makes you know that this state will take place, O Abu- Hu raira?\" He said, \"By Him in Whose Hands Abu Huraira's life is, I know it through the statement of the true and truly inspired one (i.e. the Prophet).\" The people asked, \"What does the Statement say?\" He replied, \"Allah and His Apostle's asylum granted to Dhimmis, i.e. non-Muslims living in a Muslim territory) will be outraged, and so Allah will make the hearts of these Dhimmis so daring that they will refuse to pay the Jizya they will be supposed to pay.\"",
      "chain": [
        "30170",
        "20390",
        "20309",
        "11509",
        "13"
      ]
    },
    {
      "hadith_no": "3922",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا إسحاق بن سعيد السعيدي، عن أبيه، عن أم خالد بنت خالد، قالت قدمت من أرض الحبشة وأنا جويرية، فكساني رسول الله صلى الله عليه وسلم خميصة لها أعلام، فجعل رسول الله صلى الله عليه وسلم يمسح الأعلام بيده ويقول ‏\"‏ سناه، سناه ‏\"‏‏.‏ قال الحميدي يعني حسن حسن‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     When I came from Ethiopia (to Medina), I was a young girl. Allah's Apostle made me wear a sheet having marks on it. Allah's Apostle was rubbing those marks with his hands saying, \"Sanah! Sanah!\" (i.e. good, good).",
      "chain": [
        "30418",
        "20005",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "5572",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أحمد بن يعقوب، أخبرنا إسحاق بن سعيد بن عمرو، عن أبيه، أنه سمعه يحدث، عن ابن عمر  رضى الله عنهما  أنه دخل على يحيى بن سعيد وغلام من بني يحيى رابط دجاجة يرميها، فمشى إليها ابن عمر حتى حلها، ثم أقبل بها وبالغلام معه فقال ازجروا غلامكم عن أن يصبر هذا الطير للقتل، فإني سمعت النبي صلى الله عليه وسلم نهى أن تصبر بهيمة أو غيرها للقتل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn `Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from tying the birds for the sake of killing them, as I have heard the Prophet forbidding the killing of an animal or other living thing after tying them.\"",
      "chain": [
        "20307",
        "20309",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "5906",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو الوليد، حدثنا إسحاق بن سعيد بن عمرو بن سعيد بن العاص، قال حدثني أبي قال، حدثتني أم خالد بنت خالد، قالت أتي رسول الله صلى الله عليه وسلم بثياب فيها خميصة سوداء قال ‏\"‏ من ترون نكسوها هذه الخميصة ‏\"‏‏.‏ فأسكت القوم‏.‏ قال ‏\"‏ ائتوني بأم خالد ‏\"‏‏.‏ فأتي بي النبي صلى الله عليه وسلم فألبسها بيده وقال ‏\"‏ أبلي وأخلقي ‏\"‏‏.‏ مرتين فجعل ينظر إلى علم الخميصة، ويشير بيده إلى ويقول ‏\"‏ يا أم خالد هذا سنا ‏\"‏‏.‏ والسنا بلسان الحبشية الحسن‏.‏ قال إسحاق حدثتني امرأة من أهلي أنها رأته على أم خالد‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     Some clothes were presented to Allah's Apostle as a gift and there was a black Khamisa with it. The Prophet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept quiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with his own hands and said twice, \"May you live so long that you will wear out many garments.\" He then started looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in Ethiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me that she had seen the Khamisa worn by Um Khalid.",
      "chain": [
        "20296",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "6059",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزجرني أبي‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أبلي وأخلقي، ثم أبلي وأخلقي، ثم أبلي وأخلقي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏ يعني من بقائها‏.‏",
      "text_en": " Narrated Sa`id:                     Um Khalid bint Khalid bin Sa`id said, \"I came to Allah's Apostle along with my father and I was wearing a yellow shirt. Allah's Apostle said, \"Sanah Sanah!\" (`Abdullah, the sub-narrator said, \"It means, 'Nice, nice!' in the Ethiopian language.\") Um Khalid added, \"Then I started playing with the seal of Prophethood. My father admonished me. But Allah's Apostle said (to my father), \"Leave her,\" Allah's Apostle (then addressing me) said, \"May you live so long that your dress gets worn out, and you will mend it many times, and then wear another till it gets worn out (i.e. May Allah prolong your life).\" (The sub-narrator, `Abdullah aid, \"That garment (which she was wearing remained usable for a long period.\").",
      "chain": [
        "20218",
        "20025",
        "20422",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "6946",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا علي، حدثنا إسحاق بن سعيد بن عمرو بن سعيد بن العاص، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يزال المؤمن في فسحة من دينه، ما لم يصب دما حراما ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"A faithful believer remains at liberty regarding his religion unless he kills somebody unlawfully.\"",
      "chain": [
        "30026",
        "20309",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "19",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن عباد، وسعيد بن عمرو الأشعثي، جميعا عن ابن عيينة، - قال سعيد أخبرنا سفيان، - عن هشام بن حجير، عن طاوس، قال جاء هذا إلى ابن عباس - يعني بشير بن كعب - فجعل يحدثه فقال له ابن عباس عد لحديث كذا وكذا ‏.‏ فعاد له ثم حدثه فقال له عد لحديث كذا وكذا ‏.‏ فعاد له فقال له ما أدري أعرفت حديثي كله وأنكرت هذا أم أنكرت حديثي كله وعرفت هذا فقال له ابن عباس إنا كنا نحدث عن رسول الله صلى الله عليه وسلم إذ لم يكن يكذب عليه فلما ركب الناس الصعب والذلول تركنا الحديث عنه ‏.‏",
      "text_en": "",
      "chain": [
        "30377",
        "11509",
        "20005",
        "11168",
        "20012",
        "11566",
        "11053"
      ]
    },
    {
      "hadith_no": "2563",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الأسود بن قيس، قال سمعت سعيد بن عمرو بن سعيد، أنه سمع ابن عمر، - رضى الله عنهما - يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا وهكذا وهكذا - وعقد الإبهام في الثالثة - والشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ يعني تمام ثلاثين ‏.‏",
      "text_en": "  Ibn 'Umar (may Allah be pleased with both of them) reported Allah's Apostle (may peace be upon him) as saying:                      We are an unlettered people who can neither write nor count. The month is thus, and thus. folding his thumb when he said it the third time.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "5515",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا سعيد بن عمرو بن سهل بن إسحاق بن محمد بن الأشعث بن قيس، قال حدثنا سفيان بن عيينة، سمعته يذكره، عن أبي فروة، أنه سمع عبد الله بن عكيم، قال كنا مع حذيفة بالمدائن فاستسقى حذيفة فجاءه دهقان بشراب في إناء من فضة فرماه به وقال إني أخبركم أني قد أمرته أن لا يسقيني فيه فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تشربوا في إناء الذهب والفضة ولا تلبسوا الديباج والحرير فإنه لهم في الدنيا وهو لكم في الآخرة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Ukaim reported:                      While we were with Hudhaifa in Mada'in he asked for water. A villager brought a drink for him in a silver vessel. He (Hudhaifa) threw it away saying: I inform you that I have already conveyed to him that he should not serve me drink in it (silver vessel) for Allah's Messenger (may peace be upon him) had said: Do not drink in gold and silver vessels, and do not wear brocade or silk, for these are meant for them (the non-believers) in this world, but they are meant for you in the Hereafter on the Day, of Resurrection.",
      "chain": [
        "11509",
        "20005",
        "11653",
        "10786"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأسود بن قيس، عن سعيد بن عمرو، - يعني ابن سعيد بن العاص - عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا و هكذا وهكذا ‏\"‏ ‏.‏ وخنس سليمان أصبعه في الثالثة يعني تسعا وعشرين وثلاثين ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: The month consists of twenty-nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha'ban came, Ibn Umar would send someone (who tried) to sight the moon for him. If it was sighted, then well and good; in case it was not sighted, and there was no cloud and dust before him (on the horizon), he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn Umar would end his fasting alone with the people, and did not follow this calculation.",
      "chain": [
        "20193",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "4024",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن الجراح الأذني، حدثنا أبو النضر، حدثنا إسحاق بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد بن العاص، أن رسول الله صلى الله عليه وسلم أتي بكسوة فيها خميصة صغيرة فقال ‏\"‏ من ترون أحق بهذه ‏\"‏ ‏.‏ فسكت القوم فقال ‏\"‏ ائتوني بأم خالد ‏\"‏ ‏.‏ فأتي بها فألبسها إياها ثم قال ‏\"‏ أبلي وأخلقي ‏\"‏ ‏.‏ مرتين وجعل ينظر إلى علم في الخميصة أحمر أو أصفر ويقول ‏\"‏ سناه سناه يا أم خالد ‏\"‏ ‏.‏ وسناه في كلام الحبشة الحسن ‏.‏",
      "text_en": " Narrated Umm Khalid, daughter of Sa'd b. al-'As:                     Once the Messenger of Allah (ﷺ) was brought some garments among which was a small cloak with a border and black stripes. He said: Whom do you think to be more deserving for it ? The people kept silence. He said: Bring Umm Khalid. The she was carried to him and he put it on her, saying: Wear it out and make it ragged twice. Then he went on looking at red or yellow marks on it, and said: This is sanah, sanah, Umm Khalid. It means \"beautiful\" in the language of the Abyssinians.",
      "chain": [
        "20390",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "4144",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هناد بن السري، عن وكيع، عن إسحاق بن سعيد بن عمرو القرشي، عن أبيه، عن ابن عمر، أنه رأى رفقة من أهل اليمن رحالهم الأدم فقال من أحب أن ينظر إلى أشبه رفقة كانوا بأصحاب النبي صلى الله عليه وسلم فلينظر إلى هؤلاء ‏.‏",
      "text_en": " Sa'id ibn Amr al-Qurashi quoting his father said:                      Ibn Umar (once) saw some fellow travellers of the Yemen. They had their saddles (on camels) of leather. He said: If anyone likes to see the fellow travellers most resembling to the Companions of the Messenger of Allah (ﷺ), he should see them.",
      "chain": [
        "30480",
        "20032",
        "20309",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "4889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سعيد بن عمرو الحضرمي، حدثنا إسماعيل بن عياش، حدثنا ضمضم بن زرعة، عن شريح بن عبيد، عن جبير بن نفير، وكثير بن مرة، وعمرو بن الأسود، والمقدام بن معديكرب، وأبي، أمامة عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الأمير إذا ابتغى الريبة في الناس أفسدهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Miqdam ibn Ma'dikarib ; AbuUmamah:                     The Prophet (ﷺ) said: When a ruler seeks to make imputations against the people, he corrupts them.",
      "chain": [
        "11509",
        "20736",
        "18459",
        "18414",
        "4097",
        "19940",
        "11714",
        "405"
      ]
    },
    {
      "hadith_no": "2140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عبد الرحمن، عن سفيان، عن الأسود بن قيس، عن سعيد بن عمرو، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ ثلاثا حتى ذكر تسعا وعشرين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet said:                     \"We are an unlettered Ummah, we do not use astronomical counting or computation. The month is like this, and this, and this,\" he did three times, showing it as twenty-nine.",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "2141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، عن محمد، عن شعبة، عن الأسود بن قيس، قال سمعت سعيد بن عمرو بن سعيد بن أبي العاص، أنه سمع ابن عمر، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ إنا أمة أمية لا نحسب ولا نكتب والشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وعقد الإبهام في الثالثة ‏\"‏ والشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ تمام الثلاثين ‏.‏",
      "text_en": " It was narrated from Saeed bin 'Amr bin Saeed bin Abi Al-As, that:                     he heard Ibn 'Umar narrate that the Prophet said; \"We are an unlettered Ummah; we do not use computation. The month is like this, and this, and this,\" and he held down his thumb the last time. \"And the month is like this, and this, and this,\" completing thirty.",
      "chain": [
        "30170",
        "30160",
        "20278",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "2288",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا القاسم بن زكريا، قال حدثنا سعيد بن عمرو، قال حدثنا عبثر، عن العلاء بن المسيب، عن الحكم بن عتيبة، عن مجاهد، عن ابن عباس، قال صام رسول الله صلى الله عليه وسلم من المدينة حتى أتى قديدا ثم أفطر حتى أتى مكة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah fasted from Al-Madinah until he came to Qudaid, then he broke his fast until he reached Makkah.\"",
      "chain": [
        "36617",
        "11509",
        "11647",
        "11069",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3650",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أنبأنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، عن مالك، عن سعيد بن عمرو بن شرحبيل بن سعيد بن سعد بن عبادة، عن أبيه، عن جده، قال خرج سعد بن عبادة مع النبي صلى الله عليه وسلم في بعض مغازيه وحضرت أمه الوفاة بالمدينة فقيل لها أوصي‏.‏ فقالت فيم أوصي المال مال سعد‏.‏ فتوفيت قبل أن يقدم سعد فلما قدم سعد ذكر ذلك له فقال يا رسول الله هل ينفعها أن أتصدق عنها فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏‏.‏ فقال سعد حائط كذا وكذا صدقة عنها لحائط سماه‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Amr bin Shurahbil bin Sa'eed bin Sa'd bin 'Ubadah, from his father, that his grandfather said:                      \"Sa'd bin 'Ubadah went out with the Prophet on one of his campaigns, and death came to his mother in Al-Madinah. It was said to her (as she was dying): 'Make a will.' She said: 'To whom shall I make a will? The wealth belongs to Sa'd.' Then she died before Sa'd came. When Sa'd came, he was told about that and he said: 'O Messenger of Allah, will it benefit her if I give in charity on her behalf?' The Prophet said: 'Yes.' Sa'd said: 'Such and such a garden is given in charity on her behalf' -regarding a garden that he named.\"",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11509",
        "10602"
      ]
    }
  ],
  "total_hadiths": 21
}