{
  "id": "11515",
  "name": "'Abdullah bin Abi Labid عبد الله بن أبي لبيد",
  "full_name": "'Abdullah bin Abi Labid عبد الله بن أبي لبيد",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Madni",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19944",
      "name": "al-Muttalib bin 'Abdullah bin Hantab المطلب بن عبد الله بن حنطب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22010",
      "name": "Ibrahim bin Muhammad bin Abi Yahya إبراهيم بن محمد بن أبي يحيى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "307",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة عن وتر، رسول الله صلى الله عليه وسلم ‏.‏ فذكر الحديث قلت كيف كان يصنع في الجنابة أكان يغتسل قبل أن ينام أم ينام قبل أن يغتسل قالت كل ذلك قد كان يفعل ربما اغتسل فنام وربما توضأ فنام ‏.‏ قلت الحمد لله الذي جعل في الأمر سعة ‏.‏",
      "text_en": " 'Abdullah b. Abu'l-Qais reported:                      I asked 'A'isha about the Witr (prayer) of the Messenger of Allah (may peace be upon him) and made mention of a hadith, then I said: What did he do after having sexual intercourse? Did he take a bath before going to sleep or did he sleep before taking a bath? She said: He did all these. Some- times he took a bath and then slept, and sometimes he performed ablution only and went to sleep. I (the narrator) said: Praise be to Allah Who has made things easy (for human beings).",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "1488",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن عبد الله بن أبي لبيد، عن أبي سلمة بن عبد الرحمن، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم العشاء فإنها في كتاب الله العشاء وإنها تعتم بحلاب الإبل ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Messenger of Allah (may peace be upon him) said: Let the bedouin not gain upper band over you In regard to the name of your prayer, i. e. night prayer, for it is mentioned 'Isya' in the Book of Allah (i. e. the Qur'an). (The bedouin call it 'Atama because) they make delay in milling their she-camels.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11515",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "1760",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن عبد الله بن أبي لبيد، سمع أبا سلمة، قال أتيت عائشة فقلت أى أمه أخبريني عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقالت كانت صلاته في شهر رمضان وغيره ثلاث عشرة ركعة بالليل منها ركعتا الفجر ‏.‏",
      "text_en": " It is reported on the authority of 'A'isha that the prayer of Allah's Messenger (may peace be upon him) in the night consisted of ten rak'ahs. He observed a Witr and two rak'ahs (of Sunan) of the dawn prayer, and thus the total comes to thirteen rak'ahs.",
      "chain": [
        "30263",
        "20005",
        "11515",
        "10567"
      ]
    },
    {
      "hadith_no": "1307",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا أبو داود، قال حدثنا شعبة، عن يزيد بن خمير، قال سمعت عبد الله بن أبي قيس، يقول قالت عائشة رضى الله عنها لا تدع قيام الليل فإن رسول الله صلى الله عليه وسلم كان لا يدعه وكان إذا مرض أو كسل صلى قاعدا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Do not give up prayer at night, for the Messenger of Allah (ﷺ) would not leave it. Whenever he fell ill or lethargic, he would offer it sitting.",
      "chain": [
        "30160",
        "30002",
        "20020",
        "10981",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال قلت لعائشة رضى الله عنها ‏:‏ بكم كان رسول الله صلى الله عليه وسلم يوتر قالت ‏:‏ كان يوتر بأربع وثلاث، وست وثلاث، وثمان وثلاث، وعشر وثلاث، ولم يكن يوتر بأنقص من سبع، ولا بأكثر من ثلاث عشرة ‏.‏ قال أبو داود زاد أحمد بن صالح ‏:‏ ولم يكن يوتر بركعتين قبل الفجر ‏.‏ قلت ‏:‏ ما يوتر قالت ‏:‏ لم يكن يدع ذلك ‏.‏ ولم يذكر أحمد ‏:‏ وست وثلاث ‏.‏",
      "text_en": " 'Abd Allah b. Abi Qais said that he asked 'Aishah:                      How many rak'ahs would the Messenger of Allah (ﷺ) pray observing the witr ? She said: He used to observe the witr with four and three, six and three, eight and three, and ten and three rak'ahs never observing less than seven or more than thirteen.The narrator Ahmad added in his version: He would not observe the witr with two rak'ahs before the dawn. I asked: With what would he observe the witr ? She said: He would never leave it. The version of Ahmad does not mention the words \"six and three (rak'ahs)\".",
      "chain": [
        "30226",
        "30491",
        "20029",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثني عبد الرحمن بن مهدي، حدثني معاوية بن صالح، عن عبد الله بن أبي قيس، قال سمعت عائشة، - رضى الله عنها - تقول كان رسول الله صلى الله عليه وسلم يتحفظ من شعبان ما لا يتحفظ من غيره ثم يصوم لرؤية رمضان فإن غم عليه عد ثلاثين يوما ثم صام ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to count the days in Sha'ban in a manner he did not count any other month; then he fasted when he sighted the new moon of Ramadan; but if the weather was cloudy he counted thirty days and then fasted.",
      "chain": [
        "30007",
        "20033",
        "20675",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن عبد الله بن أبي قيس، سمع عائشة، تقول كان أحب الشهور إلى رسول الله صلى الله عليه وسلم أن يصومه شعبان ثم يصله برمضان ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The month most liked by the Messenger of Allah (ﷺ) for fasting was Sha'ban. He then joined it with Ramadan.",
      "chain": [
        "30007",
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "4712",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، ح وحدثنا موسى بن مروان الرقي، وكثير بن عبيد المذحجي، قالا حدثنا محمد بن حرب، - المعنى - عن محمد بن زياد، عن عبد الله بن أبي قيس، عن عائشة، قالت قلت يا رسول الله ذراري المؤمنين فقال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ فقلت يا رسول الله بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏ قلت يا رسول الله فذراري المشركين قال ‏\"‏ من آبائهم ‏\"‏ ‏.‏ قلت بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing.",
      "chain": [
        "38363",
        "20644",
        "35154",
        "38462",
        "30373",
        "11216",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كان قراءة النبي صلى الله عليه وسلم بالليل أكان يسر بالقراءة أم يجهر فقالت كل ذلك قد كان يفعل ربما أسر بالقراءة وربما جهر ‏.‏ فقلت الحمد لله الذي جعل في الأمر سعة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abdullah bin Abi Qais narrated:                     \"I asked Aishah how the recitation of the Prophet (S) was at night. [Would he recite silently o audibly?] So she said: 'He would do both of those. Sometimes he was silent with his recitation and sometimes it was audible.' So I said: 'All praise is due to Allah, the One who made the matter broad.'\"",
      "chain": [
        "30367",
        "20023",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "404",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كان نوم رسول الله صلى الله عليه وسلم في الجنابة أيغتسل قبل أن ينام أو ينام قبل أن يغتسل قالت كل ذلك قد كان يفعل ربما اغتسل فنام وربما توضأ فنام ‏‏.‏‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Qais said:                      \"I asked 'Aishah: 'How did the Messenger of Allah (ﷺ) sleep while he was Junub? Did he perform Ghusl before sleeping or sleep before performing Ghusl?' She said: 'He did both. Sometimes he would perform Ghusl then sleep, and sometimes he would perform Wudu' then sleep.'\"",
      "chain": [
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "546",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، - هو الحفري - عن سفيان، عن عبد الله بن أبي لبيد، عن أبي سلمة، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم هذه فإنهم يعتمون على الإبل وإنها العشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah (ﷺ) said: 'Do not let the Bedouin make you change the name of this prayer of yours, for they delay the prayer until it is very dark because of their preoccupation with camels and milking them. Verily, it is 'Isha'.'\"",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11515",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله بن المبارك، عن ابن عيينة، عن عبد الله بن أبي لبيد، عن أبي سلمة بن عبد الرحمن، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول على المنبر ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم ألا إنها العشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"I heard the Messenger of Allah (ﷺ) say on the Minbar: 'Do not let the Bedouin make you change the name of your prayer; verily, it is 'Isha'.'\"",
      "chain": [
        "38265",
        "20025",
        "20005",
        "11515",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا عبد الرحمن، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كانت قراءة رسول الله صلى الله عليه وسلم بالليل يجهر أم يسر قالت كل ذلك قد كان يفعل ربما جهر وربما أسر ‏.‏",
      "text_en": " It was narrated that Abdullah bin Abi Qais said:                     \"I asked Aishah: \"How did the Messenger of Allah (ﷺ) recite at night- did he recite loudly or silently?\" She said: 'He used to do both; sometimes he recited loudly and sometimes he recited silently.'\"",
      "chain": [
        "20033",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "2179",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن عبد الله بن أبي لبيد، عن أبي سلمة، قال سألت عائشة فقلت أخبريني عن صيام، رسول الله صلى الله عليه وسلم قالت كان يصوم حتى نقول قد صام ويفطر حتى نقول قد أفطر ولم يكن يصوم شهرا أكثر من شعبان كان يصوم شعبان إلا قليلا كان يصوم شعبان كله ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                     \"I asked Aishah: 'Tell me about the fasting of the Messenger of Allah.' She said: 'he used to fast until we said: he is going to fast until we said: He is not going to fast. He never fasted any month more than Shaban. He used to fast (all) of Shaban except a little, he used to fast all of Shaban.\"' '",
      "chain": [
        "20012",
        "11515",
        "10567"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ابن وهب، قال حدثنا معاوية بن صالح، أن عبد الله بن أبي قيس، حدثه أنه، سمع عائشة، تقول كان أحب الشهور إلى رسول الله صلى الله عليه وسلم أن يصومه شعبان بل كان يصله برمضان ‏.‏",
      "text_en": " Aishah said:                     \"The month which the Messenger of Allah most liked to fast was Shaban; indeed he used to join it to Ramadan.\"",
      "chain": [
        "30583",
        "20029",
        "20675",
        "11515"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن عبد الله بن أبي لبيد، عن أبي سلمة، عن ابن عمر، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم فإنها العشاء وإنهم ليعتمون بالإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I heard the Messenger of Allah say: 'Do not let the Bedouin make you change the name of your prayer. It is the 'Isha', and they bring their camels in and milk them at nightfall.'\"",
      "chain": [
        "30288",
        "30269",
        "20005",
        "11515",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "3035",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن عبد الله بن أبي لبيد، عن المطلب بن عبد الله بن حنطب، عن خلاد بن السائب، عن زيد بن خالد الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ جاءني جبريل فقال يا محمد مر أصحابك فليرفعوا أصواتهم بالتلبية فإنها من شعار الحج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Zaid bin Khalid Al-Juhani that the Messenger ofAllah(ﷺ) said:                      “Jibril came to me and said: ‘O Muhammad! Tell yourCompanions to raise their voices when reciting the Talbiyah, for itisone of the symbols of Hajj.’”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11515",
        "19944",
        "1600",
        "3625"
      ]
    }
  ],
  "total_hadiths": 17
}