{
  "id": "11519",
  "name": "'Abdur Rahman bin 'Abdullah bin Ka'b عبد الرحمن بن عبد الله بن كعب بن مالك",
  "full_name": "'Abdur Rahman bin 'Abdullah bin Ka'b عبد الرحمن بن عبد الله بن كعب بن مالك",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Jusham B.al-Khazraj",
      "B.Salima",
      "B.Sawad",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "1131",
      "name": "'Abdullah bin Ka'b bin Malik b. Abi Ka'b ( عبد الله بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "19819",
      "name": "'Amr bin 'Abdullah عمرو بن عبد الله بن كعب بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1131",
      "name": "'Abdullah bin Ka'b bin Malik b. Abi Ka'b ( عبد الله بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "390",
      "name": "Ka'b bin Malik bin Abi Ka'b ( كعب بن مالك بن أبى كعب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1132",
      "name": "'Ubaydullah bin Ka'b bin Malik ( عبيد الله بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18893",
      "name": "Muhammad bin Abi Umama bin Sahl محمد بن أبي أمامة بن سهل بن حنيف",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2757",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب، قال سمعت كعب بن مالك  رضى الله عنه‏.‏ قلت يا رسول الله، إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله صلى الله عليه وسلم‏.‏ قال ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏ قلت فإني أمسك سهمي الذي بخيبر‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     I said, \"O Allah's Apostle! For the acceptance of my repentance I wish to give all my property in charity for Allah's sake through His Apostle .\" He said, \"It is better for you to keep some of the property for yourself.\" I said, \"Then I will keep my share in Khaibar.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "2947",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب  رضى الله عنه  وكان قائد كعب من بنيه قال سمعت كعب بن مالك حين تخلف عن رسول الله صلى الله عليه وسلم‏.‏ ولم يكن رسول الله صلى الله عليه وسلم يريد غزوة إلا ورى بغيرها‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     Whenever Allah's Apostle intended to lead a Ghazwa, he would use an equivocation from which one would understand that he was going to a different destination .",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "2948",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وحدثني أحمد بن محمد، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، قال سمعت كعب بن مالك  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم قلما يريد غزوة يغزوها إلا ورى بغيرها، حتى كانت غزوة تبوك، فغزاها رسول الله صلى الله عليه وسلم في حر شديد، واستقبل سفرا بعيدا ومفازا، واستقبل غزو عدو كثير، فجلى للمسلمين أمرهم، ليتأهبوا أهبة عدوهم، وأخبرهم بوجهه الذي يريد‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     Whenever Allah's Apostle intended to carry out a Ghazwa, he would use an equivocation to conceal his real destination till it was the Ghazwa of Tabuk which Allah's Apostle carried out in very hot weather. As he was going to face a very long journey through a wasteland and was to meet and attack a large number of enemies. So, he made the situation clear to the Muslims so that they might prepare themselves accordingly and get ready to conquer their enemy. The Prophet informed them of the destination he was heading for.",
      "chain": [
        "30304",
        "20025",
        "20475",
        "11013",
        "11519",
        "390"
      ]
    },
    {
      "hadith_no": "3088",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب، عن أبيه، وعمه، عبيد الله بن كعب عن كعب  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قدم من سفر ضحى دخل المسجد، فصلى ركعتين قبل أن يجلس‏.‏",
      "text_en": " Narrated Ka`b:                     Whenever the Prophet returned from a journey in the forenoon, he would enter the Mosque and offer two rak`at before sitting.",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "3596",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب، قال سمعت كعب بن مالك، يحدث حين تخلف عن تبوك، قال فلما سلمت على رسول الله صلى الله عليه وسلم وهو يبرق وجهه من السرور، وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه، حتى كأنه قطعة قمر، وكنا نعرف ذلك منه‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking after his failure to join (the Ghazwa of) Tabuk. He said, \"When I greeted Allah's Apostle whose face was glittering with happiness, for whenever Allah's Apostle was happy, his face used to glitter, as if it was a piece of the moon, and we used to recognize it (i.e. his happiness) from his face.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3937",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب  وكان قائد كعب حين عمي  قال سمعت كعب بن مالك يحدث حين تخلف عن النبي صلى الله عليه وسلم في غزوة تبوك‏.‏ بطوله، قال ابن بكير في حديثه ولقد شهدت مع النبي صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدر وإن كانت بدر، أذكر في الناس منها‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     Who was Ka`b's guide when Ka`b turned blind: I heard Ka`b bin Malik narrating: When he remained behind (i.e. did not Join) the Prophet in the Ghazwa of Tabuk. Ibn Bukair, in his narration stated that Ka`b said, \" I witnessed the Al-`Aqaba pledge of allegiance at night with the Prophet when we jointly agreed to support Islam with all our efforts I would not like to have attended the Badr battle instead of that 'Aqaba pledge although Badr is more well-known than it, amongst the people.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3999",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب، قال سمعت كعب بن مالك  رضى الله عنه  يقول لم أتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها إلا في غزوة تبوك، غير أني تخلفت عن غزوة بدر، ولم يعاتب أحد تخلف عنها، إنما خرج رسول الله صلى الله عليه وسلم يريد عير قريش، حتى جمع الله بينهم وبين عدوهم على غير ميعاد‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     I never failed to join Allah's Apostle in any of his Ghazawat except in the Ghazwa of Tabuk. However, I did not take part in the Ghazwa of Badr, but none who failed to take part in it, was blamed, for Allah's Apostle had gone out to meet the caravans of (Quraish, but Allah caused them (i.e. Muslims) to meet their enemy unexpectedly (with no previous intention) .",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4253",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال شبيب عن يونس، عن ابن شهاب، أخبرني ابن المسيب، وعبد الرحمن بن عبد الله بن كعب، أن أبا هريرة، قال شهدنا مع النبي صلى الله عليه وسلم حنينا‏.‏ وقال ابن المبارك عن يونس عن الزهري عن سعيد عن النبي صلى الله عليه وسلم‏.‏ تابعه صالح عن الزهري‏.‏ وقال الزبيدي أخبرني الزهري أن عبد الرحمن بن كعب أخبره أن عبيد الله بن كعب قال أخبرني من شهد مع النبي صلى الله عليه وسلم خيبر‏.‏ قال الزهري وأخبرني عبيد الله بن عبد الله وسعيد عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "20238",
        "20475",
        "11013",
        "11002",
        "11519",
        "13"
      ]
    },
    {
      "hadith_no": "4462",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب بن مالك  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، يحدث حين تخلف عن قصة، تبوك قال كعب لم أتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها إلا في غزوة تبوك، غير أني كنت تخلفت في غزوة بدر، ولم يعاتب أحدا تخلف، عنها إنما خرج رسول الله صلى الله عليه وسلم يريد عير قريش، حتى جمع الله بينهم وبين عدوهم على غير ميعاد ولقد شهدت مع رسول الله صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدر، وإن كانت بدر أذكر في الناس منها، كان من خبري أني لم أكن قط أقوى ولا أيسر حين تخلفت عنه في تلك الغزوة، والله ما اجتمعت عندي قبله راحلتان قط حتى جمعتهما في تلك الغزوة، ولم يكن رسول الله صلى الله عليه وسلم يريد غزوة إلا ورى بغيرها، حتى كانت تلك الغزوة، غزاها رسول الله صلى الله عليه وسلم في حر شديد، واستقبل سفرا بعيدا ومفازا وعدوا كثيرا، فجلى للمسلمين أمرهم ليتأهبوا أهبة غزوهم، فأخبرهم بوجهه الذي يريد، والمسلمون مع رسول الله صلى الله عليه وسلم كثير، ولا يجمعهم كتاب حافظ  يريد الديوان  قال كعب فما رجل يريد أن يتغيب إلا ظن أن سيخفى له ما لم ينزل فيه وحى الله، وغزا رسول الله صلى الله عليه وسلم تلك الغزوة حين طابت الثمار والظلال، وتجهز رسول الله صلى الله عليه وسلم والمسلمون معه، فطفقت أغدو لكى أتجهز معهم فأرجع ولم أقض شيئا، فأقول في نفسي أنا قادر عليه‏.‏ فلم يزل يتمادى بي حتى اشتد بالناس الجد، فأصبح رسول الله صلى الله عليه وسلم والمسلمون معه ولم أقض من جهازي شيئا، فقلت أتجهز بعده بيوم أو يومين ثم ألحقهم، فغدوت بعد أن فصلوا لأتجهز، فرجعت ولم أقض شيئا، ثم غدوت ثم رجعت ولم أقض شيئا، فلم يزل بي حتى أسرعوا وتفارط الغزو، وهممت أن أرتحل فأدركهم، وليتني فعلت، فلم يقدر لي ذلك، فكنت إذا خرجت في الناس بعد خروج رسول الله صلى الله عليه وسلم فطفت فيهم، أحزنني أني لا أرى إلا رجلا مغموصا عليه النفاق أو رجلا ممن عذر الله من الضعفاء، ولم يذكرني رسول الله صلى الله عليه وسلم حتى بلغ تبوك، فقال وهو جالس في القوم بتبوك ‏\"‏ ما فعل كعب ‏\"‏‏.‏ فقال رجل من بني سلمة يا رسول الله، حبسه برداه ونظره في عطفه‏.‏ فقال معاذ بن جبل بئس ما قلت، والله يا رسول الله، ما علمنا عليه إلا خيرا‏.‏ فسكت رسول الله صلى الله عليه وسلم‏.‏ قال كعب بن مالك فلما بلغني أنه توجه قافلا حضرني همي، وطفقت أتذكر الكذب وأقول بماذا أخرج من سخطه غدا واستعنت على ذلك بكل ذي رأى من أهلي، فلما قيل إن رسول الله صلى الله عليه وسلم قد أظل قادما زاح عني الباطل، وعرفت أني لن أخرج منه أبدا بشىء فيه كذب، فأجمعت صدقه، وأصبح رسول الله صلى الله عليه وسلم قادما، وكان إذا قدم من سفر بدأ بالمسجد فيركع فيه ركعتين ثم جلس للناس، فلما فعل ذلك جاءه المخلفون، فطفقوا يعتذرون إليه، ويحلفون له، وكانوا بضعة وثمانين رجلا فقبل منهم رسول الله صلى الله عليه وسلم علانيتهم، وبايعهم واستغفر لهم، ووكل سرائرهم إلى الله، فجئته فلما سلمت عليه تبسم تبسم المغضب، ثم قال ‏\"‏ تعال ‏\"‏‏.‏ فجئت أمشي حتى جلست بين يديه، فقال لي ‏\"‏ ما خلفك ألم تكن قد ابتعت ظهرك ‏\"‏‏.‏ فقلت بلى، إني والله لو جلست عند غيرك من أهل الدنيا، لرأيت أن سأخرج من سخطه بعذر، ولقد أعطيت جدلا، ولكني والله لقد علمت لئن حدثتك اليوم حديث كذب ترضى به عني ليوشكن الله أن يسخطك على، ولئن حدثتك حديث صدق تجد على فيه إني لأرجو فيه عفو الله، لا والله ما كان لي من عذر، والله ما كنت قط أقوى ولا أيسر مني حين تخلفت عنك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هذا فقد صدق، فقم حتى يقضي الله فيك ‏\"‏‏.‏ فقمت وثار رجال من بني سلمة فاتبعوني، فقالوا لي والله ما علمناك كنت أذنبت ذنبا قبل هذا، ولقد عجزت أن لا تكون اعتذرت إلى رسول الله صلى الله عليه وسلم بما اعتذر إليه المتخلفون، قد كان كافيك ذنبك استغفار رسول الله صلى الله عليه وسلم لك، فوالله ما زالوا يؤنبوني حتى أردت أن أرجع فأكذب نفسي، ثم قلت لهم هل لقي هذا معي أحد قالوا نعم، رجلان قالا مثل ما قلت، فقيل لهما مثل ما قيل لك‏.‏ فقلت من هما قالوا مرارة بن الربيع العمري وهلال بن أمية الواقفي‏.‏ فذكروا لي رجلين صالحين قد شهدا بدرا فيهما إسوة، فمضيت حين ذكروهما لي، ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة من بين من تخلف عنه، فاجتنبنا الناس وتغيروا لنا حتى تنكرت في نفسي الأرض، فما هي التي أعرف، فلبثنا على ذلك خمسين ليلة، فأما صاحباى فاستكانا وقعدا في بيوتهما يبكيان، وأما أنا فكنت أشب القوم وأجلدهم، فكنت أخرج فأشهد الصلاة مع المسلمين وأطوف في الأسواق، ولا يكلمني أحد، وآتي رسول الله صلى الله عليه وسلم فأسلم عليه وهو في مجلسه بعد الصلاة، فأقول في نفسي هل حرك شفتيه برد السلام على أم لا ثم أصلي قريبا منه فأسارقه النظر، فإذا أقبلت على صلاتي أقبل إلى، وإذا التفت نحوه أعرض عني، حتى إذا طال على ذلك من جفوة الناس مشيت حتى تسورت جدار حائط أبي قتادة وهو ابن عمي وأحب الناس إلى، فسلمت عليه، فوالله ما رد على السلام، فقلت يا أبا قتادة، أنشدك بالله هل تعلمني أحب الله ورسوله فسكت، فعدت له فنشدته فسكت، فعدت له فنشدته‏.‏ فقال الله ورسوله أعلم‏.‏ ففاضت عيناى وتوليت حتى تسورت الجدار، قال فبينا أنا أمشي بسوق المدينة إذا نبطي من أنباط أهل الشأم ممن قدم بالطعام يبيعه بالمدينة يقول من يدل على كعب بن مالك فطفق الناس يشيرون له، حتى إذا جاءني دفع إلى كتابا من ملك غسان، فإذا فيه أما بعد فإنه قد بلغني أن صاحبك قد جفاك، ولم يجعلك الله بدار هوان ولا مضيعة، فالحق بنا نواسك‏.‏ فقلت لما قرأتها وهذا أيضا من البلاء‏.‏ فتيممت بها التنور فسجرته بها، حتى إذا مضت أربعون ليلة من الخمسين إذا رسول رسول الله صلى الله عليه وسلم يأتيني فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك فقلت أطلقها أم ماذا أفعل قال لا بل اعتزلها ولا تقربها‏.‏ وأرسل إلى صاحبى مثل ذلك، فقلت لامرأتي الحقي بأهلك فتكوني عندهم حتى يقضي الله في هذا الأمر‏.‏ قال كعب فجاءت امرأة هلال بن أمية رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن هلال بن أمية شيخ ضائع ليس له خادم فهل تكره أن أخدمه قال ‏\"‏ لا ولكن لا يقربك ‏\"‏‏.‏ قالت إنه والله ما به حركة إلى شىء، والله ما زال يبكي منذ كان من أمره ما كان إلى يومه هذا‏.‏ فقال لي بعض أهلي لو استأذنت رسول الله صلى الله عليه وسلم في امرأتك كما أذن لامرأة هلال بن أمية أن تخدمه فقلت والله لا أستأذن فيها رسول الله صلى الله عليه وسلم وما يدريني ما يقول رسول الله صلى الله عليه وسلم إذا استأذنته فيها وأنا رجل شاب فلبثت بعد ذلك عشر ليال حتى كملت لنا خمسون ليلة من حين نهى رسول الله صلى الله عليه وسلم عن كلامنا، فلما صليت صلاة الفجر صبح خمسين ليلة، وأنا على ظهر بيت من بيوتنا، فبينا أنا جالس على الحال التي ذكر الله، قد ضاقت على نفسي، وضاقت على الأرض بما رحبت، سمعت صوت صارخ أوفى على جبل سلع بأعلى صوته يا كعب بن مالك، أبشر‏.‏ قال فخررت ساجدا، وعرفت أن قد جاء فرج، وآذن رسول الله صلى الله عليه وسلم بتوبة الله علينا حين صلى صلاة الفجر، فذهب الناس يبشروننا، وذهب قبل صاحبى مبشرون، وركض إلى رجل فرسا، وسعى ساع من أسلم فأوفى على الجبل وكان الصوت أسرع من الفرس، فلما جاءني الذي سمعت صوته يبشرني نزعت له ثوبى، فكسوته إياهما ببشراه، والله ما أملك غيرهما يومئذ، واستعرت ثوبين فلبستهما، وانطلقت إلى رسول الله صلى الله عليه وسلم فيتلقاني الناس فوجا فوجا يهنوني بالتوبة، يقولون لتهنك توبة الله عليك‏.‏ قال كعب حتى دخلت المسجد، فإذا رسول الله صلى الله عليه وسلم جالس حوله الناس فقام إلى طلحة بن عبيد الله يهرول حتى صافحني وهناني، والله ما قام إلى رجل من المهاجرين غيره، ولا أنساها لطلحة، قال كعب فلما سلمت على رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم وهو يبرق وجهه من السرور ‏\"‏ أبشر بخير يوم مر عليك منذ ولدتك أمك ‏\"‏‏.‏ قال قلت أمن عندك يا رسول الله أم من عند الله قال ‏\"‏ لا، بل من عند الله ‏\"‏‏.‏ وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأنه قطعة قمر، وكنا نعرف ذلك منه، فلما جلست بين يديه قلت يا رسول الله، إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسول الله‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏‏.‏ قلت فإني أمسك سهمي الذي بخيبر، فقلت يا رسول الله، إن الله إنما نجاني بالصدق، وإن من توبتي أن لا أحدث إلا صدقا ما بقيت، فوالله ما أعلم أحدا من المسلمين أبلاه الله في صدق الحديث منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم أحسن مما أبلاني، ما تعمدت منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا كذبا، وإني لأرجو أن يحفظني الله فيما بقيت وأنزل الله على رسوله صلى الله عليه وسلم ‏{‏لقد تاب الله على النبي والمهاجرين‏}‏ إلى قوله ‏{‏وكونوا مع الصادقين‏}‏ فوالله ما أنعم الله على من نعمة قط بعد أن هداني للإسلام أعظم في نفسي من صدقي لرسول الله صلى الله عليه وسلم أن لا أكون كذبته، فأهلك كما هلك الذين كذبوا، فإن الله قال للذين كذبوا حين أنزل الوحى شر ما قال لأحد، فقال تبارك وتعالى ‏{‏سيحلفون بالله لكم إذا انقلبتم‏}‏ إلى قوله ‏{‏فإن الله لا يرضى عن القوم الفاسقين‏}‏‏.‏ قال كعب وكنا تخلفنا أيها الثلاثة عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا له، فبايعهم واستغفر لهم وأرجأ رسول الله صلى الله عليه وسلم أمرنا حتى قضى الله فيه، فبذلك قال الله ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ وليس الذي ذكر الله مما خلفنا عن الغزو إنما هو تخليفه إيانا وإرجاؤه أمرنا عمن حلف له واعتذر إليه، فقبل منه‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b bin Malik:                     Who, from among Ka`b's sons, was the guide of Ka`b when he became blind: I heard Ka`b bin Malik narrating the story of (the Ghazwa of) Tabuk in which he failed to take part. Ka`b said, \"I did not remain behind Allah's Apostle in any Ghazwa that he fought except the Ghazwa of Tabuk, and I failed to take part in the Ghazwa of Badr, but Allah did not admonish anyone who had not participated in it, for in fact, Allah's Apostle had gone out in search of the caravan of Quraish till Allah made them (i.e. the Muslims) and their enemy meet without any appointment. I witnessed the night of Al-`Aqaba (pledge) with Allah's Apostle when we pledged for Islam, and I would not exchange it for the Badr battle although the Badr battle is more popular amongst the people than it (i.e. Al-`Aqaba pledge). As for my news (in this battle of Tabuk), I had never been stronger or wealthier than I was when I remained behind the Prophet in that Ghazwa. By Allah, never had I two she-camels before, but I had then at the time of this Ghazwa. Whenever Allah's Apostle wanted to make a Ghazwa, he used to hide his intention by apparently referring to different Ghazwa till it was the time of that Ghazwa (of Tabuk) which Allah's Apostle fought in severe heat, facing, a long journey, desert, and the great number of enemy. So the Prophet announced to the Muslims clearly (their destination) so that they might get prepared for their Ghazwa. So he informed them clearly of the destination he was going to. Allah's Apostle was accompanied by a large number of Muslims who could not be listed in a book namely, a register.\" Ka`b added, \"Any man who intended to be absent would think that the matter would remain hidden unless Allah revealed it through Divine Revelation. So Allah's Apostle fought that Ghazwa at the time when the fruits had ripened and the shade looked pleasant. Allah's Apostle and his companions prepared for the battle and I started to go out in order to get myself ready along with them, but I returned without doing anything. I would say to myself, 'I can do that.' So I kept on delaying it every now and then till the people got ready and Allah's Apostle and the Muslims along with him departed, and I had not prepared anything for my departure, and I said, I will prepare myself (for departure) one or two days after him, and then join them.' In the morning following their departure, I went out to get myself ready but returned having done nothing. Then again in the next morning, I went out to get ready but returned without doing anything. Such was the case with me till they hurried away and the battle was missed (by me). Even then I intended to depart to take them over. I wish I had done so! But it was not in my luck. So, after the departure of Allah's Apostle, whenever I went out and walked amongst the people (i.e, the remaining persons), it grieved me that I could see none around me, but one accused of hypocrisy or one of those weak men whom Allah had excused. Allah's Apostle did not remember me till he reached Tabuk. So while he was sitting amongst the people in Tabuk, he said, 'What did Ka`b do?' A man from Banu Salama said, 'O Allah's Apostle! He has been stopped by his two Burdas (i.e. garments) and his looking at his own flanks with pride.' Then Mu`adh bin Jabal said, 'What a bad thing you have said! By Allah! O Allahs Apostle! We know nothing about him but good.' Allah's Apostle kept silent.\" Ka`b bin Malik added, \"When I heard that he (i.e. the Prophet ) was on his way back to Medina. I got dipped in my concern, and began to think of false excuses, saying to myself, 'How can I avoid his anger tomorrow?' And I took the advice of wise member of my family in this matter. When it was said that Allah's Apostle, had come near all the evil false excuses abandoned from my mind and I knew well that I could never come out of this problem by forging a false statement. Then I decided firmly to speak the truth. So Allah's Apostle arrived in the morning, and whenever he returned from a journey., he used to visit the Mosque first of all and offer a two-rak`at prayer therein and then sit for the people. So when he had done all that (this time), those who had failed to join the battle (of Tabuk) came and started offering (false) excuses and taking oaths before him. They were something over eighty men; Allah's Apostle accepted the excuses they had expressed, took their pledge of allegiance asked for Allah's Forgiveness for them, and left the secrets of their hearts for Allah to judge. Then I came to him, and when I greeted him, he smiled a smile of an angry person and then said, 'Come on.' So I came walking till I sat before him. He said to me, 'What stopped you from joining us. Had you not purchased an animal For carrying you?' I answered, \"Yes, O Allah's Apostle! But by Allah, if I were sitting before any person from among the people of the world other than you, I would have avoided his anger with an excuse. By Allah, I have been bestowed with the power of speaking fluently and eloquently, but by Allah, I knew well that if today I tell you a lie to seek your favor, Allah would surely make you angry with me in the near future, but if I tell you the truth, though you will get angry because of it, I hope for Allah's Forgiveness. Really, by Allah, there was no excuse for me. By Allah, I had never been stronger or wealthier than I was when I remained behind you.' Then Allah's Apostle said, 'As regards this man, he has surely told the truth. So get up till Allah decides your case.' I got up, and many men of Banu Salama followed me and said to me. 'By Allah, we never witnessed you doing any sin before this. Surely, you failed to offer excuse to Allah's Apostle as the others who did not join him, have offered. The prayer of Allah's Apostle to Allah to forgive you would have been sufficient for you.' By Allah, they continued blaming me so much that I intended to return (to the Prophet) and accuse myself of having told a lie, but I said to them, 'Is there anybody else who has met the same fate as I have?' They replied, 'Yes, there are two men who have said the same thing as you have, and to both of them was given the same order as given to you.' I said, 'Who are they?' They replied, Murara bin Ar-Rabi Al- Amri and Hilal bin Umaiya Al-Waqifi.' By that they mentioned to me two pious men who had attended the Ghazwa (Battle) of Badr, and in whom there was an example for me. So I did not change my mind when they mentioned them to me. Allah's Apostle forbade all the Muslims to talk to us, the three aforesaid persons out of all those who had remained behind in that Ghazwa. So we kept away from the people and they changed their attitude towards us till the very land (where I lived) appeared strange to me as if I did not know it. We remained in that condition for fifty nights. As regards my two fellows, they remained in their houses and kept on weeping, but I was the youngest of them and the firmest of them, so I used to go out and witness the prayers along with the Muslims and roam about in the markets, but none would talk to me, and I would come to Allah's Apostle and greet him while he was sitting In his gathering after the prayer, and I would wonder whether the Prophet did move his lips in return to my greetings or not. Then I would offer my prayer near to him and look at him stealthily. When I was busy with my prayer, he would turn his face towards me, but when I turned my face to him, he would turn his face away from me. When this harsh attitude of the people lasted long, I walked till I scaled the wall of the garden of Abu Qatada who was my cousin and dearest person to me, and I offered my greetings to him. By Allah, he did not return my greetings. I said, 'O Abu Qatada! I beseech you by Allah! Do you know that I love Allah and His Apostle?' He kept quiet. I asked him again, beseeching him by Allah, but he remained silent. Then I asked him again in the Name of Allah. He said, \"Allah and His Apostle know it better.' Thereupon my eyes flowed with tears and I returned and jumped over the wall.\" Ka`b added, \"While I was walking in the market of Medina, suddenly I saw a Nabati (i.e. a Christian farmer) from the Nabatis of Sham who came to sell his grains in Medina, saying, 'Who will lead me to Ka`b bin Malik?' The people began to point (me) out for him till he came to me and handed me a letter from the king of Ghassan in which the following was written: \"To proceed, I have been informed that your friend (i.e. the Prophet ) has treated you harshly. Anyhow, Allah does not let you live at a place where you feel inferior and your right is lost. So join us, and we will console you.\" When I read it, I said to myself, 'This is also a sort of a test.' Then I took the letter to the oven and made a fire therein by burning it. When forty out of the fifty nights elapsed, behold ! There came to me the messenger of Allah's Apostle and said, 'Allah's Apostle orders you to keep away from your wife,' I said, 'Should I divorce her; or else! what should I do?' He said, 'No, only keep aloof from her and do not cohabit her.' The Prophet sent the same message to my two fellows. Then I said to my wife. 'Go to your parents and remain with them till Allah gives His Verdict in this matter.\" Ka`b added, \"The wife of Hilal bin Umaiya came to Apostle and said, 'O Allah's Apostle! Hilal bin Umaiya is a helpless old man who has no servant to attend on him. Do you dislike that I should serve him? ' He said, 'No (you can serve him) but he should not come near you.' She said, 'By Allah, he has no desire for anything. By, Allah, he has never ceased weeping till his case began till this day of his.' (continued...) (continuing... 1): -5.702:... ... On that, some of my family members said to me, 'Will you also ask Allah's Apostle to permit your wife (to serve you) as he has permitted the wife of Hilal bin Umaiya to serve him?' I said, 'By Allah, I will not ask the permission of Allah's Apostle regarding her, for I do not know What Allah's Apostle would say if I asked him to permit her (to serve me) while I am a young man.' Then I remained in that state for ten more nights after that till the period of fifty nights was completed starting from the time when Allah's Apostle prohibited the people from talking to us. When I had offered the Fajr prayer on the 50th morning on the roof of one of our houses and while I was sitting in the condition which Allah described (in the Qur'an) i.e. my very soul seemed straitened to me and even the earth seemed narrow to me for all its spaciousness, there I heard the voice of one who had ascended the mountain of Sala' calling with his loudest voice, 'O Ka`b bin Malik! Be happy (by receiving good tidings).' I fell down in prostration before Allah, realizing that relief has come. Allah's Apostle had announced the acceptance of our repentance by Allah when he had offered the Fajr prayer. The people then went out to congratulate us. Some bringers of good tidings went out to my two fellows, and a horseman came to me in haste, and a man of Banu Aslam came running and ascended the mountain and his voice was swifter than the horse. When he (i.e. the man) whose voice I had heard, came to me conveying the good tidings, I took off my garments and dressed him with them; and by Allah, I owned no other garments than them on that day. Then I borrowed two garments and wore them and went to Allah's Apostle. The people started receiving me in batches, congratulating me on Allah's Acceptance of my repentance, saying, 'We congratulate you on Allah's Acceptance of your repentance.\" Ka`b further said, \"When I entered the Mosque. I saw Allah's Apostle sitting with the people around him. Talha bin Ubaidullah swiftly came to me, shook hands with me and congratulated me. By Allah, none of the Muhajirin (i.e. Emigrants) got up for me except him (i.e. Talha), and I will never forget this for Talha.\" Ka`b added, \"When I greeted Allah's Apostle he, his face being bright with joy, said \"Be happy with the best day that you have got ever since your mother delivered you.\" Ka`b added, \"I said to the Prophet 'Is this forgiveness from you or from Allah?' He said, 'No, it is from Allah.' Whenever Allah's Apostle became happy, his face would shine as if it were a piece of moon, and we all knew that characteristic of him. When I sat before him, I said, 'O Allah's Apostle! Because of the acceptance of my repentance I will give up all my wealth as alms for the Sake of Allah and His Apostle. Allah's Apostle said, 'Keep some of your wealth, as it will be better for you.' I said, 'So I will keep my share from Khaibar with me,' and added, 'O Allah's Apostle! Allah has saved me for telling the truth; so it is a part of my repentance not to tell but the truth as long as I am alive. By Allah, I do not know anyone of the Muslims whom Allah has helped fortelling the truth more than me. Since I have mentioned that truth to Allah's Apostle till today, I have never intended to tell a lie. I hope that Allah will also save me (from telling lies) the rest of my life. So Allah revealed to His Apostle the Verse:-- \"Verily, Allah has forgiven the Prophet, the Muhajirin (i.e. Emigrants (up to His Saying) And be with those who are true (in word and deed).\" (9.117-119) By Allah, Allah has never bestowed upon me, apart from His guiding me to Islam, a Greater blessing than the fact that I did not tell a lie to Allah's Apostle which would have caused me to perish as those who have told a lie perished, for Allah described those who told lies with the worst description He ever attributed to anybody else. Allah said:-- \"They (i.e. the hypocrites) will swear by Allah to you when you return to them (up to His Saying) Certainly Allah is not pleased with the rebellious people-- \" (9.95-96) Ka`b added, \"We, the three persons, differed altogether from those whose excuses Allah's Apostle accepted when they swore to him. He took their pledge of allegiance and asked Allah to forgive them, but Allah's Apostle left our case pending till Allah gave His Judgment about it. As for that Allah said):-- And to the three (He did for give also) who remained behind.\" (9.118) What Allah said (in this Verse) does not indicate our failure to take part in the Ghazwa, but it refers to the deferment of making a decision by the Prophet about our case in contrast to the case of those who had taken an oath before him and he excused them by accepting their excuses.",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، حدثنا أحمد بن أبي شعيب، حدثنا موسى بن أعين، حدثنا إسحاق بن راشد، أن الزهري، حدثه قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك،، وهو أحد الثلاثة الذين تيب عليهم أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين غزوة العسرة وغزوة بدر‏.‏ قال فأجمعت صدق رسول الله صلى الله عليه وسلم ضحى، وكان قلما يقدم من سفر سافره إلا ضحى وكان يبدأ بالمسجد، فيركع ركعتين، ونهى النبي صلى الله عليه وسلم عن كلامي وكلام صاحبى، ولم ينه عن كلام أحد من المتخلفين غيرنا، فاجتنب الناس كلامنا، فلبثت كذلك حتى طال على الأمر، وما من شىء أهم إلى من أن أموت فلا يصلي على النبي صلى الله عليه وسلم أو يموت رسول الله صلى الله عليه وسلم فأكون من الناس بتلك المنزلة، فلا يكلمني أحد منهم، ولا يصلي على، فأنزل الله توبتنا على نبيه صلى الله عليه وسلم حين بقي الثلث الآخر من الليل، ورسول الله صلى الله عليه وسلم عند أم سلمة، وكانت أم سلمة محسنة في شأني معنية في أمري، فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أم سلمة تيب على كعب ‏\"‏‏.‏ قالت أفلا أرسل إليه فأبشره قال ‏\"‏ إذا يحطمكم الناس فيمنعونكم النوم سائر الليلة ‏\"‏‏.‏ حتى إذا صلى رسول الله صلى الله عليه وسلم صلاة الفجر آذن بتوبة الله علينا، وكان إذا استبشر استنار وجهه حتى كأنه قطعة من القمر، وكنا أيها الثلاثة الذين خلفوا عن الأمر الذي قبل من هؤلاء الذين اعتذروا حين أنزل الله لنا التوبة، فلما ذكر الذين كذبوا رسول الله صلى الله عليه وسلم من المتخلفين، واعتذروا بالباطل، ذكروا بشر ما ذكر به أحد قال الله سبحانه ‏{‏يعتذرون إليكم إذا رجعتم إليهم قل لا تعتذروا لن نؤمن لكم قد نبأنا الله من أخباركم وسيرى الله عملكم ورسوله‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik who was one of the three who were forgiven, saying that he had never remained behind Allah's Apostle in any Ghazwa which he had fought except two Ghazwat Ghazwat- Al-`Usra (Tabuk) and Ghazwat-Badr. He added. \"I decided to tell the truth to Allah's Apostle in the forenoon, and scarcely did he return from a journey he made, except in the forenoon, he would go first to the mosque and offer a two-rak`at prayer. The Prophet forbade others to speak to me or to my two companions, but he did not prohibit speaking to any of those who had remained behind excepting us. So the people avoided speaking to us, and I stayed in that state till I could no longer bear it, and the only thing that worried me was that I might die and the Prophet would not offer the funeral prayer for me, or Allah's Apostle might die and I would be left in that social status among the people that nobody would speak to me or offer the funeral prayer for me. But Allah revealed His Forgiveness for us to the Prophet in the last third of the night while Allah's Apostle was with Um Salama. Um Salama sympathized with me and helped me in my disaster. Allah's Apostle said, 'O Um Salama! Ka`b has been forgiven!' She said, 'Shall I send someone to him to give him the good tidings?' He said, 'If you did so, the people would not let you sleep the rest of the night.' So when the Prophet had offered the Fajr prayer, he announced Allah's Forgiveness for us. His face used to look as bright as a piece of the (full) moon whenever he was pleased. When Allah revealed His Forgiveness for us, we were the three whose case had been deferred while the excuse presented by those who had apologized had been accepted. But when there were mentioned those who had told the Prophet lies and remained behind (the battle of Tabuk) and had given false excuses, they were described with the worse description one may be described with. Allah said: 'They will present their excuses to you (Muslims) when you return to them. Say: Present no excuses; we shall not believe you. Allah has already informed us of the true state of matters concerning you. Allah and His Apostle will observe your actions.\" (9.94)",
      "chain": [
        "30213",
        "30301",
        "20465",
        "20409",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "4724",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب بن مالك  وكان قائد كعب بن مالك  قال سمعت كعب بن مالك، يحدث حين تخلف عن قصة، تبوك‏.‏ فوالله ما أعلم أحدا أبلاه الله في صدق الحديث أحسن مما أبلاني، ما تعمدت منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا كذبا، وأنزل الله عز وجل على رسوله صلى الله عليه وسلم ‏{‏لقد تاب الله على النبي والمهاجرين‏}‏ إلى قوله ‏{‏وكونوا مع الصادقين‏}‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking about the story of the battle of Tabuk when he remained behind, \"By Allah, I do not know anyone whom Allah has helped for telling the truth more than me since I mentioned that truth to Allah's Apostle till today, I have never intended to tell a lie. And Allah revealed to His Apostle: \"Verily! Allah has forgiven the Prophet, the Muhajirin............ and be with those who are true (in words and deeds).\" (9.117-119) (See Hadith No. 702 Vol 5).",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "7310",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثني يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب بن مالك  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، قال لما تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك  فذكر حديثه  ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا، فلبثنا على ذلك خمسين ليلة، وآذن رسول الله صلى الله عليه وسلم بتوبة الله علينا‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b bin Malik:                     Who was Ka`b's guide from among his sons when Ka`b became blind: I heard Ka`b bin Malik saying, \"When some people remained behind and did not join Allah's Apostle in the battle of Tabuk..\" and then he described the whole narration and said, \"Allah's Apostle forbade the Muslims to speak to us, and so we (I and my companions) stayed fifty nights in that state, and then Allah's Apostle announced Allah's acceptance of our repentance.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "1692",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الضحاك يعني أبا عاصم، ح وحدثني محمود بن غيلان، حدثنا عبد الرزاق، قالا جميعا أخبرنا ابن جريج، أخبرني ابن شهاب، أن عبد الرحمن بن عبد الله بن كعب، أخبره عن أبيه عبد الله بن كعب، وعن عمه، عبيد الله بن كعب عن كعب بن مالك، أن رسول الله صلى الله عليه وسلم كان لا يقدم من سفر إلا نهارا في الضحى فإذا قدم بدأ بالمسجد فصلى فيه ركعتين ثم جلس فيه ‏.‏",
      "text_en": " Ka'b b. Malik reported:                      The Messenger of Allah (may peace be upon him) did not come back from the journey but by day in the forenoon, and when he arrived, he went first to the mosque, and having prayed two rak'ahs in it he sat down in it.",
      "chain": [
        "30170",
        "30277",
        "20121",
        "11070",
        "11013",
        "11519",
        "390"
      ]
    },
    {
      "hadith_no": "7194",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني عبد بن حميد، حدثني يعقوب بن إبراهيم بن سعد، حدثنا محمد بن عبد، الله بن مسلم ابن أخي الزهري عن عمه، محمد بن مسلم الزهري أخبرني عبد الرحمن، بن عبد الله بن كعب بن مالك أن عبيد الله بن كعب بن مالك، وكان، قائد كعب حين عمي قال سمعت كعب بن مالك يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك ‏.‏ وساق الحديث وزاد فيه على يونس فكان رسول الله صلى الله عليه وسلم قلما يريد غزوة إلا ورى بغيرها حتى كانت تلك الغزوة ‏.‏ ولم يذكر في حديث ابن أخي الزهري أبا خيثمة ولحوقه بالنبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. K'ab, who was his (Ka'b's) guide as he became blind, reported that he heard from Ka'b b. Malik the story of his staying behind Allah's Messenger (may peace be upon him) from the expedition of Tabuk. The rest of the hadith is the same (but with this variation) that in the narration transmitted on the authority of Yunus (the words are):                      When Allah's Messenger (may. peace be upon him) intended to set on an expedition he kept It as a secret, but. be did not do so in thic. expedition. And in the narration transmitted on the authority of Muhammad b. Abdullah b. Muslim, there is no mention of Abu Khaithana (Allah be pleased with him) and no mention of his meeting with Allah's Messenger (may peace be upon him).",
      "chain": [
        "30553",
        "20184",
        "20176",
        "20176",
        "11519",
        "390"
      ]
    },
    {
      "hadith_no": "7195",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن عمه، عبيد الله بن كعب وكان قائد كعب حين أصيب بصره وكان أعلم قومه وأوعاهم لأحاديث أصحاب رسول الله صلى الله عليه وسلم قال سمعت أبي كعب بن مالك وهو أحد الثلاثة الذين تيب عليهم يحدث أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين ‏.‏ وساق الحديث وقال فيه وغزا رسول الله صلى الله عليه وسلم بناس كثير يزيدون على عشرة آلاف ولا يجمعهم ديوان حافظ ‏.‏",
      "text_en": " It is reported on the authority of Abdullah b. K'ab and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger (may peace be upon him). He said:                      I heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (may peace be upon him) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (may peace be upon him) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\"",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "2202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - قال سمعت كعب بن مالكفساق قصته في تبوك قال حتى إذا مضت أربعون من الخمسين إذا رسول رسول الله صلى الله عليه وسلم يأتي فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ قال فقلت أطلقها أم ماذا أفعل قال لا بل اعتزلها فلا تقربنها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني عندهم حتى يقضي الله سبحانه في هذا الأمر ‏.‏",
      "text_en": " ‘Abd Allah bin Ka’b reported “I heard Ka’ab bin Malik. He then narrated his story about the battle of Tabuk.(Narrating the story) he added “When forty out of fifty days passed”, the messenger of the Apostle of Allaah(ﷺ) came and said “The Apostle of Allaah(ﷺ) has commanded you to keep away from your wife. He said “So, I (Ka’b bin Malik)” said “Should I divorce her or what should I do? He said “No, but only keep away from her and do not go near her”. So, I said to my wife “Go to your people and live with them until Allaah, the exalted makes a decision in this matter.”",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، قال سمعت كعب بن مالك، قال كان النبي صلى الله عليه وسلم إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس ‏.‏ وقص ابن السرح الحديث قال ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة حتى إذا طال على تسورت جدار حائط أبي قتادة وهو ابن عمي فسلمت عليه فوالله ما رد على السلام ثم صليت الصبح صباح خمسين ليلة على ظهر بيت من بيوتنا فسمعت صارخا يا كعب بن مالك أبشر ‏.‏ فلما جاءني الذي سمعت صوته يبشرني نزعت له ثوبى فكسوتهما إياه فانطلقت حتى إذا دخلت المسجد فإذا رسول الله صلى الله عليه وسلم جالس فقام إلى طلحة بن عبيد الله يهرول حتى صافحني وهنأني ‏.‏",
      "text_en": " Ka’ab bin Malik said “When the Prophet(ﷺ) arrived from a journey, he first went to a mosque where he prayed two rak’ahs after which he sat in it and gave audience to the people. The narrator Ibn Al Sarh then narrated the rest of the tradition. He said “The Apostle of Allaah(ﷺ) forbade the Muslims to speak to any three of us. When considerable time had passed on me, I ascended the wall of Abu Qatadah who was my cousin. I saluted him, but, I swear by Allaah he did not return my salutation. I then offered the dawn prayer on the fiftieth day on the roof of one of our houses. I then hear d a crier say “Ka’ab bin Mailk, have good news”. When the man whose voice I heard came to me giving me good news, I took off my garments and clothed him. I went on till I entered the mosque. The Apostle of Allaah(ﷺ) was sitting there. Talhah bin ‘Ubaid Allaah stood up and hastened to me till he shook hands with me and greeted me.",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "2781",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، والحسن بن علي، قالا حدثنا عبد الرزاق، أخبرني ابن جريج، قال أخبرني ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه عبد الله بن كعب، وعمه، عبيد الله بن كعب عن أبيهما، كعب بن مالك أن النبي صلى الله عليه وسلم كان لا يقدم من سفر إلا نهارا ‏.‏ قال الحسن في الضحى فإذا قدم من سفر أتى المسجد فركع فيه ركعتين ثم جلس فيه ‏.‏",
      "text_en": " Ka’ab bin Malik said “The Prophet (ﷺ) used to arrive from a journey in the daytime. Al Hasan said “During the forenoon.” When he arrived from a journey he went first to the mosque where he prayed two rak’ahs after which he sat in it and gave audience to the people.",
      "chain": [
        "38581",
        "30",
        "20121",
        "11070",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "3000",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، أن الحكم بن نافع، حدثهم قال أخبرنا شعيب، عن الزهري، عن عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، - وكان أحد الثلاثة الذين تيب عليهم - وكان كعب بن الأشرف يهجو النبي صلى الله عليه وسلم ويحرض عليه كفار قريش وكان النبي صلى الله عليه وسلم حين قدم المدينة وأهلها أخلاط منهم المسلمون والمشركون يعبدون الأوثان واليهود وكانوا يؤذون النبي صلى الله عليه وسلم وأصحابه فأمر الله عز وجل نبيه بالصبر والعفو ففيهم أنزل الله ‏{‏ ولتسمعن من الذين أوتوا الكتاب من قبلكم ‏}‏ الآية فلما أبى كعب بن الأشرف أن ينزع عن أذى النبي صلى الله عليه وسلم أمر النبي صلى الله عليه وسلم سعد بن معاذ أن يبعث رهطا يقتلونه فبعث محمد بن مسلمة وذكر قصة قتله فلما قتلوه فزعت اليهود والمشركون فغدوا على النبي صلى الله عليه وسلم فقالوا طرق صاحبنا فقتل ‏.‏ فذكر لهم النبي صلى الله عليه وسلم الذي كان يقول ودعاهم النبي صلى الله عليه وسلم إلى أن يكتب بينه وبينهم كتابا ينتهون إلى ما فيه فكتب النبي صلى الله عليه وسلم بينه وبينهم وبين المسلمين عامة صحيفة ‏.‏",
      "text_en": " Ka’ab bin Malik who was one of those whose repentance was accepted said “Ka’ab bin Al Ashraf used to satire the Prophet (ﷺ) and incited the infidels of the Quraish against him. When the Prophet (ﷺ) came to Madeena, its people were intermixed, some of them were Muslims and others polytheists aho worshipped idols and some were Jews. They used to hurt the Prophet (ﷺ) and his Companions. Then Allaah Most High commanded His Prophet to show patience and forgiveness. So Allaah revealed about them “And ye shall certainly hear much that will grieve you from those who receive Book before you”. When Ka’ab bin Al Ashraf refused to desist from hurting the Prophet (ﷺ) the Prophet(ﷺ) ordered Sa’d bin Mu’adh to send a band to kill him. He sent Muhammad bin Maslamah and mentioned the story of his murder. When they killed him, the Jews and the polytheist were frightened. Next day they came to the Prophet (ﷺ) and said “Our Companions were attacked and night and killed.” The Prophet(ﷺ) informed them about that which he would say. The Prophet (ﷺ) then called them so that he could write a deed of agreement between him and them and they should fulfill its provisions and desist from hurting him. He then wrote a deed of agreement between him and them and the Muslims in general.”",
      "chain": [
        "11222",
        "30330",
        "20428",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "3317",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن داود، وابن السرح، قالا حدثنا ابن وهب، أخبرني يونس، قال قال ابن شهاب فأخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - عن كعب بن مالك، قال قلت ‏:‏ يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ قال فقلت ‏:‏ إني أمسك سهمي الذي بخيبر ‏.‏",
      "text_en": " Narrated Ka'b ibn Malik:                     I said: Messenger of Allah, to make my repentance complete I should divest myself of my property as sadaqah (alms) for Allah and His Apostle. The Messenger of Allah (ﷺ) said: Retain some of your property, for that will be better for you. So he said: I shall retain the portion I have at Khaybar.",
      "chain": [
        "30584",
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3321",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا حسن بن الربيع، حدثنا ابن إدريس، قال قال ابن إسحاق حدثني الزهري، عن عبد الرحمن بن عبد الله بن كعب، عن أبيه، عن جده، في قصته قال قلت ‏:‏ يا رسول الله إن من توبتي إلى الله أن أخرج من مالي كله إلى الله وإلى رسوله صدقة ‏.‏ قال ‏:‏ ‏\"‏ لا ‏\"‏ ‏.‏ قلت ‏:‏ فنصفه ‏.‏ قال ‏:‏ ‏\"‏ لا ‏\"‏ ‏.‏ قلت ‏:‏ فثلثه ‏.‏ قال ‏:‏ ‏\"‏ نعم ‏\"‏ ‏.‏ قلت ‏:‏ فإني سأمسك سهمي من خيبر ‏.‏",
      "text_en": " Narrated Ka'b ibn Malik:                     I said: Messenger of Allah, to make my atonement complete I should divest myself of my all property as sadaqah (alms) for Allah and His apostle. He said: No. I said: The half of it. He said: No. I said: Then a third of it. He said: Yes. I said: I shall retain the portion I have at Khaybar.",
      "chain": [
        "11222",
        "20102",
        "11107",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "4514",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إبراهيم بن خالد، حدثنا رباح، عن معمر، عن الزهري، عن عبد الرحمن بن عبد الله بن كعب بن مالك، عن أمه، أن أم مبشر، - قال أبو سعيد بن الأعرابي كذا قال عن أمه، والصواب، عن أبيه، عن أم مبشر، - دخلت على النبي صلى الله عليه وسلم فذكر معنى حديث مخلد بن خالد نحو حديث جابر قال فمات بشر بن البراء بن معرور فأرسل إلى اليهودية فقال ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ فذكر نحو حديث جابر فأمر بها رسول الله صلى الله عليه وسلم فقتلت ولم يذكر الحجامة ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. 'Abd Allah b. Ka'b b. Malik :                     On the authority of his mother than Umm Mubashshir said (Abu Sa'id b. al-A'rabi said: So he said it on the authority of his mother ; what is correct is: on the authority of his father, instead of his mother): I entered upon the Prophet (ﷺ). He then mentioned the tradition of Makhlad b. Khalid in a way similar to the tradition of Jabir. The narrator said: Then Bishr b. al-Bara' b. Ma'rur died. So he (the Prophet) sent for the Jewess and said: What did motivate you for your work you have done ? He (the narrator) then mentioned the rest of the tradition like the tradition of Jabir. The Messenger of Allah (ﷺ) ordered regarding her and she was killed. He (the narrator in this version) did not mention cupping.",
      "chain": [
        "30007",
        "38072",
        "20115",
        "11013",
        "11519",
        "1293"
      ]
    },
    {
      "hadith_no": "4600",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، قال أخبرنا يونس، عن ابن شهاب، قال فأخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - قال سمعت كعب بن مالك، - وذكر ابن السرح قصة تخلفه عن النبي صلى الله عليه وسلم في غزوة تبوك - قال ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة حتى إذا طال على تسورت جدار حائط أبي قتادة وهو ابن عمي فسلمت عليه فوالله ما رد على السلام ‏.‏ ثم ساق خبر تنزيل توبته ‏.‏",
      "text_en": " ‘Abd Allah b. Ka;b b. Malik who used to lead his father from among his sons when he became blind, said:                      I heard Ka’b b. Malik say: The transmitter Ibn al-sarh then narrated the story of his remaining behind from the prophet (ﷺ) forbade the Muslims to speak to any of us three. When ( in this state) abundant time passed on me, I ascended the wall of the garden of Abu Qatadah who was my cousin. I saluted him, but, I swear by Allah, he did not return salute to me. He then narrated the story of the revelation of the Qur’anic verses relating to his repentance.",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3422",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا محمد بن مكي بن عيسى، قال حدثنا عبد الله، قال حدثنا يونس، عن الزهري، عن عبد الرحمن بن عبد الله بن كعب بن مالك، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك وقال فيه إذا رسول رسول الله صلى الله عليه وسلم يأتيني فقال إن رسول الله صلى الله عليه وسلم ح وأخبرني سليمان بن داود قال أنبأنا ابن وهب عن يونس قال ابن شهاب أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك أن عبد الله بن كعب بن مالك قال سمعت كعب بن مالك يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك وساق قصته وقال إذا رسول رسول الله صلى الله عليه وسلم يأتي فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ فقلت أطلقها أم ماذا قال لا بل اعتزلها فلا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني عندهم حتى يقضي الله عز وجل في هذا الأمر ‏.‏",
      "text_en": " Ka'b bin Malik narrated the Hadith about when he stayed behind, and did not join the Messenger of Allah on the expedition to Tabuk. He told the story, and said:                      \"The envoy of the Messenger of Allah came to me and said: 'The Messenger of Allah commands you to stay away from your wife.' I said: 'Shall I divorce her or what?' He said: 'No, just keep away from her and do not approach her.' I said to my wife: 'Go to your family and stay with them until Allah, the Mighty and Sublime, decides concerning this matter.'\"",
      "chain": [
        "30514",
        "33027",
        "20025",
        "20475",
        "11013",
        "11519",
        "390"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن جبلة، ومحمد بن يحيى بن محمد، قالا حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك، - قال وهو أحد الثلاثة الذين تيب عليهم - يحدث قال أرسل إلى رسول الله صلى الله عليه وسلم وإلى صاحبى أن رسول الله صلى الله عليه وسلم يأمركم أن تعتزلوا نساءكم ‏.‏ فقلت للرسول أطلق امرأتي أم ماذا أفعل قال لا بل تعتزلها فلا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني فيهم فلحقت بهم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Ka'b bin Malik narrated that his father said:                      \"I heard my father Ka'b bin Malik -who was one of the three whose repentance was accepted- say: 'The Messenger of Allah sent word to me and to my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to his envoy: Shall I divorce my wife, or what should I do? He said: No, just keep away from her, and do not approach her. I said to my wife: Go to your family and stay with them. So she went to them.'\"",
      "chain": [
        "38485",
        "11222",
        "30384",
        "20409",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج بن محمد، قال حدثنا الليث بن سعد، قال حدثني عقيل، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب، قال سمعت كعبا، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك وقال فيه إذا رسول رسول الله صلى الله عليه وسلم يأتيني ويقول إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ فقلت أطلقها أم ماذا أفعل قال بل اعتزلها ولا تقربها ‏.‏ وأرسل إلى صاحبى بمثل ذلك فقلت لامرأتي الحقي بأهلك وكوني عندهم حتى يقضي الله عز وجل في هذا الأمر ‏.‏ خالفهم معقل بن عبيد الله ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Ka'b bin Malik narrated that 'Abdullah bin Ka'b said:                      \"I heard Ka'b narrate the Hadith about when he stayed behind and did not join the Messenger of Allah on the expedition to Tabuk. He said: 'The envoy of the Messenger of Allah came to me and said: \"The Messenger of Allah commands you to keep away from your wife.\" I said: \"Shall I divorce her, or what should I do?\" He said: \"No, just keep away from her and do not approach her.\" And he sent similar instructions to my two companions. I said to my wife: \"Go to your family and stay with them until Allah, the Mighty and Sublime, decides concerning this matter.\"'\"",
      "chain": [
        "20381",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "3425",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن الزهري، قال أخبرني عبد الرحمن بن عبد الله بن كعب، عن عمه، عبيد الله بن كعب قال سمعت أبي كعبا، يحدث قال أرسل إلى رسول الله صلى الله عليه وسلم وإلى صاحبى أن رسول الله صلى الله عليه وسلم يأمركم أن تعتزلوا نساءكم فقلت للرسول أطلق امرأتي أم ماذا أفعل قال لا بل تعتزلها ولا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني فيهم حتى يقضي الله عز وجل ‏.‏ فلحقت بهم ‏.‏ خالفه معمر ‏.‏",
      "text_en": " It was narrated from Ma'qil, from Az-Zuhri who said:                      \"Abdur-Rahman bin 'Abdullah bin Ka'b narrated that his paternal uncle 'Ubaidullah bin Ka'b said: 'I heard my father Ka'b say: The Messenger of Allah sent word to me and my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to the envoy: Should I divorce my wife, or what should I do? He said: No, just keep away from her and do not come near her. I said to my wife: Go to your family and stay with them until Allah, the Mighty and Sublime, decides (concerning me). So she went to them.'\"",
      "chain": [
        "38591",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "3825",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج بن محمد، قال حدثنا ليث بن سعد، قال حدثني عقيل، عن ابن شهاب، قال حدثني عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب بن مالك، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك قلت يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أمسك عليك مالك فهو خير لك ‏\"‏ ‏.‏ قلت فإني أمسك على سهمي الذي بخيبر ‏.‏",
      "text_en": " 'Abdullah bin Ka'b bin Malik said:                      \"I heard Ka'b bin Malik narrating his Hadith about when he stayed behind and did not join the Messenger of Allah on the campaign to Tabuk. (he said) I said: 'As part of my repentance I want to give my wealth in charity for Allah and His Messenger.' The Messenger of Allah said: 'Keep some of your wealth for yourself; that is better for you.' I said: 'I will keep for myself my share that is in Khaibar.'\"",
      "chain": [
        "20381",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن الزهري، قال أخبرني عبد الرحمن بن عبد الله بن كعب، عن عمه، عبيد الله بن كعب قال سمعت أبي كعب بن مالك، يحدث قال قلت يا رسول الله إن الله عز وجل إنما نجاني بالصدق وإن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ فقال ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ قلت فإني أمسك سهمي الذي بخيبر ‏.‏",
      "text_en": " It was narrated from 'Ubaydullah bin Ka'b:                      \"I heard my father Ka'b bin Malik narrate: 'I said: O Messenger of Allah, Allah, the Mighty and Sublime, has saved me by my being truthful, and as part of my repentance I want to give my wealth in charity to Allah and His Messenger. He said: Keep some of your wealth for yourself; that is better for you. I said: I will keep my share that is in Khaibar.'\"",
      "chain": [
        "38591",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    }
  ],
  "total_hadiths": 29
}