{
  "id": "11510",
  "name": "Sa'id bin Myna سعيد بن مينا",
  "full_name": "Sa'id bin Myna سعيد بن مينا",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hijaz",
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  ق  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Hijazi",
      "Makki",
      "Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  م  د  ت  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  م  د  ت  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  م  د  ت  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Hijaz",
        "ar": "الحجاز",
        "ckb": "حیجاز"
      },
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      },
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "al-Hijazi",
        "ar": "al-Hijazi",
        "ckb": "al-Hijazi"
      },
      {
        "en": "Makki",
        "ar": "Makki",
        "ckb": "Makki"
      },
      {
        "en": "Madni",
        "ar": "Madni",
        "ckb": "Madni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "15020",
      "name": "Asbgh bin Nbat'h al-Tmymy أصبغ بن نباتة التميمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20234",
      "name": "Saleem bin Hiyyan سليم بن حيان",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1334",
      "hadith_no": "1334",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سنان، حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر  رضى الله عنه  أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي فكبر أربعا‏.‏ وقال يزيد بن هارون وعبد الصمد عن سليم أصحمة‏.‏ وتابعه عبد الصمد‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet offered the funeral prayer of As-Hama An-Najash and said four Takbir.",
      "usc_msa_ref": "418",
      "chain": [
        "34207",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3070",
      "hadith_no": "3070",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، أخبرنا حنظلة بن أبي سفيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال قلت يا رسول الله، ذبحنا بهيمة لنا، وطحنت صاعا من شعير، فتعال أنت ونفر، فصاح النبي صلى الله عليه وسلم فقال ‏\"‏ يا أهل الخندق، إن جابرا قد صنع سؤرا، فحى هلا بكم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I said, \"O Allah's Apostle! We have slaughtered a young sheep of ours and have ground one Sa of barley. So, I invite you along with some persons.\" So, the Prophet said in a loud voice, \"O the people of the Trench! Jabir had prepared \"Sur\" so come along.\"",
      "usc_msa_ref": "304",
      "chain": [
        "30153",
        "20241",
        "11243",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3574",
      "hadith_no": "3574",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن سنان، حدثنا سليم، حدثنا سعيد بن ميناء، عن جابر بن عبد الله  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ مثلي ومثل الأنبياء كرجل بنى دارا فأكملها وأحسنها، إلا موضع لبنة، فجعل الناس يدخلونها ويتعجبون، ويقولون لولا موضع اللبنة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"My similitude in comparison with the other prophets is that of a man who has built a house completely and excellently except for a place of one brick. When the people enter the house, they admire its beauty and say: 'But for the place of this brick (how splendid the house will be)!\"",
      "usc_msa_ref": "734",
      "chain": [
        "34207",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3927",
      "hadith_no": "3927",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يزيد، عن سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر بن عبد الله  رضى الله عنهما أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي، فكبر عليه أربعا‏.‏ تابعه عبد الصمد‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet offered the funeral prayer for Ashama, the Negus, with four Takbir.",
      "usc_msa_ref": "219",
      "chain": [
        "30201",
        "20472",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4152",
      "hadith_no": "4152",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، أخبرنا حنظلة بن أبي سفيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما حفر الخندق رأيت بالنبي صلى الله عليه وسلم خمصا شديدا، فانكفأت إلى امرأتي فقلت هل عندك شىء فإني رأيت برسول الله صلى الله عليه وسلم خمصا شديدا‏.‏ فأخرجت إلى جرابا فيه صاع من شعير، ولنا بهيمة داجن فذبحتها، وطحنت الشعير ففرغت إلى فراغي، وقطعتها في برمتها، ثم وليت إلى رسول الله صلى الله عليه وسلم فقالت لا تفضحني برسول الله صلى الله عليه وسلم وبمن معه‏.‏ فجئته فساررته فقلت يا رسول الله ذبحنا بهيمة لنا وطحنا صاعا من شعير كان عندنا، فتعال أنت ونفر معك‏.‏ فصاح النبي صلى الله عليه وسلم فقال ‏\"‏ يا أهل الخندق، إن جابرا قد صنع سورا فحى هلا بكم ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنزلن برمتكم، ولا تخبزن عجينكم حتى أجيء ‏\"‏‏.‏ فجئت وجاء رسول الله صلى الله عليه وسلم يقدم الناس حتى جئت امرأتي، فقالت بك وبك‏.‏ فقلت قد فعلت الذي قلت‏.‏ فأخرجت له عجينا، فبصق فيه وبارك، ثم عمد إلى برمتنا فبصق وبارك ثم قال ‏\"‏ ادع خابزة فلتخبز معي واقدحي من برمتكم ولا تنزلوها‏\"‏، وهم ألف، فأقسم بالله لقد أكلوا حتى تركوه وانحرفوا، وإن برمتنا لتغط كما هي، وإن عجيننا ليخبز كما هو‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Trench was dug, I saw the Prophet in the state of severe hunger. So I returned to my wife and said, \"Have you got anything (to eat), for I have seen Allah's Apostle in a state of severe hunger.\" She brought out for me, a bag containing one Sa of barley, and we had a domestic she animal (i.e. a kid) which I slaughtered then, and my wife ground the barley and she finished at the time I finished my job (i.e. slaughtering the kid). Then I cut the meat into pieces and put it in an earthenware (cooking) pot, and returned to Allah's Apostle . My wife said, \"Do not disgrace me in front of Allah's Apostle and those who are with him.\" So I went to him and said to him secretly, \"O Allah's Apostle! I have slaughtered a she-animal (i.e. kid) of ours, and we have ground a Sa of barley which was with us. So please come, you and another person along with you.\" The Prophet raised his voice and said, \"O people of Trench ! Jabir has prepared a meal so let us go.\" Allah's Apostle said to me, \"Don't put down your earthenware meat pot (from the fireplace) or bake your dough till I come.\" So I came (to my house) and Allah's Apostle too, came, proceeding before the people. When I came to my wife, she said, \"May Allah do so-and-so to you.\" I said, \"I have told the Prophet of what you said.\" Then she brought out to him (i.e. the Prophet the dough, and he spat in it and invoked for Allah's Blessings in it. Then he proceeded towards our earthenware meat-pot and spat in it and invoked for Allah's Blessings in it. Then he said (to my wife). Call a lady-baker to bake along with you and keep on taking out scoops from your earthenware meat-pot, and do not put it down from its fireplace.\" They were onethousand (who took their meals), and by Allah they all ate, and when they left the food and went away, our earthenware pot was still bubbling (full of meat) as if it had not decreased, and our dough was still being baked as if nothing had been taken from it.",
      "usc_msa_ref": "428",
      "chain": [
        "30153",
        "20241",
        "11243",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5769",
      "hadith_no": "5769",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "وقال عفان حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عدوى ولا طيرة ولا هامة ولا صفر، وفر من المجذوم كما تفر من الأسد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, '(There is) no 'Adwa (no contagious disease is conveyed without Allah's permission). nor is there any bad omen (from birds), nor is there any Hamah, nor is there any bad omen in the month of Safar, and one should run away from the leper as one runs away from a lion.''",
      "usc_msa_ref": "608",
      "chain": [
        "30106",
        "20234",
        "11510",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7366",
      "hadith_no": "7366",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن عبادة، أخبرنا يزيد، حدثنا سليم بن حيان  وأثنى عليه  حدثنا سعيد بن ميناء، حدثنا أو، سمعت جابر بن عبد الله، يقول جاءت ملائكة إلى النبي صلى الله عليه وسلم وهو نائم فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا إن لصاحبكم هذا مثلا فاضربوا له مثلا‏.‏ فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا مثله كمثل رجل بنى دارا، وجعل فيها مأدبة وبعث داعيا، فمن أجاب الداعي دخل الدار وأكل من المأدبة، ومن لم يجب الداعي لم يدخل الدار ولم يأكل من المأدبة‏.‏ فقالوا أولوها له يفقهها فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا فالدار الجنة، والداعي محمد صلى الله عليه وسلم فمن أطاع محمدا صلى الله عليه وسلم فقد أطاع الله، ومن عصى محمدا صلى الله عليه وسلم فقد عصى الله، ومحمد صلى الله عليه وسلم فرق بين الناس‏.‏ تابعه قتيبة عن ليث، عن خالد، عن سعيد بن أبي هلال، عن جابر، خرج علينا النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Some angels came to the Prophet while he was sleeping. Some of them said, \"He is sleeping.\" Others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this companion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He is sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His example is that of a man who has built a house and then offered therein a banquet and sent an inviter (messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house and ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the house, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he may understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but his heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is Muhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, disobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished from the bad, and the believers from the disbelievers).",
      "usc_msa_ref": "385",
      "chain": [
        "30378",
        "20472",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-2250",
      "hadith_no": "2250",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن سليم بن حيان، قال حدثنا سعيد بن ميناء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم صلى",
      "text_en": " Jabir b. 'Abdullah reported that the Messenger of Allah (may peace be upon him) offered prayer for Ashama, the Negus, and recited four takbirs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2800",
      "hadith_no": "2800",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني زهير بن حرب، ومحمد بن حاتم، جميعا عن ابن مهدي، - قال زهير حدثنا عبد الرحمن بن مهدي، - حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، قال قال عبد الله بن عمرو قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو بلغني أنك تصوم النهار وتقوم الليل فلا تفعل فإن لجسدك عليك حظا ولعينك عليك حظا وإن لزوجك عليك حظا صم وأفطر صم من كل شهر ثلاثة أيام فذلك صوم الدهر ‏\"‏ ‏.‏ قلت يا رسول الله إن بي قوة ‏.‏ قال ‏\"‏ فصم صوم داود - عليه السلام - صم يوما وأفطر يوما ‏\"‏ ‏.‏ فكان يقول يا ليتني أخذت بالرخصة ‏.‏",
      "text_en": " 'Abdullah b. 'Amr (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) said to me! 'Abdullah b. 'Amr, it has been conveyed to me that you observe fast during the day and stand in prayer during the whole night. Don't do that, for your body has a share of its own in you, your eye has a share of its own in you, your wife has a share of her own in you. Observe fast and break it too. Fast for three days in every month and that is a prepetual fasting. I said! Messenger of Allah, I have got strength enough (to do more than this), whereupon he said:                      Then observe the fast of David (peace be upon him). Observe fast one day and break it (on the other) day. And he ('Abdullah b. 'Amr) used to say: Would that I had availed myself of this concession.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "38487",
        "20033",
        "20321",
        "20033",
        "20234",
        "11510",
        "29"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3308",
      "hadith_no": "3308",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثني ابن مهدي، حدثنا سليم بن حيان، عن سعيد، - يعني ابن ميناء - قال سمعت عبد الله بن الزبير، يقول حدثتني خالتي، - يعني عائشة - قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة لولا أن قومك حديثو عهد بشرك لهدمت الكعبة فألزقتها بالأرض وجعلت لها بابين بابا شرقيا وبابا غربيا وزدت فيها ستة أذرع من الحجر فإن قريشا اقتصرتها حيث بنت الكعبة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Zubair (Allah be pleased with him) reported on the authority of his mother's sister ('A'isha) saying that Allah's Messenger (may peace be upon him) said:                      'A'isha, if your people had not been recently polytheists (and new converts to Islam), I would have demolished the Ka'ba, and would have brought it to the level of the ground and would have constructed two doors, one facing the east and the other one to the west, and would have added to it six cubits of area from Hijr, for the Quraish had reduced it when they rebuilt it.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20033",
        "20234",
        "11510",
        "106"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3993",
      "hadith_no": "3993",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن هاشم، حدثنا بهز، حدثنا سليم بن حيان، حدثنا سعيد بن، ميناء عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمحاقلة والمخابرة وعن بيع الثمرة حتى تشقح ‏.‏ قال قلت لسعيد ما تشقح قال تحمار وتصفار ويؤكل منها ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muzabana and Muhaqala, and Mukhabara, and the sale of fruits until they are ripe. I (the narrator) said to Sa'id (the other narrator):                      What does ripening imply? He said: It meant that they become red or become yellow and are fit for eating.",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3994",
      "hadith_no": "3994",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، ومحمد بن عبيد الغبري، - واللفظ لعبيد الله - قالا حدثنا حماد بن زيد، حدثنا أيوب، عن أبي الزبير، وسعيد بن ميناء، عن جابر بن، عبد الله قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة والمعاومة والمخابرة - قال أحدهما بيع السنين هي المعاومة - وعن الثنيا ورخص في العرايا ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muhaqala and Muzabana and Mu'awama and Mukhabara. (One of the narrators) 'said:                      Sale years ahead is Mu'awama, and making exceptional but he made an exemption of araya.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30213",
        "20022",
        "11015",
        "11263",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4004",
      "hadith_no": "4004",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا سليم بن، حيان حدثنا سعيد بن ميناء، قال سمعت جابر بن عبد الله، يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان له فضل أرض فليزرعها أو ليزرعها أخاه ولا تبيعوها ‏\"‏ ‏.‏ فقلت لسعيد ما قوله ولا تبيعوها يعني الكراء ‏.‏ قال نعم ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) heard Allah's Messenger (may peace be upon him) say:                      He who has surplus of land should either cultivate it himself, or let his brother cultivate it, an should not sell it. I (the narrator) said to Sa'id: What does his statement\" do not sell it\" mean? Does it imply\" rent\"? He said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5436",
      "hadith_no": "5436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني حجاج بن الشاعر، حدثني الضحاك بن مخلد، من رقعة عارض لي بها ثم قرأه على قال أخبرناه حنظلة بن أبي سفيان حدثنا سعيد بن ميناء قال سمعت جابر بن عبد الله يقول لما حفر الخندق رأيت برسول الله صلى الله عليه وسلم خمصا فانكفأت إلى امرأتي فقلت لها هل عندك شىء فإني رأيت برسول الله صلى الله عليه وسلم خمصا شديدا ‏.‏ فأخرجت لي جرابا فيه صاع من شعير ولنا بهيمة داجن - قال - فذبحتها وطحنت ففرغت إلى فراغي فقطعتها في برمتها ثم وليت إلى رسول الله صلى الله عليه وسلم فقالت لا تفضحني برسول الله صلى الله عليه وسلم ومن معه - قال - فجئته فساررته فقلت يا رسول الله إنا قد ذبحنا بهيمة لنا وطحنت صاعا من شعير كان عندنا فتعال أنت في نفر معك ‏.‏ فصاح رسول الله صلى الله عليه وسلم وقال ‏\"‏ يا أهل الخندق إن جابرا قد صنع لكم سورا فحيهلا بكم ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنزلن برمتكم ولا تخبزن عجينتكم حتى أجيء ‏\"‏ ‏.‏ فجئت وجاء رسول الله صلى الله عليه وسلم يقدم الناس حتى جئت امرأتي فقالت بك وبك ‏.‏ فقلت قد فعلت الذي قلت لي ‏.‏ فأخرجت له عجينتنا فبصق فيها وبارك ثم عمد إلى برمتنا فبصق فيها وبارك ثم قال ‏\"‏ ادعي خابزة فلتخبز معك واقدحي من برمتكم ولا تنزلوها ‏\"‏ ‏.‏ وهم ألف فأقسم بالله لأكلوا حتى تركوه وانحرفوا وإن برمتنا لتغط كما هي وإن عجينتنا - أو كما قال الضحاك - لتخبز كما هو ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      When the ditch was dug, I saw Allah's Messenger (may peace he upon him) feeling very hungry. I came to my wife and said to her: Is there anything with you? I have seen Allah's Messenger (may peace be upon him) feeling extremely hungry. She brought out a bag of provisions which contained a sa', of barley. We had also with us a lamb. I slaughtered it. She ground the flour. She finished (this work) along with me. I cut it into pieces and put it in the earthen pot and then returned to Allah's Apostle (may peace be upon him) (for inviting him). She said: Do not humiliate me in the presence of Allah's Messenger (may peace be upon him) and those who are with him. When I came to him I whispered to him saying: Allah's Messenger, we have slaughtered a lamb for you and she has ground a sa' of barley which we had with us. So you come along with a group of people with you. Thereupon Allah's Messenger (may peace be upon him) said loudly: O people of the ditch, Jabir has arranged a feast for you, so (come along). Allah's Messenger (may peace be upon him) said: Do not remove your earthen pot from the hearth and do not bake the bread from the kneaded flour until I come. So I came and Allah's Messenger (may peace be upon him) came and he was ahead of the people; and I came to my wife and she said (to me): You will be humbled. I said: I did what you had asked me to do. She (his wife) said: I brought out the kneaded flour and Allah's Messenger (may peace be upon him) put some saliva of his in that and blessed It. He then put saliva in the earthen pot and blessed it and then said. Call another baker who can bake with you. and bring out the soup from it, but do not remove it from the hearth, and the guests were one thousand. (Jabir said): I take an oath by Allah that all of them ate (the food to their fill) until they left it and went away and our earthen pot was brimming over as before, and so was the case with our flour, or as Dahhak (another narrator) said: It (the flour) was in the same condition and loaves had been prepared from that.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6098",
      "hadith_no": "6098",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن حاتم، حدثنا ابن مهدي، حدثنا سليم، عن سعيد بن ميناء، عن  جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثلي ومثلكم كمثل رجل أوقد نارا فجعل الجنادب والفراش يقعن فيها وهو يذبهن عنها وأنا آخذ بحجزكم عن النار وأنتم تفلتون من يدي ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported Allah's Messenger (may peace be upon him) as saying. My example and your example is that of a person who lit the fire and insects and moths began to fall in it and he would be making efforts to take them out, and I am going to hold you back from fire, but you are slipping from my hand.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20033",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6103",
      "hadith_no": "6103",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا سليم بن حيان، حدثنا سعيد، بن ميناء عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثلي ومثل الأنبياء كمثل رجل بنى دارا فأتمها وأكملها إلا موضع لبنة فجعل الناس يدخلونها ويتعجبون منها ويقولون لولا موضع اللبنة ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فأنا موضع اللبنة جئت فختمت الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of mine and that of the Apostles is like that of a person who built a house and he completed it and made it perfect but for the space of a brick. People entered therein and they were surprised at it and said: Had there been a brick (it would have been complete in all respects). Allah's Messenger (may peace be upon him) said: I am that place where the brick (completing the building is to be placed), and I have come to finalise the chain of Apostles.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-3370",
      "hadith_no": "3370",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر، محمد بن خلاد الباهلي حدثنا يحيى بن سعيد، عن سليم بن حيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم أن تباع الثمرة حتى تشقح ‏.‏ قيل وما تشقح قال تحمار وتصفار ويؤكل منها ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) forbade the sale of fruits until they are ripened (tushqihah). He was asked: What do you mean by their ripening (ishqah)? He replied: They become red or yellow, and they are eaten.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3375",
      "hadith_no": "3375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن أيوب، عن أبي الزبير، وسعيد بن ميناء، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن المعاومة وقال أحدهما بيع السنين ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Prophet (ﷺ) forbade sale of fruits for a number of years. One of the two narrators (Abu al-Zubair and Sa'id b. Mina') mentioned the words \"sale for years\" (bai' al-sinin instead of al-mu'awamah).",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11015",
        "11263",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3404",
      "hadith_no": "3404",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسماعيل، ح وحدثنا مسدد، أن حمادا، وعبد الوارث، حدثاهم كلهم، عن أيوب، عن أبي الزبير، - قال عن حماد، وسعيد بن ميناء، ثم اتفقوا - عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة والمخابرة والمعاومة - قال عن حماد وقال أحدهما والمعاومة وقال الآخر بيع السنين ثم اتفقوا - وعن الثنيا ورخص في العرايا ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Messenger of Allah (ﷺ) forbade muhaqalah, muzabanah, mukhabarah, and mu'awanah. One of the two narrators from Hammad said the word mu'awamah, and other said: \"selling many years ahead\". The agreed version then goes: and thunya, but gave license for 'araya.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20208",
        "30175",
        "20022",
        "11015",
        "11263",
        "20022",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-3101",
      "hadith_no": "3101",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن سنان، حدثنا سليم بن حيان، بصري حدثنا سعيد بن ميناء، عن جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنما مثلي ومثل الأنبياء قبلي كرجل بنى دارا فأكملها وأحسنها إلا موضع لبنة فجعل الناس يدخلونها ويتعجبون منها ويقولون لولا موضع اللبنة ‏\"‏ ‏.‏ وفي الباب عن أبى بن كعب وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He complete it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "34207",
        "20234",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-ibn-majah-2352",
      "hadith_no": "2352",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا حماد بن زيد، عن أيوب، عن أبي الزبير، وسعيد بن ميناء، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  نهى عن المحاقلة والمزابنة ‏.‏",
      "text_en": " lt was narrated from Sabir bin 'Abdullah that :                     the Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah.",
      "usc_msa_ref": "",
      "chain": [
        "38091",
        "20022",
        "11015",
        "11263",
        "11510",
        "34"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 21,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}