{
  "id": "11516",
  "name": "'Abdullah bin Muhammad bin Abi Bakr عبد الله بن محمد بن أبي بكر",
  "full_name": "'Abdullah bin Muhammad bin Abi Bakr عبد الله بن محمد بن أبي بكر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina, Harrah",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "208",
      "name": "Muhammad bin 'Abdur Rahman ( محمد بن عبد الرحمن بن أبي بكر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1608",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن محمد بن أبي بكر، أخبر عبد الله بن عمر، عن عائشة  رضى الله عنهم  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ ألم ترى أن قومك لما بنوا الكعبة اقتصروا عن قواعد إبراهيم ‏\"‏‏.‏ فقلت يا رسول الله ألا تردها على قواعد إبراهيم‏.‏ قال ‏\"‏ لولا حدثان قومك بالكفر لفعلت ‏\"‏‏.‏ فقال عبد الله  رضى الله عنه  لئن كانت عائشة  رضى الله عنها  سمعت هذا من رسول الله صلى الله عليه وسلم ما أرى رسول الله صلى الله عليه وسلم ترك استلام الركنين اللذين يليان الحجر، إلا أن البيت لم يتمم على قواعد إبراهيم‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that Allah's Apostle said to her, \"Do you know that when your people (Quraish) rebuilt the Ka`ba, they decreased it from its original foundation laid by Abraham?\" I said, \"O Allah's Apostle! Why don't you rebuild it on its original foundation laid by Abraham?\" He replied, \"Were it not for the fact that your people are close to the Pre-Islamic Period of ignorance (i.e. they have recently become Muslims) I would have done so.\" The sub-narrator, `Abdullah (bin `Umar ) stated: `Aisha 'must have heard this from Allah's Apostle for in my opinion Allah's Apostle had not placed his hand over the two corners of the Ka`ba opposite Al-Hijr only because the Ka`ba was not rebuilt on its original foundations laid by Abraham.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11011",
        "11516",
        "18",
        "53"
      ]
    },
    {
      "hadith_no": "4525",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن محمد بن أبي بكر، أخبر عبد الله بن عمر، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألم ترى أن قومك بنوا الكعبة واقتصروا عن قواعد إبراهيم ‏\"‏‏.‏ فقلت يا رسول الله ألا تردها على قواعد إبراهيم قال ‏\"‏ لولا حدثان قومك بالكفر ‏\"‏‏.‏ فقال عبد الله بن عمر لئن كانت عائشة سمعت هذا من رسول الله صلى الله عليه وسلم ما أرى رسول الله صلى الله عليه وسلم ترك استلام الركنين اللذين يليان الحجر، إلا أن البيت لم يتمم على قواعد إبراهيم‏.‏",
      "text_en": " Narrated `Aisha:                     (The wife of the Prophet) Allah's Apostle said, \"Don't you see that when your people built the Ka`ba, they did not build it on all Abraham's foundations?\" I said, \"O Allah's Apostle! Why don't you rebuild it on Abraham's foundations?\" He said, \"Were your people not so close to (the period of Heathenism, i.e. the Period between their being Muslims and being infidels), I would do so.\" The sub-narrator, `Abdullah bin `Umar said, \"Aisha had surely heard Allah's Apostle saying that, for I do not think that Allah's Apostle left touching the two corners of the Ka`ba facing Al-Hijr except because the Ka`ba was not built on all Abraham's foundations.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11011",
        "11516",
        "18",
        "53"
      ]
    },
    {
      "hadith_no": "4930",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن محمد بن أبي بكر، عن عمرة، قالت قالت عائشة القطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " It was narrated that 'Amrah said:                     \"Aishah said: 'Cutting off (the hand of the thief) is for one-quarter of a Dinar or more.\"'",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11516",
        "11455"
      ]
    }
  ],
  "total_hadiths": 3
}