{
  "id": "11522",
  "name": "'Utba bin Muslim al-Madni عتبة بن مسلم المدني",
  "full_name": "'Utba bin Muslim al-Madni عتبة بن مسلم المدني",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11202",
      "name": "'Ubaid bin Hnyn عبيد بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12795",
      "name": "'Abdullah bin Rafi'a bin Khadayj عبد الله بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23063",
      "name": "Muslim bin Khalid al-Zanji مسلم بن خالد الزنجي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22010",
      "name": "Ibrahim bin Muhammad bin Abi Yahya إبراهيم بن محمد بن أبي يحيى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3320",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، قال حدثني عتبة بن مسلم، قال أخبرني عبيد بن حنين، قال سمعت أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ إذا وقع الذباب في شراب أحدكم فليغمسه، ثم لينزعه، فإن في إحدى جناحيه داء والأخرى شفاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said \"If a house fly falls in the drink of anyone of you, he should dip it (in the drink), for one of its wings has a disease and the other has the cure for the disease.\"",
      "chain": [
        "30463",
        "20160",
        "11522",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "5841",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عتبة بن مسلم، مولى بني تيم عن عبيد بن حنين، مولى بني زريق عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وقع الذباب في إناء أحدكم، فليغمسه كله، ثم ليطرحه، فإن في أحد جناحيه شفاء وفي الآخر داء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and then throw it away, for in one of its wings there is a disease and in the other there is healing (antidote for it) i e. the treatment for that disease.\"",
      "chain": [
        "30367",
        "20155",
        "11522",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "3382",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان بن بلال، عن عتبة بن مسلم، عن نافع بن جبير، أن مروان بن الحكم، خطب الناس فذكر مكة وأهلها وحرمتها ولم يذكر المدينة وأهلها وحرمتها فناداه رافع بن خديج فقال ما لي أسمعك ذكرت مكة وأهلها وحرمتها ولم تذكر المدينة وأهلها وحرمتها وقد حرم رسول الله صلى الله عليه وسلم ما بين لابتيها وذلك عندنا في أديم خولاني إن شئت أقرأتكه ‏.‏ قال فسكت مروان ثم قال قد سمعت بعض ذلك ‏.‏",
      "text_en": " Nafi' b. Jubair reported that Marwan b. al-Hakam (Allah be pleased with him) addressed people and made mention of Mecca and its inhabitants and its sacredness, but he made no mention of Medina, its inhabitants and its sacredness. Rafi' b. Khadij called to him and said:                      What is this that I hear you making mention of Mecca and its inhabitants and its sacredness, but you did not make mention of Medina and its inhabitants and its sacredness, while the Apostle of Allah (may peace be upon him) has also declared sacred (the area) between its two lava lands (Medina)? And (we have record of this) with us written on Khaulani parchment. If you like, I can read it out to you. Thereupon Marwan became silent, and then Said: I too have heard some part of it.",
      "chain": [
        "20160",
        "11522",
        "11059",
        "858"
      ]
    },
    {
      "hadith_no": "5945",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني أبو بكر بن إسحاق، حدثنا ابن أبي مريم، أخبرنا سليمان بن بلال، حدثني  عتبة بن مسلم، عن حمزة بن عبد الله بن عمر، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن كان الشؤم في شىء ففي الفرس والمسكن والمرأة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      If there is bad luck in anything, it is the horse, the abode and the woman.",
      "chain": [
        "11108",
        "30232",
        "20160",
        "11522",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عمرو، حدثنا سلمة، - يعني ابن الفضل - قال حدثني محمد، - يعني ابن إسحاق - قال حدثني عتبة بن مسلم، مولى بني تيم عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول فذكر نحوه قال ‏\"‏ فإذا قالوا ذلك فقولوا ‏{‏ الله أحد * الله الصمد * لم يلد ولم يولد * ولم يكن له كفوا أحد ‏}‏ ثم ليتفل عن يساره ثلاثا وليستعذ من الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: He then mentioned a tradition like it. This version adds: When they propound that, say: \"Say Allah is one. Allah is He to Whom men repair. He has not begotten and He has not been begotten, and no one is equal to Him.\" Then one should spit three times on his left side and seek refuge in Allah from Satan.",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11522",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مسلم بن خالد، عن عتبة بن مسلم، عن عبيد بن حنين، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا وقع الذباب في شرابكم فليغمسه فيه ثم ليطرحه فإن في أحد جناحيه داء وفي الآخر شفاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “If aflyfalls into your drink, dip it into it then throw it away, for ononeof its wings is a disease and on the other is a cure.”",
      "chain": [
        "30547",
        "23063",
        "11522",
        "11202",
        "13"
      ]
    }
  ],
  "total_hadiths": 6
}