{
  "id": "11525",
  "name": "'Uthman bin 'Abdur Rahman bin 'Uthman عثمان بن عبد الرحمن بن عثمان بن عبد الله",
  "full_name": "'Uthman bin 'Abdur Rahman bin 'Uthman عثمان بن عبد الرحمن بن عثمان بن عبد الله",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Hijaz",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "2705",
      "name": "'Abdur Rahman bin 'Uthman ( عبد الرحمن بن عثمان بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "2706",
      "name": "Mu'adh bin 'Abdur Rahman bin 'Uthman ( معاذ بن عبد الرحمن بن عثمان التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "2705",
      "name": "'Abdur Rahman bin 'Uthman ( عبد الرحمن بن عثمان بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2706",
      "name": "Mu'adh bin 'Abdur Rahman bin 'Uthman ( معاذ بن عبد الرحمن بن عثمان التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2711",
      "name": "Rabi'a bin 'Abdullah bin al-Hudayr ( ربيعة بن عبد الله بن الهدير ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12604",
      "name": "Y'aqub bin Abi Y'aqub يعقوب بن أبي يعقوب المدني",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11569",
      "name": "Abu Bakr bin 'Ubaidullah B. Abi Mulayka أبو بكر بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12131",
      "name": "Sa'id bin Ziyad al-Mktb سعيد بن زياد المكتب المؤذن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22010",
      "name": "Ibrahim bin Muhammad bin Abi Yahya إبراهيم بن محمد بن أبي يحيى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "904",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سريج بن النعمان، قال حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن بن عثمان التيمي، عن أنس بن مالك، رضى الله عنه أن النبي صلى الله عليه وسلم كان يصلي الجمعة حين تميل الشمس‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to offer the Jumua prayer immediately after midday.",
      "chain": [
        "30250",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني أبو بكر بن أبي مليكة، عن عثمان بن عبد الرحمن التيمي، عن ربيعة بن عبد الله بن الهدير التيمي  قال أبو بكر وكان ربيعة من خيار الناس عما حضر ربيعة من عمر بن الخطاب  رضى الله عنه  قرأ يوم الجمعة على المنبر بسورة النحل حتى إذا جاء السجدة نزل فسجد وسجد الناس، حتى إذا كانت الجمعة القابلة قرأ بها حتى إذا جاء السجدة قال يا أيها الناس إنا نمر بالسجود فمن سجد فقد أصاب، ومن لم يسجد فلا إثم عليه‏.‏ ولم يسجد عمر  رضى الله عنه‏.‏ وزاد نافع عن ابن عمر  رضى الله عنهما إن الله لم يفرض السجود إلا أن نشاء‏.‏",
      "text_en": " Narrated Rabi`a:                     `Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday `Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And `Umar did not prostrate (that day). Added Ibn `Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11569",
        "11525",
        "20436"
      ]
    },
    {
      "hadith_no": "108",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن داود الإسكندراني، حدثنا زياد بن يونس، حدثني سعيد بن زياد المؤذن، عن عثمان بن عبد الرحمن التيمي، قال سئل ابن أبي مليكة عن الوضوء، فقال رأيت عثمان بن عفان سئل عن الوضوء، فدعا بماء فأتي بميضأة فأصغى على يده اليمنى ثم أدخلها في الماء فتمضمض ثلاثا واستنثر ثلاثا وغسل وجهه ثلاثا ثم غسل يده اليمنى ثلاثا وغسل يده اليسرى ثلاثا ثم أدخل يده فأخذ ماء فمسح برأسه وأذنيه فغسل بطونهما وظهورهما مرة واحدة ثم غسل رجليه ثم قال أين السائلون عن الوضوء هكذا رأيت رسول الله صلى الله عليه وسلم يتوضأ ‏.‏ قال أبو داود أحاديث عثمان - رضى الله عنه - الصحاح كلها تدل على مسح الرأس أنه مرة فإنهم ذكروا الوضوء ثلاثا وقالوا فيها ومسح رأسه ‏.‏ ولم يذكروا عددا كما ذكروا في غيره ‏.‏",
      "text_en": " ‘Abd al-Rahman al-TamiI reported:                      Ibn Abi Mulaikah was asked about ablution. He said : I saw ‘Uthman b. ‘Affan who was asked about ablution. He called for water. A vessel was then brought to him. He inclined it towords his right hand (poured water upon it). He then put it in the water three times, and washed his face three times. He then put his hand in the water and took it out; then he wiped his head and ears, in and  out only once. He then washed his feet, and said : Where are those who asked me to perform ablution? I saw the Messenger of Allah (ﷺ) performing ablution like that. Abu Dawud said : All the sound traditions narrated by ‘ Uthman indicated that the head is to be wiped once, because they mentioned (the washing of each part in) ablution three times. In their versions of tradition they mentioned the wordings: “he wiped his head.” In this case they did not mention any number as they did in other cases.",
      "chain": [
        "28190",
        "12131",
        "11525"
      ]
    },
    {
      "hadith_no": "1084",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا زيد بن الحباب، حدثني فليح بن سليمان، حدثني عثمان بن عبد الرحمن التيمي، سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يصلي الجمعة إذا مالت الشمس ‏.‏",
      "text_en": " Anas b. Malik said:                      The Messenger of Allah (ﷺ) used to offer the Friday prayer when the sun declined.",
      "chain": [
        "30115",
        "20650",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سريج بن النعمان، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن أنس بن مالك، أن النبي صلى الله عليه وسلم كان يصلي الجمعة حين تميل الشمس ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"The Prophet would pray the Friday prayer when the sun was declining.\"",
      "chain": [
        "30242",
        "30250",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن أنس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال وفي الباب عن سلمة بن الأكوع وجابر والزبير بن العوام ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ وهو الذي أجمع عليه أكثر أهل العلم أن وقت الجمعة إذا زالت الشمس كوقت الظهر ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ ورأى بعضهم أن صلاة الجمعة إذا صليت قبل الزوال أنها تجوز أيضا ‏.‏ وقال أحمد ومن صلاها قبل الزوال فإنه لم ير عليه إعادة ‏.‏",
      "text_en": " (Another chain) from Anas, :                     from the Prophet, similarly.",
      "chain": [
        "30221",
        "20547",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "2170",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن يعقوب بن أبي يعقوب، عن أم المنذر، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي ولنا دوال معلقة قالت فجعل رسول الله صلى الله عليه وسلم يأكل وعلي معه يأكل ‏.‏ فقال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ مه مه يا علي فإنك ناقه ‏\"‏ ‏.‏ قال فجلس علي والنبي صلى الله عليه وسلم يأكل ‏.‏ قالت فجعلت لهم سلقا وشعيرا فقال النبي صلى الله عليه وسلم ‏\"‏ يا علي من هذا فأصب فإنه أوفق لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث فليح ‏.‏ ويروى عن فليح عن أيوب بن عبد الرحمن ‏.‏",
      "text_en": " Umm Al-Mundhir said:                     The Messenger of Allah (s.a.w) entered upon me, while 'Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (s.a.w) said to 'Ali: 'Stop, stop, for you are still recovering.' So 'Ali sat and the Prophet ate.\" She said: 'I made some chard and barley for them, so the Prophet said: 'O 'Ali eat from this, for indeed it will be more suitable for you.\"",
      "chain": [
        "30585",
        "20393",
        "20169",
        "11525",
        "12604"
      ]
    }
  ],
  "total_hadiths": 7
}