{
  "id": "11532",
  "name": "'Umayr bin 'Abdullah, Client Of Umm Fadl عمير بن عبد الله الهلالي",
  "full_name": "'Umayr bin 'Abdullah, Client Of Umm Fadl عمير بن عبد الله الهلالي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "104",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Hilali",
      "Client",
      "Ally B.Hashim",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "10934",
      "name": "'Abdullah bin 'Umayr عبد الله بن عمير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "156",
      "name": "Umm Fadl Lubaba bint al-Harith ( أم الفضل لبابة بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "135",
      "name": "Fadl ibn al-'Abbas ( الفضل بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12344",
      "name": "'Uthman bin Jbyr al-Ansari عثمان بن جبير الأنصاري مولى أبي أيوب",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10740",
      "name": "Isma'il bin Raja'a bin Rabi'a al-Zubaidi إسماعيل بن رجاء بن ربيعة الزبيدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "337",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن جعفر بن ربيعة، عن الأعرج، قال سمعت عميرا، مولى ابن عباس قال أقبلت أنا وعبد الله بن يسار، مولى ميمونة زوج النبي صلى الله عليه وسلم حتى دخلنا على أبي جهيم بن الحارث بن الصمة الأنصاري فقال أبو الجهيم أقبل النبي صلى الله عليه وسلم من نحو بئر جمل، فلقيه رجل فسلم عليه، فلم يرد عليه النبي صلى الله عليه وسلم حتى أقبل على الجدار، فمسح بوجهه ويديه، ثم رد عليه السلام‏.‏",
      "text_en": " Narrated Abu Juhaim Al-Ansari:                     The Prophet came from the direction of Bir Jamal. A man met him and greeted him. But he did not return back the greeting till he went to a (mud) wall and smeared his hands and his face with its dust (performed Tayammum) and then returned back the greeting.",
      "chain": [
        "30399",
        "20023",
        "11407",
        "11197",
        "11532"
      ]
    },
    {
      "hadith_no": "1988",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مالك، قال حدثني سالم، قال حدثني عمير، مولى أم الفضل أن أم، الفضل حدثته ح وحدثنا عبد الله بن يوسف أخبرنا مالك عن أبي النضر مولى عمر بن عبيد الله عن عمير مولى عبد الله بن العباس عن أم الفضل بنت الحارث أن ناسا تماروا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl bint Al-Harith:                     \"While the people were with me on the day of `Arafat they differed as to whether the Prophet was fasting or not; some said that he was fasting while others said that he was not fasting. So, I sent to him a bowl full of milk while he was riding over his camel and he drank it.\"",
      "chain": [
        "30175",
        "20031",
        "20001",
        "11011",
        "11532",
        "30355",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "hadith_no": "5678",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا أبو النضر، عن عمير، مولى ابن عباس عن أم الفضل بنت الحارث، أنها أرسلت إلى النبي صلى الله عليه وسلم بقدح لبن، وهو واقف عشية عرفة، فأخذ بيده فشربه‏.‏ زاد مالك عن أبي النضر على بعيره‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     (daughter of Al-Harith) that she sent a bowl of milk to the Prophet while he was standing (at `Arafat) in the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The Prophet was on the back of his camel.",
      "chain": [
        "20357",
        "32017",
        "20390",
        "11532",
        "156"
      ]
    },
    {
      "hadith_no": "5696",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن سالم أبي النضر، عن عمير، مولى أم الفضل عن أم الفضل، أنهم شكوا في صوم النبي صلى الله عليه وسلم يوم عرفة، فبعث إليه بقدح من لبن فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     that the people were in doubt whether the Prophet was fasting on the Day of `Arafat or not, so a (wooden) drinking vessel full of milk was sent to him, and he drank it.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11164",
        "11532"
      ]
    },
    {
      "hadith_no": "369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "قال مسلم وروى الليث بن سعد، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن عمير، مولى ابن عباس أنه سمعه يقول أقبلت أنا وعبد الرحمن بن يسار، مولى ميمونة زوج النبي صلى الله عليه وسلم حتى دخلنا على أبي الجهم بن الحارث بن الصمة الأنصاري فقال أبو الجهم أقبل رسول الله صلى الله عليه وسلم من نحو بئر جمل فلقيه رجل فسلم عليه فلم يرد رسول الله صلى الله عليه وسلم عليه حتى أقبل على الجدار فمسح وجهه ويديه ثم رد عليه السلام ‏.‏",
      "text_en": " Umair, the freed slave of Ibn 'Abbas, reported:                      I and 'Abd al-Rahmin b. Yasir, the freed slave of Maimuna, the wife of the Apostle (way peace be upon him). came to the house of Abu'l-Jahm b. al-Harith al-Simma Ansari and he said: The Messenger of Allah (may peace be upon him) came from the direction of Bi'r Jamal and a man met him; he saluted him but the Messenger of Allah (may peace be upon him) made no response, till he (the Holy Prophet) came to the wall, wiped his face and hands and then returned his salutations.",
      "chain": [
        "11407",
        "11197",
        "11532"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، أن أبا النضر، حدثه أن عميرا مولى ابن عباس - رضى الله عنهما - حدثه أنه، سمع أم الفضل، - رضى الله عنها - تقول شك ناس من أصحاب رسول الله صلى الله عليه وسلم في صيام يوم عرفة ونحن بها مع رسول الله صلى الله عليه وسلم فأرسلت إليه بقعب فيه لبن وهو بعرفة فشربه ‏.‏",
      "text_en": " Umm al-Fadl (Allah be pleased with her) is reported to have said that some people among the Companions of the Messenger of Allah (may peace be upon him) were in doubt about fasting on the day of 'Arafa and we were with him on that day. I (Umm al-Fadl) sent him a cup of milk and he was halting at 'Arafa, and he drank that.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "20390",
        "11532"
      ]
    },
    {
      "hadith_no": "329",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، أخبرنا أبي، عن جدي، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن عمير، مولى ابن عباس أنه سمعه يقول أقبلت أنا وعبد الله بن يسار، مولى ميمونة زوج النبي صلى الله عليه وسلم حتى دخلنا على أبي الجهيم بن الحارث بن الصمة الأنصاري فقال أبو الجهيم أقبل رسول الله صلى الله عليه وسلم من نحو بئر جمل فلقيه رجل فسلم عليه فلم يرد رسول الله صلى الله عليه وسلم عليه السلام حتى أتى على جدار فمسح بوجهه ويديه ثم رد عليه السلام ‏.‏",
      "text_en": " 'Umair, the freed slave of Ibn 'Abbas, said that he heard him say:                      I and 'Abd Allah b. Yasar, the freed slave of Maimunah, wife of the Prophet (ﷺ), came and entered upon Abu al-Juhaim b. al-Harith b. al-Simmat al-Ansari. Abu al-Juhaim said: The Messenger of Allah (ﷺ) came from Bir Jamal (a place near Medina) and a man met him and saluted him. The Messenger of Allah (ﷺ) did not return the salutation until he came to a wall and wiped his face and hands and then returned the salutation (i.e. after performing tayammum).",
      "chain": [
        "30489",
        "36033",
        "20023",
        "11407",
        "11197",
        "11532",
        "17"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، عن أبيه، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن عمير، مولى ابن عباس أنه سمعه يقول أقبلت أنا وعبد الله بن يسار، مولى ميمونة حتى دخلنا على أبي جهيم بن الحارث بن الصمة الأنصاري فقال أبو جهيم أقبل رسول الله صلى الله عليه وسلم من نحو بئر الجمل ولقيه رجل فسلم عليه فلم يرد رسول الله صلى الله عليه وسلم حتى أقبل على الجدار فمسح بوجهه ويديه ثم رد عليه السلام ‏.‏",
      "text_en": " It was narrated from 'Umair the freed slave of Ibn 'Abbas that he heard him say:                      \"Abdullah bin Yasar the freed slave of Maimunah, and I came and entered upon Abu Juhaim bin Al-Harith bin Al-Sammah Al-Ansari. Abu Juhaim said: 'The Messenger of Allah (ﷺ) came back from the direction of Bi'r Al-jamal and was met by a man who greeted him with Salam, but the Messenger of Allah (ﷺ) did not return the greeting until he turned to the wall and wiped his face and hands, then he returned the greeting.'\"",
      "chain": [
        "30583",
        "36033",
        "20023",
        "11407",
        "11197",
        "11532"
      ]
    }
  ],
  "total_hadiths": 8
}