{
  "id": "11533",
  "name": "'Isa bin Hafs bin 'Asim bin 'Umar عيسى بن حفص بن عاصم بن عمر - رباح",
  "full_name": "'Isa bin Hafs bin 'Asim bin 'Umar عيسى بن حفص بن عاصم بن عمر - رباح",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "157",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.'Adi",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11420",
      "name": "Hafs bin 'Asim bin 'Umar حفص بن عاصم بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11905",
      "name": "'Umar bin Hafs bin 'Asim عمر بن حفص بن عاصم بن عمر بن الخطاب",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11420",
      "name": "Hafs bin 'Asim bin 'Umar حفص بن عاصم بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12361",
      "name": "Ata'a bin Abi Mrwan عطاء بن أبي مروان الأسلمي أبو مصعب",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20120",
      "name": "al-Waqidi محمد بن عمر بن واقد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1102",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن عيسى بن حفص بن عاصم، قال حدثني أبي أنه، سمع ابن عمر، يقول صحبت رسول الله صلى الله عليه وسلم فكان لا يزيد في السفر على ركعتين، وأبا بكر وعمر وعثمان كذلك  رضى الله عنهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I accompanied Allah's Apostle and he never offered more than two rak`at during the journey. Abu Bakr, `Umar and `Uthman used to do the same.",
      "chain": [
        "30175",
        "20031",
        "11533",
        "11420",
        "18"
      ]
    },
    {
      "hadith_no": "1611",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا عيسى بن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، قال صحبت ابن عمر في طريق مكة - قال - فصلى لنا الظهر ركعتين ثم أقبل وأقبلنا معه حتى جاء رحله وجلس وجلسنا معه فحانت منه التفاتة نحو حيث صلى فرأى ناسا قياما فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا لأتممت صلاتي يا ابن أخي إني صحبت رسول الله صلى الله عليه وسلم في السفر فلم يزد على ركعتين حتى قبضه الله وصحبت أبا بكر فلم يزد على ركعتين حتى قبضه الله وصحبت عمر فلم يزد على ركعتين حتى قبضه الله ثم صحبت عثمان فلم يزد على ركعتين حتى قبضه الله وقد قال الله ‏{‏ لقد كان لكم في رسول الله أسوة حسنة‏}‏ ‏.‏",
      "text_en": " Hafs b. 'Asim said:                      I accompanied Ibn 'Umar on the road to Mecca and he led us in two rak'ahs at the noon prayer, then he went forward and we too went along with him to a place where he alighted, and he sat and we sat along with him, and he cast a glance to the side where he said prayer and he saw people standing and asked: What are they doing? I said: They are engaged in glorifying Allah, offering Sunnah prayer. He said: If I had done so I would have perfected my prayer; O my nephew! I accompanied the Messenger of Allah (may peace be upon him) on a journey, and he made no addittion to two rak'ahs, till Allah called him. I accompanied Abu Bakr and he made no addition to two rak'ahs till Allah caused him to die. I accompanied 'Umar and he made no addition to two rak'ahs till Allah caused him to die. I accompanied 'Uthman and he made no addition to two rak'ahs, till Allah caused him to die, and Allah has said:\" There is a model pattern for you in the Messenger of Allah\" (al-Qur'an, xxxiii. 21).",
      "chain": [
        "11533",
        "11420"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا عثمان بن عمر، أخبرنا عيسى بن حفص بن عاصم، حدثنا نافع، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صبر على لأوائها كنت له شفيعا أو شهيدا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who patiently endures the hardships of it (of this city of Medina), I would be an intercessor or a withness on his behalf on the Day of Resurrection.",
      "chain": [
        "30022",
        "20262",
        "11533",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1223",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا القعنبي، حدثنا عيسى بن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، قال صحبت ابن عمر في طريق - قال - فصلى بنا ركعتين ثم أقبل فرأى ناسا قياما فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا أتممت صلاتي يا ابن أخي إني صحبت رسول الله صلى الله عليه وسلم في السفر فلم يزد على ركعتين حتى قبضه الله عز وجل وصحبت أبا بكر فلم يزد على ركعتين حتى قبضه الله عز وجل وصحبت عمر فلم يزد على ركعتين حتى قبضه الله تعالى وصحبت عثمان فلم يزد على ركعتين حتى قبضه الله تعالى وقد قال الله عز وجل ‏{‏ لقد كان لكم في رسول الله أسوة حسنة ‏}‏ ‏.‏",
      "text_en": " Narrated Hafs b. 'Asim:                     I accompanied Ibn 'Umar on the way (on a journey). He led us in two rak'ah's of (the noon) prayer. Then he proceeded and saw some people standing. He asked: What are they doing ? I replied: They are glorifying Allah (i.e. offering supererogatory prayer). He said: If I had offered the supererogatory prayer (while travelling), I would have completed prayer, my cousin. I accompanied the Messenger of Allah (ﷺ) during the journey, he did not pray more than two raka'at until his death. I also accompanied Abu Bakr, and he prayed two raka'at and nothing more until he died. I also accompanied 'Umar, and he prayed two raka'at and nothing more until he died. I also accompanied 'Uthman, and he prayed two raka'at and nothing more until he died. Indeed Allah, the Exalted, said: \"Certainly you have in the Messenger of Allah an excellent exemplar\"",
      "chain": [
        "20164",
        "11533",
        "11420"
      ]
    },
    {
      "hadith_no": "1458",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرني نوح بن حبيب، قال حدثنا يحيى بن سعيد، قال حدثنا عيسى بن حفص بن عاصم، قال حدثني أبي قال، كنت مع ابن عمر في سفر فصلى الظهر والعصر ركعتين ثم انصرف إلى طنفسة له فرأى قوما يسبحون قال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مصليا قبلها أو بعدها لأتممتها صحبت رسول الله صلى الله عليه وسلم فكان لا يزيد في السفر على الركعتين وأبا بكر حتى قبض وعمر وعثمان - رضى الله عنهم - كذلك ‏.‏",
      "text_en": " 'Eisa bin Hafs bin 'Asim said:                     \"My father told me: 'I was with Ibn Umar on a journey, and he prayed Zuhr and 'Asr with two rak'ahs each, then he went and sat on his carpet. He saw some people offering voluntary prayers and said: What are these people doing? I said: They are offering voluntary prayers. He said: If I had wanted to pray before and after (the obligatory prayer) I would have offered it in full. I accompanied the Messenger of Allah (ﷺ) and he did not pray more than two rak'ahs when traveling, and Abu Bakr (did likewise) until he died, as did 'Umar and 'Uthman, may Allah (SWT) be pleased with them all.\"",
      "chain": [
        "38671",
        "20031",
        "11533",
        "11420"
      ]
    },
    {
      "hadith_no": "1124",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا أبو عامر، عن عيسى بن حفص بن عاصم بن عمر بن الخطاب، حدثني أبي قال، كنا مع ابن عمر في سفر فصلى بنا ثم انصرفنا معه وانصرف ‏.‏ قال فالتفت فرأى أناسا يصلون فقال ما يصنع هؤلاء قلت يسبحون ‏.‏ قال لو كنت مسبحا لأتممت صلاتي يا ابن أخي إني صحبت رسول الله  صلى الله عليه وسلم  فلم يزد على ركعتين في السفر حتى قبضه الله ثم صحبت أبا بكر فلم يزد على ركعتين ثم صحبت عمر فلم يزد على ركعتين ثم صحبت عثمان فلم يزد على ركعتين حتى قبضهم الله والله يقول ‏{لقد كان لكم في رسول الله أسوة حسنة ‏}‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Isa bin Hafs bin ‘Asim bin ‘Umar bin Khattabthat his father told him:                      “We were with Ibn ‘Umar on a journey,and he led us in prayer. Then we finished with him and he finishedturning around, and saw some people praying. He said: ‘What arethese people doing?’ I said: ‘Glorifying Allah.’* He said: ‘IfI wanted to glorify Allah (perform voluntary prayer) I would havecompleted my prayer. O son of my brother! I accompanied the Messengerof Allah (ﷺ) and he never prayed more than two Rak’ah when he wastraveling, until Allah took his soul. Then I accompanied Abu Bakr andhe never prayed more than two Rak’ah (when he was traveling), untilAllah took his soul. Then I accompanied ‘Umar and he never prayedmore than two Rak’ah, until Allah took his soul. Then I accompanied‘Uthman and he never prayed more than two Rak’ah, until Allahtook his soul. Allah says: ‘Indeed in the Messnger of Allah(Muhammad (ﷺ)) you have a good example to follow.’” [33:21]",
      "chain": [
        "30357",
        "20443",
        "11533",
        "11420"
      ]
    }
  ],
  "total_hadiths": 6
}