{
  "id": "11537",
  "name": "Muhammad bin 'Amr bin Halhala محمد بن عمرو بن حلحلة الديلي",
  "full_name": "Muhammad bin 'Amr bin Halhala محمد بن عمرو بن حلحلة الديلي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Dayli",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1134",
      "name": "'Abdur Rahman bin Ka'b bin Malik ( عبد الرحمن بن كعب بن مالك السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12479",
      "name": "Muhammad bin 'Imran al-Ansari محمد بن عمران الأنصاري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11231",
      "name": "Wahb bin Kysan al-Quraishi وهب بن كيسان القرشي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28603",
      "name": "al-Nadr bin Muhammad النضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11230",
      "name": "al-Walid bin Kathir al-Makhzumi الوليد بن كثير المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "828",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء،‏.‏ وحدثنا الليث، عن يزيد بن أبي حبيب، ويزيد بن محمد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب النبي صلى الله عليه وسلم فذكرنا صلاة النبي صلى الله عليه وسلم فقال أبو حميد الساعدي أنا كنت أحفظكم لصلاة رسول الله صلى الله عليه وسلم رأيته إذا كبر جعل يديه حذاء منكبيه، وإذا ركع أمكن يديه من ركبتيه، ثم هصر ظهره، فإذا رفع رأسه استوى حتى يعود كل فقار مكانه، فإذا سجد وضع يديه غير مفترش ولا قابضهما، واستقبل بأطراف أصابع رجليه القبلة، فإذا جلس في الركعتين جلس على رجله اليسرى ونصب اليمنى، وإذا جلس في الركعة الآخرة قدم رجله اليسرى ونصب الأخرى وقعد على مقعدته‏.‏ وسمع الليث يزيد بن أبي حبيب ويزيد من محمد بن حلحلة وابن حلحلة من ابن عطاء‏.‏ قال أبو صالح عن الليث كل فقار‏.‏ وقال ابن المبارك عن يحيى بن أيوب قال حدثني يزيد بن أبي حبيب أن محمد بن عمرو حدثه كل فقار‏.‏",
      "text_en": " Narrated Muhammad bin `Amr bin `Ata':                     I was sitting with some of the companions of Allah's Apostle and we were discussing about the way of praying of the Prophet. Abu Humaid As-Sa`idi said, \"I remember the prayer of Allah's Apostle better than any one of you. I saw him raising both his hands up to the level of the shoulders on saying the Takbir; and on bowing he placed his hands on both knees and bent his back straight, then he stood up straight from bowing till all the vertebrate took their normal positions. In prostrations, he placed both his hands on the ground with the forearms away from the ground and away from his body, and his toes were facing the Qibla. On sitting In the second rak`a he sat on his left foot and propped up the right one; and in the last rak`a he pushed his left foot forward and kept the other foot propped up and sat over the buttocks.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11168",
        "11537",
        "11220",
        "20023",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "5701",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن محمد بن عمرو بن حلحلة، عن عطاء بن يسار، عن أبي سعيد الخدري، وعن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما يصيب المسلم من نصب ولا وصب ولا هم ولا حزن ولا أذى ولا غم حتى الشوكة يشاكها، إلا كفر الله بها من خطاياه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     The Prophet said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that.\"",
      "chain": [
        "30351",
        "20394",
        "11537",
        "11020",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "6591",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن محمد بن عمرو بن حلحلة، عن معبد بن كعب بن مالك، عن أبي قتادة بن ربعي الأنصاري، أنه كان يحدث أن رسول الله صلى الله عليه وسلم مر عليه بجنازة فقال ‏\"‏ مستريح، ومستراح منه ‏\"‏‏.‏ قالوا يا رسول الله ما المستريح والمستراح منه قال ‏\"‏ العبد المؤمن يستريح من نصب الدنيا وأذاها إلى رحمة الله، والعبد الفاجر يستريح منه العباد والبلاد والشجر والدواب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada bin Rib'i Al-Ansari:                     A funeral procession passed by Allah's Apostle who said, \"Relieved or relieving?\" The people asked, \"O Allah's Apostle! What is relieved and relieving?\" He said, \"A believer is relieved (by death) from the troubles and hardships of the world and leaves for the Mercy of Allah, while (the death of) a wicked person relieves the people, the land, the trees, (and) the animals from him.\"",
      "chain": [
        "30103",
        "20001",
        "11537",
        "1134"
      ]
    },
    {
      "hadith_no": "6592",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبد ربه بن سعيد، عن محمد بن عمرو بن حلحلة، حدثني ابن كعب، عن أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ مستريح، ومستراح منه، المؤمن يستريح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Relieved or relieving. And a believer is relieved (by death).",
      "chain": [
        "30175",
        "20031",
        "11191",
        "11537",
        "391"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، عن ابن عباس، أن رسول الله صلى الله عليه وسلم جمع عليه ثيابه ثم خرج إلى الصلاة فأتي بهدية خبز ولحم فأكل ثلاث لقم ثم صلى بالناس وما مس ماء ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Messenger of Allah (may peace be upon him) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.",
      "chain": [
        "20387",
        "20155",
        "11537",
        "11220",
        "17"
      ]
    },
    {
      "hadith_no": "2245",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن محمد بن عمرو، بن حلحلة عن معبد بن كعب بن مالك، عن أبي قتادة بن ربعي، أنه كان يحدث أن رسول الله صلى الله عليه وسلم مر عليه بجنازة فقال ‏\"‏ مستريح ومستراح منه ‏\"‏ ‏.‏ قالوا يا رسول الله ما المستريح والمستراح منه ‏.‏ فقال ‏\"‏ العبد المؤمن يستريح من نصب الدنيا والعبد الفاجر يستريح منه العباد والبلاد والشجر والدواب ‏\"‏ ‏.‏",
      "text_en": " Qatada b. Rib'i reported Allah's Messenger (may peace be upon him) as saying:                      Whenever a bier passed before him, he said: He is the one to find relief and the one with (the departure of him) other will find relief. They said: Apostle of Allah, who is al-Mustarih and al-Mustarah? Upon this he said: The believing servant finds relief from the troubles of the world, and in the death of a wicked person, the people, towns, trees and animals find rellef.",
      "chain": [
        "30367",
        "20001",
        "11537",
        "1134"
      ]
    },
    {
      "hadith_no": "5389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، وأبو بكر بن إسحاق قالا حدثنا ابن أبي، مريم أخبرنا محمد بن جعفر، أخبرني محمد بن عمرو بن حلحلة، عن وهب بن كيسان، عن  عمر بن أبي سلمة، أنه قال أكلت يوما مع رسول الله صلى الله عليه وسلم فجعلت آخذ من لحم حول الصحفة فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل مما يليك ‏\"‏ ‏.‏",
      "text_en": " Umar b. Abu Salama reported:                      I (had the opportunity) one day to dine with Allah's Messenger (may peace be upon him), and I picked up flesh from around the dish. Thereupon Allah's Messenger (may peace be upon him) said: Eat from that which is near to you.",
      "chain": [
        "30115",
        "11108",
        "30232",
        "20173",
        "11537",
        "11231",
        "246"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن لهيعة، عن يزيد، - يعني ابن أبي حبيب - عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو العامري، قال كنت في مجلس من أصحاب رسول الله صلى الله عليه وسلم فتذاكروا صلاة رسول الله صلى الله عليه وسلم فقال أبو حميد فذكر بعض هذا الحديث وقال فإذا ركع أمكن كفيه من ركبتيه وفرج بين أصابعه ثم هصر ظهره غير مقنع رأسه ولا صافح بخده وقال فإذا قعد في الركعتين قعد على بطن قدمه اليسرى ونصب اليمنى فإذا كان في الرابعة أفضى بوركه اليسرى إلى الأرض وأخرج قدميه من ناحية واحدة ‏.‏",
      "text_en": " ‘Amr al-Amiri said:                      I (once) attended the meeting of the companions of the Messenger of Allah(ﷺ). They began to discuss his prayer. Abu Humaid then narrated a part of the same tradition and said: When he bowed he clutched his knees with his palms, and he opened his fingers; then he bent his back without raising his upwards, and did not turn his face (on any side). When he sat at the end of two rak’ahs he sat on the sole of his left foot and raised the right, and after the fourth he placed his left hip on the ground and spread out both his feet one side.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "732",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم المصري، حدثنا ابن وهب، عن الليث بن سعد، عن يزيد بن محمد القرشي، ويزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، نحو هذا قال فإذا سجد وضع يديه غير مفترش ولا قابضهما واستقبل بأطراف أصابعه القبلة ‏.‏",
      "text_en": " The above mentioned tradition has also been reported by Muhammad b. ‘Amr b. ‘Ata’ through a different chain of narrators. This version adds:                      “When he prostrated himself he neither placed his arms on the ground nor closed them; putting forward his fingers towards the qiblah.”",
      "chain": [
        "20029",
        "20023",
        "11546",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن إبراهيم المصري، حدثنا ابن وهب، عن الليث، عن يزيد بن محمد القرشي، ويزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب رسول الله صلى الله عليه وسلم بهذا الحديث ولم يذكر أبا قتادة قال فإذا جلس في الركعتين جلس على رجله اليسرى فإذا جلس في الركعة الأخيرة قدم رجله اليسرى وجلس على مقعدته ‏.‏",
      "text_en": " Muhammad b. ‘Amr b.’Ata’ was sitting in the company of a few Companions of the Messenger of Allah (ﷺ). He then narrated his tradition, but he did not mention  the name of Abu Qatadah. He said:                      When he( the Prophet) sat up the two rak’ahs he sat on his left foot; and when sat up after the last rak’ah he put out his left foot and sat on his hip.",
      "chain": [
        "20029",
        "20023",
        "11546",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو العامري، قال كنت في مجلس بهذا الحديث قال فيه فإذا قعد في الركعتين قعد على بطن قدمه اليسرى ونصب اليمنى فإذا كانت الرابعة أفضى بوركه اليسرى إلى الأرض وأخرج قدميه من ناحية واحدة ‏.‏",
      "text_en": " Muhammad b. ‘Amr al-Amir said:                      I was sitting in the company( of the Companions). He then narrated this tradition saying: When he(the Prophet) sat up after two rak’ahs, he sat on the sole of his left foot and raised his left foot. When he sat up after four rak’ahs, he placed his left hip on the ground and put out his both feet on one side.",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "1859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - هو ابن جعفر - عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أن سلمة بن الأزرق، قال سمعت أبا هريرة، قال مات ميت من آل رسول الله صلى الله عليه وسلم فاجتمع النساء يبكين عليه فقام عمر ينهاهن ويطردهن فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعهن يا عمر فإن العين دامعة والقلب مصاب والعهد قريب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Amr bin 'Ata that Salamah bin Al-Azraq said:                     \"I heard Abu Hurairah say: 'Someone from the family of the Messenger of Allah died, and the women gathered, weeping for him. 'Umar stood up and told them not to do that, and threw them out, but the Messenger of Allah said: Let them be there, O 'Umar, for the eye weeps and the heart grieves, but soon we will join them.\"",
      "chain": [
        "20387",
        "20155",
        "11537",
        "11220",
        "13515",
        "13"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن محمد بن عمرو بن حلحلة، عن معبد بن كعب بن مالك، عن أبي قتادة بن ربعي، أنه كان يحدث أن رسول الله صلى الله عليه وسلم مر عليه بجنازة فقال ‏\"‏ مستريح ومستراح منه ‏\"‏ ‏.‏ فقالوا ما المستريح وما المستراح منه قال ‏\"‏ العبد المؤمن يستريح من نصب الدنيا وأذاها والعبد الفاجر يستريح منه العباد والبلاد والشجر والدواب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah bin Raib'i that he used to narrate:                     \"A funeral passed by the Messenger of Allah and he said: 'He is relieved and others are relieved of him.' They said: 'What does relieved mean and what does relieved of him mean: He said: \"The believing slave is relieved of the hardships and troubles of this world, and the people, the land, the trees and the animals are relieved of the immoral slave.\"'",
      "chain": [
        "30367",
        "20001",
        "11537",
        "1134"
      ]
    }
  ],
  "total_hadiths": 13
}