{
  "id": "11535",
  "name": "Muhammad bin Abi Harmala محمد بن أبي حرملة",
  "full_name": "Muhammad bin Abi Harmala محمد بن أبي حرملة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1238",
      "name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11542",
      "name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20706",
      "name": "Musa bin Y'aqub bin 'Abdullah bin Wahb موسى بن يعقوب بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1695",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن محمد بن أبي حرملة، عن كريب، مولى ابن عباس عن أسامة بن زيد  رضى الله عنهما  أنه قال ردفت رسول الله صلى الله عليه وسلم من عرفات فلما بلغ رسول الله صلى الله عليه وسلم الشعب الأيسر الذي دون المزدلفة أناخ، فبال ثم جاء فصببت عليه الوضوء، فتوضأ وضوءا خفيفا‏.‏ فقلت الصلاة يا رسول الله‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فركب رسول الله صلى الله عليه وسلم حتى أتى المزدلفة، فصلى ثم ردف الفضل رسول الله صلى الله عليه وسلم غداة جمع‏.‏   قال كريب فأخبرني عبد الله بن عباس  رضى الله عنهما  عن الفضل، أن رسول الله صلى الله عليه وسلم لم يزل يلبي حتى بلغ الجمرة‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     I rode behind Allah's Apostle from `Arafat and when Allah's Apostle reached the mountain pass on the left side which is before Al-Muzdalifa he made his camel kneel and then urinated, and then I poured water for his ablution. He performed light ablution and then I said to him: (Is it the time for) the prayer, O Allah's Apostle!\" He replied, \"The (place of) prayer is ahead of you (i.e. at Al- Muzdalifa).\" So Allah's Apostle rode till he reached Al-Muzdalifa and then he offered the prayer (there) . Then in the morning (10th Dhul-Hijja) Al-Faql (bin `Abbas) rode behind Allah's Apostle. Kuraib, (a sub-narrator) said that `Abdullah bin `Abbas narrated from Al-Fadl, \"Allah's Apostle (p.b.u.h) kept on reciting Talbiya (during the journey) till he reached the Jamra.\" (Jamrat-Al-`Aqaba)",
      "chain": [
        "30367",
        "20155",
        "11535",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "1971",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وعلي بن حجر، قال ابن أيوب حدثنا إسماعيل، - وهو ابن جعفر - أخبرني محمد، - وهو ابن أبي حرملة - قال أخبرني أبو سلمة، أنه سأل عائشة عن السجدتين اللتين، كان رسول الله صلى الله عليه وسلم يصليهما بعد العصر فقالت كان يصليهما قبل العصر ثم إنه شغل عنهما أو نسيهما فصلاهما بعد العصر ثم أثبتهما وكان إذا صلى صلاة أثبتها ‏.‏ قال يحيى بن أيوب قال إسماعيل تعني داوم عليها ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) did not abandon at all observing two rak'ahs after the 'Asr in my house.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11535",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2580",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن محمد، - وهو ابن أبي حرملة - عن كريب، أن أم الفضل بنت الحارث، بعثته إلى معاوية بالشام قال فقدمت الشام فقضيت حاجتها واستهل على رمضان وأنا بالشام فرأيت الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني عبد الله بن عباس - رضى الله عنهما - ثم ذكر الهلال فقال متى رأيتم الهلال فقلت رأيناه ليلة الجمعة ‏.‏ فقال أنت رأيته فقلت نعم ورآه الناس وصاموا وصام معاوية ‏.‏ فقال لكنا رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين أو نراه ‏.‏ فقلت أولا تكتفي برؤية معاوية وصيامه فقال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏ وشك يحيى بن يحيى في نكتفي أو تكتفي ‏.‏",
      "text_en": " Kuraib reported that Umm Fadl, daughter of Harith, sent him (Fadl, i. e. her son) to Mu'awiya in Syria. I (Fadl) arrived in Syria, and did the needful for her. It was there in Syria that the month of Ramadan commenced. I saw the new moon (of Ramadan) on Friday. I then came back to Medina at the end of the month. Abdullah b. 'Abbas (Allah be pleased with him) asked me (about the new moon of Ramadan) and said:                      When did you see it? I said.: We saw it on the night of Friday. He said: (Did) you see it yourself? -I said: Yes, and the people also saw it and they observed fast and Mu'awiya also observed fast, whereupon he said: But we saw it on Saturday night. So we would continue to observe fast till we complete thirty (lasts) or we see it (the new moon of Shawwal). I said: Is the sightidg of the moon by Mu'awiya not valid for you? He said: No; this is how the Messenger of Allah (may peace be upon him) has commanded us. Yahya b. Yahya was in doubt (whether the word used in the narration by Kuraib) was Naktafi or Taktafi.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11535",
        "11211"
      ]
    },
    {
      "hadith_no": "3146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، ح. وحدثنا يحيى بن يحيى، - واللفظ له - قال أخبرنا إسماعيل بن جعفر، عن محمد بن، أبي حرملة عن كريب، مولى ابن عباس عن أسامة بن زيد، قال ردفت رسول الله صلى الله عليه وسلم من عرفات فلما بلغ رسول الله صلى الله عليه وسلم الشعب الأيسر الذي دون المزدلفة أناخ فبال ثم جاء فصببت عليه الوضوء فتوضأ وضوءا خفيفا ثم قلت الصلاة يا رسول الله ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فركب رسول الله صلى الله عليه وسلم حتى أتى المزدلفة فصلى ثم ردف الفضل رسول الله صلى الله عليه وسلم غداة جمع. قال كريب فأخبرني عبد الله بن عباس، عن الفضل، أن رسول الله صلى الله عليه وسلم لم يزل يلبي حتى بلغ الجمرة ‏.‏",
      "text_en": " Usama b. Zaid (Allah be pleased with him) reported:                      I was sitting behind Allah's Messenger (may peace be upon him) on the riding animal from 'Arafat. As Allah's Messenger (may peace be upon him) reached the left side of the mountain which was situated near Muzdalifa, he made the camel kneel down and made water and then came back. I poured water and he, performed light ablution. I then said: Messenger of Allah, it is time for prayer. Thereupon Allah's Messenger (may peace be upon him) said: The prayer awaits you (at the next station, Muzdalifa). Allah's Messenger (may peaced be upon him) rode on until he came to Muzdalifa and observed prayer. Then al-Fadl (Allah be pleased with him) sat behind Allah's Messenger (may peace be upon him) and reached (Muzdalifa) in the morning. Kuraib said: 'Abdullah b. 'Abbas (Allah be pleased with them) narrated from al-Fadl (Allah be pleased with him) that Allah's Messenger (may peace be upon him) continued pronouncing Talbiya until he reached al-Jamara (al-'Aqaba).",
      "chain": [
        "20379",
        "30367",
        "20208",
        "30399",
        "20155",
        "11535",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "4109",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، عن محمد، - وهو ابن أبي حرملة - عن سالم بن عبد، الله عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتنى كلبا إلا كلب ماشية أو كلب صيد نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏ قال عبد الله وقال أبو هريرة ‏\"‏ أو كلب حرث ‏\"‏ ‏.‏",
      "text_en": " Salim b. 'Abdullah reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      He who kept a dog other than one meant for watching the herd or for hunting would lose every day two qirat of his good deeds. 'Abdullah and Abu Huraira also said: Or dog meant for watching the field.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20031",
        "11418",
        "11535",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6362",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - يعنون ابن جعفر - عن محمد بن أبي حرملة، عن عطاء، وسليمان، ابنى يسار وأبي سلمة بن عبد الرحمن أن عائشة، قالت كان رسول الله صلى الله عليه وسلم مضطجعا في بيتي كاشفا عن فخذيه أو ساقيه فاستأذن أبو بكر فأذن له وهو على تلك الحال فتحدث ثم استأذن عمر فأذن له وهو كذلك فتحدث ثم استأذن عثمان فجلس رسول الله صلى الله عليه وسلم وسوى ثيابه - قال محمد ولا أقول ذلك في يوم واحد - فدخل فتحدث فلما خرج قالت عائشة دخل أبو بكر فلم تهتش له ولم تباله ثم دخل عمر فلم تهتش له ولم تباله ثم دخل عثمان فجلست وسويت ثيابك فقال ‏\"‏ ألا أستحي من رجل تستحي منه الملائكة ‏\"‏ ‏.‏",
      "text_en": " A'isha reported:                      Allah's Messenger (may peace be upon him) was lying in the bed in my apartment with his thigh or his shank uncovered that Abu Bakr sought permission to get in. It was given to him and he conversed in the same very state (the Prophet's thigh or shank uncovered). Then 'Umar sought permission for getting in and it was given to him and he conversed in that very state. Then 'Uthman sought permission for getting in; Allah's Messenger (may peace be upon him) sat down and he set right his clothes. Mubammad (one of the narrators) said: I do not say that it happened on the same day. He ('Uthman) then entered and conversed and as he went out, A'isha said: Abu Bakr entered aind you did not stir and did not observe much care (in arranging your clothes), then 'Umar entered and you did not stir and did not arrange your clothes, then 'Uthman entered and you got up and set your clothes right, thereupon he said: Should I not show modesty to one whom even the Angels show modesty.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "11535",
        "11029",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "2332",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا إسماعيل، - يعني ابن جعفر - أخبرني محمد بن أبي حرملة، أخبرني كريب، أن أم الفضل ابنة الحارث، بعثته إلى معاوية بالشام قال فقدمت الشام فقضيت حاجتها فاستهل رمضان وأنا بالشام فرأينا الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني ابن عباس ثم ذكر الهلال فقال متى رأيتم الهلال قلت رأيته ليلة الجمعة ‏.‏ قال أنت رأيته قلت نعم ورآه الناس وصاموا وصام معاوية ‏.‏ قال لكنا رأيناه ليلة السبت فلا نزال نصومه حتى نكمل الثلاثين أو نراه ‏.‏ فقلت أفلا تكتفي برؤية معاوية وصيامه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Kuraib:                     That Umm al-Fadl, daughter of al-Harith, sent him to Mu'aqiyah in Syria. He said: I came to syria and performed her work. The moon of Ramadan appeared while I was in Syria. We sighted the moon on the night of Friday. When I came to Median towards the end of the month (of Ramadan), Ibn 'Abbas asked me about the moon. He said: When did you sight the moon ? I said: I sighted it on the night of Friday. He asked: Did you sight it yourself ? I said: Yes, and the people sighted it. They fasted and Mu'awiyah also fasted. He said: But we sighted it on the night of saturday. Since then we have been fasting until we complete thirty days or we sight it. Then I said: Are the sighting of the moon by Mu'awiyah and his fasts not sufficient for us? He replied: No. The Messenger of Allah (ﷺ) commanded us to do so.",
      "chain": [
        "20040",
        "20155",
        "11535",
        "11211"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن أبي حرملة، أخبرني كريب، أن أم الفضل بنت الحارث، بعثته إلى معاوية بالشام ‏.‏ قال فقدمت الشام فقضيت حاجتها واستهل على هلال رمضان وأنا بالشام فرأينا الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني ابن عباس ثم ذكر الهلال فقال متى رأيتم الهلال فقلت رأيناه ليلة الجمعة ‏.‏ فقال أأنت رأيته ليلة الجمعة فقلت رآه الناس وصاموا وصام معاوية ‏.‏ قال لكن رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين يوما أو نراه ‏.‏ فقلت ألا تكتفي برؤية معاوية وصيامه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح غريب ‏.‏ والعمل على هذا الحديث عند أهل العلم أن لكل أهل بلد رؤيتهم ‏.‏",
      "text_en": " Muhammad bin Abi Harmalah narrated:                     \"Kuraib informed me that Umm Al-Fadl bin Al-Harith sent him to Mu'awiyah in Ash-Sham. He said: 'So I arrived in Ash-Sham and finished her errand, and I saw the crescent of Ramadan while I was in Ash-Sham. We saw the crescent on the night of Friday. Then I arrived in Al-Madinah at the end of the month. Ibn Abbas was questioning me, then he mentioned the crescent and he said: \"When did you see the crescent?\" I said: \"We saw it n the night of Friday.\" He said: \"Did you see it on the night of Friday?\" I said: \"The people saw it, so they fasted, and Mu'awiyah fasted.\" He said: \"But we saw it on the night of Saturday, so we will not stop fasting until we complete thirty days or we see it.\" So I said: \"Is not the sighting and fasting of Mu'awiyah enough for you?\" He said: \"This is not how the Messenger of Allah ordered us.\"",
      "chain": [
        "20387",
        "20155",
        "11535",
        "11211"
      ]
    },
    {
      "hadith_no": "585",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا محمد بن أبي حرملة، عن أبي سلمة، أنه سأل عائشة عن السجدتين اللتين، كان رسول الله صلى الله عليه وسلم يصليهما بعد العصر فقالت إنه كان يصليهما قبل العصر ثم إنه شغل عنهما أو نسيهما فصلاهما بعد العصر وكان إذا صلى صلاة أثبتها ‏.‏",
      "text_en": " It was narrated from Abu Salamah that he asked 'Aishah about the two prostrations (Rak'ahs) that the Messenger of Allah (ﷺ) used to pray after 'Asr. She said:                      \"He used to pray them before 'Asr, but if he got distracted or forgot them, he would pray them after 'Asr, and if he did a prayer he would be constant in it.\"",
      "chain": [
        "20387",
        "20208",
        "11535",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "616",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا سفيان، عن إبراهيم بن عقبة، ومحمد بن أبي حرملة، عن كريب، عن ابن عباس، عن أسامة بن زيد، وكان النبي، صلى الله عليه وسلم أردفه من عرفة فلما أتى الشعب نزل فبال ولم يقل أهراق الماء قال فصببت عليه من إداوة فتوضأ وضوءا خفيفا ‏.‏ فقلت له الصلاة ‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏ ‏.‏ فلما أتى المزدلفة صلى المغرب ثم نزعوا رحالهم ثم صلى العشاء ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid, whom the Prophet (ﷺ) had seated behind him on his camel on the way from 'Arafah, that when he reached the mountain pass, he dismounted and urinated - and he did not say that he passed water. He (Usamah) said:                      \"I poured water for him from a small vessel and he performed a light Wudu'. I said to him: 'The prayer.' He said: 'The prayer is still ahead of you.' When he came to Al-Muzdalifah he prayed Maghrib, then they untied the saddles of their mounts and then he prayed 'Isha'.\"",
      "chain": [
        "30325",
        "20005",
        "11125",
        "11535",
        "11211",
        "17",
        "50"
      ]
    },
    {
      "hadith_no": "2111",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا محمد، - وهو ابن أبي حرملة - قال أخبرني كريب، أن أم الفضل، بعثته إلى معاوية بالشام - قال - فقدمت الشام فقضيت حاجتها واستهل على هلال رمضان وأنا بالشام فرأيت الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني عبد الله بن عباس ثم ذكر الهلال فقال متى رأيتم فقلت رأيناه ليلة الجمعة ‏.‏ قال أنت رأيته ليلة الجمعة قلت نعم ورآه الناس فصاموا وصام معاوية ‏.‏ قال لكن رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين يوما أو نراه ‏.‏ فقلت أولا تكتفي برؤية معاوية وأصحابه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Kuraib narrated that Umm Al-Fadl sent him to Muawiyah in Ash-Sham. He said:                     \"I came to Ash-Sham. He said: \"I came to Ash-Sham and complete her errand. Then the new crescent of Ramadan was sighted while I was in Ash-Sham. I saw the new crescent on the night of Friday, then I came to Al-Madinah at the end of the month. 'Abdullah bin 'Abbas asked me about the sighting of the moon and said: ' When did you see it?' I said: 'We saw it on the night of Friday.' He said; 'You saw it on the ninth of Friday?' I said: 'Yes, and the people saw it and started fasting, and so did Muawiyah. He said: 'But we saw it on the night of Saturday, so we will continue fasting until we have completed thirty days or we see it.' I said: 'Will you not be content with the sighting of Muawiyah and his companions? He said; 'No; this is what the Messenger of Allah enjoined upon us.\"'",
      "chain": [
        "20387",
        "20208",
        "11535",
        "11211"
      ]
    },
    {
      "hadith_no": "2404",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا محمد بن أبي حرملة، عن عطاء بن يسار، عن أبي ذر، قال أوصاني حبيبي صلى الله عليه وسلم بثلاثة لا أدعهن إن شاء الله تعالى أبدا أوصاني بصلاة الضحى وبالوتر قبل النوم وبصيام ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"My beloved Prophet advised me to do three things which I will never give up, if Allah wills. He advised me to pray Duha, to pray Witr before sleeping, and to fast three days of each month.\"",
      "chain": [
        "20387",
        "20208",
        "11535",
        "11020",
        "23"
      ]
    },
    {
      "hadith_no": "4291",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - يعني ابن جعفر - قال حدثنا محمد بن أبي حرملة، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتنى كلبا إلا كلب ماشية أو كلب صيد نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏ قال عبد الله وقال أبو هريرة ‏\"‏ أو كلب حرث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim bin 'Abdullah that his father said:                     \"The Messenger of Allah said: \"Whoever keeps a dog for herding livestock or a dog for hunting, one Qirat  Will be deducted from his reward each day.\" 'Abdullah said: \"Abu Hurairah said: 'Or a dog for farming.\"'",
      "chain": [
        "20387",
        "20155",
        "11535",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 13
}