{
  "id": "11530",
  "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
  "full_name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "'Asqalan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Madni",
      "al-'Asqalani"
    ]
  },
  "parents": [
    {
      "id": "11217",
      "name": "Muhammad bin Zayd bin 'Abdullah محمد بن زيد بن عبد الله بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11544",
      "name": "Waqid bin Muhammad bin Zayd واقد بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20163",
      "name": "'Asim bin Muhammad bin Zayd عاصم بن محمد بن زيد العمري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22249",
      "name": "Abu Bakr bin Muhammad bin Zayd أبو بكر بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20651",
      "name": "Zayd bin Muhammad bin Zayd زيد بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11217",
      "name": "Muhammad bin Zayd bin 'Abdullah محمد بن زيد بن عبد الله بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11819",
      "name": "Zayd bin 'Abdullah bin 'Umar زيد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20651",
      "name": "Zayd bin Muhammad bin Zayd زيد بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22249",
      "name": "Abu Bakr bin Muhammad bin Zayd أبو بكر بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11420",
      "name": "Hafs bin 'Asim bin 'Umar حفص بن عاصم بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11217",
      "name": "Muhammad bin Zayd bin 'Abdullah محمد بن زيد بن عبد الله بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20163",
      "name": "'Asim bin Muhammad bin Zayd عاصم بن محمد بن زيد العمري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25262",
      "name": "Muhammad bin Rabi'ya al-Klaby محمد بن ربيعة الكلابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1101",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد، أن حفص بن عاصم، حدثه قال سافر ابن عمر  رضى الله عنهما  فقال صحبت النبي صلى الله عليه وسلم فلم أره يسبح في السفر، وقال الله جل ذكره ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated Hafs bin `Asim:                     Ibn `Umar went on a journey and said, \"I accompanied the Prophet and he did not offer optional prayers during the journey, and Allah says: 'Verily! In Allah's Apostle you have a good example to follow.' \" (33.21)",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11420",
        "18"
      ]
    },
    {
      "hadith_no": "1509",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن محمد بن الحسن الأسدي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم يؤتى بالتمر عند صرام النخل فيجيء هذا بتمره وهذا من تمره حتى يصير عنده كوما من تمر، فجعل الحسن والحسين  رضى الله عنهما  يلعبان بذلك التمر، فأخذ أحدهما تمرة، فجعلها في فيه، فنظر إليه رسول الله صلى الله عليه وسلم فأخرجها من فيه فقال ‏\"‏ أما علمت أن آل محمد صلى الله عليه وسلم لا يأكلون الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Dates used to be brought to Allah's Apostle immediately after being plucked. Different persons would bring their dates till a big heap collected (in front of the Prophet). Once Al-Hasan and Al-Husain were playing with these dates. One of them took a date and put it in his mouth. Allah's Apostle looked at him and took it out from his mouth and said, \"Don't you know that Muhammad's offspring do not eat what is given in charity?\"",
      "chain": [
        "11530",
        "11217",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1842",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا أبو بدر، شجاع بن الوليد عن عمر بن محمد العمري، قال وحدث نافع، أن عبد الله، وسالما، كلما عبد الله بن عمر  رضى الله عنهما  فقال خرجنا مع النبي صلى الله عليه وسلم معتمرين، فحال كفار قريش دون البيت، فنحر رسول الله صلى الله عليه وسلم بدنه، وحلق رأسه‏.‏",
      "text_en": " Narrated Nafi`:                     That `Abdullah and Salim said to `Abdullah bin `Umar, \"(You should not go for Hajj this year).\" `Abdullah bin `Umar replied, \"We set out with the Prophet (to Mecca for performing `Umra) and e infidels of Quraish prevented us from reaching the Ka`ba. Allah's Apostle slaughtered his Budn (camels for sacrifice) and got his head shaved.\"",
      "chain": [
        "30272",
        "20328",
        "11530",
        "16"
      ]
    },
    {
      "hadith_no": "2000",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن محمد، عن سالم، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم يوم عاشوراء ‏\"‏ إن شاء صام ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"Whoever wishes may fast on the day of 'Ashura'.\"",
      "chain": [
        "20241",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر، هو ابن محمد أن زيد بن أسلم، حدثه عن أبيه، قال سألني ابن عمر عن بعض، شأنه  يعني عمر  فأخبرته‏.‏ فقال، ما رأيت أحدا قط بعد رسول الله صلى الله عليه وسلم من حين قبض كان أجد وأجود حتى انتهى من عمر بن الخطاب‏.‏",
      "text_en": " Narrated Aslam:                     Ibn `Umar asked me about some matters concerning `Umar. He said, \"Since Allah's Apostle died. I have never seen anybody more serious, hard working and generous than `Umar bin Al-Khattab (till the end of his life.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11163",
        "11416"
      ]
    },
    {
      "hadith_no": "3866",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمر بن محمد بن حسن، حدثنا أبي، حدثنا حفص، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت ما غرت على أحد من نساء النبي صلى الله عليه وسلم ما غرت على خديجة، وما رأيتها، ولكن كان النبي صلى الله عليه وسلم يكثر ذكرها، وربما ذبح الشاة، ثم يقطعها أعضاء، ثم يبعثها في صدائق خديجة، فربما قلت له كأنه لم يكن في الدنيا امرأة إلا خديجة‏.‏ فيقول إنها كانت وكانت، وكان لي منها ولد‏.‏",
      "text_en": " Narrated `Aisha:                     I did not feel jealous of any of the wives of the Prophet as much as I did of Khadija though I did not see her, but the Prophet used to mention her very often, and when ever he slaughtered a sheep, he would cut its parts and send them to the women friends of Khadija. When I sometimes said to him, \"(You treat Khadija in such a way) as if there is no woman on earth except Khadija,\" he would say, \"Khadija was such-and-such, and from her I had children.\"",
      "chain": [
        "11530",
        "11217",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3912",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد، قال فأخبرني جدي، زيد بن عبد الله بن عمر عن أبيه، قال بينما هو في الدار خائفا، إذ جاءه العاص بن وائل السهمي أبو عمرو، عليه حلة حبرة، وقميص مكفوف بحرير، وهو من بني سهم، وهم حلفاؤنا في الجاهلية فقال له ما بالك قال زعم قومك أنهم سيقتلوني إن أسلمت‏.‏ قال لا سبيل إليك‏.‏ بعد أن قالها أمنت، فخرج العاص، فلقي الناس قد سال بهم الوادي فقال أين تريدون فقالوا نريد هذا ابن الخطاب الذي صبا‏.‏ قال لا سبيل إليه‏.‏ فكر الناس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While `Umar was at home in a state of fear, there came Al-`As bin Wail As-Sahmi Abu `Amr, wearing an embroidered cloak and a shirt having silk hems. He was from the tribe of Bani Sahm who were our allies during the pre-Islamic period of ignorance. Al-`As said to `Umar \"What is wrong with you?\" He said, \"Your people claim that they would kill me if I become a Muslim.\" Al-`As said, \"Nobody will harm you after I have given protection to you.\" So Al-`As went out and met the people streaming in the whole valley. He said, \"Where are you going?\" They said, \"We want Ibn Al-Khattab who has embraced Islam.\" Al-`As said, \"There is no way for anybody to touch him.\" So the people retreated.",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11217"
      ]
    },
    {
      "hadith_no": "4236",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال هشام بن عمار حدثنا الوليد بن مسلم، حدثنا عمر بن محمد العمري، أخبرني نافع، عن ابن عمر  رضى الله عنهما  أن الناس، كانوا مع النبي صلى الله عليه وسلم يوم الحديبية، تفرقوا في ظلال الشجر، فإذا الناس محدقون بالنبي صلى الله عليه وسلم فقال يا عبد الله، انظر ما شأن الناس قد أحدقوا برسول الله صلى الله عليه وسلم فوجدهم يبايعون، فبايع ثم رجع إلى عمر فخرج فبايع‏.‏",
      "text_en": "",
      "chain": [
        "30288",
        "20733",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4446",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن سليمان، قال أخبرني ابن وهب، قال حدثني عمر بن محمد، أن أباه، حدثه عن ابن عمر  رضى الله عنهما  قال كنا نتحدث بحجة الوداع والنبي صلى الله عليه وسلم بين أظهرنا، ولا ندري ما حجة الوداع، فحمد الله وأثنى عليه ثم ذكر المسيح الدجال فأطنب في ذكره وقال ‏\"‏ ما بعث الله من نبي إلا أنذر أمته، أنذره نوح والنبيون من بعده، وإنه يخرج فيكم، فما خفي عليكم من شأنه فليس يخفى عليكم أن ربكم ليس على ما يخفى عليكم ثلاثا، إن ربكم ليس بأعور، وإنه أعور عين اليمنى، كأن عينه عنبة طافية ‏\"‏‏.‏   ‏\"‏ ألا إن الله حرم عليكم دماءكم وأموالكم، كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا، ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، ثلاثا، ويلكم، أو ويحكم، انظروا لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We were talking about Hajjat-ul-Wada`, while the Prophet was amongst us. We did not know what Hajjat-ul-Wada` signified. The Prophet praised Allah and then mentioned Al-Masih Ad-Dajjal and described him extensively, saying, \"Allah did not send any prophet but that prophet warned his nation of Al-Masih Ad-Dajjal. Noah and the prophets following him warned (their people) of him. He will appear amongst you (O Muhammad's followers), and if it happens that some of his qualities may be hidden from you, but your Lord's State is clear to you and not hidden from you. The Prophet said it thrice. Verily, your Lord is not blind in one eye, while he (i.e. Ad-Dajjal) is blind in the right eye which looks like a grape bulging out (of its cluster). No doubt,! Allah has made your blood and your properties sacred to one another like the sanctity of this day of yours, in this town of yours, in this month of yours.\" The Prophet added: No doubt! Haven't I conveyed Allah's Message to you? \" They replied, \"Yes,\" The Prophet said thrice, \"O Allah! Be witness for it.\" The Prophet added, \"Woe to you!\" (or said), \"May Allah be merciful to you! Do not become infidels after me (i.e. my death) by cutting the necks (throats) of one another.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "4825",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد بن زيد بن عبد الله بن عمر، أن أباه، حدثه أن عبد الله بن عمر  رضى الله عنهما  قال قال النبي  صلى الله عليه وسلم  ‏\"‏ مفاتيح الغيب خمس ‏\"‏ ثم قرأ ‏{‏إن الله عنده علم الساعة‏}‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The keys of the Unseen are five.\" And then he recited: 'Verily, the knowledge of the Hour is with Allah (alone).' (31.34)",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "5150",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد العسقلاني، عن أبيه، عن ابن عمر، قال ذكروا الشؤم عند النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان الشؤم في شىء ففي الدار والمرأة والفرس ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Evil omen was mentioned before the Prophet: The Prophet said, \"If there is evil omen in anything, it is in the house, the woman and the horse.\"",
      "chain": [
        "30173",
        "20304",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "5953",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد بن زيد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ خالفوا المشركين، وفروا اللحى، وأحفوا الشوارب ‏\"‏‏.‏ وكان ابن عمر إذا حج أو اعتمر قبض على لحيته، فما فضل أخذه‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, The Prophet said, 'Do the opposite of what the pagans do. Keep the beards and cut the moustaches short.' Whenever Ibn `Umar performed the Hajj or `Umra, he used to hold his beard with his hand and cut whatever moustaches. Ibn `Umar used to cut his moustache so short that the whiteness of his skin (above the upper lip) was visible, and he used to cut (the hair) between his moustaches and his beard.",
      "chain": [
        "30173",
        "20304",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6026",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر  هو ابن محمد  عن سالم، عن أبيه، قال وعد النبي صلى الله عليه وسلم جبريل فراث عليه حتى اشتد على النبي صلى الله عليه وسلم فخرج النبي صلى الله عليه وسلم فلقيه، فشكا إليه ما وجد، فقال له ‏\"‏ إنا لا ندخل بيتا فيه صورة ولا كلب ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     Once Gabriel promised to visit the Prophet but he delayed and the Prophet got worried about that. At last he came out and found Gabriel and complained to him of his grief (for his delay). Gabriel said to him, \"We do not enter a place in which there is a picture or a dog.\"",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6083",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا عمر بن محمد، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ‏\"‏‏.‏",
      "text_en": " Narrates Ibn `Umar:                     Allah' Apostle said, Gabriel kept on recommending me about treating the neighbors in a kind and polite manner, so much so that I thought that he would order (me) to make them (my) heirs.\"",
      "chain": [
        "30173",
        "20304",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "6628",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا عمر بن محمد بن زيد، عن أبيه، أنه حدثه عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صار أهل الجنة إلى الجنة، وأهل النار إلى النار، جيء بالموت حتى يجعل بين الجنة والنار، ثم يذبح، ثم ينادي مناد يا أهل الجنة لا موت، يا أهل النار لا موت، فيزداد أهل الجنة فرحا إلى فرحهم‏.‏ ويزداد أهل النار حزنا إلى حزنهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"When the people of Paradise have entered Paradise and the people of the Fire have entered the Fire, death will be brought and will be placed between the Fire and Paradise, and then it will be slaughtered, and a call will be made (that), 'O people of Paradise, no more death ! O people of the Fire, no more death ! ' So the people of Paradise will have happiness added to their previous happiness, and the people of the Fire will have sorrow added to their previous sorrow.\"",
      "chain": [
        "30176",
        "20025",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، قال حدثني عمر بن محمد، أن أباه، حدثه عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث شعبة عن واقد ‏.‏",
      "text_en": " Harmala b. Yahya, Abdullah b. Wahb, Umar b. Muhammad, Ibn Umar narrated like the hadith reported by Shu'ba on the authority of Waqid.",
      "chain": [
        "30487",
        "20029",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "259",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سهل بن عثمان، حدثنا يزيد بن زريع، عن عمر بن محمد، حدثنا نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خالفوا المشركين أحفوا الشوارب وأوفوا اللحى ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar said:                      The Messenger of Allah (may peace be opon him) said: Act against the polytheists, trim closely the moustache and grow beard.",
      "chain": [
        "30546",
        "20304",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يزيد، - يعني ابن زريع - عن عمر بن محمد، عن حفص بن عاصم، قال مرضت مرضا فجاء ابن عمر يعودني قال وسألته عن السبحة، في السفر فقال صحبت رسول الله صلى الله عليه وسلم في السفر فما رأيته يسبح ولو كنت مسبحا لأتممت وقد قال الله تعالى ‏{‏ لقد كان لكم في رسول الله إسوة حسنة‏}‏",
      "text_en": " Hafs b. 'Asim reported:                      I fell ill and lbn 'Umar came to inquire after my health, and I asked him about the glorification of Allah (i. e. prayer) while travelling. Thereupon he said: I accompanied the Messenger of Allah (may peace be upon him) on a journey but I did not see him glorifying Him, and were I to glorify (Him). I would have completed the prayer. Allah, the Exalted, has said:\" Verily there is a model pattern for you in the Messenger of Allah.\"",
      "chain": [
        "30367",
        "20304",
        "11530",
        "11420"
      ]
    },
    {
      "hadith_no": "2195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، حدثني عمر بن محمد، أنحدثه عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت يعذب ببكاء الحى ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) said:                      The dead is punished because of the lamentation of the living.",
      "chain": [
        "30487",
        "20029",
        "11530",
        "18"
      ]
    },
    {
      "hadith_no": "2703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا عمر بن محمد بن، زيد العسقلاني حدثنا سالم بن عبد الله، حدثني عبد الله بن عمر، - رضى الله عنهما - قال ذكر عند رسول الله صلى الله عليه وسلم يوم عاشوراء فقال ‏\"‏ ذاك يوم كان يصومه أهل الجاهلية فمن شاء صامه ومن شاء تركه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar (Allah be pleased with them) reported that the day of 'Ashura was mentioned before the Messenger of Allah (may peace be upon him) and he said:                      It is a day when the people in the pre-Islamic days need to observe fast, so he who wishes to observe fast should do so, and he who wishes to abandon it should do so.",
      "chain": [
        "30185",
        "20241",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، حدثني عمر بن محمد، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعيتم إلى كراع فأجيبوا ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) having said:                      When you are invited to a feast (even though it is) the leg of the sheep, you should accept it.",
      "chain": [
        "30487",
        "20029",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3921",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، حدثني عمر بن محمد، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اشترى طعاما فلا يبعه حتى يستوفيه ويقبضه ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who bought foodgrain should not sell it until he had taken full possession of it (after measuring it).",
      "chain": [
        "30487",
        "20029",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا عبد الله بن وهب، حدثني عمر بن محمد، أنحدثه عن سعيد بن زيد بن عمرو بن نفيل، أن أروى، خاصمته في بعض داره فقال دعوها وإياها فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أخذ شبرا من الأرض بغير حقه طوقه في سبع أرضين يوم القيامة ‏\"‏ ‏.‏ اللهم إن كانت كاذبة فأعم بصرها واجعل قبرها في دارها ‏.‏ قال فرأيتها عمياء تلتمس الجدر تقول أصابتني دعوة سعيد بن زيد ‏.‏ فبينما هي تمشي في الدار مرت على بئر في الدار فوقعت فيها فكانت قبرها‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported that Arwi (bint Uwais) disputed with him (in regard to a part of the land) of his hodse. He said:                      Leave it and take off your claim from it, for I heard Allah's Messenger (may peace be upon him) as saying: He who took a span of land without his right would be made to wear around his neck seven earths on the Day of Resurrection. He (Sa'id b. Zaid) said: O Allah, make her blind if she has told a lie and make her grave in her house. He (the narrator) said: I saw her blind groping (her way) by touching the walls and saying: The curse of Sa'id b. Zaid has hit me. And it so happened that as she was walking in her house, she passed by a well in her house and fell therein and that be- came her grave.",
      "chain": [
        "30487",
        "20029",
        "11530",
        "11"
      ]
    },
    {
      "hadith_no": "5386",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني أبو الطاهر، وحرملة، - قال أبو الطاهر أخبرنا وقال، حرملة حدثنا  - عبد الله بن وهب، حدثني عمر بن محمد، حدثني القاسم بن عبيد الله بن عبد الله بن، عمر حدثه عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يأكلن أحد منكم بشماله ولا يشربن بها فإن الشيطان يأكل بشماله ويشرب بها ‏\"‏ ‏.‏ قال وكان نافع يزيد فيها ‏\"‏ ولا يأخذ بها ولا يعطي بها ‏\"‏ ‏.‏ وفي رواية أبي الطاهر ‏\"‏ لا يأكلن أحدكم ‏\"‏ ‏.‏",
      "text_en": " Salim, on the authority of his father, reported Allah's Messenger (may peace be upon him) as saying:                      None of you should eat with his left hand and drink with that (left hand), for the Satan eats with left hand and drinks with that (hand). Nafi' has made this addition in that:\" Do not take up anything with that (left hand) and do not give anything with that\" ; and in the narration transmitted on the authority of Abu Tahir there is a slight variation of wording.",
      "chain": [
        "30487",
        "30487",
        "20029",
        "11530",
        "10609",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5576",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، أخبرني عمر بن محمد، عن أبيه،وسالم بن عبد الله ونافع عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال‏\"‏ إن الذي يجر ثيابه من الخيلاء لا ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) having said:                      He who trails his (lower) garment out of pride, Allah will not look toward him on the Day of Resurrection.",
      "chain": [
        "20029",
        "11530",
        "18"
      ]
    },
    {
      "hadith_no": "5583",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني أبو الطاهر، حدثنا ابن وهب، أخبرني عمر بن محمد، عن عبد الله بن،واقد عن ابن عمر، قال مررت على رسول الله صلى الله عليه وسلم وفي إزاري استرخاءفقال ‏\"‏ يا عبد الله ارفع إزارك ‏\"‏ ‏.‏ فرفعته ثم قال ‏\"‏ زد ‏\"‏ ‏.‏ فزدت فما زلت أتحراهابعد ‏.‏ فقال بعض القوم إلى أين فقال أنصاف الساقين ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I happened to pass before Allah's Messenger (may peace be upon bin) with my lower garment trailing (upon the ground). He said: 'Abdullah, tug up your lower garment,, I tugged it up, and he again said: Tug it still further, and I tugged it still further and I went on tugging it afterward, whereupon some of the people said: To what extent? Thereupon he said: To the middle of the shanks.",
      "chain": [
        "20029",
        "11530",
        "18"
      ]
    },
    {
      "hadith_no": "5884",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن عبد الله بن الحكم، حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثني  هارون بن عبد الله، - واللفظ له - حدثنا روح، حدثنا شعبة، عن عمر بن محمد بن زيد، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الحمى من فيح جهنم فأطفئوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      Fever is from the vehement Paging of the Hell-fire, so cool it with water.",
      "chain": [
        "20173",
        "20020",
        "20229",
        "20020",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "5943",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أحمد بن عبد الله بن الحكم، حدثنا محمد بن جعفر، حدثنا شعبة، عن  عمر بن محمد بن زيد، أنه سمع أباه، يحدث عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن يكن من الشؤم شىء حق ففي الفرس والمرأة والدار ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. Muhammad b. Zaid reported that he heard his father narrating from Ibn 'Umar that Allah's Messenger (may peace be upon him) had said. If bad luck is a fact, then it is in the horse, the woman and the house.",
      "chain": [
        "20173",
        "20020",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "6128",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني حرملة بن يحيى، حدثنا عبد الله بن وهب، حدثني عمر بن محمد، عن  نافع، عن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أمامكم حوضا كما بين جربا وأذرح فيه أباريق كنجوم السماء من ورده فشرب منه لم يظمأ بعدها أبدا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      There would be before you a Cistern (as extensive) as there is the distance between Jarba' and Adhruh and there would be jugs like stars in the sky; he who would come to that and drink from it would never feel thirsty after that.",
      "chain": [
        "30487",
        "20029",
        "11530",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6854",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا يزيد بن زريع، عن عمر بن محمد، عن أبيه، قال سمعت ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      Gabriel impressed upon me (the kind treatment) towards the neighbour (so much) that I thought as if he would soon confer upon him the (right) of inheritance.",
      "chain": [
        "30024",
        "20304",
        "11530",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "4692",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمر بن محمد، عن عمر، مولى غفرة عن رجل، من الأنصار عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل أمة مجوس ومجوس هذه الأمة الذين يقولون لا قدر من مات منهم فلا تشهدوا جنازته ومن مرض منهم فلا تعودوهم وهم شيعة الدجال وحق على الله أن يلحقهم بالدجال ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah reported the Messenger of Allah (May peace be upon him) as saying :                      Every people have Magians, and the Magians of this community are those who declare that there is no destination by Allah. If any one of them dies, do not attend his funeral, and if any one of them is ill, do not pay a sick visit to him. They are the partisans of the Antichrist (Dajjal), and Allah will surely join with the Antichrist.",
      "chain": [
        "28531",
        "20012",
        "11530",
        "12391",
        "145"
      ]
    },
    {
      "hadith_no": "2274",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمر بن محمد بن الحسن بن التل، قال حدثنا أبي قال، حدثنا سفيان الثوري، عن أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله وضع عن المسافر نصف الصلاة والصوم وعن الحبلى والمرضع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Prophet said:                     \"Allah has waived meaning half of the prayer and fasting for the traveler, and from pregnant women and the sick. \"(Hanas)",
      "chain": [
        "11530",
        "11217",
        "20012",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "2562",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يزيد بن زريع، قال حدثنا عمر بن محمد، عن عبد الله بن يسار، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا ينظر الله عز وجل إليهم يوم القيامة العاق لوالديه والمرأة المترجلة والديوث وثلاثة لا يدخلون الجنة العاق لوالديه والمدمن على الخمر والمنان بما أعطى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim bin 'Abdullah that his father said:                     \"The Messenger of Allah said: \"There are three at whom Allah will not look on the Day of Resurrection: The one who disobeys his parents, the woman who imitates men in her outward appearance, and the cuckold. And there are three who will not enter Paradise: The one who disobeys his parents, the drunkard, and the one who reminds people of what he has given them.\"'",
      "chain": [
        "30153",
        "20304",
        "11530",
        "15313",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2346",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو إسحاق الشافعي، إبراهيم بن محمد بن العباس حدثني أبي، عن أبيه العباس بن عثمان بن شافع، عن عمر بن محمد بن علي بن أبي طالب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الدينار بالدينار والدرهم بالدرهم لا فضل بينهما فمن كانت له حاجة بورق فليصطرفها بذهب ومن كانت له حاجة بذهب فليصطرفها بالورق والصرف هاء وهاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umar bin Muhammad bin 'Ali bin abi Talib, from his father, that his grandfather said:                     'The Messenger of Allah (ﷺ) said: 'Dinar for Dinar, Dirham for Dirham, with no increase between them. Whoever has need of silver, let him trade gold for it, and whoever has need of gold, let him trade silver for it, and let the transaction be done on the spot.\"'",
      "chain": [
        "11530",
        "11217"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، أخبرني عمر بن محمد، عن أبيه، عن ابن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ويحكم - أو ويلكم - لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                      “Woe to you! Do not turn back into disbelievers after I amgone,striking one another’s necks.”",
      "chain": [
        "30285",
        "20733",
        "11530",
        "11217",
        "18"
      ]
    }
  ],
  "total_hadiths": 35
}