{
  "id": "11541",
  "name": "Mua'wiya bin Abi Mazrad معاوية بن أبي مزرد",
  "full_name": "Mua'wiya bin Abi Mazrad معاوية بن أبي مزرد",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  س  -  ليس به بأس ]"
    ],
    "tags": [
      "Client",
      "B.Hashim",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11233",
      "name": "Yazid bin Ruman يزيد بن رومان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11868",
      "name": "'Abdullah bin 'Abdullah bin Abi Talha عبد الله بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11851",
      "name": "Ziyad bin Abi Ziyad زياد بن أبي زياد ميسرة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1464",
      "hadith_no": "1464",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن معاوية بن أبي مزرد، عن أبي الحباب، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا، ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Every day two angels come down from Heaven and one of them says, 'O Allah! Compensate every person who spends in Your Cause,' and the other (angel) says, 'O Allah! Destroy every miser.' \"",
      "usc_msa_ref": "522",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11541",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4879",
      "hadith_no": "4879",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خلق الله الخلق، فلما فرغ منه قامت الرحم فأخذت بحقو الرحمن فقال لها مه‏.‏ قالت هذا مقام العائذ بك من القطيعة‏.‏ قال ألا ترضين أن أصل من وصلك وأقطع من قطعك‏.‏ قالت بلى يا رب‏.‏ قال فذاك لك ‏\"‏‏.‏ قال أبو هريرة اقرءوا إن شئتم ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created His creation, and when He had finished it, the womb, got up and caught hold of Allah whereupon Allah said, \"What is the matter?' On that, it said, 'I seek refuge with you from those who sever the ties of Kith and kin.' On that Allah said, 'Will you be satisfied if I bestow My favors on him who keeps your ties, and withhold My favors from him who severs your ties?' On that it said, 'Yes, O my Lord!' Then Allah said, 'That is for you.' \" Abu Huraira added: If you wish, you can recite: \"Would you then if you were given the authority. do mischief in the land and sever your ties of kinship. (47. 22)",
      "usc_msa_ref": "354",
      "chain": [
        "30463",
        "20160",
        "11541",
        "11170",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6053",
      "hadith_no": "6053",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني بشر بن محمد، أخبرنا عبد الله، أخبرنا معاوية بن أبي مزرد، قال سمعت عمي، سعيد بن يسار يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله خلق الخلق حتى إذا فرغ من خلقه، قالت الرحم هذا مقام العائذ بك من القطيعة‏.‏ قال نعم أما ترضين أن أصل من وصلك‏.‏ وأقطع من قطعك‏.‏ قالت بلى يا رب‏.‏ قال فهو لك ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فاقرءوا إن شئتم ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created the creations, and when He finished from His creations, Ar-Rahm i.e., womb said, \"(O Allah) at this place I seek refuge with You from all those who sever me (i.e. sever the ties of Kith and kin). Allah said, 'Yes, won't you be pleased that I will keep good relations with the one who will keep good relations with you, and I will sever the relation with the one who will sever the relations with you.' It said, 'Yes, O my Lord.' Allah said, 'Then that is for you ' \" Allah's Apostle added. \"Read (in the Qur'an) if you wish, the Statement of Allah: 'Would you then, if you were given the authority, do mischief in the land and sever your ties of kinship?' (47.22)",
      "usc_msa_ref": "16",
      "chain": [
        "30318",
        "20025",
        "11541",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6055",
      "hadith_no": "6055",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا سليمان بن بلال، قال أخبرني معاوية بن أبي مزرد، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ الرحم شجنة، فمن وصلها وصلته، ومن قطعها قطعته ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) The Prophet said, \"The word 'Ar-Rahm' (womb) derives its name from 'Ar- Rahman' (i.e. Allah). So whosoever keeps good relations with it (womb i.e. Kith and kin), Allah will keep good relations with him, and whosoever will sever it (i.e. severs his bonds of Kith and kin) Allah too will sever His relations with him.",
      "usc_msa_ref": "",
      "chain": [
        "30232",
        "20160",
        "11541",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-7594",
      "hadith_no": "7594",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسماعيل بن عبد الله، حدثني سليمان بن بلال، عن معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خلق الله الخلق فلما فرغ منه قامت الرحم فقال مه‏.‏ قالت هذا مقام العائذ بك من القطيعة‏.‏ فقال ألا ترضين أن أصل من وصلك، وأقطع من قطعك قالت بلى يا رب‏.‏ قال فذلك لك ‏\"‏‏.‏ ثم قال أبو هريرة ‏{‏فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم‏}‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah created the creation, and when He finished from His creation the Rahm (womb) got up, and Allah said (to it). \"Stop! What do you want? It said; \"At this place I seek refuge with You from all those who sever me (i.e. sever the ties of Kinship.)\" Allah said: \"Would you be pleased that I will keep good relation with the one who will keep good relation with you, and I will sever the relation with the one who will sever the relation with you. It said: 'Yes, 'O my Lord.' Allah said (to it), 'That is for you.'' And then Abu Huraira recited the Verse:-- \"Would you then if you were given the authority, do mischief in the land, and sever your ties of kinship.\" (47.22)",
      "usc_msa_ref": "593",
      "chain": [
        "30103",
        "20160",
        "11541",
        "11170",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2383",
      "hadith_no": "2383",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني القاسم بن زكريا، حدثنا خالد بن مخلد، حدثني سليمان، - وهو ابن بلال - حدثني معاوية بن أبي مزرد، عن سعيد بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا ‏.‏ ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There is never a day wherein servants (of God) get up at morn, but are not visited by two angels. One of them says: 0 Allah, give him more who spends (for the sake of Allah), and the other says: 0 Allah, bring destruction to one who withholds.",
      "usc_msa_ref": "",
      "chain": [
        "36617",
        "30463",
        "20160",
        "11541",
        "11170",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6683",
      "hadith_no": "6683",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لأبي بكر - قالا حدثنا  وكيع، عن معاوية بن أبي مزرد، عن يزيد بن رومان، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ الرحم معلقة بالعرش تقول من وصلني وصله الله ومن قطعني قطعه الله ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      The tie of kinship is suspended to the Throne and says: He who unites me Allah would unite him and he who severed me Allah would sever him.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20032",
        "11541",
        "11233",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 7
}