{
  "id": "11542",
  "name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
  "full_name": "al-Nu'man bin Abi 'Ayyash النعمان بن أبي عياش",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Zurayq",
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1261",
      "name": "Khawla bint Qays bin Qahd ( خولة بنت قيس بن قهد بن قيس بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11105",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10929",
      "name": "'Abdullah bin Abi Salma عبد الله بن أبي سلمة الماجشون",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2840",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني يحيى بن سعيد، وسهيل بن أبي صالح، أنهما سمعا النعمان بن أبي عياش، عن أبي سعيد  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من صام يوما في سبيل الله بعد الله وجهه عن النار سبعين خريفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I heard the Prophet saying, \"Indeed, anyone who fasts for one day for Allah's Pleasure, Allah will keep his face away from the (Hell) fire for (a distance covered by a journey of) seventy years.\"",
      "chain": [
        "30311",
        "20121",
        "11070",
        "11062",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل الجنة منزلة رجل صرف الله وجهه عن النار قبل الجنة ومثل له شجرة ذات ظل فقال أى رب قدمني إلى هذه الشجرة أكون في ظلها ‏\"‏ ‏.‏ وساق الحديث بنحو حديث ابن مسعود ولم يذكر ‏\"‏ فيقول يا ابن آدم ما يصريني منك ‏\"‏ ‏.‏ إلى آخر الحديث وزاد فيه ‏\"‏ ويذكره الله سل كذا وكذا فإذا انقطعت به الأماني قال الله هو لك وعشرة أمثاله - قال - ثم يدخل بيته فتدخل عليه زوجتاه من الحور العين فتقولان الحمد لله الذي أحياك لنا وأحيانا لك - قال - فيقول ما أعطي أحد مثل ما أعطيت ‏\"‏ ‏.‏",
      "text_en": " It is transmitted from Abu Sa'id al-Khudri that, verily, the Messenger of Allah (may peace be upon him) said:                      Amongst the inhabitants of Paradise the lowest in rank will be the person whose face Allah would turn away from the Fire towards the Paradise, and make a shady tree appear before him. He would say: O my Lord! direct my steps to this tree so that I (should enjoy) its shade; and the rest of the hadith is like that narrated by Ibn Mas'ud, but he did not mention:\" He (Allah) would say: O son of Adam! what will bring an end to your making requests to Me\" to the end of the tradition. In it, he added: Allah will remind him: Ask such and such, and when his expectations would be realised, Allah would say: That is for you, and ten times as much. He said that he would then enter his house and his two wives with large and dark eyes would enter after him. They will say: Praise be to Allah, Who has created you for us and us for you. He will say: No one has been given the like of what I have been given.",
      "chain": [
        "30201",
        "20365",
        "20394",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل النار عذابا ينتعل بنعلين من نار يغلي دماغه من حرارة نعليه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      Verily, the Messenger of Allah (may peace be upon him) said: The least tormented of the inhabitants of the Fire would be he who would wear two shoes of Fire and his brain would boil on account of the heat of the shoes.",
      "chain": [
        "30201",
        "20365",
        "20394",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2767",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن رمح بن المهاجر، أخبرني الليث، عن ابن الهاد، عن سهيل بن، أبي صالح عن النعمان بن أبي عياش، عن أبي سعيد الخدري، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يصوم يوما في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Every servant of Allah who observes fast for a day in the way of Allah, Allah would remove, because of this day, his face farther from the Fire (of Hell) to the extent of seventy years' distance.",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2769",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني إسحاق بن منصور، وعبد الرحمن بن بشر العبدي، قالا حدثنا عبد الرزاق، أخبرنا ابن جريج، عن يحيى بن سعيد، وسهيل بن أبي صالح، أنهما سمعا النعمان بن، أبي عياش الزرقي يحدث عن أبي سعيد الخدري، - رضى الله عنه - قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صام يوما في سبيل الله باعد الله وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who observes fast for a day in the way of Allah He would remove his face from the Hell to the extent of seventy years' distance.",
      "chain": [
        "30313",
        "30356",
        "20121",
        "11070",
        "11062",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "4009",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - أن بكيرا، حدثه أن عبد الله بن أبي سلمة حدثه عن النعمان بن أبي عياش، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏  قال بكير وحدثني نافع، أنه سمع ابن عمر، يقول كنا نكري أرضنا ثم تركنا ذلك حين سمعنا حديث رافع بن خديج ‏.‏",
      "text_en": " Jabir b. `Abdullah (Allah be pleased with them) reportedthat Allah's Messenger (may peace be upon him) had forbidden renting of land. Bukair (one of the narrators) said:                      Nafi` reported to me that he heard Ibn `Umar (Allah be pleased with them) saying: We usedto give land on rent; we then abandoned this practice when we heard the hadith of Rafi` b. Khadij.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "10929",
        "11542",
        "34"
      ]
    },
    {
      "hadith_no": "1623",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، حدثنا عبد الله بن الوليد العدني، حدثنا سفيان الثوري، قال وحدثنا محمود بن غيلان، حدثنا عبيد الله بن موسى، عن سفيان، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش الزرقي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصوم عبد يوما في سبيل الله إلا باعد ذلك اليوم النار عن وجهه سبعين خريفا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     That the Prophet (ﷺ) said: \"A worshipper does not fast a day in the cause of Allah except that, that day (of fasting) distances the Fire from his face by seventy autumns.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "38231",
        "33014",
        "20012",
        "30277",
        "20340",
        "20012",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2249",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الحسن بن قزعة، عن حميد بن الأسود، قال حدثنا سهيل، عن النعمان بن أبي عياش، قال سمعت أبا سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام يوما في سبيل الله عز وجل باعده الله عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Numan bin Abi 'Ayyash said:                     \"I heard Abu Saeed Al-Khudri say: 'The Messenger of Allah said: Whoever fasts one day in the cause of Allah will separate his face from the fire by (a distance of) seventy autumns.\"'",
      "chain": [
        "34055",
        "20225",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2250",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا مؤمل بن إهاب، قال حدثنا عبد الرزاق، قال أنبأنا ابن جريج، قال أخبرني يحيى بن سعيد، وسهيل بن أبي صالح، سمعا النعمان بن أبي عياش، قال سمعت أبا سعيد الخدري، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صام يوما في سبيل الله تبارك وتعالى باعد الله وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " Abu Saeed Al-Khudi said:                     \"I heard the Messenger of Allah say: 'Whoever fasts one day in the cause of Allah, Allah will separate his face from the Fire by (a distance of) seventy autumns.\"'",
      "chain": [
        "35156",
        "20121",
        "11070",
        "11062",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2251",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الله بن منير، - نيسابوري - قال حدثنا يزيد العدني، قال حدثنا سفيان، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصوم عبد يوما في سبيل الله إلا باعد الله تعالى بذلك اليوم النار عن وجهه سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-khudi said:                     \"The Messenger of Allah: 'There is no worshipper who fasts a day in the cause of Allah, but Allah, the most high, will separate (a distance of) seventy autumns between his face and the fire in return for that day.\"'",
      "chain": [
        "20012",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، عن سفيان، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله باعد الله بذلك اليوم حر جهنم عن وجهه سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed Al-Khudri that the Prophet said:                     \"Whoever fasts a day in the cause of Allah, Allah will separate his face from the heat of Hell (a distance of) seventy autumns.\"",
      "chain": [
        "38011",
        "20005",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "2253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الله بن أحمد بن محمد بن حنبل، قال قرأت على أبي حدثكم ابن نمير، قال حدثنا سفيان، عن سمى، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام يوما في سبيل الله باعد الله بذلك اليوم النار عن وجهه سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                     \"The Messenger of Allah said: Whoever fasts a day in the cause of Allah, Allah will separate his face (a distance of) seventy autumns from the fire in return for that day.\"",
      "chain": [
        "30212",
        "20005",
        "11428",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "1788",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أنبأنا الليث بن سعد، عن ابن الهاد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صام يوما في سبيل الله باعد الله بذلك اليوم النار عن وجهه سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “Whoever fasts one day in the cause of Allah, Allahwillkeep the Fire away from his face the distance of seventy autumns(years) for that day.”",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11173",
        "11542",
        "38"
      ]
    }
  ],
  "total_hadiths": 13
}