{
  "id": "11543",
  "name": "al-Hythm bin Abi Snan الهيثم بن أبي سنان المدني",
  "full_name": "al-Hythm bin Abi Snan الهيثم بن أبي سنان المدني",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1155",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن يونس، عن ابن شهاب، أخبرني الهيثم بن أبي سنان، أنه سمع أبا هريرة  رضى الله عنه  وهو يقصص في قصصه وهو يذكر رسول الله صلى الله عليه وسلم إن أخا لكم لا يقول الرفث‏.‏ يعني بذلك عبد الله بن رواحة وفينا رسول الله يتلو كتابه إذا انشق معروف من الفجر ساطع أرانا الهدى بعد العمى فقلوبنا به موقنات أن ما قال واقع يبيت يجافي جنبه عن فراشه إذا استثقلت بالمشركين المضاجع تابعه عقيل‏.‏ وقال الزبيدي أخبرني الزهري عن سعيد والأعرج عن أبي هريرة  رضى الله عنه‏.‏",
      "text_en": " Narrated Abu Huraira:                     That once Allah's Apostle (p.b.u.h) said, \"Your brother, i.e. `Abdullah bin Rawaha does not say obscene (referring to his verses): Amongst us is Allah's Apostle, who recites His Book when it dawns. He showed us the guidance, after we were blind. We believe that whatever he says will come true. And he spends his nights in such a way as his sides do not touch his bed. While the pagans were deeply asleep.\"",
      "chain": [
        "30399",
        "20023",
        "20475",
        "11013",
        "11543",
        "13"
      ]
    },
    {
      "hadith_no": "6221",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أصبغ، قال أخبرني عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، أن الهيثم بن أبي سنان، أخبره أنه، سمع أبا هريرة، في قصصه يذكر النبي صلى الله عليه وسلم يقول ‏\"‏ إن أخا لكم لا يقول الرفث ‏\"‏‏.‏ يعني بذاك ابن رواحة قال فينا رسول الله يتلو كتابه إذا انشق معروف من الفجر ساطع أرانا الهدى بعد العمى فقلوبنا به موقنات أن ما قال واقع يبيت يجافي جنبه عن فراشه إذا استثقلت بالكافرين المضاجع تابعه عقيل عن الزهري‏.‏ وقال الزبيدي عن الزهري عن سعيد والأعرج عن أبي هريرة‏.‏",
      "text_en": " Narrated Al-Haitham bin Abu Sinan:                     that he heard Abu Huraira in his narration, mentioning that the Prophet said, \"A Muslim brother of yours who does not say dirty words.\" and by that he meant Ibn Rawaha, \"said (in verse): 'We have Allah's Apostle with us who recites the Holy Qur'an in the early morning time. He gave us guidance and light while we were blind and astray, so our hearts are sure that whatever he says, will certainly happen. He does not touch his bed at night, being busy in worshipping Allah while the pagans are sound asleep in their beds.' \"",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11543"
      ]
    }
  ],
  "total_hadiths": 2
}