{
  "id": "11559",
  "name": "Shabl bin 'Aabad al-Makki شبل بن عباد المكي",
  "full_name": "Shabl bin 'Aabad al-Makki شبل بن عباد المكي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "148",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  فق  -  ثقة ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Makki"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  د  س  فق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  د  س  فق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  د  س  فق  -  ثقة ]"
      },
      {
        "en": "Recitation/Quran",
        "ar": "تلاوة القرآن",
        "ckb": "خوێندنەوە/قورئان"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Makki",
        "ar": "al-Makki",
        "ckb": "al-Makki"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11252",
      "name": "'Abdullah bin Kathir al-Dari عبد الله بن كثير الداري",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11697",
      "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10689",
      "name": "Suwayd bin Hjyr سويد بن حجير",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11254",
      "name": "'Abdullah bin Abi Najih عبد الله بن أبي نجيح",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "23512",
      "name": "'Umar bin Abi Sulaiman عمر بن أبي سليمان حجازي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20290",
      "name": "Abu Hudhayfa al-Nahdi موسى بن مسعود أبو حذيفة النهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1848",
      "hadith_no": "1848",
      "source": "Sahih Bukhari",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه وأنه يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره أن يحلق وهو بالحديبية، ولم يتبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     (Reporting the speech of Ka`b bin Umra) Allah's Apostle saw him (i.e. Ka`b) while the lice were falling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, he ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not permitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of Al-Fidya. Allah's Apostle ordered him to feed six poor persons with one Faraq of food or to slaughter one sheep (as a sacrifice) or to fast for three days.",
      "usc_msa_ref": "44",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254",
        "11028",
        "11196",
        "4052"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4573",
      "hadith_no": "4573",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال كانت هذه العدة تعتد عند أهل زوجها واجب، فأنزل الله ‏{‏والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج فإن خرجن فلا جناح عليكم فيما فعلن في أنفسهن من معروف‏}‏ قال جعل الله لها تمام السنة سبعة أشهر وعشرين ليلة وصية، إن شاءت سكنت في وصيتها، وإن شاءت خرجت، وهو قول الله تعالى ‏{‏غير إخراج فإن خرجن فلا جناح عليكم‏}‏ فالعدة كما هي واجب عليها‏.‏ زعم ذلك عن مجاهد‏.‏ وقال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهلها، فتعتد حيث شاءت، وهو قول الله تعالى ‏{‏غير إخراج‏}‏‏.‏ قال عطاء إن شاءت اعتدت عند أهله وسكنت في وصيتها، وإن شاءت خرجت لقول الله تعالى ‏{‏فلا جناح عليكم فيما فعلن‏}‏‏.‏ قال عطاء ثم جاء الميراث فنسخ السكنى فتعتد حيث شاءت، ولا سكنى لها‏.‏ وعن محمد بن يوسف حدثنا ورقاء عن ابن أبي نجيح عن مجاهد بهذا‏.‏ وعن ابن أبي نجيح عن عطاء عن ابن عباس قال نسخت هذه الآية عدتها في أهلها، فتعتد حيث شاءت لقول الله ‏{‏غير إخراج‏}‏ نحوه‏.‏",
      "text_en": " Narrated Mujahi:                     (regarding the Verse):-- \"Those of you who die and leave wives behind. They - (their wives) -- shall wait (as regards their marriage ) for four months and ten days).\" (2.234) The widow, according to this Verse, was to spend this period of waiting with her husband's family, so Allah revealed: \"Those of you who die and leave wives (i.e. widows) should bequeath for their wives, a year's maintenance and residences without turning them out, but if they leave (their residence), there is no blame on you for what they do with themselves provided it is honorable.' (i.e. lawful marriage) (2.240). So Allah entitled the widow to be bequeathed extra maintenance for seven months and twenty nights, and that is the completion of one year. If she wished she could stay (in her husband's home) according to the will, and she could leave it if she wished, as Allah says: \"..without turning them out, but if they leave (the residence), there is no blame on you.\" So the 'Idda (i.e. four months and ten days as it) is obligatory for her. 'Ata said: Ibn `Abbas said, \"This Verse, i.e. the Statement of Allah: \"..without turning them out..\" cancelled the obligation of staying for the waiting period in her dead husband's house, and she can complete this period wherever she likes.\" 'Ata's aid: If she wished, she could complete her 'Idda by staying in her dead husband's residence according to the will or leave it according to Allah's Statement:-- \"There is no blame on you for what they do with themselves.\" `Ata' added: Later the regulations of inheritance came and abrogated the order of the dwelling of the widow (in her dead husband's house), so she could complete the 'Idda wherever she likes. And it was no longer necessary to provide her with a residence. Ibn `Abbas said, \"This Verse abrogated her (i.e. widow's) dwelling in her dead husband's house and she could complete the 'Idda (i.e. four months and ten days) wherever she liked, as Allah's Statement says:--\"...without turning them out...\"",
      "usc_msa_ref": "",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5398",
      "hadith_no": "5398",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا روح بن عبادة، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، ‏{‏والذين يتوفون منكم ويذرون أزواجا‏}‏ قال كانت هذه العدة تعتد عند أهل زوجها واجبا، فأنزل الله ‏{‏والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج فإن خرجن فلا جناح عليكم فيما فعلن في أنفسهن من معروف‏}‏ قال جعل الله لها تمام السنة سبعة أشهر وعشرين ليلة وصية إن شاءت سكنت في وصيتها، وإن شاءت خرجت، وهو قول الله تعالى ‏{‏غير إخراج فإن خرجن فلا جناح عليكم‏}‏ فالعدة كما هي، واجب عليها، زعم ذلك عن مجاهد‏.‏ وقال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهلها، فتعتد حيث شاءت، وقول الله تعالى ‏{‏غير إخراج‏}‏‏.‏ وقال عطاء إن شاءت اعتدت عند أهلها، وسكنت في وصيتها، وإن شاءت خرجت لقول الله ‏{‏فلا جناح عليكم فيما فعلن‏}‏‏.‏ قال عطاء ثم جاء الميراث فنسخ السكنى، فتعتد حيث شاءت، ولا سكنى لها‏.‏",
      "text_en": " Narrated Mujahid:                     (regarding the Verse): 'If any of you dies and leaves wives behind,' That was the period of the 'Iddah which the widow was obliged to spend in the house of the late husband. Then Allah revealed: And those of you who die and leave wives should bequeath for their wives a year's maintenance and residence without turning them out, but if they leave, there is no blame on you for what they do of themselves, provided it is honorable (i.e. lawful marriage) (2.240) Mujahid said: Allah has ordered that a widow has the right to stay for seven months and twenty days with her husband's relatives through her husband's will and testament so that she will complete the period of one year (of 'Iddah). But the widow has the right to stay that extra period or go out of her husband's house as is indicated by the statement of Allah: 'But if they leave there is no blame on you,... ' (2.240) Ibn `Abbas said: The above Verse has cancelled the order of spending the period of the 'Iddah at her late husband's house, and so she could spend her period of the 'Iddah wherever she likes. And Allah says: 'Without turning them out.' 'Ata said: If she would, she could spend her period of the 'Iddah at her husband's house, and live there according to her (husband's) will and testament, and if she would, she could go out (of her husband's house) as Allah says: 'There is no blame on you for what they do of themselves.' (2.240) 'Ata added: Then the Verses of inheritance were revealed and the order of residence (for the widow) was cancelled, and she could spend her period of the 'Iddah wherever she would like, and she was no longer entitled to be accommodated by her husband's family.",
      "usc_msa_ref": "256",
      "chain": [
        "30313",
        "20229",
        "11559",
        "11254"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-2301",
      "hadith_no": "2301",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا موسى بن مسعود، حدثنا شبل، عن ابن أبي نجيح، قال قال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهله فتعتد حيث شاءت وهو قول الله تعالى ‏{‏ غير إخراج ‏}‏ قال عطاء إن شاءت اعتدت عند أهله وسكنت في وصيتها وإن شاءت خرجت لقول الله تعالى ‏{‏ فإن خرجن فلا جناح عليكم فيما فعلن ‏}‏ قال عطاء ثم جاء الميراث فنسخ السكنى تعتد حيث شاءت ‏.‏",
      "text_en": " Ibn ‘Abbas said “The following verse abrogated the rule of passing her waiting period with her people. A  year’s maintenance and residence. She may pass her waiting period now anywhere she wishes. ‘Ata said “If she wishes she can pass her waiting period with the people of her husband and live in the house left by her husband by will. Or she may shift if she wishes according to the pronouncement of Allah the Exalted. But if they leave (the residence) there is no blame on you for what they do. Ata’ said “Then the verses regarding inheritance were revealed. The commandment for living in a house (for one year) was repealed. She may pass her waiting period wherever she wishes.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20290",
        "11559",
        "11254",
        "11029",
        "11029"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4414",
      "hadith_no": "4414",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثنا موسى، - يعني ابن مسعود - عن شبل، عن ابن أبي نجيح، عن مجاهد، قال السبيل الحد قال سفيان ‏{‏ فآذوهما ‏}‏ البكران ‏{‏ فأمسكوهن في البيوت ‏}‏ الثيبات ‏.‏",
      "text_en": " Mujahid said:                      “Apponting a way in the verse (iv.15) means prescribed punishment.Sufiyan said: “Punish them “refers to unmarried, and “confine them to houses” refers to the women who are married.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20290",
        "11559",
        "11254",
        "11028"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-5411",
      "hadith_no": "5411",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد، وشبل، قالوا كنا عند النبي صلى الله عليه وسلم فقام إليه رجل فقال أنشدك بالله إلا ما قضيت بيننا بكتاب الله ‏.‏ فقام خصمه - وكان أفقه منه - فقال صدق اقض بيننا بكتاب الله ‏.‏ قال ‏\"‏ قل ‏\"‏ ‏.‏ قال إن ابني كان عسيفا على هذا فزنى بامرأته فافتديت منه بمائة شاة وخادم - وكأنه أخبر أن على ابنه الرجم فافتدى منه - ثم سألت رجالا من أهل العلم فأخبروني أن على ابني جلد مائة وتغريب عام ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله عز وجل أما المائة شاة والخادم فرد عليك وعلى ابنك جلد مائة وتغريب عام اغد يا أنيس على امرأة هذا فإن اعترفت فارجمها ‏\"‏ ‏.‏ فغدا عليها فاعترفت فرجمها ‏.‏",
      "text_en": " It was narrated that Abu Hurairah, Zaid bin Khalid and Shibl said:                     \"We were with the Prophet [SAW] when a man stood up and said: 'I adjure you, by Allah, pass judgment between us according to the Book of Allah.' His opponent, who was wiser than him, stood up and said: 'He is right, pass judgment between us according to the Book of Allah.' He said: 'Speak.' He said: 'My son was a laborer serving this man, and he committed Zina with his wife. I ransomed him with one hundred sheep and a servant.' It is as if he was told that his son was to be stoned to death but he ransomed him from that. 'Then I asked some knowledgeable men and they told me that my son was to be given one hundred lashes and exiled for a year.' The Messenger of Allah [SAW] said to him: 'By the One in Whose hand is my soul, I will pass judgment between you according to the Book of Allah, the Mighty and Sublime. As for the one hundred sheep and the servant, take them back, and your son is to be given one hundred lashes and exiled for a year. O Unais, go tomorrow to the wife of this man and if she confesses, then stone her to death.' She did confess, so he stoned her to death.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11004",
        "13",
        "3625",
        "11559"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-2646",
      "hadith_no": "2646",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهشام بن عمار، ومحمد بن الصباح، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد، وشبل، قالوا كنا عند رسول الله صلى الله عليه وسلم فأتاه رجل فقال أنشدك الله إلا قضيت بيننا بكتاب الله ‏.‏ فقال خصمه وكان أفقه منه اقض بيننا بكتاب الله وائذن لي حتى أقول ‏.‏ قال ‏\"‏ قل ‏\"‏ ‏.‏ قال إن ابني كان عسيفا على هذا وإنه زنى بامرأته فافتديت منه بمائة شاة وخادم فسألت رجلا من أهل العلم فأخبرت أن على ابني جلد مائة وتغريب عام وأن على امرأة هذا الرجم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله المائة الشاة والخادم رد عليك وعلى ابنك جلد مائة وتغريب عام واغد يا أنيس على امرأة هذا فإن اعترفت فارجمها ‏\"‏ ‏.‏ قال هشام فغدا عليها فاعترفت فرجمها ‏.‏",
      "text_en": " It was narrated that Abu Hurairah, Zaid bin Khalid and Shibl said:                     “We were with the Messenger of Allah (ﷺ) and a man came to him and said: 'I adjure you by Allah (SWT)  to judge between us according to the Book of Allah (SWT).' His opponent, who was more knowledgeable than him, said: 'Judge between us according to the Book of Allah (SWT), but let me speak first.' He said: 'Speak.' He said: 'My son was a servant of this man, and he committed adultery with his wife, and I ransomed him for one hundred sheep and a servant. I asked some men of knowledge and I was told that my son should be given one hundred lashes and exiled for a year, and that the wife of this man should be stoned.” The Messenger of Allah (ﷺ) said: 'By the One in Whose Hand is my soul, I will judge between you according to the Book of Allah (SWT). The one hundred sheep and the servant are to be returned to you and your son is to be given one hundred lashes and exiled  for a year. Go tomorrow, O Unais, to the wife of this man and  if she admits I then stone her.'”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30288",
        "30269",
        "20005",
        "11013",
        "11004",
        "13",
        "3625",
        "11559"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2662",
      "hadith_no": "2662",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد، وشبل، قالوا كنا عند النبي صلى الله عليه وسلم فسأله رجل عن الأمة تزني قبل أن تحصن ‏.‏ فقال ‏\"‏ اجلدها فإن زنت فاجلدها فإن زنت فاجلدها ‏\"‏ ‏.‏ ثم قال في الثالثة أو في الرابعة ‏\"‏ فبعها ولو بحبل من شعر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah, Zaid bin Khalid and Shibl said:                     “We were with the Prophet (ﷺ) and a man asked him about a slave woman who commits fornication (again), whip her, even if that is for a rope of hair.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30269",
        "20005",
        "11013",
        "11004",
        "13",
        "3625",
        "11559"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 8,
  "grade_display": {
    "en": "Follower (Tabi') [5th Generation]",
    "ar": "تابعي [الجيل الخامس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
  }
}