{
  "id": "11554",
  "name": "Mu'adh bin Rifa'a bin Rafi' bin Malik معاذ بن رفاعة الزرقي",
  "full_name": "Mu'adh bin Rifa'a bin Rafi' bin Malik معاذ بن رفاعة الزرقي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Jusham B.al-Khazraj",
      "B.Zurayq"
    ]
  },
  "parents": [
    {
      "id": "323",
      "name": "Rifa'a bin Rafi' bin Malik bin al-'Ajlan ( رفاعة بن رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "19828",
      "name": "'Ubaid bin Rifa'a bin Rafi' bin Malik عبيد بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "323",
      "name": "Rifa'a bin Rafi' bin Malik bin al-'Ajlan ( رفاعة بن رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-4042",
      "hadith_no": "4042",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا جرير، عن يحيى بن سعيد، عن معاذ بن رفاعة بن رافع الزرقي، عن أبيه  وكان أبوه من أهل بدر  قال جاء جبريل إلى النبي صلى الله عليه وسلم فقال ‏\"‏ ما تعدون أهل بدر فيكم قال من أفضل المسلمين  أو كلمة نحوها  قال وكذلك من شهد بدرا من الملائكة ‏\"‏‏.‏",
      "text_en": " Narrated Rifaa:                     (who was one of the Badr warriors) Gabriel came to the Prophet and said, \"How do you look upon the warriors of Badr among yourselves?\" The Prophet said, \"As the best of the Muslims.\" or said a similar statement. On that, Gabriel said, \"And so are the Angels who participated in the Badr (battle).",
      "usc_msa_ref": "327",
      "chain": [
        "30123",
        "20028",
        "11062",
        "11554",
        "323"
      ]
    },
    {
      "id": "sahih-bukhari-4043",
      "hadith_no": "4043",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى، عن معاذ بن رفاعة بن رافع،، وكان، رفاعة من أهل بدر، وكان رافع من أهل العقبة، فكان يقول لابنه ما يسرني أني شهدت بدرا بالعقبة قال سأل جبريل النبي صلى الله عليه وسلم‏.‏ بهذا‏.‏",
      "text_en": " Narrated Mu`adh bin Rifa`a bin Rafi`:                     Rifa`a was one of the warriors of Badr while (his father) Rafi` was one of the people of Al-`Aqaba (i.e. those who gave the pledge of allegiance at Al-`Aqaba). Rafi` used to say to his son, \"I would not have been happier if I had taken part in the Badr battle instead of taking part in the 'Aqaba pledge.\"",
      "usc_msa_ref": "328",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11554"
      ]
    },
    {
      "id": "sahih-bukhari-4044",
      "hadith_no": "4044",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يزيد، أخبرنا يحيى، سمع معاذ بن رفاعة، أن ملكا، سأل النبي صلى الله عليه وسلم‏.‏ وعن يحيى، أن يزيد بن الهاد أخبره أنه كان معه يوم حدثه معاذ هذا الحديث، فقال يزيد فقال معاذ إن السائل هو جبريل عليه السلام‏.‏",
      "text_en": " Narrated Mu`adh:                     The one who asked (the Prophet) was Gabriel (refer to Hadith 5.327).",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20472",
        "20031",
        "11554"
      ]
    },
    {
      "id": "sunan-abi-daud-773",
      "hadith_no": "773",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وسعيد بن عبد الجبار، نحوه قال قتيبة حدثنا رفاعة بن يحيى بن عبد الله بن رفاعة بن رافع، عن عم، أبيه معاذ بن رفاعة بن رافع عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فعطس رفاعة لم يقل قتيبة رفاعة فقلت الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى فلما صلى رسول الله صلى الله عليه وسلم انصرف فقال ‏\"‏ من المتكلم في الصلاة ‏\"‏ ‏.‏ ثم ذكر نحو حديث مالك وأتم منه ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     I offered prayer behind the Messenger of Allah (ﷺ). Rifa'ah sneezed. The narrator Qutaybah did not mention the name Rifa'ah (but he said: I sneezed). So I said: Praise be to Allah, praise much, good and blessed therein, blessed thereupon, as our Lord likes and is pleased. When the Messenger of Allah (ﷺ) finished his prayer, he turned and said: Who was the speaker in prayer? He then narrated the rest of the tradition like that of Malik and completed it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30416",
        "30367",
        "11554",
        "323"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3558-2",
      "hadith_no": "3558",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير، وهو ابن محمد عن عبد الله بن محمد بن عقيل، أن معاذ بن رفاعة، أخبره عن أبيه، قال قام أبو بكر الصديق على المنبر ثم بكى فقال قام رسول الله صلى الله عليه وسلم عام الأول على المنبر ثم بكى فقال ‏\"‏ سلوا الله العفو والعافية فإن أحدا لم يعط بعد اليقين خيرا من العافية ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه عن أبي بكر رضى الله عنه ‏.‏",
      "text_en": " Mu’adh bin Rifa’ah narrated from his father, that he said:                     “Abu Bakr stood upon the Minbar, then wept, and said: ‘The Messenger of Allah stood upon the Minbar the first year (of Hijrah), then wept, and said: “Ask Allah for pardon and Al-Afiyah, for verily, none has been given anything better than Al-Afiyah.’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "20321",
        "12246",
        "11554",
        "323"
      ]
    },
    {
      "id": "sunan-an-nasai-931",
      "hadith_no": "931",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا رفاعة بن يحيى بن عبد الله بن رفاعة بن رافع، عن عم، أبيه معاذ بن رفاعة بن رافع عن أبيه، قال صليت خلف النبي صلى الله عليه وسلم فعطست فقلت الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى ‏.‏ فلما صلى رسول الله صلى الله عليه وسلم انصرف فقال ‏\"‏ من المتكلم في الصلاة ‏\"‏ ‏.‏ فلم يكلمه أحد ثم قالها الثانية ‏\"‏ من المتكلم في الصلاة ‏\"‏ ‏.‏ فقال رفاعة بن رافع بن عفراء أنا يا رسول الله ‏.‏ قال ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قال قلت الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لقد ابتدرها بضعة وثلاثون ملكا أيهم يصعد بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin Rifa'ah bin Rafi' that :                     His father said: \"I prayed behind the Prophet (ﷺ) and I sneezed and said: 'Al-hamdu lillahi, hamdan kathiran tayiban mubarakan fih, mubarakan'alaihi, kama yuhibbu rabbuna wa yarda (Praise be to Allah, much good and blessed praise as our Lord loves and is pleased with.)' When he finished praying, the Messenger of Allah (ﷺ) said: 'Who is the one who spoke during the prayer?' But no one said anything. Then he said it a second time: 'Who is the one who spoke during the prayer?' So Rifa'ah bin Rafi bin Afrah said: 'It was me, O Messenger of Allah.' He said: 'I said: \"Praise be to Allah, much good and blessed praise as our Lord loves and is pleased with.'\" The Prophet (ﷺ) said: 'By the One in Whose hand is my soul, thirty-odd angels hastened to see which of them would take it up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11554",
        "323"
      ]
    }
  ],
  "total_hadiths": 6
}