{
  "id": "11558",
  "name": "Syf bin Sulaiman سيف بن سليمان",
  "full_name": "Syf bin Sulaiman سيف بن سليمان",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ثبت ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Makki",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10655",
      "name": "Qays bin Sa'd al-Mky قيس بن سعد المكي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20524",
      "name": "'Abdullah bin al-Harith bin 'Abdul Malik عبد الله بن الحارث بن عبد الملك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-397",
      "hadith_no": "397",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن سيف، قال سمعت مجاهدا، قال أتي ابن عمر فقيل له هذا رسول الله صلى الله عليه وسلم دخل الكعبة‏.‏ فقال ابن عمر فأقبلت والنبي صلى الله عليه وسلم قد خرج، وأجد بلالا قائما بين البابين، فسألت بلالا فقلت أصلى النبي صلى الله عليه وسلم في الكعبة قال نعم ركعتين بين الساريتين اللتين على يساره إذا دخلت، ثم خرج فصلى في وجه الكعبة ركعتين‏.‏",
      "text_en": " Narrated Mujahid:                     Someone came to Ibn `Umar and said, \"Here is Allah's Apostle entering the Ka`ba.\" Ibn `Umar said, \"I went there but the Prophet had come out of the Ka`ba and I found Bilal standing between its two doors. I asked Bilal, 'Did the Prophet pray in the Ka`ba?' Bilal replied, 'Yes, he prayed two rak`at between the two pillars which are to your left on entering the Ka`ba. Then Allah's Apostle came out and offered a two-rak`at prayer facing the Ka`ba.' \"",
      "usc_msa_ref": "390",
      "chain": [
        "30175",
        "20031",
        "11558",
        "11028"
      ]
    },
    {
      "id": "sahih-bukhari-1171",
      "hadith_no": "1171",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا سيف بن سليمان المكي، سمعت مجاهدا، يقول أتي ابن عمر  رضى الله عنهما  في منزله فقيل له هذا رسول الله صلى الله عليه وسلم قد دخل الكعبة قال فأقبلت فأجد رسول الله صلى الله عليه وسلم قد خرج، وأجد بلالا عند الباب قائما فقلت يا بلال، صلى رسول الله صلى الله عليه وسلم في الكعبة قال نعم‏.‏ قلت فأين قال بين هاتين الأسطوانتين‏.‏ ثم خرج فصلى ركعتين في وجه الكعبة‏.‏ قال أبو عبد الله قال أبو هريرة  رضى الله عنه  أوصاني النبي صلى الله عليه وسلم بركعتى الضحى‏.‏ وقال عتبان غدا على رسول الله صلى الله عليه وسلم وأبو بكر  رضى الله عنه  بعد ما امتد النهار وصففنا وراءه فركع ركعتين‏.‏",
      "text_en": " Narrated Mujahid:                     Somebody came to the house of Ibn `Umar and told him that Allah's Apostles had entered the Ka`ba. Ibn `Umar said, \"I went in front of the Ka`ba and found that Allah's Apostle had come out of the Ka`ba and I saw Bilal standing by the side of the gate of the Ka`ba. I said, 'O Bilal! Has Allah's Apostle (p.b.u.h) prayed inside the Ka`ba?' Bilal replied in the affirmative. I said, 'Where (did he pray)?' He replied, '(He prayed) Between these two pillars and then he came out and offered a two rak`at prayer in front of the Ka`ba.' \" Abu `Abdullah said: Abu Huraira said, \"The Prophet (p.b.u.h) advised me to offer two rak`at of Duha prayer (prayer to be offered after sunrise and before midday). \" Itban (bin Malik) said, \"Allah's Apostle (p.b.u.h) and Abu Bakr, came to me after sunrise and we aligned behind the Prophet (p.b.u.h) and offered two rak`at.\"",
      "usc_msa_ref": "268",
      "chain": [
        "20348",
        "11558",
        "11028"
      ]
    },
    {
      "id": "sahih-bukhari-1744",
      "hadith_no": "1744",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف بن أبي سليمان، قال سمعت مجاهدا، يقول حدثني ابن أبي ليلى، أن عليا  رضى الله عنه  حدثه قال أهدى النبي صلى الله عليه وسلم مائة بدنة، فأمرني بلحومها فقسمتها، ثم أمرني بجلالها فقسمتها، ثم بجلودها فقسمتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet offered one hundred Budn as Hadi and ordered me to distribute their meat (in charity) and I did so. Then he ordered me to distribute their covering sheets in charity and I did so. Then he ordered me to distribute their skins in charity and I did so.",
      "usc_msa_ref": "776",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-1846",
      "hadith_no": "1846",
      "source": "Sahih Bukhari",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف، قال حدثني مجاهد، قال سمعت عبد الرحمن بن أبي ليلى، أن كعب بن عجرة، حدثه قال وقف على رسول الله صلى الله عليه وسلم بالحديبية، ورأسي يتهافت قملا فقال ‏\"‏ يؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق رأسك  أو قال  احلق ‏\"‏‏.‏ قال في نزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه‏}‏ إلى آخرها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صم ثلاثة أيام، أو تصدق بفرق بين ستة، أو انسك بما تيسر ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin `Umra:                     Allah's Apostle stood beside me at Al-Hudaibiya and the lice were falling from my head in great number. He asked me, \"Have your lice troubled you?\" I replied in the affirmative. He ordered me to get my head shaved. Ka`b added, \"This Holy Verse:--'And if any of you is ill, or has ailment in his scalp (2.196), etc. was revealed regarding me. \"The Prophet then ordered me either to fast three days, or to feed six poor persons with one Faraq (three Sas) (of dates), or to slaughter a sheep, etc. (sacrifice) whatever was available.",
      "usc_msa_ref": "42",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sahih-bukhari-5481",
      "hadith_no": "5481",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف بن أبي سليمان، قال سمعت مجاهدا، يقول حدثني عبد الرحمن بن أبي ليلى، أنهم كانوا عند حذيفة فاستسقى فسقاه مجوسي‏.‏ فلما وضع القدح في يده رماه به وقال لولا أني نهيته غير مرة ولا مرتين‏.‏ كأنه يقول لم أفعل هذا، ولكني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تلبسوا الحرير ولا الديباج ولا تشربوا في آنية الذهب والفضة، ولا تأكلوا في صحافها، فإنها لهم في الدنيا ولنا في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Laila:                     We were sitting in the company of Hudhaifa who asked for water and a Magian brought him water. But when he placed the cup in his hand, he threw it at him and said, \"Had I not forbidden him to do so more than once or twice?\" He wanted to say, \"I would not have done so,\" adding, \"but I heard the Prophet saying, \"Do not wear silk or Dibaja, and do not drink in silver or golden vessels, and do not eat in plates of such metals, for such things are for the unbelievers in this worldly life and for us in the Hereafter.\"",
      "usc_msa_ref": "337",
      "chain": [
        "20348",
        "11558",
        "11028"
      ]
    },
    {
      "id": "sahih-bukhari-6338",
      "hadith_no": "6338",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف، قال سمعت مجاهدا، يقول حدثني عبد الله بن سخبرة أبو معمر، قال سمعت ابن مسعود، يقول علمني رسول الله صلى الله عليه وسلم وكفي بين كفيه التشهد، كما يعلمني السورة من القرآن التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله‏.‏ وهو بين ظهرانينا، فلما قبض قلنا السلام‏.‏ يعني على النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     Allah's Apostle taught me the Tashah-hud as he taught me a Sura from the Qur'an, while my hand was between his hands. (Tashah-hud was) all the best compliments and the prayers and the good things are for Allah. Peace and Allah's Mercy and Blessings be on you, O Prophet! Peace be on us and on the pious slaves of Allah, I testify that none has the right to be worshipped but Allah, and I also testify that Muhammad is Allah's slave and His Apostle. (We used to recite this in the prayer) during the lifetime of the Prophet , but when he had died, we used to say, \"Peace be on the Prophet.\"",
      "usc_msa_ref": "281",
      "chain": [
        "20348",
        "11558",
        "11028",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-402-6",
      "hadith_no": "402",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو نعيم، حدثنا سيف بن سليمان، قال سمعت مجاهدا، يقول حدثني عبد الله بن سخبرة، قال سمعت ابن مسعود، يقول علمني رسول الله صلى الله عليه وسلم التشهد كفي بين كفيه كما يعلمني السورة من القرآن ‏.‏ واقتص التشهد بمثل ما اقتصوا ‏.‏",
      "text_en": " Ibn Mas'ud is reported to have said:                      The Messenger of Allah (may peace be upon him) taught me tashahhud taking my hand within his palms, in the same way as he taught me a Sura of the Qur'an, and he narrated it as narrated above.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20348",
        "11558",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-2937",
      "hadith_no": "2937",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سيف، قال سمعت مجاهدا، يقول حدثني عبد، الرحمن بن أبي ليلى حدثني كعب بن عجرة، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم وقف عليه ورأسه يتهافت قملا فقال ‏\"‏ أيؤذيك هوامك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فاحلق رأسك ‏\"‏ ‏.‏ قال ففي نزلت هذه الآية ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏ فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم ثلاثة أيام أو تصدق بفرق بين ستة مساكين أو انسك ما تيسر ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported that the Messenger of Allah (may peace be, upon him) stood near him and lice were falling from his head. Thereupon he (the Holy Prophet) said:                      Do these vermins trouble you? I said: Yes. Thereupon he said: Then shave your head; and it was in connection with me that this verse was revealed:\" Whoever among you is sick or has an ailment of the head, he (may effect) a compensation by fasting or alms or a sacrifice\". He (the Holy Prophet, therefore) said to me: Observe fast for three days or give a quantity of alms enough to feed six needy persons or offer sacrifice (of an animal) that is available.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11558",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sahih-muslim-4569",
      "hadith_no": "4569",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا زيد، - وهو ابن حباب - حدثني سيف بن سليمان، أخبرني قيس بن سعد، عن عمرو بن دينار، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قضى بيمين وشاهد ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) pronounced judgment on the basis of an oath and a witness (by the plaintiff).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20650",
        "11558",
        "172",
        "11081",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5521",
      "hadith_no": "5521",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سيف، قال سمعت مجاهدا، يقول سمعت عبد الرحمن بن أبي ليلى، قال استسقى حذيفة فسقاه مجوسي في إناء من فضة فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تلبسوا الحرير ولا الديباج ولا تشربوا في آنية الذهب والفضة ولا تأكلوا في صحافها فإنها لهم في الدنيا‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahmin b. Abu Laili reported that Hudhaifa asked for water and a Magian gave him water in a silver vessel, whereupon he said:                      I heard Allah's Messenger (may peace be upon him) as saying: Do not wear silk or brocade and do not drink ifi vessels of gold and silver, and do not eat in the dishes made of them (i. e. gold and silver), for these are for them (the non-believers) in this world.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11558",
        "11028",
        "11196"
      ]
    },
    {
      "id": "sahih-muslim-7279",
      "hadith_no": "7279",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سيف، قال سمعت مجاهدا، يقول سمعت ابن، عمر يقول أتي رسول الله صلى الله عليه وسلم بجمار ‏.‏ فذكر نحو حديثهم ‏.‏",
      "text_en": " Mujahid reported:                      I heard Ibn 'Umar as saying: There was brought to Allah's Messenger (may peace be upon him) the kernel. The rest of the hadith is tile same.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11558",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3627",
      "hadith_no": "3627",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، وموسى بن مروان الرقي، قالا حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن سيف، عن عوف بن مالك، أنه حدثهم أن النبي صلى الله عليه وسلم قضى بين رجلين ‏.‏ فقال المقضي عليه لما أدبر حسبي الله ونعم الوكيل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله يلوم على العجز ولكن عليك بالكيس فإذا غلبك أمر فقل حسبي الله ونعم الوكيل ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Holy Prophet (ﷺ) gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet (ﷺ) said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "35154",
        "20644",
        "11422",
        "11558",
        "10805"
      ]
    },
    {
      "id": "sunan-an-nasai-2908",
      "hadith_no": "2908",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سيف بن سليمان، قال سمعت مجاهدا، يقول أتي ابن عمر في منزله فقيل هذا رسول الله صلى الله عليه وسلم قد دخل الكعبة فأقبلت فأجد رسول الله صلى الله عليه وسلم قد خرج وأجد بلالا على الباب قائما فقلت يا بلال أصلى رسول الله صلى الله عليه وسلم في الكعبة قال نعم ‏.‏ قلت أين قال ما بين هاتين الأسطوانتين ركعتين ثم خرج فصلى ركعتين في وجه الكعبة ‏.‏",
      "text_en": " Some one came to Ibn Umar in his house and said:                     The Messenger of Allah has entered the Kabah.\" So Ibn Umar said, I (Ibn Umar) came and found that the Messenger of Allah had come out, and I found Bilal standing at the door. I said: \"O Bilal, did the Messenger of Allah pray inside the Kabah?' He said: \"Ues.\" I said: \"Where>\" He said: \"Between these two columns, two Rakahs. Then he came out and prayed two Rakahs in front of the Kabah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11558",
        "11028"
      ]
    },
    {
      "id": "sunan-ibn-majah-2370-2",
      "hadith_no": "2370",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو إسحاق الهروي، إبراهيم بن عبد الله بن حاتم حدثنا عبد الله بن الحارث المخزومي، حدثنا سيف بن سليمان المكي، أخبرني قيس بن سعد، عن عمرو بن دينار، عن ابن عباس، قال قضى رسول الله صلى الله عليه وسلم بالشاهد واليمين ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “The Messenger of Allah (ﷺ) passed judgement on the basis of a witness along with an oath by the claimant.",
      "usc_msa_ref": "",
      "chain": [
        "20524",
        "11558",
        "172",
        "11081",
        "17"
      ]
    }
  ],
  "total_hadiths": 14
}