{
  "id": "11556",
  "name": "Ayman al-Habshi al-Makki أيمن الحبشي المكي",
  "full_name": "Ayman al-Habshi al-Makki أيمن الحبشي المكي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Abyssinia",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  صد  -  ثقة ]"
    ],
    "tags": [
      "Abyssinia",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11560",
      "name": "Abd al-Wahd bin Aymn عبد الواحد بن أيمن المخزومي مولاهم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11560",
      "name": "Abd al-Wahd bin Aymn عبد الواحد بن أيمن المخزومي مولاهم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "449",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا خلاد، قال حدثنا عبد الواحد بن أيمن، عن أبيه، عن جابر، أن امرأة، قالت يا رسول الله، ألا أجعل لك شيئا تقعد عليه، فإن لي غلاما نجارا قال ‏\"‏ إن شئت ‏\"‏‏.‏ فعملت المنبر‏.‏",
      "text_en": " Narrated Jabir:                     A woman said, \"O Allah's Apostle! Shall I get something constructed for you to sit on as I have a slave who is a carpenter?\" He replied, \"Yes, if you like.\" So she had that pulpit constructed.",
      "chain": [
        "11560",
        "11556",
        "34"
      ]
    },
    {
      "hadith_no": "590",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد الواحد بن أيمن، قال حدثني أبي أنه، سمع عائشة، قالت والذي ذهب به ما تركهما حتى لقي الله، وما لقي الله تعالى حتى ثقل عن الصلاة، وكان يصلي كثيرا من صلاته قاعدا  تعني الركعتين بعد العصر  وكان النبي صلى الله عليه وسلم يصليهما، ولا يصليهما في المسجد مخافة أن يثقل على أمته، وكان يحب ما يخفف عنهم‏.‏",
      "text_en": " Narrated `Aisha:                     By Allah, Who took away the Prophet. The Prophet never missed them (two rak`at) after the `Asr prayer till he met Allah and he did not meet Allah till it became heavy for him to pray while standing so he used to offer most of the prayers while sitting. (She meant the two rak`at after `Asr) He used to pray them in the house and never prayed them in the mosque lest it might be hard for his followers and he loved what was easy for them .",
      "chain": [
        "20348",
        "11560",
        "11556",
        "53"
      ]
    },
    {
      "hadith_no": "2095",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن، عن أبيه، عن جابر بن عبد الله  رضى الله عنهما  أن امرأة من الأنصار قالت لرسول الله صلى الله عليه وسلم يا رسول الله، ألا أجعل لك شيئا تقعد عليه فإن لي غلاما نجارا‏.‏ قال ‏\"‏ إن شئت ‏\"‏‏.‏ قال فعملت له المنبر، فلما كان يوم الجمعة قعد النبي صلى الله عليه وسلم على المنبر الذي صنع، فصاحت النخلة التي كان يخطب عندها حتى كادت أن تنشق، فنزل النبي صلى الله عليه وسلم حتى أخذها فضمها إليه، فجعلت تئن أنين الصبي الذي يسكت حتى استقرت‏.‏ قال ‏\"‏ بكت على ما كانت تسمع من الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     An Ansari woman said to Allah's Apostle, \"O Allah's Apostle! Shall I make something for you to sit on, as I have a slave who is a carpenter?\" He replied, \"If you wish.\" So, she got a pulpit made for him. When it was Friday the Prophet sat on that pulpit. The date-palm stem near which the Prophet used to deliver his sermons cried so much so that it was about to burst. The Prophet came down from the pulpit to the stem and embraced it and it started groaning like a child being persuaded to stop crying and then it stopped crying. The Prophet said,\"It has cried because of (missing) what it use to hear of the religions knowledge.\"",
      "chain": [
        "20191",
        "11560",
        "11556",
        "34"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد الواحد بن أيمن، قال حدثني أبي قال، دخلت على عائشة  رضى الله عنها  وعليها درع قطر ثمن خمسة دراهم، فقالت ارفع بصرك إلى جاريتي، انظر إليها فإنها تزهى أن تلبسه في البيت، وقد كان لي منهن درع على عهد رسول الله صلى الله عليه وسلم، فما كانت امرأة تقين بالمدينة إلا أرسلت إلى تستعيره‏.‏",
      "text_en": " Narrated Aiman:                     I went to `Aisha and she was wearing a coarse dress costing five Dirhams. `Aisha said, \"Look up and see my slave-girl who refuses to wear it in the house though during the lifetime of Allah's Apostle I had a similar dress which no woman desiring to appear elegant (before her husband) failed to borrow from me.\"",
      "chain": [
        "20348",
        "11560",
        "11556"
      ]
    },
    {
      "hadith_no": "2726",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن المكي، عن أبيه، قال دخلت على عائشة  رضى الله عنها  قالت دخلت على بريرة وهى مكاتبة، فقالت يا أم المؤمنين اشتريني فإن أهلي يبيعوني فأعتقيني قالت نعم‏.‏ قالت إن أهلي لا يبيعوني حتى يشترطوا ولائي‏.‏ قالت لا حاجة لي فيك‏.‏ فسمع ذلك النبي صلى الله عليه وسلم أو بلغه، فقال ‏\"‏ ما شأن بريرة فقال اشتريها فأعتقيها وليشترطوا ما شاءوا ‏\"‏‏.‏ قالت فاشتريتها فأعتقتها، واشترط أهلها ولاءها، فقال النبي صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق، وإن اشترطوا مائة شرط ‏\"‏‏.‏",
      "text_en": " Narrated Aiman Al-Makki:                     When I visited Aisha she said, \"Buraira who had a written contract for her emancipation for a certain amount came to me and said, \"O mother of the believers! Buy me and manumit me, as my masters will sell me.\" Aisha agreed to it. Buraira said, 'My masters will sell me on the condition that my Wala will go to them.\" Aisha said to her, 'Then I am not in need of you.' The Prophet heard of that or was told about it and so he asked Aisha, 'What is the problem of Buraira?' He said, 'Buy her and manumit her, no matter what they stipulate.' Aisha added, 'I bought and manumitted her, though her masters had stipulated that her Wala would be for them.' The Prophet said, The Wala is for the liberator, even if the other stipulated a hundred conditions.\"",
      "chain": [
        "20191",
        "11560",
        "11556",
        "53"
      ]
    },
    {
      "hadith_no": "3626",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد الواحد بن أيمن، قال سمعت أبي، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم كان يقوم يوم الجمعة إلى شجرة أو نخلة، فقالت امرأة من الأنصار  أو رجل  يا رسول الله ألا نجعل لك منبرا قال ‏\"‏ إن شئتم ‏\"‏‏.‏ فجعلوا له منبرا، فلما كان يوم الجمعة دفع إلى المنبر، فصاحت النخلة صياح الصبي، ثم نزل النبي صلى الله عليه وسلم فضمه إليه تئن أنين الصبي، الذي يسكن، قال ‏\"‏ كانت تبكي على ما كانت تسمع من الذكر عندها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to stand by a tree or a date-palm on Friday. Then an Ansari woman or man said. \"O Allah's Apostle! Shall we make a pulpit for you?\" He replied, \"If you wish.\" So they made a pulpit for him and when it was Friday, he proceeded towards the pulpit (for delivering the sermon). The datepalm cried like a child! The Prophet descended (the pulpit) and embraced it while it continued moaning like a child being quietened. The Prophet said, \"It was crying for (missing) what it used to hear of religious knowledge given near to it.\"",
      "chain": [
        "20348",
        "11560",
        "11556",
        "34"
      ]
    },
    {
      "hadith_no": "4151",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن، عن أبيه، قال أتيت جابرا  رضى الله عنه  فقال إنا يوم الخندق نحفر فعرضت كدية شديدة، فجاءوا النبي صلى الله عليه وسلم فقالوا هذه كدية عرضت في الخندق، فقال ‏\"‏ أنا نازل ‏\"‏‏.‏ ثم قام وبطنه معصوب بحجر، ولبثنا ثلاثة أيام لا نذوق ذواقا، فأخذ النبي صلى الله عليه وسلم المعول فضرب، فعاد كثيبا أهيل أو أهيم، فقلت يا رسول الله ائذن لي إلى البيت‏.‏ فقلت لامرأتي رأيت بالنبي صلى الله عليه وسلم شيئا، ما كان في ذلك صبر، فعندك شىء قالت عندي شعير وعناق‏.‏ فذبحت العناق وطحنت الشعير، حتى جعلنا اللحم في البرمة، ثم جئت النبي صلى الله عليه وسلم والعجين قد انكسر، والبرمة بين الأثافي قد كادت أن تنضج فقلت طعيم لي، فقم أنت يا رسول الله ورجل أو رجلان‏.‏ قال ‏\"‏ كم هو ‏\"‏‏.‏ فذكرت له، قال ‏\"‏ كثير طيب ‏\"‏‏.‏ قال ‏\"‏ قل لها لا تنزع البرمة ولا الخبز من التنور حتى آتي ‏\"‏‏.‏ فقال ‏\"‏ قوموا ‏\"‏‏.‏ فقام المهاجرون والأنصار، فلما دخل على امرأته قال ويحك جاء النبي صلى الله عليه وسلم بالمهاجرين والأنصار ومن معهم‏.‏ قالت هل سألك قلت نعم‏.‏ فقال ‏\"‏ ادخلوا ولا تضاغطوا ‏\"‏‏.‏ فجعل يكسر الخبز ويجعل عليه اللحم، ويخمر البرمة والتنور إذا أخذ منه، ويقرب إلى أصحابه ثم ينزع، فلم يزل يكسر الخبز ويغرف حتى شبعوا وبقي بقية قال ‏\"‏ كلي هذا وأهدي، فإن الناس أصابتهم مجاعة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     We were digging (the trench) on the day of (Al-Khandaq ( i.e. Trench )) and we came across a big solid rock. We went to the Prophet and said, \"Here is a rock appearing across the trench.\" He said, \"I am coming down.\" Then he got up, and a stone was tied to his belly for we had not eaten anything for three days. So the Prophet took the spade and struck the big solid rock and it became like sand. I said, \"O Allah's Apostle! Allow me to go home.\" (When the Prophet allowed me) I said to my wife, \"I saw the Prophet in a state that I cannot treat lightly. Have you got something (for him to eat?\" She replied, \"I have barley and a she goat.\" So I slaughtered the she-kid and she ground the barley; then we put the meat in the earthenware cooking pot. Then I came to the Prophet when the dough had become soft and fermented and (the meat in) the pot over the stone trivet had nearly been well-cooked, and said, \"I have got a little food prepared, so get up O Allah's Apostle, you and one or two men along with you (for the food).\" The Prophet asked, \"How much is that food?\" I told him about it. He said, \"It is abundant and good. Tell your wife not to remove the earthenware pot from the fire and not to take out any bread from the oven till I reach there.\" Then he said (to all his companions), \"Get up.\" So the Muhajirn (i.e. Emigrants) and the Ansar got up. When I came to my wife, I said, \"Allah's Mercy be upon you! The Prophet came along with the Muhajirin and the Ansar and those who were present with them.\" She said, \"Did the Prophet ask you (how much food you had)?\" I replied, \"Yes.\" Then the Prophet said, \"Enter and do not throng.\" The Prophet started cutting the bread (into pieces) and put the cooked meat over it. He covered the earthenware pot and the oven whenever he took something out of them. He would give the food to his companions and take the meat out of the pot. He went on cutting the bread and scooping the meat (for his companions) till they all ate their fill, and even then, some food remained. Then the Prophet said (to my wife), \"Eat and present to others as the people are struck with hunger.\"",
      "chain": [
        "20191",
        "11560",
        "11556"
      ]
    }
  ],
  "total_hadiths": 7
}