{
  "id": "11552",
  "name": "Abu Yazid al-Madni أبو يزيد المدني",
  "full_name": "Abu Yazid al-Madni أبو يزيد المدني",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ خ  س  -  مقبول ]"
    ],
    "tags": [
      "al-Madni",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "69",
      "name": "Asma bint 'Umays ( أسماء بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "202",
      "name": "Umm Ayman, Barakah ( أم أيمن مولاة النبي صلى الله عليه وسلم ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11608",
      "name": "Qtn bin Ka'b قطن بن كعب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10690",
      "name": "Salah bin Rastum, Abu 'Amir al-Khazaz صالح بن رستم المزني أبو عامر الخزاز",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "13003",
      "name": "Isma'il bin Muslim al-Mky إسماعيل بن مسلم المكي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3893",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا قطن أبو الهيثم، حدثنا أبو يزيد المدني، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال إن أول قسامة كانت في الجاهلية لفينا بني هاشم، كان رجل من بني هاشم استأجره رجل من قريش من فخذ أخرى، فانطلق معه في إبله، فمر رجل به من بني هاشم قد انقطعت عروة جوالقه فقال أغثني بعقال أشد به عروة جوالقي، لا تنفر الإبل‏.‏ فأعطاه عقالا، فشد به عروة جوالقه، فلما نزلوا عقلت الإبل إلا بعيرا واحدا، فقال الذي استأجره ما شأن هذا البعير لم يعقل من بين الإبل قال ليس له عقال‏.‏ قال فأين عقاله قال فحذفه بعصا كان فيها أجله، فمر به رجل من أهل اليمن، فقال أتشهد الموسم قال ما أشهد، وربما شهدته‏.‏ قال هل أنت مبلغ عني رسالة مرة من الدهر قال نعم‏.‏ قال فكنت إذا أنت شهدت الموسم فناد يا آل قريش‏.‏ فإذا أجابوك، فناد يا آل بني هاشم‏.‏ فإن أجابوك فسل عن أبي طالب، فأخبره أن فلانا قتلني في عقال، ومات المستأجر، فلما قدم الذي استأجره أتاه أبو طالب فقال ما فعل صاحبنا قال مرض، فأحسنت القيام عليه، فوليت دفنه‏.‏ قال قد كان أهل ذاك منك‏.‏ فمكث حينا، ثم إن الرجل الذي أوصى إليه أن يبلغ عنه وافى الموسم فقال يا آل قريش‏.‏ قالوا هذه قريش‏.‏ قال يا آل بني هاشم‏.‏ قالوا هذه بنو هاشم‏.‏ قال أين أبو طالب قالوا هذا أبو طالب‏.‏ قال أمرني فلان أن أبلغك رسالة أن فلانا قتله في عقال‏.‏ فأتاه أبو طالب فقال له اختر منا إحدى ثلاث، إن شئت أن تؤدي مائة من الإبل، فإنك قتلت صاحبنا، وإن شئت حلف خمسون من قومك أنك لم تقتله، فإن أبيت قتلناك به فأتى قومه، فقالوا نحلف‏.‏ فأتته امرأة من بني هاشم كانت تحت رجل منهم قد ولدت له‏.‏ فقالت يا أبا طالب أحب أن تجيز ابني هذا برجل من الخمسين ولا تصبر يمينه حيث تصبر الأيمان‏.‏ ففعل فأتاه رجل منهم فقال يا أبا طالب، أردت خمسين رجلا أن يحلفوا مكان مائة من الإبل، يصيب كل رجل بعيران، هذان بعيران فاقبلهما عني ولا تصبر يميني حيث تصبر الأيمان‏.‏ فقبلهما، وجاء ثمانية وأربعون فحلفوا‏.‏ قال ابن عباس فوالذي نفسي بيده، ما حال الحول ومن الثمانية وأربعين عين تطرف‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first event of Qasama in the pre-lslamic period of ignorance was practiced by us (i.e. Banu Hashim). A man from Banu Hashim was employed by a Quraishi man from another branch-family. The (Hashimi) laborer set out with the Quraishi driving his camels. There passed by him another man from Banu Hashim. The leather rope of the latter's bag had broken so he said to the laborer, \"Will you help me by giving me a rope in order to tie the handle of my bag lest the camels should run away from me?\" The laborer gave him a rope and the latter tied his bag with it. When the caravan halted, all the camels' legs were tied with their fetters except one camel. The employer asked the laborer, \"Why, from among all the camels has this camel not been fettered?\" He replied, \"There is no fetter for it.\" The Quraishi asked, \"Where is its fetter?\" and hit the laborer with a stick that caused his death (later on Just before his death) a man from Yemen passed by him. The laborer asked (him), \"Will you go for the pilgrimage?\" He replied, \"I do not think I will attend it, but perhaps I will attend it.\" The (Hashimi) laborer said, \"Will you please convey a message for me once in your life?\" The other man said, \"yes.\" The laborer wrote: 'When you attend the pilgrimage, call the family of Quraish, and if they respond to you, call the family of Banu Hashim, and if they respond to you, ask about Abu Talib and tell him that so-and-so has killed me for a fetter.\" Then the laborer expired. When the employer reached (Mecca), Abu Talib visited him and asked, \"What has happened to our companion?\" He said, \"He became ill and I looked after him nicely (but he died) and I buried him.\" Then Abu Talib said, \"The deceased deserved this from you.\" After some time, the messenger whom the laborer has asked to convey the message, reached during the pilgrimage season. He called, \"O the family of Quraish!\" The people replied, \"This is Quraish.\" Then he called, \"O the family of Banu Hashim!\" Again the people replied, \"This is Banu Hashim.\" He asked, \"Who is Abu Talib?\" The people replied, \"This is Abu Talib.\" He said, \"'So-and-so has asked me to convey a message to you that so-and-so has killed him for a fetter (of a camel).\" Then Abu Talib went to the (Quraishi) killer and said to him, \"Choose one of three alternatives: (i) If you wish, give us one-hundred camels because you have murdered our companion, (ii) or if you wish, fifty of your men should take an oath that you have not murdered our companion, and if you do not accept this, (iii) we will kill you in Qisas.\" The killer went to his people and they said, \"We will take an oath.\" Then a woman from Banu Hashim who was married to one of them (i.e.the Quraishis) and had given birth to a child from him, came to Abu Talib and said, \"O Abu Talib! I wish that my son from among the fifty men, should be excused from this oath, and that he should not take the oath where the oathtaking is carried on.\" Abu Talib excused him. Then another man from them came (to Abu Talib) and said, \"O Abu Talib! You want fifty persons to take an oath instead of giving a hundred camels, and that means each man has to give two camels (in case he does not take an oath). So there are two camels I would like you to accept from me and excuse me from taking an oath where the oaths are taken. Abu Talib accepted them from him. Then 48 men came and took the oath. Ibn `Abbas further said:) By Him in Whose Hand my life is, before the end of that year, none of those 48 persons remained alive.",
      "chain": [
        "30315",
        "20258",
        "11552",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4706",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن يحيى، قال حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا قطن أبو الهيثم، قال حدثنا أبو يزيد المدني، عن عكرمة، عن ابن عباس، قال أول قسامة كانت في الجاهلية كان رجل من بني هاشم استأجر رجلا من قريش من فخذ أحدهم - قال - فانطلق معه في إبله فمر به رجل من بني هاشم قد انقطعت عروة جوالقه فقال أغثني بعقال أشد به عروة جوالقي لا تنفر الإبل فأعطاه عقالا يشد به عروة جوالقه فلما نزلوا وعقلت الإبل إلا بعيرا واحدا فقال الذي استأجره ما شأن هذا البعير لم يعقل من بين الإبل قال ليس له عقال ‏.‏ قال فأين عقاله قال مر بي رجل من بني هاشم قد انقطعت عروة جوالقه فاستغاثني فقال أغثني بعقال أشد به عروة جوالقي لا تنفر الإبل ‏.‏ فأعطيته عقالا فحذفه بعصا كان فيها أجله فمر به رجل من أهل اليمن فقال أتشهد الموسم قال ما أشهد وربما شهدت ‏.‏ قال هل أنت مبلغ عني رسالة مرة من الدهر قال نعم ‏.‏ قال إذا شهدت الموسم فناد يا آل قريش فإذا أجابوك فناد يا آل هاشم فإذا أجابوك فسل عن أبي طالب فأخبره أن فلانا قتلني في عقال ومات المستأجر فلما قدم الذي استأجره أتاه أبو طالب فقال ما فعل صاحبنا قال مرض فأحسنت القيام عليه ثم مات فنزلت فدفنته ‏.‏ فقال كان ذا أهل ذاك منك ‏.‏ فمكث حينا ثم إن الرجل اليماني الذي كان أوصى إليه أن يبلغ عنه وافى الموسم قال يا آل قريش ‏.‏ قالوا هذه قريش ‏.‏ قال يا آل بني هاشم ‏.‏ قالوا هذه بنو هاشم ‏.‏ قال أين أبو طالب قال هذا أبو طالب ‏.‏ قال أمرني فلان أن أبلغك رسالة أن فلانا قتله في عقال ‏.‏ فأتاه أبو طالب فقال اختر منا إحدى ثلاث إن شئت أن تؤدي مائة من الإبل فإنك قتلت صاحبنا خطأ وإن شئت يحلف خمسون من قومك أنك لم تقتله فإن أبيت قتلناك به ‏.‏ فأتى قومه فذكر ذلك لهم فقالوا نحلف ‏.‏ فأتته امرأة من بني هاشم كانت تحت رجل منهم قد ولدت له فقالت يا أبا طالب أحب أن تجيز ابني هذا برجل من الخمسين ولا تصبر يمينه ‏.‏ ففعل فأتاه رجل منهم فقال يا أبا طالب أردت خمسين رجلا أن يحلفوا مكان مائة من الإبل يصيب كل رجل بعيران فهذان بعيران فاقبلهما عني ولا تصبر يميني حيث تصبر الأيمان ‏.‏ فقبلهما وجاء ثمانية وأربعون رجلا حلفوا ‏.‏ قال ابن عباس فوالذي نفسي بيده ما حال الحول ومن الثمانية والأربعين عين تطرف ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The first instance of Qasamah during the Jahiliyyah involved a man from Banu Hashim who was employed by a man from Quraish, from another branch of the tribe. He went out with him, driving his camels and another man from Banu Hashim passed by them. The leather rope of that man's bag broke, so he said (to the hired worker): 'Help me by giving me a rope with which to tie the handle of my bag, lest the camels run away from me. 'So he gave him a rope and he tied his gab with it. When they halted, all the camels' legs were hobbled except one camel. The one who had hired him said: 'Why is his camel, out of all of them, not hobbled? He said: 'There is no rope for it. He said: 'Where is its rope? He said: A man from Banu Hashim passed by and the leather rope of his bag had broken, and he asked me to help him; he said: \"Help me by giving me a rope with which to tie the handle of my bag lest the camels run away from me, so I gave him a rope . \" He struck him with a stick, which led to his death.Then a man from Yemen passed by him (the man from Banu Hashim, (the man from Banu Hashim, just before he died) and he (the Hashimi man) said: 'Are you going to attend the Pilgrimage? He said: 'I do not think I will attend it, but perhaps I will attend it.' He said: 'Will you convey a message from me once in your lifetime? He said: 'Yes. 'He said: 'If you attend the pilgrimage, then call out, O family of Quraish! If they respond, then call out, O family of Hashim! If they respond, then ask for Abu Talib, and tell him that so and so killed me for a rope.' Then the hired worker died. When the one who had hired him cam, Abu Talib went to him and said: 'What happened to our companion? He said: 'He fell sick and I took good care of him, but he died, so I stopped and buried him.' He said: 'He deserved that from you. 'Some time passed, then the Yemeni man who had been asked to convey the message arrived at the time of the pilgrimage. He said: 'O family of Quraish! And they said: 'Here is Quraish.' He said: 'O family of Banu Hashim! They said: 'Here is Banu Hashim.' He said\" 'Where is Abu Talib? He said: 'Here is Abu Talib.' He said: 'so and so asked me to convey a message to you, that so and so killed him for a camel's rope.' Abu Talib went to him and said\" 'Choose one of three alternatives that we are offering you. If you wish, you may give us one hundred camels, because you killed our companion by mistake: or if you wish, fifty of your men may swear an oath that you did not kill him; or if you wish, we will kill you in retaliation. 'He went to his people and told them about that, and they said: 'We will swear the oath.' Then a woman from Banu Hashim, who was married to one of their men and had born him a child, came to Abu Talib and said:' O Abu Talib, I wish that my son, who is one of these fifty men, should be excused from having to take the oath., So the excused him. Then one of the men came to him and said: 'O Abu Talib, you want fifty men to take the oath in lieu of one hundred camels, which means that each man may give two camels instead, so here are two camels; take them from me, and do not make me take the oath.' So he accepted them, and did not make him take the oath. Then forty-eight men came and took the oath.\" Ibn 'Abbas said: \"By the One in Whose hand is my soul, by the time a year has passed, none of those forty-eight men remained alive.\"",
      "chain": [
        "11222",
        "30315",
        "20258",
        "11552",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 2
}