{
  "id": "11565",
  "name": "Mansur bin 'Abdur Rahman bin Talha منصور بن عبد الرحمن بن طلحة الحجبي",
  "full_name": "Mansur bin 'Abdur Rahman bin Talha منصور بن عبد الرحمن بن طلحة الحجبي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "138",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.'Abd-al-Dar",
      "al-Hajabi",
      "al-Makki"
    ]
  },
  "parents": [
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "28527",
      "name": "Muhammad bin 'Abdur Rahman bin Talha محمد بن عبد الرحمن بن طلحة بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10656",
      "name": "Musafa' bin 'Abdullah bin Shayba مسافع بن عبد الله بن شيبة بن عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11262",
      "name": "Muhammad bin 'Aabad bin Ja'far محمد بن عباد بن جعفر بن رفاعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20195",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Ubaid عبد الرحمن بن عبد الله بن عبيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "28527",
      "name": "Muhammad bin 'Abdur Rahman bin Talha محمد بن عبد الرحمن بن طلحة بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "23064",
      "name": "Ma'rwf bin Mshkan معروف بن مشكان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20271",
      "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "297",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم الفضل بن دكين، سمع زهيرا، عن منصور ابن صفية، أن أمه، حدثته أن عائشة حدثتها أن النبي صلى الله عليه وسلم كان يتكئ في حجري وأنا حائض، ثم يقرأ القرآن‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to lean on my lap and recite Qur'an while I was in menses.",
      "chain": [
        "20348",
        "20321",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى، قال حدثنا ابن عيينة، عن منصور ابن صفية، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم عن غسلها من المحيض، فأمرها كيف تغتسل قال ‏\"‏ خذي فرصة من مسك فتطهري بها ‏\"‏‏.‏ قالت كيف أتطهر قال ‏\"‏ تطهري بها ‏\"‏‏.‏ قالت كيف قال ‏\"‏ سبحان الله تطهري ‏\"‏‏.‏ فاجتبذتها إلى فقلت تتبعي بها أثر الدم‏.‏",
      "text_en": " Narrated `Aisha:                     A woman asked the Prophet about the bath which is take after finishing from the menses. The Prophet told her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman asked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled her to myself and said, \"Rub the place soiled with blood with it.\"",
      "chain": [
        "30020",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5227",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور ابن صفية، عن أمه، صفية بنت شيبة قالت أولم النبي صلى الله عليه وسلم على بعض نسائه بمدين من شعير‏.‏",
      "text_en": " Narrated Safiyya bint Shaiba:                     The Prophet gave a banquet with two Mudds of barley on marrying some of his wives. (1 Mudd= 1 3/4 of a kilogram) .",
      "chain": [
        "30388",
        "20005",
        "11565",
        "2802"
      ]
    },
    {
      "hadith_no": "5498",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "وقال محمد بن يوسف عن سفيان، عن منصور ابن صفية، حدثتني أمي، عن عائشة  رضى الله عنها  قالت توفي رسول الله صلى الله عليه وسلم وقد شبعنا من الأسودين التمر والماء‏.‏",
      "text_en": "",
      "chain": [
        "30388",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5998",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني أحمد بن المقدام، حدثنا فضيل بن سليمان، حدثنا منصور بن عبد الرحمن، قال حدثتني أمي، عن أسماء بنت أبي بكر  رضى الله عنهما  أن امرأة، جاءت إلى رسول الله صلى الله عليه وسلم فقالت إني أنكحت ابنتي، ثم أصابها شكوى فتمرق رأسها، وزوجها يستحثني بها أفأصل رأسها فسب رسول الله صلى الله عليه وسلم الواصلة والمستوصلة‏.‏",
      "text_en": " Narrated Asma:                     (the daughter of Abu' Bakr) A woman came to Allah's Apostle and said, \"I married my daughter to someone, but she became sick and all her hair fell out, and (because of that) her husband does not like her. May I let her use false hair?\" On that the Prophet cursed such a lady as artificially lengthening (her or someone else's) hair or got her hair lengthened artificially.",
      "chain": [
        "30121",
        "20271",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "7444",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا يحيى، حدثنا ابن عيينة، عن منصور بن صفية، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم‏.‏ حدثنا محمد  هو ابن عقبة  حدثنا الفضيل بن سليمان النميري البصري حدثنا منصور بن عبد الرحمن ابن شيبة حدثتني أمي عن عائشة  رضى الله عنها  أن امرأة سألت النبي صلى الله عليه وسلم عن الحيض كيف تغتسل منه قال ‏\"‏ تأخذين فرصة ممسكة فتوضئين بها ‏\"‏‏.‏ قالت كيف أتوضأ بها يا رسول الله قال النبي صلى الله عليه وسلم ‏\"‏ توضئي ‏\"‏‏.‏ قالت كيف أتوضأ بها يا رسول الله قال النبي صلى الله عليه وسلم ‏\"‏ توضئين بها ‏\"‏‏.‏ قالت عائشة فعرفت الذي يريد رسول الله صلى الله عليه وسلم فجذبتها إلى فعلمتها‏.‏",
      "text_en": " Narrated `Aisha:                     A woman asked the Prophet (Hadith 456).Narrated `Aisha:A woman asked the Prophet about the periods: How to take a bath after the periods. He said, \"Take a perfumed piece of cloth and clean yourself with it.\" She said,' \"How shall I clean myself with it, O Allah's Apostle?\" The Prophet said, \"Clean yourself\" She said again, \"How shall I clean myself, O Allah's Apostle?\" The Prophet said, \"Clean yourself with it.\" Then I knew what Allah's Apostle meant. So I pulled her aside and explained it to her.",
      "chain": [
        "30020",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل، - يعني ابن علية - عن منصور بن عبد الرحمن، عن الشعبي، عن جرير، أنه سمعه يقول ‏\"‏ أيما عبد أبق من مواليه فقد كفر حتى يرجع إليهم ‏\"‏ ‏.‏ قال منصور قد والله روي عن النبي صلى الله عليه وسلم ولكني أكره أن يروى عني ها هنا بالبصرة ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he heard (the Holy Prophet) saying, The slave who fled from his master committed an act of infidelity as long as he would not return to him. Mansur observed:                      By God, this hadith was narrated from the Apostle (may peace and blessings be upon him), but I do not like that this should be narrated on my authority here in Basra.",
      "chain": [
        "20387",
        "20208",
        "11565",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن محمد الناقد، وابن أبي عمر، جميعا عن ابن عيينة، - قال عمرو حدثنا سفيان بن عيينة، - عن منصور ابن صفية، عن أمه، عن عائشة، قالت سألت امرأة النبي صلى الله عليه وسلم كيف تغتسل من حيضتها قال فذكرت أنه علمها كيف تغتسل ثم تأخذ فرصة من مسك فتطهر بها ‏.‏ قالت كيف أتطهر بها قال ‏\"‏ تطهري بها ‏.‏ سبحان الله ‏\"‏ ‏.‏ واستتر - وأشار لنا سفيان بن عيينة بيده على وجهه - قال قالت عائشة واجتذبتها إلى وعرفت ما أراد النبي صلى الله عليه وسلم فقلت تتبعي بها أثر الدم ‏.‏ وقال ابن أبي عمر في روايته فقلت تتبعي بها آثار الدم ‏.‏",
      "text_en": " 'A'isha reported:                      A woman asked the Apostle of Allah (may peace be upon him) how to wash herself after menstruation. She mentioned that he taught her how to take bath and then told her to take a piece of cotton with musk and purify herself. She said: How should I purify myself with that? He (the Holy Prophet) said: Praise be to Allah, purify yourself with it, and covered his face, Sufyan b. 'Uyaina gave a demonstration by covering his face (as the Holy Prophet had done). 'A'isha reported: I dragged her to my side for I had understood what the Apostle of Allah (may peace be upon him) intended and, therefore, said: Apply this cotton with musk to the trace of blood. Ibn 'Umar in his hadith (has mentioned the words of 'A'isha thus): Apply it to the marks of blood.",
      "chain": [
        "30263",
        "30421",
        "20005",
        "11081",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "2144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا ابن جريج، حدثني منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن أسماء بنت أبي بكر، أنها قالت فزع النبي صلى الله عليه وسلم يوما - قالت تعني يوم كسفت الشمس - فأخذ درعا حتى أدرك بردائه فقام للناس قياما طويلا لو أن إنسانا أتى لم يشعر أن النبي صلى الله عليه وسلم ركع ما حدث أنه ركع من طول القيام ‏.‏",
      "text_en": " Asma' bint Abu Bakr said:                      The Apostle of Allah (may peace be upon him) was one day (i. e. on the day when the sun eclipsed) so perturbed that he (in haste) took hold of the outer garment (of a female member of his family) and it was later on that his (own) cloak was sent to him. He stood in prayer along with people for such a long time that if a man came he did not realise that the Apostle of Allah (may peace be upon him) had observed ruku', as it has been narrated about ruku' in connection with long qiyam.",
      "chain": [
        "20226",
        "11070",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "3061",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا روح بن عبادة، حدثنا ابن جريج، حدثني منصور، بن عبد الرحمن عن أمه، صفية بنت شيبة عن أسماء بنت أبي بكر، - رضى الله عنهما - قالت خرجنا محرمين فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏ فلم يكن معي هدى فحللت وكان مع الزبير هدى فلم يحلل ‏.‏ قالت فلبست ثيابي ثم خرجت فجلست إلى الزبير فقال قومي عني ‏.‏ فقلت أتخشى أن أثب عليك.",
      "text_en": " Asma bint Abu Bakr (Allah be pleased with both of them) reported:                      We set out (to Mecca) in a state of Ihram. Allah's Messenger (may peace be upon him) said: He who has the sacrificial animal with him should remain in the state of Ihram, but he who has not the sacrificial animal with him should put off Ihram. As I had not the sacrificial animal with me, I put off Ihram. And since Zubair (her husband) - had the sacrificial animal with him, he did not put off Ihram. She (Asma) said: I put on my clothes and then went out and sat by Zabair, whereupon he said: Go away from me, whereupon I said: Do you fear that I would jump upon you?",
      "chain": [
        "30123",
        "20277",
        "11070",
        "30022",
        "20229",
        "11070",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "3062",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عباس بن عبد العظيم العنبري، حدثنا أبو هشام المغيرة بن سلمة، المخزومي حدثنا وهيب، حدثنا منصور بن عبد الرحمن، عن أمه، عن أسماء بنت أبي بكر، - رضى الله عنهما - قالت قدمنا مع رسول الله صلى الله عليه وسلم مهلين بالحج ‏.‏ ثم ذكر بمثل حديث ابن جريج غير أنه قال فقال استرخي عني استرخي عني ‏.‏ فقلت أتخشى أن أثب عليك .",
      "text_en": " Asma bint Abu Bakr (Allah be pleased with th (m) said:                      We came for Hajj in the state of Ihram with Allah's Messenger (may peace be upon him). The rest of the hadith is the same except (for the words) that he (Zubair) said: Keep away from me, keep away from me, whereupon I said: Do you fear that I will jump upon you?",
      "chain": [
        "30437",
        "20299",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "7645",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا داود بن عبد الرحمن العطار، حدثني منصور، بن عبد الرحمن الحجبي عن أمه، صفية عن عائشة، قالت توفي رسول الله صلى الله عليه وسلم حين شبع الناس من الأسودين التمر والماء ‏.‏",
      "text_en": " 'A'isha reported this hadith through other chains of transmitters also (and the words are) that Allah's Messenger (may peace be upon him) died (in a state) when the people could afford to eat only the dates and water.",
      "chain": [
        "30116",
        "20192",
        "11565",
        "53"
      ]
    },
    {
      "hadith_no": "7646",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الرحمن، عن سفيان، عن منصور بن صفية، عن أمه، عن عائشة، قالت توفي رسول الله صلى الله عليه وسلم وقد شبعنا من الأسودين الماء والتمر ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) had died in a state that they could afford to eat two things only:                      water and dates.",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "260",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن منصور بن عبد الرحمن، عن صفية، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يضع رأسه في حجري فيقرأ وأنا حائض ‏.‏",
      "text_en": " 'Aishah said:                      The Messenger of Allah(ﷺ) would recline on my lap when I was menstruating, then recite the Qur’an.",
      "chain": [
        "28531",
        "20012",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل بن إبراهيم، عن منصور بن عبد الرحمن، عن أبي إسحاق الهمداني، عن الأسود بن يزيد، ‏:‏ أنه دخل على عائشة فسألها عن صلاة، رسول الله صلى الله عليه وسلم بالليل ‏.‏ فقالت ‏:‏ كان يصلي ثلاث عشرة ركعة من الليل، ثم إنه صلى إحدى عشرة ركعة، وترك ركعتين ثم قبض صلى الله عليه وسلم حين قبض وهو يصلي من الليل تسع ركعات، وكان آخر صلاته من الليل الوتر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Al-Aswad ibn Yazid said that he entered upon Aisha and asked her about the prayer of the Messenger of Allah (ﷺ) during the night. She said: He used to pray thirteen rak'ahs during the night. Then he began to pray eleven rak'ahs and left two rak'ahs. When he died, he would pray nine rak'ahs during the night. His last prayer during the night was witr.",
      "chain": [
        "30180",
        "20208",
        "11565",
        "11049",
        "11054"
      ]
    },
    {
      "hadith_no": "253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، عن منصور، - وهو ابن صفية - عن أمه، عن عائشة، رضى الله عنها أن امرأة، سألت النبي صلى الله عليه وسلم عن غسلها من المحيض فأخبرها كيف تغتسل ثم قال ‏\"‏ خذي فرصة من مسك فتطهري بها ‏\"‏ ‏.‏ قالت وكيف أتطهر بها فاستتر كذا ثم قال ‏\"‏ سبحان الله تطهري بها ‏\"‏ ‏.‏ قالت عائشة رضى الله عنها فجذبت المرأة وقلت تتبعين بها أثر الدم ‏.‏",
      "text_en": " It was narrated from 'Aishah that a woman asked the Prophet (ﷺ) about performing Ghusl following menstruation and he told her how to perform Ghusl. Then he said:                      \"Take a piece of cloth perfumed with musk and purify yourself with it.\" She said: \"How should I purify myself with it?\" He covered his face then said: \"Subhan Allah! Purify yourself with it.\" 'Aishah said: \"I took the woman aside and said: 'Wipe away the traces of blood with it.'\"",
      "chain": [
        "20012",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا الحسن بن محمد، قال حدثنا عفان، قال حدثنا وهيب، قال حدثنا منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم قالت يا رسول الله كيف أغتسل عند الطهور قال ‏\"‏ خذي فرصة ممسكة فتوضئي بها ‏\"‏ ‏.‏ قالت كيف أتوضأ بها قال ‏\"‏ توضئي بها ‏\"‏ ‏.‏ قالت كيف أتوضأ بها قالت ثم إن رسول الله صلى الله عليه وسلم سبح وأعرض عنها ففطنت عائشة لما يريد رسول الله صلى الله عليه وسلم قالت فأخذتها وجبذتها إلى فأخبرتها بما يريد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Aishah:                      \"A woman asked the Prophet (ﷺ): 'O Messenger of Allah, how should I perform Ghusl when I become pure?' He said: 'Take a piece of cotton wool scented with musk and clean yourself with it.' She said: 'How should I clean myself with it?' He said: 'Clean yourself with it.' She said: \"How should I clean myself with it?' The Messenger of Allah (ﷺ) said: 'Subhan Allah!' and turned away from her.\" 'Aishah understood what the Messenger of Allah (ﷺ) meant, and said: \"So I pulled her toward me and told her what the Messenger of Allah (ﷺ) meant.\"",
      "chain": [
        "30245",
        "30106",
        "20299",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "1827",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني أحمد بن إسحاق، قال حدثنا وهيب، قال حدثنا منصور ابن صفية، عن أمه، صفية بنت شيبة عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا هلكاكم قول لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'Prompt your dying ones to say La ilaha illahllah (there is none worthy of worship except Allah).\"'",
      "chain": [
        "38088",
        "30289",
        "20299",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "1935",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني أحمد بن إسحاق، قال حدثنا وهيب، قال حدثنا منصور بن عبد الرحمن، عن أمه، عن عائشة، قالت ذكر عند النبي صلى الله عليه وسلم هالك بسوء فقال ‏\"‏ لا تذكروا هلكاكم إلا بخير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Something bad was said in the presence of the Prophet about a person who had died. He said: 'Do not say anything but good about your dead.\"'",
      "chain": [
        "38088",
        "30289",
        "20299",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو هشام، قال حدثنا وهيب بن خالد، عن منصور بن عبد الرحمن، عن أمه، عن أسماء بنت أبي بكر، قالت قدمنا مع رسول الله صلى الله عليه وسلم مهلين بالحج فلما دنونا من مكة قال رسول الله صلى الله عليه وسلم ‏\"‏ من لم يكن معه هدى فليحلل ومن كان معه هدى فليقم على إحرامه ‏\"‏ ‏.‏ قالت وكان مع الزبير هدى فأقام على إحرامه ولم يكن معي هدى فأحللت فلبست ثيابي وتطيبت من طيبي ثم جلست إلى الزبير فقال استأخري عني ‏.‏ فقلت أتخشى أن أثب عليك",
      "text_en": " It was narrated from Asma bint Abi Bakr who said:                     \"We came with the Messenger of Allah reciting the Talbiyah for Hajj. When we drew close to Makkah, the Messenger of Alla said: 'Whoever does not have a Hadi with him, let him exit Ihram. Whoever has a Hadi with him, let him remain in Ihram.' Az-Zubair had a Hadi with him so he remained in Ihram, but I did not have a Hadi with me so I exited Ihram, put on my some of my perfume. Then I sat down with As-Zubair and he said: \"Go away from me.' I said: 'Are you afraid that I am going to jump on you?'\"",
      "chain": [
        "20299",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "677",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا سفيان، عن منصور ابن صفية، عن أمه، عن عائشة، قالت لقد كان رسول الله  صلى الله عليه وسلم  يضع رأسه في حجري وأنا حائض ويقرأ القرآن ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to put his head in my lap when I was menstruating and recite Qur'an.\"",
      "chain": [
        "11222",
        "20121",
        "20012",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "3097",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، أنبأنا ابن جريج، أخبرني منصور بن عبد الرحمن، عن أمه، صفية عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  محرمين فقال النبي  صلى الله عليه وسلم  ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏ قالت ولم يكن معي هدى فأحللت وكان مع الزبير هدى فلم يحل فلبست ثيابي وجئت إلى الزبير فقال قومي عني ‏.‏ فقلت أتخشى أن أثب عليك ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abi Bakr said:                      “We went out with theMessenger of Allah (ﷺ) in Ihram. The Prophet (ﷺ) said: ‘Whoeverhas a sacrificial animal with him, let him remain in Ihram. Whoeverdoes not have a sacrificial animal with him, let him exit Ihram.’Shesaid: ‘I did not have a sacrificial animal with me, so I exitedIhram,but Zubair had a sacrificial animal with him, so he did notexitIhram. So I put on my regular clothes and came to Zubair, and hesaid:‘Go away from me.’ I said: ‘Are you afraid I am going tojump onyou?!’”",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11565",
        "70"
      ]
    },
    {
      "hadith_no": "3803",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن خالد الأزرق أبو مروان، حدثنا الوليد بن مسلم، حدثنا زهير بن محمد، عن منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا رأى ما يحب قال ‏\"‏ الحمد لله الذي بنعمته تتم الصالحات ‏\"‏ ‏.‏ وإذا رأى ما يكره قال ‏\"‏ الحمد لله على كل حال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"When the Messenger of Allah (ﷺ) saw something he liked, he would say: 'Al-hamdu lillahil-ladhi bi ni'matihi tatimmus-salihat (Praise is to Allah by Whose grace good deeds are completed).' And if he saw something that he disliked, he would say: 'Al-hamdu lillahi 'ala kulli hal (Praise is to Allah in all circumstances).'\"",
      "chain": [
        "37540",
        "20733",
        "20394",
        "11565",
        "2802",
        "53"
      ]
    }
  ],
  "total_hadiths": 23
}