{
  "id": "11563",
  "name": "Kathir bin Kathir bin al-Mtlb كثير بن كثير بن المطلب بن أبي وداعة",
  "full_name": "Kathir bin Kathir bin al-Mtlb كثير بن كثير بن المطلب بن أبي وداعة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Sahm",
      "al-Makki"
    ]
  },
  "parents": [
    {
      "id": "13104",
      "name": "Kathir bin al-Mtlb bin Aby كثير بن المطلب بن أبي وداعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "13037",
      "name": "Sa'id bin Kathir bin al-Mtlb سعيد بن كثير بن المطلب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10936",
      "name": "'Abdullah bin Kathir bin al-Mtlb عبد الله بن كثير بن المطلب",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13104",
      "name": "Kathir bin al-Mtlb bin Aby كثير بن المطلب بن أبي وداعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10950",
      "name": "'Ali bin 'Abdullah علي بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "13031",
      "name": "Salm bin 'Abdullah سالم بن عبد الله الخياط",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2368",
      "hadith_no": "2368",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا عبد الرزاق، أخبرنا معمر، عن أيوب، وكثير بن كثير  يزيد أحدهما على الآخر  عن سعيد بن جبير، قال قال ابن عباس  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله أم إسماعيل، لو تركت زمزم  أو قال لو لم تغرف من الماء  لكانت عينا معينا، وأقبل جرهم فقالوا أتأذنين أن ننزل عندك قالت نعم ولا حق لكم في الماء‏.‏ قالوا نعم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah be merciful to the mother of Ishmael! If she had left the water of Zamzam (fountain) as it was, (without constructing a basin for keeping the water), (or said, \"If she had not taken handfuls of its water\"), it would have been a flowing stream. Jurhum (an Arab tribe) came and asked her, 'May we settle at your dwelling?' She said, 'Yes, but you have no right to possess the water.' They agreed.\"",
      "usc_msa_ref": "556",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11015",
        "11563",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3364",
      "hadith_no": "3364",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "وحدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب السختياني، وكثير بن كثير بن المطلب بن أبي وداعة،، يزيد أحدهما على الآخر عن سعيد بن جبير، قال ابن عباس أول ما اتخذ النساء المنطق من قبل أم إسماعيل، اتخذت منطقا لتعفي أثرها على سارة، ثم جاء بها إبراهيم، وبابنها إسماعيل وهى ترضعه حتى وضعهما عند البيت عند دوحة، فوق زمزم في أعلى المسجد، وليس بمكة يومئذ أحد، وليس بها ماء، فوضعهما هنالك، ووضع عندهما جرابا فيه تمر وسقاء فيه ماء، ثم قفى إبراهيم منطلقا فتبعته أم إسماعيل فقالت يا إبراهيم أين تذهب وتتركنا بهذا الوادي الذي ليس فيه إنس ولا شىء فقالت له ذلك مرارا، وجعل لا يلتفت إليها فقالت له آلله الذي أمرك بهذا قال نعم‏.‏ قالت إذا لا يضيعنا‏.‏ ثم رجعت، فانطلق إبراهيم حتى إذا كان عند الثنية حيث لا يرونه استقبل بوجهه البيت، ثم دعا بهؤلاء الكلمات ورفع يديه، فقال ‏{‏ربنا إني أسكنت من ذريتي بواد غير ذي زرع‏}‏ حتى بلغ ‏{‏يشكرون‏}‏‏.‏ وجعلت أم إسماعيل ترضع إسماعيل، وتشرب من ذلك الماء، حتى إذا نفد ما في السقاء عطشت وعطش ابنها، وجعلت تنظر إليه يتلوى  أو قال يتلبط  فانطلقت كراهية أن تنظر إليه، فوجدت الصفا أقرب جبل في الأرض يليها، فقامت عليه ثم استقبلت الوادي تنظر هل ترى أحدا فلم تر أحدا، فهبطت من، الصفا حتى إذا بلغت الوادي رفعت طرف درعها، ثم سعت سعى الإنسان المجهود، حتى جاوزت الوادي، ثم أتت المروة، فقامت عليها ونظرت هل ترى أحدا، فلم تر أحدا، ففعلت ذلك سبع مرات  قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ فذلك سعى الناس بينهما ‏\"‏‏.‏  فلما أشرفت على المروة سمعت صوتا، فقالت صه‏.‏ تريد نفسها، ثم تسمعت، فسمعت أيضا، فقالت قد أسمعت، إن كان عندك غواث‏.‏ فإذا هي بالملك، عند موضع زمزم، فبحث بعقبه  أو قال بجناحه  حتى ظهر الماء، فجعلت تحوضه وتقول بيدها هكذا، وجعلت تغرف من الماء في سقائها، وهو يفور بعد ما تغرف  قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله أم إسماعيل لو تركت زمزم  أو قال لو لم تغرف من الماء  لكانت زمزم عينا معينا ‏\"‏‏.‏  قال فشربت وأرضعت ولدها، فقال لها الملك لا تخافوا الضيعة، فإن ها هنا بيت الله، يبني هذا الغلام، وأبوه، وإن الله لا يضيع أهله‏.‏ وكان البيت مرتفعا من الأرض كالرابية، تأتيه السيول فتأخذ عن يمينه وشماله، فكانت كذلك، حتى مرت بهم رفقة من جرهم  أو أهل بيت من جرهم  مقبلين من طريق كداء فنزلوا في أسفل مكة، فرأوا طائرا عائفا‏.‏ فقالوا إن هذا الطائر ليدور على ماء، لعهدنا بهذا الوادي وما فيه ماء، فأرسلوا جريا أو جريين، فإذا هم بالماء، فرجعوا فأخبروهم بالماء، فأقبلوا، قال وأم إسماعيل عند الماء فقالوا أتأذنين لنا أن ننزل عندك فقالت نعم، ولكن لا حق لكم في الماء‏.‏ قالوا نعم‏.‏ قال ابن عباس قال النبي صلى الله عليه وسلم ‏\"‏ فألفى ذلك أم إسماعيل، وهى تحب الإنس ‏\"‏ فنزلوا وأرسلوا إلى أهليهم، فنزلوا معهم حتى إذا كان بها أهل أبيات منهم، وشب الغلام، وتعلم العربية منهم، وأنفسهم وأعجبهم حين شب، فلما أدرك زوجوه امرأة منهم، وماتت أم إسماعيل، فجاء إبراهيم، بعد ما تزوج إسماعيل يطالع تركته، فلم يجد إسماعيل، فسأل امرأته عنه فقالت خرج يبتغي لنا‏.‏ ثم سألها عن عيشهم وهيئتهم فقالت نحن بشر، نحن في ضيق وشدة‏.‏ فشكت إليه‏.‏ قال فإذا جاء زوجك فاقرئي عليه السلام، وقولي له يغير عتبة بابه‏.‏ فلما جاء إسماعيل، كأنه آنس شيئا، فقال هل جاءكم من أحد قالت نعم، جاءنا شيخ كذا وكذا، فسألنا عنك فأخبرته، وسألني كيف عيشنا فأخبرته أنا في جهد وشدة‏.‏ قال فهل أوصاك بشىء قالت نعم، أمرني أن أقرأ عليك السلام، ويقول غير عتبة بابك‏.‏ قال ذاك أبي وقد أمرني أن أفارقك الحقي بأهلك‏.‏ فطلقها، وتزوج منهم أخرى، فلبث عنهم إبراهيم ما شاء الله ثم أتاهم بعد، فلم يجده، فدخل على امرأته، فسألها عنه‏.‏ فقالت خرج يبتغي لنا‏.‏ قال كيف أنتم وسألها عن عيشهم، وهيئتهم‏.‏ فقالت نحن بخير وسعة‏.‏ وأثنت على الله‏.‏ فقال ما طعامكم قالت اللحم‏.‏ قال فما شرابكم قالت الماء‏.‏ فقال اللهم بارك لهم في اللحم والماء‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ولم يكن لهم يومئذ حب، ولو كان لهم دعا لهم فيه ‏\"‏‏.‏ قال فهما لا يخلو عليهما أحد بغير مكة إلا لم يوافقاه‏.‏ قال فإذا جاء زوجك فاقرئي عليه السلام، ومريه يثبت عتبة بابه، فلما جاء إسماعيل قال هل أتاكم من أحد قالت نعم أتانا شيخ حسن الهيئة، وأثنت عليه، فسألني عنك فأخبرته، فسألني كيف عيشنا فأخبرته أنا بخير‏.‏ قال فأوصاك بشىء قالت نعم، هو يقرأ عليك السلام، ويأمرك أن تثبت عتبة بابك‏.‏ قال ذاك أبي، وأنت العتبة، أمرني أن أمسكك‏.‏ ثم لبث عنهم ما شاء الله، ثم جاء بعد ذلك، وإسماعيل يبري نبلا له تحت دوحة قريبا من زمزم، فلما رآه قام إليه، فصنعا كما يصنع الوالد بالولد والولد بالوالد، ثم قال يا إسماعيل، إن الله أمرني بأمر‏.‏ قال فاصنع ما أمرك ربك‏.‏ قال وتعينني قال وأعينك‏.‏ قال فإن الله أمرني أن أبني ها هنا بيتا‏.‏ وأشار إلى أكمة مرتفعة على ما حولها‏.‏ قال فعند ذلك رفعا القواعد من البيت، فجعل إسماعيل يأتي بالحجارة، وإبراهيم يبني، حتى إذا ارتفع البناء جاء بهذا الحجر فوضعه له، فقام عليه وهو يبني، وإسماعيل يناوله الحجارة، وهما يقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏‏.‏ قال فجعلا يبنيان حتى يدورا حول البيت، وهما يقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first lady to use a girdle was the mother of Ishmael. She used a girdle so that she might hide her tracks from Sarah. Abraham brought her and her son Ishmael while she was suckling him, to a place near the Ka`ba under a tree on the spot of Zamzam, at the highest place in the mosque. During those days there was nobody in Mecca, nor was there any water So he made them sit over there and placed near them a leather bag containing some dates, and a small water-skin containing some water, and set out homeward. Ishmael's mother followed him saying, \"O Abraham! Where are you going, leaving us in this valley where there is no person whose company we may enjoy, nor is there anything (to enjoy)?\" She repeated that to him many times, but he did not look back at her Then she asked him, \"Has Allah ordered you to do so?\" He said, \"Yes.\" She said, \"Then He will not neglect us,\" and returned while Abraham proceeded onwards, and on reaching the Thaniya where they could not see him, he faced the Ka`ba, and raising both hands, invoked Allah saying the following prayers: 'O our Lord! I have made some of my offspring dwell in a valley without cultivation, by Your Sacred House (Ka`ba at Mecca) in order, O our Lord, that they may offer prayer perfectly. So fill some hearts among men with love towards them, and (O Allah) provide them with fruits, so that they may give thanks.' (14.37) Ishmael's mother went on suckling Ishmael and drinking from the water (she had). When the water in the water-skin had all been used up, she became thirsty and her child also became thirsty. She started looking at him (i.e. Ishmael) tossing in agony; She left him, for she could not endure looking at him, and found that the mountain of Safa was the nearest mountain to her on that land. She stood on it and started looking at the valley keenly so that she might see somebody, but she could not see anybody. Then she descended from Safa and when she reached the valley, she tucked up her robe and ran in the valley like a person in distress and trouble, till she crossed the valley and reached the Marwa mountain where she stood and started looking, expecting to see somebody, but she could not see anybody. She repeated that (running between Safa and Marwa) seven times.\" The Prophet said, \"This is the source of the tradition of the walking of people between them (i.e. Safa and Marwa). When she reached the Marwa (for the last time) she heard a voice and she asked herself to be quiet and listened attentively. She heard the voice again and said, 'O, (whoever you may be)! You have made me hear your voice; have you got something to help me?\" And behold! She saw an angel at the place of Zamzam, digging the earth with his heel (or his wing), till water flowed from that place. She started to make something like a basin around it, using her hand in this way, and started filling her water-skin with water with her hands, and the water was flowing out after she had scooped some of it.\" The Prophet added, \"May Allah bestow Mercy on Ishmael's mother! Had she let the Zamzam (flow without trying to control it) (or had she not scooped from that water) (to fill her water-skin), Zamzam would have been a stream flowing on the surface of the earth.\" The Prophet further added, \"Then she drank (water) and suckled her child. The angel said to her, 'Don't be afraid of being neglected, for this is the House of Allah which will be built by this boy and his father, and Allah never neglects His people.' The House (i.e. Ka`ba) at that time was on a high place resembling a hillock, and when torrents came, they flowed to its right and left. She lived in that way till some people from the tribe of Jurhum or a family from Jurhum passed by her and her child, as they (i.e. the Jurhum people) were coming through the way of Kada'. They landed in the lower part of Mecca where they saw a bird that had the habit of flying around water and not leaving it. They said, 'This bird must be flying around water, though we know that there is no water in this valley.' They sent one or two messengers who discovered the source of water, and returned to inform them of the water. So, they all came (towards the water).\" The Prophet added, \"Ishmael's mother was sitting near the water. They asked her, 'Do you allow us to stay with you?\" She replied, 'Yes, but you will have no right to possess the water.' They agreed to that.\" The Prophet further said, \"Ishmael's mother was pleased with the whole situation as she used to love to enjoy the company of the people. So, they settled there, and later on they sent for their families who came and settled with them so that some families became permanent residents there. The child (i.e. Ishmael) grew up and learnt Arabic from them and (his virtues) caused them to love and admire him as he grew up, and when he reached the age of puberty they made him marry a woman from amongst them. After Ishmael's mother had died, Abraham came after Ishmael's marriage in order to see his family that he had left before, but he did not find Ishmael there. When he asked Ishmael's wife about him, she replied, 'He has gone in search of our livelihood.' Then he asked her about their way of living and their condition, and she replied, 'We are living in misery; we are living in hardship and destitution,' complaining to him. He said, 'When your husband returns, convey my salutation to him and tell him to change the threshold of the gate (of his house).' When Ishmael came, he seemed to have felt something unusual, so he asked his wife, 'Has anyone visited you?' She replied, 'Yes, an old man of so-and-so description came and asked me about you and I informed him, and he asked about our state of living, and I told him that we were living in a hardship and poverty.' On that Ishmael said, 'Did he advise you anything?' She replied, 'Yes, he told me to convey his salutation to you and to tell you to change the threshold of your gate.' Ishmael said, 'It was my father, and he has ordered me to divorce you. Go back to your family.' So, Ishmael divorced her and married another woman from amongst them (i.e. Jurhum). Then Abraham stayed away from them for a period as long as Allah wished and called on them again but did not find Ishmael. So he came to Ishmael's wife and asked her about Ishmael. She said, 'He has gone in search of our livelihood.' Abraham asked her, 'How are you getting on?' asking her about their sustenance and living. She replied, 'We are prosperous and well-off (i.e. we have everything in abundance).' Then she thanked Allah' Abraham said, 'What kind of food do you eat?' She said. 'Meat.' He said, 'What do you drink?' She said, 'Water.\" He said, \"O Allah! Bless their meat and water.\" The Prophet added, \"At that time they did not have grain, and if they had grain, he would have also invoked Allah to bless it.\" The Prophet added, \"If somebody has only these two things as his sustenance, his health and disposition will be badly affected, unless he lives in Mecca.\" The Prophet added,\" Then Abraham said Ishmael's wife, \"When your husband comes, give my regards to him and tell him that he should keep firm the threshold of his gate.' When Ishmael came back, he asked his wife, 'Did anyone call on you?' She replied, 'Yes, a good-looking old man came to me,' so she praised him and added. 'He asked about you, and I informed him, and he asked about our livelihood and I told him that we were in a good condition.' Ishmael asked her, 'Did he give you any piece of advice?' She said, 'Yes, he told me to give his regards to you and ordered that you should keep firm the threshold of your gate.' On that Ishmael said, 'It was my father, and you are the threshold (of the gate). He has ordered me to keep you with me.' Then Abraham stayed away from them for a period as long as Allah wished, and called on them afterwards. He saw Ishmael under a tree near Zamzam, sharpening his arrows. When he saw Abraham, he rose up to welcome him (and they greeted each other as a father does with his son or a son does with his father). Abraham said, 'O Ishmael! Allah has given me an order.' Ishmael said, 'Do what your Lord has ordered you to do.' Abraham asked, 'Will you help me?' Ishmael said, 'I will help you.' Abraham said, Allah has ordered me to build a house here,' pointing to a hillock higher than the land surrounding it.\" The Prophet added, \"Then they raised the foundations of the House (i.e. the Ka`ba). Ishmael brought the stones and Abraham was building, and when the walls became high, Ishmael brought this stone and put it for Abraham who stood over it and carried on building, while Ishmael was handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.' The Prophet added, \"Then both of them went on building and going round the Ka`ba saying: O our Lord ! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.\" (2.127)",
      "usc_msa_ref": "583",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11015",
        "11563",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-3365",
      "hadith_no": "3365",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر عبد الملك بن عمرو، قال حدثنا إبراهيم بن نافع، عن كثير بن كثير، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما كان بين إبراهيم وبين أهله ما كان، خرج بإسماعيل وأم إسماعيل، ومعهم شنة فيها ماء، فجعلت أم إسماعيل تشرب من الشنة فيدر لبنها على صبيها حتى قدم مكة، فوضعها تحت دوحة، ثم رجع إبراهيم إلى أهله، فاتبعته أم إسماعيل، حتى لما بلغوا كداء نادته من ورائه يا إبراهيم إلى من تتركنا قال إلى الله‏.‏ قالت رضيت بالله‏.‏ قال فرجعت فجعلت تشرب من الشنة ويدر لبنها على صبيها، حتى لما فني الماء قالت لو ذهبت فنظرت لعلي أحس أحدا‏.‏ قال فذهبت فصعدت الصفا فنظرت ونظرت هل تحس أحدا فلم تحس أحدا، فلما بلغت الوادي سعت وأتت المروة ففعلت ذلك أشواطا، ثم قالت لو ذهبت فنظرت ما فعل  تعني الصبي  فذهبت فنظرت، فإذا هو على حاله كأنه ينشغ للموت، فلم تقرها نفسها، فقالت لو ذهبت فنظرت لعلي أحس أحدا، فذهبت فصعدت الصفا فنظرت ونظرت فلم تحس أحدا، حتى أتمت سبعا، ثم قالت لو ذهبت فنظرت ما فعل، فإذا هي بصوت فقالت أغث إن كان عندك خير‏.‏ فإذا جبريل، قال فقال بعقبه هكذا، وغمز عقبه على الأرض، قال فانبثق الماء، فدهشت أم إسماعيل فجعلت تحفز‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ لو تركته كان الماء ظاهرا ‏\"‏‏.‏ قال فجعلت تشرب من الماء، ويدر لبنها على صبيها  قال  فمر ناس من جرهم ببطن الوادي، فإذا هم بطير، كأنهم أنكروا ذاك، وقالوا ما يكون الطير إلا على ماء‏.‏ فبعثوا رسولهم، فنظر فإذا هم بالماء، فأتاهم فأخبرهم فأتوا إليها، فقالوا يا أم إسماعيل، أتأذنين لنا أن نكون معك أو نسكن معك فبلغ ابنها فنكح فيهم امرأة، قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فسلم فقال أين إسماعيل فقالت امرأته ذهب يصيد‏.‏ قال قولي له إذا جاء غير عتبة بابك‏.‏ فلما جاء أخبرته قال أنت ذاك فاذهبي إلى أهلك‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فقال أين إسماعيل فقالت امرأته ذهب يصيد، فقالت ألا تنزل فتطعم وتشرب فقال وما طعامكم وما شرابكم قالت طعامنا اللحم، وشرابنا الماء‏.‏ قال اللهم بارك لهم في طعامهم وشرابهم‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ بركة بدعوة إبراهيم ‏\"‏‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ فجاء فوافق إسماعيل من وراء زمزم، يصلح نبلا له، فقال يا إسماعيل، إن ربك أمرني أن أبني له بيتا‏.‏ قال أطع ربك‏.‏ قال إنه قد أمرني أن تعينني عليه‏.‏ قال إذا أفعل‏.‏ أو كما قال‏.‏ قال فقاما فجعل إبراهيم يبني، وإسماعيل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏ قال حتى ارتفع البناء وضعف الشيخ على نقل الحجارة، فقام على حجر المقام، فجعل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abraham had differences with his wife), (because of her jealousy of Hajar, Ishmael's mother), he took Ishmael and his mother and went away. They had a water-skin with them containing some water, Ishmael's mother used to drink water from the water-skin so that her milk would increase for her child. When Abraham reached Mecca, he made her sit under a tree and afterwards returned home. Ishmael's mother followed him, and when they reached Kada', she called him from behind, 'O Abraham! To whom are you leaving us?' He replied, '(I am leaving you) to Allah's (Care).' She said, 'I am satisfied to be with Allah.' She returned to her place and started drinking water from the water-skin, and her milk increased for her child. When the water had all been used up, she said to herself, 'I'd better go and look so that I may see somebody.' She ascended the Safa mountain and looked, hoping to see somebody, but in vain. When she came down to the valley, she ran till she reached the Marwa mountain. She ran to and fro (between the two mountains) many times. They she said to herself, 'i'd better go and see the state of the child,' she went and found it in a state of one on the point of dying. She could not endure to watch it dying and said (to herself), 'If I go and look, I may find somebody.' She went and ascended the Safa mountain and looked for a long while but could not find anybody. Thus she completed seven rounds (of running) between Safa and Marwa. Again she said (to herself), 'I'd better go back and see the state of the child.' But suddenly she heard a voice, and she said to that strange voice, 'Help us if you can offer any help.' Lo! It was Gabriel (who had made the voice). Gabriel hit the earth with his heel like this (Ibn `Abbas hit the earth with his heel to Illustrate it), and so the water gushed out. Ishmael's mother was astonished and started digging. (Abu Al-Qasim) (i.e. the Prophet) said, \"If she had left the water, (flow naturally without her intervention), it would have been flowing on the surface of the earth.\") Ishmael's mother started drinking from the water and her milk increased for her child . Afterwards some people of the tribe of Jurhum, while passing through the bottom of the valley, saw some birds, and that astonished them, and they said, 'Birds can only be found at a place where there is water.' They sent a messenger who searched the place and found the water, and returned to inform them about it. Then they all went to her and said, 'O ishmael's mother! Will you allow us to be with you (or dwell with you)?' (And thus they stayed there.) Later on her boy reached the age of puberty and married a lady from them. Then an idea occurred to Abraham which he disclosed to his wife (Sarah), 'I want to call on my dependents I left (at Mecca).' When he went there, he greeted (Ishmael's wife) and said, 'Where is Ishmael?' She replied, 'He has gone out hunting.' Abraham said (to her), 'When he comes, tell him to change the threshold of his gate.' When he came, she told him the same whereupon Ishmael said to her, 'You are the threshold, so go to your family (i.e. you are divorced).' Again Abraham thought of visiting his dependents whom he had left (at Mecca), and he told his wife (Sarah) of his intentions. Abraham came to Ishmael's house and asked. \"Where is Ishmael?\" Ishmael's wife replied, \"He has gone out hunting,\" and added, \"Will you stay (for some time) and have something to eat and drink?' Abraham asked, 'What is your food and what is your drink?' She replied, 'Our food is meat and our drink is water.' He said, 'O Allah! Bless their meals and their drink.\" Abu Al-Qa-sim (i.e. Prophet) said, \"Because of Abraham's invocation there are blessings (in Mecca).\" Once more Abraham thought of visiting his family he had left (at Mecca), so he told his wife (Sarah) of his decision. He went and found Ishmael behind the Zamzam well, mending his arrows. He said, \"O Ishmael, Your Lord has ordered me to build a house for Him.\" Ishmael said, \"Obey (the order of) your Lord.\" Abraham said, \"Allah has also ordered me that you should help me therein.\" Ishmael said, \"Then I will do.\" So, both of them rose and Abraham started building (the Ka`ba) while Ishmael went on handing him the stones, and both of them were saying, \"O our Lord ! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.\" (2.127). When the building became high and the old man (i.e. Abraham) could no longer lift the stones (to such a high position), he stood over the stone of Al- Maqam and Ishmael carried on handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) from us, Verily You are All-Hearing, All-Knowing.\" (2.127)",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20443",
        "20189",
        "11563",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2016",
      "hadith_no": "2016",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان بن عيينة، حدثني كثير بن كثير بن المطلب بن أبي وداعة، عن بعض، أهلي عن جده، أنه رأى النبي صلى الله عليه وسلم يصلي مما يلي باب بني سهم والناس يمرون بين يديه وليس بينهما سترة ‏.‏ قال سفيان ليس بينه وبين الكعبة سترة ‏.‏ قال سفيان كان ابن جريج أخبرنا عنه قال أخبرنا كثير عن أبيه قال فسألته فقال ليس من أبي سمعته ولكن من بعض أهلي عن جدي ‏.‏",
      "text_en": " Narrated Kathir b. Kathir b. al-Muttalib b. Abi Wida'ahFrom his people on the authority of his grandfather:                      He saw that the Prophet (ﷺ) was praying at the place adjacent to the gate of Banu Sahm and the people were passing before him, and there was no covering (sutrah) between them. The narrator Sufyan said: There was no covering between him and the Ka'bah.Sufyan said: Ibn Juraij reported us stating that Kathir reported on the authority of his father saying: I did not hear my father say, but I heard some of my people on the authority of my grandfather.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20005",
        "11563"
      ]
    },
    {
      "id": "sunan-an-nasai-758",
      "hadith_no": "758",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، قال حدثنا عبد الملك بن عبد العزيز بن جريج، عن كثير بن كثير، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم طاف بالبيت سبعا ثم صلى ركعتين بحذائه في حاشية المقام وليس بينه وبين الطواف أحد ‏.‏",
      "text_en": " Narrated Kathir bin Kathir:                     It was narrated from Kathir bin Kathir, from his father, that his grandfather said: \"I saw the Messenger of Allsh(ﷺ) circumambulate the House seven times, then he prayed two Rak'ahs at the edge of the Maqam, and there was nothing between him and the people who were performing Tawaf.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20347",
        "11563",
        "13104"
      ]
    },
    {
      "id": "sunan-an-nasai-2959",
      "hadith_no": "2959",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن يحيى، عن ابن جريج، عن كثير بن كثير، عن أبيه، عن المطلب بن أبي وداعة، قال رأيت النبي صلى الله عليه وسلم حين فرغ من سبعه جاء حاشية المطاف فصلى ركعتين وليس بينه وبين الطوافين أحد ‏.‏",
      "text_en": " It was narrated that Al-Muttalib bin Wadaah said:                     \"I saw the Prophet when he had completed his seven (circuits of Tawaf); he came to the edge of the Mataf and prayed two Rakahs, with nothing in between him and people who were circumambulating.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20031",
        "11070",
        "11563",
        "13104",
        "5295"
      ]
    },
    {
      "id": "sunan-ibn-majah-3071",
      "hadith_no": "3071",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن ابن جريج، عن كثير بن كثير بن المطلب بن أبي وداعة السهمي، عن أبيه، عن المطلب، قال رأيت رسول الله  صلى الله عليه وسلم  إذا فرغ من سبعه جاء حتى يحاذي بالركن فصلى ركعتين فى حاشية المطاف وليس بينه وبين الطواف أحد ‏.‏ قال ابن ماجه هذا بمكة خاصة ‏.‏",
      "text_en": " It wasnarrated that Muttalib said:                      “When he finished seven (circuitsofTawaf), I saw the Messenger of Allah (ﷺ) come until he wasparallelwith the Corner, then he prayed two Rak’ah at the edge of theMataf(area for Tawaf), and there was nothing between him and thepeoplewho were performing Tawaf.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "11070",
        "11563",
        "13104"
      ]
    }
  ],
  "total_hadiths": 7
}