{
  "id": "11566",
  "name": "Hisham bin Hjyr هشام بن حجير",
  "full_name": "Hisham bin Hjyr هشام بن حجير",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  م  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20674",
      "name": "Muhammad bin Muslim al-Ta'ifi محمد بن مسلم بن سوسن الطائفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11559",
      "name": "Shabl bin 'Aabad al-Makki شبل بن عباد المكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-6805",
      "hadith_no": "6805",
      "source": "Sahih Bukhari",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن هشام بن حجير، عن طاوس، سمع أبا هريرة، قال قال سليمان لأطوفن الليلة على تسعين امرأة، كل تلد غلاما يقاتل في سبيل الله‏.‏ فقال له صاحبه  قال سفيان يعني الملك  قل إن شاء الله‏.‏ فنسي، فطاف بهن، فلم تأت امرأة منهن بولد، إلا واحدة بشق غلام‏.‏ فقال أبو هريرة يرويه قال ‏\"‏ لو قال إن شاء الله، لم يحنث وكان دركا في حاجته ‏\"‏‏.‏ وقال مرة قال رسول الله صلى الله عليه وسلم ‏\"‏ لو استثنى ‏\"‏‏.‏ وحدثنا أبو الزناد عن الأعرج مثل حديث أبي هريرة‏.‏",
      "text_en": " Narrated Abu Huraira:                     (The Prophet) Solomon said, \"Tonight I will sleep with (my) ninety wives, each of whom will get a male child who will fight for Allah's Cause.\" On that, his companion (Sufyan said that his companion was an angel) said to him, \"Say, \"If Allah will (Allah willing).\" But Solomon forgot (to say it). He slept with all his wives, but none of the women gave birth to a child, except one who gave birth to a halfboy. Abu Huraira added: The Prophet said, \"If Solomon had said, \"If Allah will\" (Allah willing), he would not have been unsuccessful in his action, and would have attained what he had desired.\" Once Abu Huraira added: Allah apostle said, \"If he had accepted.\"",
      "usc_msa_ref": "711",
      "chain": [
        "30026",
        "20005",
        "11566",
        "11053",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-19",
      "hadith_no": "19",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن عباد، وسعيد بن عمرو الأشعثي، جميعا عن ابن عيينة، - قال سعيد أخبرنا سفيان، - عن هشام بن حجير، عن طاوس، قال جاء هذا إلى ابن عباس - يعني بشير بن كعب - فجعل يحدثه فقال له ابن عباس عد لحديث كذا وكذا ‏.‏ فعاد له ثم حدثه فقال له عد لحديث كذا وكذا ‏.‏ فعاد له فقال له ما أدري أعرفت حديثي كله وأنكرت هذا أم أنكرت حديثي كله وعرفت هذا فقال له ابن عباس إنا كنا نحدث عن رسول الله صلى الله عليه وسلم إذ لم يكن يكذب عليه فلما ركب الناس الصعب والذلول تركنا الحديث عنه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "11509",
        "20005",
        "11168",
        "20012",
        "11566",
        "11053"
      ]
    },
    {
      "id": "sahih-muslim-23",
      "hadith_no": "23",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن هشام بن حجير، عن طاوس، قال أتي ابن عباس بكتاب فيه قضاء علي - رضى الله عنه - فمحاه إلا قدر ‏.‏ وأشار سفيان بن عيينة بذراعه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20005",
        "11566",
        "11053"
      ]
    },
    {
      "id": "sahih-muslim-3080",
      "hadith_no": "3080",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن هشام بن حجير، عن طاوس، قال قال ابن عباس قال لي معاوية أعلمت أني قصرت من رأس رسول الله صلى الله عليه وسلم عند المروة بمشقص فقلت له لا أعلم هذا إلا حجة عليك ‏.‏",
      "text_en": " Ibn Abbas reported that Mu'awiya had said to them:                      Do you know that I clipped some hair from the head of Allah's Messenger (may peace be upon him) at al- Marwa with the help of a clipper? I said: I do not know it except as it verdict against you.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20005",
        "11566",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-4376",
      "hadith_no": "4376",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن عباد، وابن أبي عمر، - واللفظ لابن أبي عمر - قالا حدثنا سفيان، عن هشام بن حجير، عن طاوس، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود نبي الله لأطوفن الليلة على سبعين امرأة كلهن تأتي بغلام يقاتل في سبيل الله ‏.‏ فقال له صاحبه أو الملك قل إن شاء الله ‏.‏ فلم يقل ونسي ‏.‏ فلم تأت واحدة من نسائه إلا واحدة جاءت بشق غلام ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ولو قال إن شاء الله ‏.‏ لم يحنث وكان دركا له في حاجته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Prophet (may peace be upon him) as saying that Sulaiman b. Dawud, the Apostle of Allah, observed:                      I will have an intercourse with seventy wives during the night; all of them will give birth to a male child who will fight in the cause of Allah. His companion or the ang I said to him: Say,\" If God wills.\" But he (Hadrat Sulaimin) did not say so, and he forgot it. And none of his wives gave birth to a child, but one who gave birth to a premature child. Allah's Messenger (may peace be upon him) said: Had he said Insha' Allah (if God so will). he would not have failed and his desire would have been materialised.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "30421",
        "20005",
        "11566",
        "11053",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-574",
      "hadith_no": "574",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا سفيان، عن هشام بن حجير، عن طاوس، عن ابن عباس، أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد العصر ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) forbade praying after 'Asr.",
      "usc_msa_ref": "",
      "chain": [
        "38011",
        "20005",
        "11566",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2737",
      "hadith_no": "2737",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، عن هشام بن حجير، عن طاوس، قال قال معاوية لابن عباس أعلمت أني قصرت من رأس رسول الله صلى الله عليه وسلم عند المروة قال لا ‏.‏ يقول ابن عباس هذا معاوية ينهى الناس عن المتعة وقد تمتع النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Tawus said:                     \"Mu'awiyah saide to Ibmn 'Abbas: \"do you know that I cut the hair of the Messenger of Allah at Al-Marwah?\" He said: \"No.\" Ibn 'Abbas said: \"This Mu'awiyah forbids the people to perform Tamattu' but the Prophet performed Tamattue.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11566",
        "11053"
      ]
    }
  ],
  "total_hadiths": 7
}