{
  "id": "11571",
  "name": "Sa'id bin Marjana سعيد بن مرجانة",
  "full_name": "Sa'id bin Marjana سعيد بن مرجانة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "97",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hijaz"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  خد  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Ally B.'Amir",
      "Client",
      "al-Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11544",
      "name": "Waqid bin Muhammad bin Zayd واقد بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11828",
      "name": "Isma'il bin Abi Hkym إسماعيل بن أبي حكيم القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2517",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عاصم بن محمد، قال حدثني واقد بن محمد، قال حدثني سعيد ابن مرجانة، صاحب علي بن حسين قال لي أبو هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أيما رجل أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏‏.‏ قال سعيد ابن مرجانة فانطلقت إلى علي بن حسين فعمد علي بن حسين  رضى الله عنهما  إلى عبد له قد أعطاه به عبد الله بن جعفر عشرة آلاف درهم  أو ألف دينار  فأعتقه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever frees a Muslim slave, Allah will save all the parts of his body from the (Hell) Fire as he has freed the body-parts of the slave.\" Sa`id bin Marjana said that he narrated that Hadith to `Ali bin Al-Husain and he freed his slave for whom `Abdullah bin Ja`far had offered him ten thousand Dirhams or one-thousand Dinars.",
      "chain": [
        "30184",
        "20163",
        "11544",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "6800",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن أبي غسان، محمد بن مطرف عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة مسلمة، أعتق الله بكل عضو منه عضوا من النار، حتى فرجه بفرجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of his body for freeing the corresponding parts of the slave's body, even his private parts will be saved from the Fire) because of freeing the slave's private parts.\"",
      "chain": [
        "30272",
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "3868",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا يحيى بن سعيد، عن عبد الله بن سعيد، - وهو ابن أبي هند - حدثني إسماعيل بن أبي حكيم، عن سعيد ابن مرجانة، عن أبي، هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة مؤمنة أعتق الله بكل إرب منها إربا منه من النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      If anyone emancipates a Muslim slave, Allah will set free from Hell an organ of his body for every organ of his (slave's) body.",
      "chain": [
        "30170",
        "20031",
        "11184",
        "11828",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "3869",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن محمد بن مطرف أبي غسان، المدني عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة أعتق الله بكل عضو منها عضوا من أعضائه من النار حتى فرجه بفرجه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace benpon him) as saying:                      He who emancipates a slave, Allah will set free from Hell every limb (of his body) for every limb of his (slave's) body, even his private parts.",
      "chain": [
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "3870",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن الهاد، عن عمر بن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة أعتق الله بكل عضو منه عضوا من النار حتى يعتق فرجه بفرجه‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      I heard Allah's Messenger (may peace be upon him) as saying: He who emancipates a believing slave. Allah will set free from Fire his every limb for every limb of his (slave's), even his private parts for his.",
      "chain": [
        "30367",
        "20023",
        "11234",
        "20265",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "3871",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا عاصم، - وهو ابن محمد العمري - حدثنا واقد، - يعني أخاه - حدثني سعيد ابن مرجانة، - صاحب علي بن حسين - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ مسلم أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏ ‏.‏ قال فانطلقت حين سمعت الحديث من أبي هريرة فذكرته لعلي بن الحسين فأعتق عبدا له قد أعطاه به ابن جعفر عشرة آلاف درهم أو ألف دينار ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id b. Marjana said: When I heard this hadith from Abu Huraira (Allah be pleased with him), I went away and made a mention of it to 'Ali b. Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars.",
      "chain": [
        "30430",
        "20212",
        "20163",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "1541",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن عمر بن علي بن الحسين بن علي بن أبي طالب، عن سعيد ابن مرجانة، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة أعتق الله منه بكل عضو منه عضوا من النار حتى يعتق فرجه بفرجه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعمرو بن عبسة وابن عباس وواثلة بن الأسقع وأبي أمامة وعقبة بن عامر وكعب بن مرة ‏.‏ قال أبو عيسى حديث أبي هريرة هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وابن الهاد اسمه يزيد بن عبد الله بن أسامة بن الهاد وهو مدني ثقة قد روى عنه مالك بن أنس وغير واحد من أهل العلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"I heard the Messenger of Allah (ﷺ) saying: 'Whoever frees a believing slave, then Allah frees a limb from the Fire for each of his limbs, such that he frees his private parts in lieu of his private parts.'\"",
      "chain": [
        "30367",
        "20023",
        "11234",
        "20265",
        "11571",
        "13"
      ]
    }
  ],
  "total_hadiths": 7
}