{
  "id": "11574",
  "name": "al-Azrq bin Qays al-Harithy الأزرق بن قيس الحارثي",
  "full_name": "al-Azrq bin Qays al-Harithy الأزرق بن قيس الحارثي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  -  ثقة ]"
    ],
    "tags": [
      "B.Haritha",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "227",
      "name": "Abu Burzah al-Aslami ( أبو برزة الأسلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14179",
      "name": "Shryk bin Shhab al-Harithy شريك بن شهاب الحارثي البصري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25316",
      "name": "al-Mnhal bin Khlyfh المنهال بن خليفة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1211",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الأزرق بن قيس، قال كنا بالأهواز نقاتل الحرورية، فبينا أنا على جرف نهر إذا رجل يصلي، وإذا لجام دابته بيده فجعلت الدابة تنازعه، وجعل يتبعها  قال شعبة  هو أبو برزة الأسلمي  فجعل رجل من الخوارج يقول اللهم افعل بهذا الشيخ‏.‏ فلما انصرف الشيخ قال إني سمعت قولكم، وإني غزوت مع رسول الله صلى الله عليه وسلم ست غزوات أو سبع غزوات وثمانيا، وشهدت تيسيره، وإني أن كنت أن أراجع مع دابتي أحب إلى من أن أدعها ترجع إلى مألفها فيشق على‏.‏",
      "text_en": " Narrated Al-Azraq bin Qais:                     We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was praying and the reins of his animal were in his hands and the animal was struggling and he was following the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami). A man from the Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his prayer, he said, \"I heard your remark. No doubt, I participated with Allah's Apostle in six or seven or eight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return to its stable, as it would cause me much trouble. \"",
      "chain": [
        "20404",
        "20020",
        "11574"
      ]
    },
    {
      "hadith_no": "6195",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن الأزرق بن قيس، قال كنا على شاطئ نهر بالأهواز قد نضب عنه الماء، فجاء أبو برزة الأسلمي على فرس، فصلى وخلى فرسه، فانطلقت الفرس، فترك صلاته وتبعها حتى أدركها، فأخذها ثم جاء فقضى صلاته، وفينا رجل له رأى، فأقبل يقول انظروا إلى هذا الشيخ ترك صلاته من أجل فرس‏.‏ فأقبل فقال ما عنفني أحد منذ فارقت رسول الله صلى الله عليه وسلم وقال إن منزلي متراخ فلو صليت وتركت لم آت أهلي إلى الليل‏.‏ وذكر أنه صحب النبي صلى الله عليه وسلم فرأى من تيسيره‏.‏",
      "text_en": " Narrated Al-Azraq bin Qais:                     We were in the city of Al-Ahwaz on the bank of a river which had dried up. Then Abu Barza Al- Aslami came riding a horse and he started praying and let his horse loose. The horse ran away, so Abu Barza interrupted his prayer and went after the horse till he caught it and brought it, and then he offered his prayer. There was a man amongst us who was (from the Khawari) having a different opinion. He came saying. \"Look at this old man! He left his prayer because of a horse.\" On that Abu Barza came to us and said, \"Since the time I left Allah's Apostle, nobody has admonished me; My house is very far from this place, and if I had carried on praying and left my horse, I could not have reached my house till night.\" Then Abu Barza mentioned that he had been in the company of the Prophet, and that he had seen his leniency.",
      "chain": [
        "20283",
        "20022",
        "11574"
      ]
    },
    {
      "hadith_no": "1007",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أشعث بن شعبة، عن المنهال بن خليفة، عن الأزرق بن قيس، قال صلى بنا إمام لنا يكنى أبا رمثة فقال صليت هذه الصلاة - أو مثل هذه الصلاة - مع النبي صلى الله عليه وسلم ‏.‏ قال وكان أبو بكر وعمر يقومان في الصف المقدم عن يمينه وكان رجل قد شهد التكبيرة الأولى من الصلاة فصلى نبي الله صلى الله عليه وسلم ثم سلم عن يمينه وعن يساره حتى رأينا بياض خديه ثم انفتل كانفتال أبي رمثة - يعني نفسه - فقام الرجل الذي أدرك معه التكبيرة الأولى من الصلاة يشفع فوثب إليه عمر فأخذ بمنكبه فهزه ثم قال اجلس فإنه لم يهلك أهل الكتاب إلا أنه لم يكن بين صلواتهم فصل ‏.‏ فرفع النبي صلى الله عليه وسلم بصره فقال ‏\"‏ أصاب الله بك يا ابن الخطاب ‏\"‏ ‏.‏ قال أبو داود وقد قيل أبو أمية مكان أبي رمثة ‏.‏",
      "text_en": " Narrated Al-Azraq ibn Qays:                     An imam of ours, whose kunyah (surname) was AbuRimthah, led us in prayer and said: I prayed this prayer, or one like it, with the Prophet (ﷺ). AbuBakr and Umar were standing in the front row on his right and there was a man who had been present at the first takbir in the prayer. The Prophet of Allah (ﷺ) offered the prayer, then gave the salutation to his right and his left so that we saw the whiteness of his cheeks, then turned away as AbuRimthah (meaning himself) had done.  The man who has been present with him at the first takbir in the prayer then got up to pray another prayer, whereupon Umar leaped up and, seizing him by the shoulders, shook him and said: Sit down, for the People of the Book perished for no other reason than that there was no interval between their prayers.  The Prophet (ﷺ) raised his eyes and said: Allah has made you say what is right, son of al-Khattab.Abu Dawud said: Sometimes the name of Abu Umayyah is narrated instead of Abu Rimthah.",
      "chain": [
        "38363",
        "28050",
        "25316",
        "11574"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا النضر بن شميل، قال أنبأنا حماد بن سلمة، عن الأزرق بن قيس، عن يحيى بن يعمر، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أول ما يحاسب به العبد صلاته فإن كان أكملها وإلا قال الله عز وجل انظروا لعبدي من تطوع فإن وجد له تطوع قال أكملوا به الفريضة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"The first thing for which a person will be brought to account will be his Salah. If it is complete (all well and good), otherwise Allah will say: 'Look and see if My slave did any voluntary prayer.' If he is found to have done voluntary prayers, his obligatory prayers will be completed therewith.\"",
      "chain": [
        "30123",
        "20291",
        "20021",
        "11574",
        "11316",
        "13"
      ]
    },
    {
      "hadith_no": "4103",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن معمر البصري الحراني، قال حدثنا أبو داود الطيالسي، قال حدثنا حماد بن سلمة، عن الأزرق بن قيس، عن شريك بن شهاب، قال كنت أتمنى أن ألقى، رجلا من أصحاب النبي صلى الله عليه وسلم أسأله عن الخوارج فلقيت أبا برزة في يوم عيد في نفر من أصحابه فقلت له هل سمعت رسول الله صلى الله عليه وسلم يذكر الخوارج فقال نعم سمعت رسول الله صلى الله عليه وسلم بأذني ورأيته بعيني أتي رسول الله صلى الله عليه وسلم بمال فقسمه فأعطى من عن يمينه ومن عن شماله ولم يعط من وراءه شيئا فقام رجل من ورائه فقال يا محمد ما عدلت في القسمة ‏.‏ رجل أسود مطموم الشعر عليه ثوبان أبيضان فغضب رسول الله صلى الله عليه وسلم غضبا شديدا وقال ‏\"‏ والله لا تجدون بعدي رجلا هو أعدل مني ‏\"‏ ‏.‏ ثم قال ‏\"‏ يخرج في آخر الزمان قوم كأن هذا منهم يقرءون القرآن لا يجاوز تراقيهم يمرقون من الإسلام كما يمرق السهم من الرمية سيماهم التحليق لا يزالون يخرجون حتى يخرج آخرهم مع المسيح الدجال فإذا لقيتموهم فاقتلوهم هم شر الخلق والخليقة ‏\"‏ ‏.‏ قال أبو عبد الرحمن رحمه الله شريك بن شهاب ليس بذلك المشهور ‏.‏",
      "text_en": " it was narrated that Sharik bin Shihab said:                     \"I used to wish that I could meet a man among the Companions of the Prophet [SAW] and ask him about the Khawarij. Then I met Abu Barzah on the day of 'Id, with a number of his companions. I said to him: 'Did you hear the Messenger of Allah [SAW] mention the Khawarij?' He said: 'Yes. I heard the Messenger of Allah [SAW] with my own ears, and saw him with my own eyes. Some wealth was brought to the Messenger of Allah [SAW] and he distributed it to those on his right and on his left, but he did not give anything to those who were behind him. Then a man stood behind him and said: \"O Muhammad! You have not been just in your division!\" He was a man with black patchy (shaved) hair, wearing two white garments. So Allah's Messenger [SAW] became very angry and said: \"By Allah! You will not find a man after me who is more just than me.\" Then he said: \"A people will come at the end of time; as if he is one of them, reciting the Qur'an without it passing beyond their throats. They will go through Islam just as the arrow goes through the target. Their distinction will be shaving. They will not cease to appear until the last of them comes with Al-Masih Ad-Dajjal. So when you meet them, then kill them, they are the worst of created beings.\"",
      "chain": [
        "30172",
        "20547",
        "20021",
        "11574",
        "14179"
      ]
    }
  ],
  "total_hadiths": 5
}