{
  "id": "11573",
  "name": "Muhammad bin Abi Bakr محمد بن أبي بكر بن عوف",
  "full_name": "Muhammad bin Abi Bakr محمد بن أبي بكر بن عوف",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "970",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا مالك بن أنس، قال حدثني محمد بن أبي بكر الثقفي، قال سألت أنسا ونحن غاديان من منى إلى عرفات عن التلبية كيف كنتم تصنعون مع النبي صلى الله عليه وسلم قال كان يلبي الملبي لا ينكر عليه، ويكبر المكبر فلا ينكر عليه‏.‏",
      "text_en": " Narrated Muhammad bin Abi Bakr Al-Thaqafi:                     While we were going from Mina to `Arafat, I asked Anas bin Malik, about Talbiya, \"How did you use to say Talbiya in the company of the Prophet?\" Anas said: \"People used to say Talbiya and their saying was not objected to and they used to say Takbir and that was not objected to either. \"",
      "chain": [
        "20348",
        "20001",
        "11573"
      ]
    },
    {
      "hadith_no": "1685",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن أبي بكر الثقفي، أنه سأل أنس بن مالك وهما غاديان من منى إلى عرفة كيف كنتم تصنعون في هذا اليوم مع رسول الله صلى الله عليه وسلم فقال كان يهل منا المهل فلا ينكر عليه، ويكبر منا المكبر فلا ينكر عليه‏.‏",
      "text_en": " Narrated Muhammad bin Abu Bakr Al-Thaqafi:                     I asked Anas bin Malik while we were proceeding from Mina to `Arafat, \"What do you use to do on this day when you were with Allah's Apostle ?\" Anas said, \"Some of us used to recite Talbiya and nobody objected to that, and others used to recite Takbir and nobody objected to that.\"",
      "chain": [
        "30355",
        "20001",
        "11573",
        "19"
      ]
    },
    {
      "hadith_no": "3157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن أبي بكر الثقفي، أنه سأل أنس بن مالك وهما غاديان من منى إلى عرفة كيف كنتم تصنعون في هذا اليوم مع رسول الله صلى الله عليه وسلم فقال كان يهل المهل منا فلا ينكر عليه ويكبر المكبر منا فلا ينكر عليه ‏.‏",
      "text_en": " Muhammad b. Abu Bakr al-Thaqafi asked Anas b. Malik (Allah be pleased with him), while on their way from Mina to 'Arafa in the morning:                      What did you do on this day in the company of Allah's Messenger (may peace be upon him)? Thereupon he said: One of us pronounced Tahlil, and he met with no disapproval, and one of us pronounced Takbir, and he also met with no disapproval.",
      "chain": [
        "30399",
        "11573",
        "19"
      ]
    },
    {
      "hadith_no": "3000",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الملائي، - يعني أبا نعيم الفضل بن دكين - قال حدثنا مالك، قال حدثني محمد بن أبي بكر الثقفي، قال قلت لأنس ونحن غاديان من منى إلى عرفات ما كنتم تصنعون في التلبية مع رسول الله صلى الله عليه وسلم في هذا اليوم قال كان الملبي يلبي فلا ينكر عليه ويكبر المكبر فلا ينكر عليه ‏.‏",
      "text_en": " Muhammad bin Abi Bakr Ath-Thaqafi narrated:                     \"When we were leaving Mina for Arafat, I said to Anas: 'What did you do for the Talbiyah with the Messenger of Allah on this day?' He said 'Those who recited the Talbiyah did so, and no one criticized them, and those who recited the Takbir did so, and no one criticized them.'\"",
      "chain": [
        "30123",
        "20001",
        "11573"
      ]
    },
    {
      "hadith_no": "3001",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الله بن رجاء، قال حدثنا موسى بن عقبة، عن محمد بن أبي بكر، - وهو الثقفي - قال قلت لأنس غداة عرفة ما تقول في التلبية في هذا اليوم قال سرت هذا المسير مع رسول الله صلى الله عليه وسلم وأصحابه وكان منهم المهل ومنهم المكبر فلا ينكر أحد منهم على صاحبه ‏.‏",
      "text_en": " It was narrated that Muhmmad bin Abi Abkr - Ath-Thaqafi - said:                     \"I said to Anas on the morning of Arafat: 'What do you say about the Talbiyah on this day?' I said: 'I walked this path with the Messenger of Allah and his Companions. Some of them recited the Talbiyah and some recited the Takbir, and none of them denounced any other.\"",
      "chain": [
        "30123",
        "20245",
        "11106",
        "11573"
      ]
    }
  ],
  "total_hadiths": 5
}