{
  "id": "11570",
  "name": "Yasayr bin 'Amr يسير بن عمرو الشيباني",
  "full_name": "Yasayr bin 'Amr (bin Jabir) يسير بن عمرو الشيباني",
  "grade": "Follower(Tabi')",
  "biography": {
    "birth": {
      "date_hijri": "1",
      "date_gregorian": "NA",
      "date_display": [
        "1 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "85",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      " Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  قد  س  - ]"
    ],
    "tags": [
      "al-Shaybani",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "403",
      "name": "Sahl bin Hunayf ( سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14",
      "name": "Salman Farsi ( سلمان أبو عبد الله الفارسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10735",
      "name": "Abu Qtad'h al-Dwy al-'Abbassri أبو قتادة العدوي البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11284",
      "name": "Zararah bin Awfa al-'Amiri al-Harshi زرارة بن أوفى العامري الحرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7020",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، حدثنا يسير بن عمرو، قال قلت لسهل بن حنيف هل سمعت النبي صلى الله عليه وسلم يقول في الخوارج شيئا قال سمعته يقول  وأهوى بيده قبل العراق  ‏\"‏ يخرج منه قوم يقرءون القرآن لا يجاوز تراقيهم، يمرقون من الإسلام مروق السهم من الرمية ‏\"‏‏.‏",
      "text_en": " Narrated Yusair bin `Amr:                     I asked Sahl bin Hunaif, \"Did you hear the Prophet saying anything about Al-Khawarij?\" He said, \"I heard him saying while pointing his hand towards Iraq. \"There will appear in it (i.e, Iraq) some people who will recite the Qur'an but it will not go beyond their throats, and they will go out from (leave) Islam as an arrow darts through the game's body.' \"",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11570"
      ]
    },
    {
      "hadith_no": "2519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يسير بن، عمرو قال سألت سهل بن حنيف هل سمعت النبي صلى الله عليه وسلم يذكر الخوارج فقال سمعته - وأشار بيده نحو المشرق ‏\"‏ قوم يقرءون القرآن بألسنتهم لا يعدو تراقيهم يمرقون من الدين كما يمرق السهم من الرمية ‏\"‏ ‏.‏",
      "text_en": " Yusair b. 'Amr reported that he inquired of Sahl b. Hunaif:                      Did you hear the Apostle of Allah (may peace be upon him) making a mention of the Khwarij? He said: I heard him say (and he pointed with his hand towards the east) that these would be a people who would recite the Qur'an with their tongues and it would not go beyond their collar bones. They would pass clean through their religion just as the arrow passes through the prey.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11570",
        "403"
      ]
    },
    {
      "hadith_no": "3407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يسير، بن عمرو عن سهل بن حنيف، قال أهوى رسول الله صلى الله عليه وسلم بيده إلى المدينة فقال ‏\"‏ إنها حرم آمن ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Hunif reported that Allah's Messenger (may peace be upon him) pointed with his hands towards Medina and said:                      That is a sacred territory and a place of safety.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11570",
        "403"
      ]
    }
  ],
  "total_hadiths": 3
}