{
  "id": "11579",
  "name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
  "full_name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "131",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "al-Ray"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-'Anbari",
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11308",
      "name": "Muwarraq bin Mashmarij al-Ajli مورق بن المشمرج العجلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11273",
      "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24432",
      "name": "Mty' bin Rashid al-Basri مطيع بن راشد البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1175",
      "hadith_no": "1175",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن توبة، عن مورق، قال قلت لابن عمر  رضى الله عنهما  أتصلي الضحى قال لا‏.‏ قلت فعمر‏.‏ قال لا‏.‏ قلت فأبو بكر‏.‏ قال لا‏.‏ قلت فالنبي صلى الله عليه وسلم قال لا إخاله‏.‏",
      "text_en": " Narrated Muwarriq:                     I asked Ibn `Umar \"Do you offer the Duha prayer?\" He replied in the negative. I further asked, \"Did `Umar use to pray it?\" He (Ibn `Umar) replied in the negative. I again asked, \"Did Abu Bakr use to pray it?\" He replied in the negative. I again asked, \"Did the Prophet use to pray it?\" Ibn `Umar replied, \"I don't think he did.\"",
      "usc_msa_ref": "271",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11579",
        "11308"
      ]
    },
    {
      "id": "sahih-bukhari-7353",
      "hadith_no": "7353",
      "source": "Sahih Bukhari",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا محمد بن الوليد، حدثنا محمد بن جعفر، حدثنا شعبة، عن توبة العنبري، قال قال لي الشعبي أرأيت حديث الحسن عن النبي صلى الله عليه وسلم وقاعدت ابن عمر قريبا من سنتين أو سنة ونصف فلم أسمعه يحدث عن النبي صلى الله عليه وسلم غير هذا قال كان ناس من أصحاب النبي صلى الله عليه وسلم فيهم سعد فذهبوا يأكلون من لحم، فنادتهم امرأة من بعض أزواج النبي صلى الله عليه وسلم إنه لحم ضب فأمسكوا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا  أو اطعموا  فإنه حلال  أو قال لا بأس به‏.‏ شك فيه  ولكنه ليس من طعامي ‏\"‏‏.‏",
      "text_en": " Narrated Tauba Al-`Anbari:                     Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I stayed with Ibn `Umar for about two or one-and-half years and I did not hear him narrating any thing from the Prophet except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet including Sa`d, were going to eat meat, but one of the wives of the Prophet called them, saying, 'It is the neat of a Mastigure.' The people then stopped eating it. On that Allah's Apostle said, 'Carry on eating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"",
      "usc_msa_ref": "",
      "chain": [
        "30174",
        "20173",
        "20020",
        "11579"
      ]
    },
    {
      "id": "sahih-muslim-5144",
      "hadith_no": "5144",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن توبة العنبري، سمع الشعبي، سمع ابن عمر، أن النبي صلى الله عليه وسلم كان معه ناس من أصحابه فيهم سعد وأتوا بلحم ضب فنادت امرأة من نساء النبي صلى الله عليه وسلم إنه لحم ضب فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا فإنه حلال ولكنه ليس من طعامي ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported that there were some persons with Allah's Apostle (may peace be upon him) from among his Companions, Sa'd being one of them. There was brought to them the flesh of the lizard when a lady amongst the wives of Allah's Apostle (may peace be upon him) said:                      It is the flesh of the lizard. Thereupon Allah's Messenger (way peace be upon him) &aid: Eat, for it is lawful, but it is not my diet.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11579",
        "11052",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5145",
      "hadith_no": "5145",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن توبة العنبري، قال قال لي الشعبي أرأيت حديث الحسن عن النبي صلى الله عليه وسلم وقاعدت ابن عمر قريبا من سنتين أو سنة ونصف فلم أسمعه روى عن النبي صلى الله عليه وسلم غير هذا قال كان ناس من أصحاب النبي صلى الله عليه وسلم فيهم سعد بمثل حديث معاذ ‏.‏",
      "text_en": " Taubat Al-'Anbari reported:                      Al-Sha'bi (one of the narrators) asked me if I had heard the hadith transmitted on the authority of Hasan from the Prophet (may peace be upon him). He said: I sat in the company if Ibn 'Umar for two years or a year and a half but I did not hear narrated from Allah's Apostle (may peace be upon him) but this one (pertaining to the flesh of the lizard) as narrated by Mu'adh.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11579"
      ]
    },
    {
      "id": "sunan-abi-daud-197",
      "hadith_no": "197",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، عن زيد بن الحباب، عن مطيع بن راشد، عن توبة العنبري، أنه سمع أنس بن مالك، يقول إن رسول الله صلى الله عليه وسلم شرب لبنا فلم يمضمض ولم يتوضأ وصلى ‏.‏ قال زيد دلني شعبة على هذا الشيخ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) drank some milk and he did not rinse his mouth nor did he perform ablution, and he offered the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "24432",
        "11579",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2336",
      "hadith_no": "2336",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان يصله برمضان ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     She never saw the Prophet (ﷺ) fasting the whole month except Sha'ban which he combined with Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-2176",
      "hadith_no": "2176",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال أنبأنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يصل شعبان برمضان ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah used to join Shaban to Ramadan.\" '",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-2353",
      "hadith_no": "2353",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن الوليد، قال حدثنا محمد، قال حدثنا شعبة، عن توبة، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان ويصل به رمضان ‏.‏",
      "text_en": " It was narrated from Umm Salamah:                     That the Prophet would not fast any month of the year in full except Shaban and he used to join it to Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30174",
        "20278",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-4071",
      "hadith_no": "4071",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا معاذ بن معاذ، قال حدثنا شعبة، عن توبة العنبري، عن عبد الله بن قدامة بن عنزة، عن أبي برزة الأسلمي، قال أغلظ رجل لأبي بكر الصديق فقلت أقتله فانتهرني وقال ليس هذا لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Barzah Al-Aslami said:                     \"A man spoke harshly to Abu Bakr As-Siddiq, and I said: 'Shall I kill him?' He told me off, and said: 'That is not for anyone after the Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20286",
        "20020",
        "11579",
        "227"
      ]
    }
  ],
  "total_hadiths": 9
}