{
  "id": "11578",
  "name": "Bashyr bin Ka'b bin Aby بشير بن كعب بن أبي",
  "full_name": "Bashyr bin Ka'b bin Aby بشير بن كعب بن أبي",
  "grade": "Follower(Tabi') [1st Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ خ  4  -  مخضرم ]"
    ],
    "tags": [
      "al-Humayri",
      "B.'Adi",
      "Makhdaram",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "17250",
      "name": "Yazid bin al-Aswad al-Jarshi يزيد بن الأسود الجرشي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "389",
      "name": "Shadad bin Aus bin Thabit ( شداد بن أوس بن ثابت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10692",
      "name": "Tlq bin Habib al-Nzy al-Bsry طلق بن حبيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14303",
      "name": "al-Ala' bin Ziyad bin Mutar العلاء بن زياد بن مطر",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6379",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، حدثنا عبد الله بن بريدة، عن بشير بن كعب العدوي، قال حدثني شداد بن أوس  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ سيد الاستغفار أن تقول اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك على وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت ‏\"‏‏.‏ قال ‏\"‏ ومن قالها من النهار موقنا بها، فمات من يومه قبل أن يمسي، فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها، فمات قبل أن يصبح، فهو من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Shaddad bin Aus:                     The Prophet said \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta Rabbi la ilaha illa anta, Anta Khalaqtani wa ana `Abduka, wa ana 'ala ahdika wa wa'dika mastata'tu, A`udhu bika min Sharri ma sana'tu, abu'u Laka bini'matika 'alaiya, wa abu'u laka bidhanbi faghfir lee fa innahu la yaghfiru adhdhunuba illa anta.\" The Prophet added. \"If somebody recites it during the day with firm faith in it, and dies on the same day before the evening, he will be from the people of Paradise; and if somebody recites it at night with firm faith in it, and dies before the morning, he will be from the people of Paradise.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "6396",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن بشير بن كعب، عن شداد بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ سيد الاستغفار اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أبوء لك بنعمتك، وأبوء لك بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت، أعوذ بك من شر ما صنعت‏.‏ إذا قال حين يمسي فمات دخل الجنة  أو كان من أهل الجنة  وإذا قال حين يصبح فمات من يومه ‏\"‏‏.‏ مثله‏.‏",
      "text_en": " Narrated Shaddad bin 'Aus:                     The Prophet said, \"The most superior way of asking for forgiveness from Allah is: 'Allahumma anta Rabbi la ilaha illa anta. Khalaqtani wa ana `Abduka, wa ana 'ala 'ahdika wa Wa'dika mastata'tu abu'u Laka bi ni 'matika wa abu'u Laka bidhanbi; faghfirli fa'innahu la yaghfiru-dh-dhunuba ill a ant a. A'uidhu bika min sharri ma sana'tu.' If somebody recites this invocation during the night, and if he should die then, he will go to Paradise (or he will be from the people of Paradise). And if he recites it in the morning, and if he should die on the same day, he will have the same fate.\"",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "3633",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا المثنى بن سعيد، حدثنا قتادة، عن بشير بن كعب العدوي، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تدارأتم في طريق فاجعلوه سبعة أذرع ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If you dispute over a pathway, leave the margin of seven yards.",
      "chain": [
        "20285",
        "11019",
        "11578",
        "13"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا المثنى بن سعيد، عن قتادة، عن بشير بن كعب العدوي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تشاجرتم في الطريق فاجعلوه سبعة أذرع ‏\"‏ ‏.‏ قال أبو عيسى وهذا أصح من حديث وكيع ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث بشير بن كعب العدوي عن أبي هريرة حديث حسن صحيح ‏.‏ وروى بعضهم هذا عن قتادة عن بشير بن نهيك عن أبي هريرة ‏.‏ وهو غير محفوظ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"When you disagree over the road, then make it seven forearm lengths.\"",
      "chain": [
        "30160",
        "20031",
        "11019",
        "11578",
        "13"
      ]
    },
    {
      "hadith_no": "5522",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا حسين المعلم، عن عبد الله بن بريدة، عن بشير بن كعب، عن شداد بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن سيد الاستغفار أن يقول العبد اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بذنبي وأبوء لك بنعمتك على فاغفر لي فإنه لا يغفر الذنوب إلا أنت فإن قالها حين يصبح موقنا بها فمات دخل الجنة وإن قالها حين يمسي موقنا بها دخل الجنة ‏\"‏ ‏.‏ خالفه الوليد بن ثعلبة ‏.‏",
      "text_en": " It was narrated from Shaddad bin Aws that :                     The Prophet [SAW] said: \"The best of prayers for forgiveness is for a person to say: 'Allahumma, anta rabbi, la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abuw'u laka bidhanbi, wa abuw'u laka bini'matika 'alayya faghfirli, fa innahu la yaghfirudh-dhunuba illa anta (O Allah, You are my Lord, there is no god but You. You have created me and I am Your slave and I am keeping my promise and covenant to You as much as I can. I seek refuge with You from the evil of what I do. I acknowledge Your blessing and I acknowledge my sin, so forgive me, for there is none who can forgive sin except You.)' If he says this in the morning, believing in it firmly, and dies on that day before evening comes, he will enter Paradise, and if he says it in the evening, believing firmly in it, and dies before morning comes, he will enter Paradise.\" Al-Walid bin Tha'labah contradicted him.",
      "chain": [
        "30153",
        "20304",
        "11278",
        "11432",
        "11578",
        "389"
      ]
    },
    {
      "hadith_no": "2338",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا مثنى بن سعيد الضبعي، عن قتادة، عن بشير بن كعب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا الطريق سبعة أذرع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Make the path seven forearms length wide.”",
      "chain": [
        "30201",
        "20032",
        "11019",
        "11578",
        "13"
      ]
    }
  ],
  "total_hadiths": 6
}