{
  "id": "11585",
  "name": "Da'ud bin Abi Hnd داود بن أبي هند",
  "full_name": "Da'ud bin Abi Hnd داود بن أبي هند",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  ت  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Qushayri",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11284",
      "name": "Zararah bin Awfa al-'Amiri al-Harshi زرارة بن أوفى العامري الحرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10799",
      "name": "Azrh bin 'Abdur Rahman عزرة بن عبد الرحمن بن زرارة الخزاعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10972",
      "name": "al-Nu'man bin Salm al-Ta'ify النعمان بن سالم الطائفي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20568",
      "name": "Muslimh bin 'Alqama al-Mazny مسلمة بن علقمة المازني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-223",
      "hadith_no": "223",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو نصر التمار، وعبد الأعلى بن حماد، قالا حدثنا حماد بن سلمة، عن داود بن أبي هند، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثل حديث يحيى بن محمد عن العلاء ذكر فيه ‏\"‏ وإن صام وصلى وزعم أنه مسلم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings of Allah be upon him) made observations like them embodied in the hadith narrated by Yahya b. Muhammad on the authority of 'Ala', and added to it:                      even if he observed fast and prayed and asserted that he was a Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "20663",
        "30146",
        "20021",
        "11585",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-301",
      "hadith_no": "301",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، قال حدثني أبي، حدثنا داود، - يعني ابن أبي هند - حدثنا عاصم، عن صفوان بن محرز، عن أبي موسى، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20250",
        "20258",
        "11585",
        "11080",
        "11693",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-438",
      "hadith_no": "438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، وسريج بن يونس، قالا حدثنا هشيم، أخبرنا داود بن أبي هند، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بوادي الأزرق فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا هذا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى - عليه السلام - هابطا من الثنية وله جؤار إلى الله بالتلبية ‏\"‏ ‏.‏ ثم أتى على ثنية هرشى ‏.‏ فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى قال ‏\"‏ كأني أنظر إلى يونس بن متى - عليه السلام - على ناقة حمراء جعدة عليه جبة من صوف خطام ناقته خلبة وهو يلبي ‏\"‏ ‏.‏ قال ابن حنبل في حديثه قال هشيم يعني ليفا ‏.‏",
      "text_en": " Abu al-'Aliya narrated it on the authority of Ibn 'Abbas that the Messenger of Allah (may peace be upon him) passed through the valley of Azraq, and he asked:                      Which valley is this? They said: This is the valley of Azraq, and he observed: (I perceive) as if I am seeing Moses (peace be upon him) coming down from the mountain track, and he is calling upon Allah loudly (saying: Here I am! at your service! ). Then he came to the mountain track of Harsha. He (the Holy Prophet) said: Which is this mountain track? They said: It is the mountain track of Harsha. He observed (I feel) as If I am seeing Yunus (Jonah-peace be upon him) son of Matta on a well- built red dromedary, with a cloak of wool around him and the rein of his dromedary is made of the fibres of date-palm, and he is calling upon Allah (saying: Here I am! at your service, my Lord! ). Ibn Hanbal said in the hadith narrated by him: Hushaim said that the meaning of khulba was fibre of date-palm.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30251",
        "20468",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1527",
      "hadith_no": "1527",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن هارون، عن داود بن أبي هند، عن الحسن، عن جندب بن سفيان، عن النبي صلى الله عليه وسلم بهذا ولم يذكر ‏\"‏ فيكبه في نار جهنم ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Jundab b. Sufyan in from the Apostle of Allah (may peace be upon him) with the same chain of transmitters, but this has not been mentioned:                     \" He would throw him in fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11585",
        "11016"
      ]
    },
    {
      "id": "sahih-muslim-1727",
      "hadith_no": "1727",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن داود بن أبي هند، عن النعمان بن سالم، عن عمرو بن أوس، قال حدثني عنبسة بن أبي سفيان، في مرضه الذي مات فيه بحديث يتسار إليه قال سمعت أم حبيبة تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى اثنتى عشرة ركعة في يوم وليلة بني له بهن بيت في الجنة ‏\"‏ ‏.‏ قالت أم حبيبة فما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم ‏.‏ وقال عنبسة فما تركتهن منذ سمعتهن من أم حبيبة ‏.‏ وقال عمرو بن أوس ما تركتهن منذ سمعتهن من عنبسة ‏.‏ وقال النعمان بن سالم ما تركتهن منذ سمعتهن من عمرو بن أوس ‏.‏",
      "text_en": " Umm Habiba (the wife of the Holy Prophet) reported Allah's Messenger (may peace be upon him) as saying:                      A house will be built in Paradise, for anyone who prays in a day and a night twelve rak'ahs; and she added: I have never abandoned (observing them) since I heard it from the Messenger of Allah (may peace be upon him). Some of the other narrators said the same words: I have never abandoned (observing them) since I heard (from so and so).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "11585",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sahih-muslim-1955",
      "hadith_no": "1955",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل بن إبراهيم، عن داود بن أبي، هند عن الشعبي، عن علقمة، قال لقيت أبا الدرداء فقال لي ممن أنت قلت من أهل العراق ‏.‏ قال من أيهم قلت من أهل الكوفة ‏.‏ قال هل تقرأ على قراءة عبد الله بن مسعود قال قلت نعم ‏.‏ قال فاقرأ ‏{‏ والليل إذا يغشى‏}‏ قال فقرأت ‏{‏ والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏ ‏.‏ قال فضحك ثم قال هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11585",
        "11052",
        "11017"
      ]
    },
    {
      "id": "sahih-muslim-3509",
      "hadith_no": "3509",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني محرز بن عون بن أبي عون، حدثنا علي بن مسهر، عن داود بن أبي، هند عن ابن سيرين، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم أن تنكح المرأة على عمتها أو خالتها أو أن تسأل المرأة طلاق أختها لتكتفئ ما في صحفتها فإن الله عز وجل رازقها ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade the combining of a woman in marriage with her father's sister, or with her mother's sister, or that a woman should ask for divorce for her sister in order to deprive her of what belongs to her. Allah, the Exalted'and Majestic, is her Sustainer too.",
      "usc_msa_ref": "",
      "chain": [
        "20345",
        "11585",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4272",
      "hadith_no": "4272",
      "source": "Sahih Muslim",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، وعبد الأعلى، ح وحدثنا إسحاق، بن إبراهيم ويعقوب الدورقي جميعا عن ابن علية، - واللفظ ليعقوب - قال حدثنا إسماعيل، بن إبراهيم عن داود بن أبي هند، عن الشعبي، عن النعمان بن بشير، قال انطلق بي أبي يحملني إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله اشهد أني قد نحلت النعمان كذا وكذا من مالي ‏.‏ فقال ‏\"‏ أكل بنيك قد نحلت مثل ما نحلت النعمان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فأشهد على هذا غيري - ثم قال - أيسرك أن يكونوا إليك في البر سواء ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir (Allah be pleased with them) reported:                      My father took me to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, bear witness that I have given such and such gift to Nu'man from my property, whereupon he (the Holy Prophet) said: Have you conferred upon all of your sons as you have conferred upon Nu'man? He said: No. Thereupon he (the Holy Prophet) said: Call someone else besides me as a witness. And he further said: Would it, please you that they (your children) should all behave virtuously towards you? He said: Yes. He (the Holy Prophet) said: Then don't do that (i e. don't give gift to one to the exclusion of others).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20259",
        "20246",
        "30123",
        "20208",
        "11585",
        "11052",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-5067",
      "hadith_no": "5067",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن داود بن أبي هند، عن أبي عثمان، عن سعد بن أبي وقاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال أهل الغرب ظاهرين على الحق حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated by Sa'd b. Abu Waqqas that the Messenger of Allah (may peace be upon him) said:                      The people of the West will continue to triumphantly follow the truth until the Hour is established.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11585",
        "11113",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-7153",
      "hadith_no": "7153",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا ابن نمير، حدثنا أبو معاوية، عن داود بن أبي هند، عن أبي عثمان، عن  سلمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله خلق يوم خلق السموات والأرض مائة رحمة كل رحمة طباق ما بين السماء والأرض فجعل منها في الأرض رحمة فبها تعطف الوالدة على ولدها والوحش والطير بعضها على بعض فإذا كان يوم القيامة أكملها بهذه الرحمة ‏\"‏ ‏.‏",
      "text_en": " Salman reported that Allah's Messenger (may peace be upon him) said:                      Verily, Allah created, on the same very day when He created the heavens and the earth, one hundred parts of mercy. Every part of mercy is coextensive with the space between the heavens. and the earth and He out of this mercy endowed one part to the earth and it is because of this that the mother shows affection to her child and even the beasts and birds show kindness to one another and when there would be the Day of Resurrection, Allah would make full (use of Mercy).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20354",
        "11585",
        "11113"
      ]
    },
    {
      "id": "sahih-muslim-7503",
      "hadith_no": "7503",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن داود بن أبي هند، عن أبي، نضرة عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-422",
      "hadith_no": "422",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، قال صلينا مع رسول الله صلى الله عليه وسلم صلاة العتمة فلم يخرج حتى مضى نحو من شطر الليل فقال ‏\"‏ خذوا مقاعدكم ‏\"‏ ‏.‏ فأخذنا مقاعدنا فقال ‏\"‏ إن الناس قد صلوا وأخذوا مضاجعهم وإنكم لن تزالوا في صلاة ما انتظرتم الصلاة ولولا ضعف الضعيف وسقم السقيم لأخرت هذه الصلاة إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     We observed the prayer after nightfall with the Messenger of Allah (ﷺ), and he did not come out till about half the night had passed. He then said: Take your places. We then took our places. Then he said: The people have prayed and gone to bed, but you are still engaged in prayer as long as you wait for the prayer. Were it not for the weakness of the weak and for  the sickness of the sick. I would delay this prayer till half the night had gone.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-428",
      "hadith_no": "428",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا خالد، عن داود بن أبي هند، عن أبي حرب بن أبي الأسود، عن عبد الله بن فضالة، عن أبيه، قال علمني رسول الله صلى الله عليه وسلم فكان فيما علمني ‏\"‏ وحافظ على الصلوات الخمس ‏\"‏ ‏.‏ قال قلت إن هذه ساعات لي فيها أشغال فمرني بأمر جامع إذا أنا فعلته أجزأ عني فقال ‏\"‏ حافظ على العصرين ‏\"‏ ‏.‏ وما كانت من لغتنا فقلت وما العصران فقال ‏\"‏ صلاة قبل طلوع الشمس وصلاة قبل غروبها ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah:                     The Messenger of Allah (ﷺ) taught me and what he taught me is this: Observe the five prayers regularly. He said: I told (him): I have many works at these times; so give me a comprehensive advice which, if I follow, should be enough for me. He said: Observe the two afternoon prayers (al-asrayn). But the term al-asrayn (two afternoon prayers) was not used in our language. Hence I said: What is al-asrayn?  He said: A prayer before the sunrise and a prayer before the sunset (i.e. the dawn and the afternoon prayers).",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20423",
        "11585",
        "10729",
        "5135"
      ]
    },
    {
      "id": "sunan-abi-daud-866",
      "hadith_no": "866",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن داود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي صلى الله عليه وسلم بهذا المعنى قال ‏\"‏ ثم الزكاة مثل ذلك ثم تؤخذ الأعمال على حسب ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Tamim ad-Dari:                     Tamim reported this tradition from the Prophet (ﷺ) as (Hadith No 863). This version adds: Then zakat will be considered in a similar way. Then all the actions will be considered accordingly.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11585",
        "11284",
        "382"
      ]
    },
    {
      "id": "sunan-abi-daud-1250",
      "hadith_no": "1250",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن علية، حدثنا داود بن أبي هند، حدثني النعمان بن سالم، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ من صلى في يوم ثنتى عشرة ركعة تطوعا بني له بهن بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Habibah:                     The Prophet (ﷺ) as saying: If anyone prays in a day and a night twelve rak'ahs voluntarily (supererogatory prayer), a house will be built from him in Paradise on account of these (rak'ahs).",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20208",
        "11585",
        "10972",
        "11437",
        "846",
        "59"
      ]
    },
    {
      "id": "sunan-abi-daud-1375",
      "hadith_no": "1375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، أخبرنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا شيئا من الشهر حتى بقي سبع فقام بنا حتى ذهب ثلث الليل فلما كانت السادسة لم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال فقال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال فلما كانت الرابعة لم يقم فلما كانت الثالثة جمع أهله ونساءه والناس فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قال قلت ما الفلاح قال السحور ثم لم يقم بنا بقية الشهر ‏.‏",
      "text_en": " Narrated AbuDharr:                     We fasted with the Messenger of Allah (ﷺ) during Ramadan, but he did not make us get up at night for prayer at any time during the month till seven nights remained; then he made us get up for prayer till a third of the night had passed. When the sixth remaining night came, he did not make us get up for prayer. When the fifth remaining night came, he made us stand in prayer till a half of the night had gone.  So I said: Messenger of Allah, I wish you had led us in supererogatory prayers during the whole of tonight.  He said: When a man prays with an imam till he goes he is reckoned as having spent a whole night in prayer. On the fourth remaining night he did not make us get up. When the third remaining night came, he gathered his family, his wives, and the people and prayed with us till we were afraid we should miss the falah (success).  I said: What is falah?  He said: The meal before daybreak. Then he did not make us get up for prayer during the remainder of the month.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-abi-daud-2065",
      "hadith_no": "2065",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا داود بن أبي هند، عن عامر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنكح المرأة على عمتها ولا العمة على بنت أخيها ولا المرأة على خالتها ولا الخالة على بنت أختها ولا تنكح الكبرى على الصغرى ولا الصغرى على الكبرى ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported The Apostle of Allaah(ﷺ) as saying “ A woman should not be married to one who had married her paternal aunt or a paternal aunt to one who had married her brother’s daughter or a woman to one who had married her maternal aunt or maternal aunt to one who had married her sister’s daughter. A woman who is elder (in relation) must not be married to one who had married a woman who is younger (in relation) to her nor a woman who is younger (in relation) must be married to one who has married a woman who is elder (in relation) to her.”",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11585",
        "11052",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2738",
      "hadith_no": "2738",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا هشيم، أخبرنا داود بن أبي هند، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال يوم بدر ‏\"‏ من قتل قتيلا فله كذا وكذا ومن أسر أسيرا فله كذا وكذا ‏\"‏ ثم ساق نحوه وحديث خالد أتم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) said on the day of Badr: He who kills a man will get such-and-such, and he who captivates a man will get such-and-such. The narrator then transmitted the rest of the tradition in a similar manner. The tradition of Khalid is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20468",
        "11585",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3044",
      "hadith_no": "3044",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن مسكين اليمامي، حدثنا يحيى بن حسان، حدثنا هشيم، أخبرنا داود بن أبي هند، عن قشير بن عمرو، عن بجالة بن عبدة، عن ابن عباس، قال جاء رجل من الأسبذيين من أهل البحرين - وهم مجوس أهل هجر - إلى رسول الله صلى الله عليه وسلم فمكث عنده ثم خرج فسألته ما قضى الله ورسوله فيكم قال شر ‏.‏ قلت مه قال الإسلام أو القتل ‏.‏ قال وقال عبد الرحمن بن عوف قبل منهم الجزية ‏.‏ قال ابن عباس فأخذ الناس بقول عبد الرحمن بن عوف وتركوا ما سمعت أنا من الأسبذي ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man belonging to Usbadhiyin of the people of Bahrayn, who were the Magians of Hajar, came to the Messenger of Allah (ﷺ) and remained with him (for some time), and then came out. I asked him: What have Allah and His Messenger of Allah decided for you? He replied: Evil. I said: Silent. He said: Islam or killing. AbdurRahman ibn Awf said: He accepted jizyah from them. Ibn Abbas said: The people followed the statement of AbdurRahman ibn Awf, and they left that which I heard from the Usbadhi.",
      "usc_msa_ref": "",
      "chain": [
        "30275",
        "20300",
        "20468",
        "11585",
        "18863",
        "11577",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3546",
      "hadith_no": "3546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن داود بن أبي هند، وحبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة أمر في مالها إذا ملك زوجها عصمتها ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) as saying: It is not permissible for a woman to present a gift from the property which she has in her possession when her husband owns her chastity.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11585",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4782",
      "hadith_no": "4782",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو معاوية، حدثنا داود بن أبي هند، عن أبي حرب بن الأسود، عن أبي ذر، قال إن رسول الله صلى الله عليه وسلم قال لنا ‏\"‏ إذا غضب أحدكم وهو قائم فليجلس فإن ذهب عنه الغضب وإلا فليضطجع ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuDharr:                     The Messenger of Allah (ﷺ) said to us: When one of you becomes angry while standing, he should sit down. If the anger leaves him, well and good; otherwise he should lie down.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20354",
        "11585",
        "10729",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-18",
      "hadith_no": "18",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا حفص بن غياث، عن داود بن أبي هند، عن الشعبي، عن علقمة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تستنجوا بالروث ولا بالعظام فإنه زاد إخوانكم من الجن ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وسلمان وجابر وابن عمر ‏.‏ قال أبو عيسى وقد روى هذا الحديث إسماعيل بن إبراهيم وغيره عن داود بن أبي هند عن الشعبي عن علقمة عن عبد الله أنه كان مع النبي صلى الله عليه وسلم ليلة الجن - الحديث بطوله - فقال الشعبي إن النبي صلى الله عليه وسلم قال ‏\"‏ لا تستنجوا بالروث ولا بالعظام فإنه زاد إخوانكم من الجن ‏\"‏ ‏.‏ وكأن رواية إسماعيل أصح من رواية حفص بن غياث ‏.‏ والعمل على هذا الحديث عند أهل العلم ‏.‏ وفي الباب عن جابر وابن عمر رضى الله عنهما ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     Allah's Messenger said: \"Do not perform Istinja, with dung, nor with bones. For indeed it is provisions for your brothers among the Jinn.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20317",
        "11585",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-222",
      "hadith_no": "222",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يزيد بن هارون، أخبرنا داود بن أبي هند، عن الحسن، عن جندب بن سفيان، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى الصبح فهو في ذمة الله فلا تخفروا الله في ذمته ‏\"‏ ‏.‏ قال أبو عيسى حديث حسن صحيح ‏.‏",
      "text_en": " Jundub bin Sufyan narrated that :                     the Prophet said: \"Whoever prays the Subh then he is under the protection of Allah's covenant, so do not be treacherous with Allah in his covenant.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20472",
        "11585",
        "11016"
      ]
    },
    {
      "id": "jami-al-tirmidhi-806",
      "hadith_no": "806",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم فلم يصل بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة وقام بنا في الخامسة حتى ذهب شطر الليل فقلنا له يا رسول الله لو نفلتنا بقية ليلتنا هذه فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا حتى بقي ثلاث من الشهر وصلى بنا في الثالثة ودعا أهله ونساءه فقام بنا حتى تخوفنا الفلاح ‏.‏ قلت له وما الفلاح قال السحور ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في قيام رمضان فرأى بعضهم أن يصلي إحدى وأربعين ركعة مع الوتر ‏.‏ وهو قول أهل المدينة والعمل على هذا عندهم بالمدينة ‏.‏ وأكثر أهل العلم على ما روي عن عمر وعلي وغيرهما من أصحاب النبي صلى الله عليه وسلم عشرين ركعة ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي ‏.‏ وقال الشافعي وهكذا أدركت ببلدنا بمكة يصلون عشرين ركعة ‏.‏ وقال أحمد روي في هذا ألوان ‏.‏ ولم يقض فيه بشيء ‏.‏ وقال إسحاق بل نختار إحدى وأربعين ركعة على ما روي عن أبى بن كعب ‏.‏ واختار ابن المبارك وأحمد وإسحاق الصلاة مع الإمام في شهر رمضان ‏.‏ واختار الشافعي أن يصلي الرجل وحده إذا كان قارئا ‏.‏ وفي الباب عن عائشة والنعمان بن بشير وابن عباس ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-891",
      "hadith_no": "891",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن داود بن أبي هند، وإسماعيل بن أبي خالد، وزكريا بن أبي زائدة، عن الشعبي، عن عروة بن مضرس بن أوس بن حارثة بن لام الطائي، قال أتيت رسول الله صلى الله عليه وسلم بالمزدلفة حين خرج إلى الصلاة فقلت يا رسول الله إني جئت من جبلى طيئ أكللت راحلتي وأتعبت نفسي والله ما تركت من حبل إلا وقفت عليه فهل لي من حج فقال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد صلاتنا هذه ووقف معنا حتى ندفع وقد وقف بعرفة قبل ذلك ليلا أو نهارا فقد أتم حجه وقضى تفثه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال قوله ‏\"‏ تفثه ‏\"‏ ‏.‏ يعني نسكه ‏.‏ قوله ‏\"‏ ما تركت من حبل إلا وقفت عليه ‏\"‏ ‏.‏ إذا كان من رمل يقال له حبل وإذا كان من حجارة يقال له جبل ‏.‏",
      "text_en": " Urwah bin Mudarris bin Aws bin Harithah bin Lam At-Ta'i narrated:                     \"I came to the Messenger of Allah at Al-Muzdalifah when he left for the Salat. I said: 'O Messenger of Allah! I came from the two mountains of (the tribe of) Tai, wearing out my mount and exhausting myself. By Allah! I did not leave a Habl (sand dune) without stopping on it. So is there Hajj for me?' The Messenger of Allah said: 'Whoever attends this Salat of ours, and stays here with us until departing, while he has stood during the night or the day before that at Arafat, then he has completed his Hajj and fulfilled his Tafath.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11585",
        "11418",
        "11338",
        "11052",
        "4068"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1126",
      "hadith_no": "1126",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أنبأنا داود بن أبي هند، حدثنا عامر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى أن تنكح المرأة على عمتها أو العمة على ابنة أخيها أو المرأة على خالتها أو الخالة على بنت أختها لا تنكح الصغرى على الكبرى ولا الكبرى على الصغرى ‏.‏ قال أبو عيسى حديث ابن عباس وأبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند عامة أهل العلم لا نعلم بينهم اختلافا أنه لا يحل للرجل أن يجمع بين المرأة وعمتها أو خالتها فإن نكح امرأة على عمتها أو خالتها أو العمة على بنت أخيها فنكاح الأخرى منهما مفسوخ ‏.‏ وبه يقول عامة أهل العلم ‏.‏ قال أبو عيسى أدرك الشعبي أبا هريرة وروى عنه ‏.‏ وسألت محمدا عن هذا فقال صحيح ‏.‏ قال أبو عيسى وروى الشعبي عن رجل عن أبي هريرة ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Messenger of Allah prohibited that a woman be married along with her paternal aunt, or the paternal aunt along with her brother's daughter, or a woman with her maternal aunt, or the maternal aunt along with her sister's daughter, and the younger is not to be married with the older, nor the older with the younger.\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20472",
        "11585",
        "11052",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1351",
      "hadith_no": "1351",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، عن داود بن أبي هند، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى جائزة لأهلها والرقبى جائزة لأهلها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه بعضهم عن أبي الزبير بهذا الإسناد عن جابر موقوفا ولم يرفعه ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الرقبى جائزة مثل العمرى ‏.‏ وهو قول أحمد وإسحاق ‏.‏ وفرق بعض أهل العلم من أهل الكوفة وغيرهم بين العمرى والرقبى فأجازوا العمرى ولم يجيزوا الرقبى ‏.‏ قال أبو عيسى وتفسير الرقبى أن يقول هذا الشىء لك ما عشت فإن مت قبلي فهي راجعة إلى ‏.‏ وقال أحمد وإسحاق الرقبى مثل العمرى وهي لمن أعطيها ولا ترجع إلى الأول ‏.‏",
      "text_en": " Jabir narrated that the Messenger of Allah (ﷺ) said:                      \"The lifelong gift is permitted for its inhabitant, and the Ruqba is permitted for its inhabitant.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11585",
        "11263",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1431",
      "hadith_no": "1431",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن داود بن أبي هند، عن سعيد بن المسيب، عن عمر بن الخطاب، قال رجم رسول الله صلى الله عليه وسلم ورجم أبو بكر ورجمت ولولا أني أكره أن أزيد في كتاب الله لكتبته في المصحف فإني قد خشيت أن تجيء أقوام فلا يجدونه في كتاب الله فيكفرون به ‏.‏ قال وفي الباب عن علي ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح وروي من غير وجه عن عمر ‏.‏",
      "text_en": " 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "11585",
        "11002",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1508",
      "hadith_no": "1508",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن داود بن أبي هند، عن الشعبي، عن البراء بن عازب، قال خطبنا رسول الله صلى الله عليه وسلم في يوم نحر فقال ‏\"‏ لا يذبحن أحدكم حتى يصلي ‏\"‏ ‏.‏ قال فقام خالي فقال يا رسول الله هذا يوم اللحم فيه مكروه وإني عجلت نسكي لأطعم أهلي وأهل داري أو جيراني ‏.‏ قال ‏\"‏ فأعد ذبحا آخر ‏\"‏ ‏.‏ فقال يا رسول الله عندي عناق لبن وهي خير من شاتى لحم أفأذبحها قال ‏\"‏ نعم وهي خير نسيكتيك ولا تجزئ جذعة لأحد بعدك ‏\"‏ ‏.‏ قال وفي الباب عن جابر وجندب وأنس وعويمر بن أشقر وابن عمر وأبي زيد الأنصاري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم أن لا يضحى بالمصر حتى يصلي الإمام وقد رخص قوم من أهل العلم لأهل القرى في الذبح إذا طلع الفجر وهو قول ابن المبارك ‏.‏ قال أبو عيسى وقد أجمع أهل العلم أن لا يجزئ الجذع من المعز وقالوا إنما يجزئ الجذع من الضأن ‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib :                     \"The Messenger of Allah (ﷺ) delivered a sermon to us on the Day of Nahr and he said: 'None of you should slaughter until he performs the Salat.\" He said: 'So my maternal uncle stood and said: ' O Messenger of Allah, this is the day in which meat is disliked, and I hastened my sacrifice to feed my family and the people of my dwellings - or - 'my neighbors.' He said: 'Repeat your slaughter with another.' He said: 'O Messenger of Allah (ﷺ) I have a she-kid that has better meat than my sheep, should I slaughter it?' He said: 'Yes, and it is better and it will suffice for you, but a Jadha' will not be accepted after you.' \"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11585",
        "11052",
        "400"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2656",
      "hadith_no": "2656",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن داود بن أبي هند، عن عزرة، عن حميد بن عبد الرحمن الحميري، عن سعد بن هشام، عن عائشة، قالت كان لنا قرام ستر فيه تماثيل على بابي فرآه رسول الله صلى الله عليه وسلم فقال ‏\"‏ انزعيه فإنه يذكرني الدنيا ‏\"‏ ‏.‏ قالت وكان لنا سمل قطيفة علمها من حرير كنا نلبسها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " 'Aishah narrated:                      \"We had a cloth which had some pictures on it as a curtain on my door. The Messenger of Allah(s.a.w) saw it and said:'Remove it, for it reminds me of the world.'\" She said: \"We had a piece of velvet that had patches of silk on it which we used to wear.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20354",
        "11585",
        "10799",
        "11280",
        "11166",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3347",
      "hadith_no": "3347",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، حدثنا داود بن أبي هند، عن الشعبي، عن مسروق، قال كنت متكئا عند عائشة فقالت يا أبا عائشة ثلاث من تكلم بواحدة منهن فقد أعظم على الله الفرية من زعم أن محمدا رأى ربه فقد أعظم الفرية على الله والله يقول ‏:‏ ‏(‏ لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير ‏)‏ ، ‏(‏ ما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب ‏)‏ وكنت متكئا فجلست فقلت يا أم المؤمنين أنظريني ولا تعجليني أليس يقول الله ‏:‏ ‏(‏ ولقد رآه نزلة أخرى ‏)‏، ‏(‏ ولقد رآه بالأفق المبين ‏)‏ قالت أنا والله أول من سأل عن هذا رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما ذاك جبريل ما رأيته في الصورة التي خلق فيها غير هاتين المرتين رأيته منهبطا من السماء سادا عظم خلقه ما بين السماء والأرض ‏\"‏ ‏.‏ ومن زعم أن محمدا كتم شيئا مما أنزل الله عليه فقد أعظم الفرية على الله يقول الله ‏:‏ ‏(‏ يا أيها الرسول بلغ ما أنزل إليك من ربك ‏)‏ ومن زعم أنه يعلم ما في غد فقد أعظم الفرية على الله والله يقول ‏:‏ ‏(‏قل لا يعلم من في السموات والأرض الغيب إلا الله ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ومسروق بن الأجدع يكنى أبا عائشة وهو مسروق بن عبد الرحمن وهكذا كان اسمه في الديوان ‏.‏",
      "text_en": " Narrated Masruq:                     \"I was reclining in the presence of 'Aishah when she said: 'O Abu 'Aishah! There are three things, whoever speaks of one of them, then he has uttered one of the worst lies against Allah. Whoever claims that Muhammad saw his Lord. Then he has uttered one the worst lies against Allah, Allah says: No vision can grasp Him, but His grasp is over all vision, and He is the Most Subtle, Well-Acquainted with all things (6:103). It is not for any human being that Allah should speak to him unless (it be) by revelation or from behind a veil (42:91).' I was reclining so I sat up an said: 'O Mother of the Believers! Take your time with me and do not be hasty with me! Did Allah Most High not say: And indeed he saw him at a second descent (53:13). (And) 'And indeed he saw him in the clear horizon (81:23).' She said 'By Allah! I was the first who asked the Messenger of Allah (ﷺ) about this. He said: \"That was only Jibril. I did not see him in the appearance he was created in except for these two times. I saw him descending from the heavens, and due to his tremendous size he filled what was between the heavens and the earth.\" \"And whoever claimed that Muhammad hid anything that Allah revealed to him, then he uttered one of the worst lies against Allah. Allah says: O Messenger! Proclaim what has been sent down to you from your Lord (5:67).\" \"And whoever claimed that he (ﷺ) knew what would be tomorrow, then he has uttered one of the worst lies against Allah. Allah says: Say: 'None in the heavens and in the earth knows the unseen but Allah (27:65).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "11585",
        "11052",
        "11018"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3412",
      "hadith_no": "3412",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن داود بن أبي هند، عن الشعبي، عن مسروق، قال تلت عائشة هذه الآية ‏:‏ ‏(‏ يوم تبدل الأرض غير الأرض ‏)‏ قالت يا رسول الله فأين يكون الناس قال ‏\"‏ على الصراط ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روي من غير هذا الوجه عن عائشة ‏.‏",
      "text_en": " Narrated Masruq:                     \"'Aishah recited this Ayah: The Day when the earth will be changed to another earth (14:48). She said: 'O Messenger of Allah! Where will the people be?' He said: 'Upon the Sirat.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11585",
        "11052",
        "11018"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3433",
      "hadith_no": "3433",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا يحيى بن زكريا بن أبي زائدة، عن داود بن أبي هند، عن عكرمة، عن ابن عباس، قال قالت قريش ليهود اعطونا شيئا نسأل عنه هذا الرجل فقال سلوه عن الروح قال فسألوه عن الروح فأنزل الله ‏:‏ ‏(‏ يسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا ‏)‏ قالوا أوتينا علما كثيرا التوراة ومن أوتي التوراة فقد أوتي خيرا كثيرا فأنزلت‏:‏ ‏(‏ قل لو كان البحر مدادا لكلمات ربي لنفد البحر ‏)‏ إلى آخر الآية قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Quraish said to the Jews: 'Give us something that we can ask this man about.' So he said: 'Ask him about the Ruh.' So they asked him about the Ruh. So Allah Most High, revealed: They ask you concerning the Ruh. Say: The Ruh is one of the things, the knowledge of which is only with my Lord. And of knowledge, you have been given only a little (17:85). They replied: 'We have been given immense knowledge, we were given the Tawrah, and whoever has been given the Tawrah, then he has indeed been given a wealth of knowledge.' So the following was revealed: Say: 'If the sea were ink for the Words of my Lord, surely the sea would be exhausted (before the Words of my Lord would be finished.) (18:109)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20366",
        "11585",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3512",
      "hadith_no": "3512",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا داود بن الزبرقان، عن داود بن أبي هند، عن الشعبي، عن عائشة، رضى الله عنها قالت لو كان رسول الله صلى الله عليه وسلم كاتما شيئا من الوحى لكتم هذه الآية ‏:‏ ‏(‏ إذ تقول للذي أنعم الله عليه ‏)‏ يعني بالإسلام ‏:‏ ‏(‏ وأنعمت عليه ‏)‏ بالعتق فأعتقته ‏:‏ ‏(‏ أمسك عليك زوجك واتق الله وتخفي في نفسك ما الله مبديه وتخشى الناس والله أحق أن تخشاه ‏)‏ إلى قوله ‏:‏ ‏(‏وكان أمر الله مفعولا ‏)‏ وإن رسول الله صلى الله عليه وسلم لما تزوجها قالوا تزوج حليلة ابنه فأنزل الله تعالى ‏:‏ ‏(‏ ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين ‏)‏ وكان رسول الله صلى الله عليه وسلم تبناه وهو صغير فلبث حتى صار رجلا يقال له زيد بن محمد فأنزل الله ‏:‏ ‏(‏ ادعوهم لآبائهم هو أقسط عند الله فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم ‏)‏ فلان مولى فلان وفلان أخو فلان  ‏(‏هو أقسط عند الله ‏)‏ يعني أعدل عند الله ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated 'Aishah [may Allah be pleased with her]:                     \"If the Messenger of Allah (ﷺ) was to have concealed anything that was revealed to him, then he would have concealed these Ayat: 'When you said to him on whom Allah has bestowed grace (meaning by Islam); and you have done a favor (meaning that he was a slave and you freed him) \"Keep your wife to yourself, and have Taqwa of Allah.\" But you did hide in yourself that which Allah will make manifest, you did fear the people whereas Allah had better right that you should fear Him' up to His saying: 'And Allah's command must be fulfilled (33:37).' They said: 'He married his wife's son, so Allah revealed: 'Muhammad is not the father of any of your men, but he is the Messenger of Allah and the Last of the Prophets (33:40).' The Messenger of Allah (ﷺ) had taken (adopted) him as a son when he was small, and he remained being called 'Zaid bin Muhammad' until he grew up to adulthood, then Allah revealed: 'Call them by their fathers, then your brothers in religion and your Mawali (33:5). (Say) So-and-so, the Mawla of so-and-so, and; So-and-so, the brother of so-and-so. 'That is more just with Allah' meaning that doing that is more just to Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "24124",
        "11585",
        "11052",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3513",
      "hadith_no": "3513",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "قد روي عن داود بن أبي هند، عن الشعبي، عن مسروق، عن عائشة، قالت لو كان النبي صلى الله عليه وسلم كاتما شيئا من الوحى لكتم هذه الآية ‏:‏ ‏(‏ إذ تقول للذي أنعم الله عليه وأنعمت عليه ‏)‏ الآية هذا الحرف لم يرو بطوله ‏.‏ حدثنا بذلك عبد الله بن وضاح الكوفي حدثنا عبد الله بن إدريس عن داود بن أبي هند ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11585",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3514",
      "hadith_no": "3514",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن أبان، حدثنا ابن أبي عدي، عن داود بن أبي هند، عن الشعبي، عن مسروق، عن عائشة، رضى الله عنها قالت لو كان النبي صلى الله عليه وسلم كاتما شيئا من الوحى لكتم هذه الآية ‏:‏ ‏(‏ إذ تقول للذي أنعم الله عليه وأنعمت عليه ‏)‏ الآية ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Aishah [may Allah be pleased with her]:                     \"If the Prophet (ﷺ) was to have hidden anything from the Revelation, then he would have hidden this Ayah: 'When you said to him on whom Allah has bestowed grace and you have done a favor (33:37).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20276",
        "11585",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3516",
      "hadith_no": "3516",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة، - بصري - حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن عامر الشعبي، في قول الله عز وجل ‏:‏ ‏(‏ ما كان محمد أبا أحد من رجالكم ‏)‏ قال ما كان ليعيش له فيكم ولد ذكر ‏.‏",
      "text_en": " Narrated Dawud bin Abi Hind:                     from Ash-Sha'bi regarding the saying of Allah [the Mighty and Sublime]: 'Muhammad is not the father of any one of your men (33:40)' he said: \"No male children of his would live among them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11585"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3550",
      "hadith_no": "3550",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن داود بن أبي هند، عن الشعبي، عن مسروق، عن عائشة، أنها قالت يا رسول الله ‏:‏ ‏(‏والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه ‏)‏ فأين المؤمنون يومئذ قال ‏\"‏ على الصراط يا عائشة ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Masruq:                     that 'Aishah said: \"O Messenger of Allah! - On the Day of Resurrection the whole earth will be grasped by His Hand and the heavens will be rolled up in His Right Hand (39:67). Where will the believers be?\" He said: \"Upon the Sirat O 'Aishah!\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11585",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3578",
      "hadith_no": "3578",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري البصري، حدثنا أبو زيد، عن شعبة، عن داود بن أبي هند، قال سمعت الشعبي، يحدث عن أبي جبيرة بن الضحاك، قال كان الرجل منا يكون له الاسمين والثلاثة فيدعى ببعضها فعسى أن يكره قال فنزلت هذه الآية ‏(‏ ولا تنابزوا بالألقاب ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ أبو جبيرة هو أخو ثابت بن الضحاك بن خليفة أنصاري وأبو زيد سعيد بن الربيع صاحب الهروي بصري ثقة ‏.‏",
      "text_en": " Narrated Abu Jubairah bin Ad-Dahhak:                     \"A man among us would be known by two or three names. He would be called by one that perhaps he disliked, so this Ayah was revealed: Nor insult with nicknames (49:11).\"",
      "usc_msa_ref": "",
      "chain": [
        "20020",
        "11585",
        "11052",
        "1903"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3579",
      "hadith_no": "3579",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن داود بن أبي هند، عن الشعبي، عن أبي جبيرة بن الضحاك، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20212",
        "11585",
        "11052",
        "1903"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3672",
      "hadith_no": "3672",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن سعيد أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن داود بن أبي هند، عن عكرمة، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يصلي فجاء أبو جهل فقال ألم أنهك عن هذا ألم أنهك عن هذا ألم أنهك عن هذا فانصرف النبي صلى الله عليه وسلم فزبره فقال أبو جهل إنك لتعلم ما بها ناد أكثر مني فأنزل الله ‏:‏ ‏(‏ فليدع ناديه * سندع الزبانية ‏)‏ فقال ابن عباس فوالله لو دعا ناديه لأخذته زبانية الله ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وفيه عن أبي هريرة رضى الله عنه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     “The Prophet was performing Salat when Abu Jahl came to him and said: ‘Have I not forbidden you from this? Have I not forbidden you from this? Have I not forbidden you from this?’ The Prophet turned and scolded him. So Abu Jahl said: ‘You know that no one has more to call for assistance than me.’ So Allah, Blessed is He and Most High, revealed: Then let him call upon his council. We will call out the guards of Hell.” So Ibn Abbas said: “By Allah, if he had called his council, then the guards of Hell would have seized him.”",
      "usc_msa_ref": "",
      "chain": [
        "20326",
        "11585",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1364",
      "hadith_no": "1364",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا النبي صلى الله عليه وسلم حتى بقي سبع من الشهر فقام بنا حتى ذهب نحو من ثلث الليل ثم كانت سادسة فلم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب نحو من شطر الليل قلنا يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال ثم كانت الرابعة فلم يقم بنا فلما بقي ثلث من الشهر أرسل إلى بناته ونسائه وحشد الناس فقام بنا حتى خشينا أن يفوتنا الفلاح ثم لم يقم بنا شيئا من الشهر ‏.‏ قال داود قلت ما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted Ramadan with the Messenger of Allah (ﷺ), and the Prophet (ﷺ) did not lead us in Qiyam until there were seven days left of the month, then he led us in Qiyam until one-third of the night had passed. Then, when there were six days left, he did not lead us in Qiyam. When there were five days left, he led us in praying Qiyam until half the night had passed. We said: 'O Messenger of Allah (SA), why don't you lead us in praying Qiyam for the rest of the night?' He said: 'If a man prays with the Imam until he leaves, that will be continued for him as if he spent the whole night in prayer.' Then, when there were four days left, he did not lead us in praying Qiyam. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying Qiyam until we feared that we would miss Al-Falah. Then he did not lead us in praying Qiyam for the rest of the month.\" Dawud (one of the narrators) said: \"I said: ' What is falah?' He said: 'Sahur.'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-15",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، قال حدثنا داود بن أبي هند، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ على كل رجل مسلم في كل سبعة أيام غسل يوم وهو يوم الجمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah (ﷺ) said: 'Every Muslim man has to perform Ghusl one day in every seven, and that is on Friday.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "11585",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1605",
      "hadith_no": "1605",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم في رمضان فلم يقم بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة فقام بنا في الخامسة حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ قال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب الله له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا ولم يقم حتى بقي ثلاث من الشهر فقام بنا في الثالثة وجمع أهله ونساءه حتى تخوفنا أن يفوتنا الفلاح ‏.‏ قلت وما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted with the Messenger of Allah (ﷺ) in Ramadan and he did not lead us in praying Qiyam until there were seven days left in the month, when he led us in praying Qiyam until one-third of the night had passed. Then he did not lead us in praying Qiyam when there were six days left. Then he led us praying Qiyam when there were five days left until one-half of the night had passed. I said: \"O Messenger of Allah! What if we spend the rest of this night praying Nafl?\" He said: \"Whoever prays Qiyam with the Imam until he finishes, Allah (SWT) will record for him the Qiyam of a (whole) night.\" Then he did not lead us in prayer or pray Qiyam until there were three days of the month left. Then he led us in praying Qiyam when there were three days left. He gathered his family and wives (and led us in prayer) until we feared that we would miss Al-Falah. I (one of the narrators) said: \"What is Al-Falah?\" He said: \"The suhur\".",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3296",
      "hadith_no": "3296",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا المعتمر، عن داود بن أبي هند، عن الشعبي، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم أن تنكح المرأة على عمتها والعمة على بنت أخيها ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah forbade taking a woman as a co-wife to her paternal aunt or her maternal aunt.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20288",
        "11585",
        "11052",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3358",
      "hadith_no": "3358",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن داود بن أبي هند، عن الشعبي، عن علقمة، عن عبد الله، أنه أتاه قوم فقالوا إن رجلا منا تزوج امرأة ولم يفرض لها صداقا ولم يجمعها إليه حتى مات ‏.‏ فقال عبد الله ما سئلت منذ فارقت رسول الله صلى الله عليه وسلم أشد على من هذه فأتوا غيري ‏.‏ فاختلفوا إليه فيها شهرا ثم قالوا له في آخر ذلك من نسأل إن لم نسألك وأنت من جلة أصحاب محمد صلى الله عليه وسلم بهذا البلد ولا نجد غيرك ‏.‏ قال سأقول فيها بجهد رأيي فإن كان صوابا فمن الله وحده لا شريك له وإن كان خطأ فمني ومن الشيطان والله ورسوله منه برآء أرى أن أجعل لها صداق نسائها لا وكس ولا شطط ولها الميراث وعليها العدة أربعة أشهر وعشرا ‏.‏ قال وذلك بسمع أناس من أشجع فقاموا فقالوا نشهد أنك قضيت بما قضى به رسول الله صلى الله عليه وسلم في امرأة منا يقال لها بروع بنت واشق ‏.‏ قال فما رئي عبد الله فرح فرحة يومئذ إلا بإسلامه ‏.‏",
      "text_en": " It was narrated from 'Abdullah that some people came to him and said:                      \"A man among us married a woman, but he did not name a dowry for her, and he did not have intercourse with her before he died.\" 'Abdullah said: 'Since I left the Messenger of Allah I have never been asked a more difficult question than this. Go to someone else.' They kept coming to him for a month, then at the end of that they said: 'Who shall we ask if we do not ask you? You are one of the most prominent Companions of Muhammad in this land and we cannot find anyone else.' He said: 'I will say what I think, and if it is correct then it is from Allah alone, with no partner, and if it is wrong then it is from me and from the Shaitan, and Allah and His Messenger have nothing to do with it. I think she should be given a dowry like that of her peers and no less, with no injustice, and she may inherit from him, and she has to observe the 'Iddah, four months and ten days.'\" He said: \"And that was heard by some people from Ashja', who stood up and said: 'We bear witness that you have passed the same judgment as the Messenger of Allah did concerning a woman from among us who was called Birwa' bint Washiq.'\" He said: \"Abdullah was never seen looking so happy as he did on that day, except with having accepted Islam.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11585",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-3548",
      "hadith_no": "3548",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يعقوب بن ماهان، - بصري - عن هشيم، قال حدثنا سيار، وحصين، ومغيرة، وداود بن أبي هند، وإسماعيل بن أبي خالد، وذكر، آخرين عن الشعبي، قال دخلت على فاطمة بنت قيس فسألتها عن قضاء، رسول الله صلى الله عليه وسلم عليها فقالت طلقها زوجها البتة فخاصمته إلى رسول الله صلى الله عليه وسلم في السكنى والنفقة قالت فلم يجعل لي سكنى ولا نفقة وأمرني أن أعتد في بيت ابن أم مكتوم ‏.‏",
      "text_en": " It was narrated that Ash-Sha'bi said:                      \"I came to Fatimah bint Qais and asked her about the ruling of the Messenger of Allah concerning her. She said that her husband divorced her irrevocably, and she referred her dispute with him, concerning accommodation and maintenance, to the Messenger of Allah. She said: 'He did not give me (the right to) accommodation and maintenance, and he told me to observe my 'Iddah in the house of Ibn Umm Maktum,'\"",
      "usc_msa_ref": "",
      "chain": [
        "36690",
        "20468",
        "11429",
        "15097",
        "11072",
        "11585",
        "11418",
        "11052"
      ]
    },
    {
      "id": "sunan-an-nasai-3738",
      "hadith_no": "3738",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن داود بن أبي هند، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرقبى لمن أرقبها ‏\"‏ ‏.‏",
      "text_en": " Khalid narrated from Dawud bin Abi Hind, from Abu Az-Zubair, from Jabir, who said:                      \"The Messenger of Allah said: 'Ruqba belongs to the one to whom it is given.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "11585",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4394",
      "hadith_no": "4394",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، عن ابن أبي زائدة، قال أنبأنا أبي، عن فراس، عن عامر، عن البراء بن عازب، ح وأنبأنا داود بن أبي هند، عن الشعبي، عن البراء، - فذكر أحدهما ما لم يذكر الآخر - قال قام رسول الله صلى الله عليه وسلم يوم الأضحى فقال ‏\"‏ من وجه قبلتنا وصلى صلاتنا ونسك نسكنا فلا يذبح حتى يصلي ‏\"‏ ‏.‏ فقام خالي فقال يا رسول الله إني عجلت نسكي لأطعم أهلي وأهل داري أو أهلي وجيراني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعد ذبحا آخر ‏\"‏ ‏.‏ قال فإن عندي عناق لبن هي أحب إلى من شاتى لحم ‏.‏ قال ‏\"‏ اذبحها فإنها خير نسيكتيك ولا تقضي جذعة عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Bara bin 'Azib said:                     \"The Messenger of Allah stood up on the Day of Sacrifice and Said: 'Whoever turn toward our Qiblah and prays as we pray and offers the same sacrifice as we do, let him not offer his sacrifice until he has prayed; My maternal uncle stood up and said: 'O Messenger of Allah, I hastened to slaughter my sacrifice, so that I could feed my family,. And the members of my household,; or my family and my neighbors,; The Messenger of Allah said; 'Offer another sacrifice,; He said: 'I have a suckling she-goat kid that is dearer to me than two sheep raised for meat,' He said: 'Sacrifice it, for it is the better of your two sacrifices. But no Jadh'ah will do as a sacrifice for anyone after you.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20366",
        "11338",
        "11385",
        "11052",
        "400",
        "11585",
        "11052"
      ]
    },
    {
      "id": "sunan-an-nasai-4455",
      "hadith_no": "4455",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا ابن أبي عدي، عن داود بن أبي هند، عن سعيد بن أبي خيرة، عن الحسن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي على الناس زمان يأكلون الربا فمن لم يأكله أصابه من غباره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: \"There will come a time when there will be no one left who does not consume Riba, and whoever does not consume it will nevertheless be affected by residue.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20276",
        "11585",
        "14146",
        "11016",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5353",
      "hadith_no": "5353",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد بن زريع، قال حدثنا داود بن أبي هند، قال حدثنا عزرة، عن حميد بن عبد الرحمن، عن سعد بن هشام، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان لنا ستر فيه تمثال طير مستقبل البيت إذا دخل الداخل فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة حوليه فإني كلما دخلت فرأيته ذكرت الدنيا ‏\"‏ ‏.‏ قالت وكان لنا قطيفة لها علم فكنا نلبسها فلم نقطعه ‏.‏",
      "text_en": " It was narrated that 'Aishah, the wife of the Prophet [SAW], said:                     \"We had a curtain on which there were images of birds, at the entrance to the house. The Messenger of Allah [SAW] said: 'O 'Aishah, remove it, for ever time I come in and see it, I remember this world.'\" She said: \"We had a plush wrap, with a border on it, that we would wear, and it was not cut off.\"",
      "usc_msa_ref": "",
      "chain": [
        "30448",
        "20304",
        "11585",
        "10799",
        "10561",
        "11166"
      ]
    },
    {
      "id": "sunan-an-nasai-5745",
      "hadith_no": "5745",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سفيان، عن داود بن أبي هند، عن سعيد بن المسيب، أنه قال في النبيذ خمره درديه ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said concerning Nabidh:                     \"The dregs are what intoxicates.\"",
      "usc_msa_ref": "",
      "chain": [
        "18",
        "20005",
        "11585",
        "11002"
      ]
    },
    {
      "id": "sunan-ibn-majah-90",
      "hadith_no": "90",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا داود بن أبي هند، عن عمرو بن شعيب، عن أبيه، عن جده، قال خرج رسول الله  صلى الله عليه وسلم  على أصحابه وهم يختصمون في القدر فكأنما يفقأ في وجهه حب الرمان من الغضب فقال ‏\"‏ بهذا أمرتم أو لهذا خلقتم تضربون القرآن بعضه ببعض ‏.‏ بهذا هلكت الأمم قبلكم ‏\"‏ ‏.‏ قال فقال عبد الله بن عمرو ما غبطت نفسي بمجلس تخلفت فيه عن رسول الله  صلى الله عليه وسلم  ما غبطت نفسي بذلك المجلس وتخلفي عنه.‏",
      "text_en": " 'Amr in Shu'aib narrated from his father that his grandfather said:                     \"The Messenger of Allah (ﷺ) came out to his Companions when they were disputing about the Divine Decree, and it was as if pomegranate seeds had burst on his face (i.e. turned red) because of anger. He said: 'Have you been commanded to do this, or were you created for this purpose? You are using one part of the Qur'an against another part, and this is what led to the doom of the nations who came before you.'\" 'Abdullah bin 'Amr said: \"I was never happy to have missed a gathering with the Messenger of Allah (ﷺ) as I was to have missed that gathering.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20354",
        "11585",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-693-2",
      "hadith_no": "693",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا عبد الوارث بن سعيد، حدثنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد، قال صلى بنا رسول الله  صلى الله عليه وسلم  صلاة المغرب ثم لم يخرج حتى ذهب شطر الليل فخرج فصلى بهم ثم قال ‏\"‏ إن الناس قد صلوا وناموا وأنتم لم تزالوا في صلاة ما انتظرتم الصلاة ولولا الضعيف والسقيم أحببت أن أؤخر هذه الصلاة إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah led us for the Maghrib prayer. Then he did not come out until half the night had passed. Then he came out and led them in prayer, then he said: \"The people have prayed and gone to sleep, but you are still in a state of prayer so long as you are waiting for the (next) prayer. Were it not for the weak and the sick, I wanted to delay this prayer until the middle of the night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20258",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1388",
      "hadith_no": "1388",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير الحضرمي، عن أبي ذر، قال صمنا مع رسول الله  صلى الله عليه وسلم  رمضان فلم يقم بنا شيئا منه حتى بقي سبع ليال فقام بنا ليلة السابعة حتى مضى نحو من ثلث الليل ثم كانت الليلة السادسة التي تليها فلم يقمها حتى كانت الخامسة التي تليها ثم قام بنا حتى مضى نحو من شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف فإنه يعدل قيام ليلة ‏\"‏ ‏.‏ ثم كانت الرابعة التي تليها فلم يقمها حتى كانت الثالثة التي تليها ‏.‏ قال فجمع نساءه وأهله واجتمع الناس ‏.‏ قال فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قيل وما الفلاح قال السحور ‏.‏ قال ثم لم يقم بنا شيئا من بقية الشهر ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “We fasted Ramadan with theMessengerof Allah (ﷺ) and he did not lead us in praying Qiyam(prayers atnight) during any part of it, until there were sevennights left. Heled us in praying Qiyam on the seventh night untilapproximately onethird of the night had passed. Then on the sixthnight which followedit he did not lead us in prayer. Then he led usin praying Qiyam onthe fifth night which followed it until almosthalf the night hadpassed. I said: ‘O Messenger of Allah, would thatwe had offeredvoluntary prayers throughout the whole night.’ He said:‘Whoeverstands with the Imam until he finishes, it is equivalent tospendingthe whole night in prayer.’ Then on the fourth night whichfollowedit, he did not lead us in prayer, until the third night thatfollowedit, when he gathered his wives and family, and he peoplegathered,and he led us in prayer until we feared that we would misstheFalah.” It was asked: “What is the Falah?” He said: “Suhur.”Hesaid: “Then he did not lead us in prayer at night for the restof themonth.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20568",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1492",
      "hadith_no": "1492",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا سليمان بن حرب، حدثنا حماد بن سلمة، عن داود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي  صلى الله عليه وسلم  ح وحدثنا الحسن بن محمد بن الصباح، حدثنا عفان، حدثنا حماد، أنبأنا حميد، عن الحسن، عن رجل، عن أبي هريرة، وداود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أول ما يحاسب به العبد يوم القيامة صلاته فإن أكملها كتبت له نافلة فإن لم يكن أكملها قال الله سبحانه لملائكته انظروا هل تجدون لعبدي من تطوع فأكملوا بها ما ضيع من فريضته ‏.‏ ثم تؤخذ الأعمال على حسب ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Tamim Dari that the Prophet (ﷺ) said:                      “Thefirstthing for which a person will be brought to account on the DayofResurrection will be his prayer. If it is complete, then thevoluntary (prayers) will also be recorded for him (as an increase).Ifit is not complete then Allah will say to His angels: ‘Look andseewhether you find any voluntary prayers for My slave, and takethem tomake up what is lacking from his obligatory prayers.’ Thenall hisdeeds will be reckoned in like manner.”",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20193",
        "20021",
        "11585",
        "11284",
        "382"
      ]
    },
    {
      "id": "sunan-ibn-majah-1968",
      "hadith_no": "1968",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يزيد بن زريع، حدثنا داود بن أبي هند، حدثني عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الحمد لله نحمده ونستعينه ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله ‏.‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet (ﷺ) said: “Al-hamdu lillahi nahmadhu wa nasta'inuhu wa na'udhu billahi min shururi anfusina wa min sayi'ati a'malina lahu, wa man yudil fala mudilla lahu, wa man yudil fala hadiaya lahu. Wa ashadu Anna la ilaha illallahu wahduhu la sharika lahu, wa rashulhu. Ammaba'd: (Praise is to Allah, we praise Him and we seek His help. We seek refuge with Allah from the evil of our own souls and from our bad deeds, Whomsoever is led astray; and whomsoever is led astray; no one can guide. I bear witness that none has the right to be worshiped but Allah, alone with no partner or associate, and that Muhammad is His slave and His Messenger To proceed:).”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11585",
        "10602",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2106",
      "hadith_no": "2106",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن داود بن أبي هند، عن الشعبي، عن مسروق، وعمرو بن عتبة، أنهما كتبا إلى سبيعة بنت الحارث يسألانها عن أمرها، فكتبت إليهما إنها وضعت بعد وفاة زوجها بخمسة وعشرين فتهيأت تطلب الخير فمر بها أبو السنابل بن بعكك فقال قد أسرعت اعتدي آخر الأجلين أربعة أشهر وعشرا ‏.‏ فأتيت النبي  صلى الله عليه وسلم  فقلت يا رسول الله استغفر لي ‏.‏ قال ‏\"‏ ومم ذاك ‏\"‏ ‏.‏ فأخبرته ‏.‏ فقال ‏\"‏ إن وجدت زوجا صالحا فتزوجي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Masruq and 'Amr bin 'Utbah wrote to Subai'ah bint Harith, asking about her case.:                     She wrote to them saying that she gave birth twenty-five days after her husband died. Then she prepared herself, seeking to remarry. Abu Sanabil bin Ba'kak passed by her and said: \"You are in a hurry; observe waiting period for the longer period, four months and ten days.\" \"So I went to the Prophet (ﷺ) and said: 'O Messenger of Allah, (ﷺ) pray for forgiveness for me.' He said: 'Why is that.” I told him (what had happened). He said: 'If you find a righteous husband then marry him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11585",
        "11052",
        "11018"
      ]
    },
    {
      "id": "sunan-ibn-majah-2150",
      "hadith_no": "2150",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا الحسن بن قزعة، حدثنا مسلمة بن علقمة، حدثنا داود بن أبي هند، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله  صلى الله عليه وسلم  من نسائه وحرم فجعل الحرام حلالا ‏.‏ وجعل في اليمين كفارة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah swore to keep away from his wives and declared them as unlawful for him, so he made something permissible forbidden, and he offered expiation for having sworn to do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11585",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2364",
      "hadith_no": "2364",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا إسماعيل ابن علية، حدثنا داود بن أبي هند، عن سعيد بن أبي خيرة، عن الحسن، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليأتين على الناس زمان لا يبقى منهم أحد إلا أكل الربا فمن لم يأكل أصابه من غباره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “There will come a time when there will be no one left who does not consume usury (interest), and whoever does not consume it will nevertheless be affected by it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20208",
        "11585",
        "14146",
        "11016",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2465",
      "hadith_no": "2465",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، عن داود بن أبي هند، عن الشعبي، عن النعمان بن بشير، قال انطلق به أبوه يحمله إلى النبي صلى الله عليه وسلم فقال اشهد أني قد نحلت النعمان من مالي كذا وكذا ‏.‏ قال ‏\"‏ فكل بنيك نحلت مثل الذي نحلت النعمان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فأشهد على هذا غيري ‏\"‏ ‏.‏ قال ‏\"‏ أليس يسرك أن يكونوا لك في البر سواء ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nu'man bin Bashir said that his father took him to the Prophet (ﷺ) and said:                     “Bear witness that I have given Nu'man such and such from my wealth.” He said: “Have you given all your children something like that which you have given to Nu'man?” He said: “No.” He said: “Then let someone other than me bear witness to that.” And he said: “Would you not like all your children to honor you equally?” He said: “Of course.” He said: “Then do not do this.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11585",
        "11052",
        "274"
      ]
    },
    {
      "id": "sunan-ibn-majah-3003",
      "hadith_no": "3003",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن داود بن أبي هند، عن أبي العالية، عن ابن عباس، قال كنا مع رسول الله  صلى الله عليه وسلم  بين مكة والمدينة فمررنا بواد فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ قالوا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى  صلى الله عليه وسلم  - فذكر من طول شعره شيئا لا يحفظه داود - واضعا إصبعيه في أذنيه له جؤار إلى الله بالتلبية مارا بهذا الوادي ‏\"‏ ‏.‏ قال ثم سرنا حتى أتينا على ثنية فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى أو لفت ‏.‏ قال ‏\"‏ كأني أنظر إلى يونس على ناقة حمراء عليه جبة صوف وخطام ناقته خلبة مارا بهذا الوادي ملبيا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “We were with the Messenger ofAllah (ﷺ) between Makkah and Al-Madinah, and we passed through avalley. He said: ‘What valley is this?’ They said: ‘AzraqValley.’ Hesaid: ‘It is as if I can see Musa (as) – and hementioned somethingabout the length of his hair, which Dawud (one ofthe narrators) didnot remember – ‘putting his fingers in hisears and raising his voiceto Allah reciting the Talbiyah, passingthrough this valley.’ Then wetraveled on until we came to a narrowpass, and he said: ‘What pass isthis?’ They said: ‘ThaniyyatHarsha’ or ‘Laft.’ He said: ‘It is as ifI can see Yunus, ona red she-camel, wearing a woollen cloak andholding the reins of hisshe-camel, woven from palm fibres, passingthrough this valley,reciting the Talbiyah.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3363",
      "hadith_no": "3363",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن سليمان، عن داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، قال نادى رسول الله  صلى الله عليه وسلم  رجل من أهل الصفة حين انصرف من الصلاة فقال يا رسول الله إن أرضنا أرض مضبة فما ترى في الضباب قال ‏\"‏ بلغني أنه أمة مسخت ‏\"‏ ‏.‏ فلم يأمر به ولم ينه عنه ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “A man from amongAhlus-Suffah called the Messenger of Allah (ﷺ) when he had finishedthe prayer, saying: ‘O Messenger of Allah! Our land is a landinfestedwith mastigures. What do you think of (eating) mastigures?’He said:‘I have heard that a nation was transformed.’ He did nottell us toeat them, and he did not forbid that.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20334",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3367",
      "hadith_no": "3367",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا داود بن أبي هند، عن الشعبي، عن محمد بن صفوان، أنه مر على النبي  صلى الله عليه وسلم  بأرنبين معلقهما فقال يا رسول الله إني أصبت هذين الأرنبين فلم أجد حديدة أذكيهما بها فذكيتهما بمروة أفآكل قال ‏\"‏ كل ‏\"‏ ‏.‏",
      "text_en": " it wasnarrated from Muhammad bin Safwan that he passed by theProphet (ﷺ)with two rabbits hanging down. He said:                      “O Messenger ofAllah, Icaught these two rabbits but I cannot find any iron* withwhich toslaughter them with Marwah** and eat them?” He said: “Eat.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11585",
        "11052"
      ]
    },
    {
      "id": "sunan-ibn-majah-3706-2",
      "hadith_no": "3706",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يزيد بن هارون، أنبأنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، أن أبا موسى، استأذن على عمر ثلاثا فلم يؤذن له فانصرف فأرسل إليه عمر ما ردك قال استأذنت الاستئذان الذي أمرنا به رسول الله  صلى الله عليه وسلم  ثلاثا فإن أذن لنا دخلنا وإن لم يؤذن لنا رجعنا ‏.‏ قال فقال لتأتيني على هذا ببينة أو لأفعلن ‏.‏ فأتى مجلس قومه فناشدهم فشهدوا له فخلى سبيله ‏.‏",
      "text_en": " It was narrated from Abu Saeed Khudri that Abu Musa asked permission to enter upon 'Umar three times, and he did not give him permission, so he went away.'Umar sent word to him saying:                     \"Why did you go back?\" He said: \"I asked permission to enter three times, as the Messenger of Allah(ﷺ) enjoined upon us, then if we are given permission we should enter, otherwise we should go back.\" He said: \"You should bring me proof of that, or else!\" Then he came to a gathering of his people and asked them to swear by Allah concerning that, and they did so, so he let him go.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20472",
        "11585",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 65
}