{
  "id": "11586",
  "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
  "full_name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "141",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  ق  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-'Anbari",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "12246",
      "name": "'Abdullah bin Muhammad bin 'Aqil عبد الله بن محمد بن عقيل بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11433",
      "name": "'Abdullah bin Tawus عبد الله بن طاوس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11601",
      "name": "'Ata'a bin Abi Maymuna عطاء بن أبي ميمونة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24357",
      "name": "'Isa bin Shu'aib bin Shu'aib عيسى بن شعيب بن شعيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24082",
      "name": "al-Hasan bin Habib bin Ndbh الحسن بن حبيب بن ندبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20565",
      "name": "Muhammad bin Swa'a محمد بن سواء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "217",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل بن إبراهيم، قال حدثني روح بن القاسم، قال حدثني عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا تبرز لحاجته أتيته بماء فيغسل به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet went to answer the call of nature, I used to bring water with which he used to clean his private parts.",
      "chain": [
        "20184",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "1481",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، عن إسماعيل بن أمية، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس  رضى الله عنهما أن رسول الله صلى الله عليه وسلم لما بعث معاذا  رضى الله عنه  على اليمن قال ‏\"‏ إنك تقدم على قوم أهل كتاب، فليكن أول ما تدعوهم إليه عبادة الله، فإذا عرفوا الله فأخبرهم أن الله قد فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا فعلوا، فأخبرهم أن الله فرض عليهم زكاة ‏{‏تؤخذ‏}‏ من أموالهم وترد على فقرائهم، فإذا أطاعوا بها فخذ منهم، وتوق كرائم أموال الناس ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle (p.b.u.h) sent Mu`adh to Yemen, he said (to him), \"YOU are going to people of a (Divine) Book. First of all invite them to worship Allah (alone) and when they come to know Allah, inform them that Allah has enjoined on them, five prayers in every day and night; and if they start offering these prayers, inform them that Allah has enjoined on them, the Zakat. And it is to be taken from the rich amongst them and given to the poor amongst them; and if they obey you in that, take Zakat from them and avoid (don't take) the best property of the people as Zakat.\"",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11417",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3164",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، قال أخبرني روح بن القاسم، عن محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم قال لي ‏\"‏ لو قد جاءنا مال البحرين قد أعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فلما قبض رسول الله صلى الله عليه وسلم وجاء مال البحرين قال أبو بكر من كانت له عند رسول الله صلى الله عليه وسلم عدة فليأتني‏.‏ فأتيته فقلت إن رسول الله صلى الله عليه وسلم قد كان قال لي ‏\"‏ لو قد جاءنا مال البحرين لأعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فقال لي احثه‏.‏ فحثوت حثية فقال لي عدها‏.‏ فعددتها فإذا هي خمسمائة، فأعطاني ألفا وخمسمائة‏.‏ وقال إبراهيم بن طهمان عن عبد العزيز بن صهيب، عن أنس، أتي النبي صلى الله عليه وسلم بمال من البحرين فقال ‏\"‏ انثروه في المسجد ‏\"‏ فكان أكثر مال أتي به رسول الله صلى الله عليه وسلم إذ جاءه العباس فقال يا رسول الله، أعطني إني فاديت نفسي وفاديت عقيلا‏.‏ قال ‏\"‏ خذ ‏\"‏‏.‏ فحثا في ثوبه، ثم ذهب يقله، فلم يستطع‏.‏ فقال أمر بعضهم يرفعه إلى‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر منه، ثم ذهب يقله فلم يرفعه‏.‏ فقال أمر بعضهم يرفعه على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر ثم احتمله على كاهله ثم انطلق، فما زال يتبعه بصره حتى خفي علينا عجبا من حرصه، فما قام رسول الله صلى الله عليه وسلم وثم منها درهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle once said to me, \"If the revenue of Bahrain came, I would give you this much and this much.\" When Allah's Apostle had died, the revenue of Bahrain came, and Abu Bakr announced, \" Let whoever was promised something by Allah's Apostle come to me.\" So, I went to Abu Bakr and said, \"Allah's Apostle said to me, 'If the revenue of Bahrain came, I would give you this much and this. much.\" On that Abu Bakr said to me, \"Scoop (money) with both your hands.\" I scooped money with both my hands and Abu Bakr asked me to count it. I counted it and it was five-hundred (gold pieces). The total amount he gave me was one thousand and five hundred (gold pieces.) Narrated Anas: Money from Bahrain was brought to the Prophet . He said, \"Spread it in the Mosque.\" It was the biggest amount that had ever been brought to Allah's Apostle . In the meantime Al-`Abbas came to him and said, \"O Allah's Apostle! Give me, for I gave the ransom of myself and `Aqil.\" The Prophet said (to him), \"Take.\" He scooped money with both hands and poured it in his garment and tried to lift it, but he could not and appealed to the Prophet, \"Will you order someone to help me in lifting it?\" The Prophet said, \"No.\" Then Al-`Abbas said, \"Then will you yourself help me carry it?\" The Prophet said, \"No.\" Then Al `Abbas threw away some of the money, but even then he was not able to lift it, and so he gain requested the Prophet \"Will you order someone to help me carry it?\" The Prophet said, \"No.\" Then Al-`Abbas said, \"Then will you yourself yelp me carry it?\" The Prophet said, 'No.\" So, Al-`Abbas threw away some more money and lifted it on his shoulder and went away. The Prophet kept on looking at him with astonishment at his greediness till he went out of our sight. Allah's Apostle did not get up from there till not a single Dirham remained from that money.",
      "chain": [
        "30026",
        "20208",
        "11586",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4864",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا يزيد بن زريع، عن روح بن القاسم، عن منصور، عن مجاهد، عن أبي معمر، عن ابن مسعود، ‏{‏وما كنتم تستترون أن يشهد، عليكم سمعكم‏}‏ الآية كان رجلان من قريش وختن لهما من ثقيف، أو رجلان من ثقيف وختن لهما من قريش في بيت فقال بعضهم لبعض أترون أن الله يسمع حديثنا قال بعضهم يسمع بعضه‏.‏ وقال بعضهم لئن كان يسمع بعضه لقد يسمع كله‏.‏ فأنزلت ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم‏}‏ الآية ‏{‏وذلكم ظنكم‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     (regarding) the Verse: 'And you have not been screening against yourself lest your ears, and your eyes and your skins should testify against you..' (41.22) While two persons from Quraish and their brotherin- law from Thaqif (or two persons from Thaqif and their brother-in-law from Quraish) were in a house, they said to each other, \"Do you think that Allah hears our talks?\" Some said, \"He hears a portion thereof\" Others said, \"If He can hear a portion of it, He can hear all of it.\" Then the following Verse was revealed: 'And you have not been screening against yourself lest your ears, and your eyes and your skins should testify against you...' (41.22)",
      "chain": [
        "30140",
        "20304",
        "11586",
        "11067",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "6101",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن عيسى، حدثنا محمد بن سواء، حدثنا روح بن القاسم، عن محمد بن المنكدر، عن عروة، عن عائشة، أن رجلا، استأذن على النبي صلى الله عليه وسلم فلما رآه قال ‏\"‏ بئس أخو العشيرة، وبئس ابن العشيرة ‏\"‏‏.‏ فلما جلس تطلق النبي صلى الله عليه وسلم في وجهه وانبسط إليه، فلما انطلق الرجل قالت له عائشة يا رسول الله حين رأيت الرجل قلت له كذا وكذا، ثم تطلقت في وجهه وانبسطت إليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة متى عهدتني فحاشا، إن شر الناس عند الله منزلة يوم القيامة من تركه الناس اتقاء شره ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          A man asked permission to enter upon the Prophet. When the Prophet saw     him, he said, \"What an evil brother of his tribe! And what an evil son     of his tribe!\" When that man sat down, the Prophet behaved with him in     a nice and polite manner and was completely at ease with him. When      that person had left, 'Aisha said (to the Prophet). \"O Allah's      Apostle! When you saw that man, you said so-and-so about him, then you     showed him a kind and polite behavior, and you enjoyed his company?\"      Allah's Apostle said, \"O 'Aisha! Have you ever seen me speaking a bad      and dirty language? (Remember that) the worst people in Allah's sight      on the Day of Resurrection will be those whom the people leave      (undisturbed) to be away from their evil (deeds).\"",
      "chain": [
        "30155",
        "20565",
        "11586",
        "11048",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "132",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أمية بن بسطام العيشي، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن إسماعيل بن أمية، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لما بعث معاذا إلى اليمن قال ‏\"‏ إنك تقدم على قوم أهل كتاب فليكن أول ما تدعوهم إليه عبادة الله عز وجل فإذا عرفوا الله فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم فإذا فعلوا فأخبرهم أن الله قد فرض عليهم زكاة تؤخذ من أغنيائهم فترد على فقرائهم فإذا أطاعوا بها فخذ منهم وتوق كرائم أموالهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that when the Messenger of Allah (may peace be upon him) sent Mu'adh towards Yemen (as governor) he said to him:                      Verily you would reach a community of the people of the Book, the very first thing to which you should call them is the worship of Allah, may His Glory be Magnificent, and when they become fully aware of Allah, instruct them that He has enjoined five prayers on them during the day and the night, and when they begin observing it, then instruct them that verily Allah has made Zakat obligatory for them which would be collected from the wealthy amongst them and distributed to their needy ones, and when they submit to it, then collect it from them and avoid (the temptation) of selecting the best (items) of their riches.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11417",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - حدثنا سهيل، عن عطاء بن يزيد، سمعه وهو، يحدث أبا صالح عن تميم الداري، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Umayya b. Bistam narrates the same hadith of the Messenger of Allah (may peace and blessings be upon him) on the authority of Tamim ad-Dari.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11206",
        "19291",
        "382"
      ]
    },
    {
      "hadith_no": "344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن منهال الضرير، وأمية بن بسطام العيشي، - واللفظ لأمية - قالا حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن العلاء، عن أبيه، عن أبي هريرة، قال لما نزلت على رسول الله صلى الله عليه وسلم ‏{‏ لله ما في السموات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شىء قدير‏}‏ قال فاشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم فأتوا رسول الله صلى الله عليه وسلم ثم بركوا على الركب فقالوا أى رسول الله كلفنا من الأعمال ما نطيق الصلاة والصيام والجهاد والصدقة وقد أنزلت عليك هذه الآية ولا نطيقها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم سمعنا وعصينا بل قولوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏\"‏ ‏.‏ قالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ‏.‏ فلما اقترأها القوم ذلت بها ألسنتهم فأنزل الله في إثرها ‏{‏ آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير‏}‏ فلما فعلوا ذلك نسخها الله تعالى فأنزل الله عز وجل ‏{‏ لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا‏}‏ قال نعم ‏{‏ ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا‏}‏ قال نعم ‏{‏ ربنا ولا تحملنا ما لا طاقة لنا به‏}‏ قال نعم ‏{‏ واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين‏}‏ قال نعم ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that when it was revealed to the Messenger of Allah (may peace be upon him):                      To Allah belongs whatever is in the heavens and whatever is in the earth and whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it. Then He forgives whom He pleases and chastises whom He Pleases; and Allah is over everything Potent\" (ii. 284). the Companions of the Messenger of Allah (may peace be upon him) felt it hard and severe and they came to the Messenger of Allah (may peace be upon him) and sat down on their knees and said: Messenger of Allah, we were assigned some duties which were within our power to perform, such as prayer, fasting, struggling (in the cause of Allah), charity. Then this (the above-mentioned) verse was revealed unto you and it is beyond our power to live up to it. The Messenger of Allah (may peace be upon him) said: Do you intend to say what the people of two books (Jews and Christians) said before you:\" We hear and disobey\"? You should rather say:\" We hear and we obey, (we seek) Thy forgiveness, our Lord! and unto Thee is the return.\" And they said:\" We hear and we obey, (we seek) Thy forgiveness, Our Lord! and unto Thee is the return.\" When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards:\" The Apostle believes in that which is sent down unto him from his Lord, and so do the believers. Each one believes in Allah and His Angels and His Books and His Apostles, saying: We differentiate not between any of His Apostles and they say: We hearken and we obey: (we seek) Thy forgiveness, our Lord! and unto Thee is the return\" (ii. 285). When they did that, Allah abrogated this (verse) and the Great, Majestic Allah revealed:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, punish us not if we forget or make a mistake.\" (The Prophet said: ) Yes, our Lord! do not lay on us a burden as Thou didst lay on those before us. (The Prophet said: ) Yes, our Lord, impose not on us (burdens) which we have not the strength to bear (The Prophet said: ) Yes, and pardon us and grant us protection! and have mercy on us. Thou art our Patron, so grant us victory over the disbelieving people\" (ii. 286). He (the Lord) said: Yes.",
      "chain": [
        "30173",
        "30124",
        "20304",
        "11586",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني زهير بن حرب، وأبو كريب - واللفظ لزهير - حدثنا إسماعيل، - يعني ابن علية - حدثني روح بن القاسم، عن عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يتبرز لحاجته فآتيه بالماء فيتغسل به ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) went to a far-off place in the desert (hidden from the sight of human beings) for relieving himself. Then I brought water for him and he cleansed himself.",
      "chain": [
        "30022",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنيه أحمد الدارمي، حدثنا زكرياء بن عدي، حدثنا يزيد، - يعني ابن زريع - عن روح بن القاسم، حدثنا أيوب بن موسى، بهذا الإسناد وقال أفأحله فأغسله من الجنابة ‏.‏ ولم يذكر الحيضة ‏.‏",
      "text_en": " This hadith is narrated by the same chain of transmitters by Ahmad al. Darimi, Zakariya b. 'Adi, Yazid, i. e. ' Ibn Zurai', Rauh b. al-Qasim, Ayyub b. Musa with the same chain of transmitters, and there is a mention of these words:                     \" Should I undo the plait and wash it, because of sexual intercourse?\" and there is no mention of menstruation.",
      "chain": [
        "30464",
        "20304",
        "11586",
        "11241"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل، بهذا الإسناد ‏.‏ وساق الحديث ‏.‏  وحدثنيه محمد بن عبد الله بن بزيع، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، حدثنا سهيل بن أبي صالح، بهذا الإسناد وقال بدل عقصاء عضباء وقال ‏\"‏ فيكوى بها جنبه وظهره ‏\"‏ ‏.‏ ولم يذكر جبينه ‏.‏",
      "text_en": " This hadith has been narrated by Suhail b. Abu Salih with the same chain of transmitters, and he said he substituted the word aqsa' with 'adba' and said:                     \" his side and his back,\" but he made no mention of his forehead.",
      "chain": [
        "30367",
        "20167",
        "20304",
        "11586"
      ]
    },
    {
      "hadith_no": "2391",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح بن القاسم، ح وحدثنيه أحمد بن عثمان الأودي، حدثنا خالد بن مخلد، حدثني سليمان، - يعني ابن بلال - كلاهما عن سهيل، بهذا الإسناد ‏.‏ في حديث روح ‏\"‏ من الكسب الطيب فيضعها في حقها ‏\"‏ ‏.‏ وفي حديث سليمان ‏\"‏ فيضعها في موضعها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters with a change of words. In the hadith transmitted Rauh (the words are):                     \" Out of the honest earning and its spending at what is its (due) right\" ; and in the hadith transmitted by Sulaiman (the words are):\" And its spending at its proper place.\"",
      "chain": [
        "30124",
        "20304",
        "11586",
        "30463",
        "20160"
      ]
    },
    {
      "hadith_no": "3480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أمية بن بسطام العيشي، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - يعني ابن القاسم - عن عمرو بن دينار، عن الحسن بن محمد، عن سلمة بن الأكوع، وجابر بن عبد الله أن رسول الله صلى الله عليه وسلم أتانا فأذن لنا في المتعة ‏.‏",
      "text_en": " Salama b. al. Akwa' and Jabir b. Abdullah reported:                      Allah's Messenger (may peace be upon him) came to us and permitted us to contract temporary marriage.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11081",
        "30245",
        "237",
        "34"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح، - يعني ابن القاسم - عن عمرو بن دينار، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Amr b. Dinar with the same chain of transmitters.",
      "chain": [
        "30124",
        "20304",
        "11586"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا أمية بن بسطام العيشي، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها فما تركت الفرائض فلأولى رجل ذكر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      Give the shares to those who are entitled to them, and what is left from those wno are entitled to it goes to the nearest male heir.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4250",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - عن زيد بن أسلم، عن أبيه، عن عمر، أنه حمل على فرس في سبيل الله فوجده عند صاحبه وقد أضاعه وكان قليل المال فأراد أن يشتريه فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ لا تشتره وإن أعطيته بدرهم فإن مثل العائد في صدقته كمثل الكلب يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Aslam reported on the authority of his father that 'Umar (Allah be pleased with him) donated a horse in the path of Allah. He found that it had languished in the hand of its possessor, and he was a man of meagre resources He (Hadrat 'Umar) intended to buy it. He came to Allah's Messenger (may peace be upon him) and made a mention of that to him, whereupon he said:                      Don't buy that even if you get it for a dirham for he who gets back the charity is like a dog which swallows its vomit.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثني الحكم بن موسى، حدثنا شعيب، بن إسحاق ح وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - ح وحدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، كلهم عن هشام بن عروة، بهذا الإسناد أما أبو أسامة وروح ففي حديثهما فهل لي أجر كما قال يحيى بن سعيد ‏.‏ وأما شعيب وجعفر ففي حديثهما أفلها أجر كرواية ابن بشر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham b. 'Urwa with the same chain of transmitters.",
      "chain": [
        "30216",
        "20318",
        "30502",
        "20239",
        "30124",
        "20304",
        "11586",
        "30201",
        "20416"
      ]
    },
    {
      "hadith_no": "4593",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا سويد بن سعيد، حدثني حفص، - يعني ابن ميسرة الصنعاني - عن موسى بن عقبة، ح وحدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن محمد بن عجلان، جميعا عن أبي الزناد، بهذا الإسناد مثل معنى حديث ورقاء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu az-Zinad with the same chain of transmitters.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "30124",
        "20304",
        "11586",
        "10616"
      ]
    },
    {
      "hadith_no": "5719",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "وحدثني أمية بن بسطام، حدثنا يزيد يعني ابن زريع، ح وحدثني علي بن حجر، حدثنا إسماعيل، - يعني ابن علية - كلاهما عن روح بن القاسم، عن محمد بن المنكدر، عن جابر، ‏.‏ بمثل حديث ابن عيينة غير أنه لم يذكر ولا ننعمك عينا ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ibn Uyaina, but there is no mention of this:                     \" We will not allow you to cool your eyes.\"",
      "chain": [
        "30124",
        "20304",
        "20387",
        "20208",
        "11586",
        "11048"
      ]
    },
    {
      "hadith_no": "5725",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرني جرير، ح وحدثني أمية بن بسطام، حدثنا  يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - ح وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن منصور، بإسناد زهير ‏.‏ فأما حديث جرير وروح فكمثل حديث زهير بقصته ‏.‏ وأما حديث شعبة فليس فيه إلا ذكر تسمية الغلام ولم يذكر الكلام الأربع ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba and there is no mention but of the fact about giving the name to the servant and there is no mention of the four expressions (of remembrance) and he did not mention the four words",
      "chain": [
        "30123",
        "20028",
        "30124",
        "20304",
        "11586",
        "30170",
        "30160",
        "20173"
      ]
    },
    {
      "hadith_no": "6851",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن روح بن القاسم، ح وحدثني  أحمد بن عثمان بن حكيم، حدثنا خالد بن مخلد، عن سليمان بن بلال، جميعا عن سهيل، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Suhail with the same chain of transmitters.",
      "chain": [
        "30399",
        "20304",
        "11586",
        "30185",
        "30463",
        "20160"
      ]
    },
    {
      "hadith_no": "6984",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أمية بن بسطام العيشي، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، بن القاسم عن العلاء، عن أبيه، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يسير في طريق مكة فمر على جبل يقال له جمدان فقال ‏\"‏ سيروا هذا جمدان سبق المفردون ‏\"‏ ‏.‏ قالوا وما المفردون يا رسول الله قال ‏\"‏ الذاكرون الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) was travelling along the path leading to Mecca that he happened to pass by a mountain called Jumdan. He said:                      Proceed on, it is Jumdan, Mufarradun have gone ahead. They (the Companions of the Holy Prophet) said: Allah's Messenger, who are Mufarradun? He said: They are those males and females who remember Allah much.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "7094",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أمية بن بسطام العيشي، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، وهو ابن القاسم عن سهيل، عن أبيه، عن أبي هريرة، أن فاطمة، أتت النبي صلى الله عليه وسلم تسأله خادما وشكت العمل فقال ‏\"‏ ما ألفيتيه عندنا ‏\"‏ ‏.‏ قال ‏\"‏ ألا أدلك على ما هو خير لك من خادم تسبحين ثلاثا وثلاثين وتحمدين ثلاثا وثلاثين وتكبرين أربعا وثلاثين حين تأخذين مضجعك ‏\"‏ ‏.‏  وحدثنيه أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا سهيل، بهذا الإسناد ‏.‏",
      "text_en": " Abu Huraira reported that Fatima came to Allah's Apostle (may peace be upon him) and asked for a servant and told him of the hardship of household work. He said:                      You would not be able to get a servant from us. May I not direct you to what is better than the servant for you? Recite Subhaana Allah thirty-three times, al- Hamdu li-Allah thirty-three times and Allah-o-Akbar thirty-four times as you go to bed. This hadith has been narrated on the authority of Suhail with the same chain of transmitters.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "13"
      ]
    },
    {
      "hadith_no": "7666",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، أخبرنا روح بن القاسم، عن العلاء بن عبد الرحمن بن يعقوب، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تبارك وتعالى أنا أغنى الشركاء عن الشرك من عمل عملا أشرك فيه معي غيري تركته وشركه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as stating that Allah the Most High and Exalted said:                      I am the One, One Who does not stand in need of a partner. If anyone does anything in which he associates anyone else with Me, I shall abandon him with one whom he associates with Allah.",
      "chain": [
        "30022",
        "20208",
        "11586",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "5091",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد، - يعني ابن زريع - حدثنا روح بن القاسم، عن سهيل، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يصبح سبحان الله العظيم وبحمده مائة مرة وإذا أمسى كذلك لم يواف أحد من الخلائق بمثل ما وافى ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      if anyone says a hundred times in the morning: “Glory be to Allah, the Sublime, and I begin with praise of him”, and says likewise in the evening, no one from the creatures will bring anything like the one which he will bring.",
      "chain": [
        "30173",
        "20304",
        "11586",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال أنبأنا أمية، قال حدثنا يزيد بن زريع، أن روح بن القاسم، حدثه عن ابن أبي نجيح، عن عطاء، عن إياس بن خليفة، عن رافع بن خديج، أن عليا، أمر عمارا أن يسأل رسول الله صلى الله عليه وسلم عن المذى فقال ‏\"‏ يغسل مذاكيره ويتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that 'Ali told 'Ammar to ask the Messenger of Allah (ﷺ) about prostatic fluid, and he said:                      'Let him wash his male member and perform Wudu'.'\"",
      "chain": [
        "11524",
        "20304",
        "11586",
        "11254",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "1113",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا حميد بن مسعدة البصري، عن يزيد، - وهو ابن زريع - قال حدثنا شعبة، وروح، - يعني ابن القاسم - عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة ولا أكف شعرا ولا ثوبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     The Messenger of Allah (ﷺ) said: \"I have been commanded to prostrate on seven and not to tuck up my hair or garment.\"",
      "chain": [
        "30430",
        "20304",
        "20020",
        "11586",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن الصباح، قال حدثنا الحسن بن حبيب، قال حدثنا روح بن القاسم، عن عطاء بن السائب، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " 'Ata bin As-Sa'ib reported from Sa'eed bin Abdur-Rahman bin Abza from his father:                     That the Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30142",
        "11586",
        "11068",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "2484",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا روح بن القاسم، قال حدثني عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل في البر والتمر زكاة حتى تبلغ خمسة أوسق ولا يحل في الورق زكاة حتى تبلغ خمسة أواق ولا يحل في إبل زكاة حتى تبلغ خمس ذود ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah said:                     \"No Zakah is due on wheat or dates unless the amount reaches five Awsuq. No Zakah is due on silver unless the amount reaches five Awaq. No Zakah is due on camels until the number reaches five Dhawd.\"",
      "chain": [
        "34033",
        "20304",
        "11586",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "494",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن علية، عن روح بن القاسم، عن عبد الله بن محمد بن عقيل، عن الربيع، قالت أتاني ابن عباس فسألني عن هذا الحديث، - تعني حديثها الذي ذكرت أن رسول الله  صلى الله عليه وسلم  توضأ وغسل رجليه - فقال ابن عباس إن الناس أبوا إلا الغسل ولا أجد في كتاب الله إلا المسح ‏.‏",
      "text_en": " It was narrated that Rubai' said:                     \"Ibn 'Abbas came to me and asked me about this Hadith\" meaning the Hadith, that she had narrated, saying that the Messenger of Allah performed ablution and washed his feet. \"Ibn 'Abbas said: 'The people are insisting on washing their feet, but I do not find anything in the Qur'an except (the injunction to) wipe them.'\"",
      "chain": [
        "30201",
        "20208",
        "11586",
        "12246"
      ]
    },
    {
      "hadith_no": "2189",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن عبد المؤمن الواسطي، حدثنا عون بن عمارة، حدثنا روح بن القاسم، عن عبيد الله بن عمر، عن عمرو بن شعيب، عن أبيه، عن جده، ‏.‏ أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليتركها فإن تركها كفارتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said that the Prophet (ﷺ) said:                     \"Whoever swears an oath then sees  that something else is better than it, let him not do it, and his leaving it is the expiation for it. \"",
      "chain": [
        "24352",
        "11586",
        "11201",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 31
}