{
  "id": "11589",
  "name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
  "full_name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Jarmi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11309",
      "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11719",
      "name": "al-Qasim bin 'Asim al-Tmymy القاسم بن عاصم التميمي ويقال الكليني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10922",
      "name": "Durayb bin Nufayr, Abu al-Salayl al-Qays ضريب بن نقير أبو السليل القيسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10719",
      "name": "Matr bin Tahman al-Waraq مطر بن طهمان الوراق أبو رجاء الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2651",
      "hadith_no": "2651",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا أبو جمرة، قال سمعت زهدم بن مضرب، قال سمعت عمران بن حصين  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ‏\"‏‏.‏ قال عمران لا أدري أذكر النبي صلى الله عليه وسلم بعد قرنين أو ثلاثة‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إن بعدكم قوما يخونون ولا يؤتمنون، ويشهدون، ولا يستشهدون وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudrab:                     I heard `Imran bin Husain saying, \"The Prophet said, 'The best people are those living in my generation, then those coming after them, and then those coming after (the second generation).\" `Imran said \"I do not know whether the Prophet mentioned two or three generations after your present generation. The Prophet added, 'There will be some people after you, who will be dishonest and will not be trustworthy and will give witness (evidences) without being asked to give witness, and will vow but will not fulfill their vows, and fatness will appear among them.\"",
      "usc_msa_ref": "819",
      "chain": [
        "20404",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-3133",
      "hadith_no": "3133",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد، حدثنا أيوب، عن أبي قلابة، قال وحدثني القاسم بن عاصم الكليبي  وأنا لحديث القاسم، أحفظ  عن زهدم، قال كنا عند أبي موسى، فأتي ذكر دجاجة وعنده رجل من بني تيم الله أحمر كأنه من الموالي، فدعاه للطعام فقال إني رأيته يأكل شيئا، فقذرته، فحلفت لا آكل‏.‏ فقال هلم فلأحدثكم عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ وأتي رسول الله صلى الله عليه وسلم بنهب إبل، فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، فلما انطلقنا قلنا ما صنعنا لا يبارك لنا، فرجعنا إليه فقلنا إنا سألناك أن تحملنا، فحلفت أن لا تحملنا أفنسيت قال ‏\"‏ لست أنا حملتكم، ولكن الله حملكم، وإني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     Once we were in the house of Abu Musa who presented a meal containing cooked chicken. A man from the tribe of Bani Taim Allah with red complexion as if he were from the Byzantine war prisoners, was present. Abu Musa invited him to share the meal but he (apologised) saying. \"I saw chickens eating dirty things and so I have had a strong aversion to eating them, and have taken an oath that I will not eat chickens.\" Abu Musa said, \"Come along, I will tell you about this matter (i.e. how to cancel one's oat ). I went to the Prophet in the company of a group of Al-Ashariyin, asked him to provide us with means of conveyance. He said, 'By Allah, I will not provide you with any means of conveyance and I have nothing to make you ride on.' Then some camels as booty were brought to Allah's Apostle and he asked for us saying. 'Where are the group of Al-Ash`ariyun?' Then he ordered that we should be given five camels with white humps. When we set out we said, 'What have we done? We will never be blessed (with what we have been given).' So, we returned to the Prophet and said, 'We asked you to provide us with means of conveyance, but you took an oath that you would not provide us with any means of conveyance. Did you forget (your oath when you gave us the camels)? He replied. 'I have not provided you with means of conveyance, but Allah has provided you with it, and by Allah, Allah willing, if ever I take an oath to do something, and later on I find that it is more beneficial to do something different, I will do the thing which is better, and give expiation for my oath.\"",
      "usc_msa_ref": "361",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "id": "sahih-bukhari-3693",
      "hadith_no": "3693",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إسحاق، حدثنا النضر، أخبرنا شعبة، عن أبي جمرة، سمعت زهدم بن مضرب، سمعت عمران بن حصين  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي قرني ثم الذين يلونهم ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فلا أدري أذكر بعد قرنه قرنين أو ثلاثا ‏\"‏ ثم إن بعدكم قوما يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     \"Allah's Apostle said, 'The best of my followers are those living in my generation (i.e. my contemporaries). and then those who will follow the latter\" `Imran added, \"I do not remember whether he mentioned two or three generations after his generation, then the Prophet added, 'There will come after you, people who will bear witness without being asked to do so, and will be treacherous and untrustworthy, and they will vow and never fulfill their vows, and fatness will appear among them.\"",
      "usc_msa_ref": "2",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-4428",
      "hadith_no": "4428",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد السلام، عن أيوب، عن أبي قلابة، عن زهدم، قال لما قدم أبو موسى أكرم هذا الحى من جرم، وإنا لجلوس عنده وهو يتغدى دجاجا، وفي القوم رجل جالس، فدعاه إلى الغداء، فقال إني رأيته يأكل شيئا فقذرته‏.‏ فقال هلم، فإني رأيت النبي صلى الله عليه وسلم يأكله‏.‏ فقال إني حلفت لا آكله‏.‏ فقال هلم أخبرك عن يمينك، إنا أتينا النبي صلى الله عليه وسلم نفر من الأشعريين، فاستحملناه فأبى أن يحملنا فاستحملناه، فحلف أن لا يحملنا، ثم لم يلبث النبي صلى الله عليه وسلم أن أتي بنهب إبل، فأمر لنا بخمس ذود، فلما قبضناها قلنا تغفلنا النبي صلى الله عليه وسلم يمينه، لا نفلح بعدها أبدا فأتيته فقلت يا رسول الله إنك حلفت أن لا تحملنا وقد حملتنا‏.‏ قال ‏\"‏ أجل، ولكن لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير منها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     When Abu Musa arrived (at Kufa as a governor) he honored this family of Jarm (by paying them a visit). I was sitting near to him, and he was eating chicken as his lunch, and there was a man sitting amongst the people. Abu Musa invited the man to the lunch, but the latter said, \"I saw chickens (eating something (dirty) so I consider them unclean.\" Abu Musa said, \"Come on! I saw the Prophet eating it (i.e. chicken).\" The man said \"I have taken an oath that I will not ea (chicken)\" Abu Musa said.\" Come on! I will tell you about your oath. We, a group of Al-Ash`ariyin people went to the Prophet and asked him to give us something to ride, but the Prophet refused. Then we asked him for the second time to give us something to ride, but the Prophet took an oath that he would not give us anything to ride. After a while, some camels of booty were brought to the Prophet and he ordered that five camels be given to us. When we took those camels we said, \"We have made the Prophet forget his oath, and we will not be successful after that.\" So I went to the Prophet and said, \"O Allah' Apostle ! You took an oath that you would not give us anything to ride, but you have given us.\" He said, \"Yes, for if I take an oath and later I see a better solution than that, I act on the later (and gave the expiation of that oaths\"",
      "usc_msa_ref": "668",
      "chain": [
        "20348",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "id": "sahih-bukhari-5576",
      "hadith_no": "5576",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن سفيان، عن أيوب، عن أبي قلابة، عن زهدم الجرمي، عن أبي موسى  يعني الأشعري  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم يأكل دجاجا‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I saw the Prophet eating chicken.",
      "usc_msa_ref": "426",
      "chain": [
        "30020",
        "20032",
        "20012",
        "11015",
        "11047",
        "11589",
        "41"
      ]
    },
    {
      "id": "sahih-bukhari-5577",
      "hadith_no": "5577",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب بن أبي تميمة، عن القاسم، عن زهدم، قال كنا عند أبي موسى الأشعري، وكان بيننا وبين هذا الحى من جرم إخاء، فأتي بطعام فيه لحم دجاج، وفي القوم رجل جالس أحمر فلم يدن من طعامه قال ادن فقد رأيت رسول الله صلى الله عليه وسلم يأكل منه‏.‏ قال إني رأيته أكل شيئا فقذرته، فحلفت أن لا آكله‏.‏ فقال ادن أخبرك  أو أحدثك  إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين، فوافقته وهو غضبان، وهو يقسم نعما من نعم الصدقة فاستحملناه فحلف أن لا يحملنا، قال ‏\"‏ ما عندي ما أحملكم عليه ‏\"‏‏.‏ ثم أتي رسول الله صلى الله عليه وسلم بنهب من إبل فقال ‏\"‏ أين الأشعريون أين الأشعريون ‏\"‏‏.‏ قال فأعطانا خمس ذود غر الذرى، فلبثنا غير بعيد، فقلت لأصحابي نسي رسول الله صلى الله عليه وسلم يمينه، فوالله لئن تغفلنا رسول الله صلى الله عليه وسلم يمينه لا نفلح أبدا‏.‏ فرجعنا إلى النبي صلى الله عليه وسلم فقلنا يا رسول الله إنا استحملناك، فحلفت أن لا تحملنا فظننا أنك نسيت يمينك‏.‏ فقال ‏\"‏ إن الله هو حملكم، إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير، وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     We were in the company of Abu Musa Al-Ash`ari and there were friendly relations between us and this tribe of Jarm. Abu Musa was presented with a dish containing chicken. Among the people there was sitting a red-faced man who did not come near the food. Abu Musa said (to him), \"Come on (and eat), for I have seen Allah's Apostle eating of it (i.e. chicken).\" He said, \"I have seen it eating something (dirty) and since then I have disliked it, and have taken an oath that I shall not eat it ' Abu Musa said, \"Come on, I will tell you (or narrate to you). Once I went to Allah s Apostle with a group of Al-Ash`ariyin, and met him while he was angry, distributing some camels of rak`at. We asked for mounts but he took an oath that he would not give us any mounts, and added, 'I have nothing to mount you on' In the meantime some camels of booty were brought to Allah's Apostle and he asked twice, 'Where are Al-Ash`ariyin?\" So he gave us five white camels with big humps. We stayed for a short while (after we had covered a little distance), and then I said to my companions, \"Allah's Apostle has forgotten his oath. By Allah, if we do not remind Allah's Apostle of his oath, we will never be successful.\" So we returned to the Prophet and said, \"O Allah's Apostle! We asked you for mounts, but you took an oath that you would not give us any mounts; we think that you have forgotten your oath.' He said, 'It is Allah Who has given you mounts. By Allah, and Allah willing, if I take an oath and later find something else better than that. then I do what is better and expiate my oath.' \"",
      "usc_msa_ref": "427",
      "chain": [
        "30315",
        "20258",
        "11015",
        "10535",
        "11589"
      ]
    },
    {
      "id": "sahih-bukhari-6504",
      "hadith_no": "6504",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت أبا جمرة، قال حدثني زهدم بن مضرب، قال سمعت عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فما أدري قال النبي صلى الله عليه وسلم بعد قوله مرتين أو ثلاثا ‏\"‏ ثم يكون بعدهم قوم يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudarrib:                     `Imran bin Husain said: The Prophet said, \"The best people are my contemporaries (i.e., the present (my) generation) and then those who come after them (i.e., the next generation).\" `Imran added: I am not sure whether the Prophet repeated the statement twice after his first saying. The Prophet added, \"And after them there will come people who will bear witness, though they will not be asked to give their witness; and they will be treacherous and nobody will trust them, and they will make vows, but will not fulfill them, and fatness will appear among them.\"",
      "usc_msa_ref": "436",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-6730",
      "hadith_no": "6730",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، عن أيوب، عن أبي قلابة، والقاسم التميمي، عن زهدم، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء، فكنا عند أبي موسى الأشعري، فقرب إليه طعام فيه لحم دجاج وعنده رجل من بني تيم الله أحمر كأنه من الموالي، فدعاه إلى الطعام فقال إني رأيته يأكل شيئا فقذرته، فحلفت أن لا آكله‏.‏ فقال قم فلأحدثنك عن ذاك، إني أتيت رسول الله صلى الله عليه وسلم في نفر من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ فأتي رسول الله صلى الله عليه وسلم بنهب إبل فسأل عنا‏.‏ فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، فلما انطلقنا قلنا ما صنعنا حلف رسول الله صلى الله عليه وسلم لا يحملنا وما عنده ما يحملنا ثم حملنا، تغفلنا رسول الله صلى الله عليه وسلم يمينه، والله لا نفلح أبدا، فرجعنا إليه فقلنا له إنا أتيناك لتحملنا فحلفت أن لا تحملنا، وما عندك ما تحملنا‏.‏ فقال ‏\"‏ إني لست أنا حملتكم، ولكن الله حملكم، والله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     There was a relation of love and brotherhood between this tribe of Jarm and Al-Ash`ariyin. Once we were with Abu Musa Al-Ash`ari, and then a meal containing chicken was brought to Abu Musa, and there was present, a man from the tribe of Taimillah who was of red complexion as if he were from non-Arab freed slaves. Abu Musa invited him to the meal. He said, \"I have seen chickens eating dirty things, so I deemed it filthy and took an oath that I would never eat chicken.\" On that, Abu Musa said, \"Get up, I will narrate to you about that. Once a group of the Ash`ariyin and I went to Allah's Apostle and asked him to provide us with mounts; he said, 'By Allah, I will never give you any mounts nor do I have anything to mount you on.' Then a few camels of war booty were brought to Allah's Apostle , and he asked about us, saying, 'Where are the Ash-'ariyin?' He then ordered five nice camels to be given to us, and when we had departed, we said, 'What have we done? Allah's Apostle had taken the oath not to give us any mounts, and that he had nothing to mount us on, and later he gave us that we might ride? Did we take advantage of the fact that Allah's Apostle had forgotten his oath? By Allah, we will never succeed.' So we went back to him and said to him, 'We came to you to give us mounts, and you took an oath that you would not give us any mounts and that you had nothing to mount us on.' On that he said, 'I did not provide you with mounts, but Allah did. By Allah, if I take an oath to do something, and then find something else better than it, I do that which is better and make expiation for the dissolution of the oath.' \"",
      "usc_msa_ref": "644",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11047",
        "11719",
        "11589"
      ]
    },
    {
      "id": "sahih-bukhari-6761",
      "hadith_no": "6761",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن القاسم، عن زهدم، قال كنا عند أبي موسى الأشعري قال أتيت رسول الله صلى الله عليه وسلم في نفر من الأشعريين، فوافقته وهو غضبان فاستحملناه، فحلف أن لا يحملنا ثم قال ‏\"‏ والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I went along with some men from the Ash-ariyin to Allah's Apostle and it happened that I met him while he was in an angry mood. We asked him to provide us with mounts, but he swore that he would not give us any. Later on he said, \"By Allah, Allah willing, if ever I take an oath (to do something) and later on I find something else better than the first, then I do the better one and give expiation for the dissolution of my oath.\"",
      "usc_msa_ref": "671",
      "chain": [
        "30315",
        "20258",
        "11015",
        "10535",
        "11589"
      ]
    },
    {
      "id": "sahih-bukhari-6778",
      "hadith_no": "6778",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا مسدد، عن يحيى، عن شعبة، قال حدثني أبو جمرة، حدثنا زهدم بن مضرب، قال سمعت عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم  قال عمران لا أدري ذكر ثنتين أو ثلاثا بعد قرنه  ثم يجيء قوم ينذرون ولا يفون، ويخونون ولا يؤتمنون، ويشهدون ولا يستشهدون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudarrab:                     `Imran bin Hussain said, \"The Prophet said, 'The best of you (people) are my generation, and the second best will be those who will follow them, and then those who will follow the second generation.\" `Imran added, \"I do not remember whether he mentioned two or three (generations) after his generation. He added, 'Then will come some people who will make vows but will not fulfill them; and they will be dishonest and will not be trustworthy, and they will give their witness without being asked to give their witness, and fatness will appear among them.' \"",
      "usc_msa_ref": "686",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-6806",
      "hadith_no": "6806",
      "source": "Sahih Bukhari",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن القاسم التميمي، عن زهدم الجرمي، قال كنا عند أبي موسى وكان بيننا وبين هذا الحى من جرم إخاء ومعروف  قال  فقدم طعام  قال  وقدم في طعامه لحم دجاج  قال  وفي القوم رجل من بني تيم الله أحمر كأنه مولى  قال  فلم يدن فقال له أبو موسى ادن، فإني قد رأيت رسول الله صلى الله عليه وسلم يأكل منه‏.‏ قال إني رأيته يأكل شيئا قذرته، فحلفت أن لا أطعمه أبدا‏.‏ فقال ادن أخبرك عن ذلك، أتينا رسول الله صلى الله عليه وسلم في رهط من الأشعريين أستحمله، وهو يقسم نعما من نعم الصدقة  قال أيوب أحسبه قال وهو غضبان  قال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ قال فانطلقنا فأتي رسول الله صلى الله عليه وسلم بنهب إبل، فقيل أين هؤلاء الأشعريون فأتينا فأمر لنا بخمس ذود غر الذرى، قال فاندفعنا فقلت لأصحابي أتينا رسول الله صلى الله عليه وسلم نستحمله، فحلف أن لا يحملنا، ثم أرسل إلينا فحملنا، نسي رسول الله صلى الله عليه وسلم يمينه، والله لئن تغفلنا رسول الله صلى الله عليه وسلم يمينه لا نفلح أبدا، ارجعوا بنا إلى رسول الله صلى الله عليه وسلم فلنذكره يمينه‏.‏ فرجعنا فقلنا يا رسول الله أتيناك نستحملك، فحلفت أن لا تحملنا ثم حملتنا فظننا  أو فعرفنا  أنك نسيت يمينك‏.‏ قال ‏\"‏ انطلقوا، فإنما حملكم الله، إني والله إن شاء الله لا أحلف على يمين، فأرى غيرها خيرا منها، إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏ تابعه حماد بن زيد عن أيوب عن أبي قلابة والقاسم بن عاصم الكليبي‏.‏",
      "text_en": " Narrated Zahdam al-Jarmi:                     We were sitting with Abu Musa Al-Ash'sari, and as there were ties of friendship and mutual favors between us and his tribe. His meal was presented before him and there was chicken meat in it. Among those who were present there was a man from Bani Taimillah having a red complexion as a non-Arab freed slave, and that man did not approach the meal. Abu Musa said to him, \"Come along! I have seen Allah's Apostle eating of that (i.e., chicken).\" The man said, \"I have seen it (chickens) eating something I regarded as dirty, and so I have taken an oath that I shall not eat (its meat) chicken.\" Abu Musa said, \"Come along! I will inform you about it (i.e., your oath). Once we went to Allah's Apostle in company with a group of Ash'airiyin, asking him for mounts while he was distributing some camels from the camels of Zakat. (Aiyub said, \"I think he said that the Prophet was in an angry mood at the time.\") The Prophet said, 'By Allah! I will not give you mounts, and I have nothing to mount you on.' After we had left, some camels of booty were brought to Allah's Apostle and he said, \"Where are those Ash`ariyin? Where are those Ash`ariyin?\" So we went (to him) and he gave us five very fat good-looking camels. We mounted them and went away, and then I said to my companions, 'We went to Allah's Apostle to give us mounts, but he took an oath that he would not give us mounts, and then later on he sent for us and gave us mounts, perhaps Allah's Apostle forgot his oath. By Allah, we will never be successful, for we have taken advantage of the fact that Allah's Apostle forgot to fulfill his oath. So let us return to Allah's Apostle to remind him of his oath.' We returned and said, 'O Allah's Apostle! We came to you and asked you for mounts, but you took an oath that you would not give us mounts) but later on you gave us mounts, and we thought or considered that you have forgotten your oath.' The Prophet said, 'Depart, for Allah has given you Mounts. By Allah, Allah willing, if I take an oath and then later find another thing better than that, I do what is better, and make expiation for the oath.' \"",
      "usc_msa_ref": "712",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11719",
        "11589"
      ]
    },
    {
      "id": "sahih-bukhari-7650",
      "hadith_no": "7650",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، والقاسم التميمي، عن زهدم، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء، فكنا عند أبي موسى الأشعري فقرب إليه الطعام فيه لحم دجاج، وعنده رجل من بني تيم الله كأنه من الموالي، فدعاه إليه فقال إني رأيته يأكل شيئا فقذرته، فحلفت لا آكله‏.‏ فقال هلم فلأحدثك عن ذاك، إني أتيت النبي صلى الله عليه وسلم في نفر من الأشعريين نستحمله قال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم ‏\"‏‏.‏ فأتي النبي صلى الله عليه وسلم بنهب إبل فسأل عنا فقال ‏\"‏ أين النفر الأشعريون ‏\"‏‏.‏ فأمر لنا بخمس ذود غر الذرى، ثم انطلقنا قلنا ما صنعنا حلف رسول الله صلى الله عليه وسلم لا يحملنا، وما عنده ما يحملنا، ثم حملنا، تغفلنا رسول الله صلى الله عليه وسلم يمينه، والله لا نفلح أبدا، فرجعنا إليه فقلنا له فقال ‏\"‏ لست أنا أحملكم، ولكن الله حملكم، إني والله لا أحلف على يمين فأرى غيرها خيرا منها، إلا أتيت الذي هو خير منه، وتحللتها ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam:                     There were good relations and brotherhood between this tribe of Jurm and the Ash`ariyyin. Once, while we were sitting with Abu Musa Al-Ash`ari, there was brought to him a meal which contained chicken meat, and there was sitting beside him, a man from the tribe of Bani Taimul-lah who looked like one of the Mawali. Abu Musa invited the man to eat but the man said, \"I have seen chicken eating some dirty things, and I have taken an oath not to eat chicken.\" Abu Musa said to him, \"Come along, let me tell you something in this regard. Once I went to the Prophet with a few men from Ash`ariyyin and we asked him for mounts. The Prophet said, By Allah, I will not mount you on anything; besides I do not have anything to mount you on.' Then a few camels from the war booty were brought to the Prophet, and he asked about us, saying, 'Where are the group of Ash`ariyyin?' So he ordered for five fat camels to be given to us and then we set out. We said, 'What have we done? Allah's Apostle took an oath that he would not give us anything to ride and that he had nothing for us to ride, yet he provided us with mounts. We made Allah's Apostle forget his oath! By Allah, we will never be successful.' So we returned to him and reminded him of his oath. He said, 'I have not provided you with the mount, but Allah has done so. By Allah, I may take an oath to do something, but on finding something else which is better, I do that which is better and make the expiation for my oath.' \"",
      "usc_msa_ref": "644",
      "chain": [
        "30143",
        "20259",
        "11015",
        "11047",
        "11719",
        "11589"
      ]
    },
    {
      "id": "sahih-muslim-4354",
      "hadith_no": "4354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني أبو الربيع العتكي، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن أبي، قلابة وعن القاسم بن عاصم، عن زهدم الجرمي، - قال أيوب وأنا لحديث القاسم، أحفظ مني لحديث أبي قلابة - قال كنا عند أبي موسى فدعا بمائدته وعليها لحم دجاج فدخل رجل من بني تيم الله أحمر شبيه بالموالي فقال له هلم ‏.‏ فتلكأ فقال هلم فإني قد رأيت رسول الله صلى الله عليه وسلم يأكل منه ‏.‏ فقال الرجل إني رأيته يأكل شيئا فقذرته فحلفت أن لا أطعمه فقال هلم أحدثك عن ذلك إني أتيت رسول الله صلى الله عليه وسلم في رهط من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ فلبثنا ما شاء الله فأتي رسول الله صلى الله عليه وسلم بنهب إبل فدعا بنا فأمر لنا بخمس ذود غر الذرى قال فلما انطلقنا قال بعضنا لبعض أغفلنا رسول الله صلى الله عليه وسلم يمينه لا يبارك لنا ‏.‏ فرجعنا إليه فقلنا يا رسول الله إنا أتيناك نستحملك وإنك حلفت أن لا تحملنا ثم حملتنا أفنسيت يا رسول الله قال ‏\"‏ إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا أتيت الذي هو خير وتحللتها فانطلقوا فإنما حملكم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Ayyub said:                      We were sitting in the company of Abu Musa that he called for food and it consisted of flesh of fowl. It was then that a person from Banu Tamim visited him. His complexion was red having the resemblance of a slave. He said to him: Come and (join me in food). He showed reluctance. He (Abu Masa) said: Come on, for I saw Allah's Messenger (may peace be upon him) eating it (fowl's meat), whereupon that person said: I saw it eating something (of filth and rubbish) and I found it repugnant and took an oath that I would never eat that. He (Abu Muds) said: Come, so that I would narrate to you about that (the incident pertaining to vow). (And he narrated thus): I came to Allah's Messenger (may peace be upon him) along with a group of people belonging to the tribe of Ash'ari, asking him to provide us with riding camels. He (the Holy Prophet) said: By Allah, I cannot provide you with riding animals. And there is nothing with me with which I can provide you a mount. We stayed (for some time) there as Allah willed, and there was brought to Allah's Messenger (may peace be upon him) booty of camels. He called us and commanded that we should be given five white humped camels. As we were about to go back, some of us said to the other: As we made Allah's Messenger (may peace be upon him) forget oath, there would be no blessing for us (in his gift). We went back to him and said: Allah's Messenger, we came to you to provide us with riding animals and you took an oath that you would never equip us with mounts and then you have provided us with the riding beasts Allah's Messenger, have you forgotten? Thereupon he said: I swear by Allah that if Allah so wills, I shall not swear an oath, and then consider something else to be better than it without making atonement for my oath and doing the thing that is better. So you go; Allah, the Exalted and Glorious, has given you riding animals.",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "id": "sahih-muslim-4355",
      "hadith_no": "4355",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا عبد الوهاب الثقفي، عن أيوب، عن أبي قلابة، والقاسم، التميمي عن زهدم الجرمي، قال كان بين هذا الحى من جرم وبين الأشعريين ود وإخاء فكنا عند أبي موسى الأشعري فقرب إليه طعام فيه لحم دجاج ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Musa al-Ash'ari with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20259",
        "11015",
        "11047",
        "11719",
        "11589"
      ]
    },
    {
      "id": "sahih-muslim-4356",
      "hadith_no": "4356",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني علي بن حجر السعدي، وإسحاق بن إبراهيم، وابن، نمير عن إسماعيل، ابن علية عن أيوب، عن القاسم التميمي، عن زهدم الجرمي، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب، عن أبي قلابة، عن زهدم الجرمي، ح وحدثني أبو بكر بن إسحاق، حدثنا عفان بن مسلم، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، والقاسم، عن زهدم الجرمي، قال كنا عند أبي موسى ‏.‏ واقتصوا جميعا الحديث بمعنى حديث حماد بن زيد ‏.‏",
      "text_en": " Zahdam al-Jarmi reported:                      We were in the company of Abu Musa. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "30123",
        "30212",
        "20208",
        "11015",
        "11719",
        "11589",
        "30421",
        "20005",
        "11015",
        "11047",
        "11589",
        "11108",
        "30106",
        "20299",
        "11015",
        "1104"
      ]
    },
    {
      "id": "sahih-muslim-4357",
      "hadith_no": "4357",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا الصعق، - يعني ابن حزن - حدثنا مطر الوراق، حدثنا زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل لحم دجاج وساق الحديث بنحو حديثهم وزاد فيه قال ‏\"‏ إني والله ما نسيتها ‏\"‏ ‏.‏",
      "text_en": " Zahdam al-Jarmi reported:                      I visited Abu Musa and lie was eating fowl's meat. The rest of the hadith is the same with this addition that he (the Holy Prophet) said: By Allah, I did not forget it.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20552",
        "10719",
        "11589"
      ]
    },
    {
      "id": "sahih-muslim-4358",
      "hadith_no": "4358",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن سليمان التيمي، عن ضريب بن، نقير القيسي عن زهدم، عن أبي موسى الأشعري، قال أتينا رسول الله صلى الله عليه وسلم نستحمله فقال ‏\"‏ ما عندي ما أحملكم والله ما أحملكم ‏\"‏ ‏.‏ ثم بعث إلينا رسول الله صلى الله عليه وسلم بثلاثة ذود بقع الذرى فقلنا إنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا فأتيناه فأخبرناه فقال ‏\"‏ إني لا أحلف على يمين أرى غيرها خيرا منها إلا أتيت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported:                      We came to Allah's Messenger (may peace be upon him) requesting him to provide us with riding camels. He (the Holy Prophet) said: There is nothing with me with which I should equip you. By Allah, I would not provide you with (riding camels). Then Allah's Messenger (may peace be upon him) sent to us three camels with spotted bumps. We said: We came to Allah's Messenger (may peace be upon him) asking him to equip us with riding animals. He took an oath that he could not equip us. We came to him and informed him. He said: By Allah, I do not take an oath, but when I find the other thing better than that, I do that which is better.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11289",
        "11589",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-6638",
      "hadith_no": "6638",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن غندر، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، سمعت أبا جمرة، حدثني زهدم بن، مضرب سمعت عمران بن حصين، يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن خيركم قرني ثم الذين يلونهم ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال عمران فلا أدري أقال رسول الله صلى الله عليه وسلم بعد قرنه مرتين أو ثلاثة ‏\"‏ ثم يكون بعدهم قوم يشهدون ولا يستشهدون ويخونون ولا يتمنون وينذرون ولا يوفون ويظهر فيهم السمن ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain reported Allah's-Messenger (may peace be upon him) as saying:                      The best among you (are) the people (who belong to) my age. Then those next to them, then those next to them, then those next to them. 'Imran said: I do not know whether Allah's Messenger (may peace be upon him) said twice or thrice (the words:\" Then next\" ) after (saying) about his (own age but he then said): Then after them (after successors or those who would succeed them) would come a people who would give evidence before they are asked for it, and would be dishonest and not trustworthy, who would make vows but would not fulfil them, and would be significant in being bulky.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "20278",
        "20173",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-6639",
      "hadith_no": "6639",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، ح وحدثنا عبد الرحمن بن بشر، العبدي حدثنا بهز، ح وحدثني محمد بن رافع، حدثنا شبابة، كلهم عن شعبة، بهذا الإسناد ‏.‏ وفي حديثهم قال لا أدري أذكر بعد قرنه قرنين أو ثلاثة ‏.‏ وفي حديث شبابة قال سمعت زهدم بن مضرب وجاءني في حاجة على فرس فحدثني أنه سمع عمران بن حصين ‏.‏ وفي حديث يحيى وشبابة ‏\"‏ ينذرون ولا يفون ‏\"‏ ‏.‏ وفي حديث بهز ‏\"‏ يوفون ‏\"‏ ‏.‏ كما قال ابن جعفر ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba with the same chain of transmitters (and the words are):                      I do not know whether he made a mention of two generations after his generation or of the third one too. Shababa said: I heard this from Zahdam b. Mudarrib as he came to me riding a horse for some need and he narrated it to me that he had heard it from 'Imran b. Husain, and in the hadith transmitted on the authority of Yahya and Shababa (the words are): They take an oath but they do not fulfil it, and in the hadith transmitted on the authority of Bahz there the word is Yafun as transmitted on the authority of Ibn Ja'far.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20031",
        "30356",
        "20214",
        "30375",
        "11589"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1826",
      "hadith_no": "1826",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، عن أبي العوام، عن قتادة، عن زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل دجاجا فقال ادن فكل فإني رأيت رسول الله صلى الله عليه وسلم يأكله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث من غير وجه عن زهدم ولا نعرفه إلا من حديث زهدم ‏.‏ وأبو العوام هو عمران القطان ‏.‏",
      "text_en": " Narrated Zahdam Al-Jarmi:                     \"I entered upon Abu Musa while he was eating chicken, and he said: 'Sit and eat, for indeed I saw the Messenger of Allah (ﷺ) eating it.'\"[Abu 'Eisa said:] This Hadith is Hasan. This Hadith has been reported through other routes from Zahdam, and we do not know of it except as the narration of Zahdam. (One of the narrators) Abu Al-'Awwam is 'Imran Al-Qattan.",
      "usc_msa_ref": "",
      "chain": [
        "30136",
        "20233",
        "11019",
        "11589"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1827",
      "hadith_no": "1827",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن أيوب، عن أبي قلابة، عن زهدم، عن أبي موسى، قال رأيت رسول الله صلى الله عليه وسلم يأكل لحم دجاج ‏.‏ قال وفي الحديث كلام أكثر من هذا ‏.‏ وهذا حديث حسن صحيح ‏.‏ وقد روى أيوب السختياني هذا الحديث أيضا عن القاسم التميمي وعن أبي قلابة عن زهدم (الجرمي) ‏.‏",
      "text_en": " Narrated Zahdam:                     From Abu Musa who said: \"I saw the Messenger of Allah (ﷺ) eating chicken meat.\"He said: The Hadith has more statements that this. And this Hadith is Hasan Sahih. Ayyub As-Sakhtiyani also reported this Hadith from Al-Qasim At-Tamimi, and, from Abu Qilabah, from Zahdam Al-Jarmi.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11015",
        "11047",
        "11589",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-3779",
      "hadith_no": "3779",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا قتيبة، قال حدثنا ابن أبي عدي، عن سليمان، عن أبي السليل، عن زهدم، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما على الأرض يمين أحلف عليها فأرى غيرها خيرا منها إلا أتيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet said:                      \"There is nothing on Earth that I swear an oath upon, and I see that something else is better, but I do that which is better.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20276",
        "20160",
        "11589",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-3809",
      "hadith_no": "3809",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن أبي جمرة، عن زهدم، قال سمعت عمران بن حصين، يذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خيركم قرني ثم الذين يلونهم ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ فلا أدري أذكر مرتين بعده أو ثلاثا ثم ذكر قوما يخونون ولا يؤتمنون ويشهدون ولا يستشهدون وينذرون ولا يوفون ويظهر فيهم السمن ‏.‏ قال أبو عبد الرحمن هذا نصر بن عمران أبو جمرة ‏.‏",
      "text_en": " 'Imran bin Husain said:                      \"The Messenger of Allah said: 'The best of you are my generation, then those who come after them, then those whom after them, then those who come after them.' -I do not know if he said two times after him or three. Then he mentioned some people who betray and cannot be trusted, who bear witness without being asked to do so, who make vows and do not fulfill them, and fatness will prevail among them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-4346",
      "hadith_no": "4346",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا أيوب، عن أبي قلابة، عن زهدم، أن أبا موسى، أتي بدجاجة فتنحى رجل من القوم فقال ما شأنك قال إني رأيتها تأكل شيئا قذرته فحلفت أن لا آكله ‏.‏ فقال أبو موسى ادن فكل فإني رأيت رسول الله صلى الله عليه وسلم يأكله ‏.‏ وأمره أن يكفر عن يمينه ‏.‏",
      "text_en": " It was narrated from Zahdam that:                     some chicken was brought to AbuMusa and a man moved away form the people. He said: \"What is the matter with You?\" He said: \"I saw it eating something that I consider filthy, and I swore I would not eat it.\" Abu Musa said: \"Come and eat, for I saw the Messenger of Allah eating it.\" And he told him to offer45 expiation for his vow (Kafarat Al- Yamin)",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11015",
        "11047",
        "11589"
      ]
    },
    {
      "id": "sunan-an-nasai-4347",
      "hadith_no": "4347",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، عن أيوب، عن القاسم التميمي، عن زهدم الجرمي، قال كنا عند أبي موسى فقدم طعامه وقدم في طعامه لحم دجاج وفي القوم رجل من بني تيم الله أحمر كأنه مولى فلم يدن فقال له أبو موسى ادن فإني قد رأيت رسول الله صلى الله عليه وسلم يأكل منه ‏.‏",
      "text_en": " It was narrated that Zahadam Al-Jarmi said:                     \"We were with Abu Musa and His food was brought, including chicken. Among the people there was a man from banu Taimullah who had reddish complexion, as if he were a freed slave. He did not come close and Abu Musa said: \"Come (and eat) for I saw the Messenger of All eating it\"'",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11719",
        "11589"
      ]
    }
  ],
  "total_hadiths": 25
}