{
  "id": "11599",
  "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
  "full_name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11270",
      "name": "Thmamh bin 'Abdullah ثمامة بن عبد الله بن أنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14383",
      "name": "Musa bin Anas bin Malik موسى بن أنس بن مالك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11310",
      "name": "al-Nadr bin Anas bin Malik النضر بن أنس بن مالك الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30457",
      "name": "Ma'la bin Asad al-'Ami معلى بن أسد العمي أبو الهيثم البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "94",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة، قال حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
      "chain": [
        "20337",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا تكلم بكلمة أعادها ثلاثا حتى تفهم عنه، وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting.",
      "chain": [
        "30149",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ ولا يجمع بين متفرق، ولا يفرق بين مجتمع، خشية الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what was made compulsory by Allah's Apostle and that was (regarding the payments of Zakat): Neither the property of different people may be taken together nor the joint property may be split for fear of (paying more, or receiving less) Zakat.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف بعثه إلى البحرين، وكتب له هذا الكتاب وختمه، وكان نقش الخاتم ثلاثة أسطر محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     That when Abu Bakr became the Caliph, he sent him to Bahrain and wrote this letter for him, and stamped it with the Ring of the Prophet. Three lines were engraved on the Ring, (the word) 'Muhammad' was in a line, 'Apostle' was in another line, and 'Allah' in a third.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس  رضى الله عنه  قال فجعلها لحسان وأبي، وأنا أقرب إليه، ولم يجعل لي منها شيئا‏.‏",
      "text_en": " Narrated Anas:                     Abu Talha distributed the garden between Hassan and Ubai, but he did not give me anything thereof although I was a nearer relative to him.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4830",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس بن مالك  رضى الله عنه  قال نرى هذه الآية نزلت في أنس بن النضر ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏‏.‏",
      "text_en": " Narrated Anas:                     We think that the Verse: 'Among the Believers are men who have been true to their covenant with Allah.' was revealed in favor of Anas bin An-Nadir.",
      "chain": [
        "30160",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5055",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الله بن المثنى، قال حدثني ثابت البناني، وثمامة، عن أنس، قال مات النبي صلى الله عليه وسلم ولم يجمع القرآن غير أربعة أبو الدرداء ومعاذ بن جبل وزيد بن ثابت وأبو زيد‏.‏ قال ونحن ورثناه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the Prophet died, none had collected the Qur'an but four persons;: Abu Ad-Darda'. Mu`adh bin Jabal, Zaid bin Thabit and Abu Zaid. We were the inheritor (of Abu Zaid) as he had no offspring .",
      "chain": [
        "30457",
        "11599",
        "11269",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5939",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف كتب له، وكان نقش الخاتم ثلاثة أسطر‏.‏ محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line. Anas added: 'the ring of the Prophet was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "5940",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وزادني أحمد حدثنا الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، قال كان خاتم النبي صلى الله عليه وسلم في يده، وفي يد أبي بكر بعده، وفي يد عمر بعد أبي بكر، فلما كان عثمان جلس على بئر أريس  قال  فأخرج الخاتم، فجعل يعبث به فسقط قال فاختلفنا ثلاثة أيام مع عثمان فننزح البئر فلم نجده‏.‏",
      "text_en": "",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6316",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله، عن أنس  رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle greeted somebody, he used to greet him three times, and if he spoke a sentence, he used to repeat it thrice.",
      "chain": [
        "30021",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6355",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أم سليم، كانت تبسط للنبي صلى الله عليه وسلم نطعا فيقيل عندها على ذلك النطع  قال  فإذا نام النبي صلى الله عليه وسلم أخذت من عرقه وشعره، فجمعته في قارورة، ثم جمعته في سك  قال  فلما حضر أنس بن مالك الوفاة أوصى أن يجعل في حنوطه من ذلك السك  قال  فجعل في حنوطه‏.‏",
      "text_en": " Narrated Thumama:                     Anas said, \"Um Sulaim used to spread a leather sheet for the Prophet and he used to take a midday nap on that leather sheet at her home.\" Anas added, \"When the Prophet had slept, she would take some of his sweat and hair and collect it (the sweat) in a bottle and then mix it with Suk (a kind of perfume) while he was still sleeping. \"When the death of Anas bin Malik approached, he advised that some of that Suk be mixed with his Hanut (perfume for embalming the dead body), and it was mixed with his Hanut.",
      "chain": [
        "30367",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "7041",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، حدثنا ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     That Abu Bakr wrote for him, Zakat regulations which Allah's Apostle had made compulsory, and wrote that one should neither collect various portions (of the property) nor divide the property into various portions in order to avoid paying Zakat.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو حاتم، مسلم بن حاتم البصري حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إياك والالتفات في الصلاة فإن الالتفات في الصلاة هلكة فإن كان لا بد ففي التطوع لا في الفريضة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas narrated:                     \"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، عن ثمامة، عن أنس بن مالك، قال كان نقش خاتم النبي صلى الله عليه وسلم محمد سطر ورسول سطر والله سطر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The inscription on the ring of the Prophet (ﷺ) was in three lines: 'Muhammad' on a line, 'Messenger' on a line, and 'Allah' on a line.\"",
      "chain": [
        "11222",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن يحيى، وغير، واحد، قالوا حدثنا محمد بن عبد الله الأنصاري، حدثني أبي، عن ثمامة، عن أنس بن مالك، قال كان نقش خاتم النبي صلى الله عليه وسلم ثلاثة أسطر محمد سطر ورسول سطر والله سطر ‏.‏ ولم يذكر محمد بن يحيى في حديثه ثلاثة أسطر ‏.‏ وفي الباب عن ابن عمر ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The inscription on the ring of the Prophet (ﷺ) was in three line: 'Muhammad' on a line, 'Messenger' on a line, 'Allah' on a line.\" And Muhammad bin Yahya (one of the two who narrated to him) did not say: \"Three lines\" in his narration.There are narrations on this topic from Ibn 'Umar.[Abu 'Eisa said:] This Hadith of Anas is a Hasan  Sahih Gharib.",
      "chain": [
        "30160",
        "11222",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "2678",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم بن حاتم الأنصاري البصري، حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إن قدرت أن تصبح وتمسي ليس في قلبك غش لأحد فافعل ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ يا بنى وذلك من سنتي ومن أحيا سنتي فقد أحبني ‏.‏ ومن أحبني كان معي في الجنة ‏\"‏ ‏.‏ وفي الحديث قصة طويلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ ومحمد بن عبد الله الأنصاري ثقة وأبوه ثقة وعلي بن زيد صدوق إلا أنه ربما يرفع الشىء الذي يوقفه غيره ‏.‏ قال وسمعت محمد بن بشار يقول قال أبو الوليد قال شعبة حدثنا علي بن زيد وكان رفاعا ولا نعرف لسعيد بن المسيب عن أنس رواية إلا هذا الحديث بطوله ‏.‏ وقد روى عباد بن ميسرة المنقري هذا الحديث عن علي بن زيد عن أنس ولم يذكر فيه عن سعيد بن المسيب ‏.‏ قال أبو عيسى وذاكرت به محمد بن إسماعيل فلم يعرفه ولم يعرف لسعيد بن المسيب عن أنس هذا الحديث ولا غيره ومات أنس بن مالك سنة ثلاث وتسعين ومات سعيد بن المسيب بعده بسنتين مات سنة خمس وتسعين ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) said to me: 'O my son! If you are capable of (waking up in) the morning and (ending) the evening, while there is nothing of deception in your heart for anything, then do so.' Then he said to me: 'O my son! That is from my Sunnah. Whoever revives my Sunnah then he has loved me. And whoever loved me, he shall be with me in Paradise.'\"",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا أبو حاتم البصري الأنصاري، مسلم بن حاتم حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إذا دخلت على أهلك فسلم يكون بركة عليك وعلى أهل بيتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Anas:                     \"The Messenger of Allah (ﷺ) said to me: 'O my little son! When you enter upon your family then give the Salam, it will be a blessing for you and upon the inhabitants of your house.\"",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "2723",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الصمد بن عبد الوارث، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله بن أنس بن مالك، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا وإذا تكلم بكلمة أعادها ثلاثا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"When the Messenger of Allah (ﷺ) would give the Salam he would do so three times, and when he would say a statement, he would say it three times.\"",
      "chain": [
        "30313",
        "20250",
        "11599",
        "19"
      ]
    },
    {
      "hadith_no": "4001",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو قتيبة، سلم بن قتيبة عن عبد الله بن المثنى، عن ثمامة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يعيد الكلمة ثلاثا لتعقل عنه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب إنما نعرفه من حديث عبد الله بن المثنى ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) would repeat a statement three times so that it could be understood.",
      "chain": [
        "11222",
        "20233",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4221",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن مرزوق البصري، حدثنا محمد بن عبد الله الأنصاري، حدثني أبي، عن ثمامة، عن أنس، قال كان قيس بن سعد من النبي صلى الله عليه وسلم بمنزلة صاحب الشرط من الأمير ‏.‏ قال الأنصاري يعني مما يلي من أموره ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الأنصاري ‏.‏",
      "text_en": " Narrated Anas:                     \"Qais bin Sa'd used to be, to the Prophet (ﷺ), in the position of the head of police for a ruler.\" (One of the narrators) Al-Ansari said: \"That is: Due to his affairs that he takes charge of.\"",
      "chain": [
        "34240",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    }
  ],
  "total_hadiths": 20
}