{
  "id": "11597",
  "name": "Tarayf bin Mujalad, Abu Tamayma طريف بن مجالد أبو تميمة الهجيمي",
  "full_name": "Tarayf bin Mujalad, Abu Tamayma طريف بن مجالد أبو تميمة الهجيمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "97",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4053",
      "name": "Jundab bin 'Abdullah al-Bajli ( جندب بن عبد الله بن سفيان البجلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11453",
      "name": "Abu al-Malih bin Usama أبو المليح بن أسامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19843",
      "name": "Hkym al-Athrm al-Bsry حكيم الأثرم البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18132",
      "name": "Ja'far bin Maymun al-Tamimi جعفر بن ميمون التميمي بياع الأنماط",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6069",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عارم، حدثنا المعتمر بن سليمان، يحدث عن أبيه، قال سمعت أبا تميمة، يحدث عن أبي عثمان النهدي، يحدثه أبو عثمان عن أسامة بن زيد  رضى الله عنهما كان رسول الله صلى الله عليه وسلم يأخذني فيقعدني على فخذه، ويقعد الحسن على فخذه الأخرى، ثم يضمهما ثم يقول ‏\"‏ اللهم ارحمهما فإني أرحمهما ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle used to put me on (one of) his thighs and put Al-Hasan bin `Ali on his other thigh, and then embrace us and say, \"O Allah! Please be Merciful to them, as I am merciful to them. \"",
      "chain": [
        "30351",
        "20283",
        "20288",
        "11289",
        "11597",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "1415",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن الصباح العطار، حدثنا أبو بحر، حدثنا ثابت بن عمارة، حدثنا أبو تميمة الهجيمي، قال لما بعثنا الركب - قال أبو داود يعني إلى المدينة قال - كنت أقص بعد صلاة الصبح فأسجد فنهاني ابن عمر فلم أنته ثلاث مرار ثم عاد فقال إني صليت خلف رسول الله صلى الله عليه وسلم ومع أبي بكر وعمر وعثمان - رضى الله عنهم - فلم يسجدوا حتى تطلع الشمس ‏.‏",
      "text_en": " Narrated AbuTamimah al-Hujaymi:                     When we came to Medina accompanying the caravan, I used to preach after the dawn prayer, and prostrate on account of the recitation of the Qur'an. Ibn Umar prohibited me three times, but I did not cease  doing that. He then repeated (his prohibition) saying: I prayed behind the Messenger of Allah (ﷺ), AbuBakr, Umar and Uthman, they would not prostrate (on account of the recitation of the Qur'an) till the sun had risen.",
      "chain": [
        "30142",
        "28337",
        "14048",
        "11597",
        "18"
      ]
    },
    {
      "hadith_no": "2210",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا أبو كامل، حدثنا عبد الواحد، وخالد الطحان، - المعنى - كلهم عن خالد، عن أبي تميمة الهجيمي، أن رجلا، قال لامرأته يا أخية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أختك هي ‏\"‏ ‏.‏ فكره ذلك ونهى عنه ‏.‏",
      "text_en": " Narrated Tamimah al-Hujayni:                     A man said to his wife: O my younger sister! The Messenger of Allah (ﷺ)said: Is she your sister? He (the Prophet disliked it and prohibited saying so.",
      "chain": [
        "20040",
        "20022",
        "30559",
        "20256",
        "11282",
        "11597"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن محمد القرشي، حدثنا حماد بن سلمة، أخبرنا يونس بن عبيد، عن عبيدة أبي خداش، عن أبي تميمة الهجيمي، عن جابر، - يعني ابن سليم - قال أتيت النبي صلى الله عليه وسلم وهو محتب بشملة وقد وقع هدبها على قدميه ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     When I came to the Prophet (ﷺ), he was sitting with his hands round his knees wearing the cloak the fringe of which was over his feet.",
      "chain": [
        "20021",
        "11075",
        "11597"
      ]
    },
    {
      "hadith_no": "4084",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن أبي غفار، حدثنا أبو تميمة الهجيمي، - وأبو تميمة اسمه طريف بن مجالد - عن أبي جرى، جابر بن سليم قال رأيت رجلا يصدر الناس عن رأيه، لا يقول شيئا إلا صدروا عنه قلت من هذا قالوا هذا رسول الله صلى الله عليه وسلم ‏.‏ قلت عليك السلام يا رسول الله مرتين ‏.‏ قال ‏\"‏ لا تقل عليك السلام ‏.‏ فإن عليك السلام تحية الميت قل السلام عليك ‏\"‏ ‏.‏ قال قلت أنت رسول الله صلى الله عليه وسلم قال ‏\"‏ أنا رسول الله الذي إذا أصابك ضر فدعوته كشفه عنك وإن أصابك عام سنة فدعوته أنبتها لك وإذا كنت بأرض قفراء أو فلاة فضلت راحلتك فدعوته ردها عليك ‏\"‏ ‏.‏ قلت اعهد إلى ‏.‏ قال ‏\"‏ لا تسبن أحدا ‏\"‏ ‏.‏ قال فما سببت بعده حرا ولا عبدا ولا بعيرا ولا شاة ‏.‏ قال ‏\"‏ ولا تحقرن شيئا من المعروف وأن تكلم أخاك وأنت منبسط إليه وجهك إن ذلك من المعروف وارفع إزارك إلى نصف الساق فإن أبيت فإلى الكعبين وإياك وإسبال الإزار فإنها من المخيلة وإن الله لا يحب المخيلة وإن امرؤ شتمك وعيرك بما يعلم فيك فلا تعيره بما تعلم فيه فإنما وبال ذلك عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuJurayy Jabir ibn Salim al-Hujaymi:                     I saw a man whose opinion was accepted by the people, and whatever he said they submitted to it.  I asked: Who is he?  They said: This is the Messenger of Allah (ﷺ).  I said: On you be peace, Messenger of Allah, twice.  He said: Do not say \"On you be peace,\" for \"On you be peace\" is a greeting for the dead, but say \"Peace be upon you\".  I asked: You are the Messenger of Allah (may peace be upon you)?  He said: I am the Messenger of Allah Whom you call when a calamity befalls you and He removes it; when you suffer from drought and you call Him, He grows food for you; and when you are in a desolate land or in a desert and your she-camel strays and you call Him, He returns it to you.  I said: Give me some advice.  He said: Do not abuse anyone. He said that he did not abuse a freeman, or a slave, or a camel or a sheep thenceforth. He said: Do not look down upon any good work, and when you speak to your brother, show him a cheerful face. This is a good work. Have your lower garment halfway down your shin; if you cannot do it, have it up to the ankles. Beware of trailing the lower garment, for it is conceit and Allah does not like conceit. And if a man abuses and shames you for something which he finds in you, then do not shame him for something which you find in him; he will bear the evil consequences for it.",
      "chain": [
        "30175",
        "20031",
        "11597"
      ]
    },
    {
      "hadith_no": "5209",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن أبي غفار، عن أبي تميمة الهجيمي، عن أبي جرى الهجيمي، قال أتيت النبي صلى الله عليه وسلم فقلت عليك السلام يا رسول الله ‏.‏ قال ‏\"‏ لا تقل عليك السلام فإن عليك السلام تحية الموتى ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuJurayy al-Hujaymi:                     I came to the Prophet (ﷺ) and said: Upon you be peace, Messenger of Allah! He said: Do not say: Upon you be peace, for \"Upon you be peace\" is the salutation to the dead.",
      "chain": [
        "30201",
        "20326",
        "11597"
      ]
    },
    {
      "hadith_no": "135",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا بندار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، وبهز بن أسد، قالوا حدثنا حماد بن سلمة، عن حكيم الأثرم، عن أبي تميمة الهجيمي، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أتى حائضا أو امرأة في دبرها أو كاهنا فقد كفر بما أنزل على محمد صلى الله عليه وسلم ‏\"‏ ‏.‏ قال أبو عيسى لا نعرف هذا الحديث إلا من حديث حكيم الأثرم عن أبي تميمة الهجيمي عن أبي هريرة ‏.‏ وإنما معنى هذا عند أهل العلم على التغليظ ‏.‏ وقد روي عن النبي صلى الله عليه وسلم قال ‏\"‏ من أتى حائضا فليتصدق بدينار ‏\"‏ ‏.‏ فلو كان إتيان الحائض كفرا لم يؤمر فيه بالكفارة ‏.‏ وضعف محمد هذا الحديث من قبل إسناده ‏.‏ وأبو تميمة الهجيمي اسمه طريف بن مجالد ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Whoever engages in sexual intercourse with a menstruating woman, or a woman in her anus, consults a soothsayer, then he has disbelieved in what was revealed to Muhammad.\"",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20214",
        "20021",
        "19843",
        "11597",
        "13"
      ]
    },
    {
      "hadith_no": "2721",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد، أخبرنا عبد الله، أخبرنا خالد الحذاء، عن أبي تميمة الهجيمي، عن رجل، من قومه قال طلبت النبي صلى الله عليه وسلم فلم أقدر عليه فجلست فإذا نفر هو فيهم ولا أعرفه وهو يصلح بينهم فلما فرغ قام معه بعضهم فقالوا يا رسول الله ‏.‏ فلما رأيت ذلك قلت عليك السلام يا رسول الله عليك السلام يا رسول الله عليك السلام يا رسول الله ‏.‏ قال ‏\"‏ إن عليك السلام تحية الميت إن عليك السلام تحية الميت ‏\"‏ ‏.‏ ثلاثا ثم أقبل على فقال ‏\"‏ إذا لقي الرجل أخاه المسلم فليقل السلام عليكم ورحمة الله ‏\"‏ ‏.‏ ثم رد على النبي صلى الله عليه وسلم قال ‏\"‏ وعليك ورحمة الله وعليك ورحمة الله وعليك ورحمة الله ‏\"‏ ‏.‏ قال أبو عيسى وقد روى هذا الحديث أبو غفار، عن أبي تميمة الهجيمي، عن أبي جرى، جابر بن سليم الهجيمي قال أتيت النبي صلى الله عليه وسلم فذكر الحديث ‏.‏ وأبو تميمة اسمه طريف بن مجالد ‏.",
      "text_en": " Narrated Abu Tamimah Al-Hujaimi:                     from a man among his people, who said: \"I went looking for the Prophet (ﷺ) but I was not able to find him. So I sat down, and then I saw a group of people, and he was among them, but I did not recognize him. He was settling some matter between them so when he was finished, some of them stood up with him and they were saying: 'O Messenger of Allah.' When I saw that, I said: \"'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah! 'Alaikas-Salam (upon you be peace) O Messenger of Allah!' He replied: 'Indeed \"'Alaikas-Salam (upon you be peace)\" is the greeting for the dead.' Then he came toward me and said: 'When a man meets his Muslim brother then he should say: \"As-Salamu 'Alaikum Wa Rahmatullahi Wa Barakatuh (peace be upon you, and the mercy and blessings of Allah).\" Then the Prophet (ﷺ) responded to my greeting, he said: 'And may Allah's mercy be upon you, and may Allah's mercy be upon you, and may Allah's mercy be upon you.'\"",
      "chain": [
        "16",
        "11282",
        "11597"
      ]
    },
    {
      "hadith_no": "2722",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا بذلك الحسن بن علي الخلال حدثنا أبو أسامة عن أبي غفار المثنى بن سعيد الطائي عن أبي تميمة الهجيمي عن جابر بن سليم قال أتيت النبي صلى الله عليه وسلم فقلت عليك السلام ‏.‏ فقال ‏\"‏ لا تقل عليك السلام ولكن قل السلام عليك ‏\"‏ ‏.‏ وذكر قصة طويلة وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Ghifar Al-Muthanna bin Sa'eed At-Ta'i:                     from Abu Tamimah al-Hujaimi from Jabir bin Sulaim who said: \"I went to the Prophet (ﷺ) and I said: ''Alaikas-Salam (upon you be peace)' so he replied: 'Do not say \"'Alaikas-Salam\" rather say As-Salamu Alaik.'\" And he mentioned the story in its entirety.",
      "chain": [
        "20318",
        "11597"
      ]
    },
    {
      "hadith_no": "3100",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن جعفر بن ميمون، عن أبي تميمة الهجيمي، عن أبي عثمان، عن ابن مسعود، قال صلى رسول الله صلى الله عليه وسلم العشاء ثم انصرف فأخذ بيد عبد الله بن مسعود حتى خرج به إلى بطحاء مكة فأجلسه ثم خط عليه خطا ثم قال ‏\"‏ لا تبرحن خطك فإنه سينتهي إليك رجال فلا تكلمهم فإنهم لا يكلمونك ‏\"‏ ‏.‏ قال ثم مضى رسول الله صلى الله عليه وسلم حيث أراد فبينا أنا جالس في خطي إذ أتاني رجال كأنهم الزط أشعارهم وأجسامهم لا أرى عورة ولا أرى قشرا وينتهون إلى لا يجاوزون الخط ثم يصدرون إلى رسول الله صلى الله عليه وسلم حتى إذا كان من آخر الليل لكن رسول الله صلى الله عليه وسلم قد جاءني وأنا جالس فقال ‏\"‏ لقد أراني منذ الليلة ‏\"‏ ‏.‏ ثم دخل على في خطي فتوسد فخذي فرقد وكان رسول الله صلى الله عليه وسلم إذا رقد نفخ فبينا أنا قاعد ورسول الله صلى الله عليه وسلم متوسد فخذي إذا أنا برجال عليهم ثياب بيض الله أعلم ما بهم من الجمال فانتهوا إلى فجلس طائفة منهم عند رأس رسول الله صلى الله عليه وسلم وطائفة منهم عند رجليه ثم قالوا بينهم ما رأينا عبدا قط أوتي مثل ما أوتي هذا النبي إن عينيه تنامان وقلبه يقظان اضربوا له مثلا مثل سيد بنى قصرا ثم جعل مأدبة فدعا الناس إلى طعامه وشرابه فمن أجابه أكل من طعامه وشرب من شرابه ومن لم يجبه عاقبه أو قال عذبه - ثم ارتفعوا واستيقظ رسول الله صلى الله عليه وسلم عند ذلك فقال ‏\"‏ سمعت ما قال هؤلاء وهل تدري من هؤلاء ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ هم الملائكة أفتدري ما المثل الذي ضربوا ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ المثل الذي ضربوا الرحمن تبارك وتعالى بنى الجنة ودعا إليها عباده فمن أجابه دخل الجنة ومن لم يجبه عاقبه أو عذبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وأبو تميمة هو الهجيمي واسمه طريف بن مجالد وأبو عثمان النهدي اسمه عبد الرحمن بن مل وسليمان التيمي قد روى هذا الحديث عنه معتمر وهو سليمان بن طرخان ولم يكن تيميا وإنما كان ينزل بني تيم فنسب إليهم ‏.‏ قال علي قال يحيى بن سعيد ما رأيت أخوف لله تعالى من سليمان التيمي ‏.‏",
      "text_en": " Narrated Abu 'Uthman An-Nahdi:                     from Ibn Mas'ud who said: \"The Messenger of Allah (ﷺ) performed 'Isha, then he turned and took the hand of 'Abdullah bin Mas'ud until he went with him to the wide valley of Makkah. He sat him down, then he drew a line around him. Then he said: 'Do not go beyond your line, for indeed there shall come some men to you, but do not speak to them for they shall not speak to you.'\" He said: \"Then the Messenger of Allah (ﷺ) went to where he wanted to go, and while I was sitting within the line, some men came to me that appeared as if they were from Az-Zut (A dark people, either from North Africa or India. See Tuhfat Al-Ahwadhi and An-Nihayah), both their hair and their bodies. I did not see nakedness nor covering. They ended up before me but they did not pass the line. Then they returned toward the Messenger of Allah (ﷺ) and when it was near the end of the night, the Messenger of Allah (ﷺ) came to me while I was sitting, and he said: \"I have been awake watching all night' then he entered into the line with me and lay down on my thigh to sleep. And the Messenger of Allah (ﷺ) would snore when he slept. So while I was sitting there, and the Messenger of Allah (ﷺ) was sleeping (with his head resting) on my thigh, there appeared some men wearing white garments, and Allah knows best just how handsome they were. They came towards me, and a group of them sat at the head of the Messenger of Allah (ﷺ), and a group at his feet. Then they said to each other: 'We have not ever seen a slave (of Allah) who was given the likes of what this Prophet has been given. Indeed his eyes sleep but his heart remains awake. His parable is that of a chief who built a castle, then he placed a table-spread in it, and invited the people to eat from his food and drink. So whoever answers his invitation, he eats from his food and drinks from his drink. Whoever does not answer, he is punished - or he said - he is chastised.' Then they alighted and the Messenger of Allah (ﷺ) awoke at that time, and said: 'I heard what they were saying. Do you know who they were?' I said: 'Allah and His Messenger know better.' He said: 'They were the angels. Do you know the meaning of the parable they stated?' I said: 'Allah and His Messenger know better.' He said: 'The meaning is that Ar-Rahman [Most Blessed and Most High] built Paradise, and He invited His Slaves to it. Whoever replies he shall enter Paradise, and whoever does not reply, he shall be punished or chastised.'\"",
      "chain": [
        "30160",
        "20276",
        "18132",
        "11597",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "682",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا حماد بن سلمة، عن حكيم الأثرم، عن أبي تميمة الهجيمي، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أتى حائضا أو امرأة في دبرها أو كاهنا فصدقه بما يقول فقد كفر بما أنزل على محمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever has intercourse with a menstruating woman, or with a woman in her rear, or who goes to a fortuneteller and believes what he says, he has disbelieved in that which was revealed to Muhammad.'\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20021",
        "19843",
        "11597",
        "13"
      ]
    }
  ],
  "total_hadiths": 11
}