{
  "id": "11591",
  "name": "Salm bin Zarayr al-'Atardi سلم بن زرير العطاردي",
  "full_name": "Salm bin Zarayr al-'Atardi سلم بن زرير العطاردي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "19840",
      "name": "Bryd bin Abi Maryam بريد بن أبي مريم مالك",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20679",
      "name": "Y'aqub bin Ishaq bin Zayd يعقوب بن إسحاق بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3241",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو الوليد، حدثنا سلم بن زرير، حدثنا أبو رجاء، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The Prophet said, \"I looked at Paradise and found poor people forming the majority of its inhabitants; and I looked at Hell and saw that the majority of its inhabitants were women.\"",
      "chain": [
        "20296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "3612",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو الوليد، حدثنا سلم بن زرير، سمعت أبا رجاء، قال حدثنا عمران بن حصين، أنهم كانوا مع النبي صلى الله عليه وسلم في مسير، فأدلجوا ليلتهم حتى إذا كان وجه الصبح عرسوا فغلبتهم أعينهم حتى ارتفعت الشمس، فكان أول من استيقظ من منامه أبو بكر، وكان لا يوقظ رسول الله صلى الله عليه وسلم من منامه حتى يستيقظ، فاستيقظ عمر فقعد أبو بكر عند رأسه فجعل يكبر ويرفع صوته، حتى استيقظ النبي صلى الله عليه وسلم فنزل وصلى بنا الغداة، فاعتزل رجل من القوم لم يصل معنا فلما انصرف قال ‏\"‏ يا فلان ما يمنعك أن تصلي معنا ‏\"‏‏.‏ قال أصابتني جنابة‏.‏ فأمره أن يتيمم بالصعيد، ثم صلى وجعلني رسول الله صلى الله عليه وسلم في ركوب بين يديه، وقد عطشنا عطشا شديدا فبينما نحن نسير إذا نحن بامرأة سادلة رجليها بين مزادتين، فقلنا لها أين الماء فقالت إنه لا ماء‏.‏ فقلنا كم بين أهلك وبين الماء قالت يوم وليلة‏.‏ فقلنا انطلقي إلى رسول الله صلى الله عليه وسلم‏.‏ قالت وما رسول الله فلم نملكها من أمرها حتى استقبلنا بها النبي صلى الله عليه وسلم، فحدثته بمثل الذي حدثتنا غير أنها حدثته أنها مؤتمة، فأمر بمزادتيها فمسح في العزلاوين، فشربنا عطاشا أربعين رجلا حتى روينا، فملأنا كل قربة معنا وإداوة، غير أنه لم نسق بعيرا وهى تكاد تنض من الملء ثم قال ‏\"‏ هاتوا ما عندكم ‏\"‏‏.‏ فجمع لها من الكسر والتمر، حتى أتت أهلها قالت لقيت أسحر الناس، أو هو نبي كما زعموا، فهدى الله ذاك الصرم بتلك المرأة فأسلمت وأسلموا‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     That they were with the Prophet on a journey. They travelled the whole night, and when dawn approached, they took a rest and sleep overwhelmed them till the sun rose high in the sky. The first to get up was Abu Bakr. Allah's Apostles used not to be awakened from his sleep, but he would wake up by himself. `Umar woke up and then Abu Bakr sat by the side of the Prophet's head and started saying: Allahu-Akbar raising his voice till the Prophet woke up, (and after traveling for a while) he dismounted and led us in the morning prayer. A man amongst the people failed to join us in the prayer. When the Prophet had finished the prayer, he asked (the man), \"O so-and-so! What prevented you from offering the prayer with us?\" He replied, \"I am Junub,\" Alllah's Apostle ordered him to perform Tayammam with clean earth. The man then offered the prayer. Allah's Apostle ordered me and a few others to go ahead of him. We had become very thirsty. While we were on our way (looking for water), we came across a lady (riding an animal), hanging her legs between two water-skins. We asked her, \"Where can we get water?\" She replied, \"Oh ! There is no water.\" We asked, \"how far is your house from the water?\" She replied, \"A distance of a day and a night travel.\" We said, \"Come on to Allah's Apostle, \"She asked, \"What is Allah's Apostle ?\" So we brought her to Allah's Apostle against her will, and she told him what she had told us before and added that she was the mother of orphans. So the Prophet ordered that her two water-skins be brought and he rubbed the mouths of the water-skins. As we were thirsty, we drank till we quenched our thirst and we were forty men. We also filled all our waterskins and other utensils with water, but we did not water the camels. The waterskin was so full that it was almost about to burst. The Prophet then said, \"Bring what (foodstuff) you have.\" So some dates and pieces of bread were collected for the lady, and when she went to her people, she said, \"I have met either the greatest magician or a prophet as the people claim.\" So Allah guided the people of that village through that lady. She embraced Islam and they all embraced Islam.",
      "chain": [
        "20296",
        "11591",
        "11440"
      ]
    },
    {
      "hadith_no": "6242",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا سلم بن زرير، سمعت أبا رجاء، سمعت ابن عباس  رضى الله عنهما  قال رسول الله صلى الله عليه وسلم لابن صائد ‏\"‏ قد خبأت لك خبيئا فما هو ‏\"‏‏.‏ قال الدخ‏.‏ قال ‏\"‏ اخسأ ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said to Ibn Saiyad \"I have hidden something for you in my mind; What is it?\" He said, \"Ad-Dukh.\" The Prophet said, \"Ikhsa.\"",
      "chain": [
        "20296",
        "11591",
        "11440",
        "17"
      ]
    },
    {
      "hadith_no": "6526",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو الوليد، حدثنا سلم بن زرير، حدثنا أبو رجاء، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏ تابعه أيوب وعوف، وقال صخر وحماد بن نجيح عن أبي رجاء عن ابن عباس‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The Prophet said, \"I looked into Paradise and found that the majority of its dwellers were the poor people, and I looked into the (Hell) Fire and found that the majority of its dwellers were women.\"",
      "chain": [
        "20296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "1595",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا عبيد الله بن عبد المجيد، حدثنا سلم بن زرير العطاردي، قال سمعت أبا رجاء العطاردي، عن عمران بن حصين، قال كنت مع نبي الله صلى الله عليه وسلم في مسير له فأدلجنا ليلتنا حتى إذا كان في وجه الصبح عرسنا فغلبتنا أعيننا حتى بزغت الشمس - قال - فكان أول من استيقظ منا أبو بكر وكنا لا نوقظ نبي الله صلى الله عليه وسلم من منامه إذا نام حتى يستيقظ ثم استيقظ عمر فقام عند نبي الله صلى الله عليه وسلم فجعل يكبر ويرفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم فلما رفع رأسه ورأى الشمس قد بزغت قال ‏\"‏ ارتحلوا ‏\"‏ ‏.‏ فسار بنا حتى إذا ابيضت الشمس نزل فصلى بنا الغداة فاعتزل رجل من القوم لم يصل معنا فلما انصرف قال له رسول الله صلى الله عليه وسلم ‏\"‏ يا فلان ما منعك أن تصلي معنا ‏\"‏ ‏.‏ قال يا نبي الله أصابتني جنابة ‏.‏ فأمره رسول الله صلى الله عليه وسلم فتيمم بالصعيد فصلى ثم عجلني في ركب بين يديه نطلب الماء وقد عطشنا عطشا شديدا ‏.‏ فبينما نحن نسير إذا نحن بامرأة سادلة رجليها بين مزادتين فقلنا لها أين الماء قالت أيهاه أيهاه لا ماء لكم ‏.‏ قلنا فكم بين أهلك وبين الماء ‏.‏ قالت مسيرة يوم وليلة ‏.‏ قلنا انطلقي إلى رسول الله صلى الله عليه وسلم ‏.‏ قالت وما رسول الله فلم نملكها من أمرها شيئا حتى انطلقنا بها فاستقبلنا بها رسول الله صلى الله عليه وسلم فسألها فأخبرته مثل الذي أخبرتنا وأخبرته أنها موتمة لها صبيان أيتام فأمر براويتها فأنيخت فمج في العزلاوين العلياوين ثم بعث براويتها فشربنا ونحن أربعون رجلا عطاش حتى روينا وملأنا كل قربة معنا وإداوة وغسلنا صاحبنا غير أنا لم نسق بعيرا وهي تكاد تنضرج من الماء - يعني المزادتين - ثم قال ‏\"‏ هاتوا ما كان عندكم ‏\"‏ ‏.‏ فجمعنا لها من كسر وتمر وصر لها صرة فقال لها ‏\"‏ اذهبي فأطعمي هذا عيالك واعلمي أنا لم نرزأ من مائك ‏\"‏ ‏.‏ فلما أتت أهلها قالت لقد لقيت أسحر البشر أو إنه لنبي كما زعم كان من أمره ذيت وذيت ‏.‏ فهدى الله ذاك الصرم بتلك المرأة فأسلمت وأسلموا ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      I was with the Apostle of Allah (may peace be upon him) in a journey. We travelled the whole of the night, and when it was about to dawn, we got down for rest, and were overpowered (by sleep) till the sun shone. Abu Bakr was the first to awake amongst us. and we did not awake the Apostle of Allah (may peace be upon him) from his sleep allowing him to wake up (of his own accord). It was 'Umar who then woke up. He stood by the side of the Apostle of Allah (may peace be upon him) and recited takbir in a loud voice till the Messenger of Allah (may peace be upon him) woke up. When he lifted his head, he saw that the sun had arisen; he then said: Proceed on. He travelled along with us till the sun shone brightly. He came down (from his camel) and led us in the morning prayer. A person, however, remained away from the people and did not say, prayer along with us. After having completed the prayer, the Messenger of Allah (may peace be upon him) said to him: O, so and so, what prevented you from observing prayer with us? He said: Apostle of Allah! I was not in a state of purity. The Messenger of Allah (may peace be upon him) ordered him arid lie performed Tayammum with dust and said prayer. He then urged me to go ahead immediately along with other riders to find out water, for we felt very thirsty. We were traveling when we came across a woman who was sitting (on a camel) with her feet hanging over two leathern water bags. We said to her: How far is water available? She, said: Far, very far, very far. You cannot get water. We (again) said: How much distance is there between (the residence of) your family and water? She said: It is a day and night journey. We said to her: You go to the Messenger of Allah (may peace be upon him). She said: Who is the Messenger of Allah? We somehow or the other managed to bring her to the Messenger of Allah (may peace be upon him) and he asked about her, and she informed him as she had informed us that she was a widow having orphan children. He ordered that her camel should be made to kneal down and he gargled in the opening (of her leathern water-bag). The camel was then raised up and we forty thirsty men drank water till we were completely satiated, and we filled up all leathern water-bags and water-skins that we had with us and we washed our companions, but we did not make any camel drink, and (the leathern water-bags) were about to burst (on account of excess of water). He then said: Bring whatever you have with you. So we collected the bits (of estable things) and dates and packed them up in a bundle, and said to her: Take it away. This is meant for your children, and know that we have not its any way done any loss to your water. W hen she came to her family she said: I have met the greatest magician amongst human beings, or he is an apostle, as he claims to be, and she then narrated what had happened and Allah guided aright those people through that woman. She affirmed her faith in Islam and so did the people embrace Islam.",
      "chain": [
        "30296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا سلم بن زرير، قال حدثنا عبد الرحمن بن طرفة، عن جده، عرفجة بن أسعد أنه أصيب أنفه يوم الكلاب في الجاهلية فاتخذ أنفا من ورق فأنتن عليه فأمره النبي صلى الله عليه وسلم أن يتخذ أنفا من ذهب ‏.‏",
      "text_en": " It was narrated from 'Arafah bin As'ad that:                     His nose was cut off at the battle of Al-Kulab during the Jahiliyyah, so he wore a nose made of silver, but it began to rot, so the Prophet [SAW] told him to wear a nose made of gold.",
      "chain": [
        "30172",
        "20218",
        "11591",
        "18630"
      ]
    }
  ],
  "total_hadiths": 6
}