{
  "id": "11595",
  "name": "Sinan bin Rabi'ya al-Bahli سنان بن ربيعة الباهلي",
  "full_name": "Sinan bin Rabi'ya al-Bahli سنان بن ربيعة الباهلي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Bahli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12060",
      "name": "Hdrmy bin Lahq al-Tmymy حضرمي بن لاحق التميمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20543",
      "name": "Sa'id bin Zayd bin Darham سعيد بن زيد بن درهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "134",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، ح وحدثنا مسدد، وقتيبة، عن حماد بن زيد، عن سنان بن ربيعة، عن شهر بن حوشب، عن أبي أمامة، وذكر، وضوء النبي، صلى الله عليه وسلم قال كان رسول الله صلى الله عليه وسلم يمسح المأقين ‏.‏ قال وقال ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏ قال سليمان بن حرب يقولها أبو أمامة ‏.‏ قال قتيبة قال حماد لا أدري هو من قول النبي صلى الله عليه وسلم أو من أبي أمامة ‏.‏ يعني قصة الأذنين ‏.‏ قال قتيبة عن سنان أبي ربيعة ‏.‏ قال أبو داود وهو ابن ربيعة كنيته أبو ربيعة ‏.‏",
      "text_en": " Narrated AbuUmamah:                     AbuUmamah mentioned how the Messenger of Allah (ﷺ) performed ablution, saying that he used to wipe the corners of his eyes, and he said that the ears are treated as part of the head.Sulaiman b. Harb said: the wording \"the ears are treated as part of the head\" were uttered by Abu Umamah.Hammad said: I do not know whether the phrase \"the ears are treated as part of the head\" was he statement of the Prophet (ﷺ) or of Abu Umamah.",
      "chain": [
        "20193",
        "20022",
        "30175",
        "30367",
        "20022",
        "11595",
        "11044",
        "405"
      ]
    },
    {
      "hadith_no": "37",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن سنان بن ربيعة، عن شهر بن حوشب، عن أبي أمامة، قال توضأ النبي صلى الله عليه وسلم فغسل وجهه ثلاثا ويديه ثلاثا ومسح برأسه وقال ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏ قال أبو عيسى قال قتيبة قال حماد لا أدري هذا من قول النبي صلى الله عليه وسلم أو من قول أبي أمامة ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى هذا حديث حسن ليس إسناده بذاك القائم ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أن الأذنين من الرأس ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم ما أقبل من الأذنين فمن الوجه وما أدبر فمن الرأس ‏.‏ قال إسحاق وأختار أن يمسح مقدمهما مع الوجه ومؤخرهما مع رأسه ‏.‏ وقال الشافعي هما سنة على حيالهما يمسحهما بماء جديد ‏.‏",
      "text_en": " Abu Umamah narrated:                     \"The Prophet performed Wudu; so he washed his face three times, and his hands three times, and wiped his head, and he said: \"The ears are part of the head.\"",
      "chain": [
        "30367",
        "20022",
        "11595",
        "11044",
        "405"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن زياد، أنبأنا حماد بن زيد، عن سنان بن ربيعة، عن شهر بن حوشب، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏ وكان يمسح رأسه مرة وكان يمسح المأقين ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah said: \"The ears are part of the head.\" He used to wipe his head once, and he used to wipe over the inner corners of the eyes (that are close to the nose).",
      "chain": [
        "11216",
        "20022",
        "11595",
        "11044",
        "405"
      ]
    }
  ],
  "total_hadiths": 3
}