{
  "id": "116",
  "name": "Abu Sufyan ibn Harb ( صخر بن حرب أبو سفيان ( رضي الله عنه",
  "full_name": "Abu Sufyan ibn Harb ( صخر بن حرب أبو سفيان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "63",
      "date_gregorian": "560",
      "date_display": [
        "63 BH",
        "560 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "31",
      "date_gregorian": "650",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Commander",
      "Narrator [ خ  م  د  ت  س  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams",
      "Late Muslim",
      "Opening Muslim",
      "Hunain"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "74",
      "name": "Hind bint 'Utba b. Rabi'a b. 'Abd Shams ( هند بنت عتبة بن ربيعة بن عبد شمس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3187",
      "name": "Umayma bint Sufyan bin Wahb ( أميمة / أمامة بنت سفيان بن وهب بن الأشيم ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "845",
      "name": "Umiama/Umayna bint Abi Sufyan ( أميمة بنت أبي سفيان بن حرب بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "846",
      "name": "'Unbasa bin Abi Sufyan ( عنبسة بن أبي سفيان بن حرب بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "847",
      "name": "'Uzza bint Abi Sufyan ( عزة بنت أبي سفيان بن حرب بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "848",
      "name": "Durrah bint Abi Sufyan ( درة بنت أبي سفيان بن حرب بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "849",
      "name": "Hamnah bint Abi Sufyan ( حمنة بنت أبي سفيان بن حرب بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "218",
      "name": "Yazid bin Abi Sufyan ( يزيد بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "851",
      "name": "Hind bint Abi Sufyan ( هند بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "841",
      "name": "Umm Hakam bint Abu Sufyan ( أم الحكم بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "842",
      "name": "Juwayriyya bint Abu Sufyan ( جويرية بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "843",
      "name": "Quriaba bint Abu Sufyan ( قريبة بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "844",
      "name": "'Utba ibn Abu Sufyan ( عتبة بن أبي سفيان بن حرب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "850",
      "name": "Zaynab/Maymuna bint Abi Sufyan ( زينب/ميمونة بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "162",
      "name": "al-Fa'rah bint Abi Sufyan ( الفارعة بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2190",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال سمعت مالكا، وسأله، عبيد الله بن الربيع أحدثك داود عن أبي سفيان، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم رخص في بيع العرايا في خمسة أوسق أو دون خمسة أوسق قال نعم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet allowed the sale of the dates of 'Araya provided they were about five Awsuq (singular: Wasaq which means sixty Sa's) or less (in amount).",
      "chain": [
        "30143",
        "20001",
        "116",
        "13"
      ]
    },
    {
      "hadith_no": "4948",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني حفص بن عمر، حدثنا خالد بن عبد الله، حدثنا حصين، عن سالم بن أبي الجعد، وعن أبي سفيان، عن جابر بن عبد الله  رضى الله عنهما  قال أقبلت عير يوم الجمعة ونحن مع النبي صلى الله عليه وسلم فثار الناس إلا اثنا عشر رجلا فأنزل الله ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A caravan of merchandise arrived at Medina on a Friday while we were with the Prophet All the people left (the Prophet and headed for the caravan) except twelve persons. Then Allah revealed:-- 'But when they see some bargain or some amusement they disperse headlong to it.' ..(62.11)",
      "chain": [
        "30329",
        "20423",
        "15097",
        "11342",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5665",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، وأبي، سفيان عن جابر بن عبدالله، قال جاء أبو حميد بقدح من لبن من النقيع، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ألا خمرته ولو أن تعرض عليه عودا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Abu Humaid brought a cup of mix from a place called Al-Naqi. Allah's Apostle said to him, \"Will you not cover it, even by placing a stick across its\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11161",
        "116"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي كريب - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال أتى النبي صلى الله عليه وسلم النعمان بن قوقل فقال يا رسول الله أرأيت إذا صليت المكتوبة وحرمت الحرام وأحللت الحلال أأدخل الجنة فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that Nu'man b. Qaufal came to the Holy Prophet (may peace be upon him) and said:                      Would I enter Paradise if I say the obligatory prayers and deny myself that which is forbidden and treat that as lawful what has been made permissible (by the Shari'ah)? The Holy Prophet (may peace be upon him) replied in the affirmative.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حجاج بن الشاعر، والقاسم بن زكرياء، قالا حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن أبي صالح، وأبي، سفيان عن جابر، قال قال النعمان بن قوقل يا رسول الله ‏.‏ بمثله ‏.‏ وزاد فيه ولم أزد على ذلك شيئا ‏.‏",
      "text_en": " A similar hadith is narrated on Jabir's authority in which the following words are added:                      I will do nothing more.",
      "chain": [
        "38834",
        "20340",
        "20240",
        "11060",
        "11161",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن أبي سفيان، عن جابر، وعن أبي صالح، عن أبي هريرة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس ‏\"‏ ‏.‏ بمثل حديث ابن المسيب عن أبي هريرة ح",
      "text_en": "",
      "chain": [
        "30201",
        "20317",
        "11060",
        "116",
        "34",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "256",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وعثمان بن أبي شيبة، كلاهما عن جرير، قال يحيى أخبرنا جرير، عن الأعمش، عن أبي سفيان، قال سمعت جابرا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن بين الرجل وبين الشرك والكفر ترك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that he heard the Apostle (may peace and blessings be upon him) saying. Verily between man and between polytheism and unbelief is the negligence of prayer.",
      "chain": [
        "30399",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال أتى النبي صلى الله عليه وسلم رجل فقال يا رسول الله ما الموجبتان فقال ‏\"‏ من مات لا يشرك بالله شيئا دخل الجنة ومن مات يشرك بالله شيئا دخل النار ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that a man came to the Apostle of Allah (may peace be upon him) and said:                      Messenger of Allah, what are the two things quite unavoidable? He replied: He who dies without associating anyone with Allah would (necessarily) enter Paradise and he who dies associating anything with Allah would enter the (Fire of) Hell.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، وإسماعيل بن سالم، قالا أخبرنا هشيم، عن أبي بشر، عن أبي سفيان، عن جابر بن عبد الله، أن وفد، ثقيف سألوا النبي صلى الله عليه وسلم فقالوا إن أرضنا أرض باردة فكيف بالغسل فقال ‏\"‏ أما أنا فأفرغ على رأسي ثلاثا ‏\"‏ ‏.‏ قال ابن سالم في روايته حدثنا هشيم أخبرنا أبو بشر وقال إن وفد ثقيف قالوا يا رسول الله ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      A delegation of the Thaqif said to the Apostle of Allah (may peace be upon him): Our land is cold; what about our bathing then? He (the Holy Prophet) said: I pour water thrice over my head.Ibn Salim in his narration reported:\" The delegation of the Thaqif said: Messenger of Allah.\"",
      "chain": [
        "30399",
        "30415",
        "20468",
        "11419",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الشيطان إذا سمع النداء بالصلاة ذهب حتى يكون مكان الروحاء ‏\"‏ ‏.‏ قال سليمان فسألته عن الروحاء ‏.‏ فقال هي من المدينة ستة وثلاثون ميلا ‏.‏",
      "text_en": " Abu Sufyan reported it on the authority of Jabir that he had heard the Apostle of Allah (may peace be upon him) say:                      When Satan hears the call to prayer, he runs away to a distance like that of Rauha. Sulaimin said: I asked him about Rauha. He replied: It is at a distance of thirty-six miles from Medina.",
      "chain": [
        "30367",
        "30203",
        "30123",
        "30312",
        "4057",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني عمرو الناقد، وإسحاق بن إبراهيم، - واللفظ لعمرو - قال حدثني عيسى بن يونس، حدثنا الأعمش، عن أبي سفيان، عن جابر، حدثني أبو سعيد الخدري، أنه دخل على النبي صلى الله عليه وسلم قال فرأيته يصلي على حصير يسجد عليه - قال - ورأيته يصلي في ثوب واحد متوشحا به ‏.‏",
      "text_en": " Abu Sa'id al Khudri reported:                      I visited the Apostle (may peace be upon him) and saw him praying on a reed mat on which he was prostrating himself. And I saw him praying in a single garment with ends crossed with each other.",
      "chain": [
        "30263",
        "30123",
        "20347",
        "11060",
        "116",
        "34",
        "38"
      ]
    },
    {
      "hadith_no": "1537",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثني سويد بن سعيد، قال حدثنا علي بن مسهر، جميعا عن الأعمش، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - أخبرنا عيسى بن يونس، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال حدثنا أبو سعيد الخدري، أنه دخل على رسول الله صلى الله عليه وسلم فوجده يصلي على حصير يسجد عليه ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that he went to the Messenger of Allah (may peace be upon him) and found him observing prayer on a mat and prostrating on that.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30547",
        "20345",
        "11060",
        "30123",
        "20347",
        "11060",
        "116",
        "34",
        "38"
      ]
    },
    {
      "hadith_no": "1555",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، - وهو ابن عبد الله - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل الصلوات الخمس كمثل نهر جار غمر على باب أحدكم يغتسل منه كل يوم خمس مرات ‏\"‏ ‏.‏ قال قال الحسن وما يبقي ذلك من الدرن",
      "text_en": " Jabir b. 'Abdullah reported that the Messenger of Allah (may peace be upon him) said:                      The similitude of five prayers is like an overflowing river passing by the gate of one of you in which he washes five times daily Hasan said: No filthiness can remain on him.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "1802",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، وأبو معاوية عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خاف أن لا يقوم من آخر الليل فليوتر أوله ومن طمع أن يقوم آخره فليوتر آخر الليل فإن صلاة آخر الليل مشهودة وذلك أفضل ‏\"‏ ‏.‏ وقال أبو معاوية محضورة ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      He who amongst you is afraid that he may not be able to get up at the end of the night should observe Witr (in the first part) and then sleep, and he who is confident of getting up and praying at night (i. e. Tahajjud prayer) should observe it at the end of it, for the recitation at the end of the night to visited (by angels), and that is excellent.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "1805",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال سئل رسول الله صلى الله عليه وسلم أى الصلاة أفضل قال ‏\"‏ طول القنوت ‏\"‏ ‏.‏ قال أبو بكر حدثنا أبو معاوية عن الأعمش ‏.‏",
      "text_en": " Jabir said he heard Allah's Messenger (may peace be upon him) say:                      There is an hour during the night in which no Muslim individual will ask Allah for good in this world and the next without His giving it to him; and that applies to every night.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "1806",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن في الليل لساعة لا يوافقها رجل مسلم يسأل الله خيرا من أمر الدنيا والآخرة إلا أعطاه إياه وذلك كل ليلة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard the Apostle of Allah (may peace be upon him) as saying: There is an hour during the night in which no Muslim bondman will ask Allah for good in this world and the next but He will grant it to him.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قضى أحدكم الصلاة في مسجده فليجعل لبيته نصيبا من صلاته فإن الله جاعل في بيته من صلاته خيرا ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported Allah's Apostle (may peace be upon him) as saying:                      The house in which remembrance of Allah is made and the house in which Allah is not remembered are like the living and the dead.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "2036",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا رفاعة بن الهيثم الواسطي، حدثنا خالد، - يعني الطحان - عن حصين، عن سالم، وأبي، سفيان عن جابر بن عبد الله، قال كنا مع النبي صلى الله عليه وسلم يوم الجمعة فقدمت سويقة قال فخرج الناس إليها فلم يبق إلا اثنا عشر رجلا أنا فيهم - قال - فأنزل الله ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      I was along with the Apostle of Allah (may peace be upon him) on Friday when a caravan arrived. The people went to it, and none but twelve persons were left behind and I was one of them; and it was on this occasion that this verse was revealed:\" And when they see merchandise or sport away to it, and leave thee standing\" (lxii. 1 1). they break",
      "chain": [
        "20423",
        "15097",
        "11011",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "2037",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا إسماعيل بن سالم، أخبرنا هشيم، أخبرنا حصين، عن أبي سفيان، وسالم، بن أبي الجعد عن جابر بن عبد الله، قال بينا النبي صلى الله عليه وسلم قائم يوم الجمعة إذ قدمت عير إلى المدينة فابتدرها أصحاب رسول الله صلى الله عليه وسلم حتى لم يبق معه إلا اثنا عشر رجلا فيهم أبو بكر وعمر - قال - ونزلت هذه الآية ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Jabir b. Abdullah reported:                      While the Apostle of Allah (may peace be upon him) was delivering (a sermon) on Friday, a caravan of merchandise came to Medina. The Companions of the Messenger of Allah (may peace be upon him) rushed towards it till only twelve persons were left with him including Abu Bakr and 'Umar; and it was at this occasion that this verse was revealed.\" And when they see merchandise or sport, they break away to it.\"",
      "chain": [
        "30415",
        "20468",
        "15097",
        "116",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، كلاهما عن عيسى بن يونس، - قال ابن خشرم أخبرنا عيسى، - عن الأعمش، عن أبي سفيان، عن جابر بن عبد الله، قال جاء سليك الغطفاني يوم الجمعة ورسول الله صلى الله عليه وسلم يخطب فجلس فقال له ‏\"‏ يا سليك قم فاركع ركعتين وتجوز فيهما - ثم قال - إذا جاء أحدكم يوم الجمعة والإمام يخطب فليركع ركعتين وليتجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Sulaik Ghatafani came on Friday when the Messenger of Allah (may peace be upon him) was delivering the sermon. He (Sulaik) sat down. He (the Holy Prophet) said to him: 0 Sulaik I stand and observe two rak'ahs and make them short, and then said: When any one of you comes on Friday, while the Imam delivers the sermon, he should observe two rak'ahs and should make them short.",
      "chain": [
        "30123",
        "30556",
        "20347",
        "20347",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "4054",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ح وحدثنا أبو كريب، وإسحاق، بن إبراهيم جميعا عن أبي معاوية، ح وحدثنا عمرو الناقد، حدثنا عمار بن محمد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن فضيل، كل هؤلاء عن الأعمش، عن أبي سفيان، عن جابر، ‏.‏ زاد عمرو في روايته عن عمار، وأبو كريب في روايته عن أبي معاوية، فقالا عن أم مبشر، وفى رواية ابن فضيل عن امرأة، زيد بن حارثة وفي رواية إسحاق عن أبي معاوية، قال ربما قال عن أم مبشر، عن النبي صلى الله عليه وسلم ‏.‏ وربما لم يقل وكلهم قالوا عن النبي صلى الله عليه وسلم بنحو حديث عطاء وأبي الزبير وعمرو بن دينار ‏.‏",
      "text_en": " This hadith is transmitted on the authority of Abu Muawiya (but With a slight change of words).",
      "chain": [
        "30201",
        "20317",
        "30216",
        "30123",
        "20354",
        "30263",
        "20596",
        "30201",
        "11060",
        "116",
        "25"
      ]
    },
    {
      "hadith_no": "5041",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال كنا مع النبي صلى الله عليه وسلم في غزاة فقال ‏\"‏ إن بالمدينة لرجالا ما سرتم مسيرا ولا قطعتم واديا إلا كانوا معكم حبسهم المرض ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir who said:                      We were with the Holy Prophet (may peace be upon him) on an expedition. He said: There are some people in Medina. They are with you whenever you cover a distance or cross a valley. They have been detained by illness.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5363",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، وأبي، صالح عن جابر، قال جاء رجل يقال له أبو حميد بقدح من لبن من النقيع فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ألا خمرته ولو تعرض عليه عودا ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that a person who was known as Abu Humaid brought for him (the Holy Prophet) a cup of milk from al-Naqi'. Allah's Messenger (may peace be upon him) said to him:                      Why did you not cover it even with a wood across it?",
      "chain": [
        "30203",
        "20028",
        "11060",
        "116",
        "11161",
        "34"
      ]
    },
    {
      "hadith_no": "5423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الشيطان يحضر أحدكم عند كل شىء من شأنه حتى يحضره عند طعامه فإذا سقطت من أحدكم اللقمة فليمط ما كان بها من أذى ثم ليأكلها ولا يدعها للشيطان فإذا فرغ فليلعق أصابعه فإنه لا يدري في أى طعامه تكون البركة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) as saying: The Satan is present with any one of you in everything he does; he is present even when he eats food; so if any one of you drops a mouthful he should remove away anything filthy on it and eat it and not leave for the devil; and when he finishes (food) he should lick his fingers, for he does not know in what portion of his food the blessing lies.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5431",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو الجواب، حدثنا عمار، - وهو ابن رزيق - عن الأعمش، عن أبي سفيان، عن جابر، ح",
      "text_en": " This hadith has been transmitted on the authority of Jabir also.",
      "chain": [
        "30452",
        "20578",
        "20595",
        "11060",
        "116"
      ]
    },
    {
      "hadith_no": "5473",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو عوانة، عن أبي بشر، عن أبي سفيان، عن  جابر بن عبد الله، أن النبي صلى الله عليه وسلم سأل أهله الأدم فقالوا ما عندنا إلا خل ‏.‏ فدعا به فجعل يأكل به ويقول ‏\"‏ نعم الأدم الخل نعم الأدم الخل ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) asked his family for condiment. They (the members of his household) said:                      We have nothing with us but vinegar. He asked for it, he began to eat it, and then said: Vinegar is a good condiment, vinegar is a good condiment.",
      "chain": [
        "30399",
        "20469",
        "11419",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب وإسحاق بن إبراهيم قال أبو بكر وأبو كريب حدثنا وقال الآخران، أخبرنا أبو معاوية، عن الأعمش، عن أبي، سفيان عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طعام الواحد يكفي الاثنين وطعام الاثنين يكفي الأربعة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      Food for one suffices two and food for two suffices for four.",
      "chain": [
        "30399",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5492",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، قالا حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ طعام الرجل يكفي رجلين وطعام رجلين يكفي أربعة وطعام أربعة يكفي ثمانية ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      Food for one (person) suffices two, and food for two (persons) suffices four persons and food for four persons suffices eight persons.",
      "chain": [
        "30367",
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5859",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، عن الأعمش، عن أبي سفيان، عن جابر، قال كان لي خال يرقي من العقرب فنهى رسول الله صلى الله عليه وسلم عن الرقى - قال - فأتاه فقال يا رسول الله إنك نهيت عن الرقى وأنا أرقي من العقرب ‏.‏ فقال ‏\"‏ من استطاع منكم أن ينفع أخاه فليفعل ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported I had a maternal uncle who treated the sting of the scorpion with the help of incantation. Allah's Messenger (may peace be upon him) forbade incantation. He came to him and said:                      Allah's Messenger, you forbade to practise incantation, whereas I employ it for curing the sting of the scorpion, whereupon he said: He who amongst you is capable of employing it as a means to do good should do that.",
      "chain": [
        "30201",
        "30200",
        "20032",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5861",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال نهى رسول الله صلى الله عليه وسلم عن الرقى فجاء آل عمرو بن حزم إلى رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنه كانت عندنا رقية نرقي بها من العقرب وإنك نهيت عن الرقى ‏.‏ قال فعرضوها عليه ‏.‏ فقال ‏\"‏ ما أرى بأسا من استطاع منكم أن ينفع أخاه فلينفعه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) prohibited incantation. Then the people of Amr b. Hazm came to Allah's Messenger (may peace be upon him) and said:                      We know an incantation which we use for curing the sting of the scorpion but you have prohibited it. They recited (the words of incantation) before him, whereupon he said: I do not see any harm (in it), so he who amongst you is competent to do good to his brother should do that.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5875",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، و أبو بكر بن أبي شيبة وأبو كريب قال يحيى - واللفظ له - أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال بعث رسول الله صلى الله عليه وسلم إلى أبى بن كعب طبيبا فقطع منه عرقا ثم كواه عليه ‏.‏",
      "text_en": " Jabir reported that Allah's Messenger (may peace be upon him) sent a phystian to Ubayy b. Ka'b. He cut the vein and then cauterised it.",
      "chain": [
        "30399",
        "20436",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "6063",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي سفيان، عن  جابر، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال يا رسول الله رأيت في المنام كأن رأسي ضرب فتدحرج فاشتددت على أثره ‏.‏ فقال رسول الله صلى الله عليه وسلم للأعرابي ‏\"‏ لا تحدث الناس بتلعب الشيطان بك في منامك ‏\"‏ ‏.‏ وقال سمعت النبي صلى الله عليه وسلم بعد يخطب فقال ‏\"‏ لا يحدثن أحدكم بتلعب الشيطان به في منامه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that there came to Allah's Apostle (may peace be upon him) a desert Arab and said:                      Allah's Messenger, I saw in the state of steep as if my head had been cut off and I had been moving on haltingly after it. Thereupon Allah's Messenger (may peace be upon him) said to that desert Arab: Do not narrate to the people the vain sporting of satan with you in your sleep and (the narrator) also said: I heard Allah's Messenger (may peace be upon him) in his subsequent address: None amongst you should narrate the vain sporting of devil with him in the dream.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "6064",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج قالا حدثنا وكيع، عن الأعمش، عن أبي سفيان، عن جابر، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله رأيت في المنام كأن رأسي قطع ‏.‏ قال فضحك النبي صلى الله عليه وسلم وقال ‏\"‏ إذا لعب الشيطان بأحدكم في منامه فلا يحدث به الناس ‏\"‏ ‏.‏ وفي رواية أبي بكر ‏\"‏ إذا لعب بأحدكم ‏\"‏ ‏.‏ ولم يذكر الشيطان ‏.‏",
      "text_en": " Jabir reported that a'person came to Allah's Apostle (may peace be upon him) and said:                      Allah's Messenger, I have seen in the state of sleep as if my head had been cut off. Thereupon Allah's Apostle (may peace be upon him) laughed and said: When the satan plays with any one of you in the state of steep, do not inention it to the people; and in the hadith transmitted by Abu Bakr (the words are):\" If one of you is played with, and he did not make any mention of the word:\" Satan.\"",
      "chain": [
        "30201",
        "30200",
        "20032",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "6500",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو الناقد، حدثنا عبد الله بن إدريس الأودي، حدثنا الأعمش، عن أبي، سفيان عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اهتز عرش الرحمن لموت سعد بن معاذ ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that the Throne of the most Compassionate shook because of the death of Sa'd b. Mu'adh.",
      "chain": [
        "30263",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "6782",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، عن أبي سفيان، عن جابر، عن النبي صلى الله عليه وسلم مثله إلا أن فيه ‏\"‏ زكاة وأجرا ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Apostle (may peace be upon him) a hadith like it but with a slight variation of wording.",
      "chain": [
        "30212",
        "20331",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7218",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا حفص، - يعني ابن غياث - عن الأعمش، عن أبي سفيان، عن جابر، أن رسول الله صلى الله عليه وسلم قدم من سفر فلما كان قرب المدينة هاجت ريح شديدة تكاد أن تدفن الراكب فزعم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بعثت هذه الريح لموت منافق ‏\"‏ ‏.‏ فلما قدم المدينة فإذا منافق عظيم من المنافقين قد مات ‏.‏",
      "text_en": " Jabir reported that Allah's Messenger (may peace be upon him) came back from a journey and as he was near Medina, there was such a violent gale that the mountain seemed to be pressed. Allah's Messenger (may peace be upon him) said:                      This wind has perhaps been made to blow for the death of a hypocrite, and as he reached Medina a notorious hypocrite from amongst the hypocrites had died.",
      "chain": [
        "30216",
        "20317",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7281",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، عثمان حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الشيطان قد أيس أن يعبده المصلون في جزيرة العرب ولكن في التحريش بينهم ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) as saying: Verily, the Satan has lost all hopes that the worshippers would ever worship (him) in the peninsula of Arabia, but he (is hopeful) that he would sow the seed of dissension amongst them.",
      "chain": [
        "30203",
        "30123",
        "30312",
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7283",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، عثمان حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن عرش إبليس على البحر فيبعث سراياه فيفتنون الناس فأعظمهم عنده أعظمهم فتنة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Messenger (way peace be upon him) as saying: The throne of Iblis is upon the ocean and he sends detachments (to different parts) inorder to put people to trial and the most important figure in his eyes is one who is most notorious in sowing the seed of dissension.",
      "chain": [
        "30203",
        "30123",
        "30312",
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7284",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء وإسحاق بن إبراهيم - واللفظ لأبي كريب - قالا أخبرنا أبو معاوية، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبليس يضع عرشه على الماء ثم يبعث سراياه فأدناهم منه منزلة أعظمهم فتنة يجيء أحدهم فيقول فعلت كذا وكذا فيقول ما صنعت شيئا قال ثم يجيء أحدهم فيقول ما تركته حتى فرقت بينه وبين امرأته - قال - فيدنيه منه ويقول نعم أنت ‏\"‏ ‏.‏ قال الأعمش أراه قال ‏\"‏ فيلتزمه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that Allah's Messenger (may peace be upon him) said:                      Iblis places his throne upon water; he then sends detachments (for creating dissension) ; the nearer to him in tank are those who are most notorious in creating dissension. One of them comes and says: I did so and so. And he says: You have done nothing. Then one amongst them comes and says: I did not spare so and so until I sowed the seed of discord between a husband and a wife. The Satan goes near him and says: 'You have done well. A'mash said: He then embraces him.",
      "chain": [
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7296",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، عن أبي سفيان، عن جابر، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir through another chain of transmitters.",
      "chain": [
        "30212",
        "20331",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7331",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لعثمان - قال عثمان حدثنا وقال، إسحاق أخبرنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت  النبي صلى الله عليه وسلم يقول ‏\"‏ إن أهل الجنة يأكلون فيها ويشربون ولا يتفلون ولا يبولون ولا يتغوطون ولا يمتخطون ‏\"‏ ‏.‏ قالوا فما بال الطعام قال ‏\"‏ جشاء ورشح كرشح المسك يلهمون التسبيح والتحميد كما يلهمون النفس ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) as saying that the inmates of Paradise would eat and drink but would neither spit, nor pass water, nor void excrement, nor suffer catarrah. It was said: Then, what would happen with food? Thereupon he said: They would belch and sweat (and it would be over with their food), and their sweat would be that of musk and they would glorify and praise Allah as easily as you breathe.",
      "chain": [
        "30203",
        "30123",
        "30203",
        "30312",
        "4057",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7410",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا يحيى بن زكرياء، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم قبل وفاته بثلاث يقول ‏\"‏ لا يموتن أحدكم إلا وهو يحسن بالله الظن ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) as saying three days before his death: None of you should court death but only hoping good from Allah",
      "chain": [
        "30399",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7413",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، قالا حدثنا جرير، عن الأعمش، عن أبي سفيان، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يبعث كل عبد على ما مات عليه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) as saying. Every servant would be raised (in the same very state) in which he dies.",
      "chain": [
        "30367",
        "30203",
        "20028",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7737",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن أبي معاوية، - واللفظ لأبي كريب - حدثنا أبو معاوية، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال كان عبد الله بن أبى ابن سلول يقول لجارية له اذهبي فابغينا شيئا فأنزل الله عز وجل ‏{‏ ولا تكرهوا فتياتكم على البغاء إن أردن تحصنا لتبتغوا عرض الحياة الدنيا ومن يكرههن فإن الله من بعد إكراههن‏}‏ لهن ‏{‏ غفور رحيم‏}‏",
      "text_en": " Jabir reported that 'Abdullah b. Ubayy b. Salul used to say to his slave-girl:                      Go and fetch something for us by committing prostitution. It was in this connection that Allah, the Exalted and Glorious, revealed this verse:\" And compel not your slave-girls to prostitution when they desire to keep chaste in order to seek the frail goods of this world's life, and whoever compels them, then surely after their compulsion Allah is Forgiving, Merciful\" (xxiv. 33).",
      "chain": [
        "30201",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7738",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "وحدثني أبو كامل الجحدري، حدثنا أبو عوانة، عن الأعمش، عن أبي سفيان، عن جابر، أن جارية، لعبد الله بن أبى ابن سلول يقال لها مسيكة وأخرى يقال لها أميمة فكان يكرههما على الزنى فشكتا ذلك إلى النبي صلى الله عليه وسلم فأنزل الله ‏{‏ ولا تكرهوا فتياتكم على البغاء‏}‏ إلى قوله ‏{‏ غفور رحيم‏}‏",
      "text_en": " Jabir reported that 'Abdullah b. Ubayy b. Salul had two slave-girls; one was called Musaika and the other one was called Umaima and he compelled them to prostitution (for which'Abdullah b. Ubayy b. Salul compelled them). They made a complaint about this to Allah's Messenger (may peace be upon him) and it was upon this that this verse was revealed:                     \" And compel not your slave-girls to prostitute\" up to the words:\" Allah is Forgiving, Merciful.\"",
      "chain": [
        "30559",
        "20469",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، ح حدثنا سليمان بن داود، قالا حدثنا ابن وهب، أخبرني معاوية، عن سعيد بن غزوان، عن أبيه، أنه نزل بتبوك وهو حاج فإذا رجل مقعد فسأله عن أمره فقال له سأحدثك حديثا فلا تحدث به ما سمعت أني حى إن رسول الله صلى الله عليه وسلم نزل بتبوك إلى نخلة فقال ‏\"‏ هذه قبلتنا ‏\"‏ ‏.‏ ثم صلى إليها فأقبلت وأنا غلام أسعى حتى مررت بينه وبينها فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ فما قمت عليها إلى يومي هذا ‏.‏",
      "text_en": " Sa’id b. Ghazwan reported on the authority  of his father that he made his stay at Tabuk(during his journey) for performing Hajj. All of a sudden he saw a crippled man and asked him about his condition. He said:                      I relate to you a tradition, but do not narrate it to anyone so long as I am alive: The Messenger of Allah (ﷺ) encamped at Tabuk near a date-palm and he said:  This is our qiblah (direction for praying). He then offered prayer facing it. I came running, when I was a boy, until I passed the place between him and the tree. He said (cursing): He cut off our prayer, may Allah cut off his walking. I could not, therefore, stand upon them(feet) till today.",
      "chain": [
        "30296",
        "30584",
        "20029",
        "27",
        "116"
      ]
    },
    {
      "hadith_no": "3357",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا حفص بن عمر، حدثنا حماد بن سلمة، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن مسلم بن جبير، عن أبي سفيان، عن عمرو بن حريش، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم أمره أن يجهز جيشا فنفدت الإبل فأمره أن يأخذ في قلاص الصدقة فكان يأخذ البعير بالبعيرين إلى إبل الصدقة ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) commanded him to equip an army, but the camels were insufficient. So he commanded him to keep back the young camels of sadaqah, and he was taking a camel to be replaced by two when the camels of sadaqah came.",
      "chain": [
        "30329",
        "20021",
        "11107",
        "11411",
        "116",
        "29"
      ]
    },
    {
      "hadith_no": "3626",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا حصين، عن أبي سفيان، عن جابر، قال بينما النبي صلى الله عليه وسلم يخطب يوم الجمعة قائما إذ قدمت عير المدينة فابتدرها أصحاب رسول الله صلى الله عليه وسلم حتى لم يبق منهم إلا اثنا عشر رجلا فيهم أبو بكر وعمر ونزلت الآية ‏:‏ ‏(‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ‏)‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jabir said:                     “The Prophet was standing and delivering a Khutbah for us on one Friday, when a caravan arrived in Al-Madinah. So the Companions of the Messenger of Allah rushed off until only twelve men remained. Among them were Abu Bakr and Umar. And This Ayah was revealed: And when they see some merchandise or some amusement, they disperse headlong to it.”",
      "chain": [
        "30242",
        "20468",
        "15097",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "4541",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن منصور، ويعقوب بن إبراهيم، - واللفظ له - عن عبد الرحمن، عن مالك، عن داود بن الحصين، عن أبي سفيان، عن أبي هريرة، أن النبي صلى الله عليه وسلم رخص في العرايا أن تباع بخرصها في خمسة أوسق أو ما دون خمسة أوسق ‏.‏",
      "text_en": " It was narrated from Au Hurairah that the prophet granted a concession allowing estimation for 'Ararya sales, so long as they were five Wasq or less then that",
      "chain": [
        "30313",
        "20184",
        "20033",
        "20001",
        "11160",
        "116",
        "13"
      ]
    },
    {
      "hadith_no": "575",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا إبراهيم بن إسماعيل اليشكري، عن ابن أبي حبيبة، عن داود بن الحصين، عن أبي سفيان، عن أبي هريرة، قال قيل يا رسول الله إنا نريد المسجد فنطأ الطريق النجسة ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأرض يطهر بعضها بعضا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     It was said: \"O Messenger of Allah, we want to come to the mosque, but the path that we walk upon is impure.\" The Messenger of Allah said: \"Some parts of the earth purify others.\"",
      "chain": [
        "30216",
        "26500",
        "11160",
        "116",
        "13"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا حفص بن غياث، عن الأعمش، عن أبي صالح، عن أبي هريرة، وعن أبي سفيان، عن جابر، قالا جاء سليك الغطفاني ورسول الله  صلى الله عليه وسلم  يخطب فقال له النبي  صلى الله عليه وسلم  ‏\"‏ أصليت ركعتين قبل أن تجيء ‏\"‏ قال لا ‏.‏ قال ‏\"‏ فصل ركعتين وتجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “Sulaik Al-Ghatafani came while theMessenger of Allah (ﷺ) was delivering the sermon. The Prophet (ﷺ)said to him: ‘Did you perform two Rak’ah before you came?’ Hesaid:‘No.’ He said: ‘Then perform two Rak’ah, but make thembrief.’”",
      "chain": [
        "30248",
        "20317",
        "11060",
        "11161",
        "13",
        "116",
        "34"
      ]
    }
  ],
  "total_hadiths": 51
}