{
  "id": "11600",
  "name": "'Uthman bin Ghyath عثمان بن غياث",
  "full_name": "'Uthman bin Ghyath عثمان بن غياث",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [1st Generation]",
        "ar": "تابعي [الجيل الأول]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی یەكەم]"
      }
    },
    {
      "id": "11271",
      "name": "Jabir bin Zayd al-Azdi جابر بن زيد الأزدي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10922",
      "name": "Durayb bin Nufayr, Abu al-Salayl al-Qays ضريب بن نقير أبو السليل القيسي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20273",
      "name": "Quraysh bin Anas al-Ansari قريش بن أنس الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1597",
      "hadith_no": "1597",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال أبو كامل فضيل بن حسين البصري حدثنا أبو معشر، حدثنا عثمان بن غياث، عن عكرمة، عن ابن عباس  رضى الله عنهما  أنه سئل عن متعة الحج، فقال أهل المهاجرون والأنصار وأزواج النبي صلى الله عليه وسلم في حجة الوداع وأهللنا، فلما قدمنا مكة قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا إهلالكم بالحج عمرة إلا من قلد الهدى ‏\"‏‏.‏ فطفنا بالبيت وبالصفا والمروة وأتينا النساء، ولبسنا الثياب وقال ‏\"‏ من قلد الهدى فإنه لا يحل له حتى يبلغ الهدى محله ‏\"‏‏.‏ ثم أمرنا عشية التروية أن نهل بالحج، فإذا فرغنا من المناسك جئنا فطفنا بالبيت وبالصفا والمروة فقد تم حجنا، وعلينا الهدى كما قال الله تعالى ‏{‏فما استيسر من الهدى فمن لم يجد فصيام ثلاثة أيام في الحج وسبعة إذا رجعتم‏}‏ إلى أمصاركم‏.‏ الشاة تجزي، فجمعوا نسكين في عام بين الحج والعمرة، فإن الله تعالى أنزله في كتابه وسنه نبيه صلى الله عليه وسلم وأباحه للناس غير أهل مكة، قال الله ‏{‏ذلك لمن لم يكن أهله حاضري المسجد الحرام‏}‏ وأشهر الحج التي ذكر الله تعالى شوال وذو القعدة وذو الحجة، فمن تمتع في هذه الأشهر فعليه دم أو صوم، والرفث الجماع، والفسوق المعاصي، والجدال المراء‏.‏",
      "text_en": " Ibn 'Abbas said that he has been asked regarding Hajj-at-Tamattu' on which he said, \"The Muhajirin and the Ansar and the wives of the Prophet () and we did the same. When we reached Makkah, Allah's Messenger () said, \"Give up your intention of doing the Hajj (at this moment) and perform 'Umra, except the one who had garlanded the Hady.\" So, we performed Tawaf round the Ka'bah and [Sa'y] between As-safa and Al-MArwa, slept with our wives and wore ordinary (stitched) clothes. The Prophet () added, \"Whoever has garlanded his Hady is not allowed to finish the Ihram till the Hady has reached its destination (has been sacrificed)\". Then on the night of Tarwiya (8th Dhul Hijjah, in the afternoon) he ordered us to assume Ihram for Hajj and when we have performed all the ceremonies of Hajj, we came and performed Tawaf round the Ka'bah and (Sa'y) between As-Safa and Al-Marwa, and then our Hajj was complete, and we had to sacrifice a Hady according to the statement of Allah:                      \"... He must slaughter a Hady such as he can afford, but if he cannot afford it, he should observer Saum (fasts) three days during the Hajj and seven days after his return (to his home)….\" (V. 2:196).And the sacrifice of the sheep is sufficient. So, the Prophet (saw) and his Companions honied the two religious deeds, (i.e. Hajj and 'Umra) in one year, for Allah revealed (the permissibility) of such practice in His book and in the Sunna (legal ways) of His Prophet () and rendered it permissible for all the people except those living in Makkah. Allah says: \"This is for him whose family is not present at the Al-Masjid-Al-Haram, (i.e. non resident of Makkah).\" The months of Hajj which Allah mentioned in His book are: Shawwal, Dhul-Qa'da and Dhul-Hijjah. Whoever performed Hajj-at-Tamattu' in those months, then slaughtering or fasting is compulsory for him.The words: 1. Ar-Rafatha means sexual intercourse. 2. Al-Fasuq means all kinds of sin, and 3. Al-Jidal means to dispute.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "10765",
        "11600",
        "11023",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3739",
      "hadith_no": "3739",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، قال حدثني عثمان بن غياث، حدثنا أبو عثمان النهدي، عن أبي موسى  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في حائط من حيطان المدينة، فجاء رجل فاستفتح، فقال النبي صلى الله عليه وسلم ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ ففتحت له، فإذا أبو بكر، فبشرته بما قال النبي صلى الله عليه وسلم فحمد الله، ثم جاء رجل فاستفتح، فقال النبي صلى الله عليه وسلم ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ ففتحت له، فإذا هو عمر، فأخبرته بما قال النبي صلى الله عليه وسلم فحمد الله، ثم استفتح رجل، فقال لي ‏\"‏ افتح له وبشره بالجنة على بلوى تصيبه ‏\"‏‏.‏ فإذا عثمان، فأخبرته بما قال رسول الله صلى الله عليه وسلم فحمد الله ثم قال الله المستعان‏.‏",
      "text_en": " Narrated Abu Musa:                     While I was with the Prophet in one of the gardens of Medina, a man came and asked me to open the gate. The Prophet said to me, \"Open the gate for him and give him the glad tidings that he will enter Paradise.\" I opened (the gate) for him, and behold! It was Abu Bakr. I informed him of the glad tidings the Prophet had said, and he praised Allah. Then another man came and asked me to open the gate. The Prophet said to me \"Open (the gate) and give him the glad tidings of entering Paradise.\" I opened (the gate) for him, and behold! It was `Umar. I informed him of what the Prophet had said, and he praised Allah. Then another man came and asked me to open the gate. The Prophet said to me. \"Open (the gate) for him and inform him of the glad tidings, of entering Paradise with a calamity which will befall him. \" Behold ! It was `Uthman, I informed him of what Allah's Apostle had said. He praised Allah and said, \"I seek Allah's Aid.\"",
      "usc_msa_ref": "42",
      "chain": [
        "30224",
        "20318",
        "11600",
        "11113",
        "41"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6287",
      "hadith_no": "6287",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عثمان بن غياث، حدثنا أبو عثمان، عن أبي موسى، أنه كان مع النبي صلى الله عليه وسلم في حائط من حيطان المدينة، وفي يد النبي صلى الله عليه وسلم عود يضرب به بين الماء والطين، فجاء رجل يستفتح، فقال النبي صلى الله عليه وسلم ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ فذهبت فإذا أبو بكر، ففتحت له وبشرته بالجنة، ثم استفتح رجل آخر فقال ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ فإذا عمر، ففتحت له وبشرته بالجنة، ثم استفتح رجل آخر، وكان متكئا فجلس فقال ‏\"‏ افتح ‏{‏له‏}‏ وبشره بالجنة، على بلوى تصيبه أو تكون ‏\"‏‏.‏ فذهبت فإذا عثمان، ففتحت له، وبشرته بالجنة، فأخبرته بالذي قال‏.‏ قال الله المستعان‏.‏",
      "text_en": " Narrated Abu Musa:                     That he was in the company of the Prophet in one of the gardens of Medina and in the hand of the Prophet there was a stick, and he was striking (slowly) the water and the mud with it. A man came (at the gate of the garden) and asked permission to enter. The Prophet said, \"Open the gate for him and give him the glad tidings of entering Paradise. \"I went, and behold! It was Abu Bakr. So I opened the gate for him and informed him of the glad tidings of entering Paradise. Then another man came and asked permission to enter. The Prophet said, \"Open the gate for him and give him the glad tidings of entering Paradise.\" Behold! It was `Umar. So I opened the gate for him and gave him the glad tidings of entering Paradise. Then another man came and asked permission to enter. The Prophet was sitting in a leaning posture, so he sat up and said, \"Open the gate for him and give him the glad tidings of entering Paradise with a calamity which will befall him or which will take place.\" I went, and behold ! It was `Uthman. So I opened the gate for him and gave him the glad tidings of entering Paradise and also informed him of what the Prophet had said (about a calamity). `Uthman said, \"Allah Alone Whose Help I seek (against that calamity).",
      "usc_msa_ref": "235",
      "chain": [
        "30175",
        "20031",
        "11600",
        "11113",
        "41"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-104",
      "hadith_no": "104",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، حدثنا عثمان بن غياث، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، وحميد بن عبد الرحمن، قالا لقينا عبد الله بن عمر فذكرنا القدر وما يقولون فيه ‏.‏ فاقتص الحديث كنحو حديثهم عن عمر - رضى الله عنه - عن النبي صلى الله عليه وسلم وفيه شىء من زيادة وقد نقص منه شيئا ‏.‏",
      "text_en": " It is narrated on the authority of Yahya b. Ya'mur and Humaid b. 'Abdur-Rahman that they said:                      We met Abdullah b. 'Umar and we discussed about the Divine Decree, and what they talked about it and he narrated the hadith that has been transmitted by 'Umar (may Allah be pleased with him) from the Apostle (may peace be upon him). There is a slight variation in that.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20031",
        "11600",
        "11432",
        "11316",
        "10561",
        "3"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6365",
      "hadith_no": "6365",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا ابن أبي عدي، عن عثمان بن غياث، عن  أبي عثمان النهدي، عن أبي موسى الأشعري، قال بينما رسول الله صلى الله عليه وسلم في حائط من حائط المدينة وهو متكئ يركز بعود معه بين الماء والطين إذا استفتح رجل فقال ‏\"‏ افتح وبشره بالجنة ‏\"‏ ‏.‏ قال فإذا أبو بكر ففتحت له وبشرته بالجنة - قال - ثم استفتح رجل آخر فقال ‏\"‏ افتح وبشره بالجنة ‏\"‏ ‏.‏ قال فذهبت فإذا هو عمر ففتحت له وبشرته بالجنة ثم استفتح رجل آخر - قال - فجلس النبي صلى الله عليه وسلم فقال ‏\"‏ افتح وبشره بالجنة على بلوى تكون ‏\"‏ ‏.‏ قال فذهبت فإذا هو عثمان بن عفان - قال - ففتحت وبشرته بالجنة - قال - وقلت الذي قال فقال اللهم صبرا أو الله المستعان ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported that while Allah's Messenger (may peace be upon him) was in one of the gardens of Medina, reclining against a pillow and fixing a stick in a mud, that a person came asking for the gate to be opened, whereupon he said:                      Open it for him and give him glad tidings of Paradise and, lo, it was Abu Bakr. I opened (the gate) for him and gave him the glad tidings of Paradise. Then another person asked for the door to be opened, whereupon he said: Open it and give him the glad tidings of Piradise. He said: I went away and, lo, it was 'Umar. I opened it for him and gave him the glad tidings of Paradise. Then still another man asked for the door to be opened, and thereupon Allah's Apostle (may peace be upon him) said: Open it and give him the glad tidings of Paradise after a trial would afflict him. I went and, lo, it was 'Uthman b. 'Affan. 1 opened the door and gave him the glad tidings of Paradise and informed him (what the Holy Prophet had said). Thereupon he said: O Allah, grant me steadfastness. Allah is one Whose help is to be sought.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "11600",
        "11113",
        "41"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7043",
      "hadith_no": "7043",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، حدثنا عثمان، - وهو ابن غياث - حدثنا أبو عثمان، عن أبي موسى الأشعري، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا أدلك على كلمة من كنوز الجنة - أو قال - على كنز من كنوز الجنة ‏\"‏ ‏.‏ فقلت بلى ‏.‏ فقال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that Allah's Messenger (may peace be upon him) said to him:                      Should I not direct you to the words from the treasures of Paradise, or he said: Like a treasure from the treasures of Paradise? I said: Of course, do that. Thereupon he said:\" There is no might and no power but that of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20291",
        "11600",
        "11113",
        "41"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-4696",
      "hadith_no": "4696",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عثمان بن غياث، قال حدثني عبد الله بن بريدة، عن يحيى بن يعمر، وحميد بن عبد الرحمن، قال لقينا عبد الله بن عمر فذكرنا له القدر وما يقولون فيه فذكر نحوه زاد قال وسأله رجل من مزينة أو جهينة فقال يا رسول الله فيما نعمل أفي شىء قد خلا أو مضى أو شىء يستأنف الآن قال ‏\"‏ في شىء قد خلا ومضى ‏\"‏ ‏.‏ فقال الرجل أو بعض القوم ففيم العمل قال ‏\"‏ إن أهل الجنة ييسرون لعمل أهل الجنة وإن أهل النار ييسرون لعمل أهل النار ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Yahya b. Yamur and Humaid b. ‘Abd al-Rahman through a different chain of narrators. This version has :                      we met ‘Abd Allah b. ‘Umar. We told him about divine decree and what they said about it. He then mentioned something similar to it. He added : A man of Muzainah or juhainah asked : What is the good in doing anything, Messenger of Allah ? should we think that a thing has passed and gone or a thing that has happened now (without predestination)? He replied : About a thing that has passed and gone (i.e. predestined). A man or some people asked: Then, why action? He replied: Those who are among the number of those who go to Paradise will be helped to do the deeds of the people who will go to Paradise, and those who are among the number of those who go to Hell will be helped to do the deeds of those who will go to Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11600",
        "11432",
        "11316",
        "10561"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-908",
      "hadith_no": "908",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا عثمان بن غياث، قال أخبرني أبو نعامة الحنفي، قال حدثنا ابن عبد الله بن مغفل، قال كان عبد الله بن مغفل إذا سمع أحدنا، يقرأ ‏{‏ بسم الله الرحمن الرحيم ‏}‏ يقول صليت خلف رسول الله صلى الله عليه وسلم وخلف أبي بكر وخلف عمر رضى الله عنهما فما سمعت أحدا منهم قرأ بسم الله الرحمن الرحيم ‏.‏",
      "text_en": " Ibn Abdullah bin Mughaffal said:                     \"If Abdullah bin Mughaffal heard any one of us recite: 'In the Name of Allah, the Most Gracious, the Most Merciful', he would say: 'I prayed behind the Messenger of Allah (ﷺ) and behind Abu Bakr and behind Umar-may Allah be pleased with them both- and I did not hear any of them recite: 'In the Name of Allah, the Most Gracious, the Most Merciful.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11600"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 8,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}