{
  "id": "11601",
  "name": "'Ata'a bin Abi Maymuna عطاء بن أبي ميمونة",
  "full_name": "'Ata'a bin Abi Maymuna عطاء بن أبي ميمونة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "131",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "24008",
      "name": "Ibrahim bin Ata'a bin Abi Maymuna إبراهيم بن عطاء بن أبي ميمونة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11226",
      "name": "Abu Rafi' al-Sa'agh نفيع بن رافع أبو رافع الصائغ",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "24008",
      "name": "Ibrahim bin Ata'a bin Abi Maymuna إبراهيم بن عطاء بن أبي ميمونة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24229",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11586",
      "name": "Rwh bin al-Qasim al-Tmymy روح بن القاسم التميمي العنبري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "150",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا شعبة، عن أبي معاذ  واسمه عطاء بن أبي ميمونة  قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم إذا خرج لحاجته أجيء أنا وغلام معنا إداوة من ماء‏.‏ يعني يستنجي به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy used to accompany him with a tumbler full of water. (Hisham commented, \"So that he might wash his private parts with it.)\"",
      "chain": [
        "20296",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي معاذ  هو عطاء بن أبي ميمونة  قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم إذا خرج لحاجته تبعته أنا وغلام منا معنا إداوة من ماء‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy from us used to go behind him with a tumbler full of water.",
      "chain": [
        "20193",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عطاء بن أبي ميمونة، سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يدخل الخلاء، فأحمل أنا وغلام إداوة من ماء، وعنزة، يستنجي بالماء‏.‏ تابعه النضر وشاذان عن شعبة‏.‏ العنزة عصا عليه زج‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy used to carry a tumbler full of water (for cleaning the private parts) and a short spear (or stick).",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل بن إبراهيم، قال حدثني روح بن القاسم، قال حدثني عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا تبرز لحاجته أتيته بماء فيغسل به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet went to answer the call of nature, I used to bring water with which he used to clean his private parts.",
      "chain": [
        "20184",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، قال حدثنا شاذان، عن شعبة، عن عطاء بن أبي ميمونة، قال سمعت أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا خرج لحاجته تبعته أنا وغلام ومعنا عكازة أو عصا أو عنزة ومعنا إداوة، فإذا فرغ من حاجته ناولناه الإداوة‏.‏",
      "text_en": " Narrated Anas Ibn Malik:                     Whenever the Prophet went for answering the call of nature, I and another boy used to go after him with a staff, a stick or a short spear (or stick) and a tumbler of water and when he finished from answering the call of nature we would hand that tumbler of water to him.",
      "chain": [
        "30163",
        "20380",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "6263",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا محمد بن جعفر، عن شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، عن أبي هريرة، أن زينب، كان اسمها برة، فقيل تزكي نفسها‏.‏ فسماها رسول الله صلى الله عليه وسلم زينب‏.‏",
      "text_en": " Narrated Abu Huraira:                     Zainab's original name was \"Barrah,\" but it was said' \"By that she is giving herself the prestige of piety.\" So the Prophet changed her name to Zainab.",
      "chain": [
        "30343",
        "20173",
        "20020",
        "11601",
        "479",
        "13",
        "57"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن خالد، عن عطاء بن أبي ميمونة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم دخل حائطا وتبعه غلام معه ميضأة هو أصغرنا فوضعها عند سدرة فقضى رسول الله صلى الله عليه وسلم حاجته فخرج علينا وقد استنجى بالماء ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) entered an enclosure while a servant was following him with a jar of water and he was the youngest amongst us and he placed it by the side of a lote-tree. When the Messenger of Allah, (may peace be upon him) relieved himself, he came out and had cleansed himself with water.",
      "chain": [
        "30399",
        "20423",
        "11282",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وغندر، عن شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، أنه سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يدخل الخلاء فأحمل أنا وغلام نحوي إداوة من ماء وعنزة فيستنجي بالماء ‏.‏",
      "text_en": " Anas b. Malik reported:                      When the Messenger of Allah (may peace be upon him) entered the privy, a servant and I used to carry a skin of water, and a pointed staff, and he would cleanse himself with water.",
      "chain": [
        "30201",
        "20032",
        "20278",
        "20020",
        "30170",
        "20173",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني زهير بن حرب، وأبو كريب - واللفظ لزهير - حدثنا إسماعيل، - يعني ابن علية - حدثني روح بن القاسم، عن عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يتبرز لحاجته فآتيه بالماء فيتغسل به ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) went to a far-off place in the desert (hidden from the sight of human beings) for relieving himself. Then I brought water for him and he cleansed himself.",
      "chain": [
        "30022",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "1334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، قال رأيت أبا هريرة يسجد في ‏{‏ إذا السماء انشقت‏}‏ فقلت تسجد فيها فقال نعم رأيت خليلي صلى الله عليه وسلم يسجد فيها فلا أزال أسجد فيها حتى ألقاه ‏.‏ قال شعبة قلت النبي صلى الله عليه وسلم ‏.‏ قال نعم ‏.‏",
      "text_en": " Abu Rafi' reported:                      I saw Abu Huraira performing prostration (while reciting this verse: )\" When the heaven burst asunder.\" I said to him: Do you prostrate yourself (while reciting) i? He said: Yes, I saw my best Friend (may peace be upon him) prostrating himself on (the recital of this verse) and I shall continue prostrating till I meet him. Shu'ba asked: Do you mean (by Friend) the Apostle of Allah (may peace be upon him)? He said: Yes.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11601",
        "479"
      ]
    },
    {
      "hadith_no": "5730",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، قالوا حدثنا  محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، سمعت أبا رافع، يحدث عن أبي، هريرة ح  وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، عن أبي هريرة، أن زينب، كان اسمها برة فقيل تزكي نفسها ‏.‏ فسماها رسول الله صلى الله عليه وسلم زينب ‏.‏ ولفظ الحديث لهؤلاء دون ابن بشار ‏.‏ وقال ابن أبي شيبة حدثنا محمد بن جعفر عن شعبة ‏.‏",
      "text_en": " Abu Huraira reported that the name of Zainab was Barra. It was said of her:                      She presents herself to be innocent. Allah's Messenger (may peace be upon him) gave her the name of Zainab.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11601",
        "13",
        "30150",
        "20286",
        "20020",
        "11601",
        "479",
        "13",
        "57"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، - يعني الواسطي - عن خالد، - يعني الحذاء - عن عطاء بن أبي ميمونة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم دخل حائطا ومعه غلام معه ميضأة وهو أصغرنا فوضعها عند السدرة فقضى حاجته فخرج علينا وقد استنجى بالماء ‏.‏",
      "text_en": " Narrated Anas b. Malik :                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) entered a park. He was accompanied by a boy who had a jug of water with him. He was the youngest of us. He placed it near the lote-tree. He ( the Prophet, sal Allaahu alayhi wa sallam ) relieved himself. He came to us after he had cleansed himself with water.",
      "chain": [
        "30569",
        "20423",
        "11282",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "4497",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الله بن بكر بن عبد الله المزني، عن عطاء بن أبي ميمونة، عن أنس بن مالك، قال ما رأيت النبي صلى الله عليه وسلم رفع إليه شىء فيه قصاص إلا أمر فيه بالعفو ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I never saw the Messenger of Allah (ﷺ) that some dispute which involved retaliation was brought to him but he commanded regarding it for remission.",
      "chain": [
        "20040",
        "24229",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال أنبأنا شعبة، عن عطاء بن أبي ميمونة، قال سمعت أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم إذا دخل الخلاء أحمل أنا وغلام معي نحوي إداوة من ماء فيستنجي بالماء ‏.‏",
      "text_en": " Anas bin Malik said:                      \"When the Messenger of Allah (ﷺ) would go to the toilet, I and another boy like me would bring a small leather vessel of water and he would clean himself with water.\"",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "4783",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرحمن، قال حدثنا عبد الله، - وهو ابن بكر بن عبد الله المزني - عن عطاء بن أبي ميمونة، عن أنس، قال أتي رسول الله صلى الله عليه وسلم في قصاص فأمر فيه بالعفو ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"A case requiring Qisas was brought to the Messenger of Allah and he enjoined them to pardon.\"",
      "chain": [
        "30123",
        "20033",
        "24229",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "4784",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، وبهز بن أسد، وعفان بن مسلم، قالوا حدثنا عبد الله بن بكر المزني، قال حدثنا عطاء بن أبي ميمونة، ولا أعلمه إلا عن أنس بن مالك، قال ما أتي النبي صلى الله عليه وسلم في شىء فيه قصاص إلا أمر فيه بالعفو ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"No case requiring Qisas was ever brought to the Messenger of Allah but he would enjoin pardoning.\"",
      "chain": [
        "30160",
        "20033",
        "20214",
        "30106",
        "24229",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "2795",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا حبان بن هلال، حدثنا عبد الله بن بكر المزني، عن عطاء بن أبي ميمونة، قال لا أعلمه إلا عن أنس بن مالك، قال ما رفع إلى رسول الله صلى الله عليه وسلم شىء فيه القصاص إلا أمر فيه بالعفو ‏.‏",
      "text_en": " It was narrated that 'Ata bin Abu Maimunah said:                     “I only know it from Anas bin Malik who said: 'No case involving retaliation was referred to the Messenger of Allah (ﷺ) but he enjoined forgiveness.”",
      "chain": [
        "30313",
        "20218",
        "24229",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "3732",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا غندر، عن شعبة، عن عطاء بن أبي ميمونة، قال سمعت أبا رافع، يحدث عن أبي هريرة، أن زينب، كان اسمها برة فقيل لها تزكي نفسها فسماها رسول الله  صلى الله عليه وسلم  زينب ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     \"Zainab used to be called \"Barrah\" (good), and it was said that she was praising herself. So the Messenger of Allah(ﷺ) changed her name to Zainab.\"",
      "chain": [
        "20436",
        "20278",
        "20020",
        "11601",
        "13",
        "57"
      ]
    }
  ],
  "total_hadiths": 18
}