{
  "id": "11609",
  "name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
  "full_name": "Qays bin 'Aabad al-Qaysi قيس بن عباد القيسي الضبعي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  صحابة ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Qaysi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3860",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر السمان، عن ابن عون، عن محمد، عن قيس بن عباد، قال كنت جالسا في مسجد المدينة، فدخل رجل على وجهه أثر الخشوع، فقالوا هذا رجل من أهل الجنة‏.‏ فصلى ركعتين تجوز فيهما ثم خرج، وتبعته فقلت إنك حين دخلت المسجد قالوا هذا رجل من أهل الجنة‏.‏ قال والله ما ينبغي لأحد أن يقول ما لا يعلم وسأحدثك لم ذاك رأيت رؤيا على عهد النبي صلى الله عليه وسلم فقصصتها عليه، ورأيت كأني في روضة  ذكر من سعتها وخضرتها  وسطها عمود من حديد، أسفله في الأرض وأعلاه في السماء، في أعلاه عروة فقيل له ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني منصف فرفع ثيابي من خلفي، فرقيت حتى كنت في أعلاها، فأخذت بالعروة، فقيل له استمسك‏.‏ فاستيقظت وإنها لفي يدي، فقصصتها على النبي صلى الله عليه وسلم قال ‏\"‏ تلك الروضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، فأنت على الإسلام حتى تموت ‏\"‏‏.‏ وذاك الرجل عبد الله بن سلام‏.‏ وقال لي خليفة حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن ابن سلام، قال وصيف مكان منصف‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     While I was sitting in the Mosque of Medina, there entered a man (Abdullah bin Salam) with signs of solemnity over his face. The people said, \"He is one of the people of Paradise.\" He prayed two light rak`at and then left. I followed him and said, \"When you entered the Mosque, the people said, 'He is one of the people of Paradise.' \" He said, \"By Allah, one ought not say what he does not know; and I will tell you why. In the lifetime of the Prophet I had a dream which I narrated to him. I saw as if I were in a garden.\" He then described its extension and greenery. He added: In its center there was an iron pillar whose lower end was fixed in the earth and the upper end was in the sky, and at its upper end there was a (ring-shaped) hand-hold. I was told to climb it. I said, \"I can't.\" \"Then a servant came to me and lifted my clothes from behind and I climbed till I reached the top (of the pillar). Then I got hold of the hand-hold, and I was told to hold it tightly, then I woke up and (the effect of) the handhold was in my hand. I narrated al I that to the Prophet who said, 'The garden is Islam, and the handhold is the Most Truth-worthy Hand-Hold. So you will remain as a Muslim till you die.\" The narrator added: \"The man was `Abdullah bin Salam.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله الرقاشي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  أنه قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ وقال قيس بن عباد وفيهم أنزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين تبارزوا يوم بدر حمزة وعلي وعبيدة أو أبو عبيدة بن الحارث وشيبة بن ربيعة وعتبة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Mijlaz:                     From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), the Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also said, \"The following Verse was revealed in their connection:-- \"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) Qais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu 'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4015",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  قال نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ في ستة من قريش علي وحمزة وعبيدة بن الحارث وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Dhar:                     The following Holy Verse:-- \"These two opponents (believers & disbelievers) dispute with each other about their Lord,\" (22.19) was revealed concerning six men from Quraish, namely, `Ali, Hamza, 'Ubaida bin Al-Harith; Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20351",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4016",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم الصواف، حدثنا يوسف بن يعقوب  كان ينزل في بني ضبيعة وهو مولى لبني سدوس  حدثنا سليمان التيمي، عن أبي مجلز، عن قيس بن عباد، قال قال علي  رضى الله عنه فينا نزلت هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏",
      "text_en": " Narrated `Ali:                     The following Holy Verse:-- \"These two opponents (believers and disbelievers) dispute with each other about their Lord.\" (22.19) was revealed concerning us.",
      "chain": [
        "30123",
        "20305",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4017",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن جعفر، أخبرنا وكيع، عن سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، سمعت أبا ذر  رضى الله عنه  يقسم لنزلت هؤلاء الآيات في هؤلاء الرهط الستة يوم بدر‏.‏ نحوه‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     I heard Abu Dhar swearing that these Holy Verses were revealed in connection with those six persons on the day of Badr.",
      "chain": [
        "30397",
        "20032",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4790",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  أنه كان يقسم فيها إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم‏}‏ نزلت في حمزة وصاحبيه، وعتبة وصاحبيه يوم برزوا في يوم بدر رواه سفيان عن أبي هاشم‏.‏ وقال عثمان عن جرير عن منصور عن أبي هاشم عن أبي مجلز قوله‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     Abu Dharr used to take an oath confirming that the Verse: 'These two opponents (believers, and disbelievers) dispute with each other about their Lord.' (22.19) was Revealed in connection with Hamza and his two companions and `Utbah and his two companions on the day when they ease out of the battle of Badr.",
      "chain": [
        "20219",
        "20468",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "7096",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا حرمي بن عمارة، حدثنا قرة بن خالد، عن محمد بن سيرين، قال قال قيس بن عباد كنت في حلقة فيها سعد بن مالك وابن عمر فمر عبد الله بن سلام فقالوا هذا رجل من أهل الجنة‏.‏ فقلت له إنهم قالوا كذا وكذا‏.‏ قال سبحان الله ما كان ينبغي لهم أن يقولوا ما ليس لهم به علم، إنما رأيت كأنما عمود وضع في روضة خضراء، فنصب فيها وفي رأسها عروة وفي أسفلها منصف  والمنصف الوصيف  فقيل ارقه‏.‏ فرقيت حتى أخذت بالعروة‏.‏ فقصصتها على رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يموت عبد الله وهو آخذ بالعروة الوثقى ‏\"‏‏.‏",
      "text_en": " Narrated Qais bin 'Ubada:                     I was sitting in a gathering in which there was Sa`d bin Malik and Ibn `Umar. `Abdullah bin Salam passed in front of them and they said, \"This man is from the people of Paradise.\" I said to `Abdullah bin Salam, \"They said so-and-so.\" He replied, \"Subhan Allah! They ought not to have said things of which they have no knowledge, but I saw (in a dream) that a post was fixed in a green garden. At the top of the post there was a handhold and below it there was a servant. I was asked to climb (the post). So I climbed it till I got hold of the handhold.\" Then I narrated this dream to Allah's Apostle. Allah's Apostle said, \"`Abdullah will die while still holding the firm reliable handhold (i.e., Islam).",
      "chain": [
        "30351",
        "20221",
        "11301",
        "11035",
        "11609"
      ]
    },
    {
      "hadith_no": "7100",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر، عن ابن عون، ح وحدثني خليفة، حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن عبد الله بن سلام، قال رأيت كأني في روضة، وسط الروضة عمود في أعلى العمود عروة، فقيل لي ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني وصيف فرفع ثيابي فرقيت، فاستمسكت بالعروة، فانتبهت وأنا مستمسك بها، فقصصتها على النبي صلى الله عليه وسلم فقال ‏\"‏ تلك الروضة روضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، لا تزال مستمسكا بالإسلام حتى تموت ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Salam:                     (In a dream) I saw myself in a garden, and there was a pillar in the middle of the garden, and there was a handhold at the top of the pillar. I was asked to climb it. I said, \"I cannot.\" Then a servant came and lifted up my clothes and I climbed (the pillar), and then got hold of the handhold, and I woke up while still holding it. I narrated that to the Prophet who said, \"The garden symbolizes the garden of Islam, and the handhold is the firm Islamic handhold which indicates that you will be adhering firmly to Islam until you die.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "30132",
        "32",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "6536",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا معاذ بن معاذ، حدثنا عبد الله بن عون، عن محمد بن سيرين، عن قيس بن عباد، قال كنت بالمدينة في ناس فيهم بعض أصحاب النبي صلى الله عليه وسلم فجاء رجل في وجهه أثر من خشوع فقال بعض القوم هذا رجل من أهل الجنة هذا رجل من أهل الجنة ‏.‏ فصلى ركعتين يتجوز فيهما ثم خرج فاتبعته فدخل منزله ودخلت فتحدثنا فلما استأنس قلت له إنك لما دخلت قبل قال رجل كذا وكذا قال سبحان الله ما ينبغي لأحد أن يقول ما لا يعلم وسأحدثك لم ذاك رأيت رؤيا على عهد رسول الله صلى الله عليه وسلم فقصصتها عليه رأيتني في روضة - ذكر سعتها وعشبها وخضرتها - ووسط الروضة عمود من حديد أسفله في الأرض وأعلاه في السماء في أعلاه عروة ‏.‏ فقيل لي ارقه ‏.‏ فقلت له لا أستطيع ‏.‏ فجاءني منصف - قال ابن عون والمنصف الخادم - فقال بثيابي من خلفي - وصف أنه رفعه من خلفه بيده - فرقيت حتى كنت في أعلى العمود فأخذت بالعروة فقيل لي استمسك ‏.‏ فلقد استيقظت وإنها لفي يدي فقصصتها على النبي صلى الله عليه وسلم فقال ‏\"‏ تلك الروضة الإسلام وذلك العمود عمود الإسلام وتلك العروة عروة الوثقى وأنت على الإسلام حتى تموت ‏\"‏ ‏.‏ قال والرجل عبد الله بن سلام ‏.‏",
      "text_en": " Qais b. 'Ubada reported:                      I was in the company of some persons, amongst whom some were the Companions of Allah's Apostle (may peace be upon him) in Medina, that there came a person whose face depicted the fear (of Allah). Some people said: He is a person from amongst the people of Paradise; he is a person from amongst the people of Paradise. He observed two short rak'ahs of prayer and then went out. I followed him and he got into his house and I also got in and we began to converse with each other. And when he became familiar (with me) I said to Him: When you entered (the mosque) before (your entrance in the house) a person said so and so (that you are amongst the people of Paradise), whereupon he said: It is not meet for anyone to say anything which he does not know. I shall (now) tell you why they (say) this. I saw a dream during the lifetime of Allah's Messenger (may peace be upon him) and narrated it to him. I seemed to be in a garden [he described its vastness, its rich fructification and its verdure]; in the midst of it, there stood an iron pillar, with its base in the earth and its summit in the sky: and upon its summit there was a handhold. It was said to me: Climb up this (pillar). I said to him (visitant in the dream): I am unable to do it. Thereupon a helper came to me, and he (supported) me (by catching hold of my) garment from behind and thus helped me with his hand and so I climbed up till I was at the summit of the pillar, and grasped the handhold. It was said to me: Ho d it tightly. It was at this that I woke up when (the handhold) was in fthe grip) of my hand. I narrated it (the dream) to Allah's Apostle (may peace be upon him), whereupon he said: That garden implies al-Islam and that pillar implies the pillar of Islam. And that handhold is the firmest faith (as refered to in the Qur'an). And you will remain attached to Islam until you shall die. And that man was 'Abdullah b. Salim.",
      "chain": [
        "30170",
        "20286",
        "11071",
        "11035",
        "11609"
      ]
    },
    {
      "hadith_no": "6537",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا حرمي بن عمارة، حدثنا قرة بن خالد، عن محمد بن سيرين، قال قال قيس بن عباد كنت في حلقة فيها سعد بن مالك وابن عمر فمر عبد الله بن سلام فقالوا هذا رجل من أهل الجنة ‏.‏ فقمت فقلت له إنهم قالوا كذا وكذا ‏.‏ قال سبحان الله ما كان ينبغي لهم أن يقولوا ما ليس لهم به علم إنما رأيت كأن عمودا وضع في روضة خضراء فنصب فيها وفي رأسها عروة وفي أسفلها منصف - والمنصف الوصيف - فقيل لي ارقه ‏.‏ فرقيت حتى أخذت بالعروة فقصصتها على رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يموت عبد الله وهو آخذ بالعروة الوثقى ‏\"‏ ‏.‏",
      "text_en": " Qais b. 'Ubaida reported:                      I was (sitting) in a company in which there were (besides others) Sa'd b. Malik and Ibn 'Umar that 'Abdullah b. Saliim happened to pass (by that side). They (the people sitting in that company) said: He is a person from amongst the dwellers of Paradise. I stood up and said to him: They say such and such (thing about you), whereupon he said: Hallowed be Allah, it is not meet for them to say (anything) of which They have no knowledge. Verily I saw as if a pillar had been raised in a green garden and there had been fixed at its (upper) end a handhold and there was a helper at its base. It was said to me: Climb up. So I climbed up and caught hold of the haildhold. I narrated (the contents of this dream) to Allah's Messenger (may peace be upon him), whereupon he said: 'Abdullah would die in a state that he would be catching hold of the firmest handhold (he would die holding fast to the faith).",
      "chain": [
        "30452",
        "20221",
        "11301",
        "11035",
        "11609"
      ]
    },
    {
      "hadith_no": "7213",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن قتادة، عن أبي نضرة، عن قيس بن عباد، قال قلنا لعمار أرأيت قتالكم أرأيا رأيتموه فإن الرأى يخطئ ويصيب أو عهدا عهده إليكم رسول الله صلى الله عليه وسلم فقال ما عهد إلينا رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس كافة ‏.‏ وقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في أمتي ‏\"‏ ‏.‏ قال شعبة وأحسبه قال حدثني حذيفة ‏.‏ وقال غندر أراه قال ‏\"‏ في أمتي اثنا عشر منافقا لا يدخلون الجنة ولا يجدون ريحها حتى يلج الجمل في سم الخياط ثمانية منهم تكفيكهم الدبيلة سراج من النار يظهر في أكتافهم حتى ينجم من صدورهم ‏\"‏ ‏.‏",
      "text_en": " Qais b. 'Ubad reported:                      We said to 'Ammar: Was your fighting (on the side of 'Ali in the Battle of Siffin) a matter of your own choice or you got its hints from Allah's Messenger (may peace be upon him) for it, is likely for one to err in one's own discretion or was it because of any covenant that Allah's Messenger (may peace be upon him) got from you? He said: It was not because of any covenant that Allah's Messenger (may peace be upon him) got from us which he did get from other people, and he further said that Allah's Messenger (may peace be upon him) said:\" In my Ummah.\" And I think that Hudhaifa reported to me and according to Ghundar (the words are) that he said: In my Ummah, there would be twelve hypocrites and they would not be admitted to Paradise and they would not smell its odour, until the camel would pass through a needle's hole. Dubaila (ulcer) would be enough to (torment them) -a kind of flame of Fire which would appear in their shoulders and it would protrude from their chest.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "10721",
        "11609"
      ]
    },
    {
      "hadith_no": "7747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا عمرو بن زرارة، حدثنا هشيم، عن أبي هاشم، عن أبي مجلز، عن قيس، بن عباد قال سمعت أبا ذر، يقسم قسما إن ‏{‏ هذان خصمان اختصموا في ربهم‏}‏ إنها نزلت في الذين برزوا يوم بدر حمزة وعلي وعبيدة بن الحارث وعتبة وشيبة ابنا ربيعة والوليد بن عتبة ‏.‏",
      "text_en": " Abu Dharr took an oath that this verse:                     \" These two adversaries who dispute about their Lord\" (xxii. 19) was revealed in connection with those who on the Day of Badr came out (of rows to fight against the non-believers and they were) Hamza, 'Ali, 'Ubaida b. Harith (from the side of the Muslims) and 'Utba and Shaiba, both of them the sons of Rabi'a and Walid b. 'Utba (from the side of the non-believers of Mecca).",
      "chain": [
        "30365",
        "20468",
        "11454",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "7748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، جميعا عن سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، قال سمعت أبا ذر، يقسم لنزلت ‏{‏ هذان خصمان‏}‏ بمثل حديث هشيم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Dharr through another chain of transmitters.",
      "chain": [
        "30201",
        "20032",
        "30170",
        "20005",
        "11454",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "2656",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، ح وحدثنا عبيد الله بن عمر، حدثنا عبد الرحمن بن مهدي، حدثنا هشام، حدثنا قتادة، عن الحسن، عن قيس بن عباد، قال كان أصحاب النبي صلى الله عليه وسلم يكرهون الصوت عند القتال ‏.‏",
      "text_en": " Narrated Qays ibn Abbad:                     The Companions of the Prophet (ﷺ), disliked shouting while fighting.",
      "chain": [
        "20285",
        "20295",
        "11201",
        "20033",
        "11065",
        "11019",
        "11016",
        "11609"
      ]
    },
    {
      "hadith_no": "4530",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى بن سعيد، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن قيس بن عباد، قال انطلقت أنا والأشتر، إلى علي عليه السلام فقلنا هل عهد إليك رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس عامة قال لا إلا ما في كتابي هذا - قال مسدد قال - فأخرج كتابا - وقال أحمد كتابا من قراب سيفه - فإذا فيه ‏\"‏ المؤمنون تكافأ دماؤهم وهم يد على من سواهم ويسعى بذمتهم أدناهم ألا لا يقتل مؤمن بكافر ولا ذو عهد في عهده من أحدث حدثا فعلى نفسه ومن أحدث حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏ قال مسدد عن ابن أبي عروبة فأخرج كتابا ‏.‏",
      "text_en": " Narrated Qays ibn Abbad :                     I and Ashtar went to Ali and said to him: Did the Messenger of Allah (ﷺ) give you any instruction about anything for which he did not give any instruction to the people in general?  He said: No, except what is contained in this document of mine. Musaddad said: He then took out a document. Ahmad said: A document from the sheath of his sword.  It contained: The lives of all Muslims are equal; they are one hand against others; the lowliest of them can guarantee their protection. Beware, a Muslim must not be killed for an infidel, nor must one who has been given a covenant be killed while his covenant holds. If anyone introduces an innovation, he will be responsible for it. If anyone introduces an innovation or gives shelter to a man who introduces an innovation (in religion), he is cursed by Allah, by His angels, and by all the people. Musaddad said: Ibn AbuUrubah's version has: He took out a document.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "11073",
        "11019",
        "11016",
        "11609"
      ]
    },
    {
      "hadith_no": "4666",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسماعيل بن إبراهيم الهذلي، حدثنا ابن علية، عن يونس، عن الحسن، عن قيس بن عباد، قال قلت لعلي رضى الله عنه أخبرنا عن مسيرك هذا أعهد عهده إليك رسول الله صلى الله عليه وسلم أم رأى رأيته فقال ما عهد إلى رسول الله صلى الله عليه وسلم بشىء ولكنه رأى رأيته ‏.‏",
      "text_en": " Qais b. ‘Abbad said :                      I said to ‘All (Allah be pleased with him) : Tell me about this march of yours. Is this an order that the Messenger of Allah (May peace be upon him) had given you, or is this your opinion that you have? He said: The Messenger of Allah (May peace be upon him) did not give me any order; but this is an opinion that I have.",
      "chain": [
        "20208",
        "20208",
        "20475",
        "11016",
        "11609"
      ]
    },
    {
      "hadith_no": "808",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عمر بن علي بن مقدم، قال حدثنا يوسف بن يعقوب، قال أخبرني التيمي، عن أبي مجلز، عن قيس بن عباد، قال بينا أنا في المسجد، في الصف المقدم فجبذني رجل من خلفي جبذة فنحاني وقام مقامي فوالله ما عقلت صلاتي فلما انصرف فإذا هو أبى بن كعب فقال يا فتى لا يسؤك الله إن هذا عهد من النبي صلى الله عليه وسلم إلينا أن نليه ثم استقبل القبلة فقال هلك أهل العقد ورب الكعبة ثلاثا ثم قال والله ما عليهم آسى ولكن آسى على من أضلوا ‏.‏ قلت يا أبا يعقوب ما يعني بأهل العقد قال الأمراء ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                      \"While I was in the Masjid in the first row, a man pulled me from behind and moved me aside, and took my place. By Allah, I could not focus on my prayer, then when he left I saw that it was Ubayy bin Ka'b. He said: '0 boy, may Allah protect you from harm. This is what the Prophet instructed us to do, to stand directly behind him.' Then he (Ubayy) turned to face the Qiblah and said: 'Doomed are Ah1 Al-'Uqd, by the Lord of the Ka'bah! - three times.'Then he said: 'By Allah, I am not sad for them, but I am sad for the people whom they have misled.' I said: '0 Abu Ya'qub, what do you mean by Ah1 Al-'Uqd?' He said: 'The rulers.\"'",
      "chain": [
        "30582",
        "20305",
        "11289",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "1306",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا شريك، عن أبي هاشم الواسطي، عن أبي مجلز، عن قيس بن عباد، قال صلى عمار بن ياسر بالقوم صلاة أخفها فكأنهم أنكروها فقال ألم أتم الركوع والسجود قالوا بلى ‏.‏ قال أما إني دعوت فيها بدعاء كان النبي صلى الله عليه وسلم يدعو به ‏\"‏ اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي وأسألك خشيتك في الغيب والشهادة وكلمة الإخلاص في الرضا والغضب وأسألك نعيما لا ينفد وقرة عين لا تنقطع وأسألك الرضاء بالقضاء وبرد العيش بعد الموت ولذة النظر إلى وجهك والشوق إلى لقائك وأعوذ بك من ضراء مضرة وفتنة مضلة اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                     \"Ammar bin Yasir led the people in prayer and he made the prayer short. It was as if they disliked that, so he said: 'Did I not do bowing and prostration properly?' They said: 'Yes.' He said: 'And I said a supplication that the Prophet (ﷺ) used to say:Allahumma bi 'ilmikal-ghaiba wa qudratika 'alal-khalqi ahini ma 'alimtal-hayata khairan li, wa tawaffani idha 'alimtal-wafata khairan li. Allahumma as'aluka khashyataka fil-ghaibi wash-shahadati wa as'aluka kalimatul-aqua fir-rida'i wal ghadab, wa as'alukal-qasda fil faqr wal-ghina, wa as'aluka na'iman la yanfadu wa as'aluka qurrata ainan la tanqati'u wa as'alukar-rida'i ba'dal-qada'i wa as'aluka bardal 'aishi ba'dal-mawti, wa as'aluka ladhatan-nazari ila wajhika wash-shawqa ila liqa'ika fi fitnatin mudillatin, Allahumma zayyina dizinatil-imani waj'alna hudatan muhtadin (O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know that living is good for me and cause me to die when You know that death is better for me. O Allah, cause me to fear You in secret and in public. I ask You to make me true in speech in times of pleasure and of anger. I ask You to make me moderate in times of wealth and poverty. And I ask You for everlasting delight and joy that will never cease. I ask You to make me pleased with that which You have decreed and for an easy life after death. I ask You for the sweetness of looking upon Your face and a longing to meet You in a manner that does not entail a calamity that will bring about harm or a trial that will cause deviation. O Allah, beautify us with the adornment of faith and make us among those who guide and are rightly guided.\"",
      "chain": [
        "20587",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "4734",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني محمد بن المثنى، قال حدثنا يحيى بن سعيد، قال حدثنا سعيد، عن قتادة، عن الحسن، عن قيس بن عباد، قال انطلقت أنا والأشتر، إلى علي رضى الله عنه فقلنا هل عهد إليك نبي الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس عامة قال لا إلا ما كان في كتابي هذا ‏.‏ فأخرج كتابا من قراب سيفه فإذا فيه ‏\"‏ المؤمنون تكافأ دماؤهم وهم يد على من سواهم ويسعى بذمتهم أدناهم ألا لا يقتل مؤمن بكافر ولا ذو عهد بعهده من أحدث حدثا فعلى نفسه أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qais bin 'Ubad said:                     \"Al-Ashtar and I went to 'Ali, may Allah be pleased with him, and said: Did the Prophet of Allah tell you anything that he did not tell to all the people?' He said: 'No, except what is in this letter of mine.' He brought out a letter from the sheath of his sword and it said therein: \"The lives of the believers are equal in value, and they are one against others, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his convenant is in effect. Whoever commits an offense then the blame is on himself, and whoever gives sanctuary to an offender, then upon him will be the curse of Allah, the angels and all the people.\"",
      "chain": [
        "30170",
        "20031",
        "11168",
        "11019",
        "11016",
        "11609"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن حكيم، وحفص بن عمرو، قالا حدثنا عبد الرحمن بن مهدي، ح وحدثنا محمد بن إسماعيل، أنبأنا وكيع، قالا حدثنا سفيان، عن أبي هاشم الرماني، - قال أبو عبد الله هو يحيى بن الأسود - عن أبي مجلز، عن قيس بن عباد، قال سمعت أبا ذر، يقسم لنزلت هذه الآيات في هؤلاء الرهط الستة يوم بدر ‏{‏هذان خصمان اختصموا في ربهم‏}‏ إلى قوله‏:‏ ‏{‏ إن الله يفعل ما يريد‏}‏ في حمزة بن عبد المطلب وعلي بن أبي طالب وعبيدة بن الحارث وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عتبة اختصموا في الحجج يوم بدر ‏.‏",
      "text_en": " It wasnarrated that Qais bin ‘Ubaid said:                      “I heard Abu Dharrswearingthat these verses were revealed concerning those six peopleon theDay of Badr: ‘These two opponents (believers and disbelievers)dispute with each other about their Lord.”[22:19] to the words“Verily, Allah does what he wills.’[22:14] (that is) Hamzah bin‘Abdul-Muttalib, ‘Ali bin Abi Talib, ‘Ubaidah bin Al-Harith,‘Utbahbin Rabi’ah, Shaibah bin Rabi’ah and Al-Walid bin‘Utbah. They arguedwith one another on the Day of Badr.”",
      "chain": [
        "34280",
        "20033",
        "34188",
        "20032",
        "20012",
        "11454",
        "30184",
        "11313",
        "11609"
      ]
    }
  ],
  "total_hadiths": 21
}