{
  "id": "11603",
  "name": "'Uqba bin Abd al-Ghafr عقبة بن عبد الغافر الأزدي العوذي",
  "full_name": "'Uqba bin Abd al-Ghafr عقبة بن عبد الغافر الأزدي العوذي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "83",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3242",
      "name": "'Abdullah bin Mughfal al-Mazni ( عبد الله بن مغفل المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11314",
      "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2312",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا إسحاق، حدثنا يحيى بن صالح، حدثنا معاوية  هو ابن سلام  عن يحيى، قال سمعت عقبة بن عبد الغافر، أنه سمع أبا سعيد الخدري  رضى الله عنه  قال جاء بلال إلى النبي صلى الله عليه وسلم بتمر برني فقال له النبي صلى الله عليه وسلم ‏\"‏ من أين هذا ‏\"‏‏.‏ قال بلال كان عندنا تمر ردي، فبعت منه صاعين بصاع، لنطعم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم عند ذلك ‏\"‏ أوه أوه عين الربا عين الربا، لا تفعل، ولكن إذا أردت أن تشتري فبع التمر ببيع آخر ثم اشتره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id al-Khudri:                     Once Bilal brought Barni (i.e. a kind of dates) to the Prophet and the Prophet asked him, \"From where have you brought these?\" Bilal replied, \"I had some inferior type of dates and exchanged two Sas of it for one Sa of Barni dates in order to give it to the Prophet; to eat.\" Thereupon the Prophet said, \"Beware! Beware! This is definitely Riba (usury)! This is definitely Riba (Usury)! Don't do so, but if you want to buy (a superior kind of dates) sell the inferior dates for money and then buy the superior kind of dates with that money.\"",
      "chain": [
        "30313",
        "20470",
        "20401",
        "11449",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "3478",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو الوليد، حدثنا أبو عوانة، عن قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا كان قبلكم رغسه الله مالا فقال لبنيه لما حضر أى أب كنت لكم قالوا خير أب‏.‏ قال فإني لم أعمل خيرا قط، فإذا مت فأحرقوني ثم اسحقوني ثم ذروني في يوم عاصف‏.‏ ففعلوا، فجمعه الله عز وجل، فقال ما حملك قال مخافتك‏.‏ فتلقاه برحمته ‏\"‏‏.‏   وقال معاذ حدثنا شعبة، عن قتادة، سمعت عقبة بن عبد الغافر، سمعت أبا سعيد الخدري، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"Amongst the people preceding your age, there was a man whom Allah had given a lot of money. While he was in his death-bed, he called his sons and said, 'What type of father have I been to you? They replied, 'You have been a good father.' He said, 'I have never done a single good deed; so when I die, burn me, crush my body, and scatter the resulting ashes on a windy day.' His sons did accordingly, but Allah gathered his particles and asked (him), 'What made you do so?' He replied, \"Fear of you.' So Allah bestowed His Mercy upon him. (forgave him).",
      "chain": [
        "20296",
        "20469",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "6559",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا موسى، حدثنا معتمر، سمعت أبي، حدثنا قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ذكر رجلا فيمن كان سلف أو قبلكم آتاه الله مالا وولدا  يعني أعطاه قال  فلما حضر قال لبنيه أى أب كنت قالوا خير أب‏.‏ قال فإنه لم يبتئر عند الله خيرا  فسرها قتادة لم يدخر  وإن يقدم على الله يعذبه فانظروا، فإذا مت فأحرقوني، حتى إذا صرت فحما فاسحقوني  أو قال فاسهكوني  ثم إذا كان ريح عاصف فأذروني فيها‏.‏ فأخذ مواثيقهم على ذلك وربي ففعلوا فقال الله كن‏.‏ فإذا رجل قائم، ثم قال أى عبدي ما حملك على ما فعلت قال مخافتك  أو فرق منك  فما تلافاه أن رحمه الله ‏\"‏‏.‏ فحدثت أبا عثمان فقال سمعت سلمان غير أنه زاد فأذروني في البحر‏.‏ أو كما حدث‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet mentioned a man from the previous generation or from the people preceding your age whom Allah had given both wealth and children. The Prophet said, \"When the time of his death approached, he asked his children, 'What type of father have I been to you?' They replied: You have been a good father. He said, 'But he (i.e. your father) has not stored any good deeds with Allah (for the Hereafter): if he should face Allah, Allah will punish him. So listen, (O my children), when I die, burn my body till I become mere coal and then grind it into powder, and when there is a stormy wind, throw me (my ashes) in it.' So he took a firm promise from his children (to follow his instructions). And by Allah they (his sons) did accordingly(fulfilled their promise.) Then Allah said, \"Be\"' and behold! That man was standing there! Allah then said. \"O my slave! What made you do what you did?\" That man said, \"Fear of You.\" So Allah forgave him.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "7600",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، سمعت أبي، حدثنا قتادة، عن عقبة بن عبد الغافر، عن أبي سعيد، عن النبي صلى الله عليه وسلم ‏\"‏ أنه ذكر رجلا فيمن سلف  أو فيمن كان قبلكم قال كلمة يعني  أعطاه الله مالا وولدا  فلما حضرت الوفاة قال لبنيه أى أب كنت لكم قالوا خير أب‏.‏ قال فإنه لم يبتئر  أو لم يبتئز  عند الله خيرا، وإن يقدر الله عليه يعذبه، فانظروا إذا مت فأحرقوني حتى إذا صرت فحما فاسحقوني  أو قال فاسحكوني  فإذا كان يوم ريح عاصف فأذروني فيها ‏\"‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ فأخذ مواثيقهم على ذلك وربي، ففعلوا ثم أذروه في يوم عاصف، فقال الله عز وجل كن‏.‏ فإذا هو رجل قائم‏.‏ قال الله أى عبدي ما حملك على أن فعلت ما فعلت قال مخافتك أو فرق منك قال فما تلافاه أن رحمه عندها  وقال مرة أخرى فما تلافاه غيرها  ‏\"‏‏.‏ فحدثت به أبا عثمان فقال سمعت هذا من سلمان غير أنه زاد فيه أذروني في البحر‏.‏ أو كما حدث‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet mentioned a man from the people of the past or those who preceded you. The Prophet said a sentence meaning: Allah had given him wealth and children. When his death approached, he said to his sons, \"What kind of father have I been to you?\" They replied, \"You have been a good father.\" He told them that he had not presented any good deed before Allah, and if Allah should get hold of him He would punish him.' \"So look!\" he added, \"When I die, burn me, and when I turn into coal, crush me, and when there comes a windy day, scatter my ashes in the wind.\" The Prophet added, \"Then by Allah, he took a firm promise from his children to do so, and they did so. (They burnt him after his death) and threw his ashes on a windy day. Then Allah commanded to his ashes. \"Be,\" and behold! He became a man standing! Allah said, \"O My slave! What made you do what you did?\" He replied, \"For fear of You.\" Nothing saved him then but Allah's Mercy (So Allah forgave him).",
      "chain": [
        "30145",
        "20288",
        "11289",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "4167",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن صالح الوحاظي، حدثنا معاوية، ح وحدثني محمد بن سهل التميمي، وعبد الله بن عبد الرحمن الدارمي، - واللفظ لهما - جميعا عن يحيى بن حسان، حدثنا معاوية، - وهو ابن سلام - أخبرني يحيى، - وهو ابن أبي كثير - قال سمعت عقبة بن عبد الغافر، يقول سمعت أبا سعيد، يقول جاء بلال بتمر برني فقال له رسول الله صلى الله عليه وسلم ‏\"‏ من أين هذا ‏\"‏ ‏.‏ فقال بلال تمر كان عندنا رديء فبعت منه صاعين بصاع لمطعم النبي صلى الله عليه وسلم ‏.‏ فقال رسول الله عند ذلك ‏\"‏ أوه عين الربا لا تفعل ولكن إذا أردت أن تشتري التمر فبعه ببيع آخر ثم اشتر به ‏\"‏ ‏.‏ لم يذكر ابن سهل في حديثه عند ذلك ‏.‏",
      "text_en": " Abd Sa'id reported:                      Bilal (Allah be pleased with him) came with fine quality of dates. Allah's Messenger (may peace be upon him) said to him: From where (you have brought them)? Bilal said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle (may peace be upon him), whereupon Allah's Messenger (may peace be upon him) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of\" whereupon\".",
      "chain": [
        "30313",
        "20470",
        "27",
        "20300",
        "20401",
        "11449",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "7160",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن قتادة، سمع  عقبة بن عبد الغافر، يقول سمعت أبا سعيد الخدري، يحدث عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا فيمن كان قبلكم راشه الله مالا وولدا فقال لولده لتفعلن ما آمركم به أو لأولين ميراثي غيركم إذا أنا مت فأحرقوني - وأكثر علمي أنه قال - ثم اسحقوني واذروني في الريح فإني لم أبتهر عند الله خيرا وإن الله يقدر على أن يعذبني - قال - فأخذ منهم ميثاقا ففعلوا ذلك به وربي فقال الله ما حملك على ما فعلت فقال مخافتك ‏.‏ قال فما تلافاه غيرها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that Allah's Messenger (may peace be upon him) said that a person amongst the earlier nations before you was conferred property and children by Allah, He said to his children:                      'You must do as I command you to do, otherwise I will make others besides you as my inheritors. As I die, burn my body and blow my ashes in the wind as I do not find any merit of mine which would please Allah, and if Allah were to take hold of me, He would punish me. He took a pledge from them and they did as he commanded thein to do. Allah said: What prompted you to do this? He said: My Lord. Thine fear, and Allah did not punish him at all.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11019",
        "11603",
        "38"
      ]
    },
    {
      "hadith_no": "4557",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا هشام بن عمار، عن يحيى، - وهو ابن حمزة - قال حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني عقبة بن عبد الغافر، قال حدثني أبو سعيد، قال أتى بلال رسول الله صلى الله عليه وسلم بتمر برني فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ قال اشتريته صاعا بصاعين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أوه عين الربا لا تقربه ‏\"‏ ‏.‏",
      "text_en": " Abu Saeed said:                     \"Bilal brought some Bami dates to the Messenger of Allah and he said: 'What is this? 'He said: 'I bought a Sa of them for two Sas. The Messenger of Allah said: \"O! The essence of Riba, do not approach it.\"'",
      "chain": [
        "30288",
        "20402",
        "20024",
        "11449",
        "11603",
        "38"
      ]
    }
  ],
  "total_hadiths": 7
}