{
  "id": "11618",
  "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
  "full_name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء  زياد بن فيروز",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "90",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10692",
      "name": "Tlq bin Habib al-Nzy al-Bsry طلق بن حبيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10695",
      "name": "'Abdullah bin al-Samit عبد الله بن الصامت",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10672",
      "name": "Badayl bin Maysarah بديل بن ميسرة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10719",
      "name": "Matr bin Tahman al-Waraq مطر بن طهمان الوراق أبو رجاء الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24083",
      "name": "al-Hasan bin Abi al-Hasana'a الحسن بن أبي الحسناء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-581",
      "hadith_no": "581",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا هشام، عن قتادة، عن أبي العالية، عن ابن عباس، قال شهد عندي رجال مرضيون وأرضاهم عندي عمر أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد الصبح حتى تشرق الشمس، وبعد العصر حتى تغرب‏.‏",
      "text_en": " Narrated `Umar:                     \"The Prophet forbade praying after the Fajr prayer till the sun rises and after the `Asr prayer till the sun sets.\"",
      "usc_msa_ref": "555",
      "chain": [
        "30329",
        "20295",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-581-2",
      "hadith_no": "581",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن قتادة، سمعت أبا العالية، عن ابن عباس، قال حدثني ناس، بهذا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Some people told me the same narration (as above).",
      "usc_msa_ref": "556",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1085",
      "hadith_no": "1085",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا أيوب، عن أبي العالية البراء، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم وأصحابه لصبح رابعة يلبون بالحج، فأمرهم أن يجعلوها عمرة إلا من معه الهدى‏.‏ تابعه عطاء عن جابر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya (O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. The Prophet ordered his companions to assume the lhram for Umra instead of Hajj, excepting those who had Hadi (sacrifice) with them.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3239",
      "hadith_no": "3239",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم يعني ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت ليلة أسري بي موسى رجلا آدم طوالا جعدا، كأنه من رجال شنوءة، ورأيت عيسى رجلا مربوعا مربوع الخلق إلى الحمرة والبياض، سبط الرأس، ورأيت مالكا خازن النار ‏\"‏‏.‏ والدجال في آيات أراهن الله إياه، فلا تكن في مرية من لقائه‏.‏ قال أنس وأبو بكرة عن النبي صلى الله عليه وسلم ‏\"‏ تحرس الملائكة المدينة من الدجال ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"On the night of my Ascent to the Heaven, I saw Moses who was a tall brown curlyhaired man as if he was one of the men of Shan'awa tribe, and I saw Jesus, a man of medium height and moderate complexion inclined to the red and white colors and of lank hair. I also saw Malik, the gate-keeper of the (Hell) Fire and Ad-Dajjal amongst the signs which Allah showed me.\" (The Prophet then recited the Holy Verse): \"So be not you in doubt of meeting him' when you met Moses during the night of Mi'raj over the heavens\" (32.23) Narrated Anas and Abu Bakra: \"The Prophet said, \"The angels will guard Medina from Ad-Dajjal (who will not be able to enter the city of Medina).",
      "usc_msa_ref": "462",
      "chain": [
        "30160",
        "20278",
        "20020",
        "30132",
        "20304",
        "11168",
        "11019",
        "11618"
      ]
    },
    {
      "id": "sahih-bukhari-3395",
      "hadith_no": "3395",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، قال سمعت أبا العالية، حدثنا ابن عم، نبيكم  يعني ابن عباس  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏   وذكر النبي صلى الله عليه وسلم ليلة أسري به فقال ‏\"‏ موسى آدم طوال كأنه من رجال شنوءة ‏\"‏‏.‏ وقال ‏\"‏ عيسى جعد مربوع ‏\"‏‏.‏ وذكر مالكا خازن النار، وذكر الدجال‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"One should not say that I am better than Jonah (i.e. Yunus) bin Matta.\" So, he mentioned his father Matta. The Prophet mentioned the night of his Ascension and said, \"The prophet Moses was brown, a tall person as if from the people of the tribe of Shanu'a. Jesus was a curly-haired man of moderate height.\" He also mentioned Malik, the gate-keeper of the (Hell) Fire, and Ad-Dajjal.",
      "usc_msa_ref": "608",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "11618"
      ]
    },
    {
      "id": "sahih-bukhari-3413",
      "hadith_no": "3413",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة، عن أبي العالية، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول إني خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"No slave (of Allah) should say that I am better than Yunus bin Matta.\" So the Prophet mentioned his father's name with his name.",
      "usc_msa_ref": "625",
      "chain": [
        "30329",
        "20020",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4674",
      "hadith_no": "4674",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن مهدي، حدثنا شعبة، عن قتادة، عن أبي العالية، قال حدثني ابن عم، نبيكم يعني ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Nobody has the rights to say that I am better than Jonah bin Matta.\"",
      "usc_msa_ref": "154",
      "chain": [
        "30160",
        "20033",
        "20020",
        "11019",
        "11618"
      ]
    },
    {
      "id": "sahih-bukhari-6419",
      "hadith_no": "6419",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا قتادة، عن أبي العالية، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يدعو عند الكرب ‏\"‏ لا إله إلا الله العظيم الحليم، لا إله إلا الله رب السموات والأرض، رب العرش العظيم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to invoke Allah at the time of distress, saying, \"La ilaha illal-lahu Al-`Azim, al- Halim, La ilaha illal-lahu Rabbu-s-samawati wal-ard wa Rabbu-l-arsh il-azim.\"",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20295",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6420",
      "hadith_no": "6420",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن أبي عبد الله، عن قتادة، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يقول عند الكرب ‏\"‏ لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات، ورب الأرض، ورب العرش الكريم ‏\"‏‏.‏ وقال وهب حدثنا شعبة عن قتادة مثله‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle used to say at a time of distress, \"La ilaha illal-lahu Rabbul-l-'arsh il-'azim, La ilaha illallahu Rabbu-s-samawati wa Rabbu-l-ard, Rabbu-l-'arsh-il-Karim.\"",
      "usc_msa_ref": "357",
      "chain": [
        "30175",
        "20031",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7516",
      "hadith_no": "7516",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن سعيد، عن قتادة، عن أبي العالية، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يقول عند الكرب ‏\"‏ لا إله إلا الله العليم الحليم لا إله إلا الله رب العرش العظيم لا إله إلا الله رب السموات ورب الأرض رب العرش الكريم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to say at the time of difficulty, 'La ilaha il-lallah Al-`Alimul-Halim. La-ilaha illallah Rabul- Arsh-al-Azim, La ilaha-il-lallah Rabus-Samawati Rab-ul-Ard; wa Rab-ul-Arsh Al- Karim.' (See Hadith No. 356 and 357, Vol. 8)",
      "usc_msa_ref": "",
      "chain": [
        "30457",
        "20299",
        "11168",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7521",
      "hadith_no": "7521",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أبي العالية، عن ابن عباس، أن نبي الله صلى الله عليه وسلم كان يدعو بهن عند الكرب ‏\"‏ لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب العرش الكريم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle used to say at the time of difficulty, \"None has the right to be worshipped but Allah, the Majestic, the Most Forbearing. None has the right to be worshipped but Allah, the Lord of the Tremendous Throne. None has the right to be worshipped but Allah, the Lord of the Heavens and the Lord of the Honourable Throne. (See Hadith No. 357, Vol. 8)",
      "usc_msa_ref": "526",
      "chain": [
        "30146",
        "20304",
        "11168",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7634",
      "hadith_no": "7634",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن أبي العالية، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم فيما يرويه عن ربه قال ‏\"‏ لا ينبغي لعبد أن يقول إنه خير من يونس بن متى ‏\"‏‏.‏ ونسبه إلى أبيه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said that his Lord said: \"It does not befit a slave that he should say that he is better than Jonah (Yunus) bin Matta.",
      "usc_msa_ref": "630",
      "chain": [
        "30329",
        "20020",
        "30132",
        "20304",
        "11168",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-436",
      "hadith_no": "436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت أبا العالية، يقول حدثني ابن عم، نبيكم صلى الله عليه وسلم - يعني ابن عباس - قال ذكر رسول الله صلى الله عليه وسلم حين أسري به فقال ‏\"‏ موسى آدم طوال كأنه من رجال شنوءة ‏\"‏ ‏.‏ وقال ‏\"‏ عيسى جعد مربوع ‏\"‏ ‏.‏ وذكر مالكا خازن جهنم وذكر الدجال ‏.‏",
      "text_en": " Qatada reported that he heard Abu al-'Aliya saying that the cousin of your Prophet (may peace be upon him), i. e. Ibn Abbas, told him:                      The Messenger of Allah (may peace be upon him), while narrating his night journey observed: Musa (peace be upon him) was a man of high stature as if he was of the people of the Shanu'a (tribe), and Jesus was a well-built person having curly hair. He also mentioned Malik, the guardian of Hell, and Dajjal.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11618"
      ]
    },
    {
      "id": "sahih-muslim-437",
      "hadith_no": "437",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم صلى الله عليه وسلم ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مررت ليلة أسري بي على موسى بن عمران - عليه السلام - رجل آدم طوال جعد كأنه من رجال شنوءة ورأيت عيسى ابن مريم مربوع الخلق إلى الحمرة والبياض سبط الرأس ‏\"‏ ‏.‏ وأري مالكا خازن النار والدجال ‏.‏ في آيات أراهن الله إياه فلا تكن في مرية من لقائه ‏.‏ قال كان قتادة يفسرها أن نبي الله صلى الله عليه وسلم قد لقي موسى عليه السلام ‏.‏",
      "text_en": " Abu al-'Aliya reported:                      Ibn Abbas, the son of your Prophet's uncle, told us that the Messenger of Allah (may peace be upon him) had observed: On the night of my night journey I passed by Moses b. 'Imran (peace be upon him), a man light brown in complexion, tall. well-built as if he was one of the men of the Shanu'a, and saw Jesus son of Mary as a medium-statured man with white and red complexion and crisp hair, and I was shown Malik the guardian of Fire, and Dajjal amongst the signs which were shown to me by Allah. He (the narrator) observed: Then do not doubt his (i. e. of the Holy Prophet) meeting with him (Moses). Qatada elucidated it thus: Verily the Apostle of Allah (may peace be upon him), met Moses (peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "11618"
      ]
    },
    {
      "id": "sahih-muslim-438",
      "hadith_no": "438",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، وسريج بن يونس، قالا حدثنا هشيم، أخبرنا داود بن أبي هند، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بوادي الأزرق فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا هذا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى - عليه السلام - هابطا من الثنية وله جؤار إلى الله بالتلبية ‏\"‏ ‏.‏ ثم أتى على ثنية هرشى ‏.‏ فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى قال ‏\"‏ كأني أنظر إلى يونس بن متى - عليه السلام - على ناقة حمراء جعدة عليه جبة من صوف خطام ناقته خلبة وهو يلبي ‏\"‏ ‏.‏ قال ابن حنبل في حديثه قال هشيم يعني ليفا ‏.‏",
      "text_en": " Abu al-'Aliya narrated it on the authority of Ibn 'Abbas that the Messenger of Allah (may peace be upon him) passed through the valley of Azraq, and he asked:                      Which valley is this? They said: This is the valley of Azraq, and he observed: (I perceive) as if I am seeing Moses (peace be upon him) coming down from the mountain track, and he is calling upon Allah loudly (saying: Here I am! at your service! ). Then he came to the mountain track of Harsha. He (the Holy Prophet) said: Which is this mountain track? They said: It is the mountain track of Harsha. He observed (I feel) as If I am seeing Yunus (Jonah-peace be upon him) son of Matta on a well- built red dromedary, with a cloak of wool around him and the rein of his dromedary is made of the fibres of date-palm, and he is calling upon Allah (saying: Here I am! at your service, my Lord! ). Ibn Hanbal said in the hadith narrated by him: Hushaim said that the meaning of khulba was fibre of date-palm.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30251",
        "20468",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-439",
      "hadith_no": "439",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا ابن أبي عدي، عن داود، عن أبي العالية، عن ابن عباس، قال سرنا مع رسول الله صلى الله عليه وسلم بين مكة والمدينة فمررنا بواد فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ فقالوا وادي الأزرق ‏.‏ فقال ‏\"‏ كأني أنظر إلى موسى صلى الله عليه وسلم فذكر من لونه وشعره شيئا لم يحفظه داود واضعا إصبعيه في أذنيه له جؤار إلى الله بالتلبية مارا بهذا الوادي ‏\"‏ ‏.‏ قال ‏\"‏ ثم سرنا حتى أتينا على ثنية فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا هرشى أو لفت ‏.‏ فقال ‏\"‏ كأني أنظر إلى يونس على ناقة حمراء عليه جبة صوف خطام ناقته ليف خلبة مارا بهذا الوادي ملبيا ‏\"‏ ‏.‏",
      "text_en": " Abu al-'Aliya narrated it on the authority of Ibn 'Abbas that he said:                      We travelled with the Messenger of Allah (may peace be upon him) between Mecca and Medina and we passed by a valley. He (the Holy Prophet) asked: Which valley is this? They said: This is the valley of Azraq Upon this he (the Holy Prophet) remarked: (I feel) as if I am seeing Moses (peace be upon him), and then he described something about his complexion and hair, which Diwud (the narrator) could not remember. He (Moses, as described by the Holy Prophet) was keeping his fingers in his ears and was responding loudly to Allah (saying: I am as Thy service, my Lord) while passing through that valley. We then travelled (further) till we came to the mountain trail. He (the Holy Prophet) said: Which mountain trail is this? They said: It is the Harsha or Lift. He (the Holy Prophet) said: (I perceive) as if I am seeing Yunus on a red camel, with a cloak of wool around him. The halter of his camel was that of the fibre of date-palm, and he was passing through the valley saying: I am at Thy service! my Lord.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-455",
      "hadith_no": "455",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج جميعا عن وكيع، - قال الأشج حدثنا وكيع، - حدثنا الأعمش، عن زياد بن الحصين أبي جهمة، عن أبي العالية، عن ابن عباس، قال ‏{‏ ما كذب الفؤاد ما رأى‏}‏ ‏{‏ ولقد رآه نزلة أخرى‏}‏ قال رآه بفؤاده مرتين ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abbas that the words:                     \" The heart belied not what he saw\" (al-Qur'an, Iiii. 11) and\" Certainly he saw Him in another descent\" (al-Qur'an, Iiii. 13) imply that he saw him twice with his heart.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30200",
        "20032",
        "30200",
        "20032",
        "11060",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1500",
      "hadith_no": "1500",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) struck my thigh and said: How would you act if you survive among the people who would delay prayers beyond their (prescribed) time? He (Abu Dharr) said: What do you command (under this situation)? He (the Holy Prophet) slid: Observe prayer at its prescribed time, then go (to meet) your needs, and if the Iqama is pronounced, and you are present in the mosque, then observe prayer (along with the Jama'at).",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1501",
      "hadith_no": "1501",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن أبي العالية البراء، قال أخر ابن زياد الصلاة فجاءني عبد الله بن الصامت فألقيت له كرسيا فجلس عليه فذكرت له صنيع ابن زياد فعض على شفته وضرب فخذي وقال إني سألت أبا ذر كما سألتني فضرب فخذي كما ضربت فخذك وقال إني سألت رسول الله صلى الله عليه وسلم كما سألتني فضرب فخذي كما ضربت فخذك وقال ‏\"‏ صل الصلاة لوقتها فإن أدركتك الصلاة معهم فصل ولا تقل إني قد صليت فلا أصلي ‏\"‏ ‏.‏",
      "text_en": " 'Abu'l-'Aliyat al-Bara reported:                      Ibn Ziyad delayed the prayer. 'Abdullah b. Samit came to me and I placed a chair for him and he sat in it and I made a mention of whit Ibn Ziyad had done. He bit hit lips (as a sign of extreme anger and annoyance) and struck at my thigh and said: I asked Abu Dharr as you have asked me, and he struck my thigh just as I have struck your thigh, and said: I asked the Messenger of Allah (may peace be upon him) as you have asked me and he struck my thigh just as I have struck your thigh, and he (the Holy Prophet) said: Observe prayer at its prescribed time, and if you can say prayer along with them. do so, and do not say.\" I have observed prayer and so I shall not pray.\"",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "11015",
        "11618"
      ]
    },
    {
      "id": "sahih-muslim-1503",
      "hadith_no": "1503",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن مطر، عن أبي العالية البراء، قال قلت لعبد الله بن الصامت نصلي يوم الجمعة خلف أمراء فيؤخرون الصلاة - قال - فضرب فخذي ضربة أوجعتني وقال سألت أبا ذر عن ذلك فضرب فخذي وقال سألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ صلوا الصلاة لوقتها واجعلوا صلاتكم معهم نافلة ‏\"‏ ‏.‏ قال وقال عبد الله ذكر لي أن نبي الله صلى الله عليه وسلم ضرب فخذ أبي ذر ‏.‏",
      "text_en": " Abu'l-'Aliyat al-Bara' reported:                      I said to 'Abdullah b. Samit: We say our Jumu'a prayer behind those rulers who defer the prayer. He ('Abdullah b. Samit), struck. my thigh that I felt pain and said: I asked Abu Dharr about it, he struck my thigh and said: I asked the Messenger of Allah (may peace be upon him) about it. Upon this he said: Observe prayer at its prescribed time, and treat prayer along with them (along with those Imams who deter prayer) as Nafl. 'Abdullah said: It was narrated to me that the Messenger of Allah (may peace be upon him) struck the thigh of Abd Dharr.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11618",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1958",
      "hadith_no": "1958",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا داود بن رشيد، وإسماعيل بن سالم، جميعا عن هشيم، - قال داود حدثنا هشيم، - أخبرنا منصور، عن قتادة، قال أخبرنا أبو العالية، عن ابن عباس، قال سمعت غير، واحد، من أصحاب رسول الله صلى الله عليه وسلم منهم عمر بن الخطاب وكان أحبهم إلى أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد الفجر حتى تطلع الشمس وبعد العصر حتى تغرب الشمس ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "30415",
        "20468",
        "20468",
        "11067",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3069",
      "hadith_no": "3069",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبي، حدثنا شعبة، عن أيوب، عن أبي العالية، البراء أنه سمع ابن عباس، - رضى الله عنهما - يقول أهل رسول الله صلى الله عليه وسلم بالحج فقدم لأربع مضين من ذي الحجة فصلى الصبح وقال لما صلى الصبح ‏\"‏ من شاء أن يجعلها عمرة فليجعلها عمرة ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) 'is reported to have said:                      The Messenger of Allah (may peace be upon him) put on Ihigm for Hajj. When four days of Dhu'l-Hijja were over, he led the dawn prayer, and when the prayer was complete, he said: He who wants to change it to Umra may do so.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3071",
      "hadith_no": "3071",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا محمد بن الفضل السدوسي، حدثنا وهيب، أخبرنا أيوب، عن أبي العالية البراء، عن ابن عباس، - رضى الله عنهما - قال قدم النبي صلى الله عليه وسلم وأصحابه لأربع خلون من العشر وهم يلبون بالحج فأمرهم أن يجعلوها عمرة ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) came along with his Companions when four days had passed out of ten days (of Dhu'l-Hijja) and they were pronouncing Talbiya for Hajj, and he (the Holy Prophet) commanded them to change (this Ihram) into that of 'Umra.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20283",
        "20299",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3072",
      "hadith_no": "3072",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن أيوب، عن أبي العالية، عن ابن عباس، - رضى الله عنهما - قال صلى رسول الله صلى الله عليه وسلم الصبح بذي طوى وقدم لأربع مضين من ذي الحجة وأمر أصحابه أن يحولوا إحرامهم بعمرة إلا من كان معه الهدى ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) observed the morning prayer at Dhu Tawa (a valley near Mecca) and arrived (in Mecca) when four days of Dhul-Hijja had passed and he commanded his Companions that they should change their Ihram (of Hajj) to that of Umra, except those who had brought sacrificial animals with them.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-6310",
      "hadith_no": "6310",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن قتادة، قال سمعت أبا العالية، يقول حدثني ابن عم، نبيكم صلى الله عليه وسلم - يعني ابن عباس - عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏ ‏.‏ ونسبه إلى أبيه ‏.‏",
      "text_en": " Abu al-Aliya said:                      The son of the uncle of your Prophet (may peace be upon him), i. e. Ibn Abbas, reported Allah's Messenger (may peace be upon him) as saying: It is not meet for a servant that he should say: I am better than Yunus b. Matta (and this Matta) is the name of his father.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11019",
        "11618"
      ]
    },
    {
      "id": "sahih-muslim-7097",
      "hadith_no": "7097",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار وعبيد الله بن سعيد - واللفظ لابن سعيد - قالوا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي العالية، عن ابن عباس، أن نبي الله صلى الله عليه وسلم كان يقول عند الكرب ‏\"‏ لا إله إلا الله العظيم الحليم لا إله إلا الله رب العرش العظيم لا إله إلا الله رب السموات ورب الأرض ورب العرش الكريم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Apostle (may peace be upon him) used to supplicate during the time of trouble (in these words):                     \" There is no god but Allah, the Great, the Tolerant, there is no god but Allah, the Lord of the Magnificent Throne There is no god but Allah, the Lord of the Heaven and the earth, the Lord of the Edifying Throne.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-7100",
      "hadith_no": "7100",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، أخبرني يوسف بن، عبد الله بن الحارث عن أبي العالية، عن ابن عباس، أن النبي صلى الله عليه وسلم كان إذا حزبه أمر قال ‏.‏ فذكر بمثل حديث معاذ عن أبيه وزاد معهن ‏\"‏ لا إله إلا الله رب العرش الكريم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported this hadith through another chain of transmitters with a sliglit variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20214",
        "20021",
        "10728",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-87",
      "hadith_no": "87",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا أبو خلدة، قال سألت أبا العالية عن رجل، أصابته جنابة وليس عنده ماء وعنده نبيذ أيغتسل به قال لا ‏.‏",
      "text_en": " Narrated Abu Khaldah:                     I asked Abu'l-'Aliyah whether a person who is sexually defiled and has no water with him, but he has only nabidh, can wash with it? He replied in the negative.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "11583",
        "11618"
      ]
    },
    {
      "id": "sunan-abi-daud-202",
      "hadith_no": "202",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، وهناد بن السري، وعثمان بن أبي شيبة، عن عبد السلام بن حرب، - وهذا لفظ حديث يحيى - عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يسجد وينام وينفخ ثم يقوم فيصلي ولا يتوضأ ‏.‏ قال فقلت له صليت ولم تتوضأ وقد نمت فقال ‏\"‏ إنما الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ زاد عثمان وهناد ‏\"‏ فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو داود قوله ‏\"‏ الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ هو حديث منكر لم يروه إلا يزيد أبو خالد الدالاني عن قتادة وروى أوله جماعة عن ابن عباس ولم يذكروا شيئا من هذا وقال كان النبي صلى الله عليه وسلم محفوظا وقالت عائشة - رضى الله عنها - قال النبي صلى الله عليه وسلم ‏\"‏ تنام عيناى ولا ينام قلبي ‏\"‏ ‏.‏ وقال شعبة إنما سمع قتادة من أبي العالية أربعة أحاديث حديث يونس بن متى وحديث ابن عمر في الصلاة وحديث القضاة ثلاثة وحديث ابن عباس حدثني رجال مرضيون منهم عمر وأرضاهم عندي عمر ‏.‏ قال أبو داود وذكرت حديث يزيد الدالاني لأحمد بن حنبل فانتهرني استعظاما له وقال ما ليزيد الدالاني يدخل على أصحاب قتادة ولم يعبأ بالحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to prostrate and sleep (in prostration) and produce puffing sounds (during sleep). Then he would stand and pray and would not perform ablution. I said to him: you prayed but did not perform ablution though you slept (in prostration). He replied: Ablution is necessary for one who sleeps while he is lying down. Uthman and Hannad added: For when he lies down, his joints are relaxed.Abu Dawud said: The statement \"ablution is necessary for one who sleeps while one is lying down\" is a munkar (rejected) tradition. It has been narrated only by Yazid Abu Khalid al-Dalani, on the authority of Qatadah. And its earlier part has been narrated by a group (of narrators) from Ibn 'Abbas; they did not mention anything about it. He (Ibn 'Abbas) said: The Prophet (ﷺ) was protected (during his sleep). 'Aishah reported: The Prophet (ﷺ) said: My eyes sleep, but my heart does not sleep. Shu'bah said: Qatadah heard from Abu'l-'Aliyah only four traditions: the tradition about Jonah son of Matthew, the tradition reported by Ibn 'Umar about prayer, the tradition stating that the judges are three, and the tradition narrated by Ibn 'Abbas saying: (This tradition) has been narrated to me by reliable persons ; 'Umar is one of them, and the most reliable of them in my opinion is 'Umar. Abu Dawud said: I asked Ahmad b. Hanbal about the tradition narrated by Yazid al-Dalani. He rebuked me out of respect for him. Then he said: Yazid al-Dalani does not add anything to what has been narrated by the teachers of Qatadah. He did not care of this tradition (due to its weakness).",
      "usc_msa_ref": "",
      "chain": [
        "30020",
        "30480",
        "30203",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1182",
      "hadith_no": "1182",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن الفرات بن خالد أبو مسعود الرازي، أخبرنا محمد بن عبد الله بن أبي جعفر الرازي، عن أبيه، عن أبي جعفر الرازي، قال أبو داود وحدثت عن عمر بن شقيق، حدثنا أبو جعفر الرازي، - وهذا لفظه وهو أتم - عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم وإن النبي صلى الله عليه وسلم صلى بهم فقرأ بسورة من الطول وركع خمس ركعات وسجد سجدتين ثم قام الثانية فقرأ سورة من الطول وركع خمس ركعات وسجد سجدتين ثم جلس كما هو مستقبل القبلة يدعو حتى انجلى كسوفها ‏.‏",
      "text_en": " Narrated Ubayy b. Ka'b:                     An eclipse of the sun took place in the time of the Messenger of Allah (ﷺ).  The Prophet (ﷺ) led them in prayer.  He recited one of the long surahs, bowing five times and prostrating himself twice.  He then stood up for the second rak'ah, recited one of the long surahs, bowed firve times, prostrated himself twice, then sat where he was facing the qiblah and made the supplication till the eclipse was over.",
      "usc_msa_ref": "",
      "chain": [
        "38044",
        "38528",
        "28281",
        "20746",
        "24332",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-1276",
      "hadith_no": "1276",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا أبان، حدثنا قتادة، عن أبي العالية، عن ابن عباس، قال شهد عندي رجال مرضيون فيهم عمر بن الخطاب وأرضاهم عندي عمر أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا صلاة بعد صلاة الصبح حتى تطلع الشمس ولا صلاة بعد صلاة العصر حتى تغرب الشمس ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Some reliable people testified before me, and among them was Umar ibn al-Khattab, and most reliable in my eyes was Umar: The Prophet of Allah (ﷺ) said: There is no prayer after the dawn prayer until the sun rises; and there is no prayer after the 'Asr prayer until the sun sets.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20205",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1414",
      "hadith_no": "1414",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، حدثنا خالد الحذاء، عن رجل، عن أبي العالية، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقول في سجود القرآن بالليل يقول في السجدة مرارا ‏\"‏ سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) prostrated himself at night when reciting the Qur'an. He said repeatedly: My face prostrates itself to Him Who created it and brought forth its hearing and seeing by His might and power.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20208",
        "11282",
        "11618",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1643",
      "hadith_no": "1643",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عاصم، عن أبي العالية، عن ثوبان، قال وكان ثوبان مولى رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تكفل لي أن لا يسأل الناس شيئا وأتكفل له بالجنة ‏\"‏ ‏.‏ فقال ثوبان أنا ‏.‏ فكان لا يسأل أحدا شيئا ‏.‏",
      "text_en": " Thawban, the client of the Messenger of Allah (May peace be upon him), reported him as saying :                      If anyone guarantees me that he will not beg from people, I will guarantee him Paradise.  Thawban said : I (will not beg).  He never asked anyone for anything.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11080",
        "11618",
        "130"
      ]
    },
    {
      "id": "sunan-abi-daud-4669",
      "hadith_no": "4669",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة، عن أبي العالية، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول إني خير من يونس بن متى ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (May peace be upon him) as saying :                      It is not fitting for a servent to say that I (The Prophet) is better than Jonah son of Matta.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4859",
      "hadith_no": "4859",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن حاتم الجرجرائي، وعثمان بن أبي شيبة، - المعنى - أن عبدة بن سليمان، أخبرهم عن الحجاج بن دينار، عن أبي هاشم، عن أبي العالية، عن أبي برزة الأسلمي، قال كان رسول الله صلى الله عليه وسلم يقول بأخرة إذا أراد أن يقوم من المجلس ‏\"‏ سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ فقال رجل يا رسول الله إنك لتقول قولا ما كنت تقوله فيما مضى ‏.‏ قال ‏\"‏ كفارة لما يكون في المجلس ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBarzah al-Aslami:                     When the Messenger of Allah (ﷺ) intended to get up from the assembly he used to say in the last. Glory be to Thee. O Allah, and I begin with praise of Thee, I testify that there is no god but Thou; I ask Thy pardon, and return to Thee in repentance. The man asked: Messenger of Allah! you utter the words now which you did not do in the past? He replied: (This is an) atonement for what takes place in the assembly.",
      "usc_msa_ref": "",
      "chain": [
        "38489",
        "30203",
        "20337",
        "20737",
        "11454",
        "11618",
        "227"
      ]
    },
    {
      "id": "sunan-abi-daud-4908",
      "hadith_no": "4908",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا أبان، ح وحدثنا زيد بن أخزم الطائي، حدثنا بشر بن عمر، حدثنا أبان بن يزيد العطار، حدثنا قتادة، عن أبي العالية، - قال زيد - عن ابن عباس، أن رجلا، لعن الريح - وقال مسلم إن رجلا نازعته الريح رداءه على عهد النبي صلى الله عليه وسلم فلعنها - فقال النبي صلى الله عليه وسلم ‏\"‏ لا تلعنها فإنها مأمورة وإنه من لعن شيئا ليس له بأهل رجعت اللعنة عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man cursed the wind. The narrator Muslim's version has: The wind snatched away a man's cloak during the time of the Prophet (ﷺ) and he cursed it. The Prophet (ﷺ) said: Do not curse it, for it is under command, and if anyone curses a thing undeservedly, the curse returns upon him.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20205",
        "30136",
        "20211",
        "20205",
        "11019",
        "11618",
        "15",
        "17",
        "20285"
      ]
    },
    {
      "id": "jami-al-tirmidhi-77",
      "hadith_no": "77",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن موسى، - كوفي - وهناد ومحمد بن عبيد المحاربي المعنى واحد قالوا حدثنا عبد السلام بن حرب الملائي، عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أنه رأى النبي صلى الله عليه وسلم نام وهو ساجد حتى غط أو نفخ ثم قام يصلي ‏.‏ فقلت يا رسول الله إنك قد نمت قال ‏\"‏ إن الوضوء لا يجب إلا على من نام مضطجعا فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو عيسى وأبو خالد اسمه يزيد بن عبد الرحمن ‏.‏ قال وفي الباب عن عائشة وابن مسعود وأبي هريرة ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     he saw the Prophet sleeping, while in the prostration position, until he snored or snorted. Then he stoodup to pray. So I said: \"O Messenger of Allah! You were sleeping?\" He said: \"Wudu is not required except for sleeping while reclining. For when one reclines, joints relax.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-183",
      "hadith_no": "183",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا منصور، وهو ابن زاذان عن قتادة، قال أخبرنا أبو العالية، عن ابن عباس، قال سمعت غير، واحد، من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب وكان من أحبهم إلى أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد الفجر حتى تطلع الشمس وعن الصلاة بعد العصر حتى تغرب الشمس ‏.‏ قال وفي الباب عن علي وابن مسعود وأبي سعيد وعقبة بن عامر وأبي هريرة وابن عمر وسمرة بن جندب وعبد الله بن عمرو ومعاذ بن عفراء والصنابحي ولم يسمع من النبي صلى الله عليه وسلم وسلمة بن الأكوع وزيد بن ثابت وعائشة وكعب بن مرة وأبي أمامة وعمرو بن عبسة ويعلى بن أمية ومعاوية ‏.‏ قال أبو عيسى حديث ابن عباس عن عمر حديث حسن صحيح ‏.‏ وهو قول أكثر الفقهاء من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أنهم كرهوا الصلاة بعد صلاة الصبح حتى تطلع الشمس وبعد صلاة العصر حتى تغرب الشمس وأما الصلوات الفوائت فلا بأس أن تقضى بعد العصر وبعد الصبح ‏.‏ قال علي بن المديني قال يحيى بن سعيد قال شعبة لم يسمع قتادة من أبي العالية إلا ثلاثة أشياء حديث عمر أن النبي صلى الله عليه وسلم نهى عن الصلاة بعد العصر حتى تغرب الشمس وبعد الصبح حتى تطلع الشمس وحديث ابن عباس عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لأحد أن يقول أنا خير من يونس بن متى ‏\"‏ ‏.‏ وحديث علي ‏\"‏ القضاة ثلاثة ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"I head more than one of the Companions of the Prophet; Umar bin Al-Khattab among, and he was one of the most beloved among them to me - (narrating) that Allah's Messenger prohibited the Salat after Fajr until the sun had risen, and the Salat after Asr until the sun had set.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11067",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-580",
      "hadith_no": "580",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، حدثنا خالد الحذاء، عن أبي العالية، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول في سجود القرآن بالليل ‏\"‏ سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Aisha narrated:                     \"When the Messenger of Allah would prostrate (for recitation of) the Qur'an, he would say: (Sajada wajhiya lilladhi khalaqahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatihi.) (I have prostrated my face to the One Who created it, and made its hearing and vision, though His ability and power.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11282",
        "11618",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1811",
      "hadith_no": "1811",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن حميد، حدثنا زيد بن الحباب، عن أبي خلدة، عن أبي العالية، قال الثوم من طيبات الرزق ‏.‏ وأبو خلدة اسمه خالد بن دينار وهو ثقة عند أهل الحديث وقد أدرك أنس بن مالك وسمع منه وأبو العالية اسمه رفيع هو الرياحي قال عبد الرحمن بن مهدي كان أبو خلدة خيارا مسلما ‏.‏",
      "text_en": " Narrated Abu Khaldah:                     That Abu Al-'Aliyah said: \"garlic is among the good provisions.\" Abu Khaldah's name is Khalid bin Dinar, and he is trustworthy according to the people of Hadith. He saw Anas bin Malik and heard narrations from him. Abu Al-'Aliyah's name is Rufai' and he is Ar-Riyahi. 'Abdur-Rahman bin Mahdi said: \"Abu Khaldah was preferable, reliable.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20650",
        "11618",
        "20033"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2106",
      "hadith_no": "2106",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا زيد بن أخزم الطائي البصري، حدثنا بشر بن عمر، حدثنا أبان بن يزيد، عن قتادة، عن أبي العالية، عن ابن عباس، أن رجلا، لعن الريح عند النبي صلى الله عليه وسلم فقال ‏\"‏ لا تلعن الريح فإنها مأمورة وإنه من لعن شيئا ليس له بأهل رجعت اللعنة عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعلم أحدا أسنده غير بشر بن عمر ‏.‏",
      "text_en": " 'Ibn 'Abbas narrated that a man cursed the wind in the presence of the Prophet, so he said:                     \"Do not curse the wind, for it is merely doing as ordered , and whoever curses something undeservingly, then the curse returns upon him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30136",
        "20211",
        "20205",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3421",
      "hadith_no": "3421",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن الربيع بن أنس، عن أبي العالية، قال حدثني أبى بن كعب، قال لما كان يوم أحد أصيب من الأنصار أربعة وستون رجلا ومن المهاجرين ستة فيهم حمزة فمثلوا بهم فقالت الأنصار لئن أصبنا منهم يوما مثل هذا لنربين عليهم قال فلما كان يوم فتح مكة فأنزل الله ‏(‏ وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين ‏)‏ فقال رجل لا قريش بعد اليوم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كفوا عن القوم إلا أربعة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من حديث أبى بن كعب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"On the Day of Uhud, sixty-four of the Ansar were killed, and six from the Muhajirin, one of whom was Hamzah, and they mutilated them, so the Ansar said: 'If, (in the future) we are able to kill them on a day like this, we would mutilate from among them as twice as they (mutilate from among us).'\" He said: \"So on the day of the Conquest of Makkah, Allah revealed: And if you punish them, then punish them with the like of that with which you were afflicted. But if you have patience, then it is better for those who are patient (16:126). So a man said: 'There shall be no Quraish after today.' But the Messenger of Allah (ﷺ) said: 'Leave the people, except for four.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "28471",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3536",
      "hadith_no": "3536",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن زهير بن محمد، عن رجل، عن أبي العالية، عن أبى بن كعب، قال سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى ‏:‏ ‏(‏ وأرسلناه إلى مائة ألف أو يزيدون ‏)‏ قال ‏\"‏ عشرون ألفا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"I asked the Messenger of Allah (ﷺ) about the saying of Allah, Most High: 'And We sent him to a hundred thousand, or even more (37:147). He said: 'Twenty thousand (more).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20733",
        "20394",
        "11618",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3690",
      "hadith_no": "3690",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو سعد، هو الصغاني عن أبي جعفر الرازي، عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، أن المشركين، قالوا لرسول الله صلى الله عليه وسلم انسب لنا ربك ‏.‏ فأنزل الله ‏:‏ ‏(‏ قل هو الله أحد * الله الصمد ‏)‏ فالصمد الذي لم يلد ولم يولد لأنه ليس شيء يولد إلا سيموت وليس شيء يموت إلا سيورث وإن الله عز وجل لا يموت ولا يورث ‏:‏ ‏(‏ لم يكن له كفوا أحد ‏)‏ قال ‏\"‏ لم يكن له شبيه ولا عدل وليس كمثله شيء ‏\"‏ ‏.‏",
      "text_en": " Abu Al-Aliyah narrated from Ubayy bin Ka’b:                     “The idolaters were saying to the Messenger of Allah: ‘Name the lineage of your Lord for us.’ So Allah, Most High, revealed: Say: “He is Allah, the One. Allah As-Samad.” So As-Samad is ‘the One Who does not beget, nor is He begotten,’ because there is nothing born except it will die, and there is nothing that dies except that it will be inherited from, and verily. Allah, the Mighty and Sublime, does not die, nor is He inherited from. ‘And there is none comparable to Him.’ He said: ‘There is nothing similar to Him, nor equal to Him, nor is there anything like Him.’”",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3691",
      "hadith_no": "3691",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن أبي جعفر الرازي، عن الربيع، عن أبي العالية، أن النبي صلى الله عليه وسلم ذكر آلهتهم فقالوا انسب لنا ربك ‏.‏ قال فأتاه جبريل بهذه السورة ‏:‏ ‏(‏ قل هو الله أحد ‏)‏ ‏.‏ فذكر نحوه ولم يذكر فيه عن أبى بن كعب وهذا أصح من حديث أبي سعد وأبو سعد اسمه محمد بن ميسر وأبو جعفر الرازي اسمه عيسى وأبو العالية اسمه رفيع وكان عبدا أعتقته امرأة صابئة ‏.‏",
      "text_en": " Abu Al-Aliyah narrated:                     “The Prophet mentioned their (the idolater’s) gods, so they said: ‘Then name your Lord’s lineage for us.’” He said: “So Jibril, peace be upon him, came to him with this Surat: Say: “He is Allah, the One.” So he mentioned similarly, but he did not say in it: “From Ubayy bin Ka’b.” And this is more correct than the narration of Abu Sa’eed (no. 3364). Abu Sa’eed’s name is Muhammad bin Muyassar.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20340",
        "20746",
        "11618"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3425-2",
      "hadith_no": "3425",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، حدثنا خالد الحذاء، عن أبي العالية، عن عائشة، قالت كان النبي صلى الله عليه وسلم يقول في سجود القرآن بالليل ‏\"‏ سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated:                     “When the Messenger of Allah would prostrate (for recitation of) the Qur’an, he would say: ‘I have prostrated my face to the One Who created it, and made its hearing and vision, through His ability and power (Sajada Wajhi Lilladhi Khalaqahu Wa Shaqqa Sam’ahu Wa Basarahu Bi Hawli Wa Quwwatih.)’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11282",
        "11618",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3435-2",
      "hadith_no": "3435",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي العالية، عن ابن عباس، أن نبي الله صلى الله عليه وسلم كان يدعو عند الكرب ‏\"‏ لا إله إلا الله العلي الحليم لا إله إلا الله رب العرش العظيم لا إله إلا الله رب السموات والأرض ورب العرش الكريم ‏\"‏ ‏.‏ حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام، عن قتادة، عن أبي العالية، عن ابن عباس، عن النبي صلى الله عليه وسلم بمثله ‏.‏ قال وفي الباب عن علي ‏.‏ قال وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     when he was in distress, the Prophet of Allah would supplicate: “There is none worthy of worship except Allah, the Forbearing, the Wise, there is none worthy of worship except Allah, the Lord of the Magnificent Throne, there is none worthy of worship except Allah, the Lord of the heavens and the earth, and the Lord of the Noble Throne. (La Ilaha Illallah Al-Halimul-Hakim, La Ilaha Illallah, Rabbul-Arshil-Azim, La Ilaha Illallah, Rabbus-Samawati Wal-Ardi Wa Rabbul-Arshil-Karim)”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4209",
      "hadith_no": "4209",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا بشر بن آدم ابن بنت أزهر السمان، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبو خلدة، حدثنا أبو العالية، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ممن أنت ‏\"‏ ‏.‏ قال قلت من دوس ‏.‏ قال ‏\"‏ ما كنت أرى أن في دوس أحدا فيه خير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وأبو خلدة اسمه خالد بن دينار وأبو العالية اسمه رفيع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Prophet (ﷺ) said to me: 'Who are you from?' I said: 'From Daws.' He said: 'I did not think there was anyone from Daws in whom there was good.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30125",
        "20250",
        "11583",
        "11618",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-567",
      "hadith_no": "567",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن منيع، قال حدثنا هشيم، قال أنبأنا منصور، عن قتادة، قال حدثنا أبو العالية، عن ابن عباس، قال سمعت غير، واحد، من أصحاب النبي صلى الله عليه وسلم منهم عمر - وكان من أحبهم إلى - أن رسول الله صلى الله عليه وسلم نهى عن الصلاة بعد الفجر حتى تطلع الشمس وعن الصلاة بعد العصر حتى تغرب الشمس ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"I heard more than one of the Companions of the Prophet (ﷺ) - including 'Umar who was one of the dearest of them to me - that the Messenger of Allah (ﷺ) forbade praying after Fajr until the sun had risen, and praying after 'Asr until the sun had set.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11067",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-778",
      "hadith_no": "778",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا إسماعيل ابن علية، قال حدثنا أيوب، عن أبي العالية البراء، قال أخر زياد الصلاة فأتاني ابن صامت فألقيت له كرسيا فجلس عليه فذكرت له صنع زياد فعض على شفتيه وضرب على فخذي وقال إني سألت أبا ذر كما سألتني فضرب فخذي كما ضربت فخذك وقال إني سألت رسول الله صلى الله عليه وسلم كما سألتني فضرب فخذي كما ضربت فخذك فقال عليه الصلاة والسلام ‏\"‏ صل الصلاة لوقتها فإن أدركت معهم فصل ولا تقل إني صليت فلا أصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Aliyah Al-Barra said:                      \"Ziyad delayed the prayer, then Ibn Samit came to me and I gave him a chair and he sat on it. I told him what Ziyad had done and he bit his lip (in disapproval), and he struck me on the thigh and said: 'I asked Abu Dharr the same question you asked me, and he struck me on the thigh as I struck you on the thigh and said: I asked the Messenger of Allah (ﷺ) the same question as you have asked me and he struck me on the thigh as I have struck you on the thigh and said: Offer the prayer on time, and if you catch up with them, then pray with them, and do not say: 'I have already prayed so I will not pray(now).\"'",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20208",
        "11015",
        "11618"
      ]
    },
    {
      "id": "sunan-an-nasai-859",
      "hadith_no": "859",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، ومحمد بن إبراهيم بن صدران، - واللفظ له - عن خالد بن الحارث، قال حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ahu Dharr said:                      \"The Messenger of A;;ah (ﷺ) said to me, and struck my thigh: 'What will you do if you stay among people who delay the prayer until its time is over?' He said: 'What do you command me to do?' He said: 'Offer the prayer on time, then go about your business, Then if the Iqamah for that prayer is saidand you are in the Masjid, then pray.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "11213",
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1129",
      "hadith_no": "1129",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا سوار بن عبد الله بن سوار القاضي، ومحمد بن بشار، عن عبد الوهاب، قال حدثنا خالد، عن أبي العالية، عن عائشة، أن النبي صلى الله عليه وسلم كان يقول في سجود القرآن بالليل ‏\"‏ سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Prophet (ﷺ) used to say, when he did a prostration that was required when reciting Quran at night: \"Sajada wajhi lilladhi khalaqahu wa sawwarahu wa shaqqa sam'ahu wa basarahu bihawlihi wa quwwatih (My face has prostrated to the One Who created it and formed it, and brought forth its hearing and sight by His power and strength.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11282",
        "11618",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2870",
      "hadith_no": "2870",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا وهيب، قال حدثنا أيوب، عن أبي العالية البراء، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم وأصحابه لصبح رابعة وهم يلبون بالحج فأمرهم رسول الله صلى الله عليه وسلم أن يحلوا ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah and his Companions came on the morning of the fourth day (of Dhul-Hijjah), reciting the Talbiyah for Hajj, and the Messenger of commanded them to exit Ihram\".",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20218",
        "20299",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2871",
      "hadith_no": "2871",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، عن يحيى بن كثير أبو غسان، قال حدثنا شعبة، عن أيوب، عن أبي العالية البراء، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم لأربع مضين من ذي الحجة وقد أهل بالحج فصلى الصبح بالبطحاء وقال ‏\"‏ من شاء أن يجعلها عمرة فليفعل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah came on the fourth day of Dhul-Hijjah having entered Ihram for Hajj. He prayed Subh in Al-Batha and said: 'Whoever wants to make it Umrah, let him do so.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20302",
        "20020",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3057",
      "hadith_no": "3057",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، قال حدثنا ابن علية، قال حدثنا عوف، قال حدثنا زياد بن حصين، عن أبي العالية، قال قال ابن عباس قال لي رسول الله صلى الله عليه وسلم غداة العقبة وهو على راحلته ‏\"‏ هات القط لي ‏\"‏ ‏.‏ فلقطت له حصيات هن حصى الخذف فلما وضعتهن في يده قال بأمثال هؤلاء ‏\"‏ وإياكم والغلو في الدين فإنما أهلك من كان قبلكم الغلو في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Aliyah said:                     \"Ibn Abbas said: \"On the morning of Al-Aqabah, while he was on his mount, the Messenger of Allah said to me: \"Pick up (some pebbles) for me.\" So I picked up some pebbles for him that were the size of date stones or fingertips, and when I placed them in his hand he said: \"Like these. And beware of going to extremes in religious matters, for those who came before you were destroyed because of going to extremes in religious matters.\"",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "20208",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3059",
      "hadith_no": "3059",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، قال حدثنا عوف، قال حدثنا زياد بن حصين، عن أبي العالية، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم غداة العقبة وهو واقف على راحلته ‏\"‏ هات القط لي ‏\"‏ ‏.‏ فلقطت له حصيات هن حصى الخذف فوضعتهن في يده وجعل يقول بهن في يده ووصف يحيى تحريكهن في يده بأمثال هؤلاء ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"On the morning of Al-Aqabah, while he was on his mount, the Messenger of Allh said: 'Pick up (some pebbles) for me.' So P picked up some pebbles for him that were the size of date stones of fingertips, and placed them in his hand. He started to do this with his hand.\" Yahya described him shaking them in his hand like this.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1308",
      "hadith_no": "1308",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا همام، حدثنا قتادة، عن أبي العالية، عن ابن عباس، قال شهد عندي رجال مرضيون فيهم عمر بن الخطاب وأرضاهم عندي عمر أن ر سول الله  صلى الله عليه وسلم  قال ‏\"‏ لا صلاة بعد الفجر حتى تطلع الشمس ولا صلاة بعد العصر حتى تغرب الشمس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Good men among whom was ‘Umarbin Khattab, and the best of them in my view is ‘Umar, testifiedbefore me that the Messenger of Allah (ﷺ) said: ‘There is noprayerafter Fajr until the sun has risen, and there is no prayerafter the‘Asr until the sun has set.’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "30201",
        "30106",
        "20297",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2922",
      "hadith_no": "2922",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا سفيان، عن الأعمش، عن زياد بن الحصين، عن أبي العالية، عن ابن عباس، قال مر النبي صلى الله عليه وسلم بنفر يرمون فقال ‏\"‏ رميا بني إسماعيل فإن أباكم كان راميا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) passed bysomepeople who were shooting (arrows) and said: ‘Shoot, Banu Isma’il,for your father was an archer.’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20012",
        "11060",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3003",
      "hadith_no": "3003",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن داود بن أبي هند، عن أبي العالية، عن ابن عباس، قال كنا مع رسول الله  صلى الله عليه وسلم  بين مكة والمدينة فمررنا بواد فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ قالوا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى  صلى الله عليه وسلم  - فذكر من طول شعره شيئا لا يحفظه داود - واضعا إصبعيه في أذنيه له جؤار إلى الله بالتلبية مارا بهذا الوادي ‏\"‏ ‏.‏ قال ثم سرنا حتى أتينا على ثنية فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى أو لفت ‏.‏ قال ‏\"‏ كأني أنظر إلى يونس على ناقة حمراء عليه جبة صوف وخطام ناقته خلبة مارا بهذا الوادي ملبيا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “We were with the Messenger ofAllah (ﷺ) between Makkah and Al-Madinah, and we passed through avalley. He said: ‘What valley is this?’ They said: ‘AzraqValley.’ Hesaid: ‘It is as if I can see Musa (as) – and hementioned somethingabout the length of his hair, which Dawud (one ofthe narrators) didnot remember – ‘putting his fingers in hisears and raising his voiceto Allah reciting the Talbiyah, passingthrough this valley.’ Then wetraveled on until we came to a narrowpass, and he said: ‘What pass isthis?’ They said: ‘ThaniyyatHarsha’ or ‘Laft.’ He said: ‘It is as ifI can see Yunus, ona red she-camel, wearing a woollen cloak andholding the reins of hisshe-camel, woven from palm fibres, passingthrough this valley,reciting the Talbiyah.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3144",
      "hadith_no": "3144",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن عوف، عن زياد بن الحصين، عن أبي العالية، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  غداة العقبة وهو على ناقته ‏\"‏ القط لي حصى ‏\"‏ ‏.‏ فلقطت له سبع حصيات هن حصى الخذف فجعل ينفضهن في كفه ويقول ‏\"‏ أمثال هؤلاء فارموا ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا أيها الناس إياكم والغلو في الدين فإنما أهلك من كان قبلكم الغلو في الدين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “On the morning of ‘Aqabah,whenhe was atop his she-camel, the Messenger of Allah (ﷺ) said:‘Pickup some pebbles for me.’ So I picked up seven pebbles for him,suitable for Khadhf.* He began to toss them in his hand, saying:‘Throw something like these.’ Then he said: ‘O people, bewareofexaggeration in religious matters for those who came before youweredoomed because of exaggeration in religious matters.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20318",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3883",
      "hadith_no": "3883",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن هشام، صاحب الدستوائي عن قتادة، عن أبي العالية، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يقول عند الكرب ‏\"‏ لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم سبحان الله رب السموات السبع ورب العرش الكريم ‏\"‏ ‏.‏ قال وكيع مرة لا إله إلا الله فيها كلها ‏.‏",
      "text_en": " It was narrated from Ibn ‘Abbas that the Prophet (ﷺ) used to say at times of distress:                      “La ilaha illallahul-Halimul-Karim, Subhan-Allahi Rabbil-‘Arshil-‘Azim, Subhan-Allahi Rabbil-samawatis-sab’i wa Rabbil-‘Arshil-Azim (None has the right to be worshipped but Allah, the Forbearing, the Most Generous; glory is to Allah the Lord of the Mighty Throne; glory is to Allah, the Lord of the seven heavens and the Lord of the Magnificent Throne).”Waki’ said with each wording La ilaha illallahu (none has the right to be worshipped but Allah) is to be included.",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11019",
        "11618",
        "17"
      ]
    }
  ],
  "total_hadiths": 61
}