{
  "id": "11613",
  "name": "Musa bin Nafi', Abu Shahab al-Hanat موسى بن نافع الأسدي أبو شهاب الحناط",
  "full_name": "Musa bin Nafi', Abu Shahab al-Hanat موسى بن نافع الأسدي أبو شهاب الحناط",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  س  -  صدوق ]"
    ],
    "tags": [
      "al-Asadi",
      "al-Hadhli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1468",
      "hadith_no": "1468",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت بعث إلى نسيبة الأنصارية بشاة فأرسلت إلى عائشة  رضى الله عنها  منها فقال النبي صلى الله عليه وسلم ‏\"‏ عندكم شىء ‏\"‏‏.‏ فقلت لا إلا ما أرسلت به نسيبة من تلك الشاة فقال ‏\"‏ هات فقد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     A sheep was sent to me (Nusaiba Al-Ansariya) (in charity) and I sent some of it to `Aisha. The Prophet asked `Aisha for something to eat. `Aisha replied that there was nothing except what Nusaiba Al-Ansariya had sent of that sheep. The Prophet said to her, \"Bring it as it has reached its place.\"",
      "usc_msa_ref": "525",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "id": "sahih-bukhari-1593",
      "hadith_no": "1593",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا أبو شهاب، قال قدمت متمتعا مكة بعمرة فدخلنا قبل التروية بثلاثة أيام، فقال لي أناس من أهل مكة تصير الآن حجتك مكية‏.‏ فدخلت على عطاء أستفتيه فقال حدثني جابر بن عبد الله  رضى الله عنهما  أنه حج مع النبي صلى الله عليه وسلم يوم ساق البدن معه، وقد أهلوا بالحج مفردا، فقال لهم ‏\"‏ أحلوا من إحرامكم بطواف البيت وبين الصفا والمروة، وقصروا ثم أقيموا حلالا، حتى إذا كان يوم التروية فأهلوا بالحج، واجعلوا التي قدمتم بها متعة ‏\"‏‏.‏ فقالوا كيف نجعلها متعة وقد سمينا الحج فقال ‏\"‏ افعلوا ما أمرتكم، فلولا أني سقت الهدى لفعلت مثل الذي أمرتكم، ولكن لا يحل مني حرام حتى يبلغ الهدى محله ‏\"‏‏.‏ ففعلوا‏.‏   قال أبو عبد الله أبو شهاب ليس له مسند إلا هذا",
      "text_en": " Narrated Abu Shihab:                     I left for Mecca for Hajj-at-Tamattu` assuming Ihram for `Umra. I reached Mecca three days before the day of Tarwiya (8th Dhul-Hijja). Some people of Mecca said to me, \"Your Hajj will be like the Hajj performed by the people of Mecca (i.e. you will lose the superiority of assuming Ihram from the Miqat). So I went to `Ata' asking him his view about it. He said, \"Jabir bin `Abdullah narrated to me, 'I performed Hajj with Allah's Apostle on the day when he drove camels with him. The people had assumed Ihram for Hajj-al-Ifrad. The Prophet ordered them to finish their Ihram after Tawaf round the Ka`ba, and between Safa and Marwa and to cut short their hair and then to stay there (in Mecca) as non-Muhrims till the day of Tarwiya (i.e. 8th of Dhul-Hijja) when they would assume Ihram for Hajj and they were ordered to make the Ihram with which they had come as for `Umra only. They asked, 'How can we make it `Umra (Tamattu`) as we have intended to perform Hajj?' The Prophet said, 'Do what I have ordered you. Had I not brought the Hadi with me, I would have done the same, but I cannot finish my Ihram till the Hadi reaches its destination (i.e. is slaughtered).' So, they did (what he ordered them to do).\"",
      "usc_msa_ref": "639",
      "chain": [
        "20348",
        "11613",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-2388",
      "hadith_no": "2388",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الأعمش، عن زيد بن وهب، عن أبي ذر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم فلما أبصر  يعني أحدا  قال ‏\"‏ ما أحب أنه يحول لي ذهبا يمكث عندي منه دينار فوق ثلاث، إلا دينارا أرصده لدين ‏\"‏‏.‏ ثم قال ‏\"‏ إن الأكثرين هم الأقلون، إلا من قال بالمال هكذا وهكذا ‏\"‏‏.‏ وأشار أبو شهاب بين يديه وعن يمينه وعن شماله  وقليل ما هم  وقال مكانك‏.‏ وتقدم غير بعيد، فسمعت صوتا، فأردت أن آتيه، ثم ذكرت قوله مكانك حتى آتيك، فلما جاء قلت يا رسول الله، الذي سمعت أو قال الصوت الذي سمعت قال ‏\"‏ وهل سمعت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أتاني جبريل  عليه السلام  فقال من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن فعل كذا وكذا قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once, while I was in the company of the Prophet, he saw the mountain of Uhud and said, \"I would not like to have this mountain turned into gold for me unless nothing of it, not even a single Dinar remains of it with me for more than three days (i.e. I will spend all of it in Allah's Cause), except that Dinar which I will keep for repaying debts.\" Then he said, \"Those who are rich in this world would have little reward in the Hereafter except those who spend their money here and there (in Allah's Cause), and they are few in number.\" Then he ordered me to stay at my place and went not far away. I heard a voice and intended to go to him but I remembered his order, \"Stay at your place till I return.\" On his return I said, \"O Allah's Apostle! (What was) that noise which I heard?\" He said, \"Did you hear anything?\" I said, \"Yes.\" He said, \"Gabriel came and said to me, 'Whoever amongst your followers dies, worshipping none along with Allah, will enter Paradise.' \" I said, \"Even if he did such-and-such things (i.e. even if he stole or committed illegal sexual intercourse)\" He said, \"Yes.\"",
      "usc_msa_ref": "573",
      "chain": [
        "30184",
        "11613",
        "11060",
        "11341",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-2848",
      "hadith_no": "2848",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال انصرفت من عند النبي صلى الله عليه وسلم، فقال لنا أنا وصاحب لي ‏\"‏ أذنا وأقيما، وليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Al-Huwairith:                     On my departure from the Prophet he said to me and to a friend of mine, \"You two, pronounce the Adhan and the Iqama for the prayer and let the elder of you lead the prayer.\"",
      "usc_msa_ref": "101",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "id": "sahih-bukhari-4344",
      "hadith_no": "4344",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن عاصم، عن عكرمة، عن ابن عباس، قال أقمنا مع النبي صلى الله عليه وسلم في سفر تسع عشرة نقصر الصلاة‏.‏ وقال ابن عباس ونحن نقصر ما بيننا وبين تسع عشرة، فإذا زدنا أتممنا‏.‏",
      "text_en": " Narrated `Ikrima:                     Ibn `Abbas said, \"We stayed for 19 days with Prophet on a journey during which we used to offer shortened prayers.\" Ibn `Abbas added, \"We offer the Qasr prayer (i.e. shortened prayer) If we stay up to 19 days as travelers, But if we stay longer, we offer complete prayers.",
      "usc_msa_ref": "593",
      "chain": [
        "30184",
        "11613",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6381",
      "hadith_no": "6381",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الأعمش، عن عمارة بن عمير، عن الحارث بن سويد، حدثنا عبد الله، حديثين أحدهما عن النبي صلى الله عليه وسلم والآخر عن نفسه، قال ‏\"‏ إن المؤمن يرى ذنوبه كأنه قاعد تحت جبل يخاف أن يقع عليه، وإن الفاجر يرى ذنوبه كذباب مر على أنفه ‏\"‏‏.‏ فقال به هكذا قال أبو شهاب بيده فوق أنفه‏.‏ ثم قال ‏\"‏ لله أفرح بتوبة عبده من رجل نزل منزلا، وبه مهلكة، ومعه راحلته عليها طعامه وشرابه، فوضع رأسه فنام نومة، فاستيقظ وقد ذهبت راحلته، حتى اشتد عليه الحر والعطش أو ما شاء الله، قال أرجع إلى مكاني‏.‏ فرجع فنام نومة، ثم رفع رأسه، فإذا راحلته عنده ‏\"‏‏.‏ تابعه أبو عوانة وجرير عن الأعمش‏.‏ وقال أبو أسامة حدثنا الأعمش حدثنا عمارة سمعت الحارث‏.‏ وقال شعبة وأبو مسلم عن الأعمش عن إبراهيم التيمي عن الحارث بن سويد‏.‏ وقال أبو معاوية حدثنا الأعمش عن عمارة عن الأسود عن عبد الله وعن إبراهيم التيمي عن الحارث بن سويد عن عبد الله‏.‏",
      "text_en": " Narrated Al-Harith bin Suwaid:                     `Abdullah bin Mas`ud related to us two narrations: One from the Prophet and the other from himself, saying: A believer sees his sins as if he were sitting under a mountain which, he is afraid, may fall on him; whereas the wicked person considers his sins as flies passing over his nose and he just drives them away like this.\" Abu Shihab (the sub-narrator) moved his hand over his nose in illustration. (Ibn Mas`ud added): Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than a man who encamps at a place where his life is jeopardized, but he has his riding beast carrying his food and water. He then rests his head and sleeps for a short while and wakes to find his riding beast gone. (He starts looking for it) and suffers from severe heat and thirst or what Allah wished (him to suffer from). He then says, 'I will go back to my place.' He returns and sleeps again, and then (getting up), he raises his head to find his riding beast standing beside him.\"",
      "usc_msa_ref": "320",
      "chain": [
        "30184",
        "11613",
        "11060",
        "11378",
        "11330"
      ]
    },
    {
      "id": "sahih-bukhari-6793",
      "hadith_no": "6793",
      "source": "Sahih Bukhari",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن ابن عون، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أتيته يعني النبي صلى الله عليه وسلم فقال ‏\"‏ ادن ‏\"‏‏.‏ فدنوت فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فدية من صيام أو صدقة أو نسك ‏\"‏‏.‏ وأخبرني ابن عون عن أيوب قال صيام ثلاثة أيام، والنسك شاة، والمساكين ستة‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujra:                     I came to the Prophet and he said to me, \"Come near.\" So I went near to him and he said, \"Are your lice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of fasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting should be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to six poor persons.\"",
      "usc_msa_ref": "699",
      "chain": [
        "30184",
        "11613",
        "11071",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sahih-bukhari-7197",
      "hadith_no": "7197",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن عوف، عن أبي المنهال، قال لما كان ابن زياد ومروان بالشأم، ووثب ابن الزبير بمكة، ووثب القراء بالبصرة، فانطلقت مع أبي إلى أبي برزة الأسلمي حتى دخلنا عليه في داره وهو جالس في ظل علية له من قصب، فجلسنا إليه فأنشأ أبي يستطعمه الحديث فقال يا أبا برزة ألا ترى ما وقع فيه الناس فأول شىء سمعته تكلم به إني احتسبت عند الله أني أصبحت ساخطا على أحياء قريش، إنكم يا معشر العرب كنتم على الحال الذي علمتم من الذلة والقلة والضلالة، وإن الله أنقذكم بالإسلام وبمحمد صلى الله عليه وسلم حتى بلغ بكم ما ترون، وهذه الدنيا التي أفسدت بينكم، إن ذاك الذي بالشأم والله إن يقاتل إلا على الدنيا‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     When Ibn Ziyad and Marwan were in Sham and Ibn Az-Zubair took over the authority in Mecca and Qurra' (the Kharijites) revolted in Basra, I went out with my father to Abu Barza Al-Aslami till we entered upon him in his house while he was sitting in the shade of a room built of cane. So we sat with him and my father started talking to him saying, \"O Abu Barza! Don't you see in what dilemma the people has fallen?\" The first thing heard him saying \"I seek reward from Allah for myself because of being angry and scornful at the Quraish tribe. O you Arabs! You know very well that you were in misery and were few in number and misguided, and that Allah has brought you out of all that with Islam and with Muhammad till He brought you to this state (of prosperity and happiness) which you see now; and it is this worldly wealth and pleasures which has caused mischief to appear among you. The one who is in Sham (i.e., Marwan), by Allah, is not fighting except for the sake of worldly gain: and those who are among you, by Allah, are not fighting except for the sake of worldly gain; and that one who is in Mecca (i.e., Ibn Az-Zubair) by Allah, is not fighting except for the sake of worldly gain.\"",
      "usc_msa_ref": "228",
      "chain": [
        "30184",
        "11613",
        "11298",
        "11290"
      ]
    },
    {
      "id": "sahih-bukhari-7525",
      "hadith_no": "7525",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا عاصم بن يوسف اليربوعي، حدثنا أبو شهاب، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنكم سترون ربكم عيانا ‏\"‏‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     The Prophet said, \"You will definitely see your Lord with your own eyes.\"",
      "usc_msa_ref": "530",
      "chain": [
        "30224",
        "30198",
        "11613",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-3070",
      "hadith_no": "3070",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه إبراهيم بن دينار، حدثنا روح، ح وحدثنا أبو داود المباركي، حدثنا أبو شهاب، ح وحدثنا محمد بن المثنى، حدثنا يحيى بن كثير، كلهم عن شعبة، في هذا الإسناد أما روح ويحيى بن كثير فقالا كما قال نصر أهل رسول الله صلى الله عليه وسلم بالحج ‏.‏ وأما أبو شهاب ففي روايته خرجنا مع رسول الله صلى الله عليه وسلم نهل بالحج ‏.‏ وفي حديثهم جميعا فصلى الصبح بالبطحاء ‏.‏ خلا الجهضمي فإنه لم يقله ‏.‏",
      "text_en": " Rauh and Yahya b. Kathir narrated as Nasr reported that the Messenger of Allah (may peace be upon him) entered into the state of Ihram for Hajj. And in the narration of Abu Shihab (the words are):                      We went out with the Messenger of Allah (may peace be upon him) pronouncing Talbiya for Hajj, And in an the ahadith (narrated in this connection the words are): He led the morning prayer at al-Batha', except al- jahdami who did not make mention of it.",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "20229",
        "30544",
        "11613",
        "30170",
        "20302"
      ]
    },
    {
      "id": "sunan-abi-daud-3329",
      "hadith_no": "3329",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا أبو شهاب، حدثنا ابن عون، عن الشعبي، قال سمعت النعمان بن بشير، - ولا أسمع أحدا بعده يقول - سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحلال بين وإن الحرام بين وبينهما أمور مشتبهات ‏\"‏ ‏.‏ وأحيانا يقول ‏\"‏ مشتبهة ‏\"‏ ‏.‏ ‏\"‏ وسأضرب لكم في ذلك مثلا إن الله حمى حمى وإن حمى الله ما حرم وإنه من يرع حول الحمى يوشك أن يخالطه وإنه من يخالط الريبة يوشك أن يجسر ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Nu'man b. Bashir:                     I heard the Messenger of Allah (ﷺ) say: What is lawful is clear and what is unlawful is clear, but between them are certain doubtful things. I give you an example for this. Allah has a preserve, and Allah's preserve is the things He has declared unlawful. He who pastures (his animals) round the preserve will soon fall into it. He who falls into doubtful things will soon be courageous.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "id": "sunan-abi-daud-3648",
      "hadith_no": "3648",
      "source": "Sunan Abi Da'ud",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن الحذاء، عن أبي المتوكل الناجي، عن أبي سعيد الخدري، قال ما كنا نكتب غير التشهد والقرآن ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                      \"We used not to write anything but the Tasha-hud and the Qur'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-4276",
      "hadith_no": "4276",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن سليمان التيمي، عن أبي مجلز، في قوله ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم ‏}‏ قال هي جزاؤه فإن شاء الله أن يتجاوز عنه فعل ‏.‏",
      "text_en": " About the verse \"If a man kills a believer intentionally\" Abu Mijlaz said:                      This is his recompense. If Allah wishes to disregard him, He may do do.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "11289"
      ]
    },
    {
      "id": "sunan-abi-daud-4337",
      "hadith_no": "4337",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا خلف بن هشام، حدثنا أبو شهاب الحناط، عن العلاء بن المسيب، عن عمرو بن مرة، عن سالم، عن أبي عبيدة، عن ابن مسعود، عن النبي صلى الله عليه وسلم بنحوه زاد ‏\"‏ أو ليضربن الله بقلوب بعضكم على بعض ثم ليلعننكم كما لعنهم ‏\"‏ ‏.‏ قال أبو داود رواه المحاربي عن العلاء بن المسيب عن عبد الله بن عمرو بن مرة عن سالم الأفطس عن أبي عبيدة عن عبد الله رواه خالد الطحان عن العلاء عن عمرو بن مرة عن أبي عبيدة ‏.‏",
      "text_en": " A similar tradition (to the No. 4322) has also been transmitted by Ibn Mas'ud through a different chain of narrators to the same effect. This version adds:                      \"Or Allah will mingle your hearts together and curse you as He cursed them.\"Abu Dawud said: This tradition has been transmitted by al-Muharibi, from al-'Ala bin al-Musayyab, from 'Abd Allah bin 'Amr bin Murrah, from Salim al-Aftas, from Abu Ubaidah, from 'Abd Allah; and it is been transmitted by Khalid al-Tahhan, from al-'Ala, from 'Amr bin Murrah from Abu 'Ubaidah.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "11613",
        "11647",
        "11381",
        "11011",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-4346",
      "hadith_no": "4346",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن مغيرة بن زياد، عن عدي بن عدي، عن النبي صلى الله عليه وسلم نحوه قال ‏\"‏ من شهدها فكرهها كان كمن غاب عنها ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by ‘Adl from the prophet (ﷺ) though a different chain of narrators. This version has :                      He who sees it and disapproves of it will be like him who was not present.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "18721"
      ]
    },
    {
      "id": "sunan-abi-daud-4805",
      "hadith_no": "4805",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، أثنى على رجل عند النبي صلى الله عليه وسلم فقال له ‏\"‏ قطعت عنق صاحبك ‏\"‏ ‏.‏ ثلاث مرات ثم قال ‏\"‏ إذا مدح أحدكم صاحبه لا محالة فليقل إني أحسبه كما يريد أن يقول ولا أزكيه على الله ‏\"‏ ‏.‏",
      "text_en": " ABU BAKRAH SAID THAT WHEN A MAN PRAISED ANOTHER MAN IN HIS FACE IN THE PRESENCE OF THE PROPHET (MAY PEACE BE UPON HIM) SAID :                      YOU HAVE BEHEADED YOUR FRIEND (SAYING IT THREE TIMES). HE THEN SAID : ONE WHO CANNOT HELP EXPRESSING PRAISE OF HIS COMPANION, SHOULD SAY : I CONSIDER HIM SUCH AND SUCH (AS HE INTENDS TO SAY), BUT I DO NOT DECLARE HIM PURE WITH ALLAH.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-5064",
      "hadith_no": "5064",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سعيد بن سليمان، قال حدثنا أبو شهاب، قال حدثنا الأعمش، عن أبي وائل، قال خطبنا ابن مسعود فقال كيف تأمروني أقرأ على قراءة زيد بن ثابت بعد ما قرأت من في رسول الله صلى الله عليه وسلم بضعا وسبعين سورة وإن زيدا مع الغلمان له ذؤابتان ‏.‏",
      "text_en": " It was narrated that Abu Wa'il said:                     \"Ibn Mas'ud addressed us and said: 'How do you want me to recite? According to the recitation of Zaid bin Thabit, when I learned seventy-odd Surahs from the mouth of the Messenger of Allah [SAW] while Zaid was with the other boys with two braids?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30252",
        "11613",
        "11060",
        "11353"
      ]
    }
  ],
  "total_hadiths": 17
}