{
  "id": "11629",
  "name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
  "full_name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Tai'i",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11810",
      "name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11376",
      "name": "'Ali bin Rabi'a bin Nadla al-Walbi علي بن ربيعة بن نضلة الوالبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11648",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25244",
      "name": "Qran bin Tmam al-'Asady al-Walby قران بن تمام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "724",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن أسد، قال أخبرنا الفضل بن موسى، قال أخبرنا سعيد بن عبيد الطائي، عن بشير بن يسار الأنصاري، عن أنس بن مالك، أنه قدم المدينة فقيل له ما أنكرت منا منذ يوم عهدت رسول الله صلى الله عليه وسلم قال ما أنكرت شيئا إلا أنكم لا تقيمون الصفوف‏.‏ وقال عقبة بن عبيد عن بشير بن يسار قدم علينا أنس بن مالك المدينة بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I arrived at Medina and was asked whether I found any change since the days of Allah's Apostle. I said, \"I have not found any change except that you do not stand in alignment in your prayers.\"",
      "chain": [
        "30176",
        "20452",
        "11629",
        "11810",
        "19"
      ]
    },
    {
      "hadith_no": "1291",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو نعيم، حدثنا سعيد بن عبيد، عن علي بن ربيعة، عن المغيرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن كذبا على ليس ككذب على أحد، من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏ سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من نيح عليه يعذب بما نيح عليه ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     I heard the Prophet saying, \"Ascribing false things to me is not like ascribing false things to anyone else. Whosoever tells a lie against me intentionally then surely let him occupy his seat in Hell-Fire.\" I heard the Prophet saying, \"The deceased who is wailed over is tortured for that wailing.\"",
      "chain": [
        "20348",
        "11629",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "5643",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يوسف أبو معشر البراء، قال سمعت سعيد بن عبيد الله، قال حدثني بكر بن عبد الله، أن أنس بن مالك، حدثهم أن الخمر حرمت، والخمر يومئذ البسر والتمر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Alcoholic drinks were prohibited. At that time these drinks used to be prepared from unripe and ripe dates.",
      "chain": [
        "30161",
        "11629",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "6983",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو نعيم، حدثنا سعيد بن عبيد، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها، ووجدوا أحدهم قتيلا، وقالوا للذي وجد فيهم قتلتم صاحبنا‏.‏ قالوا ما قتلنا ولا علمنا قاتلا‏.‏ فانطلقوا إلى النبي صلى الله عليه وسلم فقالوا يا رسول الله انطلقنا إلى خيبر فوجدنا أحدنا قتيلا‏.‏ فقال ‏\"‏ الكبر الكبر ‏\"‏‏.‏ فقال لهم ‏\"‏ تأتون بالبينة على من قتله ‏\"‏‏.‏ قالوا ما لنا بينة‏.‏ قال ‏\"‏ فيحلفون ‏\"‏‏.‏ قالوا لا نرضى بأيمان اليهود‏.‏ فكره رسول الله صلى الله عليه وسلم أن يبطل دمه، فوداه مائة من إبل الصدقة‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     (a man from the Ansar) that a number of people from his tribe went to Khaibar and dispersed, and then they found one of them murdered. They said to the people with whom the corpse had been found, \"You have killed our companion!\" Those people said, \"Neither have we killed him, nor do we know his killer.\" The bereaved group went to the Prophet and said, \"O Allah's Apostle! We went to Khaibar and found one of us murdered.\" The Prophet said, \"Let the older among you come forward and speak.\" Then the Prophet said, to them, \"Bring your proof against the killer.\" They said \"We have no proof.\" The Prophet said, \"Then they (the defendants) will take an oath.\" They said, \"We do not accept the oaths of the Jews.\" Allah's Apostle did not like that the Blood-money of the killed one be lost without compensation, so he paid one-hundred camels out of the camels of Zakat (to the relatives of the deceased) as Diya (Blood-money).",
      "chain": [
        "20348",
        "11629",
        "11810"
      ]
    },
    {
      "hadith_no": "5",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سعيد بن عبيد، حدثنا علي بن ربيعة، قال أتيت المسجد والمغيرة أمير الكوفة قال فقال المغيرة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن كذبا على ليس ككذب على أحد فمن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30212",
        "20331",
        "11629",
        "11376"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سعيد بن عبيد الطائي، ومحمد، بن قيس عن علي بن ربيعة، قال أول من نيح عليه بالكوفة قرظة بن كعب فقال المغيرة بن شعبة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نيح عليه فإنه يعذب بما نيح عليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " 'Ali b. Rabi'a reported that the first one who was lamented upon in Kufa was Qaraza b. Ka'b. Mughira b. Shu'ba said:                      I heard the Messenger of Allah (may peace be upon him) saying: He who is lamented upon would be punished because of the lamentation for him on the Day of judgment.",
      "chain": [
        "30201",
        "20032",
        "11629",
        "11376"
      ]
    },
    {
      "hadith_no": "2202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا مروان، - يعني الفزاري - حدثنا سعيد بن عبيد، الطائي عن علي بن ربيعة، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " This hadith has been narrated from the Apostle of Allah (may peace be upon him) through another chain of transmitters.",
      "chain": [
        "30421",
        "11629",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "4440",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سعيد بن عبيد، حدثنا بشير، بن يسار الأنصاري عن سهل بن أبي حثمة الأنصاري، أنه أخبره أن نفرا منهم انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا ‏.‏ وساق الحديث وقال فيه فكره رسول الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏",
      "text_en": " Bushair b. Yasar al-Ansari reported on the authority of Sahl b. Abu Hathma al-Ansari that some men (of his tribe went to Khaibar, and they were separated from one another, and they found one of them slain. The rest of the hadith is the same. And it was said in this connection:                      Allah's Messenger (may peace be him) did not approve of his blood go waste. He paid blood-wit of one hundred camels of Sadaqa.",
      "chain": [
        "30212",
        "20331",
        "11629",
        "11810"
      ]
    },
    {
      "hadith_no": "1638",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن محمد بن الصباح، حدثنا أبو نعيم، حدثني سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن النبي صلى الله عليه وسلم وداه بمائة من إبل الصدقة - يعني دية الأنصاري الذي قتل بخيبر ‏.‏",
      "text_en": " Basheer b. Yasar said that a man from the Ansar called Sahi b. abu-Hatmah told him that Messenger of Allah (May peace be upon him) gave one Hundred camels to him a blood-wit from among the camels of sadaqah, i.e a blood-wit for the Ansari who was killed at Khaibar.",
      "chain": [
        "30245",
        "20348",
        "11629",
        "11810"
      ]
    },
    {
      "hadith_no": "4523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا الحسن بن محمد بن الصباح الزعفراني، حدثنا أبو نعيم، حدثنا سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا فقالوا للذين وجدوه عندهم قتلتم صاحبنا فقالوا ما قتلناه ولا علمنا قاتلا ‏.‏ فانطلقنا إلى نبي الله صلى الله عليه وسلم قال فقال لهم ‏\"‏ تأتوني بالبينة على من قتل هذا ‏\"‏ ‏.‏ قالوا ما لنا بينة ‏.‏ قال ‏\"‏ فيحلفون لكم ‏\"‏ ‏.‏ قالوا لا نرضى بأيمان اليهود ‏.‏ فكره نبي الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏",
      "text_en": " Narrated Bashir b. Yasar:                     That a man of the Ansar called Sahl b. Abi Hathmah told him that some people of his tribe went to Khaibar and separated there. They found one of them slain. They said to those with whom they had found him: You have killed our friend. They replied: We did not kill him, nor do we know the slayer. We (the people of the slain) then went to the Prophet of Allah (ﷺ). He said to them: Bring proof against the one who has slain him. They replied: We have no proof. He said: Then they will take an oath for you. They said: We do not accept the oaths of the Jews. The Messenger of Allah (ﷺ) did not like no responsibility should be fixed for his blood. So he himself paid his bloodwit consisting of one hundred camels of sadaqah (i.e. camels sent to the Prophet as zakat).",
      "chain": [
        "30245",
        "20348",
        "11629",
        "11810"
      ]
    },
    {
      "hadith_no": "1000",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا قران بن تمام الأسدي، ومروان بن معاوية، ويزيد بن هارون، عن سعيد بن عبيد الطائي، عن علي بن ربيعة الأسدي، قال مات رجل من الأنصار يقال له قرظة بن كعب فنيح عليه فجاء المغيرة بن شعبة فصعد المنبر فحمد الله وأثنى عليه وقال ما بال النوح في الإسلام أما إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نيح عليه عذب بما نيح عليه ‏\"‏ ‏.‏ وفي الباب عن عمر وعلي وأبي موسى وقيس بن عاصم وأبي هريرة وجنادة بن مالك وأنس وأم عطية وسمرة وأبي مالك الأشعري ‏.‏ قال أبو عيسى حديث المغيرة حديث غريب حسن صحيح ‏.‏",
      "text_en": " Ali bin Rabi'ah Al-Asadi said:                     \"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"",
      "chain": [
        "30242",
        "25244",
        "20201",
        "20472",
        "11629",
        "11376"
      ]
    },
    {
      "hadith_no": "1085",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، حدثنا حاتم بن إسماعيل، عن عبد الله بن مسلم بن هرمز، عن محمد، وسعيد، ابنى عبيد عن أبي حاتم المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا جاءكم من ترضون دينه وخلقه فأنكحوه إلا تفعلوا تكن فتنة في الأرض وفساد ‏\"‏ ‏.‏ قالوا يا رسول الله وإن كان فيه قال ‏\"‏ إذا جاءكم من ترضون دينه وخلقه فأنكحوه ‏\"‏ ‏.‏ ثلاث مرات ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو حاتم المزني له صحبة ولا نعرف له عن النبي صلى الله عليه وسلم غير هذا الحديث ‏.‏",
      "text_en": " Abu Hatim Al-Muzani narrated that:                     The Messenger of Allah said: \"When someone whose religion and character you are pleased with comes to you then marry (her to) him. If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad). If you do not do so, then there will be turmoil (Fitnah) in the land and discord (Fasad).\" They said: \"O Messenger of Allah! What if there was something about him?\"He said: \"When someone whose religion and character you are pleased with comes to you then marry him.\" (And he (pbuh) said this) three times.",
      "chain": [
        "11220",
        "20159",
        "20278",
        "11629",
        "3124"
      ]
    },
    {
      "hadith_no": "3540",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري البصري، حدثنا أبو عاصم، حدثنا كثير بن فائد، حدثنا سعيد بن عبيد، قال سمعت بكر بن عبد الله المزني، يقول حدثنا أنس بن مالك، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله يا ابن آدم إنك ما دعوتني ورجوتني غفرت لك على ما كان فيك ولا أبالي يا ابن آدم لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك ولا أبالي يا ابن آدم إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah said:                     “Allah, Blessed is He and Most High, said: ‘O son of Adam! Verily as long as you called upon Me and hoped in Me, I forgave you, despite whatever may have occurred from you, and I did not mind. O son of Adam! Were your sins to reach the clouds of the sky, then you sought forgiveness from Me, I would forgive you, and I would not mind. So son of Adam! If you came to me with sins nearly as great as the earth, and then you met Me not associating anything with Me, I would come to you with forgiveness nearly as great as it.’”",
      "chain": [
        "20241",
        "11629",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "1942",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا عبد الواحد بن واصل، قال حدثنا سعيد بن عبيد الله، وأخوه المغيرة، جميعا عن زياد بن جبير، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu,bah said:                     \"The Messenger of Allah said: The riders should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"'",
      "chain": [
        "30249",
        "11629",
        "11285",
        "166"
      ]
    },
    {
      "hadith_no": "1948",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا سعيد بن عبيد الله، قال سمعت زياد بن جبير، يحدث عن أبيه، عن المغيرة بن شعبة، أنه ذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that:                     the Messenger of Allah said: \"The rider should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"",
      "chain": [
        "34033",
        "20423",
        "11629",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "4719",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا فقالوا للذين وجدوه عندهم قتلتم صاحبنا قالوا ما قتلناه ولا علمنا قاتلا ‏.‏ فانطلقوا إلى نبي الله صلى الله عليه وسلم فقالوا يا نبي الله انطلقنا إلى خيبر فوجدنا أحدنا قتيلا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ فقال لهم ‏\"‏ تأتون بالبينة على من قتل ‏\"‏ ‏.‏ قالوا ما لنا بينة ‏.‏ قال ‏\"‏ فيحلفون لكم ‏\"‏ ‏.‏ قالوا لا نرضى بأيمان اليهود ‏.‏ وكره رسول الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏ خالفهم عمرو بن شعيب ‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Ubaid At-Ta'l from Bushair bin Yasar who said:                     \"A man from among the Ansar who was called Sahl bin Abi Hathmah told him that some of his people went to Khaibar, where they went their separate ways. Then they found one of their numbers slain. They said to those in whose land they found him: 'You killed our companion!' They said: 'We did not kill him and we do not know who killed him.' They went to the prophet of Allah and said: 'O Prophet of Allah, we went to Khaibar and we found one of our number slain.' The Messenger of Allah said:  'Let the elders speak first.' And he said to them: 'Bring proof of the one whom you suspect killed him.' They said: 'We do not have any proof.' He said: \"Then let them swear an oath to you.' They said\" 'We will not accept the oath of the Jews.' The Messenger of Allah did not want his blood to have been shed with no Justice done, so he paid a Diyah of one hundred camels from the Sadaqah.\" 'Amr bin Shu'aib differed with them.",
      "chain": [
        "38022",
        "20348",
        "11629",
        "11810"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا روح بن عبادة، حدثنا سعيد بن عبيد الله بن جبير بن حية، حدثني زياد بن جبير بن حية، سمع المغيرة بن شعبة، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الراكب خلف الجنازة والماشي منها حيث شاء ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah bin Shu’bah said:                      “I heard the Messenger of Allah(ﷺ)say: ‘The rider should travel behind the funeral (procession)but theone who is walking may walk wherever he wants.”",
      "chain": [
        "30160",
        "20229",
        "11629",
        "11285",
        "166"
      ]
    },
    {
      "hadith_no": "1574",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا روح بن عبادة، قال حدثنا سعيد بن عبيد الله بن جبير بن حية، حدثني عمي، زياد بن جبير حدثني أبي جبير بن حية، أنه سمع المغيرة بن شعبة، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " AbuJubair bin Hayyah narrated that he heard Mughirah bin Shu’bahsay:                     “I heard the Messenger of Allah (ﷺ) say: ‘The (funeral) prayershould be offered for a child.’”",
      "chain": [
        "30160",
        "20229",
        "11629",
        "166"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا حجاج، عن سعيد بن عبيد بن زيد بن عقبة، عن أبيه، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ضاع للرجل متاع أو سرق له متاع فوجده في يد رجل يبيعه فهو أحق به ويرجع المشتري على البائع بالثمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah bin Jundub that the Messenger of Allah (ﷺ) said:                     “If a man loses something, or it is stolen from him, and he finds it in the possession of a man who bought it, then he has more right to it, and the one who bought it should ask for his money back from the one who sold it to him.' ”",
      "chain": [
        "38409",
        "20354",
        "20219",
        "11629",
        "394"
      ]
    }
  ],
  "total_hadiths": 19
}