{
  "id": "11626",
  "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
  "full_name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  فق  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11674",
      "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11386",
      "name": "Qays bin Muslim al-Jadli قيس بن مسلم الجدلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11650",
      "name": "Mjz'ah bin Zahr bin al-Aswad مجزأة بن زاهر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "21562",
      "name": "Ibrahim bin 'Abdul Hameed bin Dhy إبراهيم بن عبد الحميد",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4260",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا أبو عوانة، عن رقبة بن مصقلة، عن عون بن أبي جحيفة، عن عبد الرحمن، - يعني ابن سمرة - قال كنت آخذا بيد ابن عمر في طريق من طرق المدينة إذ أتى على رأس منصوب فقال شقي قاتل هذا ‏.‏ فلما مضى قال وما أرى هذا إلا قد شقي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من مشى إلى رجل من أمتي ليقتله فليقل هكذا فالقاتل في النار والمقتول في الجنة ‏\"‏ ‏.‏ قال أبو داود رواه الثوري عن عبد الرحمن بن سمير أو سميرة ورواه ليث بن أبي سليم عن عون عن عبد الرحمن بن سميرة ‏.‏ قال أبو داود قال لي الحسن بن علي حدثنا أبو الوليد - يعني بهذا الحديث - عن أبي عوانة وقال هو في كتابي ابن سبرة وقالوا سمرة وقالوا سميرة هذا كلام أبي الوليد ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     AbdurRahman ibn Samurah said: I was holding the hand of Ibn Umar on one of the ways of Medina. He suddenly came to a hanging head. He said: Unhappy is the one who killed him. When he proceeded, he said: I do not consider him but unfortunate. I heard the Messenger of Allah (ﷺ) say: If anyone goes to a man of my community in order to kill him, he should say in this way, the one who kills will go to Hell and the one who is killed will go to Paradise.Abu Dawud said: Al-Thawri has transmitted it from 'Awn from 'Abd al-Rahman b. Sumair or Sumairah ; and Laith b. Abu Sulaim transmitted it from 'Awn from 'Abd al-Rahman b. Sumairah.Abu Dawud said: Al-Hasan b. 'Ali said to me: Abu al-Walid transmitted this tradition to us from Abu 'Awanah, and said: It (the name Ibn Samurah) is in my notebook Ibn Sabrah. The people also transmitted it as Samurah and Sumairah. These are wordings of Abu al-Walid.",
      "chain": [
        "20296",
        "20469",
        "11626",
        "11383",
        "955"
      ]
    },
    {
      "hadith_no": "4705",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا القعنبي، حدثنا المعتمر، عن أبيه، عن رقبة بن مصقلة، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغلام الذي قتله الخضر طبع كافرا ولو عاش لأرهق أبويه طغيانا وكفرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said :                      The boy whom al-Khidr had killed was created an infidel. Had he lived, he would have moved his parents to rebellion and unbelief.",
      "chain": [
        "20164",
        "20288",
        "11289",
        "11626",
        "11049",
        "11050",
        "17",
        "39"
      ]
    }
  ],
  "total_hadiths": 2
}