{
  "id": "11625",
  "name": "Khalid bin Sa'd al-Kwfy خالد بن سعد الكوفي",
  "full_name": "Khalid bin Sa'd al-Kwfy خالد بن سعد الكوفي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10821",
      "name": "Mjm' bin Yahya bin Yazid مجمع بن يحيى بن يزيد بن جارية",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11331",
      "name": "Habib bin Abi Thabit حبيب بن أبي ثابت قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5749",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا عبيد الله، حدثنا إسرائيل، عن منصور، عن خالد بن سعد، قال خرجنا ومعنا غالب بن أبجر فمرض في الطريق، فقدمنا المدينة وهو مريض، فعاده ابن أبي عتيق فقال لنا عليكم بهذه الحبيبة السوداء، فخذوا منها خمسا أو سبعا فاسحقوها، ثم اقطروها في أنفه بقطرات زيت في هذا الجانب وفي هذا الجانب، فإن عائشة حدثتني أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن هذه الحبة السوداء شفاء من كل داء إلا من السام ‏\"‏‏.‏ قلت وما السام قال الموت‏.‏",
      "text_en": " Narrated Khalid bin Sa`d:                     We went out and Ghalib bin Abjar was accompanying us. He fell ill on the way and when we arrived at Medina he was still sick. Ibn Abi 'Atiq came to visit him and said to us, \"Treat him with black cumin. Take five or seven seeds and crush them (mix the powder with oil) and drop the resulting mixture into both nostrils, for `Aisha has narrated to me that she heard the Prophet saying, 'This black cumin is healing for all diseases except As-Sam.' Aisha said, 'What is As-Sam?' He said, 'Death.\"",
      "chain": [
        "30201",
        "11201",
        "20311",
        "11067",
        "11625"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن منصور، عن خالد بن سعد، عن عائشة، قالت كان النبي صلى الله عليه وسلم يصوم شعبان ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Prophet used to fast Shaban.\" '",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11067",
        "11625",
        "53"
      ]
    },
    {
      "hadith_no": "2363",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن منصور، عن خالد بن سعد، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يتحرى يوم الاثنين والخميس ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to be keen to fast on Mondays and Thursday.\"",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11067",
        "11625",
        "53"
      ]
    },
    {
      "hadith_no": "5703",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسن بن إسماعيل بن سليمان، قال أنبأنا يحيى بن يمان، عن سفيان، عن منصور، عن خالد بن سعد، عن أبي مسعود، قال عطش النبي صلى الله عليه وسلم حول الكعبة فاستسقى فأتي بنبيذ من السقاية فشمه فقطب فقال ‏\"‏ على بذنوب من زمزم ‏\"‏ ‏.‏ فصب عليه ثم شرب فقال رجل أحرام هو يا رسول الله قال ‏\"‏ لا ‏\"‏ ‏.‏ وهذا خبر ضعيف لأن يحيى بن يمان انفرد به دون أصحاب سفيان ويحيى بن يمان لا يحتج بحديثه لسوء حفظه وكثرة خطئه ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Prophet [SAW] became thirsty around the Ka'bah so he called for a drink. Some Nabidh was brought in a water skin and he smelled it and frowned. He said: 'Bring me a bucket of Zamzam (water).' He poured it over it and drank some. A man said: 'Is it unlawful, O Messenger of Allah?' He said: 'No.'\"",
      "chain": [
        "20617",
        "20012",
        "11067",
        "11625",
        "402"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، أنبأنا إسرائيل، عن منصور، عن خالد بن سعد، قال خرجنا ومعنا غالب بن أبجر فمرض في الطريق فقدمنا المدينة وهو مريض فعاده ابن أبي عتيق وقال لنا عليكم بهذه الحبة السوداء فخذوا منها خمسا أو سبعا فاسحقوها ثم اقطروها في أنفه بقطرات زيت في هذا الجانب وفي هذا الجانب فإن عائشة حدثتهم أنها سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن هذه الحبة السوداء شفاء من كل داء إلا أن يكون السام ‏\"‏ ‏.‏ قلت وما السام قال ‏\"‏ الموت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Khalid bin Sa’d said:                      “We went out and with uswasGhalib bin Abjar. He fell sick along the way, and when we came toAl-Madinah he was sick. Ibn Abu ‘Atiq came to visit him and said tous: ‘You should use this black seed. Take five or seven (seeds) andgrind them to a powder, then drop them into his nose with drops ofolive oil, on this side and on this side. For ‘Aishah narrated tothemthat she heard the Messenger of Allah (ﷺ) say: “This blackseed is ahealing for every disease, except the Sam.” I said: “Whatis the Sam?”He said: “Death.”",
      "chain": [
        "30201",
        "11201",
        "20311",
        "11067",
        "11625"
      ]
    }
  ],
  "total_hadiths": 5
}