{
  "id": "11621",
  "name": "Ayoub bin Aa'idh أيوب بن عائذ",
  "full_name": "Ayoub bin Aa'idh أيوب بن عائذ",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Tai'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11386",
      "name": "Qays bin Muslim al-Jadli قيس بن مسلم الجدلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10748",
      "name": "Bkyr bin al-Akhns بكير بن الأخنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20350",
      "name": "al-Qasim bin Malik al-Mzny القاسم بن مالك المزني أبو جعفر الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4389",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عباس بن الوليد، حدثنا عبد الواحد، عن أيوب بن عائذ، حدثنا قيس بن مسلم، قال سمعت طارق بن شهاب، يقول حدثني أبو موسى الأشعري  رضى الله عنه  قال بعثني رسول الله صلى الله عليه وسلم إلى أرض قومي، فجئت ورسول الله صلى الله عليه وسلم منيخ بالأبطح فقال ‏\"‏ أحججت يا عبد الله بن قيس ‏\"‏‏.‏ قلت نعم يا رسول الله‏.‏ قال ‏\"‏ كيف قلت ‏\"‏‏.‏ قال قلت لبيك إهلالا كإهلالك‏.‏ قال ‏\"‏ فهل سقت معك هديا ‏\"‏‏.‏ قلت لم أسق‏.‏ قال ‏\"‏ فطف بالبيت واسع بين الصفا والمروة ثم حل ‏\"‏‏.‏ ففعلت حتى مشطت لي امرأة من نساء بني قيس، ومكثنا بذلك حتى استخلف عمر‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle sent me (as a governor) to the land of my people, and I came while Allah's Apostle was encamping at a place called Al-Abtah. The Prophet said, \"Have you made the intention to perform the Hajj, O `Abdullah bin Qais?\" I replied, \"Yes, O Allah's Apostle!\" He said, \"What did you say?\" I replied, \"I said, 'Labbaik' and expressed the same intention as yours.\" He said, \"Have you driven the Hadi along with you?\" I replied, \"No, I did not drive the Hadi.\" He said, \"So perform the Tawaf of the Ka`ba and then the Sai, between Safa and Marwa and then finish the state of Ihram.\" So I did the same, and one of the women of (the tribe of) Banu-Qais combed my hair. We continued follow in that tradition till the caliphate of `Umar.",
      "chain": [
        "20256",
        "11621",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن القاسم بن مالك، - قال عمرو حدثنا قاسم بن مالك المزني، - حدثنا أيوب بن عائذ الطائي، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال إن الله فرض الصلاة على لسان نبيكم صلى الله عليه وسلم على المسافر ركعتين وعلى المقيم أربعا وفي الخوف ركعة ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Allah has prescribed the prayer by the tongue of your Apostle (may peace be upon him) as two rak'ahs for the traveller, four for the resident, and one in danger.",
      "chain": [
        "30201",
        "20350",
        "11439",
        "11621",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "614",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن أبي زياد القطواني الكوفي، حدثنا عبيد الله بن موسى، حدثنا غالب أبو بشر، عن أيوب بن عائذ الطائي، عن قيس بن مسلم، عن طارق بن شهاب، عن كعب بن عجرة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أعيذك بالله يا كعب بن عجرة من أمراء يكونون من بعدي فمن غشي أبوابهم فصدقهم في كذبهم وأعانهم على ظلمهم فليس مني ولست منه ولا يرد على الحوض ومن غشي أبوابهم أو لم يغش فلم يصدقهم في كذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وسيرد على الحوض يا كعب بن عجرة الصلاة برهان والصوم جنة حصينة والصدقة تطفئ الخطيئة كما يطفئ الماء النار ‏.‏ يا كعب بن عجرة إنه لا يربو لحم نبت من سحت إلا كانت النار أولى به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث عبيد الله بن موسى ‏.‏ وأيوب بن عائذ الطائي يضعف ويقال كان يرى رأى الإرجاء ‏.‏ وسألت محمدا عن هذا الحديث فلم يعرفه إلا من حديث عبيد الله بن موسى واستغربه جدا ‏.‏",
      "text_en": " Ka'b bin Ujrah narrated:                     \"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"",
      "chain": [
        "20340",
        "11621",
        "11386",
        "3680",
        "4052"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرني محمد بن وهب، قال حدثني محمد بن سلمة، قال حدثني أبو عبد الرحيم، قال حدثني زيد، عن أيوب، - وهو ابن عائذ - عن بكير بن الأخنس، عن مجاهد أبي الحجاج، عن ابن عباس، قال فرضت صلاة الحضر على لسان نبيكم صلى الله عليه وسلم أربعا وصلاة السفر ركعتين وصلاة الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The prayer of the resident was enjoined on the tongue of your Prophet (ﷺ), four (rak'ahs), and the prayer of the traveler is two rak'ahs, and the prayer of fear is one rak'ah.\"",
      "chain": [
        "20672",
        "15",
        "11621",
        "10748",
        "17"
      ]
    },
    {
      "hadith_no": "1442",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا يعقوب بن ماهان، قال حدثنا القاسم بن مالك، عن أيوب بن عائذ، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال إن الله عز وجل فرض الصلاة على لسان نبيكم صلى الله عليه وسلم في الحضر أربعا وفي السفر ركعتين وفي الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Allah, the Mighty and Sublime, enjoined the prayer on the tongue of your Prophet (ﷺ): While a resident four (rak'ahs), while traveling two, and at times of fear one.\"",
      "chain": [
        "36690",
        "20350",
        "11621",
        "10748",
        "11028",
        "17"
      ]
    }
  ],
  "total_hadiths": 5
}