{
  "id": "11620",
  "name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
  "full_name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
  "grade": "Follower(Tabi') [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "84",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  س  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Maharbi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5002",
      "name": "Tha'laba bin Zahdam al-Hanzali ( ثعلبة بن زهدم الحنظلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7461",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، سمعا الأسود بن هلال، عن معاذ بن جبل، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن يعبدوه ولا يشركوا به شيئا، أتدري ما حقهم عليه ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     The Prophet said, \"O Mu`adh! Do you know what Allah's Right upon His slaves is?\" I said, \"Allah and His Apostle know best.\" The Prophet said, \"To worship Him (Allah) Alone and to join none in worship with Him (Allah). Do you know what their right upon Him is?\" I replied, \"Allah and His Apostle know best.\" The Prophet said, \"Not to punish them (if they do so).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، أنهما سمعا الأسود بن هلال، يحدث عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن يعبد الله ولا يشرك به شىء - قال - أتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ فقال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that the Messenger of Allah (may peace be upon him) said:                      Mu'adh, do you know the right of Allah over His bondsmen? He (Mu'adh) said: Allah and His Apostle know best. He (the Messenger of Allah) said: That Allah alone should be worshipped and nothing should be associated with Him. He (the Holy Prophet) said: What right have they (bondsmen) upon Him in case they do it? He (Mu'adh) said: Allah and His Apostle know best. He (the Holy Prophet) said: That He would not punish them.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏\"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It is narrated on the authority of Aswad b. Hilal that he heard Mu'adh say this:                      The Messenger of Allah (may peace be upon him) called, me and I replied to him. He (the Holy Prophet) said: Do you know the right of Allah upon the people? and then followed the hadith (mentioned above).",
      "chain": [
        "11278",
        "20320",
        "11371",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، عن أشعث، عن الأسود بن هلال، عن المغيرة بن شعبة، قال بينا أنا مع، رسول الله صلى الله عليه وسلم ذات ليلة إذ نزل فقضى حاجته ثم جاء فصببت عليه من إداوة كانت معي فتوضأ ومسح على خفيه ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      I was with the Messenger of Allah (may peace be upon him) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.",
      "chain": [
        "30399",
        "20327",
        "11324",
        "11620",
        "166"
      ]
    },
    {
      "hadith_no": "1246",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني الأشعث بن سليم، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال كنا مع سعيد بن العاص بطبرستان فقام فقال أيكم صلى مع رسول الله صلى الله عليه وسلم صلاة الخوف فقال حذيفة أنا فصلى بهؤلاء ركعة وبهؤلاء ركعة ولم يقضوا ‏.‏ قال أبو داود وكذا رواه عبيد الله بن عبد الله ومجاهد عن ابن عباس عن النبي صلى الله عليه وسلم وعبد الله بن شقيق عن أبي هريرة عن النبي صلى الله عليه وسلم ويزيد الفقير وأبو موسى - قال أبو داود رجل من التابعين ليس بالأشعري - جميعا عن جابر عن النبي صلى الله عليه وسلم وقد قال بعضهم في حديث يزيد الفقير إنهم قضوا ركعة أخرى ‏.‏ وكذلك رواه سماك الحنفي عن ابن عمر عن النبي صلى الله عليه وسلم وكذلك رواه زيد بن ثابت عن النبي صلى الله عليه وسلم قال فكانت للقوم ركعة ركعة وللنبي صلى الله عليه وسلم ركعتين ‏.‏",
      "text_en": " Narrated Hudhayfah:                     Tha'labah ibn Zahdam said: We accompanied Sa'd ibn al-'As at Tabaristan. He stood and said: Which of you prayed along with the Messenger of Allah (ﷺ) in time of danger? Hudhayfah said: I then he led one section in one rak'ah and the other section in one rak'ah. They did not pray the second rak'ah by themselves.Abu Dawud: This tradition has been transmitted by 'Ubaid Allah b. 'Abd Allah and Mujahid on the authority of Ibn 'Abbas from the Prophet (ﷺ) in like manner. This has also been narrated by 'Abd Allah b. Shaqiq from Abu Hurairah from the Prophet (ﷺ). Yazid al-Faqir and Abu Musa also narrated this tradition from Jabir from the Prophet (ﷺ). Some of the narrators said in the version narrated by Yazid al-Faqir that they completed their second rak'ah. This has also been narrated by Simak al-Hanafi on the authority of Ibn 'Umar from the Prophet (ﷺ) something similar. Zaid b. Thabit also narrated from the Prophet (ﷺ) in like manner. This version adds: The people prayed on rak'ah and the Prophet (ﷺ) prayed two rak'ahs.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "1529",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، قال حدثنا سفيان، عن الأشعث بن أبي الشعثاء، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال كنا مع سعيد بن العاصي بطبرستان ومعنا حذيفة بن اليمان فقال أيكم صلى مع رسول الله صلى الله عليه وسلم صلاة الخوف فقال حذيفة أنا فوصف فقال صلى رسول الله صلى الله عليه وسلم صلاة الخوف بطائفة ركعة صف خلفه وطائفة أخرى بينه وبين العدو فصلى بالطائفة التي تليه ركعة ثم نكص هؤلاء إلى مصاف أولئك وجاء أولئك فصلى بهم ركعة ‏.‏",
      "text_en": " It was narrated that Tha'labah bin Zahdam said:                     \"We were with Sa'eed bin Al-'Asi in Tabaristan, and Hudhaifah bin Al-Yaman was with us. He said: 'Which of you offered the fear prayer with the Messenger of Allah (ﷺ)?' Hudhaifah said: 'I did', and he described it. He said: 'The Messenger of Allah (ﷺ) offered the fear prayer, leading one group who had formed rows behind him in praying one rak'ah, while the other group was between him and the enemy. So he led the group that was near him in praying one rak'ah, then they left and took the place of others, and the others came and he led them in praying one rak'ah.'\"",
      "chain": [
        "30123",
        "20032",
        "20012",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "1530",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني أشعث بن سليم، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال كنا مع سعيد بن العاصي بطبرستان فقال أيكم صلى مع رسول الله صلى الله عليه وسلم صلاة الخوف فقال حذيفة أنا ‏.‏ فقام حذيفة فصف الناس خلفه صفين صفا خلفه وصفا موازي العدو فصلى بالذي خلفه ركعة ثم انصرف هؤلاء إلى مكان هؤلاء وجاء أولئك فصلى بهم ركعة ولم يقضوا ‏.‏",
      "text_en": " It was narrated that Tha'labah bin Zahdam said:                     \"We were with Sa'eed bin Al-'Asi in Tabaristan, and Hudhaifah bin Al-Yaman was with us. He said: 'Which of you offered the fear prayer with the Messenger of Allah (ﷺ)?' Hudhaifah said: 'I did.' So Hudhaifah stood and the people formed two rows behind him, one row behind him and one row facing the enemy. He led those who were behind him in praying one rak'ah, then they went and took the place of the others, and the others came and he led them in praying one rak'ah, and they did not make it up.\"",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، عن سفيان، عن الأشعث، عن الأسود بن هلال، عن ثعلبة بن زهدم، أن عليا، استخلف أبا مسعود على الناس فخرج يوم عيد فقال يا أيها الناس إنه ليس من السنة أن يصلى قبل الإمام ‏.‏",
      "text_en": " It was narrated from Tha'labah bin Zahdam that:                     'Ali appointed Abu Mas'ud over the people, then went out on the day of 'Eid and said: 'O people, it is not part of the sunnah to pray before the imam.'\"",
      "chain": [
        "30313",
        "20033",
        "20012",
        "485",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا أبو كامل، قال حدثنا أبو عوانة، عن عاصم بن بهدلة، عن رجل، عن الأسود بن هلال، عن أبي هريرة، قال أمرني رسول الله صلى الله عليه وسلم بركعتى الضحى وأن لا أنام إلا على وتر وصيام ثلاثة أيام من الشهر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah commanded me to pray two Rakahs of Duha, and not to sleep until I had prayed witr, and to fast here days each month.\"",
      "chain": [
        "30559",
        "20469",
        "11358",
        "11620",
        "13"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن علي بن الحسن، قال سمعت أبي قال، أنبأنا أبو حمزة، عن عاصم، عن الأسود بن هلال، عن أبي هريرة، قال أمرني رسول الله صلى الله عليه وسلم بثلاث بنوم على وتر والغسل يوم الجمعة وصوم ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah enjoyed three things upon me: To sleep after praying Witr, to perform Ghusal on Friday, and to fast three days of each month.\" (Sahih).",
      "chain": [
        "11442",
        "11045",
        "20458",
        "11080",
        "11620",
        "13"
      ]
    },
    {
      "hadith_no": "2406",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا أبو كامل، قال حدثنا أبو عوانة، عن عاصم بن بهدلة، عن رجل، عن الأسود بن هلال، عن أبي هريرة، قال أمرني رسول الله صلى الله عليه وسلم بركعتى الضحى وأن لا أنام إلا على وتر وصيام ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah commanded me to pray two Rakahs of Duah,nt to sleep until after praying Witr and to fast three days of each month. (Sahih).",
      "chain": [
        "30559",
        "20469",
        "11358",
        "11620",
        "13"
      ]
    },
    {
      "hadith_no": "2407",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن رافع، حدثنا أبو النضر، حدثنا أبو معاوية، عن عاصم، عن الأسود بن هلال، عن أبي هريرة، رضى الله عنه قال أمرني رسول الله صلى الله عليه وسلم بنوم على وتر والغسل يوم الجمعة وصيام ثلاثة أيام من كل شهر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah commanded me to sleep after praying Witr, to perform Ghusl on Friday and to fast three days of each month.\" (Sahih).",
      "chain": [
        "30375",
        "20390",
        "20354",
        "11080",
        "11620",
        "13"
      ]
    },
    {
      "hadith_no": "4833",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا بشر بن السري، قال حدثنا سفيان، عن أشعث، عن الأسود بن هلال، عن ثعلبة بن زهدم اليربوعي، قال كان رسول الله صلى الله عليه وسلم يخطب في أناس من الأنصار فقالوا يا رسول الله هؤلاء بنو ثعلبة بن يربوع قتلوا فلانا في الجاهلية ‏.‏ فقال النبي صلى الله عليه وسلم وهتف بصوته ‏\"‏ ألا لا تجني نفس على الأخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tha'labah bin Zahdam said:                     \"some people from Banu Tha'labah came to the Prophet when he was delivering a speech and a man said; \"O Messenger of Allah, these are Banu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet The Prophet said: \"No soul is affected by the sin of another.",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "4834",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا معاوية بن هشام، عن سفيان، عن أشعث بن أبي الشعثاء، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال انتهى قوم من بني ثعلبة إلى النبي صلى الله عليه وسلم وهو يخطب فقال رجل يا رسول الله هؤلاء بنو ثعلبة بن يربوع قتلوا فلانا رجلا من أصحاب النبي صلى الله عليه وسلم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tha'1abah bin Zahdam said:                      \"Some people from Banu Tha'labah came to the Prophet (ﷺ) when he was delivering a speech and a man said: 'O Messenger of Allah, these areBanu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet (ﷺ). The Prophet (ﷺ) said: 'No soul is affected by the sin of another.\"'",
      "chain": [
        "38022",
        "20609",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "hadith_no": "4835",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال أنبأنا شعبة، عن أشعث بن أبي الشعثاء، قال سمعت الأسود بن هلال، يحدث عن رجل، من بني ثعلبة بن يربوع أن ناسا، من بني ثعلبة أتوا النبي صلى الله عليه وسلم فقال رجل يا رسول الله هؤلاء بنو ثعلبة بن يربوع قتلوا فلانا رجلا من أصحاب النبي صلى الله عليه وسلم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ash'ath bin Abi Ash-Sha'tha, said:                     \"I heard Al-Aswad bin Hilal narrate from a man of Banu Tha'labah bin Yarbu' that some people from Banu Tah'labah came to the Prophet and a man said: \"O Messenger of Allah, these are Banu Tha'labah bin Yarbu'who killed so and so' - a man from among the companions of the Prophet. The Prophet said: 'No soul is affected by the sin of another",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11324",
        "11620"
      ]
    },
    {
      "hadith_no": "4836",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو عتاب، قال حدثنا شعبة، عن الأشعث بن سليم، عن الأسود بن هلال، - وكان قد أدرك النبي صلى الله عليه وسلم - عن رجل من بني ثعلبة بن يربوع أن ناسا من بني ثعلبة أصابوا رجلا من أصحاب النبي صلى الله عليه وسلم فقال رجل من أصحاب رسول الله صلى الله عليه وسلم يا رسول الله هؤلاء بنو ثعلبة قتلت فلانا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏ قال شعبة أى لا يؤخذ أحد بأحد والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from Al-Aswad bin Hilal - who met the Prophet - from a man from Banu Tha'labah bin Yarbu, that:                     some people from Banu Tha'labah killed a man from among the companions of the Messenger of Allah. A man from among the companions of the Messenger of the Allah said: \"O Messenger of Allah, these are Banu Tha'labah who killed so and so.\" The Messenger said: \"No soul is affected by the sin of another.\" Shu'bah (one of the narrators) said: \"That means: No soul is responsible for the sin of anothe4r, and Allah knows best.\"",
      "chain": [
        "30002",
        "20020",
        "11324",
        "11620"
      ]
    }
  ],
  "total_hadiths": 16
}