{
  "id": "11623",
  "name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
  "full_name": "al-Hasan bin 'Abdullah al-Arni الحسن بن عبد الله العرني",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5202",
      "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10798",
      "name": "'Ubaid bin Ndlh عبيد بن نضلة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10839",
      "name": "Yahya bin al-Jazar al-Arni يحيى بن الجزار",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10799",
      "name": "Azrh bin 'Abdur Rahman عزرة بن عبد الرحمن بن زرارة الخزاعي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني محمد بن جعفر، حدثنا شعبة، قال وأخبرني  الحكم بن عتيبة، عن الحسن العرني، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم ‏.‏ قال شعبة لما حدثني به الحكم لم أنكره من حديث عبد الملك ‏.‏",
      "text_en": " Sa'id b. Zaid reported:                      I heard Allah's Messenger (may peace be upon him) as saying: Truffles are a kind of blessing and their juice is a medicine for the eyes. Shu'ba said: When Hakam narrated this hadith to me, I did not deem it as a Munkar hadith because of the narration of Abd al-Malik.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11069",
        "11623",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن مطرف، عن الحكم بن عتيبة، عن  الحسن العرني، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن الذي أنزل الله على موسى وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid reported Allal a Messenger (may peace be upon him) as saying:                      Truffles are a kind of 'Manna' which Allah sent down upon Moses and their juice is a medicine for the eyes.",
      "chain": [
        "30123",
        "20028",
        "11395",
        "11069",
        "11623",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "7248",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا غندر، عن شعبة، عن قتادة، عن  عزرة، عن الحسن العرني، عن يحيى بن الجزار، عن عبد الرحمن بن أبي ليلى، عن أبى، بن كعب في قوله عز وجل ‏{‏ ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر‏}‏ قال مصائب الدنيا والروم والبطشة أو الدخان ‏.‏ شعبة الشاك في البطشة أو الدخان ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that the words of Allah, the Exalted and Glorious:                     \" We will, surely, make them taste the lesser punishment before the severer punishment (that haply they may return)\" (xxxii. 21) imply the torments of the world. (victory of) Rome, seizing (of the Meccans), or smoke. And Shalba was in doubt about seizing or smoke.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "20278",
        "20020",
        "11019",
        "10799",
        "11623",
        "10839",
        "11196"
      ]
    },
    {
      "hadith_no": "1940",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال حدثني سلمة بن كهيل، عن الحسن العرني، عن ابن عباس، قال قدمنا رسول الله صلى الله عليه وسلم ليلة المزدلفة أغيلمة بني عبد المطلب على حمرات فجعل يلطح أفخاذنا ويقول ‏\"‏ أبيني لا ترموا الجمرة حتى تطلع الشمس ‏\"‏ ‏.‏ قال أبو داود اللطح الضرب اللين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) sent ahead some boys from Banu AbdulMuttalib on donkeys on the night of al-Muzdalifah. He began to pat our thighs (out of love) and said: O young! boys do not throw pebbles at the jamrah till the sun rises.Abu Dawud said: The Arabic word al-lath means to strike softly.",
      "chain": [
        "28531",
        "20012",
        "11350",
        "11623",
        "17"
      ]
    },
    {
      "hadith_no": "3064",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا سفيان، عن سفيان الثوري، عن سلمة بن كهيل، عن الحسن العرني، عن ابن عباس، قال بعثنا رسول الله صلى الله عليه وسلم أغيلمة بني عبد المطلب على حمرات يلطح أفخاذنا ويقول ‏\"‏ أبيني لا ترموا جمرة العقبة حتى تطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger ofAllah sent us young boys of Banu Abdul-Muttalib on donkeys, stalping our things and saying \"O my sons, do not stone Jamratulal Aqabah until the sun has risen. (Daif)",
      "chain": [
        "20012",
        "20012",
        "11350",
        "11623",
        "17"
      ]
    },
    {
      "hadith_no": "3084",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، عن سلمة بن كهيل، عن الحسن العرني، عن ابن عباس، قال إذا رمى الجمرة فقد حل له كل شىء إلا النساء ‏.‏ قيل والطيب قال أما أنا فقد رأيت رسول الله صلى الله عليه وسلم يتضمخ بالمسك أفطيب هو",
      "text_en": " It was narrated that Ib 'Abbas said:                     \"When (the pilgrim) has stoned hthe Jamrat, everything becomes permissible for him except (intimacy with) women,\" It was said: \"And perfume?\" he said; \"I saw the Messenger of Allah smelling strongly of musk - is it no a perfume?\"",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11350",
        "11623",
        "17"
      ]
    },
    {
      "hadith_no": "5098",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا خلف بن موسى، قال حدثنا أبي، عن قتادة، عن عزرة، عن الحسن العرني، عن يحيى بن الجزار، عن مسروق، أن امرأة، أتت عبد الله بن مسعود فقالت إني امرأة زعراء أيصلح أن أصل في شعري فقال لا ‏.‏ قالت أشىء سمعته من رسول الله صلى الله عليه وسلم أو تجده في كتاب الله قال لا بل سمعته من رسول الله صلى الله عليه وسلم وأجده في كتاب الله ‏.‏ وساق الحديث ‏.‏",
      "text_en": " It was narrated from Masruq that:                     A woman came to 'Abdullah bin Mas'ud and said: \"I am a woman with little hair, is it alright for me to add extensions to my hair?\" He said: \"No.\" She said: \"Is it something that you heard from the Messenger of Allah [SAW] or that you find in the Book of Allah?\" He said: \"No, rather I heard it from the Messenger of Allah [SAW] and I find it in the Book of Allah.\" And he quoted the Hadith.",
      "chain": [
        "38433",
        "11019",
        "10799",
        "11623",
        "10839",
        "11018"
      ]
    },
    {
      "hadith_no": "1006",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا يحيى أبو المعلى، عن الحسن العرني، قال ذكر عند ابن عباس ما يقطع الصلاة فذكروا الكلب والحمار والمرأة فقال ما تقولون في الجدى إن رسول الله  صلى الله عليه وسلم  كان يصلي يوما فذهب جدى يمر بين يديه فبادره رسول الله  صلى الله عليه وسلم  القبلة ‏.‏",
      "text_en": " It wasnarrated that Hasan Al-‘Urani said:                      ‘Mention was made in thepresence of Ibn ‘Abbas about what severs the prayer. They mentionedadog, a donkey and a woman. He said: ‘What do you say about kids(younggoats)? The Messenger of Allah (ﷺ) was performing prayer oneday,when a kid came and wanted to pass in front of him. TheMessenger ofAllah (ﷺ) preceded it toward the Qiblah. (to tightenthe space andprevent it from passing in front of him).’”",
      "chain": [
        "30423",
        "20022",
        "11623"
      ]
    },
    {
      "hadith_no": "3140",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا مسعر، وسفيان، عن سلمة بن كهيل، عن الحسن العرني، عن ابن عباس، قال قدمنا رسول الله  صلى الله عليه وسلم  أغيلمة بني عبد المطلب على حمرات لنا من جمع فجعل يلطح أفخاذنا ويقول ‏\"‏ أبيني لا ترموا الجمرة حتى تطلع الشمس ‏\"‏ ‏.‏ زاد سفيان فيه ‏\"‏ ولا إخال أحدا يرميها حتى تطلع الشمس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “We youngsters from the clan of‘Abdul-Muttalib came to the Messenger of Allah (ﷺ), from Jam’,on donkeys of ours. He started striking our thighs and saying: ‘Omy sons, do not stone the Pillar until the sun rises.’”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20359",
        "20005",
        "11350",
        "11623",
        "17"
      ]
    },
    {
      "hadith_no": "3157",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، ح وحدثنا أبو بكر بن خلاد الباهلي، حدثنا يحيى بن سعيد، ووكيع، وعبد الرحمن بن مهدي، قالوا حدثنا سفيان، عن سلمة بن كهيل، عن الحسن العرني، عن ابن عباس، قال إذا رميتم الجمرة فقد حل لكم كل شىء إلا النساء ‏.‏ فقال له رجل يا ابن عباس والطيب فقال أما أنا فقد رأيت رسول الله  صلى الله عليه وسلم  يضمخ رأسه بالمسك أفطيب ذلك أم لا ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “When you have stoned thePillar,everything becomes permissible to you except your wives. A mansaidto him: ‘O Ibn ‘Abbas, and perfume?’ He said: ‘I saw theMessenger of Allah (ﷺ) perfume his head with musk. Is that perfumeor not?’”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "30357",
        "20031",
        "20032",
        "20033",
        "20005",
        "11350",
        "11623",
        "17"
      ]
    }
  ],
  "total_hadiths": 10
}