{
  "id": "11636",
  "name": "'Abdullah bin Abi al-Safar عبد الله بن أبي السفر",
  "full_name": "'Abdullah bin Abi al-Safar عبد الله بن أبي السفر",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      " al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Kufi",
      "al-Hamdani"
    ]
  },
  "parents": [
    {
      "id": "11348",
      "name": "Sa'id bin Yahmad, Abu al-Safr سعيد بن يحمد أبو السفر الهمداني",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11348",
      "name": "Sa'id bin Yahmad, Abu al-Safr سعيد بن يحمد أبو السفر الهمداني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10658",
      "name": "Mus'ab bin Shayba bin Jbyr مصعب بن شيبة بن جبير بن شيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15008",
      "name": "Arqm bin Shrhbyl al-Awdy أرقم بن شرحبيل الأودي الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11643",
      "name": "'Umar bin Abi Za'id'h عمر بن أبي زائدة الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-10",
      "hadith_no": "10",
      "source": "Sahih Bukhari",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، عن عبد الله بن أبي السفر، وإسماعيل، عن الشعبي، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه ‏\"‏‏.‏ قال أبو عبد الله وقال أبو معاوية حدثنا داود عن عامر قال سمعت عبد الله عن النبي صلى الله عليه وسلم‏.‏ وقال عبد الأعلى عن داود عن عامر عن عبد الله عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Amr:                          The Prophet said, \"A Muslim is the one who avoids harming Muslims with     his tongue and hands. And a Muhajir (emigrant) is the one who gives up     (abandons) all what Allah has forbidden.\"",
      "usc_msa_ref": "9",
      "chain": [
        "20404",
        "20020",
        "11636",
        "20208",
        "11052",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-175",
      "hadith_no": "175",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن ابن أبي السفر، عن الشعبي، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم فقال ‏\"‏ إذا أرسلت كلبك المعلم فقتل فكل، وإذا أكل فلا تأكل، فإنما أمسكه على نفسه ‏\"‏‏.‏ قلت أرسل كلبي فأجد معه كلبا آخر قال ‏\"‏ فلا تأكل، فإنما سميت على كلبك، ولم تسم على كلب آخر ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked the Prophet (about the hunting dogs) and he replied, \"If you let loose (with Allah's name) your tamed dog after a game and it hunts it, you may eat it, but if the dog eats of (that game) then do not eat it because the dog has hunted it for itself.\" I further said, \"Sometimes I send my dog for hunting and find another dog with it. He said, \"Do not eat the game for you have mentioned Allah's name only on sending your dog and not the other dog.\"",
      "usc_msa_ref": "175",
      "chain": [
        "30329",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-2054",
      "hadith_no": "2054",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، قال أخبرني عبد الله بن أبي السفر، عن الشعبي، عن عدي بن حاتم  رضى الله عنه  قال سألت النبي صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصاب بحده فكل، وإذا أصاب بعرضه فلا تأكل، فإنه وقيذ ‏\"‏‏.‏ قلت يا رسول الله أرسل كلبي وأسمي، فأجد معه على الصيد كلبا آخر لم أسم عليه، ولا أدري أيهما أخذ‏.‏ قال ‏\"‏ لا تأكل، إنما سميت على كلبك ولم تسم على الآخر ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked Allah's Apostle about Al Mirad (i.e. a sharp-edged piece of wood or a piece of wood provided with a piece of iron used for hunting). He replied, \"If the game is hit by its sharp edge, eat it, and if it is hit by its broad side, do not eat it, for it has been beaten to death.\" I asked, \"O Allah's Apostle! I release my dog by the name of Allah and find with it at the game, another dog on which I have not mentioned the name of Allah, and I do not know which one of them caught the game.\" Allah's Apostle said (to him), 'Don't eat it as you have mentioned the name of Allah on your dog and not on the other dog.\"",
      "usc_msa_ref": "270",
      "chain": [
        "20296",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-2850",
      "hadith_no": "2850",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن حصين، وابن أبي السفر، عن الشعبي، عن عروة بن الجعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة ‏\"‏‏.‏ قال سليمان عن شعبة عن عروة بن أبي الجعد‏.‏",
      "text_en": " Narrated Urwa bin Ja'd:                     The Prophet () said, \"Good will remain (as a permanent quality) in the foreheads of horses till the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "15097",
        "11636",
        "11052"
      ]
    },
    {
      "id": "sahih-bukhari-5534",
      "hadith_no": "5534",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، قال سمعت عدي بن حاتم  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصبت بحده فكل، فإذا أصاب بعرضه فقتل فإنه وقيذ، فلا تأكل ‏\"‏‏.‏ فقلت أرسل كلبي‏.‏ قال ‏\"‏ إذا أرسلت كلبك وسميت، فكل ‏\"‏‏.‏ قلت فإن أكل قال ‏\"‏ فلا تأكل، فإنه لم يمسك عليك، إنما أمسك على نفسه ‏\"‏‏.‏ قلت أرسل كلبي فأجد معه كلبا آخر‏.‏ قال ‏\"‏ لا تأكل، فإنك إنما سميت على كلبك، ولم تسم على آخر ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked Allah's Apostle about the Mi'rad. He said, \"If you hit the game with its sharp edge, eat it, but if the Mi'rad hits the game with its shaft with a hit by its broad side do not eat it, for it has been beaten to death with a piece of wood. (i.e. unlawful).\" I asked, \"If I let loose my trained hound after a game?\" He said, \"If you let loose your trained hound after game, and mention the name of Allah, then you can eat.\" I said, \"If the hound eats of the game?\" He said \"Then you should not eat of it, for the hound has hunted the game for itself and not for you.\" I said, \"Some times I send my hound and then I find some other hound with it?\" He said \"Don't eat the game, as you have mentioned the Name of Allah on your dog only and not on the other.\"",
      "usc_msa_ref": "385",
      "chain": [
        "20193",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-5544",
      "hadith_no": "5544",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن عدي بن حاتم، قال قلت يا رسول الله إني أرسل كلبي وأسمي فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أرسلت كلبك وسميت، فأخذ فقتل فأكل فلا تأكل، فإنما أمسك على نفسه ‏\"‏‏.‏ قلت إني أرسل كلبي أجد معه كلبا آخر، لا أدري أيهما أخذه‏.‏ فقال ‏\"‏ لا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏‏.‏ وسألته عن صيد المعراض فقال ‏\"‏ إذا أصبت بحده، فكل، وإذا أصبت بعرضه فقتل، فإنه وقيذ، فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I said, \"O Allah's Apostle! I let loose my hound after a game and mention Allah's Name on sending it.\" The Prophet said, \"If you let loose your hound after a game and you mention Allah's Name on sending it and the hound catches and kills the game and eats of it, then you should not eat of it, for it has killed it for itself.\" I said, \"Sometimes when I send my hound after a game, I find another hound along with it and I do not know which of them has caught the game.\" He said, \"You must not eat of it because you have not mentioned, the Name of Allah except on sending your own hound, and you did not mention it on the other hound.\" Then I asked him about the game hunted with a Mi'rad (i.e. a sharp edged piece of wood or a piece of wood provided with a sharp piece of iron used for hunting). He said, \"If the game is killed with its sharp edge, you can eat of it, but if it is killed by its broad side (shaft), you cannot eat of it, for then it is like an animal beaten to death with a piece of wood.\"",
      "usc_msa_ref": "394",
      "chain": [
        "20404",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-5648",
      "hadith_no": "5648",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن ابن عمر، عن عمر، قال الخمر يصنع من خمسة من الزبيب والتمر والحنطة والشعير والعسل‏.‏",
      "text_en": "      Narrated 'Umar:                          \"Alcoholic drinks are prepared from five things, i.e., raisins, dates.     wheat, barley and honey.\"",
      "usc_msa_ref": "494",
      "chain": [
        "30329",
        "20020",
        "11636",
        "11052",
        "18",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-6478",
      "hadith_no": "6478",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا عمر بن أبي زائدة، عن أبي إسحاق، عن عمرو بن ميمون، قال من قال عشرا كان كمن أعتق رقبة من ولد إسماعيل‏.‏ قال عمر بن أبي زائدة وحدثنا عبد الله بن أبي السفر عن الشعبي عن ربيع بن خثيم مثله‏.‏ فقلت للربيع ممن سمعته فقال من عمرو بن ميمون‏.‏ فأتيت عمرو بن ميمون فقلت ممن سمعته فقال من ابن أبي ليلى‏.‏ فأتيت ابن أبي ليلى فقلت ممن سمعته فقال من أبي أيوب الأنصاري يحدثه عن النبي صلى الله عليه وسلم وقال إبراهيم بن يوسف عن أبيه عن أبي إسحاق حدثني عمرو بن ميمون عن عبد الرحمن بن أبي ليلى عن أبي أيوب قوله عن النبي صلى الله عليه وسلم‏.‏     وقال موسى حدثنا وهيب، عن داود، عن عامر، عن عبد الرحمن بن أبي ليلى، عن أبي أيوب، عن النبي صلى الله عليه وسلم‏.‏ وقال إسماعيل عن الشعبي عن الربيع قوله‏.‏ وقال آدم حدثنا شعبة حدثنا عبد الملك بن ميسرة سمعت هلال بن يساف عن الربيع بن خثيم وعمرو بن ميمون عن ابن مسعود قوله‏.‏ وقال الأعمش وحصين عن هلال عن الربيع عن عبد الله قوله‏.‏ ورواه أبو محمد الحضرمي عن أبي أيوب عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted one of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet saying, \"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"",
      "usc_msa_ref": "413",
      "chain": [
        "30351",
        "11643",
        "11049",
        "11382",
        "11643",
        "11636",
        "11052"
      ]
    },
    {
      "id": "sahih-muslim-4884",
      "hadith_no": "4884",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن رافع، حدثنا أبو المنذر، إسماعيل بن عمر حدثنا يونس بن، أبي إسحاق الهمداني حدثنا عبد الله بن أبي السفر، عن عامر، عن عبد الرحمن بن عبد، رب الكعبة الصائدي قال رأيت جماعة عند الكعبة ‏.‏ فذكر نحو حديث الأعمش ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abd Rabb al-Ka'ba as-Sa'idl who said:                      I saw a group of people near the Ka'ba.... Then he narrated the tradition as narrated by A'mash.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20631",
        "11636",
        "11052"
      ]
    },
    {
      "id": "sahih-muslim-5083",
      "hadith_no": "5083",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الله بن، أبي السفر عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصاب بحده فكل وإذا أصاب بعرضه فقتل فإنه وقيذ فلا تأكل ‏\"‏ ‏.‏ وسألت رسول الله صلى الله عليه وسلم عن الكلب فقال ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله فكل فإن أكل منه فلا تأكل فإنه إنما أمسك على نفسه ‏\"‏ ‏.‏ قلت فإن وجدت مع كلبي كلبا آخر فلا أدري أيهما أخذه قال ‏\"‏ فلا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported that he asked the Messenger of Allah (may peace be upon him) about (hunting) with the help of an arrow having a stub end. He said:                      If it strikes (the game) with its point, then eat, but if it strikes flatly and it dies, that is Waqidh (beaten into death), do not eat that. I asked the Messenger of Allah (may peace be upon him) about (hunting with the help of) dogs, whereupon he said. When you send your dog (for hunting) reciting the name of Allah, then eat (the game), but if some part of it is eaten (by the dogs, then do not eat that, for it (your dog) has caught that (the-game) for itself. I (again) said: If I find along with my dog another dog, and do not know which of (the dogs) has caught (the game). then (what should I do)? Thereupon he ('Allah's Messenger) said: Then don't eat that, for you recited the name of Allah on your dog and not on the other one.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-muslim-5084",
      "hadith_no": "5084",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا يحيى بن أيوب، حدثنا ابن علية، قال وأخبرني شعبة، عن عبد الله بن، أبي السفر قال سمعت الشعبي، يقول سمعت عدي بن حاتم، يقول سألت رسول الله صلى الله عليه وسلم عن المعراض ‏.‏ فذكر مثله ‏.‏",
      "text_en": " Adi b. Hatim reported:                      I asked Allah's Messenger (may peace be upon him) about Mi'rad (i. e. hunting with the help of arrow having a stub end, and he stated the same (as we find in the previous hadith).",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20208",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-muslim-5085",
      "hadith_no": "5085",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا غندر، حدثنا شعبة، حدثنا عبد الله بن، أبي السفر وعن ناس، ذكر شعبة عن الشعبي، قال سمعت عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن المعراض ‏.‏ بمثل ذلك ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Adi b. Hatim with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "20278",
        "20020",
        "11636",
        "20020",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-muslim-7062",
      "hadith_no": "7062",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن أبي بكر بن أبي موسى، عن البراء، أن النبي صلى الله عليه وسلم كان إذا أخذ مضجعه قال ‏\"‏ اللهم باسمك أحيا وباسمك أموت ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' reported that whenever Allah's Messenger (may peace be upon him) went to bed, he said:                     \" O Allah, it is with Thine Name that I live and it is with Thine Name that I die.\" And when he got up he used to say:\" Praise is due to Allah, Who gave us life after our death (sleep) and unto Thee is resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11900",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-2854",
      "hadith_no": "2854",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن كثير، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، قال قال عدي بن حاتم سألت النبي صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصاب بحده فكل وإذا أصاب بعرضه فلا تأكل فإنه وقيذ ‏\"‏ ‏.‏ قلت أرسل كلبي ‏.‏ قال ‏\"‏ إذا سميت فكل وإلا فلا تأكل وإن أكل منه فلا تأكل فإنما أمسك لنفسه ‏\"‏ ‏.‏ فقال أرسل كلبي فأجد عليه كلبا آخر فقال ‏\"‏ لا تأكل لأنك إنما سميت على كلبك ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Adi b. Hatim:                     I asked Prophet (ﷺ) about featherless arrow. He said: If it strikes with its end, eat, and if it strikes with the middle part of it, do not eat, for it died by a violent blow. I said: I set off my dog? He replies: If you mention Allah's name, eat, otherwise do not eat. If it eats any of it, do not eat, for it caught for itself. He asked: I set off my dog, and I find with it another dog ? He replied: Do not eat, because you mentioned Allah's name on your dog.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-abi-daud-3420",
      "hadith_no": "3420",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت، عن عمه، أنه مر بقوم فأتوه فقالوا إنك جئت من عند هذا الرجل بخير فارق لنا هذا الرجل ‏.‏ فأتوه برجل معتوه في القيود فرقاه بأم القرآن ثلاثة أيام غدوة وعشية كلما ختمها جمع بزاقه ثم تفل فكأنما أنشط من عقال فأعطوه شيئا فأتى النبي صلى الله عليه وسلم فذكره له فقال النبي صلى الله عليه وسلم ‏\"‏ كل فلعمري لمن أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Kharijah b. al-Salt quoted his paternal uncle as saying that he passed by a clan (of the Arab) who came to him and said:                      You have brought what is good from this man. Then they brought a lunatic in chains. He recited Surat al-Fatihah over him three days, morning and evening. When he finished, he collected his saliva and then spat it out, (he felt relief) as if he were set free from a bond. They gave him something (as wages). He then came to the Prophet (ﷺ) and mentioned it to him. The Messenger of Allah (ﷺ) said: Accept it, for by my life, some accept it for a worthless charm, but you have done so far a genuine one.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "id": "sunan-abi-daud-3897",
      "hadith_no": "3897",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا ابن جعفر، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت، عن عمه، أنه مر - قال - فرقاه بفاتحة الكتاب ثلاثة أيام غدوة وعشية كلما ختمها جمع بزاقه ثم تفل فكأنما أنشط من عقال فأعطوه شيئا فأتى النبي صلى الله عليه وسلم ثم ذكر معنى حديث مسدد ‏.‏",
      "text_en": " Kharijah b. al-Salt quoted his parental uncle as saying that he passed (some people) :                      He recited Surat al-Fatihah over him for three days morning and evening. Whenever he finished it, he collected some of his saliva and spat it out, and he seemed as if he were set free from a bond. They gave him something as payment. He then came to the Prophet (ﷺ). He then transmitted the rest of the tradition to the same effect as Musaddad narrated.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "id": "sunan-abi-daud-3901",
      "hadith_no": "3901",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت التميمي، عن عمه، قال أقبلنا من عند رسول الله صلى الله عليه وسلم فأتينا على حى من العرب فقالوا إنا أنبئنا أنكم جئتم من عند هذا الرجل بخير فهل عندكم من دواء أو رقية فإن عندنا معتوها في القيود قال فقلنا نعم ‏.‏ قال فجاءوا بمعتوه في القيود - قال - فقرأت عليه فاتحة الكتاب ثلاثة أيام غدوة وعشية كلما ختمتها أجمع بزاقي ثم أتفل فكأنما نشط من عقال قال فأعطوني جعلا فقلت لا حتى أسأل رسول الله صلى الله عليه وسلم فقال ‏\"‏ كل فلعمري من أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Alaqah ibn Sahar at-Tamimi:                     We proceeded from the Messenger of Allah (ﷺ) and came to a clan of the Arabs.  They said: We have been told that you have brought what is good from this man. Have you any medicine or a charm, for we have a lunatic in chains?  We said: Yes. Then they brought a lunatic in chains.  He said: I recited Surat al-Fatihah over him for three days, morning and evening. Whenever I finished it, I would collect my saliva and spit it out, and he seemed as if he were set free from a bond. He said: They gave me some payment, but I said: No, not until I ask the Messenger of Allah (ﷺ).  He (the Prophet) said: Accept it, for, by my life, some accept it for a worthless charm, but you have done so for a genuine one.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20173",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "id": "sunan-an-nasai-1919",
      "hadith_no": "1919",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا زكريا، عن الشعبي، قال قال أبو سعيد ح وأخبرنا إبراهيم بن يعقوب بن إسحاق، قال حدثنا أبو زيد، سعيد بن الربيع قال حدثنا شعبة، عن عبد الله بن أبي السفر، قال سمعت الشعبي، يحدث عن أبي سعيد، أن رسول الله صلى الله عليه وسلم مروا عليه بجنازة فقام ‏.‏ وقال عمرو إن رسول الله صلى الله عليه وسلم مرت به جنازة فقام ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that a funeral passed by the Messenger of Allah and he stood up. (One of the narrators) 'Amr said:                     \"If a funeral passed by the Messenger of Allah he would stand up.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11338",
        "11052",
        "38",
        "38088",
        "20231",
        "20020",
        "11636",
        "11052",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-3042",
      "hadith_no": "3042",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن عبد الله بن أبي السفر، قال سمعت الشعبي، يقول حدثني عروة بن مضرس بن أوس بن حارثة بن لأم، قال أتيت النبي صلى الله عليه وسلم بجمع فقلت هل لي من حج فقال ‏\"‏ من صلى هذه الصلاة معنا ووقف هذا الموقف حتى يفيض وأفاض قبل ذلك من عرفات ليلا أو نهارا فقد تم حجه وقضى تفثه ‏\"‏ ‏.‏",
      "text_en": " Urwah bin Mudarris bin Aws bin Harithah bin La'm said:                     \"I came to the Prophet in Jam (Al-Muzdalifah) and said: 'Is there Hajj for me?' He said: 'Whoever offers this prayer with us and observed this standing until he departed, and he departed before that from Arafat by night or by day, then his Hajj is complete. And he has completed the prescribed duties.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11636",
        "11052",
        "4068"
      ]
    },
    {
      "id": "sunan-an-nasai-3576",
      "hadith_no": "3576",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا محمد بن جعفر، قال أنبأنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن عروة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الخيل معقود في نواصيها الخير إلى يوم القيامة الأجر والمغنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Urwah said that he heard the Messenger of Allah say:                      \"Goodness is tied to the forelocks of horses until the Day of Resurrection: Reward and spoils of war.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20173",
        "20020",
        "11636",
        "11052",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-4272",
      "hadith_no": "4272",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا سليمان بن عبيد الله بن عمرو الغيلاني البصري، قال حدثنا بهز، قال حدثنا شعبة، قال حدثنا عبد الله بن أبي السفر، عن عامر الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم قلت أرسل كلبي ‏.‏ قال ‏\"‏ إذا أرسلت كلبك فسميت فكل وإن أكل منه فلا تأكل فإنما أمسك على نفسه وإذا أرسلت كلبك فوجدت معه غيره فلا تأكل فإنك إنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I asked the Messenger of Allah: 'I release my dog. He said: 'If you release your dog and mention the name of Allah, then eat. But it he has eaten some of it, the do not eats, for the caught it for himself. If you release your dog then you find another dog with it, then do not eat, for you said the name of Allah over your dog, and not over any other.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4273",
      "hadith_no": "4273",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو داود، عن شعبة، عن ابن أبي السفر، عن الشعبي، وعن الحكم، عن الشعبي، وعن سعيد بن مسروق، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم قلت أرسل كلبي فأجد مع كلبي كلبا آخر لا أدري أيهما أخذ قال ‏\"‏ لا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I asked the Messenger of Allah: 'I release my dog, and I find another dog with mine, and I do not know which mine, and I do not know which of them caught (the game).' He said: 'do not eat it, for you said the name of Allah over your dog, but not over any other.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20547",
        "20020",
        "11636",
        "11052",
        "11069",
        "11052",
        "20016",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4306",
      "hadith_no": "4306",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال حدثنا عبد الله بن أبي السفر، عن الشعبي، قال سمعت عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصاب بحده فكل وإذا أصاب بعرضه فقتل فإنه وقيذ فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ash-Sha bi said:                     \" I heard 'Adiyy bin Hatim say: 'I asked the Messenger of Allah about the Mirad and he said: \"If the sharp point hits 9the game) then eat, bu8t if the broad edge of it hits it, and it is killed, then it has been killed by a blow, so do not eat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20173",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-ibn-majah-27",
      "hadith_no": "27",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو النضر، عن شعبة، عن عبد الله بن أبي السفر، قال سمعت الشعبي، يقول جالست ابن عمر سنة فما سمعته يحدث، عن رسول الله  صلى الله عليه وسلم  شيئا ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abu Safar said:                     \"I heard Ash-Sha'bi saying: 'I sat with Ibn 'Umar for a year and I did not hear him narrate anything from the Messenger of Allah (ﷺ)\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20390",
        "20020",
        "11636",
        "11052"
      ]
    }
  ],
  "total_hadiths": 24
}