{
  "id": "11638",
  "name": "'Abdur Rahman bin 'Abis al-Nakha'i عبد الرحمن بن عابس النخعي",
  "full_name": "'Abdur Rahman bin 'Abis al-Nakha'i عبد الرحمن بن عابس النخعي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "119",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "11357",
      "name": "'Abis bin Rabi'a al-Nakha'i عابس بن ربيعة النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "19454",
      "name": "Asma'a bint 'Abis bin Rabi'a أسماء بنت عابس بن ربيعة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11357",
      "name": "'Abis bin Rabi'a al-Nakha'i عابس بن ربيعة النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5395",
      "name": "Umm Y'aqub ( أم يعقوب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-863",
      "hadith_no": "863",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، حدثني عبد الرحمن بن عابس، سمعت ابن عباس  رضى الله عنهما  قال له رجل شهدت الخروج مع رسول الله صلى الله عليه وسلم قال نعم، ولولا مكاني منه ما شهدته  يعني من صغره  أتى العلم الذي عند دار كثير بن الصلت، ثم خطب ثم أتى النساء فوعظهن وذكرهن وأمرهن أن يتصدقن فجعلت المرأة تهوي بيدها إلى حلقها تلقي في ثوب بلال، ثم أتى هو وبلال البيت‏.‏",
      "text_en": " Narrated `Abdur Rahman bin `Abis:                     A person asked Ibn `Abbas, \"Have you ever presented yourself at the (`Id) prayer with Allah's Apostle?\" He replied, \"Yes.\" And had it not been for my kinship (position) with the Prophet it would not have been possible for me to do so (for he was too young). The Prophet went to the mark near the house of Kathir bin As-Salt and delivered a sermon. He then went towards the women. He advised and reminded them and asked them to give alms. So the woman would bring her hand near her neck and take off her necklace and put it in the garment of Bilal. Then the Prophet and Bilal came to the house.\"",
      "usc_msa_ref": "822",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11638",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-977",
      "hadith_no": "977",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني عبد الرحمن بن عابس، قال سمعت ابن عباس، قيل له أشهدت العيد مع النبي صلى الله عليه وسلم قال نعم، ولولا مكاني من الصغر ما شهدته، حتى أتى العلم الذي عند دار كثير بن الصلت فصلى ثم خطب ثم أتى النساء، ومعه بلال، فوعظهن وذكرهن، وأمرهن بالصدقة، فرأيتهن يهوين بأيديهن يقذفنه في ثوب بلال، ثم انطلق هو وبلال إلى بيته‏.‏",
      "text_en": " Narrated `Abdur Rahman bin `Abis:                     Ibn `Abbas was asked whether he had joined the Prophet in the `Id prayer. He said, \"Yes. And I could not have joined him had I not been young. (The Prophet came out) till he reached the mark which was near the house of Kathir bin As-Salt, offered the prayer, delivered the Khutba and then went towards the women. Bilal was accompanying him. He preached to them and advised them and ordered them to give alms. I saw the women putting their ornaments with their outstretched hands into Bilal's garment. Then the Prophet along with Bilal returned home.",
      "usc_msa_ref": "94",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11638"
      ]
    },
    {
      "id": "sahih-bukhari-4982",
      "hadith_no": "4982",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عبد الرحمن بن عابس، قال سمعت ابن عباس، إنها ترمي بشرر كالقصر قال كنا نرفع الخشب بقصر ثلاثة أذرع أو أقل، فنرفعه للشتاء فنسميه القصر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (as regards the explanation of Hadith 454). 'Indeed, it (Hell) throws about sparks (huge) as Forts.' We used to collect wood in the form of logs, three cubits long or shorter. for heating purposes in winter., and we used to call such wood, the Qasr.",
      "usc_msa_ref": "455",
      "chain": [
        "28531",
        "20012",
        "11638"
      ]
    },
    {
      "id": "sahih-bukhari-4983",
      "hadith_no": "4983",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، أخبرنا سفيان، حدثني عبد الرحمن بن عابس، سمعت ابن عباس  رضى الله عنهما  ‏{‏ترمي بشرر‏}‏ كنا نعمد إلى الخشبة ثلاثة أذرع وفوق ذلك، فنرفعه للشتاء فنسميه القصر‏.‏ ‏{‏كأنه جمالات صفر‏}‏ حبال السفن تجمع حتى تكون كأوساط الرجال‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11638",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5304",
      "hadith_no": "5304",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا سفيان، عن عبد الرحمن بن عابس، سمعت ابن عباس  رضى الله عنهما  سأله رجل شهدت مع رسول الله صلى الله عليه وسلم العيد أضحى أو فطرا قال نعم لولا مكاني منه ما شهدته  يعني من صغره  قال خرج رسول الله صلى الله عليه وسلم فصلى ثم خطب، ولم يذكر أذانا ولا إقامة، ثم أتى النساء فوعظهن وذكرهن وأمرهن بالصدقة، فرأيتهن يهوين إلى آذانهن وحلوقهن يدفعن إلى بلال، ثم ارتفع هو وبلال إلى بيته‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Abis:                     I heard Ibn `Abbas answering a man who asked him, \"Did you attend the prayer of `Id al Adha or `Idal- Fitr with Allah's Apostle?\" Ibn `Abbas replied, \"Yes, and had it not been for my close relationship with him, I could not have offered it.\" (That was because of his young age). Ibn `Abbas further said, Allah's Apostle went out and offered the Id prayer and then delivered the sermon.\" Ibn `Abbas did not mention anything about the Adhan (the call for prayer) or the Iqama. He added, \"Then the Prophet went to the women and instructed them and gave them religious advice and ordered them to give alms and I saw them reaching out (their hands to) their ears and necks (to take off the earrings and necklaces, etc.) and throwing (it) towards Bilal. Then the Prophet returned with Bilal to his house . \"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "20012",
        "11638",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5478",
      "hadith_no": "5478",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن عبد الرحمن بن عابس، عن أبيه، قال قلت لعائشة أنهى النبي صلى الله عليه وسلم أن تؤكل لحوم الأضاحي فوق ثلاث قالت ما فعله إلا في عام جاع الناس فيه، فأراد أن يطعم الغني الفقير، وإن كنا لنرفع الكراع فنأكله بعد خمس عشرة‏.‏ قيل ما اضطركم إليه فضحكت قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر مأدوم ثلاثة أيام حتى لحق بالله‏.‏ وقال ابن كثير أخبرنا سفيان حدثنا عبد الرحمن بن عابس بهذا‏.‏",
      "text_en": " Narrated `Abis:                     I asked `Aisha \"Did the Prophet forbid eating the meat of sacrifices offered on `Id-ul-Adha for more than three days\" She said, \"The Prophet did not do this except in the year when the people were hungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to eat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The family of Muhammad did not eat to their satisfaction white bread with meat soup for three successive days till he met Allah.\"",
      "usc_msa_ref": "334",
      "chain": [
        "20191",
        "20012",
        "11638",
        "11357"
      ]
    },
    {
      "id": "sahih-bukhari-5493",
      "hadith_no": "5493",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة  رضى الله عنها  قالت ما فعله إلا في عام جاع الناس، أراد أن يطعم الغني الفقير، وإن كنا لنرفع الكراع بعد خمس عشرة، وما شبع آل محمد صلى الله عليه وسلم من خبز بر مأدوم ثلاثا‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet did not do that (i.e., forbade the storage of the meat of sacrifices for three days) except (he did so) so that the rich would feed the poor. But later we used to keep even trotters to cook, fifteen days later. The family of Muhammad did not eat wheat bread with meat or soup to their satisfaction for three successive days.",
      "usc_msa_ref": "349",
      "chain": [
        "20351",
        "20012",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6768",
      "hadith_no": "6768",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة  رضى الله عنها  قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر مأدوم ثلاثة أيام حتى لحق بالله‏.‏",
      "text_en": " Narrated `Aisha:                     The family of (the Prophet) Muhammad never ate wheat-bread with meat for three consecutive days to their fill, till he met Allah.",
      "usc_msa_ref": "678",
      "chain": [
        "30388",
        "20005",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-7411",
      "hadith_no": "7411",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عبد الرحمن بن عابس، قال سئل ابن عباس أشهدت العيد مع النبي صلى الله عليه وسلم قال نعم ولولا منزلتي منه ما شهدته من الصغر، فأتى العلم الذي عند دار كثير بن الصلت فصلى ثم خطب، ولم يذكر أذانا ولا إقامة، ثم أمر بالصدقة فجعل النساء يشرن إلى آذانهن وحلوقهن، فأمر بلالا فأتاهن، ثم رجع إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Abis:                     Ibn `Abbas was asked, \"Did you offer the Id prayer with the Prophet?\" He said, \"Yes, had it not been for my close relation to the Prophet, I would not have performed it (with him) because of my being too young The Prophet came to the mark which is near the home of Kathir bin As-Salt and offered the Id prayer and then delivered the sermon. I do not remember if any Adhan or Iqama were pronounced for the prayer. Then the Prophet ordered (the women) to give alms, and they started stretching out their hands towards their ears and throats (giving their ornaments in charity), and the Prophet ordered Bilal to go to them (to collect the alms), and then Bilal returned to the Prophet.",
      "usc_msa_ref": "426",
      "chain": [
        "28531",
        "20012",
        "11638"
      ]
    },
    {
      "id": "sahih-muslim-7636",
      "hadith_no": "7636",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة، قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر فوق ثلاث ‏.‏",
      "text_en": " 'A'isha reported:                      Never could the family of Muhammad (may peace be upon him) (afford to cat to the fill) the bread of wheat beyond three days (successively).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-553",
      "hadith_no": "553",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا سفيان، عن عبد الرحمن بن عابس، عن عبد الرحمن بن أبي ليلى، عن ابن أم مكتوم، قال يا رسول الله إن المدينة كثيرة الهوام والسباع ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أتسمع حى على الصلاة حى على الفلاح فحى هلا ‏\"‏ ‏.‏ قال أبو داود وكذا رواه القاسم الجرمي عن سفيان ليس في حديثه ‏\"‏ حى هلا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn Umm Maktum:                     Messenger of Allah, there are many venomous creatures and wild beasts in Medina (so allow me to pray in my house because I am blind). The Prophet (ﷺ) said: Do you hear the call, \"Come to prayer,\" \"Come to salvation\"? (He said: Yes.) Then you must come.Abu Dawud said: Al-Qasim al-Jarmi has narrated this tradition from Sufyan in a similar manner. But his version does not contain the words \"Then you must come.\"",
      "usc_msa_ref": "",
      "chain": [
        "38673",
        "20005",
        "11638",
        "11196"
      ]
    },
    {
      "id": "sunan-abi-daud-1146",
      "hadith_no": "1146",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عبد الرحمن بن عابس، قال سأل رجل ابن عباس أشهدت العيد مع رسول الله صلى الله عليه وسلم قال نعم ولولا منزلتي منه ما شهدته من الصغر فأتى رسول الله صلى الله عليه وسلم العلم الذي عند دار كثير بن الصلت فصلى ثم خطب ولم يذكر أذانا ولا إقامة قال ثم أمر بالصدقة - قال - فجعل النساء يشرن إلى آذانهن وحلوقهن قال فأمر بلالا فأتاهن ثم رجع إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abd al-Rahman b. 'Abis said:                      A man asked Ibb 'Abbas: Have you been present along with the Messenger of Allah (ﷺ) ? He replied: Yes. Had there been no dignity for me in his eyes, I would not have been present with him due to my minority. Then the Messenger of Allah (ﷺ) came to the point that was near the house of Kathir b. al-Salt. He prayed and afterwards preached. He (Ibn 'Abbas) did not mention the adhan (call to prayer) and the iqamah. He then commanded to give alms. The women began to point to their ears and throats (to give their jewelry in alms).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11638"
      ]
    },
    {
      "id": "sunan-abi-daud-2374",
      "hadith_no": "2374",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن عبد الرحمن بن عابس، عن عبد الرحمن بن أبي ليلى، حدثني رجل، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم نهى عن الحجامة والمواصلة ولم يحرمهما إبقاء على أصحابه فقيل له يا رسول الله إنك تواصل إلى السحر ‏.‏ فقال ‏\"‏ إني أواصل إلى السحر وربي يطعمني ويسقيني ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Abi Laila:                     A man from the Companions of the Prophet (ﷺ) told me that the Messenger of Allah (ﷺ) prohibited cupping and perpetual fasting, but he had not made them unlawful showing mercy on his Companions. Thereupon he was asked: Messenger of Allah, you observe perpetual fast till dawn. He replied: I observe perpetual fast till dawn (for) my Lord gives me food and drink.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20033",
        "20012",
        "11638",
        "11196"
      ]
    },
    {
      "id": "sunan-an-nasai-851",
      "hadith_no": "851",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن زيد بن أبي الزرقاء، قال حدثنا أبي قال، حدثنا سفيان، ح وأخبرني عبد الله بن محمد بن إسحاق، قال حدثنا قاسم بن يزيد، قال حدثنا سفيان، عن عبد الرحمن بن عابس، عن عبد الرحمن بن أبي ليلى، عن ابن أم مكتوم، أنه قال يا رسول الله إن المدينة كثيرة الهوام والسباع ‏.‏ قال ‏\"‏ هل تسمع حى على الصلاة حى على الفلاح ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فحى هلا ‏\"‏ ‏.‏ ولم يرخص له ‏.‏",
      "text_en": " It was narrated from Ibn Umm Maktum that he said:                      \"0 Messenger of Allah (ﷺ), there are many (dangerous) pests and wild animals in Al-Madinah.\" He said: \"Can you hear (the words) 'Come prayer, come to prosperity'?\" He said \"Yes.\" He said: \"Then be quick to respond,\" and he did not grant him a dispensation.",
      "usc_msa_ref": "",
      "chain": [
        "38673",
        "20005",
        "20005",
        "11638",
        "11196"
      ]
    },
    {
      "id": "sunan-an-nasai-1586",
      "hadith_no": "1586",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثنا عبد الرحمن بن عابس، قال سمعت ابن عباس، قال له رجل شهدت الخروج مع رسول الله صلى الله عليه وسلم قال نعم ولولا مكاني منه ما شهدته يعني من صغره أتى العلم الذي عند دار كثير بن الصلت فصلى ثم خطب ثم أتى النساء فوعظهن وذكرهن وأمرهن أن يتصدقن فجعلت المرأة تهوي بيدها إلى حلقها تلقي في ثوب بلال ‏.‏",
      "text_en": " Abdur-Rahman bin 'Abbas said:                     \"I heard 'Abbas when a man said to him: 'Did you go out (to the Eid prayer) with the Messenger of Allah?' He said: 'Yes, and were it not for my kinship (position) with him I would not have done so'\"-meaning due to him being so young- \"He (the Prophet (ﷺ)) went to the mark near the house of Kathir bin As-Salt and prayed, then delivered a Khutbah. Then he went to the women. He exhorted them and reminded them and told them to give charity. So a woman would bring her hand near her neck and take off her necklace and put it in the garment of Bilal.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11638",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4432",
      "hadith_no": "4432",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن عبد الرحمن، عن سفيان، عن عبد الرحمن بن عابس، عن أبيه، قال دخلت على عائشة فقلت أكان رسول الله صلى الله عليه وسلم ينهى عن لحوم الأضاحي بعد ثلاث قالت نعم أصاب الناس شدة فأحب رسول الله صلى الله عليه وسلم أن يطعم الغني الفقير ثم قال لقد رأيت آل محمد صلى الله عليه وسلم يأكلون الكراع بعد خمس عشرة قلت مم ذاك فضحكت فقالت ما شبع آل محمد صلى الله عليه وسلم من خبز مأدوم ثلاثة أيام حتى لحق بالله عز وجل ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Abis that his father said:                     \"I came in to 'Aishah and said: 'Did the Messenger of Allah forbid (eating) the meat of sacrificial animals after three day?' She said: 'Yes Hardship had befallen the people, and the Messenger of Allah wanted the rich to feed the poor.' Then she said: 'I remember the family of Muhammad eating the trotters after fifteen days. I said: 'Why is that\" She laughed and said: 'The family of Muhammad never ate their fill of bread and something to go with it, for three days in row, until he met Allah, the Mighty and Sublime,\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20033",
        "20012",
        "11638",
        "11357"
      ]
    },
    {
      "id": "sunan-an-nasai-4433",
      "hadith_no": "4433",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يوسف بن عيسى، قال حدثنا الفضل بن موسى، قال حدثنا يزيد، - وهو ابن زياد بن أبي الجعد - عن عبد الرحمن بن عابس، عن أبيه، قال سألت عائشة عن لحوم الأضاحي، قالت كنا نخبأ الكراع لرسول الله صلى الله عليه وسلم شهرا ثم يأكله ‏.‏",
      "text_en": " It was narrated from 'Abdur'Rahman bin 'Abis that his father said:                     \"I asked 'Aishah about the meat of the sacrificial animals and she said: 'We used to keep the trotters for the Messenger of Allah for a month, then he would eat them.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20452",
        "25362",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1369",
      "hadith_no": "1369",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا حفص بن غياث، حدثنا حجاج بن أرطاة، عن عبد الرحمن بن عابس، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يخرج بناته ونساءه في العيدين ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) used to bringhisdaughters and his wives out on the two ‘Eid.",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20317",
        "20580",
        "11638",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3279",
      "hadith_no": "3279",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة، قالت إنما نهى رسول الله  صلى الله عليه وسلم  عن لحوم الأضاحي لجهد الناس ثم رخص فيها ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ) onlyforbade storing the meat of the sacrifices because the people werefacing hardship. Then later he permitted that.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3438",
      "hadith_no": "3438",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الرحمن بن عابس، أخبرني أبي، عن عائشة، قالت لقد كنا نرفع الكراع فيأكله رسول الله  صلى الله عليه وسلم  بعد خمس عشرة من الأضاحي ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We used to store trotters and theMessenger of Allah (ﷺ) would eat them fifteen days after thesacrifice.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30388",
        "20005",
        "11638",
        "11357",
        "53"
      ]
    }
  ],
  "total_hadiths": 20
}