{
  "id": "11635",
  "name": "'Abdullah bin Sa'id bin Jubayr عبد الله بن سعيد بن جبير",
  "full_name": "'Abdullah bin Sa'id bin Jubayr عبد الله بن سعيد بن جبير",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Asadi",
      "B.Khuzayma",
      "al-Walbi",
      "Client",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11639",
      "name": "'Abdul Malik bin Sa'id عبد الملك بن سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "699",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، قال بت عند خالتي فقام النبي صلى الله عليه وسلم يصلي من الليل، فقمت أصلي معه فقمت عن يساره، فأخذ برأسي فأقامني عن يمينه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of my aunt Maimuna. The Prophet stood for the night prayer and I joined him and stood on his left side but he drew me to his right by holding me by the head.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2004",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، حدثنا عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم المدينة، فرأى اليهود تصوم يوم عاشوراء، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ قالوا هذا يوم صالح، هذا يوم نجى الله بني إسرائيل من عدوهم، فصامه موسى‏.‏ قال ‏\"‏ فأنا أحق بموسى منكم ‏\"‏‏.‏ فصامه وأمر بصيامه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet came to Medina and saw the Jews fasting on the day of Ashura. He asked them about that. They replied, \"This is a good day, the day on which Allah rescued Bani Israel from their enemy. So, Moses fasted this day.\" The Prophet said, \"We have more claim over Moses than you.\" So, the Prophet fasted on that day and ordered (the Muslims) to fast (on that day).",
      "chain": [
        "30315",
        "20258",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3362",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، عن أبيه، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ يرحم الله أم إسماعيل، لولا أنها عجلت لكان زمزم عينا معينا ‏\"‏‏.‏   قال الأنصاري حدثنا ابن جريج، أما كثير بن كثير فحدثني قال إني وعثمان بن أبي سليمان جلوس مع سعيد بن جبير، فقال ما هكذا حدثني ابن عباس، قال أقبل إبراهيم بإسماعيل وأمه عليهم السلام وهى ترضعه، معها شنة  لم يرفعه  ثم جاء بها إبراهيم وبابنها إسماعيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to fill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on the surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his mother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3397",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا أيوب السختياني، عن ابن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما أن النبي صلى الله عليه وسلم لما قدم المدينة وجدهم يصومون يوما، يعني عاشوراء، فقالوا هذا يوم عظيم، وهو يوم نجى الله فيه موسى، وأغرق آل فرعون، فصام موسى شكرا لله‏.‏ فقال ‏\"‏ أنا أولى بموسى منهم ‏\"‏‏.‏ فصامه وأمر بصيامه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet came to Medina, he found (the Jews) fasting on the day of 'Ashura' (i.e. 10th of Muharram). They used to say: \"This is a great day on which Allah saved Moses and drowned the folk of Pharaoh. Moses observed the fast on this day, as a sign of gratitude to Allah.\" The Prophet said, \"I am closer to Moses than they.\" So, he observed the fast (on that day) and ordered the Muslims to fast on it.",
      "chain": [
        "30026",
        "20005",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2714",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا سفيان، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، - رضى الله عنهما - أن رسول الله صلى الله عليه وسلم قدم المدينة فوجد اليهود صياما يوم عاشوراء فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ما هذا اليوم الذي تصومونه ‏\"‏ ‏.‏ فقالوا هذا يوم عظيم أنجى الله فيه موسى وقومه وغرق فرعون وقومه فصامه موسى شكرا فنحن نصومه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فنحن أحق وأولى بموسى منكم ‏\"‏ ‏.‏ فصامه رسول الله صلى الله عليه وسلم وأمر بصيامه ‏.‏",
      "text_en": " Ibn'Abbas (Allah be pleased with both of them) reported that the Messenger of Allah (may peace be upon him) arrived in Medina and found the Jews observing fast on the day of 'Ashura. The Messenger of Allah (may peace be upon him) said to them:                      What is the (significance) of this day that you observe fast on it? They said: It is the day of great (significance) when Allah delivered Moses and his people, and drowned the Pharaoh and his people, and Moses observed fast out of gratitude and we also observe it. Upon this the Messenger of Allah (may peace be upon him) said: We have more right, and we have a closer connection with Moses than you have; so Allah's Messenger (may peace be upon him) observed fast (on the day of 'Ashura), and gave orders that it should be observed.",
      "chain": [
        "30421",
        "20005",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "866",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "يحيى بن يمان، عن شريك، عن أبي إسحاق، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من طاف بالبيت خمسين مرة خرج من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏ قال وفي الباب عن أنس وابن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث غريب ‏.‏ سألت محمدا عن هذا الحديث فقال إنما يروى هذا عن ابن عباس قوله ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"Whoever performed Tawaf around the House fifty time, he will be as free of his sins as the day his mother bore him.\"",
      "chain": [
        "20617",
        "20587",
        "11049",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "806",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، قال بت عند خالتي ميمونة فقام رسول الله صلى الله عليه وسلم يصلي من الليل فقمت عن شماله فقال بي هكذا فأخذ برأسي فأقامني عن يمينه ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                      \"I stayed overnight with my maternal aunt Maimunah, and the Messenger of Allah (ﷺ) got up to pray at night. I stood on his left, so he did this to me: He took me by the head and made me stand on his right.\"",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 7
}