{
  "id": "11633",
  "name": "Talha bin Yazid al-Ayly طلحة بن يزيد الأيلي",
  "full_name": "Talha bin Yazid al-Ayly طلحة بن يزيد الأيلي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "Kufa",
      "al-Nisa'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19320",
      "name": "Abu 'Utba أبو عتبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-874",
      "hadith_no": "874",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وعلي بن الجعد، قالا حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، مولى الأنصار عن رجل، من بني عبس عن حذيفة، أنه رأى رسول الله صلى الله عليه وسلم يصلي من الليل فكان يقول ‏\"‏ الله أكبر - ثلاثا - ذو الملكوت والجبروت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم استفتح فقرأ البقرة ثم ركع فكان ركوعه نحوا من قيامه وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ ثم رفع رأسه من الركوع فكان قيامه نحوا من ركوعه يقول ‏\"‏ لربي الحمد ‏\"‏ ‏.‏ ثم سجد فكان سجوده نحوا من قيامه فكان يقول في سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ ثم رفع رأسه من السجود وكان يقعد فيما بين السجدتين نحوا من سجوده وكان يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ فصلى أربع ركعات فقرأ فيهن البقرة وآل عمران والنساء والمائدة أو الأنعام شك شعبة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     Hudhayfah saw the Messenger of Allah (ﷺ) praying at night. He said: Allah is most great\" three times, \"Possessor of kingdom, grandeur, greatness and majesty.\" He then began (his prayer) and recited Surah al-Baqarah; then he bowed and he paused in bowing as long as he stood up; he said while bowing, \"Glory be to my mighty Lord,\" \"Glory be to my mighty Lord\" ; then he raised his head, after bowing: then he stood up and he paused as long as he paused in bowing and said, \"Praise be to my Lord\" ; then he prostrated and paused in prostration as long as he paused in the standing position; he said while prostrating: \"Glory be to my most high Lord\"; then he raised his head after prostration, and sat as long as he prostrated, and said while sitting: \"O my Lord forgive me.\" He offered four rak'ahs of prayer and recited in them Surah al-Baqarah, Aal Imran, an-Nisa, al-Ma'idah, or al-An'am. The narrator Shu'bah doubted.",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20386",
        "20020",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "id": "sunan-an-nasai-1009",
      "hadith_no": "1009",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن آدم، عن حفص بن غياث، عن العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، والأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي صلى الله عليه وسلم قرأ البقرة وآل عمران والنساء في ركعة لا يمر بآية رحمة إلا سأل ولا بآية عذاب إلا استجار ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Prophet (ﷺ) recited Surat Al-Baqarah, Al 'Imran and An-Nisa' in one rak'ah, and he did not reach any verse that spoke of mercy but he asked Allah for it, nor any verse that spoke of punishment but he asked Allah for protection therefrom.",
      "usc_msa_ref": "",
      "chain": [
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "id": "sunan-an-nasai-1665",
      "hadith_no": "1665",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن محمد المروزي، - ثقة - قال حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد الأنصاري، عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم في رمضان فركع فقال في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ مثل ما كان قائما ثم جلس يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ مثل ما كان قائما ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ مثل ما كان قائما فما صلى إلا أربع ركعات حتى جاء بلال إلى الغداة ‏.‏ قال أبو عبد الرحمن هذا الحديث عندي مرسل وطلحة بن يزيد لا أعلمه سمع من حذيفة شيئا وغير العلاء بن المسيب قال في هذا الحديث عن طلحة عن رجل عن حذيفة ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed with the Messenger of Allah during Ramadan. He bowed and said: \"Subhana Rabbiyal-Azim while bowing, for as long as he had stood. Then he sat down and said: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me),\" for as long as he had stood. Then he prostrated and said: \"Subhana Rabbiyal-'Ala for as long as he had stood And he prayed no more than four rak'ahs when Bilal came for Al-Ghadah.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "28603",
        "11647",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-947",
      "hadith_no": "947",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا حفص بن غياث، حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، ح وحدثنا علي بن محمد، حدثنا حفص بن غياث، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي  صلى الله عليه وسلم  كان يقول بين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah that the Prophet (ﷺ) used to saybetweenthe two prostrations:                      “Rabbighfir li, Rabbighfir li (O Lordforgiveme, O Lord forgive me).”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "38409",
        "20317",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    }
  ],
  "total_hadiths": 4
}