{
  "id": "11643",
  "name": "'Umar bin Abi Za'id'h عمر بن أبي زائدة الهمداني",
  "full_name": "'Umar bin Abi Za'id'h عمر بن أبي زائدة الهمداني",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  س  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Hamdani",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11636",
      "name": "'Abdullah bin Abi al-Safar عبد الله بن أبي السفر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20214",
      "name": "Bahz bin Asad al-'Ami",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20410",
      "name": "Ishaq bin Mnswr al-Slwly إسحاق بن منصور السلولي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20245",
      "name": "'Abdullah bin Raja' bin 'Umar عبد الله بن رجاء بن عمر/المثني الغداني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20282",
      "name": "Muhammad bin 'Ar'ara محمد بن عرعرة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "376",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثني عمر بن أبي زائدة، عن عون بن أبي جحيفة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم في قبة حمراء من أدم، ورأيت بلالا أخذ وضوء رسول الله صلى الله عليه وسلم ورأيت الناس يبتدرون ذاك الوضوء، فمن أصاب منه شيئا تمسح به، ومن لم يصب منه شيئا أخذ من بلل يد صاحبه، ثم رأيت بلالا أخذ عنزة فركزها، وخرج النبي صلى الله عليه وسلم في حلة حمراء مشمرا، صلى إلى العنزة بالناس ركعتين، ورأيت الناس والدواب يمرون من بين يدى العنزة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I saw Allah's Apostle in a red leather tent and I saw Bilal taking the remaining water with which the Prophet had performed ablution. I saw the people taking the utilized water impatiently and whoever got some of it rubbed it on his body and those who could not get any took the moisture from the others' hands. Then I saw Bilal carrying a short spear (or stick) which he planted in the ground. The Prophet came out tucking up his red cloak, and led the people in prayer and offered two rak`at (facing the Ka`ba) taking a short spear (or stick) as a Sutra for his prayer. I saw the people and animals passing in front of him beyond the stick.",
      "chain": [
        "20282",
        "11643",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "5845",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني إسحاق، أخبرنا ابن شميل، أخبرنا عمر بن أبي زائدة، أخبرنا عون بن أبي جحيفة، عن أبيه أبي جحيفة، قال فرأيت بلالا جاء بعنزة فركزها، ثم أقام الصلاة، فرأيت رسول الله صلى الله عليه وسلم خرج في حلة مشمرا، فصلى ركعتين إلى العنزة، ورأيت الناس والدواب يمرون بين يديه من وراء العنزة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I saw Bilal bringing a short spear (or stick) and fixing it in the ground, and then he proclaimed the Iqama of the prayer, and I saw Allah's Apostle coming out, wearing a cloak with its sleeves rolled up. He then offered a two-rak`at prayer while facing the stick, and I saw the people and animals passing in front of him beyond the stick.",
      "chain": [
        "30312",
        "11643",
        "11383"
      ]
    },
    {
      "hadith_no": "5920",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثني عمر بن أبي زائدة، عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم وهو في قبة حمراء من أدم، ورأيت بلالا أخذ وضوء النبي صلى الله عليه وسلم والناس يبتدرون الوضوء، فمن أصاب منه شيئا تمسح به، ومن لم يصب منه شيئا أخذ من بلل يد صاحبه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I came to the Prophet while he was inside a red leather tent, and I saw Bilal taking the remaining water of the ablution of the Prophet, and the people were taking of that water and rubbing it on their faces; and whoever could not get anything of it, would share the moisture of the hand of his companion (and then rub it on his face).",
      "chain": [
        "20282",
        "11643",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "6478",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا عمر بن أبي زائدة، عن أبي إسحاق، عن عمرو بن ميمون، قال من قال عشرا كان كمن أعتق رقبة من ولد إسماعيل‏.‏ قال عمر بن أبي زائدة وحدثنا عبد الله بن أبي السفر عن الشعبي عن ربيع بن خثيم مثله‏.‏ فقلت للربيع ممن سمعته فقال من عمرو بن ميمون‏.‏ فأتيت عمرو بن ميمون فقلت ممن سمعته فقال من ابن أبي ليلى‏.‏ فأتيت ابن أبي ليلى فقلت ممن سمعته فقال من أبي أيوب الأنصاري يحدثه عن النبي صلى الله عليه وسلم وقال إبراهيم بن يوسف عن أبيه عن أبي إسحاق حدثني عمرو بن ميمون عن عبد الرحمن بن أبي ليلى عن أبي أيوب قوله عن النبي صلى الله عليه وسلم‏.‏     وقال موسى حدثنا وهيب، عن داود، عن عامر، عن عبد الرحمن بن أبي ليلى، عن أبي أيوب، عن النبي صلى الله عليه وسلم‏.‏ وقال إسماعيل عن الشعبي عن الربيع قوله‏.‏ وقال آدم حدثنا شعبة حدثنا عبد الملك بن ميسرة سمعت هلال بن يساف عن الربيع بن خثيم وعمرو بن ميمون عن ابن مسعود قوله‏.‏ وقال الأعمش وحصين عن هلال عن الربيع عن عبد الله قوله‏.‏ ورواه أبو محمد الحضرمي عن أبي أيوب عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     Whoever recites it (i.e., the invocation in the above Hadith (412) ten times will be as if he manumitted one of Ishmael's descendants. Abu Aiyub narrated the same Hadith from the Prophet saying, \"(Whoever recites it ten times) will be as if he had manumitted one of Ishmael's descendants.\"",
      "chain": [
        "30351",
        "11643",
        "11049",
        "11382",
        "11643",
        "11636",
        "11052"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا عمر بن أبي زائدة، عن الشعبي، عن عروة بن المغيرة، عن أبيه، أنه وضأ النبي صلى الله عليه وسلم فتوضأ ومسح على خفيه فقال له فقال ‏\"‏ إني أدخلتهما طاهرتين ‏\"‏ ‏.‏",
      "text_en": " 'Urwah al Mughira reported it from his father:                      He (Mughira) helped the Apostle (may peace be upon him) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.",
      "chain": [
        "30514",
        "30313",
        "11643",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا عمر بن أبي زائدة، حدثنا عون بن أبي جحيفة، أن أباه، رأى رسول الله صلى الله عليه وسلم في قبة حمراء من أدم ورأيت بلالا أخرج وضوءا فرأيت الناس يبتدرون ذلك الوضوء فمن أصاب منه شيئا تمسح به ومن لم يصب منه أخذ من بلل يد صاحبه ثم رأيت بلالا أخرج عنزة فركزها وخرج رسول الله صلى الله عليه وسلم في حلة حمراء مشمرا فصلى إلى العنزة بالناس ركعتين ورأيت الناس والدواب يمرون بين يدى العنزة ‏.‏",
      "text_en": " Abu Juhaifa reported on the authority of his father:                      I saw the Messenger of Allah (may peace be upon him) (in Mecca at al-Abtah) in a red leather tent. and I saw Bilal take the ablution water (left by Allah's Messenger), and I saw the people racing, with one another to get that ablution water. If anyone got some of it, he rubbed himself with it, and anyone who did not get any got some of the moisture from his companion's hand. I then saw Bilal take a staff and fix it in the ground, after which the Messenger of Allah (may peace be upon him) came out quickly in a red mantle and led the people in two rak'ahs facing the staff, and I saw people and animals passing in front of the staff.",
      "chain": [
        "38487",
        "20214",
        "11643",
        "11383"
      ]
    },
    {
      "hadith_no": "7020",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر، - يعني العقدي - حدثنا عمر، - وهو ابن أبي زائدة - عن أبي إسحاق، عن عمرو بن ميمون، قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير عشر مرار كان كمن أعتق أربعة أنفس من ولد إسماعيل ‏\"‏ ‏.‏ وقال سليمان حدثنا أبو عامر حدثنا عمر حدثنا عبد الله بن أبي السفر عن الشعبي عن ربيع بن خثيم ‏.‏ بمثل ذلك قال فقلت للربيع ممن سمعته قال من عمرو بن ميمون - قال - فأتيت عمرو بن ميمون فقلت ممن سمعته قال من ابن أبي ليلى - قال - فأتيت ابن أبي ليلى فقلت ممن سمعته قال من أبي أيوب الأنصاري يحدثه عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Amr b. Maimun reported:                      He who uttered:\" There is no god but Allah, the One, having no partner with Him, His is the Sovereignty and all praise is due to Him and He is Potent over everything\" ten times, he is like one who emancipated four slaves from the progeny of Isma'il. Rabi' b. Khuthaim narrated a hadith like this. Sha'bi reported: I said to Rabi': From whom did you hear it? He said: From 'Amr b. Maimun. I came to 'Amr b. Maimun and said to him: From whom did you hear this hadith? He said: from Ibn Abi Laila. I came to Ibn Abi Laila and said to him: From whom did you hear this hadith? He said: From Abu Ayyub Ansari, who narrated from Allah's Messenger (may peace be upon him).",
      "chain": [
        "20443",
        "11643",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "1652",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن علي، عن حديث أبي عاصم، قال حدثنا عمر بن أبي زائدة، قال حدثني أبو إسحاق، عن الأسود، عن عائشة، قالت ما كان رسول الله صلى الله عليه وسلم يمتنع من وجهي وهو صائم وما مات حتى كان أكثر صلاته قاعدا ثم ذكرت كلمة معناها إلا المكتوبة وكان أحب العمل إليه ما دام عليه الإنسان وإن كان يسيرا ‏.‏ خالفه يونس رواه عن أبي إسحاق عن الأسود عن أم سلمة ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Messenger of Allah (ﷺ) did not refrain from (kissing) my forehead when he was fasting, and he did not die until most of his prayers were offered sitting down.\" Then she said something to the effect that (referred to the prayers) other than the obligatory prayers. \"And the dearest of actions to him was that in which a person persists, even if it is little.\"",
      "chain": [
        "30153",
        "11643",
        "11049",
        "11054",
        "53"
      ]
    }
  ],
  "total_hadiths": 8
}