{
  "id": "11648",
  "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
  "full_name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "11363",
      "name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20360",
      "name": "Ma'n bin 'Abdur Rahman bin 'Abdullah معن بن عبد الرحمن بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11363",
      "name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20360",
      "name": "Ma'n bin 'Abdur Rahman bin 'Abdullah معن بن عبد الرحمن بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-558",
      "hadith_no": "558",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة، حدثنا الهيثم بن حميد، عن يحيى بن الحارث، عن القاسم أبي عبد الرحمن، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من خرج من بيته متطهرا إلى صلاة مكتوبة فأجره كأجر الحاج المحرم ومن خرج إلى تسبيح الضحى لا ينصبه إلا إياه فأجره كأجر المعتمر وصلاة على أثر صلاة لا لغو بينهما كتاب في عليين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Messenger of Allah (ﷺ) said: If anyone goes out from his house after performing ablution for saying the prescribed prayer in congregation (in the mosque), his reward will be like that of one who goes for hajj pilgrimage after wearing ihram (robe worn by the hajj pilgrims). And he who goes out to say the mid-morning (duha) prayer, and takes the trouble for this purpose, will take the reward like that of a person who performs umrah. And a prayer followed by a prayer with no worldly talk during the gap between them will be recorded in Illiyyun.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20744",
        "19894",
        "11648",
        "405"
      ]
    },
    {
      "id": "sunan-abi-daud-2503",
      "hadith_no": "2503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، وقرأته، على يزيد بن عبد ربه الجرجسي قالا حدثنا الوليد بن مسلم، عن يحيى بن الحارث، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من لم يغز أو يجهز غازيا أو يخلف غازيا في أهله بخير أصابه الله بقارعة ‏\"‏ ‏.‏ قال يزيد بن عبد ربه في حديثه ‏:‏ ‏\"‏ قبل يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: He who does not join the warlike expedition (jihad), or equip, or looks well after a warrior's family when he is away, will be smitten by Allah with a sudden calamity. Yazid ibn Abdu Rabbihi said in his tradition: 'before the Day of Resurrection\".",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "10725",
        "19894",
        "11648",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-428",
      "hadith_no": "428",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر، محمد بن إسحاق البغدادي حدثنا عبد الله بن يوسف التنيسي الشأمي، حدثنا الهيثم بن حميد، أخبرني العلاء، هو ابن الحارث عن القاسم أبي عبد الرحمن، عن عنبسة بن أبي سفيان، قال سمعت أختي أم حبيبة، زوج النبي صلى الله عليه وسلم تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرمه الله على النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من هذا الوجه ‏.‏ والقاسم هو ابن عبد الرحمن يكنى أبا عبد الرحمن وهو مولى عبد الرحمن بن خالد بن يزيد بن معاوية وهو ثقة شأمي وهو صاحب أبي أمامة ‏.‏",
      "text_en": " Umm Habibah the wife of the Prophet (S) narrated that:                     She heard Allah's Messenger (S) saying: \"Whoever maintains four Rak'ah before Az-Zuhr and four after it, Allah makes him prohibited for the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20744",
        "10884",
        "11648",
        "846"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1624",
      "hadith_no": "1624",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا يزيد بن هارون، أخبرنا الوليد بن جميل، عن القاسم أبي عبد الرحمن، عن أبي أمامة الباهلي، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله جعل الله بينه وبين النار خندقا كما بين السماء والأرض ‏\"‏ ‏.‏ هذا حديث غريب من حديث أبي أمامة ‏.‏",
      "text_en": " Narrated Abu Umamah Al-Bahili:                     That the Prophet (ﷺ) said, \"Whoever fasts a day in the cause of Allah, Allah shall put between him and the Fire a trench whose distance is like that between the heavens and the earth.\"This Hadith is Gharib as a narration of Abu Umamah.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20472",
        "19127",
        "11648",
        "4048"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1626",
      "hadith_no": "1626",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن رافع، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، عن كثير بن الحارث، عن القاسم أبي عبد الرحمن، عن عدي بن حاتم الطائي، أنه سأل رسول الله صلى الله عليه وسلم أى الصدقة أفضل قال ‏\"‏ خدمة عبد في سبيل الله أو ظل فسطاط أو طروقة فحل في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وقد روي عن معاوية بن صالح هذا الحديث مرسلا وخولف زيد في بعض إسناده ‏.‏ قال وروى الوليد بن جميل هذا الحديث عن القاسم أبي عبد الرحمن عن أبي أمامة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim At-Tai:                     That he asked the Messenger of Allah (ﷺ), \"Which charity is most virtuous?\" He said, \"The service of a worshipper in the cause of Allah, or providing the shade of tent, or mount in the cause of Allah.\"[Abu 'Eisa said:]  This Hadith has been reported from Mu'awiyah bin Salih in Mursal form.And Zaid has been contradicted concerning part of its chain.He said: And Al-Walim bin Jamil has reported this Hadith from Al-Qasim Abu 'Abdur-Rahman, from Abu Umamah, from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20650",
        "20675",
        "11648",
        "212"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1627",
      "hadith_no": "1627",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا بذلك، زياد بن أيوب حدثنا يزيد بن هارون، أخبرنا الوليد بن جميل، عن القاسم أبي عبد الرحمن، عن أبي أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصدقات ظل فسطاط في سبيل الله ومنيحة خادم في سبيل الله أو طروقة فحل في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب وهو أصح عندي من حديث معاوية بن صالح ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Messenger of Allah (ﷺ) said: \"The most virtuous of charitable spending is the shade of a tent in the cause of Allah, or giving a servant in the cause of Allah, or a riding camel in the cause of Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib Sahih, and it is more correct to me than the narration of Mu'awiyah bin Salih.",
      "usc_msa_ref": "",
      "chain": [
        "20472",
        "19127",
        "11648",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1669",
      "hadith_no": "1669",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا يزيد بن هارون، أنبأنا الوليد بن جميل الفلسطيني، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس شيء أحب إلى الله من قطرتين وأثرين قطرة من دموع في خشية الله وقطرة دم تهراق في سبيل الله ‏.‏ وأما الأثران فأثر في سبيل الله وأثر في فريضة من فرائض الله ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ ‏",
      "text_en": " Narrated Abu Umamah:                     That the Prophet (ﷺ) said: \"There is nothing more beloved to Allah than two drops and two traces: A teardrop shed out of fear of Allah, and a drop of blood shed in Allah's cause. As for the two traces: A trace resulting in Allah's cause, and and a trace resulting from one of the duties that Allah made obligatory.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20472",
        "19127",
        "11648",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2190",
      "hadith_no": "2190",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن بديل بن قريش اليامي الكوفي، حدثنا محمد بن فضيل، حدثنا عبد الرحمن بن إسحاق، عن القاسم بن عبد الرحمن، هو ابن عبد الله بن مسعود عن أبيه، عن ابن مسعود، قال حدث رسول الله صلى الله عليه وسلم عن ليلة، أسري به أنه لم يمر على ملإ من الملائكة إلا أمروه أن مر أمتك بالحجامة ‏.‏ قال أبو عيسى وهذا حديث حسن غريب من حديث ابن مسعود ‏.‏",
      "text_en": " Ibn Mas'ud said:                     \"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"",
      "usc_msa_ref": "",
      "chain": [
        "35000",
        "20356",
        "11876",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2347",
      "hadith_no": "2347",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "أخبرنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أغبط أوليائي عندي لمؤمن خفيف الحاذ ذو حظ من الصلاة أحسن عبادة ربه وأطاعه في السر وكان غامضا في الناس لا يشار إليه بالأصابع وكان رزقه كفافا فصبر على ذلك ‏\"‏ ‏.‏ ثم نفض بيده فقال ‏\"‏ عجلت منيته قلت بواكيه قل تراثه ‏\"‏ ‏.‏  وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ عرض على ربي ليجعل لي بطحاء مكة ذهبا قلت لا يا رب ولكن أشبع يوما وأجوع يوما أو قال ثلاثا أو نحو هذا فإذا جعت تضرعت إليك وذكرتك وإذا شبعت شكرتك وحمدتك ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وفي الباب عن فضالة بن عبيد ‏.‏ والقاسم هذا هو ابن عبد الرحمن ويكنى أبا عبد الرحمن وهو مولى عبد الرحمن بن خالد بن يزيد بن معاوية وهو شامي ثقة وعلي بن يزيد ضعيف الحديث ويكنى أبا عبد الملك ‏.‏",
      "text_en": " Abu Umamah narrated that the Prophet (s.a.w) said:                     \"Indeed the best of my friends to me is the one of meager conditions, whose share is in Salat, worshipping his Lord well and obeying him (even) in private. He is obscure among the people such that the fingers are not pointed towards him. His provisions are only what is sufficient and he is patient with that.\" Then he tapped with his fingers and said: \"His death comes quickly, his mourners are few, and his inheritance is little.\"With this (the above), chain it is narrated that the Prophet (s.a.w) said: \"My Lord presented to me, that He would make the valley of Makkah into gold for me, I said: 'No O Lord! But being filled for a day and hungry for a day\"-or he said: \"three days\" or something like that- \"So when I am hungry, I would beseech You and remember You, and when I am full I would be grateful to You and praise You.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20379",
        "19927",
        "11648",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2731-2",
      "hadith_no": "2731",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله، أخبرنا يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم أبي عبد الرحمن، عن أبي أمامة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تمام عيادة المريض أن يضع أحدكم يده على جبهته أو قال على يده فيسأله كيف هو وتمام تحياتكم بينكم المصافحة ‏\"‏ ‏.‏ قال أبو عيسى هذا إسناد ليس بالقوي ‏.‏ قال محمد وعبيد الله بن زحر ثقة وعلي بن يزيد ضعيف والقاسم بن عبد الرحمن يكنى أبا عبد الرحمن وهو مولى عبد الرحمن بن خالد بن يزيد بن معاوية وهو ثقة والقاسم شامي ‏.‏",
      "text_en": " Narrated Abu Umamah:                     that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20379",
        "19927",
        "11648",
        "405"
      ]
    },
    {
      "id": "sunan-an-nasai-2254",
      "hadith_no": "2254",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، عن محمد بن شعيب، قال أخبرني يحيى بن الحارث، عن القاسم أبي عبد الرحمن، أنه حدثه عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل باعد الله منه جهنم مسيرة مائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"Whoever fasts one day in the cause of Allah, the mighty and sublime, Allah will separate him the distance of one hundred years from the fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20732",
        "19894",
        "11648",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5437",
      "hadith_no": "5437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني محمود بن خالد، قال حدثنا الوليد، قال حدثني ابن جابر، عن القاسم أبي عبد الرحمن، عن عقبة بن عامر، قال بينا أقود برسول الله صلى الله عليه وسلم في نقب من تلك النقاب إذ قال ‏\"‏ ألا تركب يا عقبة ‏\"‏ ‏.‏ فأجللت رسول الله صلى الله عليه وسلم أن أركب مركب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ألا تركب يا عقبة ‏\"‏ ‏.‏ فأشفقت أن يكون معصية فنزل وركبت هنيهة ونزلت وركب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ألا أعلمك سورتين من خير سورتين قرأ بهما الناس ‏\"‏ ‏.‏ فأقرأني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ فأقيمت الصلاة فتقدم فقرأ بهما ثم مر بي فقال ‏\"‏ كيف رأيت يا عقبة بن عامر اقرأ بهما كلما نمت وقمت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"While I was leading the Messenger of Allah [SAW] (on his mount) in one of these mountain passes, he said: 'Why don't you ride, O 'Uqbah?' I had too much respect for the Messenger of Allah [SAW] to ride the mount of the Messenger of Allah [SAW]. Then he said: 'Why don't you ride, O 'Uqbah?' I was worried that I might be disobeying him, so he got off, and I rode for a little while, then I got off and the Messenger of Allah [SAW] rode. Then he said: 'Shall I not teach you two of the best Surahs that the people recite?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak,' and 'Say: I seek refuge with (Allah) the Lord of mankind.\" Then the Iqamah was said and he went forward and recited them. Then he passed by me and said: 'What do you think, O 'Uqbah bin 'Amir? Recite them every time you go to sleep and get up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11648",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-1716",
      "hadith_no": "1716",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا مروان بن محمد، حدثنا الهيثم بن حميد، حدثنا العلاء بن الحارث، عن القاسم أبي عبد الرحمن، أنه سمع معاوية بن أبي سفيان، على المنبر يقول كان رسول الله  صلى الله عليه وسلم  يقول على المنبر قبل شهر رمضان ‏\"‏ الصيام يوم كذا وكذا ونحن متقدمون فمن شاء فليتقدم ومن شاء فليتأخر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Qasim Abu ‘Abdur-Rahman that he heard Mu’awiyahbinAbu Sufyan on the pulpit saying:                      “The Messenger of Allah (ﷺ)usedto say from the pulpit, before the month of Ramadan: ‘Fastingwillbegin on such and such a day, but we are going to start fastingearlier, so whoever wants to start fasting earlier (i.e., inSha’ban),let him do so, and whoever wants to wait until Ramadanbegins, let himdo so.’”",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "20744",
        "10884",
        "11648"
      ]
    },
    {
      "id": "sunan-ibn-majah-2975",
      "hadith_no": "2975",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا عبد الله بن عثمان بن خثيم، عن القاسم بن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، عن جده عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ سيلي أموركم بعدي رجال يطفئون السنة ويعملون بالبدعة ويؤخرون الصلاة عن مواقيتها ‏\"‏ فقلت يا رسول الله إن أدركتهم كيف أفعل قال ‏\"‏ تسألني يا ابن أم عبد كيف تفعل لا طاعة لمن عصى الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Among those in charge of you, after I am gone, will be men whoextinguish the Sunnah and follow innovation. They will delay theprayer from its proper time.” I said: “O Messenger of Allah, if Iliveto see them, what should I do?” He said: “You ask me, O Ibn‘Abd, whatyou should do? There is no obedience to one who disobeysAllah.”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20204",
        "30288",
        "20736",
        "10644",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-4089",
      "hadith_no": "4089",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا راشد بن سعيد الرملي، حدثنا الوليد بن مسلم، عن الوليد بن سليمان بن أبي السائب، عن علي بن يزيد، عن القاسم أبي عبد الرحمن، عن أبي أمامة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ستكون فتن يصبح الرجل فيها مؤمنا ويمسي كافرا إلا من أحياه الله بالعلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that the Messenger of Allah (ﷺ)said:                      “There will be tribulation in which a man will be a believerinthe morning and a disbeliever by evening, except the one to whomAllahgrants knowledge.”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "19130",
        "11648",
        "405"
      ]
    }
  ],
  "total_hadiths": 15
}