{
  "id": "11653",
  "name": "Muslim bin Salm al-Nahdi, Abu Farwa مسلم بن سالم النهدي أبو فروة",
  "full_name": "Muslim bin Salm al-Nahdi, Abu Farwa مسلم بن سالم النهدي أبو فروة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Juhni",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10786",
      "name": "'Abdullah bin 'Akaym عبد الله بن عكيم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19878",
      "name": "'Isa bin 'Abdur Rahman bin Abi Layla عيسى بن عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10787",
      "name": "'Abdullah bin Abi al-Hadhayl عبد الله بن أبي الهذيل",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15313",
      "name": "'Abdullah bin Ysar عبد الله بن يسار",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "25041",
      "name": "Ja'far bin Ziyad al-Ahmr جعفر بن زياد الأحمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20322",
      "name": "Ziyad bin 'Abdullah زياد بن عبد الله بن الطفيل",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3370",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قيس بن حفص، وموسى بن إسماعيل، قالا حدثنا عبد الواحد بن زياد، حدثنا أبو قرة، مسلم بن سالم الهمداني قال حدثني عبد الله بن عيسى، سمع عبد الرحمن بن أبي ليلى، قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية سمعتها من النبي، صلى الله عليه وسلم فقلت بلى، فأهدها لي‏.‏ فقال سألنا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله كيف الصلاة عليكم أهل البيت فإن الله قد علمنا كيف نسلم‏.‏ قال ‏\"‏ قولوا اللهم صل على محمد، وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Laila:                     Ka`b bin Ujrah met me and said, \"Shall I not give you a present I got from the Prophet?\" `Abdur- Rahman said, \"Yes, give it to me.\" I said, \"We asked Allah's Apostle saying, 'O Allah's Apostle! How should one (ask Allah to) send blessings on you, the members of the family, for Allah has taught us how to salute you (in the prayer)?' He said, 'Say: O Allah! Send Your Mercy on Muhammad and on the family of Muhammad, as You sent Your Mercy on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious. O Allah! Send Your Blessings on Muhammad and the family of Muhammad, as You sent your Blessings on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious.' \"",
      "chain": [
        "30158",
        "20040",
        "20256",
        "11653",
        "11361",
        "11196"
      ]
    },
    {
      "hadith_no": "5515",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا سعيد بن عمرو بن سهل بن إسحاق بن محمد بن الأشعث بن قيس، قال حدثنا سفيان بن عيينة، سمعته يذكره، عن أبي فروة، أنه سمع عبد الله بن عكيم، قال كنا مع حذيفة بالمدائن فاستسقى حذيفة فجاءه دهقان بشراب في إناء من فضة فرماه به وقال إني أخبركم أني قد أمرته أن لا يسقيني فيه فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تشربوا في إناء الذهب والفضة ولا تلبسوا الديباج والحرير فإنه لهم في الدنيا وهو لكم في الآخرة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Ukaim reported:                      While we were with Hudhaifa in Mada'in he asked for water. A villager brought a drink for him in a silver vessel. He (Hudhaifa) threw it away saying: I inform you that I have already conveyed to him that he should not serve me drink in it (silver vessel) for Allah's Messenger (may peace be upon him) had said: Do not drink in gold and silver vessels, and do not wear brocade or silk, for these are meant for them (the non-believers) in this world, but they are meant for you in the Hereafter on the Day, of Resurrection.",
      "chain": [
        "11509",
        "20005",
        "11653",
        "10786"
      ]
    },
    {
      "hadith_no": "5516",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا سفيان، عن أبي فروة الجهني، قال سمعت عبد، الله بن عكيم يقول كنا عند حذيفة بالمدائن ‏.‏ فذكر نحوه ولم يذكر في الحديث ‏\"‏ يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " This badith has been reported on the authority of 'Abdullah b. Ukaim with a slight variation of wording.",
      "chain": [
        "30421",
        "20005",
        "11653",
        "10786"
      ]
    },
    {
      "hadith_no": "115",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زياد بن أيوب الطوسي، حدثنا عبيد الله بن موسى، حدثنا فطر، عن أبي فروة، عن عبد الرحمن بن أبي ليلى، قال رأيت عليا - رضى الله عنه - توضأ فغسل وجهه ثلاثا وغسل ذراعيه ثلاثا ومسح برأسه واحدة ثم قال هكذا توضأ رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Abd al-Rahman b. Abi Laila says:                      I saw ‘ Ali performing ablution. He washed his face three times and his hands three times and wiped his head once. Then he (‘Ali) said: The Messenger of Allah (ﷺ) used to perform ablution in this way.",
      "chain": [
        "30249",
        "20340",
        "11718",
        "11653",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "2279",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا سفيان، عن أبي فروة، عن عبد الرحمن بن أبي ليلى، بهذا الخبر وليس بتمامه قال وقضى بها لجعفر وقال ‏\"‏ إن خالتها عنده ‏\"‏ ‏.‏",
      "text_en": " This tradition has been narrated by ‘Abd Al Rahman bin Abi Laila through a different chain of narrators. This version has “He decided that she would be given to Ja’far and said “Her maternal aunt is with him(i.e., his wife).",
      "chain": [
        "31167",
        "20012",
        "11653",
        "11196"
      ]
    },
    {
      "hadith_no": "2033",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن أبي فروة، عن المغيرة بن سبيع، حدثني عبد الله بن بريدة، عن أبيه، ‏:‏ أنه كان في مجلس فيه رسول الله صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ إني كنت نهيتكم أن تأكلوا لحوم الأضاحي إلا ثلاثا، فكلوا وأطعموا وادخروا ما بدا لكم، وذكرت لكم أن لا تنتبذوا في الظروف الدباء والمزفت والنقير والحنتم، انتبذوا فيما رأيتم واجتنبوا كل مسكر، ونهيتكم عن زيارة القبور فمن أراد أن يزور فليزر، ولا تقولوا هجرا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Buraidah narrated from his father:                     That he was in a gathering where the Messenger of Allah was present and he said: \"I used to forbid you to eat the sacrificial mea for more than three days, but now eat it, give it to others and store it for as long as you want. And I told you not to make Nabidh in these containers: Ad-Dubba', Al-Muzaqqat, An-Naqir, and Al-Hantam. But now make Nabidh in whatever you want, but avoid everything that intoxicates. And I forbade you to visit graves, but now whoever want to visit them, let him do so, but do not utter anything which is not suitable.\"",
      "chain": [
        "20028",
        "11653",
        "19031",
        "11432"
      ]
    },
    {
      "hadith_no": "4991",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن قدامة، عن جرير، عن أبي فروة، عن أبي زرعة، عن أبي هريرة، وأبي، ذر قالا كان رسول الله صلى الله عليه وسلم يجلس بين ظهرانى أصحابه فيجيء الغريب فلا يدري أيهم هو حتى يسأل فطلبنا إلى رسول الله صلى الله عليه وسلم أن نجعل له مجلسا يعرفه الغريب إذا أتاه فبنينا له دكانا من طين كان يجلس عليه وإنا لجلوس ورسول الله صلى الله عليه وسلم في مجلسه إذ أقبل رجل أحسن الناس وجها وأطيب الناس ريحا كأن ثيابه لم يمسها دنس حتى سلم في طرف البساط فقال السلام عليك يا محمد ‏.‏ فرد عليه السلام قال أدنو يا محمد قال ‏\"‏ ادنه ‏\"‏ ‏.‏ فما زال يقول أدنو مرارا ويقول له ‏\"‏ ادن ‏\"‏ ‏.‏ حتى وضع يده على ركبتى رسول الله صلى الله عليه وسلم قال يا محمد أخبرني ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتحج البيت وتصوم رمضان ‏\"‏ ‏.‏ قال إذا فعلت ذلك فقد أسلمت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال صدقت ‏.‏ فلما سمعنا قول الرجل صدقت أنكرناه قال يا محمد أخبرني ما الإيمان قال ‏\"‏ الإيمان بالله وملائكته والكتاب والنبيين وتؤمن بالقدر ‏\"‏ ‏.‏ قال فإذا فعلت ذلك فقد آمنت قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا محمد أخبرني ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال صدقت ‏.‏ قال يا محمد أخبرني متى الساعة قال فنكس فلم يجبه شيئا ثم أعاد فلم يجبه شيئا ثم أعاد فلم يجبه شيئا ورفع رأسه فقال ‏\"‏ ما المسئول عنها بأعلم من السائل ولكن لها علامات تعرف بها إذا رأيت الرعاء البهم يتطاولون في البنيان ورأيت الحفاة العراة ملوك الأرض ورأيت المرأة تلد ربها خمس لا يعلمها إلا الله ‏{‏ إن الله عنده علم الساعة ‏}‏ إلى قوله ‏{‏ إن الله عليم خبير ‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا والذي بعث محمدا بالحق هدى وبشيرا ما كنت بأعلم به من رجل منكم وإنه لجبريل عليه السلام نزل في صورة دحية الكلبي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah and Abu Dharr said:                     \"The Messenger of Allah [SAW] would sit among his Companions and if a stranger came, he would not know which of them was he (the Prophet [SAW]) until he asked. So we suggested to the Messenger of Allah [SAW] that we should make a dais for him so that any stranger would know him if he came to him. So we built for him a bench made of clay on which he used to sit. (One day) we were sitting and the Messenger of Allah [SAW] was sitting in his spot, when a man came along who was the most handsome and good-smelling of all people, and it was as if no dirt had ever touched his garments. He came near the edge of the rug and greeted him, saying: 'Peace be upon you, O Muhammad!' He returned the greeting, and he said: 'Shall I come closer, O Muhammad?' He came a little closer, and he kept telling him to come closer, until he put his hands on the knees of the Messenger of Allah [SAW]. He said: 'O Muhammad, tell me, what is Islam?' He said: 'Islam means to worship Allah and not associate anything with Him; to establish Salah, to pay Zakah, to perform Hajj to the House, and to fast Ramadan.' He said: 'If I do that, will I have submitted (be a Muslim)?' He said: 'Yes.' He said: 'You have spoken the truth,' we found it odd. He said: 'O Muhammad, tell me, what is faith?' He said: 'To believe in Allah [SWT], His Angels, the Book, the Prophets, and to believe in the Divine Decree.' He said: 'If I do that, will I have believed?' The Messenger of Allah [SAW] said: 'Yes.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me, what is Al-Ihsan?' He said: 'To worship Allah [SWT] as if you can see Him, for although you cannot see Him, He can see you.' He said: 'You have spoken the truth.' He said: 'O Muhammad, tell me about the Hour.' He lowered his head and did not answer. Then he repeated the question, and he did not answer. Then he repeated the question (a third time) and he did not answer. Then he raised his head and said: 'The one who is being asked does not know more than the one who is asking. But it has signs, by which it may be known. When you see the herdsmen competing in building tall buildings, when you see the barefoot and naked ruling the Earth, when you see a woman giving birth to her mistress. Five things which no one knows except Allah [SWT]. Verily, Allah, with Him (alone) is the knowledge of the Hour up to His saying: 'Verily, Allah is All-Knower, All-Aware (of things).' Then he said: 'No, by the One who sent Muhammad with the truth, with guidance and glad tidings, I did not know him more than any man among you. That was Jibril, peace be upon you, who came down in the form of Dihyah Al-Kalbi.'\"",
      "chain": [
        "20028",
        "11653",
        "11406",
        "13",
        "23"
      ]
    },
    {
      "hadith_no": "873",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا إسحاق بن سليمان، أنبأنا عمرو بن أبي قيس، عن أبي فروة، عن أبي الأحوص، عن عبد الله بن مسعود، أن رسول الله  صلى الله عليه وسلم  كان يقرأ في صلاة الفجر يوم الجمعة ‏{الم * تنزيل}‏ و ‏{هل أتى على الإنسان}‏ ‏.‏ قال إسحاق هكذا حدثنا عمرو عن عبد الله لا أشك فيه ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that for the Subh prayer onFridays, the Messenger of Allah (ﷺ) used to recite “Alif-Lam-Mim.The revelation...” [32:                     1] and “Has there not been over man..”[76:1]",
      "chain": [
        "30313",
        "20310",
        "20726",
        "11653",
        "20327",
        "16"
      ]
    }
  ],
  "total_hadiths": 8
}