{
  "id": "11655",
  "name": "al-Mughira bin al-Nu'man al-Nakha'i المغيرة بن النعمان النخعي الكوفي",
  "full_name": "al-Mughira bin al-Nu'man al-Nakha'i المغيرة بن النعمان النخعي الكوفي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Nakha'i",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "29549",
      "name": "'Abdullah bin Yazid bin al-Aqn' عبد الله بن يزيد بن الأقنع",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25221",
      "name": "'Unbasa bin Sa'id bin al-Durays عنبسة بن سعيد بن الضريس",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28688",
      "name": "Abu Malik al-Nkh'y al-Wasty أبو مالك النخعي الواسطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3349",
      "hadith_no": "3349",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا المغيرة بن النعمان، قال حدثني سعيد بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ إنكم محشورون حفاة عراة غرلا  ثم قرأ – ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ وأول من يكسى يوم القيامة إبراهيم، وإن أناسا من أصحابي يؤخذ بهم ذات الشمال فأقول أصحابي أصحابي‏.‏ فيقول، إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم‏.‏ فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت فيهم‏}‏ إلى قوله ‏{‏الحكيم ‏}‏‏\"‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"You will be gathered (on the Day of Judgment), bare-footed, naked and not circumcised.\" He then recited:--'As We began the first creation, We, shall repeat it: A Promise We have undertaken: Truly we shall do it.' (21.104) He added, \"The first to be dressed on the Day of Resurrection, will be Abraham, and some of my companions will be taken towards the left side (i.e. to the (Hell) Fire), and I will say: 'My companions! My companions!' It will be said: 'They renegade from Islam after you left them.' Then I will say as the Pious slave of Allah (i.e. Jesus) said. 'And I was a witness Over them while I dwelt amongst them. When You took me up You were the Watcher over them, And You are a witness to all things. If You punish them. They are Your slaves And if You forgive them, Verily you, only You are the All-Mighty, the All-Wise.\" (5.120-121)",
      "usc_msa_ref": "568",
      "chain": [
        "28531",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3447",
      "hadith_no": "3447",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تحشرون حفاة عراة غرلا، ثم قرأ ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ فأول من يكسى إبراهيم، ثم يؤخذ برجال من أصحابي ذات اليمين وذات الشمال فأقول أصحابي فيقال إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم، فأقول كما قال العبد الصالح عيسى ابن مريم ‏{‏وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شىء شهيد‏}‏ إلى قوله ‏{‏العزيز الحكيم‏}‏‏\"‏‏.‏ قال محمد بن يوسف ذكر عن أبي عبد الله عن قبيصة قال هم المرتدون الذين ارتدوا على عهد أبي بكر، فقاتلهم أبو بكر  رضى الله عنه‏.‏",
      "text_en": " Narrted Ibn `Abbas:                     Allah's Apostle said, \"You will be resurrected (and assembled) bare-footed, naked and uncircumcised.\" The Prophet then recited the Divine Verse:-- \"As We began the first creation, We shall repeat it: A promise We have undertaken. Truly we shall do it.\" (21.104) He added, \"The first to be dressed will be Abraham. Then some of my companions will take to the right and to the left. I will say: 'My companions! 'It will be said, 'They had been renegades since you left them.' I will then say what the Pious Slave Jesus, the son of Mary said: 'And I was a witness over them while I dwelt amongst them; when You did take me up, You were the Watcher over them, and You are a Witness to all things. If You punish them, they are Your slaves, and if you forgive them, You, only You are the All-Mighty the All-Wise.' \" (5.117-118) Narrated Quaggas, \"Those were the apostates who renegade from Islam during the Caliphate of Abu Bakr who fought them\".",
      "usc_msa_ref": "",
      "chain": [
        "30388",
        "20005",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4669",
      "hadith_no": "4669",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، أخبرنا المغيرة بن النعمان، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خطب رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا أيها الناس إنكم محشورون إلى الله حفاة عراة غرلا  ثم قال  ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ إلى آخر الآية  ثم قال  ألا وإن أول الخلائق يكسى يوم القيامة إبراهيم، ألا وإنه يجاء برجال من أمتي فيؤخذ بهم ذات الشمال، فأقول يا رب أصيحابي‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك‏.‏ فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم‏}‏ فيقال إن هؤلاء لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle delivered a sermon and said, \"O people! You will be gathered before Allah barefooted, naked and not circumcised.\" Then (quoting Qur'an) he said:-- \"As We began the first creation, We shall repeat it. A promise We have undertaken: Truly we shall do it..\" (21.104) The Prophet then said, \"The first of the human beings to be dressed on the Day of Resurrection, will be Abraham. Lo! Some men from my followers will be brought and then (the angels) will drive them to the left side (Hell-Fire). I will say. 'O my Lord! (They are) my companions!' Then a reply will come (from Almighty), 'You do not know what they did after you.' I will say as the pious slave (the Prophet Jesus) said: And I was a witness over them while I dwelt amongst them. When You took me up. You were the Watcher over them and You are a Witness to all things.' (5.117) Then it will be said, \"These people have continued to be apostates since you left them.\"",
      "usc_msa_ref": "149",
      "chain": [
        "20296",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4670",
      "hadith_no": "4670",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، حدثنا المغيرة بن النعمان، قال حدثني سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنكم محشورون، وإن ناسا يؤخذ بهم ذات الشمال، فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت فيهم‏}‏ إلى قوله ‏{‏العزيز الحكيم ‏}‏‏\"‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"You will be gathered (on the Day of Resurrection) and some people will be driven (by the angels) to the left side (and taken to Hell) whereupon I will say as the pious slave (Jesus) said:- - \"And I was a witness over them while I dwelt amongst them...the ALMIGHTY, the All Wise.\" (5.117-118)",
      "usc_msa_ref": "150",
      "chain": [
        "28531",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4787",
      "hadith_no": "4787",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن المغيرة بن النعمان، شيخ من النخع عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خطب النبي صلى الله عليه وسلم فقال ‏\"‏ إنكم محشورون إلى الله حفاة عراة غرلا ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ ثم إن أول من يكسى يوم القيامة إبراهيم، ألا إنه يجاء برجال من أمتي، فيؤخذ بهم ذات الشمال، فأقول يا رب أصحابي فيقال لا تدري ما أحدثوا بعدك فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت‏}‏ إلى قوله ‏{‏شهيد‏}‏ فيقال إن هؤلاء لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet delivered a sermon and said, \"You (people) will be gathered before Allah (on the Day of Resurrection) bare-footed, naked and uncircumcised.\" (The Prophet then recited):-- 'As We began the first creation We shall repeat it. (It is) a promise We have undertaken and truly We shall do it.' and added, \"The first man who will be dressed on the Day of Resurrection, will be Abraham. Lo! Some men from my followers will be brought and taken towards the left side, whereupon I will say, 'O Lord, (these are) my companions!' It will be said, 'You do not know what new things they introduced (into the religion) after you.' I will then say as the righteous pious slave, Jesus, said, 'I was a witness over them while I dwelt among them...(to His Statement)..and You are the Witness to all things.' (5.117) Then it will be said, '(O Muhammad) These people never stopped to apostate since you left them.\"",
      "usc_msa_ref": "264",
      "chain": [
        "20193",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4810",
      "hadith_no": "4810",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في قتل المؤمن، فرحلت فيه إلى ابن عباس، فقال نزلت في آخر ما نزل ولم ينسخها شىء‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     The people of Kufa differed as regards the killing of a believer so I entered upon Ibn `Abbas (and asked him) about that. Ibn `Abbas said, \"The Verse (in Surat-An-Nisa', 4:93) was the last thing revealed in this respect and nothing cancelled its validity.\"",
      "usc_msa_ref": "286",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11655",
        "11050"
      ]
    },
    {
      "id": "sahih-bukhari-6605",
      "hadith_no": "6605",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قام فينا النبي صلى الله عليه وسلم يخطب فقال ‏\"‏ إنكم محشورون حفاة عراة ‏{‏كما بدأنا أول خلق نعيده‏}‏ الآية، وإن أول الخلائق يكسى يوم القيامة إبراهيم، وإنه سيجاء برجال من أمتي، فيؤخذ بهم ذات الشمال‏.‏ فأقول يا رب أصيحابي‏.‏ فيقول إنك لا تدري ما أحدثوا بعدك‏.‏ فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت فيهم‏}‏ إلى قوله ‏{‏الحكيم‏}‏ قال فيقال إنهم لم يزالوا مرتدين على أعقابهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet stood up among us and addressed (saying) \"You will be gathered, barefooted, naked, and uncircumcised (as Allah says): 'As We began the first creation, We shall repeat it..' (21.104) And the first human being to be dressed on the Day of Resurrection will be (the Prophet) Abraham Al-Khalil. Then will be brought some men of my followers who will be taken towards the left (i.e., to the Fire), and I will say: 'O Lord! My companions whereupon Allah will say: You do not know what they did after you left them. I will then say as the pious slave, Jesus said, And I was witness over them while I dwelt amongst them..........(up to) ...the All-Wise.' (5.117-118). The narrator added: Then it will be said that those people (relegated from Islam, that is) kept on turning on their heels (deserted Islam).",
      "usc_msa_ref": "533",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-7380",
      "hadith_no": "7380",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا عبيد الله بن معاذ، حدثنا  أبي كلاهما، عن شعبة، ح وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قام فينا رسول الله صلى الله عليه وسلم خطيبا بموعظة فقال ‏\"‏ يا أيها الناس إنكم تحشرون إلى الله حفاة عراة غرلا ‏{‏ كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ ألا وإن أول الخلائق يكسى يوم القيامة إبراهيم عليه السلام ألا وإنه سيجاء برجال من أمتي فيؤخذ بهم ذات الشمال فأقول يا رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏.‏ فأقول كما قال العبد الصالح ‏{‏ وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شىء شهيد * إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏}‏ قال فيقال لي إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏ ‏.‏ وفي حديث وكيع ومعاذ ‏\"‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through other chains of transmitters on the authority of Ibn Abbas, (and) the words are:                      While Allah's Messenger (may peace be upon him) stood up to deliver a sermon, he said: 0 people, Allah would make you assemble barefooted, naked and uncircumcised (and then recited the words of the Qur'an):\" As We created you for the first time, We shall repeat it. (It is) a promise (binding) upon us. Lo! We are to perform it, and the first person who would be clothed on the Day of Resurrection would be (Hadrat) Ibrahim (peace be upon him)\" and, behold! some persons of my Ummah would be brought and taken to the left and I would say: My Lord, they are my companions, and it would be said: You do not know what they did after you, and I would say just as the pious servant (Hadrat 'Isa) said:, I was a witness regarding them as I remained among them and Thou art a witness over everything, so if Thou chastisest them, they are Thy servants and if Thou for- givest them, Thou art Mighty, Wise\" (v. 117-118). And it would be said to him: They constantly turned to their heels since you left them. This hadith has been transmitted on the authority of Waki' and Mu'adh (and the words are):\" What new things they fabricated.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "30150",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-7726",
      "hadith_no": "7726",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم‏}‏ فرحلت إلى ابن عباس فسألته عنها فقال لقد أنزلت آخر ما أنزل ثم ما نسخها شىء ‏.‏",
      "text_en": " Sa'id b. Jubair reported:                      The inhabitants of Kufa differed in regard to this verse:\" But whoever slays another believer intentionally, his requital shall be Hell\" (iv. 92), so I went to Ibn 'Abbas and asked him about it, whereupon he said: This has been revealed and nothing abrogated it.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11655",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-4275",
      "hadith_no": "4275",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال ‏{‏ ومن يقتل مؤمنا متعمدا ‏}‏ قال ما نسخها شىء ‏.‏",
      "text_en": " Ibn 'Abbas said:                      No other verse has repealed the verse \"If a man kills a believer intentionally\"",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20033",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2609",
      "hadith_no": "2609",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يحشر الناس يوم القيامة حفاة عراة غرلا كما خلقوا ثم قرأ ‏(‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين ‏)‏ وأول من يكسى من الخلائق إبراهيم ويؤخذ من أصحابي برجال ذات اليمين وذات الشمال فأقول يا رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏.‏ فأقول كما قال العبد الصالح‏:‏ ‏(‏إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏)‏ ‏\"‏‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said:                     \"The people will be gathered on the Day of Resurrection bare-foot, naked and uncircumcised as they were created.\" Then he recited: \"As we begin the first creation, we shall repeat it: A promise binding upon Us. Truly We shall do it. And the first of people to be clothed will be Ibrahim. Among my companions will be some men who are taken to the right and to the left. I will say: 'O my Lord! My companions!' It will be said: 'You do not know what they innovated after you, they continued to be apostates since you parted from them.' So I will say as the righteous worshipper said: If you punish them, they are your slaves, and if You forgive them, indeed You, only You are the Almighty, the All-Wise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2610",
      "hadith_no": "2610",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا محمد بن جعفر، عن شعبة، عن المغيرة بن النعمان، بهذا الإسناد فذكر نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30170",
        "20173",
        "20020",
        "11655"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3464",
      "hadith_no": "3464",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، ووهب بن جرير، وأبو داود قالوا حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قام رسول الله صلى الله عليه وسلم بالموعظة فقال ‏\"‏ يا أيها الناس إنكم محشورون إلى الله عراة غرلا ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏ كما بدأنا أول خلق نعيده وعدا علينا ‏)‏ إلى آخر الآية قال ‏\"‏ أول من يكسى يوم القيامة إبراهيم وإنه سيؤتى برجال من أمتي فيؤخذ بهم ذات الشمال فأقول رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك ‏.‏ فأقول كما قال العبد الصالح ‏(‏ وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شيء شهيد * إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم ‏)‏ فيقال هؤلاء لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) stood to deliver a Khutbah, he said: 'O you people! You will be gathered before Allah naked and uncircumcised.' Then he recited: 'As We began the first creation, We shall repeat it...' until the end of the Ayah (21:104). He said: 'The first to be clothed on the Day of Resurrection is Ibrahim. Indeed some men from my Ummah will be brought and taken from the left side, so I will say: \"My Lord! My followers!\" It will be said: \"Indeed you do not know what they innovated after you.' So I shall say as the righteous slave said: 'And I was a witness over them while I dwelt among them, but when You took me up, You were the Watcher over them. If You punish them, they are your slaves, and if You forgive them...' [until the end of] the Ayah (5:117 & 118) I shall be told: 'These people have not ceased turning on their heels as apostates ever since you parted from them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20298",
        "20547",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3465",
      "hadith_no": "3465",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن المغيرة بن النعمان، نحوه ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ورواه سفيان الثوري عن المغيرة بن النعمان نحوه ‏.‏ قال أبو عيسى كأنه تأوله على أهل الردة ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11655",
        "20012",
        "11655"
      ]
    },
    {
      "id": "sunan-an-nasai-2082",
      "hadith_no": "2082",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن سفيان، قال حدثني المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يحشر الناس يوم القيامة عراة غرلا وأول الخلائق يكسى إبراهيم عليه السلام ثم قرأ ‏{‏ كما بدأنا أول خلق نعيده ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet said:                     \"The people will be gathered on the Day of Resurrection naked and uncircumcised. The first one to be clothed will be Ibrahim.\" Then he recited: As We began the first creation, We shall repeat it",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2087",
      "hadith_no": "2087",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمود بن غيلان، قال أخبرنا وكيع، ووهب بن جرير، وأبو داود عن شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قام رسول الله صلى الله عليه وسلم بالموعظة فقال ‏\"‏ يا أيها الناس إنكم محشورون إلى الله عز وجل عراة ‏\"‏ ‏.‏ قال أبو داود ‏\"‏ حفاة غرلا ‏\"‏ ‏.‏ وقال وكيع ووهب ‏\"‏ عراة غرلا ‏{‏ كما بدأنا أول خلق نعيده ‏}‏ قال أول من يكسى يوم القيامة إبراهيم عليه السلام وإنه سيؤتى ‏\"‏ ‏.‏ قال أبو داود ‏\"‏ يجاء ‏\"‏ ‏.‏ وقال وهب ووكيع ‏\"‏ سيؤتى برجال من أمتي فيؤخذ بهم ذات الشمال فأقول رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك فأقول كما قال العبد الصالح ‏{‏ وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني ‏}‏ إلى قوله ‏{‏ وإن تغفر لهم ‏}‏ الآية فيقال إن هؤلاء لم يزالوا مدبرين ‏\"‏ ‏.‏ قال أبو داود ‏\"‏ مرتدين على أعقابهم منذ فارقتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah stood up to give an admonition and he said: 'O people, you will be gathered to Allah naked.\"' (One of the narrators) Abu Dawud said: \"Barefoot and uncircumcised.\" (The narrators) Waki and Wahb said: \"Naked and uncircumcised: As We began the first creation, We shall repeat it.The first one to be clothed on the Day of Resurrection will be Ibrahim, peace be upon him. Then some men from among my Ummah will be brought and will be taken toward the left. I will say: 'O Lord, my companions.' It will be said: 'You do not know what they innovated after you were gone,' and I shall say what the righteous slave said: 'And I was witness over them while I dwelt amongst them, but when You took me up, You were the Watcher over them, but when You took me up, You were the Watcher over them; and You are a Witness to all things. If You punish them, they are Your slaves, and if You forgive them, verily, You, only You, are the All-Mighty, the All-Wise.' And it will be said: 'These people kept turning away since you left them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20298",
        "20547",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4000",
      "hadith_no": "4000",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "قال وأخبرني أزهر بن جميل البصري، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا ‏}‏ فرحلت إلى ابن عباس فسألته فقال لقد أنزلت في آخر ما أنزل ثم ما نسخها شىء ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jubair said:                     \"The people of Al-Kufah differed concerning this Verse: \"And whoever kills a believer intentionally.\" So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11655",
        "11050"
      ]
    },
    {
      "id": "sunan-an-nasai-4864",
      "hadith_no": "4864",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أزهر بن جميل، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا ‏}‏ فرحلت إلى ابن عباس فسألته فقال نزلت في آخر ما أنزلت وما نسخها شىء ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jabair said:                     \"The people of Al-Kufah differed concerning this verse: 'And whoever kills a believer intentionally. So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.",
      "usc_msa_ref": "",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11655",
        "11050"
      ]
    }
  ],
  "total_hadiths": 18
}