{
  "id": "11650",
  "name": "Mjz'ah bin Zahr bin al-Aswad مجزأة بن زاهر",
  "full_name": "Mjz'ah bin Zahr bin al-Aswad مجزأة بن زاهر",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Aslami",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4075",
      "name": "Ahban bin Aus al-Aslami ( أهبان بن أوس الأسلمى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5308",
      "name": "Najiyya bin Jundab bin K'ab ( ناجية بن جندب بن كعب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4224",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا إسرائيل، عن مجزأة بن زاهر الأسلمي، عن أبيه  وكان ممن شهد الشجرة  قال إني لأوقد تحت القدر بلحوم الحمر إذ نادى منادي رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم ينهاكم عن لحوم الحمر‏.‏",
      "text_en": " Narrated Zahir Al-Aslami:                     (who was one of those who had witnessed (the Pledge of allegiance beneath) the Tree) While I was making fire beneath the cooking pots containing donkey's meat, the announcer of Allah's Apostle announced, \"Allah's Apostle forbids you to eat donkey's meat.\" The same narration was told by Majzaa from a man called Uhban bin Aus who was one of those who had witnessed (the Pledge of allegiance beneath) the Tree., and who had some trouble in his knee so that while doing prostrations, he used to put a pillow underneath his knee.",
      "chain": [
        "30351",
        "20443",
        "20311",
        "11650"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن مجزأة بن زاهر، قال سمعت عبد الله بن أبي أوفى، يحدث عن النبي صلى الله عليه وسلم أنه كان يقول ‏\"‏ اللهم لك الحمد ملء السماء وملء الأرض وملء ما شئت من شىء بعد اللهم طهرني بالثلج والبرد والماء البارد اللهم طهرني من الذنوب والخطايا كما ينقى الثوب الأبيض من الوسخ ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abu Aufa reported that the Apostle of Allah (may peace be upon him) used to recite (this supplication):                      O Allah! our Lord, unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides (them). O Allah! purify me with snow, (water of) hail and with cold water; O Allah. cleanse me from the sins and errors just as a white garment is cleansed from dirt.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11650",
        "5115"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن إبراهيم، قال حدثنا بشر بن المفضل، قال حدثنا شعبة، عن مجزأة بن زاهر، أنه سمع عبد الله بن أبي أوفى، يحدث عن النبي صلى الله عليه وسلم أنه كان يدعو ‏‏\"‏‏ اللهم طهرني من الذنوب والخطايا اللهم نقني منها كما ينقى الثوب الأبيض من الدنس اللهم طهرني بالثلج والبرد والماء البارد ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " 'Abdullah bin Abi Awfa narrated that the Prophet (ﷺ) would supplicate:                      \"Allahumma tahhirni min adh-dhunub wal-khataya. Allahumma naqqini minha kama yunaqqa ath-thawb al-abyad min ad-danas, Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid (O Allah, purify me of sin and error, O Allah cleanse me of it as a white garment is cleansed of dirt, O Allah purify me with snow and hail and cold water).\"",
      "chain": [
        "11213",
        "20212",
        "20020",
        "11650",
        "5115"
      ]
    }
  ],
  "total_hadiths": 3
}