{
  "id": "11651",
  "name": "Mhl bin Khlyfh al-Ta'iy al-Kwfy محل بن خليفة",
  "full_name": "Mhl bin Khlyfh al-Ta'iy al-Kwfy محل بن خليفة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Tai'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11628",
      "name": "Sa'd Abu Mjahd al-Ta'iy سعد أبو مجاهد الطائي الكوفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "25357",
      "name": "Yahya bin al-Walid bin al-Masayr يحيى بن الوليد الطائي أبو الزعراء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1434",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم النبيل، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة الطائي، قال سمعت عدي بن حاتم  رضى الله عنه  يقول كنت عند رسول الله صلى الله عليه وسلم فجاءه رجلان أحدهما يشكو العيلة، والآخر يشكو قطع السبيل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما قطع السبيل فإنه لا يأتي عليك إلا قليل حتى تخرج العير إلى مكة بغير خفير، وأما العيلة فإن الساعة لا تقوم حتى يطوف أحدكم بصدقته لا يجد من يقبلها منه، ثم ليقفن أحدكم بين يدى الله ليس بينه وبينه حجاب ولا ترجمان يترجم له، ثم ليقولن له ألم أوتك مالا فليقولن بلى‏.‏ ثم ليقولن ألم أرسل إليك رسولا فليقولن بلى‏.‏ فينظر عن يمينه فلا يرى إلا النار، ثم ينظر عن شماله فلا يرى إلا النار، فليتقين أحدكم النار ولو بشق تمرة، فإن لم يجد فبكلمة طيبة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     While I was sitting with Allah's Apostle (p.b.u.h) two person came to him; one of them complained about his poverty and the other complained about the prevalence of robberies. Allah's Apostle said, \"As regards stealing and robberies, there will shortly come a time when a caravan will go to Mecca (from Medina) without any guard. And regarding poverty, The Hour (Day of Judgment) will not be established till one of you wanders about with his object of charity and will not find anybody to accept it And (no doubt) each one of you will stand in front of Allah and there will be neither a curtain nor an interpreter between him and Allah, and Allah will ask him, 'Did not I give you wealth?' He will reply in the affirmative. Allah will further ask, 'Didn't send a messenger to you?' And again that person will reply in the affirmative Then he will look to his right and he will see nothing but Hell-fire, and then he will look to his left and will see nothing but Hell-fire. And so, any (each one) of you should save himself from the fire even by giving half of a date-fruit (in charity). And if you do not find a hall datefruit, then (you can do it through saying) a good pleasant word (to your brethren). (See Hadith No. 793 Vol. 4).",
      "chain": [
        "30351",
        "20241",
        "11651",
        "212"
      ]
    },
    {
      "hadith_no": "3637",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن الحكم، أخبرنا النضر، أخبرنا إسرائيل، أخبرنا سعد الطائي، أخبرنا محل بن خليفة، عن عدي بن حاتم، قال بينا أنا عند النبي، صلى الله عليه وسلم إذ أتاه رجل فشكا إليه الفاقة، ثم أتاه آخر، فشكا قطع السبيل‏.‏ فقال ‏\"‏ يا عدي هل رأيت الحيرة ‏\"‏‏.‏ قلت لم أرها وقد أنبئت عنها‏.‏ قال ‏\"‏ فإن طالت بك حياة لترين الظعينة ترتحل من الحيرة، حتى تطوف بالكعبة، لا تخاف أحدا إلا الله ‏\"‏  قلت فيما بيني وبين نفسي فأين دعار طيئ الذين قد سعروا البلاد ‏\"‏ ولئن طالت بك حياة لتفتحن كنوز كسرى ‏\"‏‏.‏ قلت كسرى بن هرمز قال ‏\"‏ كسرى بن هرمز، ولئن طالت بك حياة، لترين الرجل يخرج ملء كفه من ذهب أو فضة، يطلب من يقبله منه، فلا يجد أحدا يقبله منه، وليلقين الله أحدكم يوم يلقاه، وليس بينه وبينه ترجمان يترجم له‏.‏ فيقولن ألم أبعث إليك رسولا فيبلغك فيقول بلى‏.‏ فيقول ألم أعطك مالا وأفضل عليك فيقول بلى‏.‏ فينظر عن يمينه فلا يرى إلا جهنم، وينظر عن يساره فلا يرى إلا جهنم ‏\"‏‏.‏ قال عدي سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ اتقوا النار ولو بشقة تمرة، فمن لم يجد شقة تمرة فبكلمة طيبة ‏\"‏‏.‏ قال عدي فرأيت الظعينة ترتحل من الحيرة حتى تطوف بالكعبة، لا تخاف إلا الله، وكنت فيمن افتتح كنوز كسرى بن هرمز، ولئن طالت بكم حياة لترون ما قال النبي أبو القاسم صلى الله عليه وسلم ‏\"‏ يخرج ملء كفه ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     While I was in the city of the Prophet, a man came and complained to him (the Prophet, ) of destitution and poverty. Then another man came and complained of robbery (by highwaymen). The Prophet said, \"Adi! Have you been to Al-Hira?\" I said, \"I haven't been to it, but I was informed about it.\" He said, \"If you should live for a long time, you will certainly see that a lady in a Howdah traveling from Al-Hira will (safely reach Mecca and) perform the Tawaf of the Ka`ba, fearing none but Allah.\" I said to myself, \"What will happen to the robbers of the tribe of Tai who have spread evil through out the country?\" The Prophet further said. \"If you should live long, the treasures of Khosrau will be opened (and taken as spoils).\" I asked, \"You mean Khosrau, son of Hurmuz?\" He said, \"Khosrau, son of Hurmuz; and if you should live long, you will see that one will carry a handful of gold or silver and go out looking for a person to accept it from him, but will find none to accept it from him. And any of you, when meeting Allah, will meet Him without needing an interpreter between him and Allah to interpret for him, and Allah will say to him: 'Didn't I send a messenger to teach you?' He will say: 'Yes.' Allah will say: 'Didn't I give you wealth and do you favors?' He will say: 'Yes.' Then he will look to his right and see nothing but Hell, and look to his left and see nothing but Hell.\" `Adi further said: I heard the Prophet saying, \"Save yourself from the (Hell) Fire even with half a date (to be given in charity) and if you do not find a half date, then with a good pleasant word.\" `Adi added: (later on) I saw a lady in a Howdah traveling from Al-Hira till she performed the Tawaf of the Ka`ba, fearing none but Allah. And I was one of those who opened (conquered) the treasures of Khosrau, son of Hurmuz. If you should live long, you will see what the Prophet Abu-l-Qasim had said: 'A person will come out with a handful. of gold...etc.",
      "chain": [
        "20291",
        "20311",
        "11651",
        "212"
      ]
    },
    {
      "hadith_no": "3638",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله، حدثنا أبو عاصم، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة، سمعت عديا، كنت عند النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Adi:                     as above (i.e. Hadith No. 793).",
      "chain": [
        "20025",
        "20241",
        "11651"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مجاهد بن موسى، وعباس بن عبد العظيم العنبري، - المعنى - قالا حدثنا عبد الرحمن بن مهدي، حدثني يحيى بن الوليد، حدثني محل بن خليفة، حدثني أبو السمح، قال كنت أخدم النبي صلى الله عليه وسلم فكان إذا أراد أن يغتسل قال ‏\"‏ ولني قفاك ‏\"‏ ‏.‏ فأوليه قفاى فأستره به فأتي بحسن أو حسين - رضى الله عنهما - فبال على صدره فجئت أغسله فقال ‏\"‏ يغسل من بول الجارية ويرش من بول الغلام ‏\"‏ ‏.‏ قال عباس حدثنا يحيى بن الوليد ‏.‏ قال أبو داود وهو أبو الزعراء ‏.‏ قال هارون بن تميم عن الحسن قال الأبوال كلها سواء ‏.‏",
      "text_en": " Narrated AbusSamh:                     I used to serve the Prophet (ﷺ). Whenever he intended to wash himself, he would say: Turn your back towards me, So I would turn my back and hide him. (Once) Hasan or Husayn (may Allah be pleased with them) was brought to him and he passed water on his chest. I came to wash it. He said: It is only the urine of a female which should be washed; the urine of a male should be sprinkled over.'Abbas (a narrator) said: Yahya b. al-Walid narrated the tradition to us. Abu Dawud said: He (Yahya) is Abu al-Za'ra'. Harun b. Tamim said on the authority of al-Hasan: All sorts of urine are equal.",
      "chain": [
        "30521",
        "30437",
        "20033",
        "25357",
        "11651",
        "3073"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا مجاهد بن موسى، قال حدثنا عبد الرحمن بن مهدي، قال حدثني يحيى بن الوليد، قال حدثني محل بن خليفة، قال حدثني أبو السمح، قال كنت أخدم رسول الله صلى الله عليه وسلم فكان إذا أراد أن يغتسل قال ‏\"‏ ولني قفاك ‏\"‏ ‏.‏ فأوليه قفاى فأستره به ‏.‏",
      "text_en": " Abu As-Samh said:                      \"I used to serve the Messenger of Allah (ﷺ) and when he wanted to perform Ghusl he said: 'Turn your back.' So I turned my back to him and concealed him.\"",
      "chain": [
        "30521",
        "20033",
        "25357",
        "11651",
        "3073"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا مجاهد بن موسى، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا يحيى بن الوليد، قال حدثني محل بن خليفة، قال حدثني أبو السمح، قال قال النبي صلى الله عليه وسلم ‏\"‏ يغسل من بول الجارية ويرش من بول الغلام ‏\"‏ ‏.‏",
      "text_en": " Abu As-Samh said:                      \"The Prophet (ﷺ) said: 'A girl's urine should be washed away and a boy's urine should be sprinkled with water.'\"",
      "chain": [
        "30521",
        "20033",
        "25357",
        "11651",
        "3073"
      ]
    },
    {
      "hadith_no": "569",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن علي، ومجاهد بن موسى، والعباس بن عبد العظيم، قالوا حدثنا عبد الرحمن بن مهدي، حدثنا يحيى بن الوليد، حدثنا محل بن خليفة، أخبرنا أبو السمح، قال كنت خادم النبي  صلى الله عليه وسلم  فجيء بالحسن أو الحسين فبال على صدره فأرادوا أن يغسلوه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ رشه فإنه يغسل بول الجارية ويرش على بول الغلام ‏\"‏ ‏.‏",
      "text_en": " Abu Samh said:                     \"I was a servant of the Prophet, and Hasan and Husain was brought to him and (the infant) urinated on his chest. They wanted to wash it, but the Messenger of Allah said: 'Sprinkle water on it, for the urine of a girl should be washed, but the urine of a boy should be sprinkled over with water.'\"",
      "chain": [
        "30153",
        "30521",
        "30437",
        "20033",
        "25357",
        "11651",
        "3073"
      ]
    },
    {
      "hadith_no": "656",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، وأبو حفص عمرو بن علي الفلاس ومجاهد بن موسى قالوا حدثنا عبد الرحمن بن مهدي، حدثنا يحيى بن الوليد، أخبرني محل بن خليفة، حدثني أبو السمح، قال كنت أخدم النبي  صلى الله عليه وسلم  فكان إذا أراد أن يغتسل قال ‏\"‏ ولني ‏\"‏ ‏.‏ فأوليه قفاى وأنشر الثوب فأستره به ‏.‏",
      "text_en": " Abu Samh said:                     \"I used to serve the Prophet, and when he wanted to take a bath he would say: 'Turn your back to me.' So I would turn my back and hung up a cloth, and concealed him with it.\"",
      "chain": [
        "30437",
        "30286",
        "20033",
        "25357",
        "11651",
        "3073"
      ]
    }
  ],
  "total_hadiths": 8
}