{
  "id": "11652",
  "name": "Makhariq bin Khalifa/'Abdullah مخارق بن خليفة",
  "full_name": "Makhariq bin Khalifa/'Abdullah مخارق بن خليفة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  قد  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Ahamsi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25062",
      "name": "Husayn bin 'Umar al-Ahmsy حصين بن عمر الأحمسي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "12327",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد الله بن موهب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4000",
      "hadith_no": "4000",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا إسرائيل، عن مخارق، عن طارق بن شهاب، قال سمعت ابن مسعود، يقول شهدت من المقداد بن الأسود مشهدا، لأن أكون صاحبه أحب إلى مما عدل به، أتى النبي صلى الله عليه وسلم وهو يدعو على المشركين فقال لا نقول كما قال قوم موسى ‏{‏اذهب أنت وربك فقاتلا‏}‏ ولكنا نقاتل عن يمينك وعن شمالك وبين يديك وخلفك‏.‏ فرأيت النبي صلى الله عليه وسلم أشرق وجهه وسره‏.‏ يعني قوله‏.‏",
      "text_en": " Narrated Ibn Masud:                     I witnessed Al-Miqdad bin Al-Aswad in a scene which would have been dearer to me than anything had I been the hero of that scene. He (i.e. Al-Miqdad) came to the Prophet while the Prophet was urging the Muslims to fight with the pagans. Al-Miqdad said, \"We will not say as the People of Moses said: Go you and your Lord and fight you two. (5.27). But we shall fight on your right and on your left and in front of you and behind you.\" I saw the face of the Prophet getting bright with happiness, for that saying delighted him.",
      "usc_msa_ref": "288",
      "chain": [
        "20348",
        "20311",
        "11652",
        "3680",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4652",
      "hadith_no": "4652",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا إسرائيل، عن مخارق، عن طارق بن شهاب، سمعت ابن مسعود  رضى الله عنه  قال شهدت من المقداد ح وحدثني حمدان بن عمر حدثنا أبو النضر حدثنا الأشجعي عن سفيان عن مخارق عن طارق عن عبد الله قال قال المقداد يوم بدر يا رسول الله إنا لا نقول لك كما قالت بنو إسرائيل لموسى ‏{‏فاذهب أنت وربك فقاتلا إنا ها هنا قاعدون‏}‏ ولكن امض ونحن معك‏.‏ فكأنه سري عن رسول الله صلى الله عليه وسلم‏.‏ ورواه وكيع عن سفيان عن مخارق عن طارق أن المقداد قال ذلك للنبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah (bin Masud):                     On the day of Badr, Al-Miqdad said, \"O Allah's Apostle! We do not say to you as the children of Israel said to Moses, 'Go you and your Lord and fight you two; we are sitting here, (5.24) but (we say). \"Proceed, and we are with you.\" That seemed to delight Allah's Apostle greatly.",
      "usc_msa_ref": "133",
      "chain": [
        "20348",
        "20311",
        "11652",
        "3680",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-6165",
      "hadith_no": "6165",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن مخارق، سمعت طارقا، قال قال عبد الله إن أحسن الحديث كتاب الله، وأحسن الهدى هدى محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Tariq:                     `Abdullah said, \"The best talk is Allah's Book (Qur'an), and the best guidance is the guidance of Muhammad.\"",
      "usc_msa_ref": "120",
      "chain": [
        "20296",
        "20020",
        "11652",
        "11355",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4307",
      "hadith_no": "4307",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن بشر العبدي، حدثنا عبد الله بن عبد الله بن الأسود، عن حصين بن عمر الأحمسي، عن مخارق بن عبد الله، عن طارق بن شهاب، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من غش العرب لم يدخل في شفاعتي ولم تنله مودتي ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث حصين بن عمر الأحمسي عن مخارق ‏.‏ وليس حصين عند أهل الحديث بذاك القوي ‏.‏",
      "text_en": " Narrated 'Uthman bin 'Affan:                     that the Messenger of Allah (ﷺ) said: \"Whoever cheats the Arabs, he will not be included in my intercession, and my love shall not reach him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20352",
        "25146",
        "25062",
        "11652",
        "3680",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-326",
      "hadith_no": "326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا أمية بن خالد، قال أنبأنا شعبة، أن مخارقا، أخبرهم عن طارق، أن رجلا، أجنب فلم يصل فأتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ أصبت ‏\"‏ ‏.‏ فأجنب رجل آخر فتيمم وصلى فأتاه فقال نحو ما قال للآخر يعني ‏\"‏ أصبت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Tariq that a man became Junub and did not pray, then he came to the Prophet (ﷺ) and mentioned that to him. He said:                      \"You did the right thing.\" Another man became Junub and performed Tayammum and prayed, and he came to him and he said something similar to what he had told the other man - meaning, you did the right thing.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20530",
        "20020",
        "11652",
        "11355"
      ]
    },
    {
      "id": "sunan-an-nasai-434b",
      "hadith_no": "434b",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، أنبأنا أمية بن خالد، حدثنا شعبة، أن مخارقا، أخبرهم عن طارق بن شهاب، أن رجلا، أجنب فلم يصل فأتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ أصبت ‏\"‏ ‏.‏ فأجنب رجل آخر فتيمم وصلى فأتاه فقال نحوا مما قال للآخر يعني ‏\"‏ أصبت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Tariq bin Shaihab that a man became Junub and did not pray. He came to the Prophet (ﷺ) and told him about that, and he said:                      \"You did the right thing.\" Then another man became Junub so he performed Tayammum and prayed. He came (to the Prophet (ﷺ)) who said to him what he had said to the other man- meaning, \"You did the right thing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20530",
        "20020",
        "11652",
        "3680"
      ]
    }
  ],
  "total_hadiths": 6
}