{
  "id": "11656",
  "name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
  "full_name": "al-Minhal bin 'Amr al-Asadi المنهال بن عمرو الأسدي مولاهم الكوفي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  4  -  صدوق ]"
    ],
    "tags": [
      "al-Asadi",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11337",
      "name": "Zar bin Habaysh bin Habasha زر بن حبيش بن حباشة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "18510",
      "name": "'Abdullah bin al-Harith عبد الله بن الحارث الكندي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14457",
      "name": "Abu 'Umar أبو عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11174",
      "name": "Suwayd bin Ghaflah bin Awsajah سويد بن غفلة بن عوسجة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11376",
      "name": "'Ali bin Rabi'a bin Nadla al-Walbi علي بن ربيعة بن نضلة الوالبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15265",
      "name": "'Aabad bin 'Abdullah عباد بن عبد الله الأسدي الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10504",
      "name": "'Aisha bint Talha عائشة بنت طلحة بن عبيد الله التيمى",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11605",
      "name": "'Ali bin al-Hakam al-Binani علي بن الحكم البناني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11191",
      "name": "'Abd Rabba bin Sa'id bin Qays bin 'Amr عبد ربه بن سعيد بن قيس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25322",
      "name": "Maysara bin Habib al-Nahdi ميسرة بن حبيب النهدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20728",
      "name": "Abu Khalid al-Dalani أبو خالد الدالاني الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15397",
      "name": "'Umar bin 'Abdullah bin Ya'la bin Marrah عمر بن عبد الله بن يعلى بن مرة الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20726",
      "name": "'Amr bin Abi Qays عمرو بن أبي قيس الرازي الأزرق كوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3371",
      "hadith_no": "3371",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن المنهال، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يعوذ الحسن والحسين ويقول ‏\"‏ إن أباكما كان يعوذ بها إسماعيل وإسحاق، أعوذ بكلمات الله التامة من كل شيطان وهامة، ومن كل عين لامة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to seek Refuge with Allah for Al-Hasan and Al-Husain and say: \"Your forefather (i.e. Abraham) used to seek Refuge with Allah for Ishmael and Isaac by reciting the following: 'O Allah! I seek Refuge with Your Perfect Words from every devil and from poisonous pests and from every evil, harmful, envious eye.' \"",
      "usc_msa_ref": "590",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5574",
      "hadith_no": "5574",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "تابعه سليمان عن شعبة، حدثنا المنهال، عن سعيد، عن ابن عمر، لعن النبي صلى الله عليه وسلم من مثل بالحيوان‏.‏ وقال عدي عن سعيد عن ابن عباس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet cursed the one who did Muthla to an animal (i e., cut its limbs or some other part of its body while it is still alive).",
      "usc_msa_ref": "424",
      "chain": [
        "20020",
        "11656",
        "11168"
      ]
    },
    {
      "id": "sunan-abi-daud-114",
      "hadith_no": "114",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو نعيم، حدثنا ربيعة الكناني، عن المنهال بن عمرو، عن زر بن حبيش، أنه سمع عليا، رضى الله عنه وسئل عن وضوء، رسول الله صلى الله عليه وسلم فذكر الحديث وقال ومسح على رأسه حتى لما يقطر وغسل رجليه ثلاثا ثلاثا ثم قال هكذا كان وضوء رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Zirr b. Hubaish said that the heard that ‘ Ali was asked how the Messenger of Allah (ﷺ) used to perform ablution. He then narrated the tradition and said:                      he wiped his head so much so that drops (of water) were about to trickle down. He then washed his feet three times and said: This is how the Messenger of Allah (ﷺ) performed ablutions.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20348",
        "15142",
        "11656",
        "11337",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-3106",
      "hadith_no": "3106",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا الربيع بن يحيى، حدثنا شعبة، حدثنا يزيد أبو خالد، عن المنهال بن عمرو، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من عاد مريضا لم يحضر أجله فقال عنده سبع مرار أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عافاه الله من ذلك المرض ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone visits a sick whose time (of death) has not come, and says with him seven times: I ask Allah, the Mighty, the Lord of the mighty Throne, to cure you, Allah will cure him from that disease.",
      "usc_msa_ref": "",
      "chain": [
        "30133",
        "20020",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3212",
      "hadith_no": "3212",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة رجل من الأنصار فانتهينا إلى القبر ولم يلحد بعد فجلس النبي صلى الله عليه وسلم مستقبل القبلة وجلسنا معه ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     We went out with the Messenger of Allah (ﷺ) to the funeral of a man of the Ansar, but when we reached the grave, the niche in the side had not yet been made, so the Prophet (ﷺ) sat down facing the qiblah, and we sat down along with him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-4737",
      "hadith_no": "4737",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن المنهال بن عمرو، عن سعيد بن جبير، عن ابن عباس، قال ‏:‏ كان النبي صلى الله عليه وسلم يعوذ الحسن والحسين ‏:‏ ‏\"‏ أعيذكما بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة ‏\"‏ ‏.‏ ثم يقول ‏:‏ ‏\"‏ كان أبوكم يعوذ بهما إسماعيل وإسحاق ‏\"‏ ‏.‏ قال أبو داود ‏:‏ هذا دليل على أن القرآن ليس بمخلوق ‏.‏",
      "text_en": " Ibn ‘abbas said :                      The Prophet (May peace be upon him) used to seek refuge in Allah for al-Hasan and al-husain, saying ; I seek refuge for both of you in the perfect words of Allah from every devil and every poisonous thing and from the evil eye which influences. He would then say; your father sought refuge in Allah by them for Ismail and Ishaq.Abu Dawud said; this is a proof of the fact that the Quran is not created.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4753",
      "hadith_no": "4753",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا هناد بن السري، حدثنا أبو معاوية، - وهذا لفظ هناد - عن الأعمش، عن المنهال، عن زاذان، عن البراء بن عازب، قال ‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في جنازة رجل من الأنصار، فانتهينا إلى القبر ولما يلحد، فجلس رسول الله صلى الله عليه وسلم وجلسنا حوله كأنما على رءوسنا الطير، وفي يده عود ينكت به في الأرض، فرفع رأسه فقال ‏:‏ ‏\"‏ استعيذوا بالله من عذاب القبر ‏\"‏ ‏.‏ مرتين أو ثلاثا - زاد في حديث جرير ها هنا - وقال ‏:‏ ‏\"‏ وإنه ليسمع خفق نعالهم إذا ولوا مدبرين حين يقال له ‏:‏ يا هذا من ربك وما دينك ومن نبيك ‏\"‏ ‏.‏ قال هناد قال ‏:‏ ‏\"‏ ويأتيه ملكان فيجلسانه فيقولان له ‏:‏ من ربك فيقول ‏:‏ ربي الله ‏.‏ فيقولان له ‏:‏ ما دينك فيقول ‏:‏ ديني الإسلام ‏.‏ فيقولان له ‏:‏ ما هذا الرجل الذي بعث فيكم قال فيقول ‏:‏ هو رسول الله صلى الله عليه وسلم ‏.‏ فيقولان ‏:‏ وما يدريك فيقول ‏:‏ قرأت كتاب الله فآمنت به وصدقت ‏\"‏ ‏.‏ زاد في حديث جرير ‏:‏ ‏\"‏ فذلك قول الله عز وجل ‏{‏ يثبت الله الذين آمنوا ‏}‏ ‏\"‏ ‏.‏ الآية ‏.‏ ثم اتفقا قال ‏:‏ ‏\"‏ فينادي مناد من السماء ‏:‏ أن قد صدق عبدي فأفرشوه من الجنة، وافتحوا له بابا إلى الجنة وألبسوه من الجنة ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيأتيه من روحها وطيبها ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ ويفتح له فيها مد بصره ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ وإن الكافر ‏\"‏ ‏.‏ فذكر موته قال ‏:‏ ‏\"‏ وتعاد روحه في جسده ويأتيه ملكان فيجلسانه فيقولان ‏:‏ من ربك فيقول ‏:‏ هاه هاه هاه لا أدري ‏.‏ فيقولان له ‏:‏ ما دينك فيقول ‏:‏ هاه هاه لا أدري ‏.‏ فيقولان ‏:‏ ما هذا الرجل الذي بعث فيكم فيقول ‏:‏ هاه هاه لا أدري ‏.‏ فينادي مناد من السماء ‏:‏ أن كذب فأفرشوه من النار وألبسوه من النار، وافتحوا له بابا إلى النار ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيأتيه من حرها وسمومها ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ ويضيق عليه قبره حتى تختلف فيه أضلاعه ‏\"‏ ‏.‏ زاد في حديث جرير قال ‏:‏ ‏\"‏ ثم يقيض له أعمى أبكم معه مرزبة من حديد، لو ضرب بها جبل لصار ترابا ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ فيضربه بها ضربة يسمعها ما بين المشرق والمغرب إلا الثقلين فيصير ترابا ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ ثم تعاد فيه الروح ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     We went out with the Messenger of Allah (ﷺ) accompanying the bier of a man of the Ansar. When we reached his grave, it was not yet dug. So the Messenger of Allah (ﷺ) sat down and we also sat down around him as if birds were over our heads. He had in his hand a stick with which he was scratching the ground.  He then raised his head and said: Seek refuge with Allah from the punishment in the grave. He said it twice or thrice.  The version of Jabir adds here: He hears the beat of their sandals when they go back, and at that moment he is asked: O so and so! Who is your Lord, what is your religion, and who is your Prophet?  Hannad's version says: Two angels will come to him, make him sit up and ask him: Who is your Lord?  He will reply: My Lord is Allah.  They will ask him: What is your religion?  He will reply: My religion is Islam.  They will ask him: What is your opinion about the man who was sent on a mission among you?  He will reply: He is the Messenger of Allah (ﷺ).  They will ask: Who made you aware of this?  He will reply: I read Allah's Book, believed in it, and considered it true; which is verified by Allah's words: \"Allah's Book, believed in it, and considered it true, which is verified by Allah's words: \"Allah establishes those who believe with the word that stands firm in this world and the next.\"  The agreed version reads: Then a crier will call from Heaven: My servant has spoken the truth, so spread a bed for him from Paradise, clothe him from Paradise, and open a door for him into Paradise. So some of its air and perfume will come to him, and a space will be made for him as far as the eye can see.  He also mentioned the death of the infidel, saying: His spirit will be restored to his body, two angels will come to him, make him sit up and ask him: Who is your Lord?  He will reply: Alas, alas! I do not know.  They will ask him: What is your religion?  He will reply: Alas, alas! I do not know.  They will ask: Who was the man who was sent on a mission among you?  He will reply: Alas, alas! I do not know. Then a crier will call from Heaven: He has lied, so spread a bed for him from Hell, clothe him from Hell, and open for him a door into Hell. Then some of its heat and pestilential wind will come to him, and his grave will be compressed, so that his ribs will be crushed together.  Jabir's version adds: One who is blind and dumb will then be placed in charge of him, having a sledge-hammer such that if a mountain were struck with it, it would become dust. He will give him a blow with it which will be heard by everything between the east and the west except by men and jinn, and he will become dust. Then his spirit will be restored to him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "30480",
        "20354",
        "11060",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-4754",
      "hadith_no": "4754",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبد الله بن نمير، حدثنا الأعمش، حدثنا المنهال، عن أبي عمر، ‏:‏ زاذان قال سمعت البراء، عن النبي صلى الله عليه وسلم قال فذكر نحوه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Al-Bara’ (b. ‘Azib) from the prophet (May peace be upon him) through a different chain of narrators is a similar way.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20331",
        "11060",
        "11656",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-5217",
      "hadith_no": "5217",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، وابن، بشار قالا حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن أم المؤمنين، عائشة رضى الله عنها أنها قالت ما رأيت أحدا كان أشبه سمتا وهديا ودلا - وقال الحسن حديثا وكلاما ولم يذكر الحسن السمت والهدى والدل - برسول الله صلى الله عليه وسلم من فاطمة كرم الله وجهها كانت إذا دخلت عليه قام إليها فأخذ بيدها وقبلها وأجلسها في مجلسه وكان إذا دخل عليها قامت إليه فأخذت بيده فقبلته وأجلسته في مجلسها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I never saw anyone more like the Messenger of Allah (ﷺ) in respect of gravity, calm deportment, pleasant disposition - according to al-Hasan's version: in respect of talk and speech. Al-Hasan did not mention gravity, calm deportment, pleasant disposition - than Fatimah, may Allah honour her face. When she came to visit him (the Prophet) he got up to (welcome) her, took her by the hand, kissed her and made her sit where he was sitting; and when he went to visit her, she got up to (welcome) him, took him by the hand, kissed him, and made him sit where she was sitting.",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2201",
      "hadith_no": "2201",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، ويعلى، عن سفيان، عن منصور، عن المنهال بن عمرو، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يعوذ الحسن والحسين يقول ‏\"‏ أعيذكما بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة ‏\"‏ ‏.‏ ويقول ‏\"‏ هكذا كان إبراهيم يعوذ إسحاق وإسماعيل عليهم السلام ‏\"‏ ‏.‏ حدثنا الحسن بن علي الخلال حدثنا يزيد بن هارون وعبد الرزاق عن سفيان عن منصور نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (S.A.W) used to seek refuge for Al-Hasan and Al-Husain saying:                     \"\"U'idhukuma bikalimatillahi-tammati,min kulli shaitanin wa hammatin, wa minkulli'ainin lammah (I seek refuge for the two of you in the Perfect Words of Allah, from every devil and every poisonous pest, and from every harmful eye).\" And he would say: \"It is with this that Ibrahim would seek refuge for Ishahaq and Ismail [peace be upon them].\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20121",
        "20372",
        "20005",
        "11067",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2227",
      "hadith_no": "2227",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد أبي خالد، قال سمعت المنهال بن عمرو، يحدث عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ما من عبد مسلم يعود مريضا لم يحضر أجله فيقول سبع مرات أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث المنهال بن عمرو ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Prophet (S.A.W) said:                     \"There is no Muslim worshiper who visits one who is ill - other than at the time of death - and he says seven times: As'alullah Al-'Azeem Rabbal 'Arshil 'Azeem an yashfik ('I ask Allah the Magnificent, Lord of the Magnificent Throne to cure you') except when he will be cured.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3680",
      "hadith_no": "3680",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا حكام بن سلم الرازي، عن عمرو بن أبي قيس، عن الحجاج، عن المنهال بن عمرو، عن زر بن حبيش، عن علي، رضى الله عنه قال ما زلنا نشك في عذاب القبر حتى نزلت ‏:‏ ‏(‏ألهاكم التكاثر ‏)‏ قال أبو كريب مرة عن عمرو بن أبي قيس هو رازي وعمرو بن قيس الملائي كوفي عن ابن أبي ليلى عن المنهال بن عمرو ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Zirr bin Jubaish reported from Ali [may Allah be pleased with him] that he said:                     “We were still in doubt concerning the torment of the grave, until ‘the mutual rivalry diverts you” was revealed’.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20649",
        "20726",
        "20381",
        "11656",
        "11337",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3970",
      "hadith_no": "3970",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن يزيد، حدثنا عبد السلام بن حرب، عن يزيد أبي خالد، عن المنهال بن عمرو، عن عبد الله بن الحارث، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أول من تنشق عنه الأرض فأكسى الحلة من حلل الجنة ثم أقوم عن يمين العرش ليس أحد من الخلائق يقوم ذلك المقام غيري ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah [may Allah be pleased with him]:                     that the Messenger of Allah (ﷺ) said: \"I am the first for whom the earth will be split, and then I will be adorned with garments from the garments of Paradise. Then I will stand at the right of the Throne. No one from the creation will in that place other than I.\"",
      "usc_msa_ref": "",
      "chain": [
        "20248",
        "11656",
        "912",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4150",
      "hadith_no": "4150",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، وإسحاق بن منصور، قالا أخبرنا محمد بن يوسف، عن إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن زر بن حبيش، عن حذيفة، قال سألتني أمي متى عهدك - تعني - بالنبي صلى الله عليه وسلم ‏.‏ فقلت ما لي به عهد منذ كذا وكذا ‏.‏ فنالت مني فقلت لها دعيني آتي النبي صلى الله عليه وسلم فأصلي معه المغرب وأسأله أن يستغفر لي ولك ‏.‏ فأتيت النبي صلى الله عليه وسلم فصليت معه المغرب فصلى حتى صلى العشاء ثم انفتل فتبعته فسمع صوتي فقال ‏\"‏ من هذا حذيفة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ما حاجتك غفر الله لك ولأمك ‏\"‏ ‏.‏ قال ‏\"‏ إن هذا ملك لم ينزل الأرض قط قبل هذه الليلة استأذن ربه أن يسلم على ويبشرني بأن فاطمة سيدة نساء أهل الجنة وأن الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث إسرائيل ‏.‏",
      "text_en": " Narrated Hudhaifah :                     \"My mother asked me: 'When is your planned time - meaning with the Prophet (ﷺ)?' So I said: 'I have not had a planned time to see him since such and such time.' She rebuked me, so I said to her: 'Let me go to the Prophet (ﷺ) so that I may perform Maghrib (prayer) with him, and ask him to seek forgiveness for you and I.' So I came to the Prophet (ﷺ), and I prayed Maghrib with him, then he prayed until he prayed Al-'Isha. Then he turned, and I followed him, and he heard my voice, and said: 'Who is this? Hudhaifah?' I said: 'Yes.' He said: \"What is your need, may Allah forgive you and your mother?' He said: 'Indeed, this is an angel that never descended to the earth ever before tonight. He sought permission from his Lord to greet me with peace and to give me the glad tidings that Fatimah is the chief of the women of Paradise, and that Al-Hasan and Al-Husain are the chiefs of the youths of the people of Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30313",
        "30388",
        "20311",
        "25322",
        "11656",
        "11337",
        "145"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4246",
      "hadith_no": "4246",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت ما رأيت أحدا أشبه سمتا ودلا وهديا برسول الله في قيامها وقعودها من فاطمة بنت رسول الله صلى الله عليه وسلم ‏.‏ قالت وكانت إذا دخلت على النبي صلى الله عليه وسلم قام إليها فقبلها وأجلسها في مجلسه وكان النبي صلى الله عليه وسلم إذا دخل عليها قامت من مجلسها فقبلته وأجلسته في مجلسها فلما مرض النبي صلى الله عليه وسلم دخلت فاطمة فأكبت عليه فقبلته ثم رفعت رأسها فبكت ثم أكبت عليه ثم رفعت رأسها فضحكت فقلت إن كنت لأظن أن هذه من أعقل نسائنا فإذا هي من النساء فلما توفي النبي صلى الله عليه وسلم قلت لها أرأيت حين أكببت على النبي صلى الله عليه وسلم فرفعت رأسك فبكيت ثم أكببت عليه فرفعت رأسك فضحكت ما حملك على ذلك قالت إني إذا لبذرة أخبرني أنه ميت من وجعه هذا فبكيت ثم أخبرني أني أسرع أهله لحوقا به فذاك حين ضحكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير وجه عن عائشة ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I have not seen anyone closer in conduct, way, and manners to that of the Messenger of Allah in regards to standing and sitting, than Fatimah the daughter of the Messenger of Allah (ﷺ).\" She said \"Whenever she would enter upon the Prophet (ﷺ) he would stand to her and kiss her, and he would sit her in his sitting place. Whenever the Prophet (ﷺ) entered upon her she would stand from her seat, and kiss him and sit him in her sitting place. So when the Prophet (ﷺ) fell sick and Fatimah entered, she bent over and kissed him. Then she lifted her head and cried, then she bent over him and she lifted her head and laughed. So I said: 'I used to think that this one was from the most intelligent of our women, but she is really just one of the women.' So when the Prophet (ﷺ) died, I said to her: 'Do you remember when you bent over the Prophet (ﷺ) and you lifted your head and cried, then you bent over him, then you lifted your head and laughed. What caused you to do that?' She said: 'Then, I would be the one who spreads the secrets. He (ﷺ) told me that he was to die from his illness, so I cried. Then he told me that I would be the quickest of his family to meet up with him. So that is when I laughed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-892",
      "hadith_no": "892",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان بن سعيد الثوري، عن ميسرة، عن المنهال بن عمرو، عن أبي عبيدة، أن عبد الله، رأى رجلا يصلي قد صف بين قدميه فقال خالف السنة ولو راوح بينهما كان أفضل ‏.‏",
      "text_en": " It was narrated from Abu Ubaidah that:                     Abdullah saw a man who was praying with his feet together. He said: \"He is going against the Sunnah; if he shifted his weight from one to the other that would be better.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11658",
        "11656",
        "10"
      ]
    },
    {
      "id": "sunan-an-nasai-893",
      "hadith_no": "893",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، قال أخبرني ميسرة بن حبيب، قال سمعت المنهال بن عمرو، يحدث عن أبي عبيدة، عن عبد الله، أنه رأى رجلا يصلي قد صف بين قدميه فقال أخطأ السنة ولو راوح بينهما كان أعجب إلى ‏.‏",
      "text_en": " It was narrated from Abdullah that:                     He saw a man praying with his feet together. He said: \"He is not following the Sunnah. If he were to shift his weight from one to the other I would like that better.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "25322",
        "11656",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-2001",
      "hadith_no": "2001",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن المنهال بن عمرو، عن زاذان، عن البراء، قال ‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في جنازة، فلما انتهينا إلى القبر ولم يلحد، فجلس وجلسنا حوله كأن على رءوسنا الطير ‏.‏",
      "text_en": " It was narrated that Al-Bark' said:                     \"We went out with the Messenger of Allah for a funeral, and when we reached the grave the Lahd had not yet been prepared. He sat, and we sat around him, as if there were birds on our heads.\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20326",
        "213",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-3006",
      "hadith_no": "3006",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم الأودي، قال حدثنا خالد بن مخلد، قال حدثنا علي بن صالح، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن سعيد بن جبير، قال كنت مع ابن عباس بعرفات فقال ما لي لا أسمع الناس يلبون قلت يخافون من معاوية ‏.‏ فخرج ابن عباس من فسطاطه فقال لبيك اللهم لبيك لبيك فإنهم قد تركوا السنة من بغض علي ‏.‏",
      "text_en": " It was narrated that Saeed bin Jubair said:                     \"I was with Ibn Abbas in Arafat and he said: 'Why do I not hear the people reciting Talbiyah?' I said: They are afraid of Muawiyah.' So Ibn Abbas went out of his tent and said: \"Labbaik Allahumma Labbaik, Labbaik! They are only forsaking the Sunnah out of hatred for Ali.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "30463",
        "20593",
        "25322",
        "11656",
        "11050"
      ]
    },
    {
      "id": "sunan-an-nasai-4442",
      "hadith_no": "4442",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثني المنهال بن عمرو، عن سعيد بن جبير، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لعن الله من مثل بالحيوان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said;\"I heard the Messenger of Allah say:                      'May Allah curse the one who disfigures and animal. (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11656",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5449",
      "hadith_no": "5449",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا علي بن المنذر، عن ابن فضيل، قال حدثنا محمد بن إسحاق، عن المنهال بن عمرو، عن أنس بن مالك، قال كان لرسول الله صلى الله عليه وسلم دعوات لا يدعهن كان يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وغلبة الرجال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah [SAW] had supplications that he never omitted to recite. He used to say: 'Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wa ghalabatar-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice and being overpowered by (other) men.)\"",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "11107",
        "11656",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-125",
      "hadith_no": "125",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إسماعيل الرازي، حدثنا عبيد الله بن موسى، أنبأنا العلاء بن صالح، عن المنهال، عن عباد بن عبد الله، قال قال علي أنا عبد الله، وأخو، رسوله  صلى الله عليه وسلم  وأنا الصديق الأكبر، لا يقولها بعدي إلا كذاب صليت قبل الناس بسبع سنين ‏.‏",
      "text_en": " It was narrated that 'Abbad bin 'Abdullah said:                     \"'Ali said: 'I am the slave of Allah and the brother of His Messenger. I am the greatest teller of the truth (Siddiq Akbar), and no one will say this after me except a liar. I prayed seven years before the people.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20340",
        "25224",
        "11656"
      ]
    },
    {
      "id": "sunan-ibn-majah-363",
      "hadith_no": "363",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن المنهال بن عمرو، عن يعلى بن مرة، عن أبيه، قال كنت مع النبي  صلى الله عليه وسلم  في سفر فأراد أن يقضي حاجته فقال لي ‏\"‏ ائت تلك الأشاءتين ‏\"‏ ‏.‏ - قال وكيع يعني النخل الصغار ‏.‏ قال أبو بكر القصار - ‏\"‏ فقل لهما إن رسول الله  صلى الله عليه وسلم  يأمركما أن تجتمعا ‏\"‏ ‏.‏ فاجتمعتا فاستتر بهما فقضى حاجته ثم قال لي ‏\"‏ ائتهما فقل لهما لترجع كل واحدة منكما إلى مكانها ‏\"‏ ‏.‏ فقلت لهما فرجعتا ‏.‏",
      "text_en": " It was narrated from Ya'la bin Murrah that his father said:                     \"I was with the Prophet on a journey, and he wanted to relieve himself. He said to me: 'Go to those two small date-palm trees and tell them: \"The Messenger of Allah orders you to come together.'\" So they came together and he concealed himself behind them, and relieved himself. Then he said to me: 'Go to them and tell them: \"Go back, each one of you, to your places.'\" So I said that to them and they went back.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11656"
      ]
    },
    {
      "id": "sunan-ibn-majah-658",
      "hadith_no": "658",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبيد بن ثعلبة الحماني، حدثنا عبد الحميد أبو يحيى الحماني، حدثنا الحسن بن عمارة، عن المنهال بن عمرو، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يغتسلن أحدكم بأرض فلاة ولا فوق سطح لا يواريه فإن لم يكن يرى فإنه يرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The Messenger of Allah said: 'No one of you should bathe in open land or on a roof where he is not concealed; even if he does not see anyone, he can still be seen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "25053",
        "11656",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-1024",
      "hadith_no": "1024",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عمر بن هياج، حدثنا يحيى بن عبد الرحمن الأرحبي، حدثنا عبيدة بن الأسود، عن القاسم بن الوليد، عن المنهال بن عمرو، عن سعيد بن جبير، عن ابن عباس، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة لا ترتفع صلاتهم فوق رءوسهم شبرا رجل أم قوما وهم له كارهون وامرأة باتت وزوجها عليها ساخط وأخوان متصارمان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “There are three whose prayer do not rise more than a hand spanabove their heads: A man who leads people (in prayer) when they donotlike him; a woman who has spent the night with her husband angrywithher; and two brothers who have severed contact with oneanother.”",
      "usc_msa_ref": "",
      "chain": [
        "35139",
        "25353",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1615",
      "hadith_no": "1615",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن زياد، حدثنا حماد بن زيد، عن يونس بن خباب، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فقعد حيال القبلة ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “We went out with theMessenger of Allah (ﷺ) for a funeral, and he sat facing the Qiblah(prayer direction).”",
      "usc_msa_ref": "",
      "chain": [
        "11216",
        "20022",
        "19886",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-1616",
      "hadith_no": "1616",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فانتهينا إلى القبر فجلس وجلسنا كأن على رءوسنا الطير ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “We went out with theMessenger of Allah (ﷺ) for a funeral, and we came to a grave. Hesatdown and we sat down, as if there were birds on our heads.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "213",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-2190",
      "hadith_no": "2190",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا العباس بن يزيد، حدثنا زياد بن عبد الله البكائي، حدثنا عمر بن عبد الله بن يعلى الثقفي، عن المنهال بن عمرو، عن سعيد بن جبير، عن ابن عباس، قال كفر رسول الله  صلى الله عليه وسلم  بصاع من تمر وأمر الناس بذلك فمن لم يجد فنصف صاع من بر ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah (ﷺ) offered expiation of a Sa' of dates, and he enjoined the people to do likewise. Whoever does not have that (must give) half a Sa' of wheat.\"",
      "usc_msa_ref": "",
      "chain": [
        "20322",
        "11656",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-4157",
      "hadith_no": "4157",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عمار بن محمد، عن ليث، عن المنهال، عن زاذان، عن البراء بن عازب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ‏{يلعنهم الله ويلعنهم اللاعنون }‏ ‏\"‏ ‏.‏ قال ‏\"‏ دواب الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bara’ bin ‘Azib that the Messenger of Allah(ﷺ) said:                      “Allah will curse them and those who curse will cursethem.” He said: “The inhabitants of the earth.”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20596",
        "20023",
        "11656",
        "10911",
        "400"
      ]
    }
  ],
  "total_hadiths": 29
}