{
  "id": "11658",
  "name": "Maysrah bin 'Ammar al-Ashja'i ميسرة بن عمار / تمام الأشجعي",
  "full_name": "Maysrah bin 'Ammar al-Ashja'i ميسرة بن عمار / تمام الأشجعي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  فق  -  ثقة ]"
    ],
    "tags": [
      "al-Ashja'i",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20643",
      "name": "Asbat bin Nsr al-Hmdany أسباط بن نصر الهمداني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25229",
      "name": "'Isa bin Muslim Abu عيسى بن مسلم أبو داود الطهوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3331",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4599",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، عن سفيان، عن ميسرة، عن أبي حازم، عن أبي هريرة   رضى الله عنه  ‏{‏كنتم خير أمة أخرجت للناس‏}‏ قال خير الناس للناس، تأتون بهم في السلاسل في أعناقهم حتى يدخلوا في الإسلام‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Verse:--\"You (true Muslims) are the best of peoples ever raised up for mankind.\" means, the best of peoples for the people, as you bring them with chains on their necks till they embrace Islam.",
      "chain": [
        "30388",
        "20005",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
      "chain": [
        "30311",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فإذا شهد أمرا فليتكلم بخير أو ليسكت واستوصوا بالنساء فإن المرأة خلقت من ضلع وإن أعوج شىء في الضلع أعلاه إن ذهبت تقيمه كسرته وإن تركته لم يزل أعوج استوصوا بالنساء خيرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who believes in Allah and the Hereafter, if he witnesses any matter he should talk in good terms about it or keep quiet. Act kindly towards woman, for woman is created from a rib, and the most crooked part of the rib is its top. If you attempt to straighten it, you will break it, and if you leave it, its crookedness will remain there. So act kindly towards women.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "892",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان بن سعيد الثوري، عن ميسرة، عن المنهال بن عمرو، عن أبي عبيدة، أن عبد الله، رأى رجلا يصلي قد صف بين قدميه فقال خالف السنة ولو راوح بينهما كان أفضل ‏.‏",
      "text_en": " It was narrated from Abu Ubaidah that:                     Abdullah saw a man who was praying with his feet together. He said: \"He is going against the Sunnah; if he shifted his weight from one to the other that would be better.\"",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11658",
        "11656",
        "10"
      ]
    }
  ],
  "total_hadiths": 5
}