{
  "id": "11667",
  "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
  "full_name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "152",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria",
      "Ramla"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1211",
      "name": "'Abdullah bin 'Amr bin Qays ( أبو أبي/عبد الله بن عمرو بن قيس بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18090",
      "name": "Bilal bin Abi al-Drda'a بلال بن أبي الدرداء الأنصاري",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20456",
      "name": "Muhammad bin Humayr bin Anis محمد بن حمير بن أنيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3967",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سليمان بن عبد الرحمن، حدثنا محمد بن حمير، حدثنا إبراهيم بن أبي عبلة، أن عقبة بن وساج، حدثه عن أنس، خادم النبي صلى الله عليه وسلم قال قدم النبي صلى الله عليه وسلم وليس في أصحابه أشمط غير أبي بكر، فغلفها بالحناء والكتم‏.‏",
      "text_en": " Narrated Anas:                     (the servant of the Prophet) When the Prophet arrived (at Medina), there was not a single companion of the Prophet who had grey and black hair except Abu Bakr, and he dyed his hair with Henna' and Katam (i.e. plants used for dying hair). Through another group of narrators, Anas bin Malik said,. \"When the Prophet arrived at Medina, the eldest amongst his companions was Abu Bakr. He dyed his hair with Hinna and Katam till it became of dark red color.",
      "chain": [
        "30587",
        "20456",
        "11667"
      ]
    },
    {
      "hadith_no": "3964",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عيسى بن محمد الرملي، حدثنا ضمرة، عن إبراهيم بن أبي عبلة، عن الغريف بن الديلمي، قال أتينا واثلة بن الأسقع فقلنا له حدثنا حديثا، ليس فيه زيادة ولا نقصان فغضب وقال إن أحدكم ليقرأ ومصحفه معلق في بيته فيزيد وينقص ‏.‏ قلنا إنما أردنا حديثا سمعته من النبي صلى الله عليه وسلم ‏.‏ قال أتينا رسول الله صلى الله عليه وسلم في صاحب لنا أوجب - يعني - النار بالقتل فقال ‏\"‏ أعتقوا عنه يعتق الله بكل عضو منه عضوا منه من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa:                     Al-Arif ibn ad-Daylami said: We went to Wathilah ibn al-Asqa and said to him: Tell us a tradition which has not addition or omission. He became angry and replied: One of you recites when his copy of a Qur'an is hung up in his house, and he makes additions and omissions. We said: All we mean is a tradition you have heard from the Messenger of Allah (ﷺ). He said: We went to the Prophet (ﷺ) about a friend of ours who deserved. Hell for murder. He said: Emancipate a slave on his behalf; Allah will set free from Hell a member of the body for every member of his.",
      "chain": [
        "38443",
        "20738",
        "11667"
      ]
    },
    {
      "hadith_no": "4700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا جعفر بن مسافر الهذلي، حدثنا يحيى بن حسان، حدثنا الوليد بن رباح، عن إبراهيم بن أبي عبلة، عن أبي حفصة، قال قال عبادة بن الصامت لابنه يا بنى إنك لن تجد طعم حقيقة الإيمان حتى تعلم أن ما أصابك لم يكن ليخطئك وما أخطأك لم يكن ليصيبك سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول ما خلق الله القلم فقال له اكتب ‏.‏ قال رب وماذا أكتب قال اكتب مقادير كل شىء حتى تقوم الساعة ‏\"‏ ‏.‏ يا بنى إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من مات على غير هذا فليس مني ‏\"‏ ‏.‏",
      "text_en": " Ubadah b. al Samit said to his son :                      Sonny! You will not get the taste of the reality of faith until you know that what has come to you could not miss you, and that what has missed you could not come to you. I heard the Messenger of Allah (May peace be upon him) say : The first thing Allah created was pen. He said to it : Write. It asked : What should I write, my lord? He said : Write what was decreed about everything till the Last hour comes. Sonny! I heard the Messenger of Allah (May peace be upon him) say : He who dies on something other than this does not does not belong to me.",
      "chain": [
        "38132",
        "20300",
        "11667",
        "40"
      ]
    },
    {
      "hadith_no": "3561",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا أحمد بن عبد الواحد، قال حدثنا مروان، - وهو ابن محمد - قال حدثنا خالد بن يزيد بن صالح بن صبيح المري، قال حدثنا إبراهيم بن أبي عبلة، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن سلمة بن نفيل الكندي، قال كنت جالسا عند رسول الله صلى الله عليه وسلم فقال رجل يا رسول الله أذال الناس الخيل ووضعوا السلاح وقالوا لا جهاد قد وضعت الحرب أوزارها فأقبل رسول الله صلى الله عليه وسلم بوجهه وقال ‏\"‏ كذبوا الآن الآن جاء القتال ولا يزال من أمتي أمة يقاتلون على الحق ويزيغ الله لهم قلوب أقوام ويرزقهم منهم حتى تقوم الساعة وحتى يأتي وعد الله والخيل معقود في نواصيها الخير إلى يوم القيامة وهو يوحى إلى أني مقبوض غير ملبث وأنتم تتبعوني أفنادا يضرب بعضكم رقاب بعض وعقر دار المؤمنين الشام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Nufail Al-Kindi said:                      \"I was sitting with the Messenger of Allah when a man said: 'O Messenger of Allah! The people have lost interest in horses and put down their weapons, and they say there is no Jihad, and that war has ended.' The Messenger of Allah turned to face him and said: 'They are lying, now the fighting is to come. There will always be a group among my Ummah who will fight for the truth, for whom Allah will cause some people to deviate, and grant them provision from them, until the Hour begins and until the promise of Allah comes. Goodness is tied to the forelocks of horses until the Day of Resurrection. It has been revealed to me that I am going to die and will not stay long, and you will follow me group after group, striking one another's necks. And the place of safety for the believers is Ash-Sham.'\"",
      "chain": [
        "20640",
        "27507",
        "11667",
        "10975",
        "4097"
      ]
    },
    {
      "hadith_no": "51",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا داود بن سليمان العسكري، حدثنا محمد بن علي أبو هاشم بن أبي خداش الموصلي، قال حدثنا محمد بن محصن، عن إبراهيم بن أبي عبلة، عن عبد الله بن الديلمي، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقبل الله لصاحب بدعة صوما ولا صلاة ولا صدقة ولا حجا ولا عمرة ولا جهادا ولا صرفا ولا عدلا يخرج من الإسلام كما تخرج الشعرة من العجين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah will not accept any fasting, prayer, charity, Hajj, 'Umrah, Jihad, or any other obligatory or voluntary action from a person who follows innovation (Bid'ah). He comes out of Islam like a hair pulled out of dough.\" (Maudu')",
      "chain": [
        "38211",
        "11442",
        "11667",
        "5136",
        "145"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا إبراهيم بن محمد بن يوسف بن سرج الفريابي، حدثنا عمرو بن بكر السكسكي، حدثنا إبراهيم بن أبي عبلة، قال سمعت أبا أبى ابن أم حرام، وكان، قد صلى مع رسول الله  صلى الله عليه وسلم  القبلتين يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ عليكم بالسنى والسنوت فإن فيهما شفاء من كل داء إلا السام ‏.‏ قيل يا رسول الله وما السام قال ‏\"‏ الموت ‏\"‏ ‏.‏ قال عمرو قال ابن أبي عبلة السنوت الشبت ‏.‏ وقال آخرون بل هو العسل الذي يكون في زقاق السمن وهو قول الشاعر هم السمن بالسنوت لا ألس فيهم وهم يمنعون جارهم أن يقردا",
      "text_en": " Ibrahimbin Abu ‘Ablah said:                      “I heard Abu Ubayy bin Umm Haram, who hadprayed with the Messenger of Allah (ﷺ) facing both the Qiblah,saying: ‘I heard the Messenger of Allah (ﷺ) say: “You shoulduse senna and the Sannut, for in them there is healing for everydisease, except the Sam.” It was said: “O Messenger of Allah,what is the Sam?” He said: “Death.”(One of the narrators) ‘Mar said: “Ibn Abu ‘Ablah said: the ‘Sannut is dill.” Others said: “Rather, it is honey that is kept in a skin (i.e., receptacle) used for ghee.”*",
      "chain": [
        "27029",
        "11667"
      ]
    }
  ],
  "total_hadiths": 6
}