{
  "id": "11662",
  "name": "Wabra bin 'Abdur Rahman al-Musli وبرة بن عبد الرحمن المسلي",
  "full_name": "Wabra bin 'Abdur Rahman al-Musli وبرة بن عبد الرحمن المسلي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "116",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11400",
      "name": "Hamam bin al-Harith همام بن الحارث",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15429",
      "name": "al-'Ala' bin Zuhyr العلاء بن زهير بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1773",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن وبرة، قال سألت ابن عمر  رضى الله عنهما  متى أرمي الجمار قال إذا رمى إمامك فارمه‏.‏ فأعدت عليه المسألة، قال كنا نتحين، فإذا زالت الشمس رمينا‏.‏",
      "text_en": " Narrated Wabra:                     I asked Ibn `Umar, \"When should I do the Rami of the Jimar?\" He replied, \"When your leader does that.\" I asked him again the same question. He replied, \"We used to wait till the sun declined and then we would do the Rami (i.e. on the 11th and 12th of Dhul-Hijja).\"",
      "chain": [
        "20348",
        "20359",
        "11662",
        "18"
      ]
    },
    {
      "hadith_no": "3704",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن أبي الطيب، حدثنا إسماعيل بن مجالد، حدثنا بيان بن بشر، عن وبرة بن عبد الرحمن، عن همام، قال سمعت عمارا، يقول رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar:                     I saw Allah's Apostle and there was none with him but five slaves, two women and Abu Bakr (i.e. those were the only converts to Islam then).",
      "chain": [
        "30240",
        "20314",
        "11326",
        "11662",
        "11447",
        "25"
      ]
    },
    {
      "hadith_no": "3905",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن حماد الآملي، قال حدثني يحيى بن معين، حدثنا إسماعيل بن مجالد، عن بيان، عن وبرة، عن همام بن الحارث، قال قال عمار بن ياسر رأيت رسول الله صلى الله عليه وسلم وما معه إلا خمسة أعبد وامرأتان، وأبو بكر‏.‏",
      "text_en": " Narrated `Ammar bin Yasir:                     I saw Allah's Apostle , and the only converts (to Islam) with him, were five slaves, two women and Abu Bakr.",
      "chain": [
        "30347",
        "30020",
        "20314",
        "11326",
        "11662",
        "11400"
      ]
    },
    {
      "hadith_no": "4697",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا بيان، أن وبرة، حدثه قال حدثني سعيد بن جبير، قال خرج علينا أو إلينا ابن عمر، فقال رجل كيف ترى في قتال الفتنة‏.‏ فقال وهل تدري ما الفتنة كان محمد صلى الله عليه وسلم يقاتل المشركين، وكان الدخول عليهم فتنة، وليس كقتالكم على الملك‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Umar came to us and a man said (to him), \"What do you think about 'Qit-alal-Fitnah' (fighting caused by afflictions).\" Ibn `Umar said (to him), \"And do you understand what an affliction is? Muhammad used to fight against the pagans, and his fighting with them was an affliction, (and his fighting was) not like your fighting which is carried on for the sake of ruling.\"",
      "chain": [
        "30184",
        "20321",
        "11326",
        "11662",
        "11050"
      ]
    },
    {
      "hadith_no": "7184",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن وبرة بن عبد الرحمن، عن سعيد بن جبير، قال خرج علينا عبد الله بن عمر فرجونا أن يحدثنا، حديثا حسنا  قال  فبادرنا إليه رجل فقال يا أبا عبد الرحمن حدثنا عن القتال في الفتنة والله يقول ‏{‏وقاتلوهم حتى لا تكون فتنة‏}‏ فقال هل تدري ما الفتنة ثكلتك أمك، إنما كان محمد صلى الله عليه وسلم يقاتل المشركين، وكان الدخول في دينهم فتنة، وليس كقتالكم على الملك‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     `Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before we asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles during the time of the afflictions, as Allah says:-- 'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" (2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother bereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion (The pagans will either kill him or chain him as a captive). His fighting was not like your fighting which is carried on for the sake of ruling.\"",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11662",
        "11050"
      ]
    },
    {
      "hadith_no": "3056",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبثر، عن إسماعيل بن أبي خالد، عن وبرة، قال كنت جالسا عند ابن عمر فجاءه رجل فقال أيصلح لي أن أطوف بالبيت قبل أن آتي الموقف ‏.‏ فقال نعم ‏.‏ فقال فإن ابن عباس يقول لا تطف بالبيت حتى تأتي الموقف ‏.‏ فقال ابن عمر فقد حج رسول الله صلى الله عليه وسلم فطاف بالبيت قبل أن يأتي الموقف فبقول رسول الله صلى الله عليه وسلم أحق أن تأخذ أو بقول ابن عباس إن كنت صادقا",
      "text_en": " Wabara reported:                      While I was sitting in the company of Ibn 'Umar, a person came to him and said: Is it right for me to circumambulate the House before I come to stay (at 'Arafat)? Ibn 'Umar said: Yes. whereupon he said: Ibn Abbas, however, says: Do not circumambulate the House until you come to stay at 'Arafat. Thereupon Ibn 'Umar said: Allah's Messenger (may peace be upon him) Performed the Hajj and circumambulated the House before coming to stay (at 'Arafat). If you say the Truth, is it more rightful to follow the saying of the Prophet (may peace be upon him) or the words of Ibn Abbas?",
      "chain": [
        "30399",
        "11418",
        "11662"
      ]
    },
    {
      "hadith_no": "3057",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن وبرة، قال سأل رجل ابن عمر - رضى الله عنهما - أطوف بالبيت وقد أحرمت بالحج فقال وما يمنعك قال إني رأيت ابن فلان يكرهه وأنت أحب إلينا منه رأيناه قد فتنته الدنيا ‏.‏ فقال وأينا - أو أيكم - لم تفتنه الدنيا ثم قال رأينا رسول الله صلى الله عليه وسلم أحرم بالحج وطاف بالبيت وسعى بين الصفا والمروة فسنة الله وسنة رسوله صلى الله عليه وسلم أحق أن تتبع من سنة فلان إن كنت صادقا ‏.‏",
      "text_en": " Wabara reported:                      A person asked Ibn Umar (Allah be pleased with him): May I circumambulate the House, whereas I have entered-into the state of Ihram for Hajj? Thereupon he said: What prevents you from doing it? He said: I saw the son of so and so showing disapproval of it, and you are dearer to us as compared with him. And we see that he is allured by the world, whereupon he said: Who amongst you and us is not allured by the world? And said (further) ': 'We saw that Allah's Messenger (may peace be upon him) put on Ihram for Hajj and circumambulated the House and run between al Safa' and al-Marwa. And the way prescribed by Allah and that prescribed by His Apostle (may peace be upon him) deserve more to be followed than the way shown by so and so, if you speak the truth.",
      "chain": [
        "30367",
        "20028",
        "11326",
        "11662"
      ]
    }
  ],
  "total_hadiths": 7
}