{
  "id": "11660",
  "name": "Hzyl bin Shrhbyl al-Awdy al-Kwfy هزيل بن شرحبيل",
  "full_name": "Hzyl bin Shrhbyl al-Awdy al-Kwfy هزيل بن شرحبيل",
  "grade": "Follower(Tabi') [1st Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ خ  4  -  مخضرم ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "15008",
      "name": "Arqm bin Shrhbyl al-Awdy أرقم بن شرحبيل الأودي الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "35",
      "name": "Sa'd ibn 'Ubadah ( سعد بن عبادة بن دليم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "172",
      "name": "Qays ibn Sa'd ibn 'Ubadah ( قيس بن سعد بن عبادة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11637",
      "name": "'Abdur Rahman bin Thrawan, Abu Qays عبد الرحمن بن ثروان أبو قيس الأودي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18171",
      "name": "al-Hr bin Mskyn الحر بن مسكين",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6822",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا أبو قيس، سمعت هزيل بن شرحبيل، قال سئل أبو موسى عن ابنة وابنة ابن وأخت، فقال للابنة النصف وللأخت النصف، وأت ابن مسعود فسيتابعني‏.‏ فسئل ابن مسعود وأخبر بقول أبي موسى، فقال لقد ضللت إذا وما أنا من المهتدين،، أقضي فيها بما قضى النبي صلى الله عليه وسلم ‏\"‏ للابنة النصف، ولابنة ابن السدس تكملة الثلثين، وما بقي فللأخت ‏\"‏‏.‏ فأتينا أبا موسى فأخبرناه بقول ابن مسعود، فقال لا تسألوني ما دام هذا الحبر فيكم‏.‏",
      "text_en": " Narrated Huzail bin Shirahbil:                     Abu Musa was asked regarding (the inheritance of) a daughter, a son's daughter, and a sister. He said, \"The daughter will take one-half and the sister will take one-half. If you go to Ibn Mas`ud, he will tell you the same.\" Ibn Mas`ud was asked and was told of Abu Musa's verdict. Ibn Mas`ud then said, \"If I give the same verdict, I would stray and would not be of the rightly-guided. The verdict I will give in this case, will be the same as the Prophet did, i.e. one-half is for daughter, and one-sixth for the son's daughter, i.e. both shares make two-thirds of the total property; and the rest is for the sister.\" Afterwards we cams to Abu Musa and informed him of Ibn Mas`ud's verdict, whereupon he said, \"So, do not ask me for verdicts, as long as this learned man is among you.\"",
      "chain": [
        "20404",
        "20020",
        "11637",
        "11660"
      ]
    },
    {
      "hadith_no": "159",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، عن وكيع، عن سفيان الثوري، عن أبي قيس الأودي، - هو عبد الرحمن بن ثروان - عن هزيل بن شرحبيل، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم توضأ ومسح على الجوربين والنعلين ‏.‏ قال أبو داود كان عبد الرحمن بن مهدي لا يحدث بهذا الحديث لأن المعروف عن المغيرة أن النبي صلى الله عليه وسلم مسح على الخفين ‏.‏ قال أبو داود وروي هذا أيضا عن أبي موسى الأشعري عن النبي صلى الله عليه وسلم أنه مسح على الجوربين ‏.‏ وليس بالمتصل ولا بالقوي ‏.‏ قال أبو داود ومسح على الجوربين علي بن أبي طالب وابن مسعود والبراء بن عازب وأنس بن مالك وأبو أمامة وسهل بن سعد وعمرو بن حريث وروي ذلك عن عمر بن الخطاب وابن عباس ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Messenger of Allah (ﷺ) performed ablution and wiped over the stockings and shoes.Abu Dawud said: 'Abd al-Rahman b. Mahdi did not narrate this tradition because the familiar version from al-Mughirah says that the Prophet (ﷺ) wiped over the socks.Abu Musa al-Ash'ari has also reported: The Prophet (ﷺ) wiped over stockings. But the chain of narrators of this tradition is neither continous nor strong.'Ali b. Abi Talib, Ibn Mas'ud, al-Bara' b. 'Aziz, Anas b. Malik, Abu Umamah, Sahl b. Sa'd and 'Amr b. Huriath also wiped over the stockings.",
      "chain": [
        "30203",
        "20032",
        "20012",
        "11660",
        "166"
      ]
    },
    {
      "hadith_no": "2890",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا علي بن مسهر، عن الأعمش، عن أبي قيس الأودي، عن هزيل بن شرحبيل الأودي، قال جاء رجل إلى أبي موسى الأشعري وسلمان بن ربيعة فسألهما عن ابنة وابنة ابن وأخت، لأب وأم فقالا لابنته النصف وللأخت من الأب والأم النصف ولم يورثا ابنة الابن شيئا وأت ابن مسعود فإنه سيتابعنا فأتاه الرجل فسأله وأخبره بقولهما فقال لقد ضللت إذا وما أنا من المهتدين ولكني سأقضي فيها بقضاء النبي صلى الله عليه وسلم لابنته النصف ولابنة الابن سهم تكملة الثلثين وما بقي فللأخت من الأب والأم ‏.‏",
      "text_en": " Narrated Huzail b. Shurahbil al-Awadi:                     A man came to Abu Musa al-Ash'ari and Salman b. Rabi'ah, and asked about a case where there were a daughter, a son's daughter and full sister. They replied: The daughter gets half and the full gets half. The son's daughter gets nothing. Go to Ibn Mas'ud and you will find that he agrees with me. So the man came to him and informed him about their opinion. He said: I would then be in error and not be one of those who are rightly guided. But I decide concerning the matter as the Messenger of Allah (ﷺ) did: The daughter gets half, and the son's daughter gets a share which complete thirds (i.e. gets a sixth), and what remain to the full sister.\"",
      "chain": [
        "30467",
        "20345",
        "11060",
        "11660"
      ]
    },
    {
      "hadith_no": "99",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، ومحمود بن غيلان، قالا حدثنا وكيع، عن سفيان، عن أبي قيس، عن هزيل بن شرحبيل، عن المغيرة بن شعبة، قال توضأ النبي صلى الله عليه وسلم ومسح على الجوربين والنعلين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول غير واحد من أهل العلم وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق قالوا يمسح على الجوربين وإن لم تكن نعلين إذا كانا ثخينين ‏.‏ قال وفي الباب عن أبي موسى ‏.‏ قال أبو عيسى سمعت صالح بن محمد الترمذي قال سمعت أبا مقاتل السمرقندي يقول دخلت على أبي حنيفة في مرضه الذي مات فيه فدعا بماء فتوضأ وعليه جوربان فمسح عليهما ثم قال فعلت اليوم شيئا لم أكن أفعله مسحت على الجوربين وهما غير منعلين ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated:                     \"The Prophet performed Wudu and wiped over is socks and sandals.\"",
      "chain": [
        "30480",
        "30277",
        "20032",
        "20012",
        "11660",
        "166"
      ]
    },
    {
      "hadith_no": "1120",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن أبي قيس، عن هزيل بن شرحبيل، عن عبد الله بن مسعود، قال لعن رسول الله صلى الله عليه وسلم المحل والمحلل له ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو قيس الأودي اسمه عبد الرحمن بن ثروان ‏.‏ وقد روي هذا الحديث عن النبي صلى الله عليه وسلم من غير وجه ‏.‏ والعمل على هذا الحديث عند أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب وعثمان بن عفان وعبد الله بن عمر وغيرهم وهو قول الفقهاء من التابعين وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ قال وسمعت الجارود بن معاذ يذكر عن وكيع أنه قال بهذا وقال ينبغي أن يرمى بهذا الباب من قول أصحاب الرأى ‏.‏ قال جارود قال وكيع وقال سفيان إذا تزوج الرجل المرأة ليحللها ثم بدا له أن يمسكها فلا يحل له أن يمسكها حتى يتزوجها بنكاح جديد ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11660",
        "16"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا يزيد بن هارون، عن سفيان الثوري، عن أبي قيس الأودي، عن هزيل بن شرحبيل، قال جاء رجل إلى أبي موسى وسلمان بن ربيعة فسألهما عن الابنة، وابنة الابن، وأخت، لأب وأم فقالا للابنة النصف وللأخت من الأب والأم ما بقي ‏.‏ وقالا له انطلق إلى عبد الله فاسأله فإنه سيتابعنا ‏.‏ فأتى عبد الله فذكر ذلك له وأخبره بما قالا قال عبد الله قد ضللت إذا وما أنا من المهتدين ولكن أقضي فيهما كما قضى رسول الله صلى الله عليه وسلم للابنة النصف ولابنة الابن السدس تكملة الثلثين وللأخت ما بقي ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وأبو قيس الأودي اسمه عبد الرحمن بن ثروان الكوفي وقد رواه شعبة عن أبي قيس ‏.‏",
      "text_en": " Huzail bin Shurahbil said:                     \"A man came to Abu Musa and Salman bin Rabiah and asked them about a daughter, a son's daughter, a father's sister and a mother's sister. So they said: 'For the daughter is half, for the sister of the father  and the mother is what remains.' And they said to him: Go to Abdullah (bin Masud) and ask him, for surely he will concur with us.' So he went to  'Abdullah mentioning that to him and informing him what they had said. 'Abdulah said: 'If that were the case, then I would ave erred and not been among the rightly-guided (on the matter). Rather, I will judge with what the Messenger of Allah(S.A.W) judged: For the daughter is half, for the son's daughter a sixth, totaling two-thirds and for the sister is what remains.'\"",
      "chain": [
        "36540",
        "20472",
        "20012",
        "11660"
      ]
    },
    {
      "hadith_no": "2204",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا سهل بن حماد، حدثنا همام، حدثنا محمد بن جحادة، عن عبد الرحمن بن ثروان، عن هزيل بن شرحبيل، عن أبي موسى، عن النبي صلى الله عليه وسلم أنه قال في الفتنة ‏\"‏ كسروا فيها قسيكم وقطعوا فيها أوتاركم والزموا فيها أجواف بيوتكم وكونوا كابن آدم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وعبد الرحمن بن ثروان هو أبو قيس الأودي ‏.‏",
      "text_en": " Abu Musa narrated that the Prophet(s.a.w) said, about the Fitnah:                     \"Break your bows during it, cut their strings and stick to the depths of your homes, and be like Adam's son.\"",
      "chain": [
        "30025",
        "20548",
        "20297",
        "18897",
        "11637",
        "11660",
        "41"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، حدثنا وكيع، أنبأنا سفيان، عن أبي قيس، عن هزيل بن شرحبيل، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم مسح على الجوربين والنعلين ‏.‏ قال أبو عبد الرحمن ما نعلم أحدا تابع أبا قيس على هذه الرواية والصحيح عن المغيرة أن النبي صلى الله عليه وسلم مسح على الخفين ‏.‏",
      "text_en": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "11660",
        "166"
      ]
    },
    {
      "hadith_no": "4096",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا عبد الوارث بن سعيد، حدثنا محمد بن جحادة، عن عبد الرحمن بن ثروان، عن هزيل بن شرحبيل، عن أبي موسى الأشعري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بين يدى الساعة فتنا كقطع الليل المظلم يصبح الرجل فيها مؤمنا ويمسي كافرا ويمسي مؤمنا ويصبح كافرا القاعد فيها خير من القائم والقائم فيها خير من الماشي والماشي فيها خير من الساعي فكسروا قسيكم وقطعوا أوتاركم واضربوا بسيوفكم الحجارة فإن دخل على أحد منكم فليكن كخير ابنى آدم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-Ash’ari that the Messenger ofAllah(ﷺ) said:                      “Before the Hour comes, there will be tribulationlikepieces of black night, when a man will wake up as a believer butbe adisbeliever by evening, or he will be a believer in the eveningbutwill be a disbeliever by morning. And the one who is sitting willbebetter than the one who is standing, and the one who is standingwillbe better than the one who is walking, and the one who iswalking willbe better than the one who is running. So break yourbows, cut theirstrings and strike your swords against rocks, and ifanyone entersupon anyone of you, let him be like the better of thetwo sons ofAdam. (i.e. the one killed, not the killer).”",
      "chain": [
        "28454",
        "20258",
        "18897",
        "11637",
        "11660",
        "41"
      ]
    }
  ],
  "total_hadiths": 9
}