{
  "id": "11674",
  "name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
  "full_name": "Yazid bin Abi Maryam يزيد بن أبي مريم",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  4  -  لا بأس به ]"
    ],
    "tags": [
      "Ansar",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11179",
      "name": "'Ubaya bin Rafa' bin Rafi' عباية بن رفاعة بن رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11302",
      "name": "Qaz'a bin Yahya قزعة بن يحيى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17540",
      "name": "Muslim bin Mshkm مسلم بن مشكم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10812",
      "name": "al-Qasim bin Mukhaymara القاسم بن مخيمرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18720",
      "name": "Ady bin Artah عدي بن أرطاة الفزاري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "907",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا الوليد بن مسلم، قال حدثنا يزيد بن أبي مريم، قال حدثنا عباية بن رفاعة، قال أدركني أبو عبس وأنا أذهب، إلى الجمعة فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من اغبرت قدماه في سبيل الله حرمه الله على النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Abs:                     I heard the Prophet saying, \"Anyone whose feet are covered with dust in Allah's cause, shall be saved by Allah from the Hell-Fire.\"",
      "chain": [
        "30026",
        "20733",
        "11674",
        "11179"
      ]
    },
    {
      "hadith_no": "2811",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا محمد بن المبارك، حدثنا يحيى بن حمزة، قال حدثني يزيد بن أبي مريم، أخبرنا عباية بن رافع بن خديج، قال أخبرني أبو عبس، هو عبد الرحمن بن جبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما اغبرت قدما عبد في سبيل الله فتمسه النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Abs:                     (who is `Abdur-Rahman bin Jabir) Allah's Apostle said,\" Anyone whose both feet get covered with dust in Allah's Cause will not be touched by the (Hell) fire.\"",
      "chain": [
        "30312",
        "30382",
        "20402",
        "11674",
        "11179"
      ]
    },
    {
      "hadith_no": "1333",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن حجر، حدثنا يحيى بن حمزة، عن يزيد بن أبي مريم، عن القاسم بن مخيمرة، عن أبي مريم، صاحب رسول الله صلى الله عليه وسلم عن النبي صلى الله عليه وسلم نحو هذا الحديث بمعناه ‏.‏ ويزيد بن أبي مريم شامي وبريد بن أبي مريم كوفي وأبو مريم هو عمرو بن مرة الجهني ‏.‏",
      "text_en": " (Another chain) from Abu Maryam the Companion of the Prophet (ﷺ), from the Prophet (ﷺ).",
      "chain": [
        "20387",
        "20402",
        "11674",
        "10812"
      ]
    },
    {
      "hadith_no": "1632",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الوليد بن مسلم، عن يزيد بن أبي مريم، قال لحقني عباية بن رفاعة بن رافع وأنا ماش، إلى الجمعة فقال أبشر فإن خطاك هذه في سبيل الله سمعت أبا عبس يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغبرت قدماه في سبيل الله فهما حرام على النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وأبو عبس اسمه عبد الرحمن بن جبر ‏.‏ وفي الباب عن أبي بكر ورجل من أصحاب النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى يزيد بن أبي مريم هو رجل شامي روى عنه الوليد بن مسلم ويحيى بن حمزة وغير واحد من أهل الشام وبريد بن أبي مريم كوفي أبوه من أصحاب النبي صلى الله عليه وسلم واسمه مالك بن ربيعة وبريد بن أبي مريم سمع من أنس بن مالك وروى عن بريد بن أبي مريم أبو إسحاق الهمداني وعطاء بن السائب ويونس بن أبي إسحاق وشعبة أحاديث ‏.‏",
      "text_en": " Narrated Yazid bin Abu Maryam:                     \"Abayah bin Rifa'ah bin Rafi' met me while I was walking to the Friday prayer. He said: 'Have glad tidings, for indeed these footsteps of yours are in the cause of Allah. I heard Abu 'Abs say: \"The Messenger of Allah (ﷺ) said, 'Whoever get his two feet dusty in the path of Allah, then they are prohibited for the Fire.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Abu 'Abs's name is 'Abdur-Rahman bin Jabr. There are narrations on this topic from Abu Bkar and a man from the Companions of the Prophet (ﷺ). He said: Yazid bin Abi Maryam is a man from Ash-Sham. Al-Walid bin Muslim, Yahya bin Hamzah, and some others among the people of Ash-Sham report from him.Buraid bin Abi Maryam is form Al-Kufah. His father is one of the Companions of the Prophet (ﷺ) whose name was Malik bin Rabi'ah. [Buraid bin Abi Maryam heard from Anas bin Malik. Abu Ishaq Al-Hamdani, 'Ata bin As-Sa'ib, Yunus bin Abi Ishaq, and Shu'bah reported Ahadith from Buraid bin Abi Maryam].",
      "chain": [
        "30325",
        "20733",
        "11674"
      ]
    },
    {
      "hadith_no": "3116",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الوليد بن مسلم، قال حدثنا يزيد بن أبي مريم، قال لحقني عباية بن رافع وأنا ماش، إلى الجمعة فقال أبشر فإن خطاك هذه في سبيل الله سمعت أبا عبس يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغبرت قدماه في سبيل الله فهو حرام على النار ‏\"‏ ‏.‏",
      "text_en": " Yazid bin Abi Mariam said:                      \"Abayah bin Rafi' met me when I was walking to Friday prayers, and he said: 'Rejoice, for these steps you are taking are in the cause of Allah. I heard Abu 'Abs say: The Messenger of Allah (ﷺ) said: Anyone whose feet become dusty in the cause of Allah, he will be forbidden to the Fire.'\"",
      "chain": [
        "30325",
        "20733",
        "11674"
      ]
    },
    {
      "hadith_no": "1475",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا يزيد بن أبي مريم، عن قزعة، عن أبي سعيد، وعبد الله بن عمرو بن العاص، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تشد الرحال إلا إلى ثلاثة مساجد إلى المسجد الحرام وإلى المسجد الأقصى وإلى مسجدي هذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed and ‘Abdullah bin ‘Amr bin ‘As thatthe Messenger of Allah (ﷺ) said:                      “Do not prepare a mount (travel)tovisit any mosque except three: the Sacred Mosque, Aqsa Mosque, andthis mosque of mine.”",
      "chain": [
        "30288",
        "20732",
        "11674",
        "38",
        "29"
      ]
    }
  ],
  "total_hadiths": 6
}