{
  "id": "11671",
  "name": "Zayd bin Waqd al-Quraishi زيد بن واقد القرشي",
  "full_name": "Zayd bin Waqd al-Quraishi زيد بن واقد القرشي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13506",
      "name": "Hzam bin Hkym bin Hzam حزام بن حكيم بن حزام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17504",
      "name": "Khalid bin 'Abdullah خالد بن عبد الله بن حسين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11302",
      "name": "Qaz'a bin Yahya قزعة بن يحيى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19940",
      "name": "Kathir bin Marrah al-Hadrami كثير بن مرة الحضرمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "17062",
      "name": "Mghyth bin Smy al-Awza'y Abu مغيث بن سمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20744",
      "name": "al-Hythm bin Hameed al-Ghsany الهيثم بن حميد الغساني مولاهم أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27503",
      "name": "al-Hasan bin Yahya al-Khushni الحسن بن يحيى الخشني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27517",
      "name": "Suwayd bin 'Abdul 'Aziz سويد بن عبد العزيز بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27519",
      "name": "Sadqa bin 'Abdullah al-Samayn صدقة بن عبد الله السمين",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27542",
      "name": "Muhammad bin 'Isa bin al-Qasim محمد بن عيسى بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3705",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني هشام بن عمار، حدثنا صدقة بن خالد، حدثنا زيد بن واقد، عن بسر بن عبيد الله، عن عائذ الله أبي إدريس، عن أبي الدرداء  رضى الله عنه  قال كنت جالسا عند النبي صلى الله عليه وسلم إذ أقبل أبو بكر آخذا بطرف ثوبه حتى أبدى عن ركبته، فقال النبي صلى الله عليه وسلم ‏\"‏ أما صاحبكم فقد غامر ‏\"‏‏.‏ فسلم، وقال إني كان بيني وبين ابن الخطاب شىء فأسرعت إليه ثم ندمت، فسألته أن يغفر لي فأبى على، فأقبلت إليك فقال ‏\"‏ يغفر الله لك يا أبا بكر ‏\"‏‏.‏ ثلاثا، ثم إن عمر ندم فأتى منزل أبي بكر فسأل أثم أبو بكر فقالوا لا‏.‏ فأتى إلى النبي صلى الله عليه وسلم، فسلم فجعل وجه النبي صلى الله عليه وسلم يتمعر حتى أشفق أبو بكر، فجثا على ركبتيه فقال يا رسول الله، والله أنا كنت أظلم مرتين‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله بعثني إليكم فقلتم كذبت‏.‏ وقال أبو بكر صدق‏.‏ وواساني بنفسه وماله، فهل أنتم تاركو لي صاحبي ‏\"‏‏.‏ مرتين فما أوذي بعدها‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     While I was sitting with the Prophet, Abu Bakr came, lifting up one corner of h is garment uncovering h is knee. The Prophet said, \"Your companion has had a quarrel.\" Abu Bakr greeted (the Prophet ) and said, \"O Allah's Apostle! There was something (i.e. quarrel) between me and the Son of Al-Khattab. I talked to him harshly and then regretted that, and requested him to forgive me, but he refused. This is why I have come to you.\" The Prophet said thrice, \"O Abu Bakr! May Allah forgive you.\" In the meanwhile, `Umar regretted (his refusal of Abu Bakr's excuse) and went to Abu Bakr's house and asked if Abu Bakr was there. They replied in the negative. So he came to the Prophet and greeted him, but signs of displeasure appeared on the face of the Prophet till Abu Bakr pitied (`Umar), so he knelt and said twice, \"O Allah's Apostle! By Allah! I was more unjust to him (than he to me).\" The Prophet said, \"Allah sent me (as a Prophet) to you (people) but you said (to me), 'You are telling a lie,' while Abu Bakr said, 'He has said the truth,' and consoled me with himself and his money.\" He then said twice, \"Won't you then give up harming my companion?\" After that nobody harmed Abu Bakr.",
      "chain": [
        "30288",
        "20398",
        "11671",
        "11412",
        "37"
      ]
    },
    {
      "hadith_no": "824",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن سليمان الأزدي، حدثنا عبد الله بن يوسف، حدثنا الهيثم بن حميد، أخبرني زيد بن واقد، عن مكحول، عن نافع بن محمود بن الربيع الأنصاري، قال نافع أبطأ عبادة بن الصامت عن صلاة الصبح، فأقام أبو نعيم المؤذن الصلاة فصلى أبو نعيم بالناس وأقبل عبادة وأنا معه، حتى صففنا خلف أبي نعيم وأبو نعيم يجهر بالقراءة فجعل عبادة يقرأ بأم القرآن فلما انصرف قلت لعبادة سمعتك تقرأ بأم القرآن وأبو نعيم يجهر قال أجل صلى بنا رسول الله صلى الله عليه وسلم بعض الصلوات التي يجهر فيها بالقراءة قال فالتبست عليه القراءة فلما انصرف أقبل علينا بوجهه وقال ‏\"‏ هل تقرءون إذا جهرت بالقراءة ‏\"‏ ‏.‏ فقال بعضنا إنا نصنع ذلك ‏.‏ قال ‏\"‏ فلا وأنا أقول ما لي ينازعني القرآن فلا تقرءوا بشىء من القرآن إذا جهرت إلا بأم القرآن ‏\"‏ ‏.‏",
      "text_en": " Nafi’b. Mahmudb. Al-Rabi’ Al-Ansari said:                      “Ubadah b. al-samit came to late to lead the morning prayer.  Abu Nu’aim, the mu’adhdhin, pronounced the takbir and he led the people in prayer. Then Ubadah came and I was with him. We Joined the row behind Abu Nu’aim, while Abu Nu’aim was reciting the Qur’an loudly. Then ‘Ubadah began to recite the Umm al-Quran (I.e Surah al Fatihah). When he finished, I said to Ubadah: I heard you reciting the Umm al-Qur’an while Abu Nu’aim was reciting Qur’an loudly. He replied: yes> The Messenger of Allah (ﷺ) led us in a certain prayer in which the Qur’an is recited loudly, but he became confused in the recitation. When he finished he turned his face to us and said: Do you recite when I recite the Qur’an loudly? Some of us said: we do so; this is why I said to myself: What is that which confused me (in the recitation of ) the Qur’an. Do not recite anything from the Qur’an when I recite it loudly except the Umm al-Qur’an.",
      "chain": [
        "30583",
        "30355",
        "20744",
        "11671",
        "11066"
      ]
    },
    {
      "hadith_no": "3081",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن محمد بن بكار بن بلال، أخبرنا محمد بن عيسى، - يعني ابن سميع - حدثنا زيد بن واقد، حدثني أبو عبد الله، عن معاذ، أنه قال من عقد الجزية في عنقه فقد برئ مما عليه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     He who put the necklace of jizyah in his neck abandoned the way followed by the Messenger of Allah (ﷺ).",
      "chain": [
        "37538",
        "27542",
        "11671",
        "30184",
        "32"
      ]
    },
    {
      "hadith_no": "3716",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، حدثنا زيد بن واقد، عن خالد بن عبد الله بن حسين، عن أبي هريرة، قال علمت أن رسول الله صلى الله عليه وسلم كان يصوم فتحينت فطره بنبيذ صنعته في دباء ثم أتيته به فإذا هو ينش فقال ‏\"‏ اضرب بهذا الحائط فإن هذا شراب من لا يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I knew that the Messenger of Allah (ﷺ) used to keep fast. I waited for the day when he did not fast to present him the drink (nabidh) which I made in a pumpkin. I then brought it to him while it fermented. He said: Throw it to this wall, for this is a drink of the one who does not believe in Allah and the Last Day.",
      "chain": [
        "30288",
        "20398",
        "11671",
        "17504",
        "13"
      ]
    },
    {
      "hadith_no": "920",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا هشام بن عمار، عن صدقة، عن زيد بن واقد، عن حرام بن حكيم، عن نافع بن محمود بن ربيعة، عن عبادة بن الصامت، قال صلى بنا رسول الله صلى الله عليه وسلم بعض الصلوات التي يجهر فيها بالقراءة فقال ‏\"‏ لا يقرأن أحد منكم إذا جهرت بالقراءة إلا بأم القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubadah bin As-Samit said:                     \"The Messenger of Allah (ﷺ) led us in one of the prayers in which the recitation is done out loud, and he said: 'None of you should recite when I recite out loud, apart from the Umm Al_quran (Al Fatihah).'\"",
      "chain": [
        "30288",
        "30343",
        "11671",
        "40"
      ]
    },
    {
      "hadith_no": "1663",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن محمد بن بكار بن بلال، قال حدثنا محمد، - يعني ابن سميع - قال حدثنا زيد يعني ابن واقد، عن كثير بن مرة، أن عقبة بن عامر، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الذي يجهر بالقرآن كالذي يجهر بالصدقة والذي يسر بالقرآن كالذي يسر بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kathir bin Murrah that 'Uqbah bin 'Amir told them that:                     The Messenger of Allah (ﷺ) said: 'The one who recites the Qur'an loudly is like one who gives charity openly, and the one who recites the Qur'an silently is like the one who gives charity in secret.'\"",
      "chain": [
        "37538",
        "11671",
        "19940",
        "189"
      ]
    },
    {
      "hadith_no": "3132",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن محمد بن بكار بن بلال، قال حدثنا محمد بن عيسى بن القاسم بن سميع، قال حدثنا زيد بن واقد، قال حدثني بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أقام الصلاة وآتى الزكاة ومات لا يشرك بالله شيئا كان حقا على الله عز وجل أن يغفر له هاجر أو مات في مولده ‏\"‏ ‏.‏ فقلنا يا رسول الله ألا نخبر بها الناس فيستبشروا بها فقال ‏\"‏ إن للجنة مائة درجة بين كل درجتين كما بين السماء والأرض أعدها الله للمجاهدين في سبيله ولولا أن أشق على المؤمنين ولا أجد ما أحملهم عليه ولا تطيب أنفسهم أن يتخلفوا بعدي ما قعدت خلف سرية ولوددت أني أقتل ثم أحيا ثم أقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever established Salah, pays Zakah, and dies not associating anything with Allah, he has a right from Allah the Mighty and Sublime, that He will forgive him, whether he emigrated, or died in his birthplace.' We said: 'O Messenger of Allah! Shall we not tell the people about it so that they may rejoice?' He said: 'In Paradise there are one hundred levels, (the distance) between each two of which is like (the distance) between the Heaven and the Earth; Allah has prepared them fro the Mujahidin who strive in His cause. Were it not that it would be too difficult for the believers and I cannot find mounts for them - and they do not like to stay behind if I go out (on a campaign) - I would not have stayed behind from any expedition. I wish that I could be killed then brought back to life, then killed again.'\"",
      "chain": [
        "37538",
        "27542",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "3159",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن محمد بن بكار، قال حدثنا محمد بن عيسى، - وهو ابن القاسم بن سميع - قال حدثنا زيد بن واقد، عن كثير بن مرة، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض من نفس تموت ولها عند الله خير تحب أن ترجع إليكم ولها الدنيا إلا القتيل فإنه يحب أن يرجع فيقتل مرة أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kathir bin Murrah that the Messenger of Allah (ﷺ) said:                      \"There is no soul on Earth that dies, and is in a good position before Allah, that would like to come back to you, even if it had all this world, except the one who is killed (in the cause of Allah); he wishes that he could come back and be killed again.\"",
      "chain": [
        "37538",
        "27542",
        "11671",
        "19940",
        "40"
      ]
    },
    {
      "hadith_no": "4167",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرني هارون بن محمد بن بكار بن بلال، عن محمد، - وهو ابن عيسى بن سميع - قال حدثنا زيد بن واقد، عن كثير بن مرة، أن أبا فاطمة، حدثه أنه، قال يا رسول الله حدثني بعمل، أستقيم عليه وأعمله ‏.‏ قال له رسول الله صلى الله عليه وسلم ‏\"‏ عليك بالهجرة فإنه لا مثل لها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kathir bin Murrah that Abu Fatimah told him that he said:                     \"O Messenger of Allah, tell me of an action that I may do and persist in it.\" The Messenger of Allah said to him: \"You should emigrate, for there is nothing like it.\"",
      "chain": [
        "37538",
        "27542",
        "11671",
        "19940"
      ]
    },
    {
      "hadith_no": "5176",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني هارون بن محمد بن بكار بن بلال، عن محمد بن عيسى، - وهو ابن القاسم بن سميع - قال حدثنا زيد بن واقد، عن نافع، عن إبراهيم، مولى علي عن علي، قال نهاني رسول الله صلى الله عليه وسلم عن تختم الذهب وعن المعصفر وعن لبس القسي وعن القراءة في الركوع ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from rings of gold, garments dyed with safflower, and wearing Al-Qassi, and from reciting Qur'an while bowing.\"",
      "chain": [
        "37538",
        "27542",
        "11671",
        "11014",
        "5"
      ]
    },
    {
      "hadith_no": "5610",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا هشام بن عمار، قال حدثنا صدقة بن خالد، عن زيد بن واقد، أخبرني خالد بن عبد الله بن حسين، عن أبي هريرة، قال علمت أن رسول الله صلى الله عليه وسلم كان يصوم فتحينت فطره بنبيذ صنعته له في دباء فجئته به فقال ‏\"‏ أدنه ‏\"‏ ‏.‏ فأدنيته منه فإذا هو ينش فقال ‏\"‏ اضرب بهذا الحائط فإن هذا شراب من لا يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏ قال أبو عبد الرحمن وفي هذا دليل على تحريم السكر قليله وكثيره وليس كما يقول المخادعون لأنفسهم بتحريمهم آخر الشربة وتحليلهم ما تقدمها الذي يشرب في الفرق قبلها ولا خلاف بين أهل العلم أن السكر بكليته لا يحدث على الشربة الآخرة دون الأولى والثانية بعدها وبالله التوفيق ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I know that the Messenger of Allah [SAW] was fasting, so I prepared some Nabidh for him to break his fast that I had prepared for him in a gourd. I brought it to him and he said: 'Bring it here.' So I brought it closer and it was bubbling. He said: 'Throw it against the wall (throw it away), for this is the drink of one who does not believe in Allah or the Last Day.'\"",
      "chain": [
        "30288",
        "20398",
        "11671",
        "17504",
        "13"
      ]
    },
    {
      "hadith_no": "5704",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا عثمان بن حصن، قال حدثنا زيد بن واقد، عن خالد بن حسين، قال سمعت أبا هريرة، يقول علمت أن رسول الله صلى الله عليه وسلم كان يصوم في بعض الأيام التي كان يصومها فتحينت فطره بنبيذ صنعته في دباء فلما كان المساء جئته أحملها إليه فقلت يا رسول الله إني قد علمت أنك تصوم في هذا اليوم فتحينت فطرك بهذا النبيذ ‏.‏ فقال ‏\"‏ أدنه مني يا أبا هريرة ‏\"‏ ‏.‏ فرفعته إليه فإذا هو ينش فقال ‏\"‏ خذ هذه فاضرب بها الحائط فإن هذا شراب من لا يؤمن بالله ولا باليوم الآخر ‏\"‏ ‏.‏ ومما احتجوا به فعل عمر بن الخطاب رضى الله عنه ‏.‏",
      "text_en": " Abu Hurairah said:                     \"I knew that the Messenger of Allah [SAW] was fasting on certain days, so I prepared some Nabidh for him to break his fast, and made it in a gourd. When evening came I brought it to him, and said: 'O Messenger of Allah, I knew that you were fasting today, so I prepared this Nabidh for you to break your fast.' He said: 'Bring it to me, O Abu Hurairah.' I brought it to him, and it turned out to be something bubbling. He said: 'Take this and throw it against the wall (throw it away), for this is the drink of one who does not believe in Allah or the Last Day.'\"",
      "chain": [
        "20387",
        "11671",
        "13"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن خالد الأزرق، حدثنا الحسن بن يحيى الخشني، حدثنا زيد بن واقد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ورأسه يقطر ماء فصلى بنا في ثوب واحد متوشحا به قد خالف بين طرفيه فلما انصرف قال عمر بن الخطاب يا رسول الله تصلي بنا في ثوب واحد قال ‏\"‏ نعم أصلي فيه وفيه ‏\"‏ ‏.‏ أى قد جامعت فيه ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"The Messenger of Allah came out to us with water dripping from his head, and he led us in prayer wearing a single garment, placing its one end on the right shoulder, and the other end on the other shoulder. When he finished praying, 'Umar bin Khattab said to him: 'O Messenger of Allah, did you lead us in prayer wearing a single garment? He said: 'Yes, I perform prayer in it, and in it I (i.e. I had sexual intercourse in it).\"",
      "chain": [
        "37540",
        "27503",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "3499",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثني زيد بن واقد، أن خالد بن عبد الله بن حسين، حدثه قال حدثني أبو هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من شرب الخمر في الدنيا لم يشربها في الآخرة ‏\"‏ ‏.‏",
      "text_en": " AbuHurairah narrated that the Messenger of Allah (ﷺ) said:                     “Whoeverdrinks wine in this world, he will not drink it in theHereafter.”",
      "chain": [
        "30288",
        "20402",
        "11671",
        "17504",
        "13"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا مجاهد بن موسى، حدثنا الوليد، عن صدقة أبي معاوية، عن زيد بن واقد، عن خالد بن عبد الله، عن أبي هريرة، قال أتي النبي  صلى الله عليه وسلم  بنبيذ جر ينش فقال ‏\"‏ اضرب بهذا الحائط فإن هذا شراب من لا يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “Some Nabidh from an(earthenware)jar was brought to the Messenger of Allah (ﷺ) and itwas bubbling.He said: ‘Throw this against the wall, for this is thedrink of onewho does not believe in Allah and the Last Day.’”",
      "chain": [
        "30521",
        "20733",
        "11671",
        "20423",
        "13"
      ]
    }
  ],
  "total_hadiths": 15
}