{
  "id": "11681",
  "name": "al-Harith bin Shabayl الحارث بن شبيل",
  "full_name": "al-Harith bin Shabayl الحارث بن شبيل",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "KUfa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Bajli",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "169",
      "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1200",
      "hadith_no": "1200",
      "source": "Sahih Bukhari",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى  هو ابن يونس  عن إسماعيل، عن الحارث بن شبيل، عن أبي عمرو الشيباني، قال قال لي زيد بن أرقم إن كنا لنتكلم في الصلاة على عهد النبي صلى الله عليه وسلم، يكلم أحدنا صاحبه بحاجته حتى نزلت ‏{‏حافظوا على الصلوات‏}‏ الآية، فأمرنا بالسكوت‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     In the lifetime of the Prophet we used to speak while praying, and one of us would tell his needs to his companions, till the verse, 'Guard strictly your prayers (2.238) was revealed. After that we were ordered to remain silent while praying.",
      "usc_msa_ref": "292",
      "chain": [
        "30309",
        "20347",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "sahih-bukhari-4576",
      "hadith_no": "4576",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم في الصلاة يكلم أحدنا أخاه في حاجته حتى نزلت هذه الآية ‏{‏حافظوا على الصلوات والصلاة الوسطى وقوموا لله قانتين‏}‏ فأمرنا بالسكوت‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     We used to speak while in prayer. One of us used to speak to his brother (while in prayer) about his need, till the Verse was revealed:-- \"Guard strictly the (five obligatory) prayers, especially the middle (the Best) (`Asr) Prayer and stand before Allah with obedience (and not to speak to others during the prayers).\" Then we were ordered not to speak in the prayers.",
      "usc_msa_ref": "58",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "sahih-muslim-1231",
      "hadith_no": "1231",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم في الصلاة يكلم الرجل صاحبه وهو إلى جنبه في الصلاة حتى نزلت ‏{‏ وقوموا لله قانتين‏}‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏",
      "text_en": " Zaid b. Arqam reported:                      We used to talk while engaged in prayer and a person talked with a companion on his side in prayer till (this verse) was revealed:\" And stand before Allah in devout obedience\" (ii, 238) and we were commanded to observe silence (in prayer) and were forbidden to speak.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "sunan-abi-daud-949",
      "hadith_no": "949",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كان أحدنا يكلم الرجل إلى جنبه في الصلاة فنزلت ‏{‏ وقوموا لله قانتين ‏}‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏",
      "text_en": " Zaid b. Arqam said ; One of us used to speak to the man standing by his side during prayer. Then the Quranic verse “ And stand up with devotion to Allah”",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "jami-al-tirmidhi-405",
      "hadith_no": "405",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم خلف رسول الله صلى الله عليه وسلم في الصلاة يكلم الرجل منا صاحبه إلى جنبه حتى نزلت ‏:‏ ‏(‏وقوموا لله قانتين ‏)‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏ قال وفي الباب عن ابن مسعود ومعاوية بن الحكم ‏.‏ قال أبو عيسى حديث زيد بن أرقم حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم ‏.‏ قالوا إذا تكلم الرجل عامدا في الصلاة أو ناسيا أعاد الصلاة ‏.‏ وهو قول سفيان الثوري وابن المبارك وأهل الكوفة ‏.‏ وقال بعضهم إذا تكلم عامدا في الصلاة أعاد الصلاة وإن كان ناسيا أو جاهلا أجزأه ‏.‏ وبه يقول الشافعي ‏.‏",
      "text_en": " Zaid bin Arqam narrated:                     \"We used to talk behind Allah's Messenger (S) during the Salat, a man among us would talk to his companions next to him until (the following) was revealed: And stand before Allah with obedience. (2:238) So we were ordered to be silent and prohibited from talking.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3253",
      "hadith_no": "3253",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، ويزيد بن هارون، ومحمد بن عبيد، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم على عهد رسول الله صلى الله عليه وسلم في الصلاة فنزلت ‏:‏ ‏(‏وقوموا لله قانتين ‏)‏ فأمرنا بالسكوت ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     \"During the time of the Messenger of Allah (ﷺ), we would talk during Salat, so 'And stand before Allah with obedience (2:238) was revealed, ordering us to be silent.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20201",
        "20472",
        "30213",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "sunan-an-nasai-1219",
      "hadith_no": "1219",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يحيى بن سعيد، قال حدثنا إسماعيل بن أبي خالد، قال حدثني الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كان الرجل يكلم صاحبه في الصلاة بالحاجة على عهد رسول الله صلى الله عليه وسلم حتى نزلت هذه الآية ‏{‏ حافظوا على الصلوات والصلاة الوسطى وقوموا لله قانتين ‏}‏ فأمرنا بالسكوت ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                     \"We used to speak to each other during the prayer, saying whatever was necessary, at the time of the Messenger of Allah (ﷺ), until this verse was revealed: Guard strictly (five obligatory) As-Salawat (the prayers) especially the middle Salah (i.e. the best prayer- 'Asr). And stand before Allah with obedience (and do not speak to others during the Salah (prayers)), so we were commanded to be silent.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20031",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    }
  ],
  "total_hadiths": 7
}