{
  "id": "11683",
  "name": "Hrmlh Mwla Usamah bin Zayd حرملة مولى أسامة بن زيد",
  "full_name": "Hrmlh Mwla Usamah bin Zayd حرملة مولى أسامة بن زيد",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3783",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "قال أبو عبد الله وحدثني سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا عبد الرحمن بن نمر، عن الزهري، حدثني حرملة، مولى أسامة بن زيد أنه بينما هو مع عبد الله بن عمر إذ دخل الحجاج بن أيمن فلم يتم ركوعه ولا سجوده، فقال أعد‏.‏ فلما ولى قال لي ابن عمر من هذا قلت الحجاج بن أيمن ابن أم أيمن‏.‏ فقال ابن عمر لو رأى هذا رسول الله صلى الله عليه وسلم لأحبه، فذكر حبه وما ولدته أم أيمن‏.‏ قال وحدثني بعض أصحابي عن سليمان وكانت حاضنة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Harmala, the freed slave of Usama bin Zaid saidthat while he      was in the company of 'Abdullah bin 'Umar, Al-Hajjaj bin Aiman came in     and (while praying) he did not perform his bowing and prostrations      properly. So Ibn 'Umar told him to repeat his prayer. When he went      away, Ibn 'Umar asked me, \"Who is he?\" I said, \"Al-Hajjaj bin Um      Aiman.\" Ibn 'Umar said, \"If Allah's Apostle saw him, he would have      loved him.\" Then Ibn 'Umar mentioned the love of the Prophet for the      children of Um Aiman. Sulaiman said that Um Aiman was one of the nurses     of the Prophet.",
      "chain": [
        "30184",
        "30587",
        "20733",
        "11013",
        "11683"
      ]
    },
    {
      "hadith_no": "7195",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال قال عمرو أخبرني محمد بن علي، أن حرملة، مولى أسامة أخبره قال عمرو وقد رأيت حرملة قال أرسلني أسامة إلى علي وقال إنه سيسألك الآن فيقول ما خلف صاحبك فقل له يقول لك لو كنت في شدق الأسد لأحببت أن أكون معك فيه، ولكن هذا أمر لم أره، فلم يعطني شيئا، فذهبت إلى حسن وحسين وابن جعفر فأوقروا لي راحلتي‏.‏",
      "text_en": " Narrated Harmala:                     (Usama's Maula) Usama (bin Zaid) sent me to `Ali (at Kufa) and said, \"`Ali will ask you, 'What has prevented your companion from joining me?' You then should say to him, 'If you (`Ali) were in the mouth of a lion, I would like to be with you, but in this matter I won't take any part.' \" Harmala added: \"`Ali didn't give me anything (when I conveyed the message to him) so I went to Hasan, Hussain and Ibn Ja`far and they loaded my camels with much (wealth).",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11442",
        "11683"
      ]
    }
  ],
  "total_hadiths": 2
}