{
  "id": "11699",
  "name": "'Abdullah bin 'Urwa عبد الله بن عروة بن الزبير",
  "full_name": "'Abdullah bin 'Urwa عبد الله بن عروة بن الزبير",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "45",
      "date_gregorian": "NA",
      "date_display": [
        "45 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  ق  -  ثقة ثبت ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11526",
      "name": "'Uthman bin 'Urwa bin al-Zubair عثمان بن عروة بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18935",
      "name": "Muhammad bin 'Urwa bin al-Zubair محمد بن عروة بن الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11545",
      "name": "Yahya bin 'Urwa bin al-Zubair يحيى بن عروة بن الزبير",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [
    {
      "id": "11529",
      "name": "'Umar bin 'Abdullah عمر بن عبد الله بن عروة بن الزبير",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "70",
      "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "423",
      "name": "Hakim ibn Hizam ( حكيم بن حزام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4045",
      "name": "al-Nabghat-ul Ja'di, the Poet ( النابغة الجعدي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "students": [
    {
      "id": "11529",
      "name": "'Umar bin 'Abdullah عمر بن عبد الله بن عروة بن الزبير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5244",
      "hadith_no": "5244",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن عبد الرحمن، وعلي بن حجر، قالا أخبرنا عيسى بن يونس، حدثنا هشام بن عروة، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت جلس إحدى عشرة امرأة، فتعاهدن وتعاقدن أن لا يكتمن من أخبار أزواجهن شيئا‏.‏ قالت الأولى زوجي لحم جمل، غث على رأس جبل، لا سهل فيرتقى، ولا سمين فينتقل‏.‏ قالت الثانية زوجي لا أبث خبره، إني أخاف أن لا أذره، إن أذكره أذكر عجره وبجره‏.‏ قالت الثالثة زوجي العشنق، إن أنطق أطلق وإن أسكت أعلق‏.‏ قالت الرابعة زوجي كليل تهامة، لا حر، ولا قر، ولا مخافة، ولا سآمة‏.‏ قالت الخامسة زوجي إن دخل فهد، وإن خرج أسد، ولا يسأل عما عهد‏.‏ قالت السادسة زوجي إن أكل لف، وإن شرب اشتف، وإن اضطجع التف، ولا يولج الكف ليعلم البث، قالت السابعة زوجي غياياء أو عياياء طباقاء، كل داء له داء، شجك أو فلك أو جمع كلا لك‏.‏ قالت الثامنة زوجي المس مس أرنب، والريح ريح زرنب‏.‏ قالت التاسعة زوجي رفيع العماد، طويل النجاد، عظيم الرماد، قريب البيت من الناد‏.‏ قالت العاشرة زوجي مالك وما مالك، مالك خير من ذلك، له إبل كثيرات المبارك قليلات المسارح، وإذا سمعن صوت المزهر أيقن أنهن هوالك‏.‏ قالت الحادية عشرة زوجي أبو زرع فما أبو زرع أناس من حلي أذنى، وملأ من شحم عضدى، وبجحني فبجحت إلى نفسي، وجدني في أهل غنيمة بشق، فجعلني في أهل صهيل وأطيط ودائس ومنق، فعنده أقول فلا أقبح وأرقد فأتصبح، وأشرب فأتقنح، أم أبي زرع فما أم أبي زرع عكومها رداح، وبيتها فساح، ابن أبي زرع، فما ابن أبي زرع مضجعه كمسل شطبة، ويشبعه ذراع الجفرة، بنت أبي زرع فما بنت أبي زرع طوع أبيها، وطوع أمها، وملء كسائها، وغيظ جارتها، جارية أبي زرع، فما جارية أبي زرع لا تبث حديثنا تبثيثا، ولا تنقث ميرتنا تنقيثا، ولا تملأ بيتنا تعشيشا، قالت خرج أبو زرع والأوطاب تمخض، فلقي امرأة معها ولدان لها كالفهدين يلعبان من تحت خصرها برمانتين، فطلقني ونكحها، فنكحت بعده رجلا سريا، ركب شريا وأخذ خطيا وأراح على نعما ثريا، وأعطاني من كل رائحة زوجا وقال كلي أم زرع، وميري أهلك‏.‏ قالت فلو جمعت كل شىء أعطانيه ما بلغ أصغر آنية أبي زرع‏.‏ قالت عائشة قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت لك كأبي زرع لأم زرع ‏\"‏‏.‏ قال أبو عبد الله قال سعيد بن سلمة عن هشام ولا تعشش بيتنا تعشيشا‏.‏ قال أبو عبد الله قال بعضهم فأتقمح‏.‏ بالميم، وهذا أصح‏.‏",
      "text_en": " Narrated `Aisha:                     Eleven women sat (at a place) and promised and contracted that they would not conceal anything of the news of their husbands. The first one said, \"My husband is like the meat of a slim weak camel which is kept on the top of a mountain which is neither easy to climb, nor is the meat fat, so that one might put up with the trouble of fetching it.\" The second one said, \"I shall not relate my husband's news, for I fear that I may not be able to finish his story, for if I describe him, I will mention all his defects and bad traits.\" The third one said, \"My husband, the \"too-tall\"! if I describe him (and he hears of that) he will divorce me, and if I keep quiet, he will keep me hanging (neither divorcing me nor treating me as a wife).\" The fourth one said, \"My husband is (moderate in temper) like the night of Tihama: neither hot nor cold; I am neither afraid of him, nor am I discontented with him.\" The fifth one said, \"My husband, when entering (the house) is a leopard (sleeps a lot), and when going out, is a lion (boasts a lot). He does not ask about whatever is in the house.\" The sixth one said, \"If my husband eats, he eats too much (leaving the dishes empty), and if he drinks he leaves nothing; if he sleeps he sleeps he rolls himself (alone in our blankets); and he does not insert his palm to inquire about my feelings.\" The seventh one said, \"My husband is a wrong-doer or weak and foolish. All the defects are present in him. He may injure your head or your body or may do both.\" The eighth one said, \"My husband is soft to touch like a rabbit and smells like a Zarnab (a kind of good smelling grass).\" The ninth one said, \"My husband is a tall generous man wearing a long strap for carrying his sword. His ashes are abundant (i.e. generous to his guests) and his house is near to the people (who would easily consult him).\" The tenth one said, \"My husband is Malik (possessor), and what is Malik? Malik is greater than whatever I say about him. (He is beyond and above all praises which can come to my mind). Most of his camels are kept at home (ready to be slaughtered for the guests) and only a few are taken to the pastures. When the camels hear the sound of the lute (or the tambourine) they realize that they are going to be slaughtered for the guests.\" The eleventh one said, \"My husband is Abu Zar` and what is Abu Zar` (i.e., what should I say about him)? He has given me many ornaments and my ears are heavily loaded with them and my arms have become fat (i.e., I have become fat). And he has pleased me, and I have become so happy that I feel proud of myself. He found me with my family who were mere owners of sheep and living in poverty, and brought me to a respected family having horses and camels and threshing and purifying grain. Whatever I say, he does not rebuke or insult me. When I sleep, I sleep till late in the morning, and when I drink water (or milk), I drink my fill. The mother of Abu Zar and what may one say in praise of the mother of Abu Zar? Her saddle bags were always full of provision and her house was spacious. As for the son of Abu Zar, what may one say of the son of Abu Zar? His bed is as narrow as an unsheathed sword and an arm of a kid (of four months) satisfies his hunger. As for the daughter of Abu Zar, she is obedient to her father and to her mother. She has a fat well-built body and that arouses the jealousy of her husband's other wife. As for the (maid) slave girl of Abu Zar, what may one say of the (maid) slavegirl of Abu Zar? She does not uncover our secrets but keeps them, and does not waste our provisions and does not leave the rubbish scattered everywhere in our house.\" The eleventh lady added, \"One day it so happened that Abu Zar went out at the time when the milk was being milked from the animals, and he saw a woman who had two sons like two leopards playing with her two breasts. (On seeing her) he divorced me and married her. Thereafter I married a noble man who used to ride a fast tireless horse and keep a spear in his hand. He gave me many things, and also a pair of every kind of livestock and said, Eat (of this), O Um Zar, and give provision to your relatives.\" She added, \"Yet, all those things which my second husband gave me could not fill the smallest utensil of Abu Zar's.\" `Aisha then said: Allah's Apostle said to me, \"I am to you as Abu Zar was to his wife Um Zar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30587",
        "20387",
        "20347",
        "11065",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1745",
      "hadith_no": "1745",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، وحسن الحلواني، كلاهما عن زيد، قال حسن حدثنا زيد بن الحباب، حدثني الضحاك بن عثمان، حدثني عبد الله بن عروة، عن أبيه، عن عائشة، قالت لما بدن رسول الله صلى الله عليه وسلم وثقل كان أكثر صلاته جالسا ‏.‏",
      "text_en": " Hafsa reported:                      Never did I see the Messenger of Allah (may peace be upon him) observing supererogatory prayer sitting till one year before his death when he would observe Nafl prayer in a sitting position, and he would recite the Surah (of the Qur'an) in such a slow-measured tone (that duration of its recital) became more lengthy than the one longer than this.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "15",
        "20650",
        "20504",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3548",
      "hadith_no": "3548",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، - واللفظ لزهير - قالا حدثنا وكيع، حدثنا سفيان، عن إسماعيل بن أمية، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم في شوال وبنى بي في شوال فأى نساء رسول الله صلى الله عليه وسلم كان أحظى عنده مني ‏.‏ قال وكانت عائشة تستحب أن تدخل نساءها في شوال ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) contracted marriage with me in Shawwal and took me to his house as a bride during Shawwal. And who among the wives of Allah's Messenger (may peace be upon him) was dearer to him than I, and' A'isha liked that the women (of her family) should enter the houses as brides during the month of Shawwal.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1093",
      "hadith_no": "1093",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سفيان، عن إسماعيل بن أمية، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم في شوال وبنى بي في شوال ‏.‏ وكانت عائشة تستحب أن يبنى بنسائها في شوال ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث الثوري عن إسماعيل بن أمية ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah married me in Shawwal, and he took up residence with me in Shawwal.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3236",
      "hadith_no": "3236",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا إسماعيل بن أمية، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم في شوال وأدخلت عليه في شوال وكانت عائشة تحب أن تدخل نساءها في شوال فأى نسائه كانت أحظى عنده مني",
      "text_en": " Narrated 'Urwah:                     It was narrated from 'Urwah, that 'Aishah said: \"The Messenger of Allah married me in Shawwal and my marriage was consummated in Shawwal.\" --'Aishah liked for her women's marriages to be consummated in Shawwal --\"and which of his wives was more beloved to him than me?\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3377",
      "hadith_no": "3377",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا سفيان، عن إسماعيل بن أمية، عن عبد الله بن عروة، عن أبيه، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم في شوال وأدخلت عليه في شوال فأى نسائه كان أحظى عنده مني ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Prophet married me in Shawwal, and he consummated the marriage with me in Shawwal, and which of his wives find more favor with him than me?\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2067",
      "hadith_no": "2067",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، جميعا عن سفيان، عن إسماعيل بن أمية، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت تزوجني النبي  صلى الله عليه وسلم  في شوال وبنى بي في شوال ‏.‏ فأى نسائه كان أحظى عنده مني ‏.‏ وكانت عائشة تستحب أن تدخل نساءها في شوال ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet, married me in Shawwal, and he consummated the marriage with me in Shawwal, and which of his wives was more favored to him than I.\" 'Airhuh used to like marriage to be consummated with her female relatives in Shawwal.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "34043",
        "11062",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 7
}