{
  "id": "11692",
  "name": "Sulaiman bin Habib al-Maharbi سليمان بن حبيب المحاربي",
  "full_name": "Sulaiman bin Habib al-Maharbi سليمان بن حبيب المحاربي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "126",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  ق  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Damashiqi",
      "al-Maharbi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17204",
      "name": "'Amir bin Ldyn al-Ash'ry عامر بن لدين الأشعري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "631",
      "name": "al-Walid bin 'Ubada bin As-Samit ( الوليد بن عبادة بن الصامت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20166",
      "name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27530",
      "name": "'Uthman bin Abi al-Atk'h عثمان بن أبي العاتكة سليمان الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28322",
      "name": "Abd Rbh bin 'Ubaid عبد ربه بن عبيد الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12321",
      "name": "Abd al-Whab bin Bkht عبد الوهاب بن بخت",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2909",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا الأوزاعي، قال سمعت سليمان بن حبيب، قال سمعت أبا أمامة، يقول لقد فتح الفتوح قوم ما كانت حلية سيوفهم الذهب ولا الفضة، إنما كانت حليتهم العلابي والآنك والحديد‏.‏",
      "text_en": " Narrated Abu Umama:                     Some people conquered many countries and their swords were decorated neither with gold nor silver, but they were decorated with leather, lead and iron.",
      "chain": [
        "30304",
        "20025",
        "20024",
        "11692",
        "4048"
      ]
    },
    {
      "hadith_no": "2494",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد السلام بن عتيق، حدثنا أبو مسهر، حدثنا إسماعيل بن عبد الله، - يعني ابن سماعة - حدثنا الأوزاعي، حدثني سليمان بن حبيب، عن أبي أمامة الباهلي، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثلاثة كلهم ضامن على الله عز وجل رجل خرج غازيا في سبيل الله فهو ضامن على الله حتى يتوفاه فيدخله الجنة أو يرده بما نال من أجر وغنيمة ورجل راح إلى المسجد فهو ضامن على الله حتى يتوفاه فيدخله الجنة أو يرده بما نال من أجر وغنيمة ورجل دخل بيته بسلام فهو ضامن على الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Umamat Al Bahili reported the Apostle of Allaah(ﷺ) as saying “There are three persons who are in the security of Allaah, the Exalted.” “A man who goes out on an expedition to fight in the path of Allaah, the Exalted, is in the security of Allaah, until He takes him unto Him(i.e., he dies) and brings him into Paradise or brings him(alive) with reward and booty he obtains and a man who goes to the mosque is in the security of Allaah, until he takes him unto Him(i.e., he dies), and he brings him into Paradise or brings him with reward and spoils he obtains; and a man who enters his house after giving salutation is in the security of Allaah, the Exalted.”",
      "chain": [
        "37520",
        "30284",
        "20024",
        "11692",
        "4048"
      ]
    },
    {
      "hadith_no": "4800",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عثمان الدمشقي أبو الجماهر، قال حدثنا أبو كعب، أيوب بن محمد السعدي قال حدثني سليمان بن حبيب المحاربي، عن أبي أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا زعيم ببيت في ربض الجنة لمن ترك المراء وإن كان محقا وببيت في وسط الجنة لمن ترك الكذب وإن كان مازحا وببيت في أعلى الجنة لمن حسن خلقه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: I guarantee a house in the surroundings of Paradise for a man who avoids quarrelling even if he were in the right, a house in the middle of Paradise for a man who avoids lying even if he were joking, and a house in the upper part of Paradise for a man who made his character good.",
      "chain": [
        "38550",
        "11692",
        "405"
      ]
    },
    {
      "hadith_no": "2914",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني سليمان بن حبيب، قال دخلنا على أبي أمامة فرأى في سيوفنا شيئا من حلية فضة فغضب وقال لقد فتح الفتوح قوم ما كان حلية سيوفهم من الذهب والفضة ولكن الآنك والحديد والعلابي ‏.‏ قال أبو الحسن القطان العلابي العصب ‏.‏",
      "text_en": " Sulaimanbin Habib said:                      “We entered upon Abu Umamah and he saw some silverornaments on our swords. He got angry and said: ‘People conqueredlands and their swords were not adorned with gold and silver, butwith lead and iron and ‘Alabi.’”",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11692"
      ]
    },
    {
      "hadith_no": "4229",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا عثمان بن أبي العاتكة، عن سليمان بن حبيب المحاربي، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا وقعت الملاحم بعث الله بعثا من الموالي هم أكرم العرب فرسا وأجوده سلاحا يؤيد الله بهم الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “When the fierce battles take place, Allah will send a troopoffreed slaves who will be the best Arab horsemen and the bestarmed,with whom Allah will support His religion.”",
      "chain": [
        "30288",
        "20733",
        "27530",
        "11692",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}