{
  "id": "11697",
  "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
  "full_name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "25",
      "date_gregorian": "NA",
      "date_display": [
        "25 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  ق  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Sa'ida",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "399",
      "name": "Sahl bin Sa'd bin Malik ( سهل بن سعد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "22139",
      "name": "'Abdul Mahaymun bin 'Abbas عبد المهيمن بن عباس بن سهل بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20152",
      "name": "Ubayy bin al-'Abbas bin Sahl أبي بن العباس بن سهل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "teachers": [
    {
      "id": "399",
      "name": "Sahl bin Sa'd bin Malik ( سهل بن سعد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "113",
      "name": "Abu Usayd Malik bin Rabi'a ( مالك بن ربيعة أبو أسيد الساعدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1457",
      "name": "Abu Hameed al-Sa'idi al-Ansari ( عبد الرحمن بن سعد, أبو حميد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1716",
      "name": "'Abdullah bin Hanzala bin Abi 'Amir ( عبد الله بن حنظلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20152",
      "name": "Ubayy bin al-'Abbas bin Sahl أبي بن العباس بن سهل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22139",
      "name": "'Abdul Mahaymun bin 'Abbas عبد المهيمن بن عباس بن سهل بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11517",
      "name": "'Abdur Rahman bin Sulaiman ibn al-Ghasil عبد الرحمن بن سليمان - ابن الغسيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1905",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل بن سعد، عن أبي حميد  رضى الله عنه  أقبلنا مع النبي صلى الله عليه وسلم من تبوك حتى أشرفنا على المدينة فقال ‏\"‏ هذه طابة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid:                     We came with the Prophet from Tabuk, and when we reached near Medina, the Prophet said, \"This is Tabah.\"",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "hadith_no": "3838",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل، عن أبي حميد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن خير دور الأنصار دار بني النجار، ثم عبد الأشهل، ثم دار بني الحارث، ثم بني ساعدة، وفي كل دور الأنصار خير ‏\"‏‏.‏ فلحقنا سعد بن عبادة فقال أبا أسيد ألم تر أن نبي الله صلى الله عليه وسلم خير الأنصار فجعلنا أخيرا فأدرك سعد النبي صلى الله عليه وسلم فقال يا رسول الله، خير دور الأنصار فجعلنا آخرا‏.‏ فقال ‏\"‏ أوليس بحسبكم أن تكونوا من الخيار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid:                     The Prophet said, \"The best of the Ansar families (homes) are the families (homes) of Banu An- Najjar, and then that of Banu `Abdul Ash-hal, and then that of Banu Al-Harith, and then that of Banu Saida; and there is good in all the families (homes) of the Ansar.\" Sa`d bin 'Ubada followed us and said, \"O Abu Usaid ! Don't you see that the Prophet compared the Ansar and made us the last of them in superiority? Then Sa`d met the Prophet and said, \"O Allah's Apostle! In comparing the Ansar's families (homes) as to the degree of superiority, you have made us the last of them.\" Allah's Apostle replied, \"Isn't it sufficient that you are regarded amongst the best?\"",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "hadith_no": "4466",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل بن سعد، عن أبي حميد، قال أقبلنا مع النبي صلى الله عليه وسلم من غزوة تبوك حتى إذا أشرفنا على المدينة قال ‏\"‏ هذه طابة، وهذا أحد، جبل يحبنا ونحبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid:                     We returned in the company of the Prophet from the Ghazwa of Tabuk, and when we looked upon Medina, the Prophet said, \"This is Taba (i.e. Medina), and this is Uhud, a mountain that loves us and is loved by us.\"",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "hadith_no": "5312",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا إبراهيم بن أبي الوزير، حدثنا عبد الرحمن، عن حمزة، عن أبيه، وعن عباس بن سهل بن سعد، عن أبيه، بهذا‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     similarly as above (182).",
      "chain": [
        "30351",
        "31010",
        "20033",
        "11697"
      ]
    },
    {
      "hadith_no": "6514",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو نعيم، حدثنا عبد الرحمن بن سليمان بن الغسيل، عن عباس بن سهل بن سعد، قال سمعت ابن الزبير، على المنبر بمكة في خطبته يقول يا أيها الناس إن النبي صلى الله عليه وسلم كان يقول ‏\"‏ لو أن ابن آدم أعطي واديا ملأ من ذهب أحب إليه ثانيا، ولو أعطي ثانيا أحب إليه ثالثا، ولا يسد جوف ابن آدم إلا التراب، ويتوب الله على من تاب ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I heard Ibn Az-Zubair who was on the pulpit at Mecca, delivering a sermon, saying, \"O men! The Prophet used to say, \"If the son of Adam were given a valley full of gold, he would love to have a second one; and if he were given the second one, he would love to have a third, for nothing fills the belly of Adam's son except dust. And Allah forgives he who repents to Him.\" Ubai said, \"We considered this as a saying from the Qur'an till the Sura (beginning with) 'The mutual rivalry for piling up of worldly things diverts you..' (102.1) was revealed.\"",
      "chain": [
        "20348",
        "11517",
        "11697"
      ]
    },
    {
      "hadith_no": "4217",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء بن عبد الرحمن، عن عباس بن سهل بن سعد الساعدي، عن سعيد بن زيد بن عمرو بن نفيل، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتطع شبرا من الأرض ظلما طوقه الله إياه يوم القيامة من سبع أرضين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who wrongly took a span of land, Allah shall make him carry around his neck seven earths.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "10606",
        "11697",
        "11"
      ]
    },
    {
      "hadith_no": "6087",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان بن بلال، عن عمرو بن يحيى، عن عباس بن سهل بن سعد الساعدي، عن أبي حميد، قال خرجنا مع رسول الله صلى الله عليه وسلم غزوة تبوك فأتينا وادي القرى على حديقة لامرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ اخرصوها ‏\"‏ ‏.‏ فخرصناها وخرصها رسول الله صلى الله عليه وسلم عشرة أوسق وقال ‏\"‏ أحصيها حتى نرجع إليك إن شاء الله ‏\"‏ ‏.‏ وانطلقنا حتى قدمنا تبوك فقال رسول الله صلى الله عليه وسلم ‏\"‏ ستهب عليكم الليلة ريح شديدة فلا يقم فيها أحد منكم فمن كان له بعير فليشد عقاله ‏\"‏ ‏.‏ فهبت ريح شديدة فقام رجل فحملته الريح حتى ألقته بجبلى طيئ وجاء رسول ابن العلماء صاحب أيلة إلى رسول الله صلى الله عليه وسلم بكتاب وأهدى له بغلة بيضاء فكتب إليه رسول الله صلى الله عليه وسلم وأهدى له بردا ثم أقبلنا حتى قدمنا وادي القرى فسأل رسول الله صلى الله عليه وسلم المرأة عن حديقتها ‏\"‏ كم بلغ ثمرها ‏\"‏ ‏.‏ فقالت عشرة أوسق ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني مسرع فمن شاء منكم فليسرع معي ومن شاء فليمكث ‏\"‏ ‏.‏ فخرجنا حتى أشرفنا على المدينة فقال ‏\"‏ هذه طابة وهذا أحد وهو جبل يحبنا ونحبه ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن خير دور الأنصار دار بني النجار ثم دار بني عبد الأشهل ثم دار بني عبد الحارث بن الخزرج ثم دار بني ساعدة وفي كل دور الأنصار خير ‏\"‏ ‏.‏ فلحقنا سعد بن عبادة فقال أبو أسيد ألم تر أن رسول الله صلى الله عليه وسلم خير دور الأنصار فجعلنا آخرا ‏.‏ فأدرك سعد رسول الله صلى الله عليه وسلم فقال يا رسول الله خيرت دور الأنصار فجعلتنا آخرا ‏.‏ فقال ‏\"‏ أوليس بحسبكم أن تكونوا من الخيار ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid as-Sa'idi reported:                      We went out with Allah's Messenger (may peace be upon him) on the expedition to Tabuk and we came to a wadi where there was a garden belonging to a woman. Allah's Apostle (may peace be upon him) said. Make an assessment (of the price of its fruit). And Allah's Messenger (may peace be upon him) also made an assessment and it was ten wasqs. He asked that lady (to calculate the amount) until they would, God willing, come back to her. So we proceeded on until we came to Tabuk and Allah's Messenger (may peace be upon him) said: The violent storm will overtake you during the night, so none amongst you should stand up and he who has a camel with him should hobble it firmly. A violent storm blew and a person who had stood up was carried away by the storm and thrown between the mountains of Tayy. Then the messenger of the son of al 'Alma', the ruler of Aila, came to Allah's Messenger (may peace be upon him) with a letter and a gift of a white mule. Allah's Messenger (may peace be upon him) wrote him (the reply) and presented him a cloak. We came back until we halted in the Wadi al-Qura. Allah's Messenger (may peace be upon him) asked that lady about her garden and the price of the fruits in that. She said: Ten wasqs. Thereupon Allah's Messenger (may peace be upon him) said: I am going to depart, and he who amongst you wishes may depart with me but he who wants to stay may stay. We resumed the journey until we came to the outskirts of Medina. (It was at this time) that Allah's Messenger (may peace be upon him) said: This is Taba, this is Uhud, that is a mountain which loves us and we love it, and then said: The best amongst the houses of the Ansar is the house of Bani Najjar. Then the house of Bani Abd al-Ashhal, then the house of Bani Abd al-Harith b. Khazraj, then the house of Bani Sa'ida, and there is goodness in all the houses of the Ansar. Said b. Ubada came to us and Abu Usaid said to him: Did you not see that Allah's Messenger (may peace be upon him) has declared the houses of the Ansar good and he has kept us at the end. Said met Allah's Messenger (may peace be upon him) and said: Allah's Messenger, you have declared the house of the Ansar as good and have kept us at the end, whereupon he said: Is it not enough for you that you have been counted amongst the good.",
      "chain": [
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، أخبرني فليح، حدثني عباس بن سهل، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم فذكر بعض هذا قال ثم ركع فوضع يديه على ركبتيه كأنه قابض عليهما ووتر يديه فتجافى عن جنبيه قال ثم سجد فأمكن أنفه وجبهته ونحى يديه عن جنبيه ووضع كفيه حذو منكبيه ثم رفع رأسه حتى رجع كل عظم في موضعه حتى فرغ ثم جلس فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ووضع كفه اليمنى على ركبته اليمنى وكفه اليسرى على ركبته اليسرى وأشار بأصبعه ‏.‏ قال أبو داود روى هذا الحديث عتبة بن أبي حكيم عن عبد الله بن عيسى عن العباس بن سهل لم يذكر التورك وذكر نحو حديث فليح وذكر الحسن بن الحر نحو جلسة حديث فليح وعتبة ‏.‏",
      "text_en": " ‘Abbas b. Sahl. Said:                      Abu Humaid, Abu Usaid, Sahl. B Sa’d and Muhammad b. Maslamah (once) got together and discussed how the Messenger of Allah(ﷺ) used to offer his prayer. Abu Humaid said: I am more informed than any of you regarding the prayer offered by the Messenger of Allah (ﷺ). Then he mentioned a part of it, and said: He then bowed and placed his hands upon his knees as if he caught hold of them; and bent them, keeping (his arms) away from his sides. He them prostrated himself and placed his nose and forehead (on the ground); and kept his arms away from his side, and placed his palms (on the ground opposite his shoulders; he then raised his head that every bone returned to its proper place; (he then prostrated twice) until he finished this prostrations). Then he sat down and spread out his left foot, putting forward the front of his right foot towards the qiblah placing the palm of his right hand on his right knee, and the palm of his left hand on his left knee, and he pointed with his finger.Abu Dawud said: This tradition has been narrated by Ibn al-Mubarak from Fulaih who heard ‘Abbas . Sahl narrating it; but I do not remember it. I think he made the mention of ‘Isa b. ‘Abd Allah who heard ‘Abbas b. Sahl saying: I accompanied Abu Humaid al-Sa’idi.",
      "chain": [
        "30007",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "735",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني عتبة، حدثني عبد الله بن عيسى، عن العباس بن سهل الساعدي، عن أبي حميد، بهذا الحديث قال وإذا سجد فرج بين فخذيه غير حامل بطنه على شىء من فخذيه ‏.‏ قال أبو داود رواه ابن المبارك أخبرنا فليح سمعت عباس بن سهل يحدث فلم أحفظه فحدثنيه أراه ذكر عيسى بن عبد الله أنه سمعه من عباس بن سهل قال حضرت أبا حميد الساعدي بهذا الحديث ‏.‏",
      "text_en": " Abu Humaid reported to the same effect. He said:                      When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b. Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b. Sahl and Abu Humaid al-Sa’idi.",
      "chain": [
        "10581",
        "20644",
        "11361",
        "1457",
        "30002",
        "20025",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الملك بن عمرو، أخبرني فليح، أخبرني عباس بن سهل، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكر هذا الحديث ولم يذكر الرفع إذا قام من ثنتين ولا الجلوس قال حتى فرغ ثم جلس فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ‏.‏",
      "text_en": " ‘Abbas b. Sahl said:                      Abu Humaid, Abu usaid, Sahl b. Sa’d and Muhammad b. Maslamah got together. Then he narrated this tradition. He did not mention the raising of hands when he stood after two rak’ahs, nor did he mention sitting. He said: When he finished (his prostration), he spread his foot (on the ground) and turned the toes of his right feet towards the qiblah(and then he sat on his left foot).",
      "chain": [
        "30007",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "2246",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد العزيز بن يحيى، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، حدثني عباس بن سهل، عن أبيه، أن النبي صلى الله عليه وسلم قال لعاصم بن عدي ‏\"‏ أمسك المرأة عندك حتى تلد ‏\"‏ ‏.‏",
      "text_en": " ‘Abbas bin Sahl reported on the authority of his father “The Prophet (ﷺ) said to ‘Asim bin ‘Adl. Keep the woman with you till she begets the child.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11697",
        "399"
      ]
    },
    {
      "hadith_no": "260",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان، حدثنا عباس بن سهل بن سعد، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم ركع فوضع يديه على ركبتيه كأنه قابض عليهما ووتر يديه فنحاهما عن جنبيه ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى حديث أبي حميد حديث حسن صحيح ‏.‏ وهو الذي اختاره أهل العلم أن يجافي الرجل يديه عن جنبيه في الركوع والسجود ‏.‏",
      "text_en": " Abbas bin Sahl [bin Sa'd] narrated:                     \"Abu Humaid, Abu Usaid, Sahl bin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: 'I am the most knowledgeable among you of the Salat of Allah's Messenger: Allah's Messenger would bow and place his hands on his knees as if he was grasping them, and he would draw his forearms to hold them away from his sides.'\"",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان، حدثني عباس بن سهل، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم كان إذا سجد أمكن أنفه وجبهته من الأرض ونحى يديه عن جنبيه ووضع كفيه حذو منكبيه ‏.‏ قال وفي الباب عن ابن عباس ووائل بن حجر وأبي سعيد ‏.‏ قال أبو عيسى حديث أبي حميد حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم أن يسجد الرجل على جبهته وأنفه فإن سجد على جبهته دون أنفه فقد قال قوم من أهل العلم يجزئه ‏.‏ وقال غيرهم لا يجزئه حتى يسجد على الجبهة والأنف ‏.‏",
      "text_en": " Abu Humaid As-Sa'idi narrated:                     \"When the Prophet would prostrate, he placed his nose and his forehead on the ground, and he held his forearms away from his sides, and he placed his hands parallel to his shoulders.\"",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697",
        "1457"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان المدني، حدثني عباس بن سهل الساعدي، قال اجتمع أبو حميد وأبو أسيد وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم جلس - يعني - للتشهد فافترش رجله اليسرى وأقبل بصدر اليمنى على قبلته ووضع كفه اليمنى على ركبته اليمنى وكفه اليسرى على ركبته اليسرى وأشار بأصبعه يعني السبابة ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وبه يقول بعض أهل العلم وهو قول الشافعي وأحمد وإسحاق قالوا يقعد في التشهد الآخر على وركه واحتجوا بحديث أبي حميد وقالوا يقعد في التشهد الأول على رجله اليسرى وينصب اليمنى ‏.‏",
      "text_en": " Abbas bin SAhl [bin Sa'd] narrated:                     \"Abu Humaid, Abu Usaid, Sahl bin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: \"I am the most knowledgeable among you of the Salat of Allah's Messenger: Indeed Allah's Messenger sat - meaning for Tashah-hud - he spread his left foot, and made the top of his right (foot) face the Qiblah, and he placed his right hand on his right knee, and his left hand on his left knee, and indicated with his finger - meaning the index finge.'\"",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا ابن أبي فديك، عن عبد المهيمن بن عباس بن سهل بن سعد، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الأنصار شعار والناس دثار ولو أن الناس استقبلوا واديا - أو شعبا - واستقبلت الأنصار واديا لسلكت وادي الأنصار ولولا الهجرة لكنت امرأ من الأنصار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdul-Muhaimin bin 'Abbas bin Sahl bin Sa'd from his father, from his grandfather, that:                     The Messenger of Allah said: \"The Ansar are an inner garment and the people are an outer garment. If the people were to head towards one valley or a narrow mountain pass and the Ansar towards another, I would travel to the valley of the Ansar, and were it not for the Hijrah, I would have been a man from among the Ansar.\"",
      "chain": [
        "30285",
        "20172",
        "22139",
        "11697"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا فليح بن سليمان، حدثنا عباس بن سهل الساعدي، قال اجتمع أبو حميد وأبو أسيد الساعدي وسهل بن سعد ومحمد بن مسلمة فذكروا صلاة رسول الله  صلى الله عليه وسلم  فقال أبو حميد أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  إن رسول الله  صلى الله عليه وسلم  قام فكبر ورفع يديه ثم رفع حين كبر للركوع ثم قام فرفع يديه واستوى حتى رجع كل عظم إلى موضعه ‏.‏",
      "text_en": " ‘Abbasbin Sahl As-Sa’di said:                      “Abu Humaid, Abu Usaid As-Sa’di, Sahlbin Sa’d, and Muhammad bin Maslamah came together and spoke abouttheprayer of the Messenger of Allah (ﷺ). Abu Humaid said: ‘I amthemost knowledgeable of you about the prayer of the Messenger ofAllah(ﷺ). The Messenger of Allah (ﷺ) stood up and said AllahuAkbar,and raised his hands, then he raised them when he said AllahuAkbarfor Ruku’, then he stood up and raised his hands, and stoodstraightuntil every bone had returned to its place.’”",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697"
      ]
    }
  ],
  "total_hadiths": 16
}