{
  "id": "11706",
  "name": "'Ubaidullah bin al-Aswad عبيد الله بن الأسود الخولاني",
  "full_name": "'Ubaidullah bin al-Aswad عبيد الله بن الأسود الخولاني",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Khulani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11103",
      "name": "Asim bin 'Umar bin Qatada al-Ansari عاصم بن عمر بن قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "13110",
      "name": "Muhammad bin Talha bin Yazid محمد بن طلحة بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "450",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، أنه سمع عثمان بن عفان، يقول عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم إنكم أكثرتم، وإني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا  قال بكير حسبت أنه قال  يبتغي به وجه الله، بنى الله له مثله في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah Al-Khaulani:                     I heard `Uthman bin `Affan saying, when people argued too much about his intention to reconstruct the mosque of Allah's Apostle, \"You have talked too much. I heard the Prophet saying, 'Whoever built a mosque, (Bukair thought that `Asim, another sub-narrator, added, \"Intending Allah's Pleasure\"), Allah would build for him a similar place in Paradise.' \"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11103",
        "11706",
        "4"
      ]
    },
    {
      "hadith_no": "1217",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، يذكر أنه سمع عثمان بن عفان، عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم ‏.‏ إنكم قد أكثرتم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله تعالى - قال بكير حسبت أنه قال - يبتغي به وجه الله - بنى الله له بيتا في الجنة ‏\"‏ ‏.‏ وقال ابن عيسى في روايته ‏\"‏ مثله في الجنة ‏\"‏ ‏.‏",
      "text_en": " Ubaidullah al-Khaulini reported:                      'Uthman b. 'Affan listened to the opinion of the people (which was not favourable) when he rebuilt the mosque of the Messenger of Allah (may peace be upon him). Thereupon he said: You have not been fair to me for I have heard from the Messenger of Allah (may peace be upon him) saying: He who built a mosque for Allah, the Exalted, Allah would build for him a house in Paradise. Bukair said: I think he (the Holy Prophet) said: While he seeks the pleasure of Allah (by building the mosque). And in the narration of Ibn 'Isa (the words are):\" (a house) like that (mosque) in Paradise.\"",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11154",
        "11103",
        "11706"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثنا محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن طلحة بن يزيد بن ركانة، عن عبيد الله الخولاني، عن ابن عباس، قال دخل على علي - يعني ابن أبي طالب - وقد أهراق الماء فدعا بوضوء فأتيناه بتور فيه ماء حتى وضعناه بين يديه فقال يا ابن عباس ألا أريك كيف كان يتوضأ رسول الله صلى الله عليه وسلم قلت بلى ‏.‏ قال فأصغى الإناء على يده فغسلها ثم أدخل يده اليمنى فأفرغ بها على الأخرى ثم غسل كفيه ثم تمضمض واستنثر ثم أدخل يديه في الإناء جميعا فأخذ بهما حفنة من ماء فضرب بها على وجهه ثم ألقم إبهاميه ما أقبل من أذنيه ثم الثانية ثم الثالثة مثل ذلك ثم أخذ بكفه اليمنى قبضة من ماء فصبها على ناصيته فتركها تستن على وجهه ثم غسل ذراعيه إلى المرفقين ثلاثا ثلاثا ثم مسح رأسه وظهور أذنيه ثم أدخل يديه جميعا فأخذ حفنة من ماء فضرب بها على رجله وفيها النعل ففتلها بها ثم الأخرى مثل ذلك ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال أبو داود وحديث ابن جريج عن شيبة يشبه حديث علي لأنه قال فيه حجاج بن محمد عن ابن جريج ومسح برأسه مرة واحدة ‏.‏ وقال ابن وهب فيه عن ابن جريج ومسح برأسه ثلاثا ‏.‏",
      "text_en": " Ibn’Abbas said:                      ‘Ali b. Abi Talib entered upon me after he has passed water. He then called for water for ablution. We brought to him a vessel containing water, and placed it before him. He said: O Ibn’Abbas, may I not show you how the Messenger of Allah(ﷺ) used to perform ablution? I replied : Why not? He then inclined the vessel to his hand and washed it. He then put his right hand in the vessel and poured water over the other hand and washed his hands up to the wrist. He then rinsed his mouth and snuffed up water. He then put both of his hands together in the water and took out a handful of water and threw it upon the face. He then inserted both of his thumbs in the front part of the ears. He did like that twice and thrice. He then took a handful of water and poured it over his forehead and left it running down his face. He then washed his forearms up to the elbow three times. He then wiped his head and the back of his ears. He then put both of his hands together in the water and took a handful of it and threw it on his foot. He had a shoe foot like that. Do you wash your foot while it is in the shoe? He replied : Yes, while it is in the shoe. This question and answer were repeated thrice. Abu Dawud said: The version transmitted by Ibn Juraij from Shaibah is similar to the one narrated by ‘ Ali. In this version Hajjaj reported on the authority of Ibn Juraij the wording: He wiped his head once. Ibn Wahb narrated from Ibn Juraij the wording: he wiped his head three times.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "13110",
        "11706",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}