{
  "id": "11705",
  "name": "'Abdul Majeed bin Sahl bin 'Abdur Rahman عبد المجيد بن سهل بن عبد الرحمن",
  "full_name": "'Abdul Majeed bin Sahl bin 'Abdur Rahman عبد المجيد بن سهل بن عبد الرحمن",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "B.Zuhrah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2202",
      "hadith_no": "2202",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، عن مالك، عن عبد المجيد بن سهيل بن عبد الرحمن، عن سعيد بن المسيب، عن أبي سعيد الخدري، وعن أبي هريرة  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر، فجاءه بتمر جنيب، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ قال لا والله يا رسول الله، إنا لنأخذ الصاع من هذا بالصاعين، والصاعين بالثلاثة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل، بع الجمع بالدراهم، ثم ابتع بالدراهم جنيبا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     Allah's Apostle appointed somebody as a governor of Khaibar. That governor brought to him an excellent kind of dates (from Khaibar). The Prophet asked, \"Are all the dates of Khaibar like this?\" He replied, \"By Allah, no, O Allah's Apostle! But we barter one Sa of this (type of dates) for two Sas of dates of ours and two Sas of it for three of ours.\" Allah's Apostle said, \"Do not do so (as that is a kind of usury) but sell the mixed dates (of inferior quality) for money, and then buy good dates with that money.\"",
      "usc_msa_ref": "405",
      "chain": [
        "30367",
        "20001",
        "11705",
        "11002",
        "38",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2303",
      "hadith_no": "2303",
      "source": "Sahih Bukhari",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد المجيد بن سهيل بن عبد الرحمن بن عوف، عن سعيد بن المسيب، عن أبي سعيد الخدري، وأبي، هريرة رضى الله عنهما أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر، فجاءهم بتمر جنيب فقال ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ فقال إنا لنأخذ الصاع من هذا بالصاعين، والصاعين بالثلاثة‏.‏ فقال ‏\"‏ لا تفعل، بع الجمع بالدراهم، ثم ابتع بالدراهم جنيبا ‏\"‏‏.‏ وقال في الميزان مثل ذلك‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     Allah's Apostle employed someone as a governor at Khaibar. When the man came to Medina, he brought with him dates called Janib. The Prophet asked him, \"Are all the dates of Khaibar of this kind?\" The man replied, \"(No), we exchange two Sa's of bad dates for one Sa of this kind of dates (i.e. Janib), or exchange three Sa's for two.\" On that, the Prophet said, \"Don't do so, as it is a kind of usury (Riba) but sell the dates of inferior quality for money, and then buy Janib with the money\". The Prophet said the same thing about dates sold by weight. (See Hadith No. 506).",
      "usc_msa_ref": "499",
      "chain": [
        "30355",
        "20001",
        "11705",
        "11002",
        "38",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4290",
      "hadith_no": "4290",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد المجيد بن سهيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، وأبي، هريرة  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر، فجاءه بتمر جنيب، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل تمر خيبر هكذا ‏\"‏‏.‏ فقال لا والله يا رسول الله، إنا لنأخذ الصاع من هذا بالصاعين ‏{‏والصاعين‏}‏ بالثلاثة‏.‏ فقال ‏\"‏ لا تفعل، بع الجمع بالدراهم، ثم ابتع بالدراهم جنيبا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     Allah's Apostle appointed a man as the ruler of Khaibar who later brought some Janib (i.e. dates of good quality) to the Prophet. On that, Allah's Apostle said (to him). \"Are all the dates of Khaibar like this?\" He said, \"No, by Allah, O Allah's Apostle! But we take one Sa of these (dates of good quality) for two or three Sa's of other dates (of inferior quality).\" On that, Allah's Apostle said, \"Do not do so, but first sell the inferior quality dates for money and then with that money, buy Janib.\" Abu Sa`id and Abu Huraira said, \"The Prophet made the brother of Bani Adi from the Ansar as the ruler of Khaibar.",
      "usc_msa_ref": "549",
      "chain": [
        "30103",
        "20001",
        "11705",
        "11002",
        "38",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7437",
      "hadith_no": "7437",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسماعيل، عن أخيه، عن سليمان بن بلال، عن عبد المجيد بن سهيل بن عبد الرحمن بن عوف، أنه سمع سعيد بن المسيب، يحدث أن أبا سعيد الخدري، وأبا، هريرة حدثاه أن رسول الله صلى الله عليه وسلم بعث أخا بني عدي الأنصاري واستعمله على خيبر، فقدم بتمر جنيب فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ قال لا والله يا رسول الله إنا لنشتري الصاع بالصاعين من الجمع‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعلوا، ولكن مثلا بمثل، أو بيعوا هذا واشتروا بثمنه من هذا وكذلك الميزان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     Allah's Apostle sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the man returned, bringing Janib (a good kind of date). Allah's Apostle asked him, \"Are all the dates of Khaibar like that?\" He replied, \"No, by Allah, O Allah's Apostle! We take one Sa' of these (good) dates for two Sas of mixed dates.\" Allah's Apostle then said, \"Do not do so. You should either take one Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind (of dates), and you should do the same in weighing.\"",
      "usc_msa_ref": "449",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11705",
        "11002",
        "38",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4165",
      "hadith_no": "4165",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن عبد المجيد بن سهيل بن عبد الرحمن، أنه سمع سعيد بن المسيب، يحدث أن أبا هريرة، وأبا سعيد حدثاه أن رسول الله صلى الله عليه وسلم بعث أخا بني عدي الأنصاري فاستعمله على خيبر فقدم بتمر جنيب فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏ ‏.‏ قال لا والله يا رسول الله إنا لنشتري الصاع بالصاعين من الجمع ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعلوا ولكن مثلا بمثل أو بيعوا هذا واشتروا بثمنه من هذا وكذلك الميزان ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira and Abu Sa'id al-Khudri (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) deputed a person from Banu 'Adi al-Ansari to collect revenue from Khaibar. He came with a fine quality of dates, whereupon Allah's Messenger (may peace be upon him) said to him:                      Are all the dates of Khaibar like this? He said: Allah's Messenger, it is not so. We buy one sa' of (fine quality of dates) for two sa's out of total output (including even the inferior quality of dates), whereupon Allah's Messenger (may peace be upon him) said: Don't do that, but like for like, or sell this (the inferior quality and receive the price) and then buy with the price of that, and that would make up the measure.",
      "usc_msa_ref": "",
      "chain": [
        "20160",
        "11705",
        "11002",
        "13",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4166",
      "hadith_no": "4166",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد المجيد بن سهيل بن عبد، الرحمن بن عوف عن سعيد بن المسيب، عن أبي سعيد الخدري، وعن أبي هريرة، أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر فجاءه بتمر جنيب فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏ ‏.‏ فقال لا والله يا رسول الله إنا لنأخذ الصاع من هذا بالصاعين والصاعين بالثلاثة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تفعل بع الجمع بالدراهم ثم ابتع بالدراهم جنيبا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) deputed a person to collect revenue from Khaibar. He brought fine quality of dates, whereupon Allah's Messenger (may peace be upon him) said:                      Are all the dates of Khaibar like this)? He said: No. We got one sa' (of fine dates) for two sa's (of inferior dates), and (similarly) two sa's for three sa's. Thereupon Allah's Messenger (may peace be upon him) said: Don't do that rather sell the inferior quality of dates for dirhams (money), and then buy the superior quality with the help of dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11705",
        "11002",
        "38",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4431",
      "hadith_no": "4431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني الحزامي - عن عبد المجيد بن، سهيل عن عطاء بن أبي رباح، عن جابر بن عبد الله، ح.",
      "text_en": " This hadith has been narrated from Allah's Messenger (may peace be upon him) through other chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "11705",
        "11029"
      ]
    },
    {
      "id": "sahih-muslim-7731",
      "hadith_no": "7731",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهارون بن عبد الله، وعبد بن حميد، قال عبد أخبرنا وقال الآخران، حدثنا جعفر بن عون، أخبرنا أبو عميس، عن عبد المجيد بن سهيل، عن عبيد الله بن عبد الله بن عتبة، قال قال لي ابن عباس تعلم - وقال هارون تدري - آخر سورة نزلت من القرآن نزلت جميعا قلت نعم ‏.‏ ‏{‏ إذا جاء نصر الله والفتح‏}‏ قال صدقت ‏.‏ وفي رواية ابن أبي شيبة تعلم أى سورة ‏.‏ ولم يقل آخر ‏.‏",
      "text_en": " Ubaidullah b. 'Abdullah b. 'Utba reported:                      Ibn Abbas said to me: Do you know-and in the words of Harun (another narrator): Are you aware of-the last Sura which was revealed in the Qur'an as a whole? I said: Yes,\" When came the help from Allah and the victory\" (cx.). Thereupon, he said: You have told the truth. And in the narration of Abu Shaiba (the words are): Do you know the Sura? And he did not mention the words\" the last one\".",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30524",
        "30553",
        "20416",
        "11705",
        "11004"
      ]
    },
    {
      "id": "sunan-an-nasai-4553",
      "hadith_no": "4553",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد المجيد بن سهيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، وعن أبي هريرة، أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر فجاء بتمر جنيب فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏ ‏.‏ قال لا والله يا رسول الله إنا لنأخذ الصاع من هذا بصاعين والصاعين بالثلاث ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل بع الجمع بالدراهم ثم ابتع بالدراهم جنيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al'Khudri and Abu Hurairah that:                     the Messenger of Allah appointed a man in charge of kharibar and he brought some Janib dates. The messenger of Allah said; \"Are all the dates if khaibar like this?\" He said: \"No (by Allah, O Messenger of Allah) we take a Sa of these for two for three Sas (of other types of  dates).\" The messenger of Allah said: \"do not do that Sell the mixed dates for Dirhams then buy the Janib dates with the Dirhams\" ,\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11705",
        "11002",
        "38",
        "13"
      ]
    }
  ],
  "total_hadiths": 9
}