{
  "id": "11703",
  "name": "'Abdul Hameed bin Dinar al-Ziyadi عبد الحميد بن دينار صاحب الزيادي",
  "full_name": "'Abdul Hameed bin Dinar al-Ziyadi عبد الحميد بن دينار صاحب الزيادي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11293",
      "name": "'Abdullah bin al-Harith al-Ansari عبد الله بن الحارث الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-668",
      "hadith_no": "668",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد بن زيد، قال حدثنا عبد الحميد، صاحب الزيادي قال سمعت عبد الله بن الحارث، قال خطبنا ابن عباس في يوم ذي ردغ، فأمر المؤذن لما بلغ حى على الصلاة‏.‏ قال قل الصلاة في الرحال، فنظر بعضهم إلى بعض، فكأنهم أنكروا فقال كأنكم أنكرتم هذا إن هذا فعله من هو خير مني  يعني النبي صلى الله عليه وسلم  إنها عزمة، وإني كرهت أن أحرجكم‏.‏ وعن حماد عن عاصم عن عبد الله بن الحارث عن ابن عباس نحوه، غير أنه قال كرهت أن أؤثمكم، فتجيئون تدوسون الطين إلى ركبكم‏.‏",
      "text_en": " Narrated `Abdullah bin Al-Harith:                     Ibn `Abbas addressed us on a (rainy and) muddy day and when the Mu'adh-dhin said, \"Come for the prayer\" Ibn `Abbas ordered him to say, \"Pray in your homes.\" The people began to look at one another with surprise as if they did not like it. Ibn `Abbas said, \"It seems that you thought ill of it but no doubt it was done by one who was better than I (i.e. the Prophet). It (the prayer) is a strict order and I disliked to bring you out.\" Ibn `Abbas narrated the same as above but he said, \"I did not like you to make you sinful (in refraining from coming to the mosque) and to come (to the mosque) covered with mud up to the knees.\"",
      "usc_msa_ref": "637",
      "chain": [
        "30143",
        "20022",
        "11703",
        "912"
      ]
    },
    {
      "id": "sahih-bukhari-901",
      "hadith_no": "901",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال أخبرني عبد الحميد، صاحب الزيادي قال حدثنا عبد الله بن الحارث ابن عم، محمد بن سيرين قال ابن عباس لمؤذنه في يوم مطير إذا قلت أشهد أن محمدا رسول الله‏.‏ فلا تقل حى على الصلاة‏.‏ قل صلوا في بيوتكم‏.‏ فكأن الناس استنكروا، قال فعله من هو خير مني، إن الجمعة عزمة، وإني كرهت أن أخرجكم، فتمشون في الطين والدحض‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     On a rainy day Ibn `Abbas said to his Mu'adh-dhin, \"After saying, 'Ash-hadu anna Muhammadan Rasulullah' (I testify that Muhammad is Allah's Apostle), do not say 'Haiya 'Alas-Salat' (come for the prayer) but say 'Pray in your houses'.\" (The man did so). But the people disliked it. Ibn `Abbas said, \"It was done by one who was much better than I (i.e. the Prophet (p.b.u.h) ). No doubt, the Jumua prayer is compulsory but I dislike to put you to task by bringing you out walking in mud and slush.\"",
      "usc_msa_ref": "24",
      "chain": [
        "30175",
        "20208",
        "11703"
      ]
    },
    {
      "id": "sahih-bukhari-4678",
      "hadith_no": "4678",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال أبو عاصم حدثنا عبد الحميد، حدثنا يزيد، كتب إلى عطاء سمعت جابرا، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11703",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-4695",
      "hadith_no": "4695",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن النضر، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الحميد، صاحب الزيادي سمع أنس بن مالك، قال قال أبو جهل ‏{‏اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم‏}‏ فنزلت ‏{‏وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You), then rain down on us a shower of stones from the sky or bring on us a painful punishment.\" So there was revealed:-- 'But Allah would not punish them while you (Muhammad) were amongst them, nor will He punish them while they seek (Allah's) Forgiveness. And why Allah should not punish them while they stop (men) from Al-Masjid-al-Haram ..' (8.33-34)",
      "usc_msa_ref": "172",
      "chain": [
        "30386",
        "30150",
        "20286",
        "20020",
        "11703",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7236",
      "hadith_no": "7236",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "وقال محمد بن بشار حدثنا عبد الله بن حمران، حدثنا عبد الحميد، عن سعيد المقبري، عن عمر بن الحكم، عن أبي هريرة، قوله‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20554",
        "11703",
        "11168",
        "11897"
      ]
    },
    {
      "id": "sahih-muslim-1637",
      "hadith_no": "1637",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا إسماعيل، عن عبد الحميد، صاحب الزيادي عن عبد الله بن الحارث، عن عبد الله بن عباس، أنه قال لمؤذنه في يوم مطير إذا قلت أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله فلا تقل حى على الصلاة قل صلوا في بيوتكم - قال - فكأن الناس استنكروا ذاك فقال أتعجبون من ذا قد فعل ذا من هو خير مني إن الجمعة عزمة وإني كرهت أن أحرجكم فتمشوا في الطين والدحض ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that he said to the Mu'adhdhin on a rainy day:                      When you have announced\" I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah,\" do not say:\" Come to the prayer,\" but make this announcement:\" Say prayer in your houses.\" He (the narrator) said that the people disapproved of it. Ibn 'Abbas said: Are you astonished at it? He (the Holy Prophet), who is better than I, did it. Jumu'a prayer is no doubt obligatory, but I do not like that I should (force you) to come out and walk in mud and slippery ground.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11703",
        "912",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1638",
      "hadith_no": "1638",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنيه أبو كامل الجحدري، حدثنا حماد، - يعني ابن زيد - عن عبد الحميد، قال سمعت عبد الله بن الحارث، قال خطبنا عبد الله بن عباس في يوم ذي ردغ ‏.‏ وساق الحديث بمعنى حديث ابن علية ولم يذكر الجمعة وقال قد فعله من هو خير مني ‏.‏ يعني النبي صلى الله عليه وسلم",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "11703",
        "912"
      ]
    },
    {
      "id": "sahih-muslim-1638-2",
      "hadith_no": "1638",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنيه أبو كامل الجحدري، حدثنا حماد، - يعني ابن زيد - عن عبد الحميد، قال سمعت عبد الله بن الحارث، قال خطبنا عبد الله بن عباس في يوم ذي ردغ ‏.‏ وساق الحديث بمعنى حديث ابن علية ولم يذكر الجمعة وقال قد فعله من هو خير مني ‏.‏ يعني النبي صلى الله عليه وسلم  وقال أبو كامل حدثنا حماد، عن عاصم، عن عبد الله بن الحارث، بنحوه ‏.‏",
      "text_en": " 'Abd al-Hamid reported:                      I heard 'Abdullah b. al-Harith say: 'Abdullah b. 'Abbas addressed us on a rainy day, and the rest of the hadith is the same, but he made no mention of Jumu'a prayer, and added: He who did it (who commanded us to say prayer in our houses), i. e. the Apostle of Allah (may peace be upon him), is better than I.",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "11703",
        "912"
      ]
    },
    {
      "id": "sahih-muslim-1641",
      "hadith_no": "1641",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا ابن شميل، أخبرنا شعبة، حدثنا عبد الحميد، صاحب الزيادي قال سمعت عبد الله بن الحارث، قال أذن مؤذن ابن عباس يوم جمعة في يوم مطير ‏.‏ فذكر نحو حديث ابن علية وقال وكرهت أن تمشوا في الدحض والزلل ‏.‏",
      "text_en": " 'Abdullah b. Harith reported that Ibn 'Abbas commanded the Mu'adhdhin to (summon the people to prayer on Friday and make announcement to say prayer in their houses) when it was rainy, and the rest of the hadith is the same (except this) that he said:                      I do not like you should walk in muddy slippery place.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20020",
        "11703",
        "912"
      ]
    },
    {
      "id": "sunan-abi-daud-1066",
      "hadith_no": "1066",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، أخبرني عبد الحميد، صاحب الزيادي حدثنا عبد الله بن الحارث ابن عم، محمد بن سيرين أن ابن عباس، قال لمؤذنه في يوم مطير إذا قلت أشهد أن محمدا رسول الله ‏.‏ فلا تقل حى على الصلاة ‏.‏ قل صلوا في بيوتكم ‏.‏ فكأن الناس استنكروا ذلك فقال قد فعل ذا من هو خير مني إن الجمعة عزمة وإني كرهت أن أحرجكم فتمشون في الطين والمطر ‏.‏",
      "text_en": " Ibn Sirin said:                      Ibn ‘Abbas said to his mu’adhdhin on a rainy day: “when you utter the words ‘ I testify that Muhammad is the Messenger of Allah,” do not say,” Come to prayer” but say “Pray at your homes,” By this (announcement) the people were surprised. He said: One who was better than me has done it. The Friday prayer is an obligatory duty. But I disliked to put you to hardship so that you might walk in mud and rain.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20208",
        "11703",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-859",
      "hadith_no": "859",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا قبيصة، عن سفيان، عن ابن جريج، عن عبد الحميد، عن ابن يعلى، عن أبيه، أن النبي صلى الله عليه وسلم طاف بالبيت مضطبعا وعليه برد ‏.‏ قال أبو عيسى هذا حديث الثوري عن ابن جريج ولا نعرفه إلا من حديثه وهو حديث حسن صحيح ‏.‏ وعبد الحميد هو ابن جبير بن شيبة ‏.‏ عن ابن يعلى عن أبيه وهو يعلى بن أمية ‏.‏",
      "text_en": " Ibn Ya'la narrated from his father:                     \"The Prophet performed Tawaf of the House Mudtabi'an, and he was wearing a Burd.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20351",
        "20012",
        "11070",
        "11703"
      ]
    },
    {
      "id": "sunan-an-nasai-291",
      "hadith_no": "291",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن شعبة، عن الحكم، عن عبد الحميد، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الرجل يأتي امرأته وهي حائض يتصدق بدينار أو بنصف دينار ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas from the Prophet (ﷺ) concerning a man who has had intercourse while she was menstruating:                      \"Let him give a Dinar or half a Dinar in charity.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11069",
        "11703",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-370",
      "hadith_no": "370",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن شعبة، قال حدثني الحكم، عن عبد الحميد، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الرجل يأتي امرأته وهي حائض يتصدق بدينار أو بنصف دينار ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas from the Prophet (ﷺ) concerning a man who has had intercourse with his wife while she was menstruating:                      \"Let him give a Dinar or half a Dinar in charity.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11069",
        "11703",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2162",
      "hadith_no": "2162",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، قال حدثنا شعبة، عن عبد الحميد، صاحب الزيادي قال سمعت عبد الله بن الحارث، يحدث عن رجل، من أصحاب النبي صلى الله عليه وسلم قال دخلت على النبي صلى الله عليه وسلم وهو يتسحر فقال ‏\"‏ إنها بركة أعطاكم الله إياها فلا تدعوه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Al-Harith narrated that a man from among the Companions of th Prophet said:                     \"I entered upon the Prophet when he was having Sahur. He sadi: 'It is a blessing that Allah has given to you, so do not neglect it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20020",
        "11703",
        "912"
      ]
    },
    {
      "id": "sunan-ibn-majah-683",
      "hadith_no": "683",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وابن أبي عدي، عن شعبة، عن الحكم، عن عبد الحميد، عن مقسم، عن ابن عباس، عن النبي  صلى الله عليه وسلم  في الذي يأتي امرأته وهي حائض قال ‏\"‏ يتصدق بدينار أو بنصف دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Prophet said concerning one who has intercourse with a woman when she is menstruating: \"Let him give a Dinar or half a Dinar in charity.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20276",
        "20020",
        "11069",
        "11703",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3067",
      "hadith_no": "3067",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، وقبيصة، قالا حدثنا سفيان، عن ابن جريج، عن عبد الحميد، عن ابن يعلى بن أمية، عن أبيه، يعلى أن النبي  صلى الله عليه وسلم  طاف مضطبعا ‏.‏ قال قبيصة وعليه برد ‏.‏",
      "text_en": " It wasnarrated from Ibn Ya’la bin Umayyah that his father Ya’lasaid:                     “The Prophet (ﷺ) performed Tawaf while doing Idtiba’.”* (Inhis narration, one of the narrators) Qabisah said: “While wearing aYemenite cloth.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30388",
        "20351",
        "20012",
        "11070",
        "11703"
      ]
    }
  ],
  "total_hadiths": 16
}