{
  "id": "11710",
  "name": "'Ali bin Yahya bin Khlad علي بن يحيى بن خلاد بن رافع",
  "full_name": "'Ali bin Yahya bin Khlad علي بن يحيى بن خلاد بن رافع",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Zurayq",
      "Ansar",
      "al-Ra'"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Ray",
        "ar": "al-Ray",
        "ckb": "al-Ray"
      }
    ],
    "tags_display": [
      {
        "en": "B.Zurayq",
        "ar": "B.Zurayq",
        "ckb": "B.Zurayq"
      },
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "al-Ra'",
        "ar": "al-Ra'",
        "ckb": "al-Ra'"
      }
    ]
  },
  "parents": [
    {
      "id": "325",
      "name": "Yahya bin Khallad bin Rafi' bin Malik ( يحيى بن خلاد بن رافع بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12582",
      "name": "Yahya bin 'Ali bin Yahya يحيى بن علي بن يحيى بن خلاد",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    }
  ],
  "teachers": [
    {
      "id": "325",
      "name": "Yahya bin Khallad bin Rafi' bin Malik ( يحيى بن خلاد بن رافع بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "323",
      "name": "Rifa'a bin Rafi' bin Malik bin al-'Ajlan ( رفاعة بن رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-799",
      "hadith_no": "799",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى بن خلاد الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء النبي صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ قال رجل وراءه ربنا ولك الحمد، حمدا كثيرا طيبا مباركا فيه، فلما انصرف قال ‏\"‏ من المتكلم ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ رأيت بضعة وثلاثين ملكا يبتدرونها، أيهم يكتبها أول ‏\"‏‏.‏",
      "text_en": " Narrated Rifa`a bin Rafi` Az-Zuraqi:                     One day we were praying behind the Prophet. When he raised his head from bowing, he said, \"Sami`a l-lahu liman hamidah.\" A man behind him said, \"Rabbana wa laka l-hamdu, hamdan kathiran taiyiban mubarakan fihi\" (O our Lord! All the praises are for You, many good and blessed praises). When the Prophet completed the prayer, he asked, \"Who has said these words?\" The man replied, \"I.\" The Prophet said, \"I saw over thirty angels competing to write it first.\" Prophet rose (from bowing) and stood straight till all the vertebrae of his spinal column came to a natural position.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-770",
      "hadith_no": "770",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رسول الله صلى الله عليه وسلم رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراء رسول الله صلى الله عليه وسلم اللهم ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم بها آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أول ‏\"‏ ‏.‏",
      "text_en": " Rifa’ah b. Rafi’ said:                      One day we were praying behind the Messenger of Allah (ﷺ). When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah listened to him who praised Him. A man behind the Messenger of Allah(ﷺ) said: O Allah, Our Lord, and to Thee be praise, much praise, good and blessed. When the Messenger of Allah (ﷺ) finished his prayer, he asked: Which of you if the one who spoke (the words) just now. The man said: I (uttered) these words, Prophet of Allah. The Messenger of Allah(ﷺ) said: I saw more than thirty angels racing against one another to be the one to write them first.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-857",
      "hadith_no": "857",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن إسحاق بن عبد الله بن أبي طلحة، عن علي بن يحيى بن خلاد، عن عمه، أن رجلا، دخل المسجد فذكر نحوه قال فيه فقال النبي صلى الله عليه وسلم ‏\"‏ إنه لا تتم صلاة لأحد من الناس حتى يتوضأ فيضع الوضوء ‏\"‏ ‏.‏ يعني مواضعه ‏\"‏ ثم يكبر ويحمد الله جل وعز ويثني عليه ويقرأ بما تيسر من القرآن ثم يقول الله أكبر ثم يركع حتى تطمئن مفاصله ثم يقول سمع الله لمن حمده حتى يستوي قائما ثم يقول الله أكبر ثم يسجد حتى تطمئن مفاصله ثم يقول الله أكبر ويرفع رأسه حتى يستوي قاعدا ثم يقول الله أكبر ثم يسجد حتى تطمئن مفاصله ثم يرفع رأسه فيكبر فإذا فعل ذلك فقد تمت صلاته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     A man entered the mosque...... He then narrated the tradition like the one narrated in (No.855). This version is as follows: The Prophet (ﷺ) said: The prayer of anyone is not perfect unless he performs ablution perfectly; he should then utter the takbir, and praise Allah, the Exalted, and admire Him; he should then recite the Qur'an as much as he desires. He should then say: \"Allah is Most Great\". Next he should bow so that all his joints return to their proper places. Then he should say: \"Allah listens to the one who praises Him\", and stand erect. He should then say:\"Allah is most great,\" and should prostrate himself so that all his joints are completely at rest. Then he should say: \"Allah is most great\"; he should raise his head (at the end of prostration) till he sits erect. Then he should say: \"Allah is most great\"; then he should prostrate himself till all his joints return to their proper places. Then he should raise his head and say the takbir. When he does so, then his prayer is completed.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11151",
        "11710"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-858",
      "hadith_no": "858",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا هشام بن عبد الملك، والحجاج بن منهال، قالا حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن علي بن يحيى بن خلاد، عن أبيه، عن عمه، رفاعة بن رافع بمعناه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها لا تتم صلاة أحدكم حتى يسبغ الوضوء كما أمره الله عز وجل فيغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ثم يكبر الله عز وجل ويحمده ثم يقرأ من القرآن ما أذن له فيه وتيسر ‏\"‏ ‏.‏ فذكر نحو حديث حماد قال ‏\"‏ ثم يكبر فيسجد فيمكن وجهه ‏\"‏ ‏.‏ قال همام وربما قال ‏\"‏ جبهته من الأرض حتى تطمئن مفاصله وتسترخي ثم يكبر فيستوي قاعدا على مقعده ويقيم صلبه ‏\"‏ ‏.‏ فوصف الصلاة هكذا أربع ركعات حتى فرغ ‏\"‏ لا تتم صلاة أحدكم حتى يفعل ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     This version (of Hadith No 856) adds: The Messenger of Allah (ﷺ) said: The prayer of any of you is not complete until he performs ablution perfectly, as Allah, the Exalted, has ordered you. He should wash his face and hands up to the elbows, and wipe his head and (wash) his feet up to the ankles. Then he should exalt Allah and praise Him. Then he should recite the Qur'an as much as it is convenient for him. (Narrator then narrated the tradition like Hammad's, No. 856). He said: He then utter the takbir and prostration himself so that his face is at rest. Hammam (sub-narrator) said: Sometimes he reported: So that his forehead is at rest on the ground, and his joints return to their places and are loosened. Then he should say the takbir and then sit right on his hips and erect his back. He described the nature of prayer in this way by offering four rak'ahs until he finished it. The prayer of any of you is not complete unless he does so.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20219",
        "20297",
        "11151",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-859",
      "hadith_no": "859",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن علي بن يحيى بن خلاد، عن أبيه، عن رفاعة بن رافع، بهذه القصة قال ‏\"‏ إذا قمت فتوجهت إلى القبلة فكبر ثم اقرأ بأم القرآن وبما شاء الله أن تقرأ وإذا ركعت فضع راحتيك على ركبتيك وامدد ظهرك ‏\"‏ ‏.‏ وقال ‏\"‏ إذا سجدت فمكن لسجودك فإذا رفعت فاقعد على فخذك اليسرى ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Rifa’ah b. Rafi. This version goes:                      When you get up and face the qiblah, what Allah wishes you to recite. And when you bow, put your palms on your knees and stretch out your back. When you prostrate yourself, do it completely( so that you are at the rest). When you raise yourself then sit on your left thigh.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "11220",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-1053",
      "hadith_no": "1053",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر بن مضر، عن ابن عجلان، عن علي بن يحيى الزرقي، عن أبيه، عن عمه، رفاعة بن رافع وكان بدريا قال كنا مع رسول الله صلى الله عليه وسلم إذ دخل رجل المسجد فصلى ورسول الله صلى الله عليه وسلم يرمقه ولا يشعر ثم انصرف فأتى رسول الله صلى الله عليه وسلم فسلم عليه فرد عليه السلام ثم قال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ قال لا أدري في الثانية أو في الثالثة قال والذي أنزل عليك الكتاب لقد جهدت فعلمني وأرني ‏.‏ قال ‏\"‏ إذا أردت الصلاة فتوضأ فأحسن الوضوء ثم قم فاستقبل القبلة ثم كبر ثم اقرأ ثم اركع حتى تطمئن راكعا ثم ارفع حتى تعتدل قائما ثم اسجد حتى تطمئن ساجدا ثم ارفع رأسك حتى تطمئن قاعدا ثم اسجد حتى تطمئن ساجدا فإذا صنعت ذلك فقد قضيت صلاتك وما انتقصت من ذلك فإنما تنقصه من صلاتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi'- who had been present at Badr- said:                     \"We were with the Messenger of Allah (ﷺ) when a man entered the Masjid and prayed. The Messenger of Allah (ﷺ) watched him without him realizing, then he finished, came to the Messenger of Allah (ﷺ) and greeted him with salam. He returned the salam and said: \"Go back and pray, for you have not prayed.'\" He (the narrator) said: \"I do not know if it was the second or third time,- \"(the man) said: 'By the One Who revealed the Book to you, I have tried my best. Teach me and show me.' He said: 'When you want to pray, perform wudu' and do it well, then stand up and face the qiblah. Then say the takbir, then recite, then bow until you are at ease in bowing. Then stand up until you are standing up straight. Then prostrate until you are at ease in prostration, then raise your head until you are at ease in sitting, then prostrate until you are at ease in prostration. If you do that then you will have done your prayer properly, and whatever you failed to do properly is going to detract from your prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "10616",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1062",
      "hadith_no": "1062",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نعيم بن عبد الله، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراءه ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه ‏.‏ فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أولا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi said:                     \"We were praying behind the Messenger of Allah (ﷺ) one day and when he raised his head from bowing he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' A man behind him said: 'Rabbana wa lakal-hamd, hamdan kathiran tayyiban mubarakan fih. (O our Lord, and to You be praise, much blessed and pure praise.)' When the Messenger of Allah (ﷺ) had finished, he said: \"Who is the one who spoke just now?\" The man said: 'I did, O Messenger of Allah.' The Messenger of Allah (ﷺ) said: 'I saw thirty-some angels rushing to see which of them would write it down first.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-496",
      "hadith_no": "496",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا حجاج، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثني علي بن يحيى بن خلاد، عن أبيه، عن عمه، رفاعة بن رافع أنه كان جالسا عند النبي  صلى الله عليه وسلم  فقال ‏\"‏ إنها لا تتم صلاة لأحد حتى يسبغ الوضوء كما أمره الله تعالى يغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ‏\"‏ ‏.‏",
      "text_en": " 'Ali bin Yahya bin Khallad narrated, from his father, from his paternal uncle Rifa'ah bin Rafi' that:                     He was sitting with the Prophet who said: 'No person's prayer is complete until he performs ablution properly as Allah has commanded him, washing his face, his arms up to the elbows, wiping his head and his feet up to the ankles.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20219",
        "20297",
        "11151",
        "11710",
        "325",
        "323"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 8,
  "grade_display": {
    "en": "Follower (Tabi') [4th Generation]",
    "ar": "تابعي [الجيل الرابع]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
  }
}