{
  "id": "11717",
  "name": "'Auf bin al-Harith bin al-Tufayl عوف بن الحارث بن الطفيل بن سخبرة",
  "full_name": "'Auf bin al-Harith bin al-Tufayl عوف بن الحارث بن الطفيل بن سخبرة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ خ  د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Azdi"
    ]
  },
  "parents": [
    {
      "id": "205",
      "name": "Tufail ibn 'Abdullah ( الطفيل بن عبد الله بن الحارث بن سخبرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "19478",
      "name": "Ramaytha bint al-Harith bin al-Tufayl رميثة بنت الحارث بن الطفيل",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11178",
      "name": "'Amir bin 'Abdullah عامر بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12497",
      "name": "Muhsin bin 'Ali al-Fihri al-Madni محصن بن علي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28303",
      "name": "'Abdullah bin Muhammad bin Abi Yahya عبد الله بن محمد بن أبي يحيى - سحبل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "564",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، - يعني ابن محمد - عن محمد، - يعني ابن طحلاء - عن محصن بن علي، عن عوف بن الحارث، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن وضوءه ثم راح فوجد الناس قد صلوا أعطاه الله جل وعز مثل أجر من صلاها وحضرها لا ينقص ذلك من أجرهم شيئا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: whoever performs ablution, and  performs his ablution perfectly, and then goes to the mosque and finds that the people had finished the prayer (in congregation), Allah will give him a reward like one who prayed in congregation and attended it; The reward of those who prayed in congregation will not be curtailed.",
      "chain": [
        "20164",
        "20167",
        "22184",
        "11717",
        "13"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عبد العزيز بن محمد، عن ابن طحلاء، عن محصن بن علي الفهري، عن عوف بن الحارث، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من توضأ فأحسن الوضوء ثم خرج عامدا إلى المسجد فوجد الناس قد صلوا كتب الله له مثل أجر من حضرها ولا ينقص ذلك من أجورهم شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Whoever performs wudu' and does it well, then sets out for the Masjid and finds that the people have already prayed, Allah will decree for him a reward like that of those who attended (the prayer), without reducing the slightest from their reward.\"",
      "chain": [
        "30123",
        "20167",
        "12497",
        "11717",
        "13"
      ]
    },
    {
      "hadith_no": "3950",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرني محمد بن آدم، عن عبدة، عن هشام، عن عوف بن الحارث، عن رميثة، عن أم سلمة، أن نساء النبي، صلى الله عليه وسلم كلمنها أن تكلم النبي صلى الله عليه وسلم أن الناس كانوا يتحرون بهداياهم يوم عائشة وتقول له إنا نحب الخير كما تحب عائشة فكلمته فلم يجبها فلما دار عليها كلمته أيضا فلم يجبها وقلن ما رد عليك قالت لم يجبني ‏.‏ قلن لا تدعيه حتى يرد عليك أو تنظرين ما يقول ‏.‏ فلما دار عليها كلمته فقال ‏\"‏ لا تؤذيني في عائشة فإنه لم ينزل على الوحى وأنا في لحاف امرأة منكن إلا في لحاف عائشة ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذان الحديثان صحيحان عن عبدة ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the wives of the Prophet asked her to speak to the Prophet and tell him, that the people were trying to bring their gifts to him when it was 'Aishah's day, and to say to him:                      \"We love good things as much as 'Aishah does.\" So she spoke to him, but he did not reply her. When her turn came again, she spoke to him again, but he did not reply her. They said to her: \"How did he respond?\" She said: \"He did not answer me.\" They said: \"Do not leave him alone until he answers you or you comprehend what he says.\" When her turn came again, she spoke to him and he said: 'Do not bother me about 'Aishah, for the Revelation has never come to me under the blanket of any of you apart from the blanket of 'Aishah.'\"",
      "chain": [
        "20337",
        "11065",
        "11717",
        "56"
      ]
    }
  ],
  "total_hadiths": 3
}