{
  "id": "11716",
  "name": "'Unbasa bin Sa'id bin al-Aas عنبسة بن سعيد بن العاص بن سعيد",
  "full_name": "'Unbasa bin Sa'id bin al-Aas عنبسة بن سعيد بن العاص بن سعيد",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "989",
      "name": "Sa'id bin al-'As bin Sa'id bin al-'As ( سعيد بن العاص بن سعيد بن العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10602",
      "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10979",
      "name": "Yahya bin Sa'id bin al-Aas يحيى بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1046",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثني الليث، عن عقيل، عن ابن شهاب، ح وحدثني أحمد بن صالح، قال حدثنا عنبسة، قال حدثنا يونس، عن ابن شهاب، حدثني عروة، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة النبي صلى الله عليه وسلم فخرج إلى المسجد فصف الناس وراءه، فكبر فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة، ثم كبر فركع ركوعا طويلا، ثم قال سمع الله لمن حمده‏.‏ فقام ولم يسجد، وقرأ قراءة طويلة، هي أدنى من القراءة الأولى، ثم كبر وركع ركوعا طويلا، وهو أدنى من الركوع الأول، ثم قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم سجد، ثم قال في الركعة الآخرة مثل ذلك، فاستكمل أربع ركعات في أربع سجدات، وانجلت الشمس قبل أن ينصرف، ثم قام فأثنى على الله بما هو أهله ثم قال ‏\"‏ هما آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتموهما فافزعوا إلى الصلاة ‏\"‏‏.‏ وكان يحدث كثير بن عباس أن عبد الله بن عباس  رضى الله عنهما  كان يحدث يوم خسفت الشمس بمثل حديث عروة عن عائشة‏.‏ فقلت لعروة إن أخاك يوم خسفت بالمدينة لم يزد على ركعتين مثل الصبح‏.‏ قال أجل لأنه أخطأ السنة‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet (p.b.u.h) In the lifetime of the Prophet the sun eclipsed and he went to the Mosque and the people aligned behind him. He said the Takbir (starting the prayer) and prolonged the recitation (from the Qur'an) and then said Takbir and performed a prolonged bowing; then he (lifted his head and) said, \"Sami allahu liman hamidah\" (Allah heard him who sent his praises to Him). He then did not prostrate but stood up and recited a prolonged recitation which was shorter than the first recitation. He again said Takbir and then bowed a prolonged bowing but shorter than the first one and then said, \"Sami`a l-lahu Lyman hamidah Rabbana walak-lhamd, (Allah heard him who sent his praises to Him. O our Sustainer! All the praises are for You)\" and then prostrated and did the same in the second rak`a; thus he completed four bowing and four prostrations. The sun (eclipse) had cleared before he finished the prayer. (After the prayer) he stood up, glorified and praised Allah as He deserved and then said, \"The sun and the moon are two of the signs of Allah. They do not eclipse because of the death or the life (i.e. birth) of someone. When you see them make haste for the prayer.\" Narrated Az-Zuhri: I said to 'Ursa, \"When the sun eclipsed at Medina your brother (`Abdullah bin Az- Zubair) offered only a two-rak`at prayer like that of the morning (Fajr) prayer.\" 'Ursa replied, \"Yes, for he missed the Prophet's tradition (concerning this matter).\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال عبدان أخبرنا عبد الله، أخبرنا يونس، عن الزهري، ح حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال أنس كان أبو ذر  رضى الله عنه  يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج سقف بيتي وأنا بمكة، فنزل جبريل، ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا فأفرغها في صدري، ثم أطبقه ثم أخذ بيدي، فعرج بي إلى السماء، فلما جاء إلى السماء الدنيا، قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال معك أحد قال معي محمد‏.‏ قال أرسل إليه قال نعم، فافتح‏.‏ فلما علونا السماء إذا رجل عن يمينه أسودة، وعن يساره أسودة، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا يا جبريل قال هذا آدم، وهذه الأسودة عن يمينه، وعن شماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر قبل يمينه ضحك، وإذا نظر قبل شماله بكى، ثم عرج بي جبريل، حتى أتى السماء الثانية، فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول، ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات إدريس وموسى وعيسى وإبراهيم، ولم يثبت لي كيف منازلهم، غير أنه قد ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السادسة‏.‏ وقال أنس فلما مر جبريل بإدريس‏.‏ قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس، ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى، فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال عيسى‏.‏ ثم مررت بإبراهيم، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم‏.‏ قال وأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على خمسين صلاة، فرجعت بذلك حتى أمر بموسى، فقال موسى ما الذي فرض على أمتك قلت فرض عليهم خمسين صلاة‏.‏ قال فراجع ربك، فإن أمتك لا تطيق ذلك‏.‏ فرجعت فراجعت ربي فوضع شطرها، فرجعت إلى موسى، فقال راجع ربك، فذكر مثله، فوضع شطرها، فرجعت إلى موسى، فأخبرته فقال راجع ربك، فإن أمتك لا تطيق ذلك، فرجعت فراجعت ربي فقال هي خمس، وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى، فقال راجع ربك‏.‏ فقلت قد استحييت من ربي، ثم انطلق، حتى أتى السدرة المنتهى، فغشيها ألوان لا أدري ما هي، ثم أدخلت ‏{‏الجنة‏}‏ فإذا فيها جنابذ اللؤلؤ وإذا ترابها المسك ‏\"‏‏.‏",
      "text_en": " Narrated Anas (ra):                      Abu Dhar (ra) used to say that Allah's  Messenger () said, \"While I was at Makkah, the roof of my house was opened and Jibril descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith, and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the heaven. When Jibril reached the nearest heaven, he said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'who is it?' Jibril answered, 'Jibril'. He asked, 'Is there anyone with you?' Jibril replied, 'Muhammad () is with me.' He asked, 'Has he been called?', Jibril said, 'Yes'. So, the gate was opened and we went over the nearest heaven, and there we saw a man sitting with Aswida (a large number of people) of his right and Aswida on his left. When he looked towards his right, he laughed and when he looked towards his left he wept. He said (to me), 'Welcome, O pious Prophet and pious son'. I said, 'Who is this man O Jibril?' Jibril replied, 'He is Adam, and the people on his right and left are the souls of his offspring. Those on the right are the people of Paradise, and those on the left are the people of the (Hell) Fire. So, when he looks to the right, he laughs, and when he looks to the left he weeps.' Then Jibril ascended with me till he reached the second heaven and said to the gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven has said, and he opened the gate.\"Anas added: Abu Dhar mentioned that Prophet () met Idris, Musa (Moses), 'Isa (Jesus) and Ibrahim (Abraham) over the heavens, but he did not specify their places (i.e., on which heavens each of them was), but he mentioned that he (the Prophet ()) had met Adam on the nearest heaven, and Ibrahim on the sixth. Anas said, \"When Jibril and the Prophet () passed by Idris, the latter said, 'Welcome, O pious Prophet and pious brother!' the Prophet () asked, 'Who is he?' Jibril said, 'He is Idris.' \" The Prophet () added, \"Then I passed by Musa who said, 'Welcome, O pious Prophet  and pious brother!' I said, 'Who is he?' Jibril said, 'He is Musa.' Then I passed by 'Isa who said, 'Welcome, O pious Prophet and pious brother!' I said, 'Who is he?' He replied, 'He is 'Isa.' Then I passed by the Prophet Ibrahim who said, 'Welcome, O pious Prophet and pious son!' I said, 'Who is he?' Jibril replied, 'He is Ibrahim'.\"Narrated Ibn 'Abbas and Abu Haiyya Al-Ansari: The Prophet () said, \"Then Jibril ascended with me to a place where I heard the creaking of pens.\" Ibn Hazm and Anas bin Malik state the Prophet () said, \"Allah enjoined fifty Salat (prayers) on me. When I returned with this order of Allah, I passed by Musa who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty Salat (prayers) on them.' On the Musa said to me, 'Go back to your Lord (and appeal for reduction), for your followers will not be able to bear it.' So, I returned to my Lord and asked for some reduction, and He reduced it to half. When I passed by Musa again and informed him about it, he once more said to me, 'Go back to your Lord, for your followers will not be able to bear it.' So, I returned to my Lord similarly as before, and half of it was reduced. I again passed by Musa and he said to me, 'Go back to your Lord, for your followers will not be able to bear it.' I again returned to my Lord and He said, 'These are five (Salat-prayers) and they are all (equal to) fifty (in reward), for My Word does not change.' I returned to Musa, he again told me to return to my Lord (for further reduction) but I said to him 'I feel shy of asking my Lord now.' Then Jibril took me till we reached Sidrat-ul-Muntaha (i.e., lote tree of utmost boundary) which was shrouded in colors indescribable. Then I was admitted into Paradise where I found small tents (made) of pearls and its earth was musk (a kind of perfume).\"",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "hadith_no": "3937",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب  وكان قائد كعب حين عمي  قال سمعت كعب بن مالك يحدث حين تخلف عن النبي صلى الله عليه وسلم في غزوة تبوك‏.‏ بطوله، قال ابن بكير في حديثه ولقد شهدت مع النبي صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام، وما أحب أن لي بها مشهد بدر وإن كانت بدر، أذكر في الناس منها‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     Who was Ka`b's guide when Ka`b turned blind: I heard Ka`b bin Malik narrating: When he remained behind (i.e. did not Join) the Prophet in the Ghazwa of Tabuk. Ibn Bukair, in his narration stated that Ka`b said, \" I witnessed the Al-`Aqaba pledge of allegiance at night with the Prophet when we jointly agreed to support Islam with all our efforts I would not like to have attended the Badr battle instead of that 'Aqaba pledge although Badr is more well-known than it, amongst the people.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4053",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن الزهري، أخبرنا علي بن حسين، أن حسين بن علي  عليهم السلام  أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني مما أفاء الله عليه من الخمس يومئذ، فلما أردت أن أبتني بفاطمة  عليها السلام  بنت النبي صلى الله عليه وسلم واعدت رجلا صواغا في بني قينقاع أن يرتحل معي فنأتي بإذخر، فأردت أن أبيعه من الصواغين فنستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، حتى جمعت ما جمعت فإذا أنا بشارفى قد أجبت أسنمتها، وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت المنظر، قلت من فعل هذا قالوا فعله حمزة بن عبد المطلب، وهو في هذا البيت، في شرب من الأنصار، عنده قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء، فوثب حمزة إلى السيف، فأجب أسنمتهما، وبقر خواصرهما، وأخذ من أكبادهما قال علي فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، وعرف النبي صلى الله عليه وسلم الذي لقيت فقال ‏\"‏ ما لك ‏\"‏‏.‏ قلت يا رسول الله، ما رأيت كاليوم، عدا حمزة على ناقتى، فأجب أسنمتهما، وبقر خواصرهما وها هو ذا في بيت معه شرب، فدعا النبي صلى الله عليه وسلم بردائه، فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن عليه فأذن له، فطفق النبي صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة ثمل محمرة عيناه، فنظر حمزة إلى النبي صلى الله عليه وسلم ثم صعد النظر، فنظر إلى ركبته، ثم صعد النظر، فنظر إلى وجهه، ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف النبي صلى الله عليه وسلم أنه ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى، فخرج وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I had a she-camel which I got in my share from the booty of the battle of Badr, and the Prophet had given me another she camel from the Khumus which Allah had bestowed on him that day. And when I intended to celebrate my marriage to Fatima, the daughter of the Prophet, I made an arrangement with a goldsmith from Bani Qainuqa 'that he should go with me to bring Idhkhir (i.e. a kind of grass used by gold-smiths) which I intended to sell to gold-smiths in order to spend its price on the marriage banquet. While I was collecting ropes and sacks of pack saddles for my two she-camels which were kneeling down beside an Ansari's dwelling and after collecting what I needed, I suddenly found that the humps of the two she-camels had been cut off and their flanks had been cut open and portions of their livers had been taken out. On seeing that, I could not help weeping. I asked, \"Who has done that?\" They (i.e. the people) said, \"Hamza bin `Abdul Muttalib has done it. He is present in this house with some Ansari drinkers, a girl singer, and his friends. The singer said in her song, \"O Hamza, get at the fat she-camels!\" On hearing this, Hamza rushed to his sword and cut of the camels' humps and cut their flanks open and took out portions from their livers.\" Then I came to the Prophet, with whom Zaid bin Haritha was present. The Prophet noticed my state and asked, \"What is the matter?\" I said, \"O Allah's Apostle, I have never experienced such a day as today! Hamza attacked my two she-camels, cut off their humps and cut their flanks open, and he is still present in a house along some drinkers.\" The Prophet asked for his cloak, put it on, and proceeded, followed by Zaid bin Haritha and myself, till he reached the house where Hamza was. He asked the permission to enter, and he was permitted. The Prophet started blaming Hamza for what he had done. Hamza was drunk and his eyes were red. He looked at the Prophet then raised his eyes to look at his knees and raised his eves more to look at his face and then said, \"You are not but my father's slaves.\" When the Prophet understood that Hamza was drunk, he retreated, walking backwards went out and we left with him.",
      "chain": [
        "30349",
        "20025",
        "30226",
        "11716",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4060",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد  هو ابن صالح  حدثنا عنبسة، حدثنا يونس، قال ابن شهاب ثم سألت الحصين بن محمد  وهو أحد بني سالم وهو من سراتهم  عن حديث، محمود بن الربيع عن عتبان بن مالك، فصدقة‏.‏",
      "text_en": " Narrated Ibn Shihab:                     I asked Al-Husain bin Muhammad who was one of the sons of Salim and one of the nobles amongst them, about the narration of Mahmud bin Ar-Rabi 'from `Itban bin Malik, and he confirmed it.",
      "chain": [
        "30226",
        "11716",
        "20475"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثني ابن وهب، قال أخبرني يونس، قال أحمد حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن كعب، قال أخبرني عبد الله بن كعب  وكان قائد كعب من بنيه حين عمي  قال سمعت كعب بن مالك، في حديثه ‏{‏وعلى الثلاثة الذين خلفوا‏}‏ قال في آخر حديثه إن من توبتي أن أنخلع من مالي صدقة إلى الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك بعض مالك، فهو خير لك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik talking about the Verse:-- 'And to the three (He also forgave) who remained behind.' (9.118) saying in the last portion of his talk, \"(I said), 'As a part (sign) of my repentance, I would like to give up all my property in the cause of Allah and His Apostle,' The Prophet said to me, 'Keep some of your wealth as it is good for you.\" (To the three (He also forgave) who remained behind till for them the earth, vast as it is, was straitened...\" (9.118)",
      "chain": [
        "30226",
        "20029",
        "20475",
        "30007",
        "11716",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4756",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبدان، حدثنا عبد الله، أخبرنا يونس، ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال ابن المسيب قال أبو هريرة أتي رسول الله صلى الله عليه وسلم ليلة أسري به بإيلياء بقدحين من خمر ولبن، فنظر إليهما فأخذ اللبن قال جبريل الحمد لله الذي هداك للفطرة، لو أخذت الخمر غوت أمتك‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle was presented with two cups one containing wine and the other milk on the night of his night journey at Jerusalem. He looked at it and took the milk. Gabriel said, \"Thanks to Allah Who guided you to the Fitra (i.e. Islam); if you had taken the wine, your followers would have gone astray.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "30226",
        "11716",
        "20475",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "5182",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "قال يحيى بن سليمان حدثنا ابن وهب، عن يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن النكاح في الجاهلية كان على أربعة أنحاء فنكاح منها نكاح الناس اليوم، يخطب الرجل إلى الرجل وليته أو ابنته، فيصدقها ثم ينكحها، ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه‏.‏ ويعتزلها زوجها، ولا يمسها أبدا، حتى يتبين حملها من ذلك الرجل الذي تستبضع منه، فإذا تبين حملها أصابها زوجها إذا أحب، وإنما يفعل ذلك رغبة في نجابة الولد، فكان هذا النكاح نكاح الاستبضاع، ونكاح آخر يجتمع الرهط ما دون العشرة فيدخلون على المرأة كلهم يصيبها‏.‏ فإذا حملت ووضعت، ومر عليها ليالي بعد أن تضع حملها، أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها تقول لهم قد عرفتم الذي كان من أمركم، وقد ولدت فهو ابنك يا فلان‏.‏ تسمي من أحبت باسمه، فيلحق به ولدها، لا يستطيع أن يمتنع به الرجل‏.‏ ونكاح الرابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات تكون علما فمن أرادهن دخل عليهن، فإذا حملت إحداهن ووضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاط به، ودعي ابنه لا يمتنع من ذلك، فلما بعث محمد صلى الله عليه وسلم بالحق هدم نكاح الجاهلية كله، إلا نكاح الناس اليوم‏.‏",
      "text_en": "",
      "chain": [
        "30220",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "7656",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا علي، حدثنا هشام، أخبرنا معمر، عن الزهري، ح وحدثني أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني يحيى بن عروة بن الزبير، أنه سمع عروة بن الزبير، قالت عائشة  رضى الله عنها  سأل أناس النبي صلى الله عليه وسلم عن الكهان فقال ‏\"‏ إنهم ليسوا بشىء ‏\"‏‏.‏ فقالوا يا رسول الله فإنهم يحدثون بالشىء يكون حقا‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الحق يخطفها الجني فيقرقرها في أذن وليه كقرقرة الدجاجة، فيخلطون فيه أكثر من مائة كذبة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Some people asked the Prophet regarding the soothsayers. He said, \"They are nothing.\" They said, \"O Allah's Apostle! Some of their talks come true.\" The Prophet said, \"That word which happens to be true is what a Jinn snatches away by stealth (from the Heaven) and pours it in the ears of his friend (the foreteller) with a sound like the cackling of a hen. The soothsayers then mix with that word, one hundred lies.\"",
      "chain": [
        "5",
        "11065",
        "20115",
        "11013",
        "30226",
        "11716",
        "20475",
        "11013",
        "11545",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبد الرحمن بن بشر، وعبد الله بن هاشم العبدي، قالا حدثنا بهز، حدثنا شعبة، قال النعمان بن سالم أخبرني قال سمعت عمرو بن أوس، يحدث عن عنبسة، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم توضأ فأسبغ الوضوء ثم صلى لله كل يوم ‏\"‏ ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " Umm Habiba reported the Messenger of Allah (may peace be upon him) having said:                      If any Muslim servant (of Allah) performed ablution, and performed it well, and then observed every day, the rest of the hadith is the same.",
      "chain": [
        "30356",
        "30550",
        "20214",
        "20020",
        "10972",
        "11437",
        "11716",
        "59"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال عروة عن عائشة، أن أم سليم الأنصارية، - وهي أم أنس بن مالك - قالت يا رسول الله إن الله عز وجل لا يستحيي من الحق أرأيت المرأة إذا رأت في النوم ما يرى الرجل أتغتسل أم لا قالت عائشة فقال النبي صلى الله عليه وسلم ‏\"‏ نعم فلتغتسل إذا وجدت الماء ‏\"‏ ‏.‏ قالت عائشة فأقبلت عليها فقلت أف لك وهل ترى ذلك المرأة فأقبل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ تربت يمينك يا عائشة ومن أين يكون الشبه ‏\"‏ ‏.‏ قال أبو داود وكذلك روى عقيل والزبيدي ويونس وابن أخي الزهري عن الزهري وإبراهيم بن أبي الوزير عن مالك عن الزهري ووافق الزهري مسافع الحجبي قال عن عروة عن عائشة ‏.‏ وأما هشام بن عروة فقال عن عروة عن زينب بنت أبي سلمة عن أم سلمة أن أم سليم جاءت إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘A’ishah reported on the authority of Umm Sulaim al-Ansariyah, who was the mother of Anas b. Malik, said:                      Messenger of Allah. Allah is not ashamed of truth what do you think, if a woman sees what a man sees in dream, should she take a bath or not? The prophet (ﷺ) replied: Yes, she should take a bath if she finds the liquid (vaginal secretion) ‘A’ishah said : Then I came upon her and said her : Woe to you! Does a woman see that (sexual dream)? In the meantime, the Messenger of Allah (ﷺ) came upon me and said: May your right hand be covered with dust! How can there be the resemblance (i.e., between the child and the mother)?Abu Dawud said: A similar version has been narrated by Zubaid, ‘Uqail, Yunus, cousin of Al-Zuhri, Ibn Abi-Wazir, on the authority of al-Zuhr, musan, al-Hajabi, like al-Zuhri, narrated on the authority of ‘Urwah from ‘A’ishah, but  Hisham b. ‘Urwah narrated from ‘Urwah on the authority of Zainab daughter of Abu Salamah from Umm Salamah saying. Umm Sulaim came to the Messenger of Allah (ﷺ).",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرتني عمرة بنت عبد الرحمن، عن أم حبيبة، بهذا الحديث قالت عائشة رضي الله عنها ‏.‏ فكانت تغتسل لكل صلاة ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain of narrators. According to this version. 'Aishah said:                      She would wash herself for every prayer.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11455",
        "59"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، أخبرني يونس، عن ابن شهاب، أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أقيمت الصلاة فلا تأتوها تسعون وأتوها تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏ قال أبو داود كذا قال الزبيدي وابن أبي ذئب وإبراهيم بن سعد ومعمر وشعيب بن أبي حمزة عن الزهري ‏\"‏ وما فاتكم فأتموا ‏\"‏ ‏.‏ وقال ابن عيينة عن الزهري وحده ‏\"‏ فاقضوا ‏\"‏ ‏.‏ وقال محمد بن عمرو عن أبي سلمة عن أبي هريرة وجعفر بن ربيعة عن الأعرج عن أبي هريرة ‏\"‏ فأتموا ‏\"‏ ‏.‏ وابن مسعود عن النبي صلى الله عليه وسلم وأبو قتادة وأنس عن النبي صلى الله عليه وسلم كلهم قالوا ‏\"‏ فأتموا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      I heard the Messenger of Allah( may peace be upon him) say: When the iqamah is pronounced for prayer, do not come to it running, but come walking(slowly). You should observe tranquility. The part of the prayer you get(along with the imam) offer it, and the part you miss complete it(afterwards).Abu Dawud said: The version narrated by al-Zubaidi, Ibn Abi Dhi’b, Ibrahim b. Sa’d, Ma’mar, Shu’aib b. Abi Hamzah on the authority of al-Zuhri has the words: “the part you miss then complete it”. Ibn ‘Uyainah alone narrated from al-Zuhri the words “then offer it afterwards”. And Muhammad b. ‘Amr narrated from Abu Salamah on the authority of Abu Hurairah, and Ja’far b. Rabi’ah narrated from al-A’raj on the authority of Abu Hurairah the words “then complete it”. And Ibn Mas’ud narrated from the Prophet(ﷺ) and Abu Qatadah and Anas reported from the Prophet( may peace be upon him) the words” then complete it”.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال كان كثير بن عباس يحدث أن عبد الله بن عباس، كان يحدث أن رسول الله صلى الله عليه وسلم صلى في كسوف الشمس مثل حديث عروة عن عائشة عن رسول الله صلى الله عليه وسلم أنه صلى ركعتين في كل ركعة ركعتين ‏.‏",
      "text_en": " Narrated Abd Allah b. 'Abbas:                     The Messenger of Allah (ﷺ) prayed at the solar eclipse as reported in the tradition narrated by 'Urwah from Aishah from the Messenger of Allah (ﷺ) that he offered two rak'ahs of prayer bowing twice in each rak'ah.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "524",
        "17"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثني يونس، عن ابن شهاب، حدثني عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم وأم سلمة أن أبا حذيفة بن عتبة بن ربيعة بن عبد شمس كان تبنى سالما وأنكحه ابنة أخيه هند بنت الوليد بن عتبة بن ربيعة وهو مولى لامرأة من الأنصار كما تبنى رسول الله صلى الله عليه وسلم زيدا وكان من تبنى رجلا في الجاهلية دعاه الناس إليه وورث ميراثه حتى أنزل الله سبحانه وتعالى في ذلك ‏{‏ ادعوهم لآبائهم ‏}‏ إلى قوله ‏{‏ فإخوانكم في الدين ومواليكم ‏}‏ فردوا إلى آبائهم فمن لم يعلم له أب كان مولى وأخا في الدين فجاءت سهلة بنت سهيل بن عمرو القرشي ثم العامري - وهي امرأة أبي حذيفة - فقالت يا رسول الله إنا كنا نرى سالما ولدا وكان يأوي معي ومع أبي حذيفة في بيت واحد ويراني فضلا وقد أنزل الله عز وجل فيهم ما قد علمت فكيف ترى فيه فقال لها النبي صلى الله عليه وسلم ‏\"‏ أرضعيه ‏\"‏ ‏.‏ فأرضعته خمس رضعات فكان بمنزلة ولدها من الرضاعة فبذلك كانت عائشة - رضى الله عنها - تأمر بنات أخواتها وبنات إخوتها أن يرضعن من أحبت عائشة أن يراها ويدخل عليها وإن كان كبيرا خمس رضعات ثم يدخل عليها وأبت أم سلمة وسائر أزواج النبي صلى الله عليه وسلم أن يدخلن عليهن بتلك الرضاعة أحدا من الناس حتى يرضع في المهد وقلن لعائشة والله ما ندري لعلها كانت رخصة من النبي صلى الله عليه وسلم لسالم دون الناس ‏.‏",
      "text_en": " A’ishah wife of the Prophet(ﷺ) and Umm Salamah said “Abu Hudaifah bin ‘Utbah bin Rabi’ah bin ‘Abd Shams adopted Salim as his son and married him to his niece Hind, daughter of Al Walid bin  ‘Utbah bin Rabi’ah. He (Salim) was the freed slave of a woman from the Ansar (the Helpers) as the Apostle of Allaah(ﷺ) adopted Zaid as his son. In pre Islamic days when anyone adopted a man as his son, the people called him by his name and he was given a share from his inheritance. Allaah, the Exalted, revealed about this matter “Call them by (the name of) their fathers, that is juster in the sight of Allaah. And if ye know not their fathers, then (they are) your brethren in the faith and your clients. They were then called by their names of their fathers. A man, whose father was not known, remained under the protection of someone and considered brother in faith. Sahlah daughter of Suhail bin Amr Al Quraishi then came and said Apostle of Allaah(ﷺ), we used to consider Salim(our) son. He dwelled with me and Abu Hudhaifah in the same house, and he saw me in the short clothes, but Allaah the Exalted, has revealed about them what you know, then what is your opinion about him? The Prophet (ﷺ) said give him your breast feed. She gave him five breast feeds. He then became like her foster son. Hence, A’ishah(may Allaah be pleased with her) used to ask the daughters of her sisters and the daughters of her brethren to give him breast feed five times, whom A’ishah wanted to see and who wanted to visit her. Though he might be of age; he then visited her. But Umm Salamah and all other wives of the Prophet (ﷺ) refused to allow anyone to visit them on the basis of such breast feeding unless one was given breast feed during infancy. They told A’ishah by Allaah we do not know whether that was a special concession granted by the Prophet (ﷺ) to Salim exclusive of the people.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "2066",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، أخبرني يونس، عن ابن شهاب، أخبرني قبيصة بن ذؤيب، أنه سمع أبا هريرة، يقول نهى رسول الله صلى الله عليه وسلم أن يجمع بين المرأة وخالتها وبين المرأة وعمتها ‏.‏",
      "text_en": " Abu Hurairah said “The Apostle of Allaah(ﷺ) forbade that a woman and her maternal aunt and a woman and her paternal aunt are joined in marriage.”",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "2182",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني سالم بن عبد الله، عن أبيه، أنه طلق امرأته وهي حائض فذكر ذلك عمر لرسول صلى الله عليه وسلم فتغيظ رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ مره فليراجعها ثم ليمسكها حتى تطهر ثم تحيض فتطهر ثم إن شاء طلقها طاهرا قبل أن يمس فذلك الطلاق للعدة كما أمر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (bin Umar) said that he divorced his wife while she was menstruating. ‘Umar mentioned the matter to the Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) became angry and said “Command him, he must take her back and keep her back till she is purified, then has another menstrual period and is purified. Then if he desires he may divorce her during the period of purity before he has intercourse with her. This is the divorce for waiting period as commanded by Allaah, the Exalted.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الوهاب بن عبد المجيد، حدثنا عنبسة، ح وحدثنا مسدد، حدثنا بشر بن المفضل، عن حميد الطويل، جميعا عن الحسن، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ‏\"‏ ‏.‏ زاد يحيى في حديثه ‏\"‏ في الرهان ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) said: There must be no shouting or leading another horse at one's side. Yahya added in his tradition: When racing for a wager.",
      "chain": [
        "30460",
        "20259",
        "11716",
        "30175",
        "20212",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "2982",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني يزيد بن هرمز، أن نجدة الحروري، حين حج في فتنة ابن الزبير أرسل إلى ابن عباس يسأله عن سهم ذي القربى ويقول لمن تراه قال ابن عباس لقربى رسول الله صلى الله عليه وسلم قسمه لهم رسول الله صلى الله عليه وسلم وقد كان عمر عرض علينا من ذلك عرضا رأيناه دون حقنا فرددناه عليه وأبينا أن نقبله ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Yazid ibn Hurmuz said that when Najdah al-Haruri performed hajj during the rule of Ibn az-Zubayr, he sent someone to Ibn Abbas to ask him about the portion of the relatives (in the fifth). He asked: For whom do you think?  Ibn Abbas replied: For the relatives of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) divided it among them. Umar presented it to us but we found it less than our right. We, therefore returned it to him and refused to accept it.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10627"
      ]
    },
    {
      "hadith_no": "2985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، أخبرني عبد الله بن الحارث بن نوفل الهاشمي، أن عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أخبره أن أباه ربيعة بن الحارث وعباس بن عبد المطلب قالا لعبد المطلب بن ربيعة وللفضل بن عباس ائتيا رسول الله صلى الله عليه وسلم فقولا له يا رسول الله قد بلغنا من السن ما ترى وأحببنا أن نتزوج وأنت يا رسول الله أبر الناس وأوصلهم وليس عند أبوينا ما يصدقان عنا فاستعملنا يا رسول الله على الصدقات فلنؤد إليك ما يؤدي العمال ولنصب ما كان فيها من مرفق ‏.‏ قال فأتى إلينا علي بن أبي طالب ونحن على تلك الحال فقال لنا إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا والله لا نستعمل منكم أحدا على الصدقة ‏\"‏ ‏.‏ فقال له ربيعة هذا من أمرك قد نلت صهر رسول الله صلى الله عليه وسلم فلم نحسدك عليه ‏.‏ فألقى علي رداءه ثم اضطجع عليه فقال أنا أبو حسن القرم والله لا أريم حتى يرجع إليكما ابناكما بجواب ما بعثتما به إلى النبي صلى الله عليه وسلم ‏.‏ قال عبد المطلب فانطلقت أنا والفضل إلى باب حجرة النبي صلى الله عليه وسلم حتى نوافق صلاة الظهر قد قامت فصلينا مع الناس ثم أسرعت أنا والفضل إلى باب حجرة النبي صلى الله عليه وسلم وهو يومئذ عند زينب بنت جحش فقمنا بالباب حتى أتى رسول الله صلى الله عليه وسلم فأخذ بأذني وأذن الفضل ثم قال أخرجا ما تصرران ثم دخل فأذن لي وللفضل فدخلنا فتواكلنا الكلام قليلا ثم كلمته أو كلمه الفضل - قد شك في ذلك عبد الله - قال كلمه بالأمر الذي أمرنا به أبوانا فسكت رسول الله صلى الله عليه وسلم ساعة ورفع بصره قبل سقف البيت حتى طال علينا أنه لا يرجع إلينا شيئا حتى رأينا زينب تلمع من وراء الحجاب بيدها تريد أن لا تعجلا وإن رسول الله صلى الله عليه وسلم في أمرنا ثم خفض رسول الله صلى الله عليه وسلم رأسه فقال لنا ‏\"‏ إن هذه الصدقة إنما هي أوساخ الناس وإنها لا تحل لمحمد ولا لآل محمد ادعوا لي نوفل بن الحارث ‏\"‏ ‏.‏ فدعي له نوفل بن الحارث فقال ‏\"‏ يا نوفل أنكح عبد المطلب ‏\"‏ ‏.‏ فأنكحني نوفل ثم قال النبي صلى الله عليه وسلم ‏\"‏ ادعوا لي محمية بن جزء ‏\"‏ ‏.‏ وهو رجل من بني زبيد كان رسول الله صلى الله عليه وسلم استعمله على الأخماس فقال رسول الله صلى الله عليه وسلم لمحمية ‏\"‏ أنكح الفضل ‏\"‏ ‏.‏ فأنكحه ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قم فأصدق عنهما من الخمس كذا وكذا ‏\"‏ ‏.‏ لم يسمه لي عبد الله بن الحارث ‏.‏",
      "text_en": " Narrated AbdulMuttalib ibn Rabi'ah ibn al-Harith:                     AbdulMuttalib ibn Rabi'ah ibn al-Harith said that his father, Rabi'ah ibn al-Harith, and Abbas ibn al-Muttalib said to AbdulMuttalib ibn Rabi'ah and al-Fadl ibn Abbas: Go to the Messenger of Allah (ﷺ) and tell him: Messenger of Allah, we are now of age as you see, and we wish to marry. Messenger of Allah, you are the kindest of the people and the most skilled in matchmaking. Our fathers have nothing with which to pay our dower. So appoint us collector of sadaqah (zakat), Messenger of Allah, and we shall give you what the other collectors give you, and we shall have the benefit accruing from it. Ali came to us while we were in this condition.  He said: The Messenger of Allah (ﷺ) said: No, I swear by Allah, he will not appoint any of you collector of sadaqah (zakat).  Rabi'ah said to him: This is your condition; you have gained your relationship with the Messenger of Allah (ﷺ) by marriage, but we did not grudge you that. Ali then put his cloak on the earth and lay on it.  He then said: I am the father of Hasan, the chief. I swear by Allah, I shall not leave this place until your sons come with a reply (to the question) for which you have sent them to the Prophet (ﷺ).  AbdulMuttalib said: So I and al-Fadl went towards the door of the apartment of the Prophet (ﷺ). We found that the noon prayer in congregation had already started. So we prayed along with the people. I and al-Fadl then hastened towards the door of the apartment of the Prophet (ﷺ). He was (staying) with Zaynab, daughter of Jahsh, that day. We stood until the Messenger of Allah (ﷺ) came. He caught my ear and the ear of al-Fadl.  He then said: Reveal what you conceal in your hearts. He then entered  and permitted me and al-Fadl (to enter). So we entered and for a little while we asked each other to talk. I then talked to him, or al-Fadl talked to him (the narrator, Abdullah was not sure).  He said: He spoke to him concerning the matter about which our fathers ordered us to ask him. The Messenger of Allah (ﷺ) remained silent for a moment and raised his eyes towards the ceiling of the room. He took so long that we thought he would not give any reply to us. Meanwhile we saw that Zaynab was signalling to us with her hand from behind the veil, asking us not to be in a hurry, and that the Messenger of Allah (ﷺ) was (thinking) about our matter.  The Messenger of Allah (ﷺ) then lowered his head and said to us: This sadaqah (zakat) is a dirt of the people. It is legal neither for Muhammad nor for the family of Muhammad. Call Nawfal ibn al-Harith to me. So Nawfal ibn al-Harith was called to him.  He said: Nawfal, marry AbdulMuttalib (to your daughter). So Nawfal married me (to his daughter).  The Prophet (ﷺ) then said: Call Mahmiyyah ibn Jaz'i to me. He was a man of Banu Zubayd, whom the Messenger of Allah (ﷺ) had appointed collector of the fifths.  The Messenger of Allah (ﷺ) said to Mahmiyyah: Marry al-Fadl (to your daughter). So he married him to her. The Messenger of Allah (ﷺ) said: Stand up and pay the dower from the fifth so-and-so on their behalf. Abdullah ibn al-Harith did not name it (i.e. the amount of the dower).",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "3335",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، ح وحدثنا أحمد بن صالح، حدثنا عنبسة، عن يونس، عن ابن شهاب، قال قال ابن المسيب إن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلف منفقة للسلعة ممحقة للبركة ‏\"‏ ‏.‏ قال ابن السرح ‏\"‏ للكسب ‏\"‏ ‏.‏ وقال عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     I heard Messenger of Allah (ﷺ) say: Swearing produces a ready sale for a commodity but blots out the blessing. The narrator Ibn al-Sarh said: \"for earning\". He also narrated this tradition from Sa'id b. al-Musayyab on the authority of Abu Hurairah from the Prophet (ﷺ).",
      "chain": [
        "30485",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "4251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن صالح، عن عنبسة، عن يونس، عن الزهري، قال وسلاح قريب من خيبر ‏.‏",
      "text_en": " Al-Zuhri said:                      Salah is near Khaibar.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "4255",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثني يونس، عن ابن شهاب، قال حدثني حميد بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يتقارب الزمان وينقص العلم وتظهر الفتن ويلقى الشح ويكثر الهرج ‏\"‏ ‏.‏ قيل يا رسول الله أية هو قال ‏\"‏ القتل القتل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah :                     The Messenger of Allah (ﷺ) as saying: The time will become short, knowledge will be decreased, civil strife (fitan) will appear, niggardliness will be case into people's heart, and harj will be prevalent. He was asked: Messenger of Allah! what is it: He replied: Slaughter, slaughter.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "4300",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن صالح، عن عنبسة، عن يونس، عن الزهري، قال وسلاح قريب من خيبر ‏.‏",
      "text_en": " Al-Zuhri said:                      Salah is near Khaibar.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "4450",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال حدثنا رجل، من مزينة ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، قال قال محمد بن مسلم سمعت رجلا، من مزينة ممن يتبع العلم ويعيه - ثم اتفقا - ونحن عند سعيد بن المسيب فحدثنا عن أبي هريرة - وهذا حديث معمر وهو أتم - قال زنى رجل من اليهود وامرأة فقال بعضهم لبعض اذهبوا بنا إلى هذا النبي فإنه نبي بعث بالتخفيف فإن أفتانا بفتيا دون الرجم قبلناها واحتججنا بها عند الله قلنا فتيا نبي من أنبيائك - قال - فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه فقالوا يا أبا القاسم ما ترى في رجل وامرأة زنيا فلم يكلمهم كلمة حتى أتى بيت مدراسهم فقام على الباب فقال ‏\"‏ أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن ‏\"‏ ‏.‏ قالوا يحمم ويجبه ويجلد - والتجبية أن يحمل الزانيان على حمار وتقابل أقفيتهما ويطاف بهما - قال وسكت شاب منهم فلما رآه النبي صلى الله عليه وسلم سكت ألظ به النشدة فقال اللهم إذ نشدتنا فإنا نجد في التوراة الرجم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فما أول ما ارتخصتم أمر الله ‏\"‏ ‏.‏ قال زنى ذو قرابة مع ملك من ملوكنا فأخر عنه الرجم ثم زنى رجل في أسرة من الناس فأراد رجمه فحال قومه دونه وقالوا لا يرجم صاحبنا حتى تجيء بصاحبك فترجمه فاصطلحوا على هذه العقوبة بينهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فإني أحكم بما في التوراة ‏\"‏ ‏.‏ فأمر بهما فرجما ‏.‏ قال الزهري فبلغنا أن هذه الآية نزلت فيهم ‏{‏ إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا ‏}‏ كان النبي صلى الله عليه وسلم منهم ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     (This is Ma'mar's version which is more accurate.) A man and a woman of the Jews committed fornication.  Some of them said to the others: Let us go to this Prophet, for he has been sent with an easy law. If he gives a judgment lighter than stoning, we shall accept it, and argue about it with Allah, saying: It is a judgment of one of your prophets. So they came to the Prophet (ﷺ) who was sitting in the mosque among his companions.  They said: AbulQasim, what do you think about a man and a woman who committed fornication? He did not speak to them a word till he went to their school.  He stood at the gate and said: I adjure you by Allah Who revealed the Torah to Moses, what (punishment) do you find in the Torah for a person who commits fornication, if he is married?  They said: He shall be blackened with charcoal, taken round a donkey among the people, and flogged. A young man among them kept silent.  When the Prophet (ﷺ) emphatically adjured him, he said: By Allah, since you have adjured us (we inform you that) we find stoning in the Torah (is the punishment for fornication).  The Prophet (ﷺ) said: So when did you lessen the severity of Allah's command? He said:  A relative of one of our kings had committed fornication, but his stoning was suspended. Then a man of a family of common people committed fornication. He was to have been stoned, but his people intervened and said: Our man shall not be stoned until you bring your man and stone him. So they made a compromise on this punishment between them.  The Prophet (ﷺ) said: So I decide in accordance with what the Torah says. He then commanded regarding them and they were stoned to death.  Az-Zuhri said: We have been informed that this verse was revealed about them: \"It was We Who revealed the Law (to Moses): therein was guidance and light. By its standard have been judged the Jews, by the Prophet who bowed (as in Islam) to Allah's will.",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11013",
        "30226",
        "11716",
        "20475",
        "167",
        "13"
      ]
    },
    {
      "hadith_no": "4628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن ابن شهاب، قال قال سالم بن عبد الله إن ابن عمر قال كنا نقول ورسول الله صلى الله عليه وسلم حى أفضل أمة النبي صلى الله عليه وسلم بعده أبو بكر ثم عمر ثم عثمان رضى الله عنهم أجمعين ‏.‏",
      "text_en": " Ibn ‘Umar said:                      When the Messenger of Allah (ﷺ) was alive, we used to say: The most excellent member of the community of the Prophet (ﷺ) after himself is Abu Bakr, then ‘Umar, then 'Uthman.",
      "chain": [
        "30226",
        "11716",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا حكام بن سلم، وهارون بن المغيرة، عن عنبسة، عن أبي حمزة، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والنعى فإن النعى من عمل الجاهلية ‏\"‏ ‏.‏ قال عبد الله والنعى أذان بالميت ‏.‏ وفي الباب عن حذيفة ‏.‏",
      "text_en": " Abdullah narrated that:                     The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"",
      "chain": [
        "38495",
        "20649",
        "28610",
        "11716",
        "20458",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2714",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة، حدثنا عبيد الله بن الحارث، عن عنبسة، عن محمد بن زاذان، عن أم سعد، عن زيد بن ثابت، قال دخلت على رسول الله صلى الله عليه وسلم وبين يديه كاتب فسمعته يقول ‏\"‏ ضع القلم على أذنك فإنه أذكر للمملي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وهو إسناد ضعيف ‏.‏ وعنبسة بن عبد الرحمن ومحمد بن زاذان يضعفان في الحديث ‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     \"I entered upon the Messenger of Allah (ﷺ) while there was a scribe in front of him, and I heard him saying: 'Put the pen on your ear, for that is more conducive to the scribe remembering.'\"",
      "chain": [
        "30367",
        "11716",
        "12455",
        "49"
      ]
    }
  ],
  "total_hadiths": 28
}