{
  "id": "11729",
  "name": "Wasl Mwla Abi Ayynh واصل مولى أبي عيينة",
  "full_name": "Wasl Mwla Abi Ayynh واصل مولى أبي عيينة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10726",
      "name": "Yahya bin Aqyl يحيى بن عقيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10910",
      "name": "Rja'a bin Hywh رجاء بن حيوة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1261",
      "hadith_no": "1261",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، وشيبان بن فروخ، قالا حدثنا مهدي بن ميمون، حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ عرضت على أعمال أمتي حسنها وسيئها فوجدت في محاسن أعمالها الأذى يماط عن الطريق ووجدت في مساوي أعمالها النخاعة تكون في المسجد لا تدفن ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Apostle of Allah (may peace be upon him) said: The deeds of my people, good and bad, were presented before me, and I found the removal of something objectionable from the road among their good deeds, and the sputum mucus left unburied in the mosque among their evil deeds.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1704",
      "hadith_no": "1704",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الدؤلي، عن أبي ذر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ يصبح على كل سلامى من أحدكم صدقة فكل تسبيحة صدقة وكل تحميدة صدقة وكل تهليلة صدقة وكل تكبيرة صدقة وأمر بالمعروف صدقة ونهى عن المنكر صدقة ويجزئ من ذلك ركعتان يركعهما من الضحى ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Apostle (may peace be upon him) as saying:                      In the morning charity is due from every bone in the body of every one of you. Every utterance of Allah's glorification is an act of charity. Every utterance of praise of Him is an act of charity, every utterance of profession of His Oneness is an act of charity, every utterance of profession of His Greatness is an act of charity, enjoining good is an act of charity, forbidding what is distreputable is an act of charity, and two rak'ahs which one prays in the forenoon will suffice.",
      "usc_msa_ref": "",
      "chain": [
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-2376",
      "hadith_no": "2376",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي بن ميمون، حدثنا واصل، مولى أبي عيينة عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي، ذر أن ناسا، من أصحاب النبي صلى الله عليه وسلم قالوا للنبي صلى الله عليه وسلم يا رسول الله ذهب أهل الدثور بالأجور يصلون كما نصلي ويصومون كما نصوم ويتصدقون بفضول أموالهم ‏.‏ قال ‏\"‏ أوليس قد جعل الله لكم ما تصدقون إن بكل تسبيحة صدقة وكل تكبيرة صدقة وكل تحميدة صدقة وكل تهليلة صدقة وأمر بالمعروف صدقة ونهى عن منكر صدقة وفي بضع أحدكم صدقة ‏\"‏ ‏.‏ قالوا يا رسول الله أيأتي أحدنا شهوته ويكون له فيها أجر قال ‏\"‏ أرأيتم لو وضعها في حرام أكان عليه فيها وزر فكذلك إذا وضعها في الحلال كان له أجر ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      some of the people from among the Companions of the Apostle of Allah (may peace be upon him) said to him: Messenger of Allah, the rich have taken away (air the) reward. They observe prayer as we do; they keep the fasts as we keep, and tray give Sadaqa out of their surplus riches. Upon this he (the Holy Prophet) said: Has Allah not prescribed for you (a course) by following which you can (also) do sadaqa? In every declaration of the glorification of Allah (i. e. saying Subhan Allah) there is a Sadaqa, and every Takbir (i. e. saying Allah-O-Akbar) is a sadaqa, and every praise of His (saying al-Hamdu Lillah) is a Sadaqa and every declaration that He is One (La illha ill-Allah) is a sadaqa, and enjoining of good is a sadaqa, and forbidding of that which is evil is a Sadaqa, and in man's sexual Intercourse (with his wife, ) there is a Sadaqa. They (the Companions) said: Messenger of Allah, is there reward for him who satisfies his sexual passion among us? He said: Tell me, if he were to devote it to something forbidden, would it not be a sin on his part? Similarly, if he were to devote it to something lawful, he should have a reward.",
      "usc_msa_ref": "",
      "chain": [
        "11307",
        "11729",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    }
  ],
  "total_hadiths": 3
}