{
  "id": "11725",
  "name": "Maqsim bin Bajra مقسم بن بجرة",
  "full_name": "Maqsim bin Bajra مقسم بن بجرة",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "101",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  4  -  صدوق ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5013",
      "name": "Khafaf bin Aiama bin Rahda ( خفاف بن إيماء بن رحضة الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16557",
      "name": "'Abdullah bin Shrhbyl bin Hasanh عبد الله بن شرحبيل بن حسنه قرشي",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19908",
      "name": "Khsyf bin 'Abdur Rahman al-Jzry خصيف بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18655",
      "name": "'Abdul al-Kareem bin Malik عبد الكريم بن مالك الجزري أبو سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11369",
      "name": "'Abdul Malik bin Mysrh عبد الملك بن ميسرة الزراد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11190",
      "name": "'Abdul Hameed bin 'Abdur Rahman عبد الحميد بن عبد الرحمن بن زيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19929",
      "name": "'Ali bin Bdhymh علي بن بذيمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4638",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم ح، وحدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عبد الكريم، أن مقسما، مولى عبد الله بن الحارث أخبره أن ابن عباس  رضى الله عنهما  أخبره ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ عن بدر والخارجون إلى بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Not equal are those believers who sat (at home) and did not join the Badr battle and those who joined the Badr battle.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "30021",
        "20121",
        "11070",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثني الحكم، عن عبد الحميد بن عبد الرحمن، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الذي يأتي امرأته وهي حائض قال ‏\"‏ يتصدق بدينار أو نصف دينار ‏\"‏ ‏.‏ قال أبو داود هكذا الرواية الصحيحة قال ‏\"‏ دينار أو نصف دينار ‏\"‏ ‏.‏ وربما لم يرفعه شعبة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said about a person who had intercourse with his wife while she was menstruating: He must give one dinar or half a dinar in alms.Abu Dawud said: The correct version says si: One dinar or half a dinar. Shu'bah (a narrator) did not sometimes narrate this tradition as a statement of the Prophet (ﷺ).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "11190",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، - يعني ابن سليمان - عن علي بن الحكم البناني، عن أبي الحسن الجزري، عن مقسم، عن ابن عباس، قال إذا أصابها في أول الدم فدينار وإذا أصابها في انقطاع الدم فنصف دينار ‏.‏ قال أبو داود وكذلك قال ابن جريج عن عبد الكريم عن مقسم ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      If one has intercourse in the beginning of the menses,(one should give) one dinar; in case one has intercourse towards the end of the menses, then half a dinar (should be given)",
      "chain": [
        "20249",
        "20532",
        "11605",
        "11725",
        "17",
        "11070",
        "18655"
      ]
    },
    {
      "hadith_no": "266",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن خصيف، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وقع الرجل بأهله وهي حائض فليتصدق بنصف دينار ‏\"‏ ‏.‏ قال أبو داود وكذا قال علي بن بذيمة عن مقسم عن النبي صلى الله عليه وسلم مرسلا وروى الأوزاعي عن يزيد بن أبي مالك عن عبد الحميد بن عبد الرحمن عن النبي صلى الله عليه وسلم قال ‏\"‏ آمره أن يتصدق بخمسى دينار ‏\"‏ ‏.‏ وهذا معضل ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (May peace be upon him) as saying; when a man has intercourse with his wife while she is menstruating, he must give half a dinar in alms.Abu Dawud said; ‘Ali b. Budhaimah reported similarly on the authority of Miqsam from the Prophet (May peace be upon him). Al-Awza’I narrated from Yazid b. Abi Malik, from ‘Abd al-Hamid b. ‘Abd al-Rahman from the Prophet (May peace be upon him); He ordered him to give two fifth of a dinar in alms. But this is a chain where two narrators (Miqsam and Ibn ‘Abbas) are missing.",
      "chain": [
        "30269",
        "20587",
        "19908",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1911",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا زهير بن حرب، حدثنا الأحوص بن جواب الضبي، حدثنا عمار بن رزيق، عن سليمان الأعمش، عن الحكم، عن مقسم، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر يوم التروية والفجر يوم عرفة بمنى ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) offered the noon prayer on the 8th of Dhul-Hijjah (Yawm at-Tarwiyah) and dawn prayer on the 9th of Dhul-Hijjah (Yawm al-Arafah) in Mina.",
      "chain": [
        "30022",
        "20595",
        "11060",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن الأعمش، ح وحدثنا وهب بن بيان، حدثنا عبيدة، حدثنا سليمان الأعمش، - المعنى - عن الحكم، عن مقسم، عن ابن عباس، قال أفاض رسول الله صلى الله عليه وسلم من عرفة وعليه السكينة ورديفه أسامة وقال ‏\"‏ أيها الناس عليكم بالسكينة فإن البر ليس بإيجاف الخيل والإبل ‏\"‏ ‏.‏ قال فما رأيتها رافعة يديها عادية حتى أتى جمعا ‏.‏ زاد وهب ثم أردف الفضل بن العباس ‏.‏ وقال ‏\"‏ أيها الناس إن البر ليس بإيجاف الخيل والإبل فعليكم بالسكينة ‏\"‏ ‏.‏ قال فما رأيتها رافعة يديها حتى أتى منى ‏.‏",
      "text_en": " Ibn ‘Abbas said The Apostle of Allaah(ﷺ) returned from ‘Arafah preserving a quiet demeanor and he took Usamah up behind him (on the Camel). He said “O people preserve a quiet demeanor for piety does not consist in exciting the Horses and the Camels (i.e., in driving them quickly).” He (Ibn ‘Abbas) said “Thereafter I did not see them raising their hands running quickly till he came to Al Muzdalifah.” The narrator Wahb added He took Al Fadl bin ‘Abbas up behind him (on the Camel) and said O people piety does not consist in exciting the Horses and the Camels (i.e., in driving them quickly), you must preserve a quiet demeanor”. He (Ibn ‘Abbas) said “Thereafter I did not see them raising their hands till he came to Mina.”",
      "chain": [
        "28531",
        "20012",
        "11060",
        "36063",
        "11370",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، - غيره عن سعيد، - حدثني الحكم، عن عبد الحميد بن عبد الرحمن، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الذي يأتي امرأته وهي حائض قال ‏\"‏ يتصدق بدينار أو بنصف دينار ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said about a man who has sexual intercourse with a menstruating woman: He should give one or half dinar as sadaqah.",
      "chain": [
        "30175",
        "20031",
        "11168",
        "11069",
        "11190",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، - يعني ابن سليمان - عن علي بن الحكم البناني، عن أبي الحسن الجزري، عن مقسم، عن ابن عباس، قال إذا أصابها في الدم فدينار وإذا أصابها في انقطاع الدم فنصف دينار ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     If a man has sexual intercourse (with menstruating woman) during her bleeding, he should give one dinar as sadaqah, and if he does so when bleeding has stopped, he should give half a dinar as sadaqah.",
      "chain": [
        "20249",
        "20532",
        "11605",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2373",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم احتجم وهو صائم محرم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) had himself cupped when he was fasting and wearing ihram (pilgrim garb).",
      "chain": [
        "30329",
        "20020",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن حنبل، وعثمان بن أبي شيبة، قالا حدثنا ابن إدريس، عن يزيد، - يعني ابن أبي زياد - عن مقسم، عن ابن عباس، قال كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب نجرانية الحلة ثوبان وقميصه الذي مات فيه ‏.‏ قال أبو داود قال عثمان في ثلاثة أثواب حلة حمراء وقميصه الذي مات فيه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) was shrouded in three garments made in Najran: two garments and one shirt in which he died.Abu Dawud said: The narrator 'Uthman said: In three garments: two red garments and a shirt in which he died.",
      "chain": [
        "30007",
        "30203",
        "20102",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا عمر بن أيوب، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، قال افتتح رسول الله صلى الله عليه وسلم خيبر واشترط أن له الأرض وكل صفراء وبيضاء ‏.‏ قال أهل خيبر نحن أعلم بالأرض منكم فأعطناها على أن لكم نصف الثمرة ولنا نصف ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم عبد الله بن رواحة فحزر عليهم النخل وهو الذي يسميه أهل المدينة الخرص فقال في ذه كذا وكذا قالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا ألي حزر النخل وأعطيكم نصف الذي قلت ‏.‏ قالوا هذا الحق وبه تقوم السماء والأرض قد رضينا أن نأخذه بالذي قلت ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) conquered Khaibar, and stipulated that all the land, gold and silver would belong to him. The people of Khaibar said: we know the land more than you ; so give it to us on condition that you should have half of the produce and we would have the half. He then gave it to them on that condition. When the time of picking the fruits of the palm-trees came, he sent 'Abd Allah b. Rawahah to them, and he assessed the among of the fruits of the palm-trees. This is what the people of Medina call khars (assessment). He used to say: In these palm-trees there is such-and-such amount (of produce). They would say: You assessed more to us, Ibn Rawahah (than the real amount). He would say: I first take the responsibility of assessing the fruits of the palm-trees and give you half of (the amount) I said. They would say: This is true, and on this (equity) stand the heavens and the earth. We agreed that we should take (the amount which) you said.",
      "chain": [
        "38120",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3412",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا كثير، - يعني ابن هشام - عن جعفر بن برقان، حدثنا ميمون، عن مقسم، أن النبي صلى الله عليه وسلم حين افتتح خيبر فذكر نحو حديث زيد قال فحزر النخل وقال فأنا ألي جذاذ النخل وأعطيكم نصف الذي قلت ‏.‏",
      "text_en": " Narrated Miqsam:                     When the Prophet (ﷺ) conquered Khaibar. He then narrated it like the tradition of Zaid (b. Abu al-Zarqa'). This version has: He then assessed the produce of the palm-trees and said: I take the job of picking the fruit myself, and I shall give you half of (the amount) I said.",
      "chain": [
        "31160",
        "20633",
        "20646",
        "11725"
      ]
    },
    {
      "hadith_no": "3971",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد بن زياد، حدثنا خصيف، حدثنا مقسم، مولى ابن عباس قال قال ابن عباس رضى الله عنهما نزلت هذه الآية ‏{‏ وما كان لنبي أن يغل ‏}‏ في قطيفة حمراء فقدت يوم بدر فقال بعض الناس لعل رسول الله صلى الله عليه وسلم أخذها فأنزل الله عز وجل ‏{‏ وما كان لنبي أن يغل ‏}‏ إلى آخر الآية ‏.‏ قال أبو داود يغل مفتوحة الياء ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The verse \"And no Prophet could (ever) be false to his trust\" was revealed about a red velvet. When it was found missing on the day of Badr, some people said; Perhaps the Messenger of Allah (ﷺ) has taken it. So Allah, the Exalted, sent down \"And no prophet could (ever) be false to his trust\" to the end of the verse.Abu Dawud said: In the word yaghulla the letter ya has a short vowel a.",
      "chain": [
        "30367",
        "20256",
        "19908",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "136",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن خصيف، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الرجل يقع على امرأته وهي حائض قال ‏\"‏ يتصدق بنصف دينار ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said about a man who had sexual intercourse with his wife while she is menstruating: \"He should give half a Dinar in charity.\"",
      "chain": [
        "20387",
        "20587",
        "19908",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "137",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن حريث، أخبرنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد الكريم، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كان دما أحمر فدينار وإذا كان دما أصفر فنصف دينار ‏\"‏ ‏.‏ قال أبو عيسى حديث الكفارة في إتيان الحائض قد روي عن ابن عباس موقوفا ومرفوعا ‏.‏ وهو قول بعض أهل العلم ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال ابن المبارك يستغفر ربه ولا كفارة عليه ‏.‏ وقد روي نحو قول ابن المبارك عن بعض التابعين منهم سعيد بن جبير وإبراهيم النخعي وهو قول عامة علماء الأمصار ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"When the blood is red then (give) a Dinar. And when the blood is yellow then half Dinar.\"",
      "chain": [
        "30325",
        "20452",
        "20458",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "527",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الحجاج، عن الحكم، عن مقسم، عن ابن عباس، قال بعث النبي صلى الله عليه وسلم عبد الله بن رواحة في سرية فوافق ذلك يوم الجمعة فغدا أصحابه فقال أتخلف فأصلي مع رسول الله صلى الله عليه وسلم ثم ألحقهم ‏.‏ فلما صلى مع النبي صلى الله عليه وسلم رآه فقال ‏\"‏ ما منعك أن تغدو مع أصحابك ‏\"‏ ‏.‏ فقال أردت أن أصلي معك ثم ألحقهم ‏.‏ قال ‏\"‏ لو أنفقت ما في الأرض جميعا ما أدركت فضل غدوتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ قال علي بن المديني قال يحيى بن سعيد قال شعبة لم يسمع الحكم من مقسم إلا خمسة أحاديث ‏.‏ وعدها شعبة وليس هذا الحديث فيما عد شعبة فكأن هذا الحديث لم يسمعه الحكم من مقسم ‏.‏ وقد اختلف أهل العلم في السفر يوم الجمعة فلم ير بعضهم بأسا بأن يخرج يوم الجمعة في السفر ما لم تحضر الصلاة ‏.‏ وقال بعضهم إذا أصبح فلا يخرج حتى يصلي الجمعة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"",
      "chain": [
        "30242",
        "20354",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "777",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم فيما بين مكة والمدينة وهو محرم صائم ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وجابر وأنس ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا الحديث ولم يروا بالحجامة للصائم بأسا ‏.‏ وهو قول سفيان الثوري ومالك بن أنس والشافعي ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet was cupped somewhere between Makkah and Al-Madinah and he was fasting and in Ihram.\"",
      "chain": [
        "30242",
        "20102",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "880",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عبد الله بن الأجلح، عن الأعمش، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى بمنى الظهر والفجر ثم غدا إلى عرفات ‏.‏ قال وفي الباب عن عبد الله بن الزبير وأنس ‏.‏ قال أبو عيسى حديث مقسم عن ابن عباس قال علي بن المديني قال يحيى قال شعبة لم يسمع الحكم من مقسم إلا خمسة أشياء ‏.‏ وعدها وليس هذا الحديث فيما عد شعبة ‏.‏",
      "text_en": " Al-Hakam reported from Miqsam, that Ibn Abbas narrated:                     That the Prophet prayed Zuhr and Fajr in Mina, then he left in the morning to Arafat.",
      "chain": [
        "30200",
        "25138",
        "11060",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "893",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن المسعودي، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم قدم ضعفة أهله وقال ‏\"‏ لا ترموا الجمرة حتى تطلع الشمس ‏\"‏ ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم لم يروا بأسا أن يتقدم الضعفة من المزدلفة بليل يصيرون إلى منى ‏.‏ وقال أكثر أهل العلم بحديث النبي صلى الله عليه وسلم أنهم لا يرمون حتى تطلع الشمس ‏.‏ ورخص بعض أهل العلم في أن يرموا بليل ‏.‏ والعمل على حديث النبي صلى الله عليه وسلم أنهم لا يرمون ‏.‏ وهو قول الثوري والشافعي ‏.‏ ‏.‏ قال أبو عيسى حديث ابن عباس بعثني رسول الله صلى الله عليه وسلم في ثقل حديث صحيح روي عنه من غير وجه ‏.‏ وروى شعبة هذا الحديث عن مشاش عن عطاء عن ابن عباس عن الفضل بن عباس أن النبي صلى الله عليه وسلم قدم ضعفة أهله من جمع بليل ‏.‏ وهذا حديث خطأ أخطأ فيه مشاش وزاد فيه عن الفضل بن عباس ‏.‏ وروى ابن جريج وغيره هذا الحديث عن عطاء عن ابن عباس ‏.‏ ولم يذكروا فيه عن الفضل بن عباس ‏.‏ ومشاش بصري روى عنه شعبة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet advanced the weak among his family and he said: 'Do not stone the Jamrah until the sun has risen.'\"",
      "chain": [
        "30216",
        "20032",
        "20724",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "895",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا أبو خالد الأحمر، عن الأعمش، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم أفاض قبل طلوع الشمس ‏.‏ قال وفي الباب عن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وإنما كان أهل الجاهلية ينتظرون حتى تطلع الشمس ثم يفيضون ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet departed before the rising of the sun.\"",
      "chain": [
        "30367",
        "20326",
        "11060",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا زياد بن عبد الله، عن الحجاج، عن الحكم، عن مقسم، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يرمي الجمار إذا زالت الشمس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Messenger of Allah stoned the Jimar when the sun had passed the zenith.\"",
      "chain": [
        "30423",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، أخبرنا الحجاج، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم رمى الجمرة يوم النحر راكبا ‏.‏ قال وفي الباب عن جابر وقدامة بن عبد الله وأم سليمان بن عمرو بن الأحوص ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ والعمل على هذا عند بعض أهل العلم واختار بعضهم أن يمشي إلى الجمار ‏.‏ وقد روي عن ابن عمر عن النبي صلى الله عليه وسلم أنه كان يمشي إلى الجمار ‏.‏ ووجه هذا الحديث عندنا أنه ركب في بعض الأيام ليقتدى به في فعله وكلا الحديثين مستعمل عند أهل العلم ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet stoned the Jamrah on the Day of An-Nahr while riding.\"",
      "chain": [
        "30242",
        "20366",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1026",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن حباب، حدثنا إبراهيم بن عثمان، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم قرأ على الجنازة بفاتحة الكتاب ‏.‏ قال وفي الباب عن أم شريك ‏.‏ قال أبو عيسى حديث ابن عباس حديث ليس إسناده بذلك القوي ‏.‏ إبراهيم بن عثمان هو أبو شيبة الواسطي منكر الحديث ‏.‏ والصحيح عن ابن عباس قوله من السنة القراءة على الجنازة بفاتحة الكتاب ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet recited Fatihatil-Kitab for a funeral (prayer).\" (Da'if Jiddan)",
      "chain": [
        "30242",
        "20650",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن ابن أبي ليلى، عن الحكم، عن مقسم، عن ابن عباس، أن المشركين، أرادوا أن يشتروا، جسد رجل من المشركين فأبى النبي صلى الله عليه وسلم أن يبيعهم إياه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث الحكم ‏.‏ ورواه الحجاج بن أرطاة أيضا عن الحكم ‏.‏ وقال أحمد بن الحسن سمعت أحمد بن حنبل يقول ابن أبي ليلى لا يحتج بحديثه ‏.‏ وقال محمد بن إسماعيل ابن أبي ليلى صدوق ولكن لا يعرف صحيح حديثه من سقيمه ولا أروي عنه شيئا ‏.‏ وابن أبي ليلى صدوق فقيه وإنما يهم في الإسناد ‏.‏ حدثنا نصر بن علي قال حدثنا عبد الله بن داود عن سفيان الثوري قال فقهاؤنا ابن أبي ليلى وعبد الله بن شبرمة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11196",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3280",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الواحد بن زياد، عن خصيف، حدثنا مقسم، قال قال ابن عباس نزلت هذه الآية ‏:‏ ‏(‏ وما كان لنبي أن يغل ‏)‏ في قطيفة حمراء افتقدت يوم بدر ‏.‏ فقال بعض الناس لعل رسول الله صلى الله عليه وسلم أخذها فأنزل الله كان لنبي أن يغل ‏)‏ إلى آخر الآية ‏.‏ قال أبو عيسى هذا حديث حسن غريب وقد روى عبد السلام بن حرب عن خصيف نحو هذا وروى بعضهم هذا الحديث عن خصيف عن مقسم ولم يذكر فيه عن ابن عباس ‏.‏",
      "text_en": " Narrated Khusaif:                     from Miqsam that Ibn 'Abbas said: \"This Ayah: It is not for a Prophet to illegally take a part of the booty... (3:161) was revealed about a red robe that was missing from the Day of Badr. Some of the people said: 'Perhaps the Messenger of Allah (ﷺ) took it.' So Allah, Blessed and Most High, revealed: It is not for a Prophet to illegally take a part of the booty... until the end of the Ayah.\"",
      "chain": [
        "30367",
        "20256",
        "19908",
        "11725"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا سعيد بن سليمان، حدثنا عباد بن العوام، حدثنا سفيان بن حسين، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال بعث النبي صلى الله عليه وسلم أبا بكر وأمره أن ينادي بهؤلاء الكلمات ثم أتبعه عليا فبينا أبو بكر في بعض الطريق إذ سمع رغاء ناقة رسول الله صلى الله عليه وسلم القصواء فخرج أبو بكر فزعا فظن أنه رسول الله صلى الله عليه وسلم فإذا هو علي فدفع إليه كتاب رسول الله صلى الله عليه وسلم وأمر عليا أن ينادي بهؤلاء الكلمات فانطلقا فحجا فقام علي أيام التشريق فنادى ذمة الله ورسوله بريئة من كل مشرك فسيحوا في الأرض أربعة أشهر ولا يحجن بعد العام مشرك ولا يطوفن بالبيت عريان ولا يدخل الجنة إلا مؤمن وكان علي ينادي فإذا عيي قام أبو بكر فنادى بها ‏.‏ قال أبو عيسى وهذا حديث حسن غريب من هذا الوجه من حديث ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) dispatched Abu Bakr ordering him to announce these statements. Then 'Ali followed him. When Abu Bakr was at a particular road, he heard the heavy breathing of Al-Qiswa, the she camel of the Messenger of Allah (ﷺ), so Abu Bakr appeared frightened because he thought that it was the Messenger of Allah (ﷺ). When he saw that it was 'Ali, he gave him the letter of the Messenger of Allah (ﷺ), and told 'Ali to announce the statements. So he left to perform Hajj. During the day of At-Tashriq 'Ali stood to announce: 'The protection of Allah and His Messenger is removed from every idolater. So travel in the land for four months. There is to be no idolater performing Hajj after this year, nor may anyone perform Tawaf around the House while naked. None shall enter Paradise but a believer.' 'Ali was making the announcement, so when he became exhausted Abu Bakr would announce it.\"",
      "chain": [
        "34188",
        "30252",
        "20431",
        "20655",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "291",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن شعبة، عن الحكم، عن عبد الحميد، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الرجل يأتي امرأته وهي حائض يتصدق بدينار أو بنصف دينار ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas from the Prophet (ﷺ) concerning a man who has had intercourse while she was menstruating:                      \"Let him give a Dinar or half a Dinar in charity.\"",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11069",
        "11703",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "370",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن شعبة، قال حدثني الحكم، عن عبد الحميد، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم في الرجل يأتي امرأته وهي حائض يتصدق بدينار أو بنصف دينار ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas from the Prophet (ﷺ) concerning a man who has had intercourse with his wife while she was menstruating:                      \"Let him give a Dinar or half a Dinar in charity.\"",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11069",
        "11703",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة، قال حدثنا جرير، عن منصور، عن الحكم، عن مقسم، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بخمس وبسبع لا يفصل بينها بسلام ولا بكلام ‏.‏",
      "text_en": " Mansur reported from Al-Hakam, from Miqsam, that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with five and seven rak'ahs which he did not separate with any taslim nor talk.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11069",
        "11725",
        "56"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله، عن إسرائيل، عن منصور، عن الحكم، عن مقسم، عن ابن عباس، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بسبع أو بخمس ولا يفصل بينهن بتسليم ‏.‏",
      "text_en": " Mansur reported from Al-Hakam, from Miqsam, from Ibn 'Abbas that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with seven or five (rak'ahs), not separating between them with the taslim.\"",
      "chain": [
        "30475",
        "11201",
        "20311",
        "11067",
        "11069",
        "11725",
        "17",
        "56"
      ]
    },
    {
      "hadith_no": "1716",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن يزيد، قال حدثنا سفيان بن الحسين، عن الحكم، عن مقسم، قال الوتر سبع فلا أقل من خمس فذكرت ذلك لإبراهيم فقال عمن ذكره قلت لا أدري ‏.‏ قال الحكم فحججت فلقيت مقسما فقلت له عمن قال عن الثقة عن عائشة وعن ميمونة ‏.‏",
      "text_en": " Sufyan bin Al-Husain narrated from Al-Hakam that Miqsam said:                     \"Witr is seven and no less than five.\" I mentioned that to Ibrahim and he said: \"From whom did he quote that?\" I said: \"I do not know.\" Al-Hakam said: \"Then I performed Hajj and I met Miqsam and said to him: 'From whom (did you narrate that)?' He said: 'From the trustworthy one, from Aishah and from Maimunah.'\"",
      "chain": [
        "34188",
        "20472",
        "11069",
        "11725",
        "53"
      ]
    },
    {
      "hadith_no": "2287",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا سويد، قال أخبرنا عبد الله، عن شعبة، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج في رمضان فصام حتى أتى قديدا ثم أتي بقدح من لبن فشرب وأفطر هو وأصحابه ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet went out in Ramadan and fasted until he came to Qudaid, then a cup of milk was brought to him and he drank and broke his fast; he and his Companions.",
      "chain": [
        "30514",
        "20025",
        "20020",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2289",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال أنبأنا الحسن بن عيسى، قال أنبأنا ابن المبارك، قال أنبأنا شعبة، عن الحكم، عن مقسم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم صام في السفر حتى أتى قديدا ثم دعا بقدح من لبن فشرب فأفطر هو وأصحابه ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah fasted while traveling until he reached Qudaid, then he called for a cup of milk and drank and broke his fast; he and his Companions.",
      "chain": [
        "20025",
        "20020",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "683",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وابن أبي عدي، عن شعبة، عن الحكم، عن عبد الحميد، عن مقسم، عن ابن عباس، عن النبي  صلى الله عليه وسلم  في الذي يأتي امرأته وهي حائض قال ‏\"‏ يتصدق بدينار أو بنصف دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Prophet said concerning one who has intercourse with a woman when she is menstruating: \"Let him give a Dinar or half a Dinar in charity.\"",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20276",
        "20020",
        "11069",
        "11703",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا أبو الأحوص، عن عبد الكريم، عن مقسم، عن ابن عباس، قال كان الرجل إذا وقع على امرأته وهي حائض أمره النبي  صلى الله عليه وسلم  أن يتصدق بنصف دينار ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"If a man had intercourse with his wife while she was menstruating, the Prophet commanded him to give half a Dinar in charity.\"",
      "chain": [
        "20327",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1248",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حميد بن عبد الرحمن، عن زهير، عن منصور، عن الحكم، عن مقسم، عن أم سلمة، قالت كان رسول الله  صلى الله عليه وسلم  يوتر بسبع أو بخمس لا يفصل بينهن بتسليم ولا كلام ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)usedto pray Witr with seven or five Rak’ah, and he would not saySalamor speak in between them.”",
      "chain": [
        "30201",
        "10561",
        "20321",
        "11067",
        "11069",
        "11725",
        "56"
      ]
    },
    {
      "hadith_no": "1538",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن الحكم، عن مقسم، عن ابن عباس، قال كفن رسول الله  صلى الله عليه وسلم  في ثلاثة أثواب قميصه الذي قبض فيه وحلة نجرانية ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)wasshrouded in three garments: The shirt in which he died, and aNajraniHullah.",
      "chain": [
        "38409",
        "20102",
        "10844",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا زيد بن الحباب، حدثنا إبراهيم بن عثمان، عن الحكم، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قرأ على الجنازة بفاتحة الكتاب ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) recited theOpeningof the Book (Al-Fatihah) in the funeral prayer.",
      "chain": [
        "30242",
        "20650",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1578",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا داود بن شبيب الباهلي، حدثنا إبراهيم بن عثمان، حدثنا الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال لما مات إبراهيم ابن رسول الله  صلى الله عليه وسلم  صلى عليه رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ إن له مرضعا في الجنة ولو عاش لكان صديقا نبيا ‏.‏ ولو عاش لعتقت أخواله القبط وما استرق قبطي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Then Ibrahim the son of theMessenger of Allah (ﷺ) died, the Messenger of Allah (ﷺ) prayedandsaid: ‘He has a wet-nurse in Paradise, and if he had lived hewouldhave been a Siddiq and a Prophet. If he had lived his maternaluncles,the Egyptians, would have been set free and no Egyptian wouldeverhave been enslaved.’”",
      "chain": [
        "30148",
        "20228",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو بكر بن عياش، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، قال أتي بهم رسول الله  صلى الله عليه وسلم  يوم أحد فجعل يصلي على عشرة عشرة وحمزة هو كما هو يرفعون وهو كما هو موضوع ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “They (the martyrs) werebroughtto the Messenger of Allah (ﷺ) on the Day of Uhud, and hestarted tooffer the funeral prayer for them, ten by ten. Hamzah laywhere helay, and they were taken away but he was left where he was.”",
      "chain": [
        "30212",
        "20373",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1752",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا محمد بن فضيل، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، قال احتجم رسول الله  صلى الله عليه وسلم  وهو صائم محرم ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: “The Messenger of Allah (ﷺ) had cupping done when he wasfasting and in Ihram.”",
      "chain": [
        "38409",
        "20356",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا عمر بن أيوب، عن جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  حين افتتح خيبر اشترط عليهم أن له الأرض وكل صفراء وبيضاء ‏.‏ يعني الذهب والفضة ‏.‏ وقال له أهل خيبر نحن أعلم بالأرض فأعطناها على أن نعملها ويكون لنا نصف الثمرة ولكم نصفها ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم ابن رواحة فحزر النخل وهو الذي يدعونه أهل المدينة الخرص فقال في ذا كذا وكذا ‏.‏ فقالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا أحزر النخل وأعطيكم نصف الذي قلت ‏.‏ قال فقالوا هذا الحق وبه تقوم السماء والأرض ‏.‏ فقالوا قد رضينا أن نأخذ بالذي قلت ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     when the Prophet conquered Khaibar, he stipulated that the land, and all the yellow and white, meaning gold and silver belonged to him. The people of Khaibar said to him: “We know the land better, so give it to us so that we may work the land, and you will have half of its produce and we will have half.” He maintained that, he gave it to them on that basis. When the time for the date harvest came, he sent Ibn Rawahah to them. He assesses the date palms, and he said: “For this tree, such and such (amount).” They said: “You are demanding too much of us, O Ibn Rawahah!” He said: “This is my assessment and I will give you half of what I say.” They said: “This is fair, and fairness is what haven and earth are based on.” They said: “We Agree to take (accept) what you say.”",
      "chain": [
        "35154",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2562",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا هشيم، عن ابن أبي ليلى، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أعطى خيبر أهلها على النصف نخلها وأرضها ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “When the Messenger of Allah (ﷺ) gave Khaibar to its people in return of its palm trees and land.",
      "chain": [
        "38108",
        "20468",
        "11196",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الحجاج، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  إذا رمى جمرة العقبة مضى ولم يقف ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “When the Messenger of Allah(ﷺ)had stoned ‘Aqabah Pillar, he would continue on, and would notstaythere.”",
      "chain": [
        "30547",
        "20345",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3150",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن الحكم، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  رمى الجمرة على راحلته ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) stoned thePillarfrom atop his mount.",
      "chain": [
        "30201",
        "20326",
        "20219",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3170",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا إبراهيم بن عثمان بن أبي شيبة أبو شيبة، عن الحكم، عن مقسم، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  كان يرمي الجمار إذا زالت الشمس قدر ما إذا فرغ من رميه صلى الظهر ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)used tostone the Pillars when the sun had passed its zenith, to theextentthat, as soon as he finished stoning them, he would pray Zuhr.",
      "chain": [
        "35021",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  احتجم وهو صائم محرم ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) was treatedwithcupping when he was fasting and in the state of Ihram.",
      "chain": [
        "30269",
        "20005",
        "10844",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3219",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا سفيان، عن ابن أبي ليلى، عن الحكم، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  أهدى في بدنه جملا لأبي جهل برته من فضة ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that among the sacrificial animalstheProphet (ﷺ) included a (male) camel belonging to Abu Jahl, whichhad a silver nose ring.",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11196",
        "11069",
        "11725",
        "17"
      ]
    }
  ],
  "total_hadiths": 48
}