{
  "id": "11722",
  "name": "Malik bin Yakhamar مالك بن يخامر",
  "full_name": "Malik bin Yakhamar مالك بن يخامر",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ خ  4  -  صحبة ]"
    ],
    "tags": [
      "Makhdaram",
      "al-Saksaki",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "25579",
      "name": "'Abdur Rahman bin Malik bin Ykhamr عبد الرحمن بن مالك",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "29531",
      "name": "'Abdullah bin Malik bin Ykhamr عبد الله بن مالك بن يخامر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "21624",
      "name": "'Amr bin Malik bin Ykhamr عمرو بن مالك",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "764",
      "name": "'Umayr/'Amr bin 'Auf ( عمير بن عوف مولى سهيل بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2605",
      "name": "'Abdullah bin al-Sa'di ( عبد الله بن السعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "25579",
      "name": "'Abdur Rahman bin Malik bin Ykhamr عبد الرحمن بن مالك",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "29531",
      "name": "'Abdullah bin Malik bin Ykhamr عبد الله بن مالك بن يخامر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18414",
      "name": "Sharyh bin 'Ubaid شريح بن عبيد بن شريح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10880",
      "name": "Sulaiman bin Musa al-Ashdaq سليمان بن موسى الأموي الأشدق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11415",
      "name": "'Umayr bin Han'i al-Ansi عمير بن هانئ العنسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4294",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس العنبري، حدثنا هاشم بن القاسم، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن مالك بن يخامر، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عمران بيت المقدس خراب يثرب وخراب يثرب خروج الملحمة وخروج الملحمة فتح قسطنطينية وفتح القسطنطينية خروج الدجال ‏\"‏ ‏.‏ ثم ضرب بيده على فخذ الذي حدث - أو منكبه - ثم قال إن هذا لحق كما أنك ها هنا أو كما أنك قاعد ‏.‏ يعني معاذ بن جبل ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: The flourishing state of Jerusalem will be when Yathrib is in ruins, the ruined state of Yathrib will be when the great war comes, the outbreak of the great war will be at the conquest of Constantinople and the conquest of Constantinople when the Dajjal (Antichrist) comes forth. He (the Prophet) struck his thigh or his shoulder with his hand and said: This is as true as you are here or as you are sitting (meaning Mu'adh ibn Jabal).",
      "chain": [
        "30437",
        "20390",
        "20731",
        "11066",
        "4097",
        "11722",
        "32"
      ]
    },
    {
      "hadith_no": "1654",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا ابن جريج، عن سليمان بن موسى، عن مالك بن يخامر السكسكي، عن معاذ بن جبل، عن النبي صلى الله عليه وسلم قال ‏\"‏ من سأل الله القتل في سبيله صادقا من قلبه أعطاه الله أجر الشهيد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     That the Prophet (ﷺ) said: \"Whoever asks Allah to be killed in His cause sincerely from his heart, Allah shall give him the reward of martyrdom.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30242",
        "20229",
        "11070",
        "10880",
        "11722",
        "32"
      ]
    },
    {
      "hadith_no": "1657",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا ابن جريج، عن سليمان بن موسى، عن مالك بن يخامر، عن معاذ بن جبل، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قاتل في سبيل الله من رجل مسلم فواق ناقة وجبت له الجنة ومن جرح جرحا في سبيل الله أو نكب نكبة فإنها تجئ يوم القيامة كأغزر ما كانت لونها الزعفران وريحها كالمسك ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     That the Prophet (ﷺ) said: \"Whoever fought in the cause of Allah - a Muslim man - for the time it takes for two milkings of a camel, then Paradise is obligatory for him. And whoever suffered a wound in the cause of Allah, or he suffers from an injury, then he will come on the Day of Resurrection while (his blood will be) more copius that it ever was, its color the color of saffron, and its scent like that of musk.\"This Hadith is Sahih.",
      "chain": [
        "30242",
        "20229",
        "11070",
        "10880",
        "11722",
        "32"
      ]
    },
    {
      "hadith_no": "3141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يوسف بن سعيد، قال سمعت حجاجا، أنبأنا ابن جريج، قال حدثنا سليمان بن موسى، قال حدثنا مالك بن يخامر، أن معاذ بن جبل، حدثهم أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قاتل في سبيل الله عز وجل من رجل مسلم فواق ناقة وجبت له الجنة ومن سأل الله القتل من عند نفسه صادقا ثم مات أو قتل فله أجر شهيد ومن جرح جرحا في سبيل الله أو نكب نكبة فإنها تجيء يوم القيامة كأغزر ما كانت لونها كالزعفران وريحها كالمسك ومن جرح جرحا في سبيل الله فعليه طابع الشهداء ‏\"‏ ‏.‏",
      "text_en": " Mu'adh bin Jabal said that he heard the Prophet (ﷺ) say:                      \"Whoever fights in the cause of Allah, the Mighty and Sublime, for the length of time between two milkings of a she-camel, Paradise is guaranteed for him. Whoever asks Allah to be killed (in Jihad) sincerely, from his heart, then he dies or is killed, he will have the reward of a martyr. Whoever is wounded or injured in the cause of Allah, it will come on the Day of Resurrection bleeding the most it ever bled, but its color will be like saffron, and its fragrance will be like musk. Whoever is wounded in the cause of Allah, upon him is the seal of the martyrs.\"",
      "chain": [
        "20219",
        "11070",
        "10880",
        "11722",
        "32"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا بشر بن آدم، حدثنا الضحاك بن مخلد، حدثنا ابن جريج، حدثنا سليمان بن موسى، حدثنا مالك بن يخامر، حدثنا معاذ بن جبل، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من قاتل في سبيل الله عز وجل من رجل مسلم فواق ناقة وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Mu’adhbin Jabal narrated that he heard the Prophet (ﷺ) say:                      “AnyMuslimwho fights in the cause of Allah for the time between twomilkings ofa she-camel, he will be guaranteed Paradise.”",
      "chain": [
        "30125",
        "11070",
        "10880",
        "11722",
        "32"
      ]
    }
  ],
  "total_hadiths": 5
}