{
  "id": "11810",
  "name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
  "full_name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Fiqh",
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "Ally B.Haritha",
      "Client",
      "Madni",
      "Imam"
    ],
    "area_of_interest_display": [
      {
        "en": "Fiqh",
        "ar": "فقه",
        "ckb": "فیقهـ"
      },
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "Aws",
        "ar": "الأوس",
        "ckb": "ئەوس"
      },
      {
        "en": "Ally B.Haritha",
        "ar": "Ally B.Haritha",
        "ckb": "Ally B.Haritha"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "Madni",
        "ar": "Madni",
        "ckb": "Madni"
      },
      {
        "en": "Imam",
        "ar": "Imam",
        "ckb": "Imam"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "1924",
      "name": "Suwayd bin al-Nu'man ( سويد بن النعمان الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "1822",
      "name": "Sahl bin Abi Hathma ( سهل بن أبى حثمة الحارثى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "1920",
      "name": "Muhaysa bin Mas'ud ( محيصة بن مسعود الحارثي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11629",
      "name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "15671",
      "name": "Abu al-Rihal, 'Uqba bin 'Ubaid أبو الرحال الطائي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-209",
      "hadith_no": "209",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره‏.‏ أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهي أدنى خيبر  فصلى العصر، ثم دعا بالأزواد، فلم يؤت إلا بالسويق، فأمر به فثري، فأكل رسول الله صلى الله عليه وسلم وأكلنا، ثم قام إلى المغرب، فمضمض ومضمضنا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Al-Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached Sahba, a place near Khaibar, where Allah's Apostle offered the `Asr prayer and asked for food. Nothing but saweeq  was brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet got up for the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he then prayed without repeating the ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-215",
      "hadith_no": "215",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد بن مخلد، قال حدثنا سليمان، قال حدثني يحيى بن سعيد، قال أخبرني بشير بن يسار، قال أخبرني سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كنا بالصهباء، صلى لنا رسول الله صلى الله عليه وسلم العصر، فلما صلى دعا بالأطعمة، فلم يؤت إلا بالسويق، فأكلنا وشربنا، ثم قام النبي صلى الله عليه وسلم إلى المغرب فمضمض، ثم صلى لنا المغرب ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached As-Sahba' where Allah's Apostle led the `Asr prayer and asked for the food. Nothing but saweeq was brought and we ate it and drank (water). The Prophet got up for the (Maghrib) Prayer, rinsed his mouth with water and then led the prayer without repeating the ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30463",
        "20160",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-724",
      "hadith_no": "724",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن أسد، قال أخبرنا الفضل بن موسى، قال أخبرنا سعيد بن عبيد الطائي، عن بشير بن يسار الأنصاري، عن أنس بن مالك، أنه قدم المدينة فقيل له ما أنكرت منا منذ يوم عهدت رسول الله صلى الله عليه وسلم قال ما أنكرت شيئا إلا أنكم لا تقيمون الصفوف‏.‏ وقال عقبة بن عبيد عن بشير بن يسار قدم علينا أنس بن مالك المدينة بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I arrived at Medina and was asked whether I found any change since the days of Allah's Apostle. I said, \"I have not found any change except that you do not stand in alignment in your prayers.\"",
      "usc_msa_ref": "691",
      "chain": [
        "30176",
        "20452",
        "11629",
        "11810",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2191",
      "hadith_no": "2191",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال قال يحيى بن سعيد سمعت بشيرا، قال سمعت سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر، ورخص في العرية أن تباع بخرصها يأكلها أهلها رطبا‏.‏ وقال سفيان مرة أخرى إلا أنه رخص في العرية يبيعها أهلها بخرصها، يأكلونها رطبا‏.‏ قال هو سواء‏.‏ قال سفيان فقلت ليحيى وأنا غلام إن أهل مكة يقولون إن النبي صلى الله عليه وسلم رخص في بيع العرايا‏.‏ فقال وما يدري أهل مكة قلت إنهم يروونه عن جابر‏.‏ فسكت‏.‏ قال سفيان إنما أردت أن جابرا من أهل المدينة‏.‏ قيل لسفيان وليس فيه نهى عن بيع الثمر حتى يبدو صلاحه قال لا‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     Allah's Apostle forbade the selling of fruits (fresh dates) for dried dates but allowed the sale of fruits on the 'Araya by estimation and their new owners might eat their dates fresh. Sufyan (in another narration) said, \"I told Yahya (a sub-narrator) when I was a mere boy, 'Meccans say that the Prophet allowed them the sale of the fruits on 'Araya by estimation.' Yahya asked, 'How do the Meccans know about it?' I replied, 'They narrated it (from the Prophet ) through Jabir.' On that, Yahya kept quiet.\" Sufyan said, \"I meant that Jabir belonged to Medina.\" Sufyan was asked whether in Jabir's narration there was any prohibition of selling fruits before their benefit is evident (i.e. no dangers of being spoilt or blighted). He replied that there was none.",
      "usc_msa_ref": "396",
      "chain": [
        "30026",
        "20005",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2383",
      "hadith_no": "2383",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا زكرياء بن يحيى، أخبرنا أبو أسامة، قال أخبرني الوليد بن كثير، قال أخبرني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر، إلا أصحاب العرايا فإنه أذن لهم‏.‏ قال أبو عبد الله وقال ابن إسحاق حدثني بشير مثله‏.‏",
      "text_en": " Narrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:                     Allah's Apostle forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale.",
      "usc_msa_ref": "569",
      "chain": [
        "30193",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2702",
      "hadith_no": "2702",
      "source": "Sahih Bukhari",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid went to Khaibar when it had a peace treaty (with the Muslims).",
      "usc_msa_ref": "865",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2981",
      "hadith_no": "2981",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال أخبرني بشير بن يسار، أن سويد بن النعمان  رضى الله عنه  أخبره أنه، خرج مع النبي صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهى من خيبر وهى أدنى خيبر  فصلوا العصر، فدعا النبي صلى الله عليه وسلم بالأطعمة، فلم يؤت النبي صلى الله عليه وسلم إلا بسويق، فلكنا فأكلنا وشربنا، ثم قام النبي صلى الله عليه وسلم فمضمض ومضمضنا، وصلينا‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     That he went out in the company o; the Prophet during the year of Khaibar (campaign till they reached a place called As-Sahba', the lower part of Khaibar. They offered the `Asr prayer (there) and the Prophet asked for the food. Nothing but Sawiq was brought to the Prophet. So, they chewed it and ate it and drank water. After that the Prophet got up, washed his mouth, and they too washed their mouths and then offered the prayer.",
      "usc_msa_ref": "224",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3173",
      "hadith_no": "3173",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا مسدد، حدثنا بشر  هو ابن المفضل  حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح، فتفرقا، فأتى محيصة إلى عبد الله بن سهل وهو يتشحط في دم قتيلا، فدفنه ثم قدم المدينة، فانطلق عبد الرحمن بن سهل ومحيصة وحويصة ابنا مسعود إلى النبي صلى الله عليه وسلم، فذهب عبد الرحمن يتكلم فقال ‏\"‏ كبر كبر ‏\"‏‏.‏ وهو أحدث القوم، فسكت فتكلما فقال ‏\"‏ أتحلفون وتستحقون قاتلكم أو صاحبكم ‏\"‏‏.‏ قالوا وكيف نحلف ولم نشهد ولم نر قال ‏\"‏ فتبريكم يهود بخمسين ‏\"‏‏.‏ فقالوا كيف نأخذ أيمان قوم كفار فعقله النبي صلى الله عليه وسلم من عنده‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid set out to Khaibar, the inhabitants of which had a peace treaty with the Muslims at that time. They parted and later on Muhaiyisa came upon `Abdullah bin Sah! and found him murdered agitating in his blood. He buried him and returned to Medina. `Abdur Rahman bin Sahl, Muhaiyisa and Huwaiuisa, the sons of Mas`ud came to the Prophet and `Abdur Rahman intended to talk, but the Prophet said (to him), \"Let the eldest of you speak.\" as `Abdur-Rahman was the youngest:. `Abdur-Rahman kept silent and the other two spoke. The Prophet said, \"If you swear as to who has committed the murder, you will have the right to take your right from the murderer.\" They said, \"How should we swear if we did not witness the murder or see the murderer?\" The Prophet said, \"Then the Jews can clear themselves from the charge by taking Alaska (an oath taken by men that it was not they who committed the murder).\" The!y said, \"How should we believe in the oaths of infidels?\" So, the Prophet himself paid the blood money (of `Abdullah). (See Hadith No. 36 Vol. 9.)",
      "usc_msa_ref": "398",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4226",
      "hadith_no": "4226",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن يحيى بن سعيد، عن بشير بن يسار، عن سويد بن النعمان  وكان من أصحاب الشجرة  كان رسول الله صلى الله عليه وسلم وأصحابه أتوا بسويق فلاكوه‏.‏ تابعه معاذ عن شعبة‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     who was one of those who witnessed (the Pledge of allegiance beneath) the Tree: Allah's Apostle and his companions were given Sawiq and they chewed it.",
      "usc_msa_ref": "492",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4244",
      "hadith_no": "4244",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن بشير بن يسار، أن سويد بن النعمان، أخبره أنه، خرج مع النبي صلى الله عليه وسلم عام خيبر، حتى إذا كنا بالصهباء  وهى من أدنى خيبر  صلى العصر، ثم دعا بالأزواد فلم يؤت إلا بالسويق، فأمر به فثري، فأكل وأكلنا، ثم قام إلى المغرب، فمضمض ومضمضنا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     I went out in the company of the Prophet in the year of Khaibar, and when we reached As Sahba' which is the lower part of Khaibar, the Prophet offered the `Asr prayer and then asked the people to collect the journey food. Nothing was brought but Sawiq which the Prophet ordered to be moistened with water, and then he ate it and we also ate it. Then he got up to offer the Maghrib prayer. He washed his mouth, and we too washed our mouths, and then he offered the prayer without repeating his abulution.",
      "usc_msa_ref": "508",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5438",
      "hadith_no": "5438",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال يحيى بن سعيد سمعت بشير بن يسار، يقول حدثنا سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر، فلما كنا بالصهباء  قال يحيى وهى من خيبر على روحة  دعا رسول الله صلى الله عليه وسلم بطعام، فما أتي إلا بسويق، فلكناه فأكلنا منه، ثم دعا بماء فمضمض ومضمضنا، فصلى بنا المغرب ولم يتوضأ‏.‏ قال سفيان سمعته منه عودا وبدءا‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     We went out with Allah's Apostle to Khaibar, and when we were at As-Sahba', (Yahya, a sub-narrator said, \"As-Sahba' is a place at a distance of one day's journey to Khaibar).\" Allah's Apostle asked the people to bring their food, but there was nothing with the people except Sawiq. So we all chewed and ate of it. Then the Prophet asked for some water and he rinsed his mouth, and we too, rinsed our mouths. Then he led us in the Maghrib prayer without performing ablution (again).",
      "usc_msa_ref": "296",
      "chain": [
        "30026",
        "20005",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5444",
      "hadith_no": "5444",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى، عن بشير بن يسار، عن سويد بن النعمان، أنه أخبره أنهم، كانوا مع النبي صلى الله عليه وسلم بالصهباء  وهى على روحة من خيبر  فحضرت الصلاة، فدعا بطعام فلم يجده إلا سويقا، فلاك منه فلكنا معه، ثم دعا بماء فمضمض، ثم صلى وصلينا، ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     that while they were with the Prophet at As-Sahba' which was at a distance of one day's journey from Khaibar the prayer became due, and the Prophet asked the people for food but there was nothing with the people except Sawiq. He ate of it and we ate along with him, and then he asked for water and rinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the Prophet did not perform ablution (again after eating the Sawiq.).",
      "usc_msa_ref": "302",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5510",
      "hadith_no": "5510",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي، حدثنا سفيان، سمعت يحيى بن سعيد، عن بشير بن يسار، عن سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر، فلما كنا بالصهباء دعا بطعام فما أتي إلا بسويق، فأكلنا فقام إلى الصلاة، فتمضمض ومضمضنا‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "5",
        "20005",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5511",
      "hadith_no": "5511",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "قال يحيى سمعت بشيرا، يقول حدثنا سويد، خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر، فلما كنا بالصهباء  قال يحيى وهى من خيبر على روحة  دعا بطعام فما أتي إلا بسويق، فلكناه فأكلنا معه، ثم دعا بماء فمضمض ومضمضنا معه، ثم صلى بنا المغرب ولم يتوضأ‏.‏ وقال سفيان كأنك تسمعه من يحيى‏.‏",
      "text_en": " Narrated Suwaid bin An Nu`man:                     We went out with Allah's Apostle to Khaibar, and when we reached As-Sahba', the Prophet asked for food, and he was offered nothing but Sawiq. We ate, and then Allah's Apostle stood up for the prayer. He rinsed his mouth with water, and we too, rinsed our mouths. Narrated Suwaid; We went out with Allah's Apostle to Khaibar. and when we reached As-Sahba', which (Yahya says) is one day' journey from Khaibar, the Prophet asked for food, and he was offered nothing but Sawiq which we chewed and ate. Then the Prophet asked for water and rinsed his mouth, and we too, rinsed our mouths along with him. He then led us in the Maghrib prayer without performing ablution again.",
      "usc_msa_ref": "365",
      "chain": [
        "30020",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6212",
      "hadith_no": "6212",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، هو ابن زيد  عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رافع بن خديج، وسهل بن أبي حثمة، أنهما حدثاه أن عبد الله بن سهل ومحيصة بن مسعود أتيا خيبر فتفرقا في النخل، فقتل عبد الله بن سهل، فجاء عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى النبي صلى الله عليه وسلم فتكلموا في أمر صاحبهم فبدأ عبد الرحمن، وكان أصغر القوم فقال النبي صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏‏.‏  قال يحيى ليلي الكلام الأكبر  فتكلموا في أمر صاحبهم فقال النبي صلى الله عليه وسلم ‏\"‏ أتستحقون قتيلكم  أو قال صاحبكم  بأيمان خمسين منكم ‏\"‏‏.‏ قالوا يا رسول الله أمر لم نره‏.‏ قال ‏\"‏ فتبرئكم يهود في أيمان خمسين منهم ‏\"‏‏.‏ قالوا يا رسول الله قوم كفار‏.‏ فوداهم رسول الله صلى الله عليه وسلم من قبله‏.‏ قال سهل فأدركت ناقة من تلك الإبل، فدخلت مربدا لهم فركضتني برجلها‏.‏",
      "text_en": " Narrated Rafi` bin Khadij and Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud went to Khaibar and they dispersed in the gardens of the date-palm trees. `Abdullah bin Sahl was murdered. Then `Abdur-Rahman bin Sahl, Huwaiyisa and Muhaiyisa, the two sons of Mas`ud, came to the Prophet and spoke about the case of their (murdered) friend. `Abdur-Rahman who was the youngest of them all, started talking. The Prophet said, \"Let the older (among you) speak first.\" So they spoke about the case of their (murdered) friend. The Prophet said, \"Will fifty of you take an oath whereby you will have the right to receive the blood money of your murdered man,\" (or said, \"..your companion\"). They said, \"O Allah's Apostle! The murder was a thing we did not witness.\" The Prophet said, \"Then the Jews will release you from the oath, if fifty of them (the Jews) should take an oath to contradict your claim.\" They said, \"O Allah's Apostle! They are disbelievers (and they will take a false oath).\" Then Allah's Apostle himself paid the blood money to them.",
      "usc_msa_ref": "164",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1986"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6213",
      "hadith_no": "6213",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "قال الليث حدثني يحيى، عن بشير، عن سهل، قال يحيى حسبت أنه قال مع رافع بن خديج، وقال ابن عيينة حدثنا يحيى عن بشير عن سهل وحده‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "20031",
        "11810",
        "399",
        "20005",
        "11449",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6983",
      "hadith_no": "6983",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو نعيم، حدثنا سعيد بن عبيد، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها، ووجدوا أحدهم قتيلا، وقالوا للذي وجد فيهم قتلتم صاحبنا‏.‏ قالوا ما قتلنا ولا علمنا قاتلا‏.‏ فانطلقوا إلى النبي صلى الله عليه وسلم فقالوا يا رسول الله انطلقنا إلى خيبر فوجدنا أحدنا قتيلا‏.‏ فقال ‏\"‏ الكبر الكبر ‏\"‏‏.‏ فقال لهم ‏\"‏ تأتون بالبينة على من قتله ‏\"‏‏.‏ قالوا ما لنا بينة‏.‏ قال ‏\"‏ فيحلفون ‏\"‏‏.‏ قالوا لا نرضى بأيمان اليهود‏.‏ فكره رسول الله صلى الله عليه وسلم أن يبطل دمه، فوداه مائة من إبل الصدقة‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     (a man from the Ansar) that a number of people from his tribe went to Khaibar and dispersed, and then they found one of them murdered. They said to the people with whom the corpse had been found, \"You have killed our companion!\" Those people said, \"Neither have we killed him, nor do we know his killer.\" The bereaved group went to the Prophet and said, \"O Allah's Apostle! We went to Khaibar and found one of us murdered.\" The Prophet said, \"Let the older among you come forward and speak.\" Then the Prophet said, to them, \"Bring your proof against the killer.\" They said \"We have no proof.\" The Prophet said, \"Then they (the defendants) will take an oath.\" They said, \"We do not accept the oaths of the Jews.\" Allah's Apostle did not like that the Blood-money of the killed one be lost without compensation, so he paid one-hundred camels out of the camels of Zakat (to the relatives of the deceased) as Diya (Blood-money).",
      "usc_msa_ref": "36",
      "chain": [
        "20348",
        "11629",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-3968",
      "hadith_no": "3968",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن مسلمة القعنبي، حدثنا سليمان، - يعني ابن بلال - عن يحيى، - وهو ابن سعيد - عن بشير بن يسار، عن بعض، أصحاب رسول الله صلى الله عليه وسلم من أهل دارهم منهم سهل بن أبي حثمة أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر وقال ‏\"‏ ذلك الربا تلك المزابنة ‏\"‏ ‏.‏ إلا أنه رخص في بيع العرية النخلة والنخلتين يأخذها أهل البيت بخرصها تمرا يأكلونها رطبا ‏.‏",
      "text_en": " Bashair b. Yasir reported on the authority of some of the Companions of Allah's Messenger (may peace be upon him) among the members of his family among whom one was Sahl b. Abu Hathma that Allah's Messenger (may peace be upon him) forbade buying of fresh dates against dry dates and that it is Riba and this is Muzabana, but he made an exemption of 'ariyya (donations) of a tree or two in which case the members of a family sell dry dates and buy fresh dates for eating them.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20160",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3969",
      "hadith_no": "3969",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا ابن رمح، أخبرنا الليث، عن يحيى، بن سعيد عن بشير بن يسار، عن أصحاب، رسول الله صلى الله عليه وسلم أنهم قالوا رخص رسول الله صلى الله عليه وسلم في بيع العرية بخرصها تمرا ‏.‏",
      "text_en": " Bushair b. Yasar reported on the authority of some of the Companion of Allah's Messenger (may peace be upon him) that he exempted the transactions, of 'ariyya (from the direct exchange of one kind) after measuring the dry dates (in exchange for fresh dates).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3970",
      "hadith_no": "3970",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا محمد بن المثنى، وإسحاق بن إبراهيم، وابن أبي عمر، جميعا عن الثقفي، قال سمعت يحيى بن سعيد، يقول أخبرني بشير بن يسار، عن بعض، أصحاب رسول الله صلى الله عليه وسلم من أهل داره أن رسول الله صلى الله عليه وسلم نهى ‏.‏ فذكر بمثل حديث سليمان بن بلال عن يحيى غير أن إسحاق وابن المثنى جعلا مكان الربا الزبن وقال ابن أبي عمر الربا ‏.‏",
      "text_en": " Bushair b. Yasir reported on the authority of some of the Companions of Allah's Messenger (may peace be upon hinn) from among the members of his family that he forbade (the direct exchange of a commodity having different qualities) but with the change that Ishaq and Ibn al-Muthanna used the word Zabn in place ot Riba and Ibn Abu 'Umar used the word Riba (interest).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30123",
        "30421",
        "20031",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3971",
      "hadith_no": "3971",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه عمرو الناقد، وابن، نمير قالا حدثنا سفيان بن عيينة، عن يحيى بن، سعيد عن بشير بن يسار، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم نحو حديثهم ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Sahl b. Abu Hathma.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30212",
        "20005",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3972",
      "hadith_no": "3972",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحسن الحلواني، قالا حدثنا أبو أسامة، عن الوليد، بن كثير حدثني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة الثمر بالتمر إلا أصحاب العرايا فإنه قد أذن لهم ‏.‏",
      "text_en": " Sahl b. Abu Hathma reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, i. e. exchange of fresh dates with dry dates. except in case of those to whom donations of some trees have been made. It is for them that concession has been given.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "130115",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4434",
      "hadith_no": "4434",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يحيى، - وهو ابن سعيد - عن بشير، بن يسار عن سهل بن أبي حثمة، - قال يحيى وحسبت قال - وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا محيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم فذهب عبد الرحمن ليتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر ‏\"‏ ‏.‏ الكبر في السن فصمت فتكلم صاحباه وتكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم ‏\"‏ ‏.‏ أو ‏\"‏ قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏",
      "text_en": " Sahl b. Abu Hathma and Rafi' b. Khadij reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid went out and as they reached Khaibar they were separated. Then Muhayyisa found 'Abdullah b. Sahl having been killed. He buried him, and then came to Allah's Messenger (may peace be upon him). They were Huwayyisa b. Mas'ud and 'Abd al-Rahman b. Sahl, and he (the latter one) was the youngest of the people (those three who had come to seek an interview with the Holy Prophet) began to talk before his Companions (had spoken). Thereupon Allah's Messenger (may peace be upon him) said:                      The eldest one (eldest in regard to age should speak). So he kept quiet, and his companions (Muhayyisa and Huwayyisa) began to speak, and he ('Abd al Rahman) spoke along with them and they narrated to Allah's Messenger (may peace be upon him) the murder of 'Abdullah b. Sahl. Thereupon he said to them: Are you prepared to take fifty oaths so that you may be entitled (to blood-wit) of your companion (or your man who has murdered)? They said: How can we take an oath on a matter which we have not witnessed? He (the Holy Prophet) said: Then the Jews will exonerate themselves by fifty oaths. They said: How can we accept the oaths of people who are unbelievers? When Allah's Messenger (may peace be upon him) saw that, he himself paid his blood-wit.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4435",
      "hadith_no": "4435",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد، الله بن سهل انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن وابنا عمه حويصة ومحيصة إلى النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغر منهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر - أو قال - ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏",
      "text_en": " Sahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b. Sahl went towards Khaibar and they separated near the palm-trees. 'Abdullah b. Sahl was killed. They accused the Jews (for this act). And there came to Allah's Apostle (may peace be upon him) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (may peace be upon him) said:                      Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b. Sahl). Thereupon Allah's Messenger (may peace be upon him) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (may peace be upon him) paid the blood wit for him. Sahl said: As one day I entered the fold a she-camel amongst those camels hit me with its leg.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986",
        "1920"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4436",
      "hadith_no": "4436",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا القواريري، حدثنا بشر بن المفضل، حدثنا يحيى بن سعيد، عن بشير بن، يسار عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم ‏.‏ نحوه ‏.‏ وقال في حديثه فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏ ولم يقل في حديثه فركضتني ناقة ‏.‏",
      "text_en": " Sahl b. Abu Hathma has narrated this hadith through another chain of transmitters with a slight variation of words, but no mention has been made of the hitting by the she-camel.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20212",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4437",
      "hadith_no": "4437",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، - يعني الثقفي - جميعا عن يحيى بن سعيد، عن بشير بن يسار، عن سهل، بن أبي حثمة بنحو حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sahl b. Abu Hathma through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20005",
        "30170",
        "20259",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4438",
      "hadith_no": "4438",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان بن بلال، عن يحيى بن سعيد، عن بشير بن يسار، أن عبد الله بن سهل بن زيد، ومحيصة بن مسعود بن زيد الأنصاريين، ثم من بني حارثة خرجا إلى خيبر في زمان رسول الله صلى الله عليه وسلم وهي يومئذ صلح وأهلها يهود فتفرقا لحاجتهما فقتل عبد الله بن سهل فوجد في شربة مقتولا فدفنه صاحبه ثم أقبل إلى المدينة فمشى أخو المقتول عبد الرحمن بن سهل ومحيصة وحويصة فذكروا لرسول الله صلى الله عليه وسلم شأن عبد الله وحيث قتل فزعم بشير وهو يحدث عمن أدرك من أصحاب رسول الله صلى الله عليه وسلم أنه قال لهم ‏\"‏ تحلفون خمسين يمينا وتستحقون قاتلكم ‏\"‏ ‏.‏ أو ‏\"‏ صاحبكم ‏\"‏ ‏.‏ قالوا يا رسول الله ما شهدنا ولا حضرنا ‏.‏ فزعم أنه قال ‏\"‏ فتبرئكم يهود بخمسين ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نقبل أيمان قوم كفار فزعم بشير أن رسول الله صلى الله عليه وسلم عقله من عنده ‏.‏",
      "text_en": " Bushair b. Yasar reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid, both of them were Ansar belonging to the tribe of Banu Haritha, set out to Khaibar during the lifetime of Allah's Messenger (may peace be upon him). There was peace during those days and (this place) was inhabited by the Jews. They parted company for their (respective) needs. 'Abdullab b. Sahl was killed, and his dead body was found in a tank. His companion (Muhayyisa) buried him and came to Medina, and the brothers of the slain 'Abd al-Rahman b. Sahl. and Muhayyisa and Huwayyisa told Allah's Messenger (may peace be upon him) the case of 'Abdullah and the place where he had been murdered. Bushair reported on the authority of one who had seen Allah's Messenger (may peace be upon him) that he had said to them:                      You take fifty oaths and you are entitled to blood-wit of (one) slain among you (or your companion). They said: Messenger of Allah, we neither saw (with our own eyes this murder) nor were we present there. Thereupon (Allah's Messenger is reported to have said): Then the Jews will exonerate themselves by taking fifty oaths. They said: Allah's Messenger, how can we accept the oath of unbelieving people? Bushair said that Allah's Messenger (may peace be upon him) paid the blood-wit himself.",
      "usc_msa_ref": "",
      "chain": [
        "20160",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4439",
      "hadith_no": "4439",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن يحيى بن سعيد، عن بشير بن يسار، أن رجلا، من الأنصار من بني حارثة يقال له عبد الله بن سهل بن زيد انطلق هو وابن عم له يقال له محيصة بن مسعود بن زيد ‏.‏ وساق الحديث بنحو حديث الليث إلى قوله فوداه رسول الله صلى الله عليه وسلم من عنده ‏.‏ قال يحيى فحدثني بشير بن يسار قال أخبرني سهل بن أبي حثمة قال لقد ركضتني فريضة من تلك الفرائض بالمربد ‏.‏",
      "text_en": " Bushair b. Yasar reported that a person from the Ansar belonging to the tribe of Banu Haritha who was called 'Abdullah b. Sahl b. Zaid set out and the son of his uncle called Muhayyisa b. Mas'ud b. Zaid, the rest of the hadith is the same up to the words:                     \" Allah's Messenger (may peace be upon him) paid the blood-wit himself.\" Bushair b. Yasar reported that Sahl b. Abu Hathma said: One camel amongst the camels paid as blood-wit kicked me while I was in the (camel) enclosure.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4440",
      "hadith_no": "4440",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سعيد بن عبيد، حدثنا بشير، بن يسار الأنصاري عن سهل بن أبي حثمة الأنصاري، أنه أخبره أن نفرا منهم انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا ‏.‏ وساق الحديث وقال فيه فكره رسول الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏",
      "text_en": " Bushair b. Yasar al-Ansari reported on the authority of Sahl b. Abu Hathma al-Ansari that some men (of his tribe went to Khaibar, and they were separated from one another, and they found one of them slain. The rest of the hadith is the same. And it was said in this connection:                      Allah's Messenger (may peace be him) did not approve of his blood go waste. He paid blood-wit of one hundred camels of Sadaqa.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "11629",
        "11810"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1638",
      "hadith_no": "1638",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن محمد بن الصباح، حدثنا أبو نعيم، حدثني سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن النبي صلى الله عليه وسلم وداه بمائة من إبل الصدقة - يعني دية الأنصاري الذي قتل بخيبر ‏.‏",
      "text_en": " Basheer b. Yasar said that a man from the Ansar called Sahi b. abu-Hatmah told him that Messenger of Allah (May peace be upon him) gave one Hundred camels to him a blood-wit from among the camels of sadaqah, i.e a blood-wit for the Ansari who was killed at Khaibar.",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "20348",
        "11629",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3010",
      "hadith_no": "3010",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا الربيع بن سليمان المؤذن، حدثنا أسد بن موسى، حدثنا يحيى بن زكريا، حدثني سفيان، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال قسم رسول الله صلى الله عليه وسلم خيبر نصفين نصفا لنوائبه وحاجته ونصفا بين المسلمين قسمها بينهم على ثمانية عشر سهما ‏.‏",
      "text_en": " Sahl bin Abi Hathmah said “The Apostle of Allaah(ﷺ) divide Khaibar into two halves. One half was reserved for his emergency and needs, the other half was meant for the Muslims. He divided among them into eighteen portions.”",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "28040",
        "20005",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3011",
      "hadith_no": "3011",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي بن الأسود، أن يحيى بن آدم، حدثهم عن أبي شهاب، عن يحيى بن سعيد، عن بشير بن يسار، أنه سمع نفرا، من أصحاب النبي صلى الله عليه وسلم قالوا فذكر هذا الحديث قال فكان النصف سهام المسلمين وسهم رسول الله صلى الله عليه وسلم وعزل النصف للمسلمين لما ينوبه من الأمور والنوائب ‏.‏",
      "text_en": " Bashir bin Yasar said that he heard a number of the Companions of the Prophet (ﷺ) say. He then narrated the tradition (mentioned above). He said “One half comprised the portions of the Muslims and the portion of the Apostle of Allaah(ﷺ). He separated the other half for the Muslims for any calamity that befalls him and for emergent needs.”",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20364",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3012",
      "hadith_no": "3012",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي، حدثنا محمد بن فضيل، عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رجال، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم لما ظهر على خيبر قسمها على ستة وثلاثين سهما جمع كل سهم مائة سهم فكان لرسول الله صلى الله عليه وسلم وللمسلمين النصف من ذلك وعزل النصف الباقي لمن نزل به من الوفود والأمور ونوائب الناس ‏.‏",
      "text_en": " Narrated A Group of Companions of the Prophet:                     Bashir ibn Yasar, the client of the Ansar, reported on the authority of a group of the Companions of the Prophet (ﷺ): When the Messenger of Allah (ﷺ) conquered Khaybar, he divided it into thirty-six lots, each lot comprising one hundred portions. One half of it was for the Messenger of Allah (ﷺ) and for the Muslims; and he separated the remaining half for the deputations which came to him, other matters and emergent needs of the people.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20356",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3013",
      "hadith_no": "3013",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا أبو خالد، - يعني سليمان - عن يحيى بن سعيد، عن بشير بن يسار، قال لما أفاء الله على نبيه صلى الله عليه وسلم خيبر قسمها على ستة وثلاثين سهما جمع كل سهم مائة سهم فعزل نصفها لنوائبه وما ينزل به الوطيحة والكتيبة وما أحيز معهما وعزل النصف الآخر فقسمه بين المسلمين الشق والنطاة وما أحيز معهما وكان سهم رسول الله صلى الله عليه وسلم فيما أحيز معهما ‏.‏",
      "text_en": " Bashir bin Yasar said “When Allaah bestowed Khaibar on His Prophet (ﷺ) as fai’ (spoils), he divided it into thirty six lots. Each lot comprised one hundred portions. He separated its half for his emergent needs and whatever befalls him. Al Watih and Al Kutaibah and Al Salalim and whatever acquired with them. He separated the other half and he divided Al Shaqq and Nata’ and whatever acquired with them. The portion of the Apostle of Allaah(ﷺ) lay in the property acquired with them.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20031",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3014",
      "hadith_no": "3014",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن مسكين اليمامي، حدثنا يحيى بن حسان، حدثنا سليمان، - يعني ابن بلال - عن يحيى بن سعيد، عن بشير بن يسار، أن رسول الله صلى الله عليه وسلم لما أفاء الله عليه خيبر قسمها ستة وثلاثين سهما جمعا فعزل للمسلمين الشطر ثمانية عشر سهما يجمع كل سهم مائة النبي صلى الله عليه وسلم معهم له سهم كسهم أحدهم وعزل رسول الله صلى الله عليه وسلم ثمانية عشر سهما وهو الشطر لنوائبه وما ينزل به من أمر المسلمين فكان ذلك الوطيح والكتيبة والسلالم وتوابعها فلما صارت الأموال بيد النبي صلى الله عليه وسلم والمسلمين لم يكن لهم عمال يكفونهم عملها فدعا رسول الله صلى الله عليه وسلم اليهود فعاملهم ‏.‏",
      "text_en": " Narrated Bashir ibn Yasar:                     When Allah bestowed Khaybar on the Messenger of Allah (ﷺ) as fay' (spoils of war without fighting), he divided the whole into thirty six lots. He put aside a half, i.e. eighteen lots, for the Muslims. Each lot comprised one hundred shares, and the Prophet (ﷺ) was with them. He received a share like the share of one of them.  The Messenger of Allah (ﷺ) separated eighteen lots, that is, half, for his future needs and whatever befell the Muslims. These were al-Watih, al-Kutaybah, as-Salalim and their colleagues. When all this property came in the possession of the Prophet (ﷺ) and of the Muslims, they did not have sufficient labourers to work on it. The Messenger of Allah (ﷺ) called Jews and employed them on contract.",
      "usc_msa_ref": "",
      "chain": [
        "30275",
        "20300",
        "20160",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3363",
      "hadith_no": "3363",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن عيينة، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر ورخص في العرايا أن تباع بخرصها يأكلها أهلها رطبا ‏.‏",
      "text_en": " Narrated Sahl b. Abi Khathmah:                     The Messenger of Allah (ﷺ) forbade the sale of fruits for dried dates, but gave license regarding the 'araya for its sale on the basis of a calculation of their amount. But those who buy them can eat them when fresh.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20005",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4520",
      "hadith_no": "4520",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن عبيد، - المعنى - قالا حدثنا حماد بن زيد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد الله بن سهل، انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن بن سهل وابنا عمه حويصة ومحيصة فأتوا النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغرهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ أو قال ‏\"‏ ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال قال سهل دخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏ قال أبو داود رواه بشر بن المفضل ومالك عن يحيى بن سعيد قال فيه ‏\"‏ أتحلفون خمسين يمينا وتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ولم يذكر بشر دما وقال عبدة عن يحيى كما قال حماد ورواه ابن عيينة عن يحيى فبدأ بقوله ‏\"‏ تبرئكم يهود بخمسين يمينا يحلفون ‏\"‏ ‏.‏ ولم يذكر الاستحقاق قال أبو داود وهذا وهم من ابن عيينة ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah and Rafi' b. Khadij:                     Muhayyasah b. Mas'ud and 'Abd Allah b. Sahl came to Khaibar and parted (from each other) among palm trees. 'Abd Allah b. Sahl was killed. The Jews were blamed (for the murder). 'Abd al-Rahman b. Sahl and Huwayyasah and Muhayyasah, the sons of his uncle (Mas'ud) came to the Prophet (ﷺ). 'Abd al-Rahman, who was the youngest, spoke about his brother, but the Messenger of Allah (ﷺ) said to him: (Respect) the elder, (respect) the elder or he said: Let the eldest begin. They then spoke about their friend and the Messenger of Allah (ﷺ) said: Fifty of you should take oaths regarding a man from them (the Jews) and he should be entrusted (to him) with his rope (in his neck). They said: It is a matter which we did not see. How can we take oaths ? He said: The Jews exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah! they are a people who are infidels. So the Messenger of Allah (ﷺ) paid them bloodwit himself. Sahl said: Once I entered the resting place of their camels, and the she-camel struck me with her lef. Hammad said this or (something) similar to it.Abu Dawud said: Another version transmitted by Yahya b. Sa'id has: Would you swear fifty oaths and make you claim regarding your friend or your slain man ? Bishr, the transmitter, did mention blood. 'Abdah transmitted it from Yahya as transmitted by Hammad. Ibn 'Uyainah has also transmitted it from Yahya, and began with his words: The Jew will exonerate themselves by fifty oaths which they will swear. He did not mention the claim.Abu Dawud said: This is a misunderstanding on the part of Ibn 'Uyainah.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30213",
        "20022",
        "11062",
        "11810",
        "1822",
        "1986",
        "1920"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4523",
      "hadith_no": "4523",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا الحسن بن محمد بن الصباح الزعفراني، حدثنا أبو نعيم، حدثنا سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا فقالوا للذين وجدوه عندهم قتلتم صاحبنا فقالوا ما قتلناه ولا علمنا قاتلا ‏.‏ فانطلقنا إلى نبي الله صلى الله عليه وسلم قال فقال لهم ‏\"‏ تأتوني بالبينة على من قتل هذا ‏\"‏ ‏.‏ قالوا ما لنا بينة ‏.‏ قال ‏\"‏ فيحلفون لكم ‏\"‏ ‏.‏ قالوا لا نرضى بأيمان اليهود ‏.‏ فكره نبي الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏",
      "text_en": " Narrated Bashir b. Yasar:                     That a man of the Ansar called Sahl b. Abi Hathmah told him that some people of his tribe went to Khaibar and separated there. They found one of them slain. They said to those with whom they had found him: You have killed our friend. They replied: We did not kill him, nor do we know the slayer. We (the people of the slain) then went to the Prophet of Allah (ﷺ). He said to them: Bring proof against the one who has slain him. They replied: We have no proof. He said: Then they will take an oath for you. They said: We do not accept the oaths of the Jews. The Messenger of Allah (ﷺ) did not like no responsibility should be fixed for his blood. So he himself paid his bloodwit consisting of one hundred camels of sadaqah (i.e. camels sent to the Prophet as zakat).",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "20348",
        "11629",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1303",
      "hadith_no": "1303",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الحلواني الخلال، حدثنا أبو أسامة، عن الوليد بن كثير، حدثنا بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن بيع المزابنة الثمر بالتمر إلا لأصحاب العرايا فإنه قد أذن لهم وعن بيع العنب بالزبيب وعن كل ثمر بخرصه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Bushair bin Yasar, the freed slave of Banu Harithah:                     Rafi' bin Khadij and Sahl bin Abi Hathmah narrated to him that the Messenger of Allah (ﷺ) prohibited Al-Muzabanah sales, (buying) fruits with dried dates, except for those who practice Al-'Araya - for he permitted it for them - and from buying grapes with raisins, and from every fruit by its estimation.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20318",
        "11230115",
        "11810",
        "1986",
        "1822"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1422",
      "hadith_no": "1422",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال يحيى وحسبت عن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هناك ثم إن محيصة وجد عبد الله بن سهل قتيلا قد قتل فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم ذهب عبد الرحمن ليتكلم قبل صاحبيه قال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ فصمت وتكلم صاحباه ثم تكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏  حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، نحو هذا الحديث بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم في القسامة وقد رأى بعض فقهاء المدينة القود بالقسامة ‏.‏ وقال بعض أهل العلم من أهل الكوفة وغيرهم إن القسامة لا توجب القود وإنما توجب الدية ‏.‏ آخر أبواب الديات والحمد لله ‏.‏",
      "text_en": " Narrated Sahl bin Abi Hatamah:                     Yahya (one of the narrators) said: And I think it was from Rafi' bin Khadij - that 'Abdullah bin Sahl bin Zaid and Muhaiysah bin Mas'ud bin Zaid went out and when they reached Khaibar they separated while there. Then Muhayyisah found 'Abdullah bin Sahl murdered [so he buried him]. Then he went to the Messenger of Allah (ﷺ) along with Huwayyisah bin Mas'ud and Abdur-Rahman bin Sahl. The youngest of the people, Abdur-Rahman, went to speak ahead of his companions. The Messenger of Allah (ﷺ) said to him: \"Let the eldest of you speak.\" So he was silent and two companions spoke. So he conversed with them and they mentioned to the Messenger of Allah (ﷺ) about the murder of 'Abdullah bin Sahl. He said to them: \"If fifty of you can swear an oath then you will have the right against the murderer.\" They said: \"How can we take an oath when we did not witness it?\" He said: \"Then fifty of Jews can swear to clear the charge with you?\" They said: \"How could we accept the oaths of a disbelieving people?\" So when he saw that, the Messenger of Allah (ﷺ) paid the blood-money.\" (Another Chain) from Sahl bin Abi Hathman and Rafi' bin Khadij, and the meaning is similar to this Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-187",
      "hadith_no": "187",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر حتى إذا كانوا بالصهباء وهي من أدنى خيبر صلى العصر ثم دعا بالأزواد فلم يؤت إلا بالسويق فأمر به فثري فأكل وأكلنا ثم قام إلى المغرب فتمضمض وتمضمضنا ثم صلى ولم يتوضأ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11810",
        "1924"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3677",
      "hadith_no": "3677",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عامر، قال حدثنا شعبة، عن سعد، - يعني ابن إبراهيم - عن عروة، عن بشير، أنه نحل ابنه غلاما فأتى النبي صلى الله عليه وسلم فأراد أن يشهد النبي صلى الله عليه وسلم فقال ‏\"‏ أكل ولدك نحلته مثل ذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bashir that he gave his son a slave as a present, then he came to the Prophet and he wanted the Prophet to bear witness to that. He said:                      \"Have you given a similar present to all of your children?\" He said: \"No.\" He said: \"Then take (your present) back.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20443",
        "20020",
        "11063",
        "10511",
        "11810"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4397",
      "hadith_no": "4397",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن يحيى، ح وأنبأنا عمرو بن علي، قال حدثنا يحيى، عن يحيى بن سعيد، عن بشير بن يسار، عن أبي بردة بن نيار، أنه ذبح قبل النبي صلى الله عليه وسلم فأمره النبي صلى الله عليه وسلم أن يعيد ‏.‏ قال عندي عناق جذعة هي أحب إلى من مسنتين ‏.‏ قال ‏\"‏ اذبحها ‏\"‏ ‏.‏ في حديث عبيد الله فقال إني لا أجد إلا جذعة ‏.‏ فأمره أن يذبح ‏.‏",
      "text_en": " It was narrated from Abu Burdah bin Niyar that he slaughtered (his sacrifice) before the Prophet and the Prophet told him to repeat it. He said:                     \"I have a Jadh'ah she-goat that is dearer to me than two Muslinnahs.\"  He said: \"Sacrifice it,\" According to the Hadith of: Ubaidullah, he said: \"I cannot find anything but a Jadh'ah,\" and he told him to slaughter it. (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "20031",
        "30153",
        "20031",
        "11062",
        "11810",
        "1820"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4542",
      "hadith_no": "4542",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، عن يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، أن النبي صلى الله عليه وسلم نهى عن بيع الثمر حتى يبدو صلاحه ورخص في العرايا أن تباع بخرصها يأكلها أهلها رطبا ‏.‏",
      "text_en": " It was narrated from Sahl bin Abi Hathamah that the Prophet forbade selling fruits before their condition was known, but he granted a concession allowing 'Araya sales by estimate, so its people could eat fresh dates.",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "20031",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4543",
      "hadith_no": "4543",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الحسين بن عيسى، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال أخبرني بشير بن يسار، أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر إلا لأصحاب العرايا فإنه أذن لهم ‏.‏",
      "text_en": " Rafi bin Khadij and Sahl Bi Abi Hathamah narrated that the Messenger of Allah forbade Muzabanah, which means selling fresh dates still on the tree for dried dates, except in cases of 'Araya, for which he gave permission. (Sahih",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4544",
      "hadith_no": "4544",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن يحيى، عن بشير بن يسار، عن أصحاب، رسول الله صلى الله عليه وسلم أنهم قالوا رخص رسول الله صلى الله عليه وسلم في بيع العرايا بخرصها ‏.‏",
      "text_en": " It was narrated from Bashir bin yasar that the Companions of the Messenger of Allah said:                     \"The Messenger of Allah granted a concession allowing 'Araya sales by estimate.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11810"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4712",
      "hadith_no": "4712",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال وحسبت قال وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا بمحيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل - وكان أصغر القوم - فذهب عبد الرحمن يتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر في السن ‏\"‏ ‏.‏ فصمت وتكلم صاحباه ثم تكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا وتستحقون صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا كيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطاه عقله ‏.‏",
      "text_en": " It was narrated from Yahya, from Bushair bin Yasa, from Sahl bin Abi Hathmah who said - and I think he said:                     and from Rafi bin Khadij, the two of them said - :\"Abdullah bin Sahl bin Zaid and Muhayysah bin Mas'ud went out until when they reached Khaibar, they went their separate ways. Then Muhayysah found 'Abdullah bin Sahl slain, so he buried him. Then he came to the Mesenger of Allah, along with Huwayysah bin Mas'ud and 'Abdur-Rahman bin Sahl, who was the youngest of them, 'Abdur-Rahman started to speak before his two companions, but the Messenger of Allah said to him: \"Let the clear speak first.\" So he fell silent and his two companions spoke, then he spoke with them. They told the Messenger of Allah about the killing of 'Abdullah bin Sahl, and he said to them: \"Will you swear fifty oaths, then you will receive compensation, or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness what happened?\" he said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"How can we accept the oath of a disbelieving people?\" When the Messenger of Allah saw that, he paid the blood money (himself).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11810",
        "1822",
        "1986"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4713",
      "hadith_no": "4713",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عبدة، قال أنبأنا حماد، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أنهما حدثاه أن محيصة بن مسعود وعبد الله بن سهل أتيا خيبر في حاجة لهما فتفرقا في النخل فقتل عبد الله بن سهل فجاء أخوه عبد الرحمن بن سهل وحويصة ومحيصة ابنا عمه إلى رسول الله صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه - وهو أصغر منهم - فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر ليبدأ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم وذكر كلمة معناها ‏\"‏ يقسم خمسون منكم ‏\"‏ ‏.‏ فقالوا يا رسول الله أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم فركضتني ناقة من تلك الإبل ‏.‏",
      "text_en": " It was narrated from Sahl bin Ab Hathmah and Rafi bin Khadij that:                     Muhayysah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah bin Sahl was killed, and 'Abdullah bin Sahl was killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himself Sahl said: \"I entered a Mirbad of theirs, and one of those camels kicked me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4714",
      "hadith_no": "4714",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، أن عبد الله بن سهل، ومحيصة بن مسعود بن زيد، أنهما أتيا خيبر وهو يومئذ صلح فتفرقا لحوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم - وهو أحدث القوم سنا - فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم فتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نحلف ولم نشهد ولم نر قال ‏\"‏ تبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narrated from Sahi bin Abi Hathmah that:                     'Abdullah bin SAahi and Nubayysah bin Mas'ud bin Zaid went o Khaibar, and at that time there was peace treaty. They went their separate ways to about their business, then Muhayysah came upon 'Abdullah in Sahl lying dead in a pool of blood. He buried him, then he came to AL-Madinah. 'Abdur-Rahman bin Sahi. Huwayysah, and Muhayysah came to the Messenger of Allah, and 'Abdur-Rehman started to speak, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we swear an oath when we did not witness, and did not see (what happened)?\" He said: \"The n can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20212",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4715",
      "hadith_no": "4715",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر وهي يومئذ صلح فتفرقا في حوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ وهو أحدث القوم فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم وتستحقون قاتلكم أو صاحبكم ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نحلف ولم نشهد ولم نر فقال ‏\"‏ أتبرئكم يهود بخمسين ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narratd that Sahl bin Abi Hatmah said:                     \"Abdullah bin Sahl and Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah bin Sahl lying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman bin Sahl and Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4716",
      "hadith_no": "4716",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني بشير بن يسار، عن سهل بن أبي حثمة، أن عبد الله بن سهل الأنصاري، ومحيصة بن مسعود، خرجا إلى خيبر فتفرقا في حاجتهما فقتل عبد الله بن سهل الأنصاري فجاء محيصة وعبد الرحمن أخو المقتول وحويصة بن مسعود حتى أتوا رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال له النبي صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ فتكلم محيصة وحويصة فذكروا شأن عبد الله بن سهل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تحلفون خمسين يمينا فتستحقون قاتلكم ‏\"‏ ‏.‏ قالوا كيف نحلف ولم نشهد ولم نحضر فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نقبل أيمان قوم كفار قال فوداه رسول الله صلى الله عليه وسلم ‏.‏ قال بشير قال لي سهل بن أبي حثمة لقد ركضتني فريضة من تلك الفرائض في مربد لنا ‏.‏",
      "text_en": " It was narrated from Sahl bin Abi Hathmah that:                     'Abdullah bin Sahi Al-Anasri and Muhayysah bin Mas'ud went out to Khaibar and went their separate ways to go about their business. 'Abdullah bin Sahl Al-Anasari was killed and Muhayysah. 'Abdur-Rahman, who was the brother of the victim, and Huwayysah, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the prophert said to him: \"Let the elders speak first.\" So Muhayysah and Huwayysah spoke and told him about the case of 'Abdullah bin Sahl. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness (what happened) and we were not there?\" The Messenger of Allah said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself. (One of the narrators) Bushair said: 'One of those camels kicked me in a Mirbad of ours.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4717",
      "hadith_no": "4717",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال وجد عبد الله بن سهل قتيلا فجاء أخوه وعماه حويصة ومحيصة وهما عما عبد الله بن سهل إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ قالا يا رسول الله إنا وجدنا عبد الله بن سهل قتيلا في قليب من بعض قلب خيبر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من تتهمون ‏\"‏ ‏.‏ قالوا نتهم اليهود ‏.‏ قال ‏\"‏ أفتقسمون خمسين يمينا أن اليهود قتلته ‏\"‏ ‏.‏ قالوا وكيف نقسم على ما لم نر قال ‏\"‏ فتبرئكم اليهود بخمسين أنهم لم يقتلوه ‏\"‏ ‏.‏ قالوا وكيف نرضى بأيمانهم وهم مشركون فوداه رسول الله صلى الله عليه وسلم من عنده ‏.‏ أرسله مالك بن أنس ‏.‏",
      "text_en": " It was narrated that Sahl bin Abi Hathmah said:                     \"Abdullah bin Sahl was found slain, and his brother, and two paternal uncles, Huwayysah and Huwayisaah, who were the paternal uncles of 'Abdullah bin Sahl, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first.\" They said: \"O Messenger of Allah, we found 'Abdullah bin Sahl slain in one of the dry wells of Khaibar.\" The prophet said: \"Whom do you suspect? They said: \"We suspect the Jews.\" He said: \"Will you swear fifty oaths saying that the Jews killed him?\" They said: \"How can we swear an oath about something that we did not see?\" He said: \"Then can the Jews swear fifty oaths declaring that they did not kill him?\" They said:\"How can we accept their oaths, when they are Mushrikun?\" So the Messenger of Allah paid the blood money himself. (Sahih)Malik narrated this in Mursal from.",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11062",
        "11810",
        "1822"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4718",
      "hadith_no": "4718",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن يحيى بن سعيد، عن بشير بن يسار، أنه أخبره أن عبد الله بن سهل الأنصاري ومحيصة بن مسعود خرجا إلى خيبر فتفرقا في حوائجهما فقتل عبد الله بن سهل فقدم محيصة فأتى هو وأخوه حويصة وعبد الرحمن بن سهل إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن ليتكلم لمكانه من أخيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ فتكلم حويصة ومحيصة فذكروا شأن عبد الله بن سهل فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون خمسين يمينا وتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قال مالك قال يحيى فزعم بشير أن رسول الله صلى الله عليه وسلم وداه من عنده ‏.‏ خالفهم سعيد بن عبيد الطائي ‏.‏",
      "text_en": " It was narrated from Bushair bin Yasar that:                     'Abdullah bin Sahl Al-Ansari and Muhayysah bin Mas'ud went out to Khaibar, where they went their separate ways to go about their business. 'Abdullah bin Sahl was killed, and Muhayysah came (to Madinah) and went with his brother Huwayysah and 'Abdur-Rahman bin Sahl to the Messenger of Allah. 'Abdur-Rahaman started to speak, because of his position as brother (of the slain man) but the Messenger of Allah said: \"Let the elders speak first.\" So Huyysah and Muhayysah spoken, and told him about what happened to 'Abdullah bin Sahl. The Messenger of Allah said to them: \"Will you sewer fifty oaths, then you will receive compensation or be entitled to retaliate?\" (In his narration) Malik said: \"Yahya said: 'Bushair said that the Messenger of Allah paid the blood money himself, but Sa'eed bin 'Ubaid At-Ta'l disagreed with them (in reporting that).''",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "30234",
        "20001",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4719",
      "hadith_no": "4719",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا فقالوا للذين وجدوه عندهم قتلتم صاحبنا قالوا ما قتلناه ولا علمنا قاتلا ‏.‏ فانطلقوا إلى نبي الله صلى الله عليه وسلم فقالوا يا نبي الله انطلقنا إلى خيبر فوجدنا أحدنا قتيلا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ فقال لهم ‏\"‏ تأتون بالبينة على من قتل ‏\"‏ ‏.‏ قالوا ما لنا بينة ‏.‏ قال ‏\"‏ فيحلفون لكم ‏\"‏ ‏.‏ قالوا لا نرضى بأيمان اليهود ‏.‏ وكره رسول الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏ خالفهم عمرو بن شعيب ‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Ubaid At-Ta'l from Bushair bin Yasar who said:                     \"A man from among the Ansar who was called Sahl bin Abi Hathmah told him that some of his people went to Khaibar, where they went their separate ways. Then they found one of their numbers slain. They said to those in whose land they found him: 'You killed our companion!' They said: 'We did not kill him and we do not know who killed him.' They went to the prophet of Allah and said: 'O Prophet of Allah, we went to Khaibar and we found one of our number slain.' The Messenger of Allah said:  'Let the elders speak first.' And he said to them: 'Bring proof of the one whom you suspect killed him.' They said: 'We do not have any proof.' He said: \"Then let them swear an oath to you.' They said\" 'We will not accept the oath of the Jews.' The Messenger of Allah did not want his blood to have been shed with no Justice done, so he paid a Diyah of one hundred camels from the Sadaqah.\" 'Amr bin Shu'aib differed with them.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11629",
        "11810"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-531",
      "hadith_no": "531",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يحيى بن سعيد، عن بشير بن يسار، أنبأنا سويد بن النعمان الأنصاري، أنهم خرجوا مع رسول الله  صلى الله عليه وسلم  إلى خيبر حتى إذا كانوا بالصهباء صلى العصر ثم دعا بأطعمة فلم يؤت إلا بسويق فأكلوا وشربوا ثم دعا بماء فمضمض فاه ثم قام فصلى بنا المغرب ‏.‏",
      "text_en": " Suwaid bin Nu'man Ansari narrated that :                     They went out with the Messenger of Allah to Khaibar. When they reached As-Sahba' (a place near Khaibar), he performed 'Asr (Afternoon prayer), then he called for food, but no food was brought except for Sawiq. So they ate that and drank, and then he called for water and rinsed his mouth, then he stood up and led us for Maghrib (Sunset) prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11062",
        "11810"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 55,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}