{
  "id": "11814",
  "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
  "full_name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.'Adi",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11811",
      "name": "Safiyya bint Abi 'Ubaid al-Thaqafi صفية بنت أبي عبيد بن مسعود الثقفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "spouses": [
    {
      "id": "11812",
      "name": "Umm Salama bint al-Mukhtar أم سلمة بنت المختار بن أبي عبيد",
      "grade": "Follower(Tabi')"
    }
  ],
  "siblings": [
    {
      "id": "11813",
      "name": "Waqid bin 'Abdullah ibn 'Umar واقد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11815",
      "name": "'Umar bin 'Abdullah Ibn 'Umar عمر بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11816",
      "name": "Bilal bin 'Abdullah bin 'Umar بلال بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11819",
      "name": "Zayd bin 'Abdullah bin 'Umar زيد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "children": [
    {
      "id": "16832",
      "name": "'Umar bin 'Abdullah bin 'Abdullah عمر بن عبد الله بن عبد الله",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "473",
      "name": "Asma' bint Zayd ibn al-Khattab ( أسماء بنت زيد بن الخطاب العدوي ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10929",
      "name": "'Abdullah bin Abi Salma عبد الله بن أبي سلمة الماجشون",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11874",
      "name": "'Abdullah bin Waqd عبد الله بن واقد بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11215",
      "name": "Muhammad bin Ja'far bin al-Zubair محمد بن جعفر بن الزبير بن العوام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11262",
      "name": "Muhammad bin 'Aabad bin Ja'far محمد بن عباد بن جعفر بن رفاعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1718",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن نافع، قال قال عبد الله بن عبد الله بن عمر  رضى الله عنهم  لأبيه أقم، فإني لا آمنها أن ستصد عن البيت‏.‏ قال إذا أفعل كما فعل رسول الله صلى الله عليه وسلم وقد قال الله ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ فأنا أشهدكم أني قد أوجبت على نفسي العمرة‏.‏ فأهل بالعمرة، قال ثم خرج حتى إذا كان بالبيداء أهل بالحج والعمرة، وقال ما شأن الحج والعمرة إلا واحد‏.‏ ثم اشترى الهدى من قديد، ثم قدم فطاف لهما طوافا واحدا، فلم يحل حتى حل منهما جميعا‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah (bin `Abdullah) bin `Umar said to his father, \"Stay here, for I am afraid that it (affliction between Ibn Zubair and Al-Hajjaj) might prevent you from reaching the Ka`ba.\" Ibn `Umar said, \"(In this case) I would do the same as Allah's Apostle did, and Allah has said, 'Verily, in Allah's Apostle, you have a good example (to follow).' So, I make you, people, witness that I have made `Umra compulsory for me.\" So he assumed lhram for `Umra. Then he went out and when he reached Al- Baida', he assumed Ihram for Hajj and `Umra (together) and said, \"The conditions (requisites) of Hajj and `Umra are the same.\" He, then brought a Hadi from Qudaid. Then he arrived (at Mecca) and performed Tawaf (between Safa and Marwa) once for both Hajj and `Umra and did not finish the lhram till he had finished both Hajj and `Umra.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "11814"
      ]
    },
    {
      "hadith_no": "1989",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا ابن رمح، أخبرنا الليث، عن ابن، شهاب عن عبد الله بن عبد الله بن عمر، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال وهو قائم على المنبر ‏\"‏ من جاء منكم الجمعة فليغتسل ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Umar is reported to have said that The Messenger of Allah (may peace be up on him) was standing on the pulpit when he said this:                      He who comes for Jumu'a he should take a bath.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11013",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "1990",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن شهاب، عن سالم، وعبد الله، ابنى عبد الله بن عمر عن ابن عمر، عن النبي صلى الله عليه وسلم .‏ بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Umar by another chain of transmitters.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11013",
        "11011",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "3155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن المثنى، قالا حدثنا عبد الله بن نمير، ح وحدثنا سعيد بن يحيى الأموي، حدثني أبي قالا، جميعا حدثنا يحيى بن سعيد، عن عبد الله بن، أبي سلمة عن عبد الله بن عبد الله بن عمر، عن أبيه، قال غدونا مع رسول الله صلى الله عليه وسلم من منى إلى عرفات منا الملبي ومنا المكبر ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them). He said:                      As we proceeded in the morning along with AUbs Messenger (may peace be upon him) from Mina to 'Arafat, some of us prounced Talbiya, and some pronounced Takbir (Allah-o-Akbar).",
      "chain": [
        "30007",
        "30170",
        "20331",
        "30254",
        "20367",
        "11062",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "3156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، ويعقوب الدورقي، قالوا أخبرنا يزيد بن هارون، أخبرنا عبد العزيز بن أبي سلمة، عن عمر بن حسين، عن عبد الله بن، أبي سلمة عن عبد الله بن عبد الله بن عمر، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في غداة عرفة فمنا المكبر ومنا المهلل فأما نحن فنكبر قال قلت والله لعجبا منكم كيف لم تقولوا له ماذا رأيت رسول الله صلى الله عليه وسلم يصنع.",
      "text_en": " Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them):                      We were along with Allah's Messenger (way peace he upon him) in the morning of 'Arafa (9th of Dhu'l-Hijja). Some of us pronounced Takbir and some of us Tahlil La ilaha ill-Allah). And to those of us who pronounced Takbir, I said: By Allah, how strange it is that you did not care to ask him: What did you see Allah's Messenger (may peace be upon him) doing (on this occasion)?",
      "chain": [
        "38487",
        "30524",
        "30400",
        "20472",
        "32017",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "48",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أحمد بن خالد، حدثنا محمد بن إسحاق، عن محمد بن يحيى بن حبان، عن عبد الله بن عبد الله بن عمر، قال قلت أرأيت توضؤ ابن عمر لكل صلاة طاهرا وغير طاهر عم ذاك فقال حدثتنيه أسماء بنت زيد بن الخطاب أن عبد الله بن حنظلة بن أبي عامر حدثها أن رسول الله صلى الله عليه وسلم أمر بالوضوء لكل صلاة طاهرا وغير طاهر فلما شق ذلك عليه أمر بالسواك لكل صلاة فكان ابن عمر يرى أن به قوة فكان لا يدع الوضوء لكل صلاة ‏.‏ قال أبو داود إبراهيم بن سعد رواه عن محمد بن إسحاق قال عبيد الله بن عبد الله ‏.‏",
      "text_en": " Narrated Abdullah b. 'Abd Allah b. 'Umar:                     Muhammad ibn Yahya ibn Habban asked Abdullah ibn Abdullah ibn Umar about the reason for Ibn Umar's performing ablution for every prayer, whether he was with or without ablution. He replied: Asma', daughter of Zayd ibn al-Khattab, reported to me that Abdullah ibn Hanzalah ibn AbuAmir narrated to her that the Messenger of Allah (ﷺ) was earlier commanded to perform ablution for every prayer whether or not he was with ablution. When it became a burden for him, he was ordered to use tooth-stick for every prayer. As Ibn Umar thought that he had the strength (to perform the ablution for every prayer), he did not give up performing ablution for every prayer.Abu Dawud said: Ibrahim b. Sa'd narrated this tradition on the authority of Muhammad b. Ishaq, and there he mentions the name of 'Ubaid Allah b. 'Abd Allah (instead of 'Abd Allah b. 'Abd Allah b. 'Umar)",
      "chain": [
        "38566",
        "11107",
        "11222",
        "11814"
      ]
    },
    {
      "hadith_no": "63",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، وعثمان بن أبي شيبة، والحسن بن علي، وغيرهم، قالوا حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن جعفر بن الزبير، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع فقال صلى الله عليه وسلم ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ ابن العلاء وقال عثمان والحسن بن علي عن محمد بن عباد بن جعفر ‏.‏ قال أبو داود وهو الصواب ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ), was asked about water (in desert country) and what is frequented by animals and wild beasts. He replied: When there is enough water to fill two pitchers, it bears no impurity.",
      "chain": [
        "30216",
        "30203",
        "30",
        "20318",
        "11230",
        "11215",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن نمير، حدثنا يحيى بن سعيد، عن عبد الله بن أبي سلمة، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال غدونا مع رسول الله صلى الله عليه وسلم من منى إلى عرفات منا الملبي ومنا المكبر ‏.‏",
      "text_en": " ‘Abd Allah bin Umar said We proceeded along with the Apostle of Allaah(ﷺ) from Mina to ‘Arafat, some of us were uttering talbiyah and the others were shouting “Allaah is most great.”",
      "chain": [
        "30007",
        "20331",
        "11062",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "493",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "وروي عن الزهري، عن عبد الله بن عبد الله بن عمر، عن أبيه، عن النبي صلى الله عليه وسلم هذا الحديث أيضا ‏.‏ حدثنا بذلك قتيبة حدثنا الليث بن سعد عن ابن شهاب عن عبد الله بن عبد الله بن عمر عن أبيه أن النبي صلى الله عليه وسلم مثله ‏.‏ وقال محمد وحديث الزهري عن سالم عن أبيه وحديث عبد الله بن عبد الله عن أبيه كلا الحديثين صحيح ‏.‏ وقال بعض أصحاب الزهري عن الزهري قال حدثني آل عبد الله بن عمر عن عبد الله بن عمر ‏.‏",
      "text_en": " Salim narrated:                     (Another chain) from Abdullah bin Umar from the Prophet which is similar",
      "chain": [
        "11013",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "52",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هناد بن السري، والحسين بن حريث، عن أبي أسامة، عن الوليد بن كثير، عن محمد بن جعفر، عن عبد الله بن عبد الله بن عمر، عن أبيه، قال سئل رسول الله صلى الله عليه وسلم عن الماء وما ينوبه من الدواب والسباع ‏.‏ فقال ‏\"‏ إذا كان الماء قلتين لم يحمل الخبث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abdullah bin 'Umar that his father said:                      \"The Messenger of Allah (ﷺ) was asked about water and how some animals and carnivorous beasts might drink from it. He said: 'If the water is more than two Qullahs, it will not carry filth.'\"[1][1]It comes with some explanation in Sunan At Timidhi 'Abdah (one of the narrators) said: \"Muhammad bin Ishaq said: 'A Qullah refers to Jirar (These are two nouns describing large casks that are used to hold water), and a Qullah is the thing that drinking water is held in.\"' At-Tirmidhi said: \"This is the saying of Ash Shafa'i, Ahmad and Ishaq. They say that when the water is two Qullahs then nothing makes it impure, as long as it does not change its smell, and its taste. And they say, it is approximately fifty Qirbahs (waterskins).\"",
      "chain": [
        "30480",
        "30325",
        "20318",
        "11230",
        "20173",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "1157",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن يحيى، عن القاسم بن محمد، عن عبد الله بن عبد الله بن عمر، عن أبيه، أنه قال إن من سنة الصلاة أن تضجع رجلك اليسرى وتنصب اليمنى ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abdullah bin 'Umar that his father said:                     \"One of the sunnahs of the prayer is to spread your left foot beneath you, and hold your right foot upright.\"",
      "chain": [
        "30367",
        "20023",
        "20031",
        "10535",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "1158",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر بن مضر، قال حدثني أبي، عن عمرو بن الحارث، عن يحيى، أن القاسم، حدثه عن عبد الله، - وهو ابن عبد الله بن عمر - عن أبيه، قال من سنة الصلاة أن تنصب، القدم اليمنى واستقباله بأصابعها القبلة والجلوس على اليسرى ‏.‏",
      "text_en": " It was narrated from Al-Qasim who narrated from 'Abdullah-he is Ibn Abdullah bin 'Umar- that:                     His father (Ibn 'Umar) said: \"One of the sunnahs of the prayer is to hold the right foot upright and point its toes toward the Qiblah, and to sit on the left foot.\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "20377",
        "11449",
        "10535",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن الزهري، عن عبد الله بن عبد الله بن عمر، عن إياس بن عبد الله بن أبي ذباب، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ لا تضربوا إماء الله ‏\"‏ ‏.‏ فجاء عمر إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله قد ذئر النساء على أزواجهن فأمر بضربهن ‏.‏ فضربن فطاف بآل محمد  صلى الله عليه وسلم  طائف نساء كثير فلما أصبح قال ‏\"‏ لقد طاف الليلة بآل محمد سبعون امرأة كل امرأة تشتكي زوجها فلا تجدون أولئك خياركم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Iyas bin 'Abdullah bin Abu Dhubab said:                     \"The Prophet said: 'Do not beat the female slaves of Allah.' Then 'Umar came to the Prophet and said: 'O Messenger of Allah, the woman have become bold towards their husbands? So order the beatin g of them,' and they were beaten. Then many women went around to the family of Muhammad,. The next day he said: 'Last night seventy women came to the family of Muhammad, each woman complaining about her husband. You will not find that those are the best of you.' \"",
      "chain": [
        "30269",
        "20005",
        "11013",
        "11814",
        "4078"
      ]
    }
  ],
  "total_hadiths": 13
}