{
  "id": "11811",
  "name": "Safiyya bint Abi 'Ubaid al-Thaqafi صفية بنت أبي عبيد بن مسعود الثقفية",
  "full_name": "Safiyya bint Abi 'Ubaid al-Thaqafi صفية بنت أبي عبيد بن مسعود الثقفية",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Taif",
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خت  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Female",
      "B.Thaqif"
    ]
  },
  "parents": [
    {
      "id": "3262",
      "name": "Abu 'Ubaid bin Mas'ud al-Thaqafi ( أبو عبيد بن مسعود الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "993",
      "name": "'Atika bint Usayd bin Abi al-'Is ( عاتكة بنت أسيد بن أبي العيص بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "3270",
      "name": "al-Mukhtar bin Abi 'Ubaid al-Thaqafi ( المختار بن أبي عبيد بن مسعود الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11813",
      "name": "Waqid bin 'Abdullah ibn 'Umar واقد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11814",
      "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11815",
      "name": "'Umar bin 'Abdullah Ibn 'Umar عمر بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "487",
      "name": "'Abdullah bin Safwan bin Umayyah ( عبد الله بن صفوان بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11242",
      "name": "Hameed bin Qays حميد بن قيس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-7035",
      "hadith_no": "7035",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "وقال الليث حدثني نافع، أن صفية ابنة أبي عبيد، أخبرته أن عبدا من رقيق الإمارة وقع على وليدة من الخمس، فاستكرهها حتى افتضها، فجلده عمر الحد ونفاه، ولم يجلد الوليدة من أجل أنه استكرهها‏.‏ قال الزهري في الأمة البكر، يفترعها الحر، يقيم ذلك الحكم من الأمة العذراء بقدر قيمتها، ويجلد، وليس في الأمة الثيب في قضاء الأئمة غرم، ولكن عليه الحد‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20023",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sahih-muslim-3808",
      "hadith_no": "3808",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا يحيى بن يحيى، وقتيبة، وابن، رمح عن الليث بن سعد، عن نافع، أن صفية، بنت أبي عبيد حدثته عن حفصة، أو عن عائشة، أو عن كلتيهما، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر - أو تؤمن بالله ورسوله - أن تحد على ميت فوق ثلاثة أيام إلا على زوجها ‏\"‏ ‏.‏",
      "text_en": " Safiyya bint Abu 'Ubaid reported on the authority of Hafsa or 'A'isha (Allah be pleased with thein) or from both of them that Allah's Messenger (may peace he upon him) said:                      It is not permissible for a woman believing in Allah and the Hereafter (or believing in Allah and His Messenger) that she should observe mourning for the dead beyond three days except in case of her husband.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30367",
        "30490",
        "20023",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sahih-muslim-3810",
      "hadith_no": "3810",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول سمعت نافعا، يحدث عن صفية بنت أبي عبيد، أنها سمعت حفصة بنت عمر، زوج النبي صلى الله عليه وسلم تحدث عن النبي صلى الله عليه وسلم بمثل حديث الليث وابن دينار وزاد ‏\"‏ فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " Safiyya bint Abu 'Ubaid reported that she heard Hafsa daughter of Umar (Allah be pleased with them), (and) wife of Allah's Prophet (may peace be upon him), narrating a hadith like this from Allah's Apostle (may peace be upon him), and she made this addition:                     \" She should abstain from adorning herself (in case of the death of her husband) for four months and ten days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20259",
        "11062",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sahih-muslim-3811",
      "hadith_no": "3811",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو الربيع، حدثنا حماد، عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، جميعا عن نافع، عن صفية بنت أبي عبيد، عن بعض، أزواج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم بمعنى حديثهم ‏.‏",
      "text_en": " Safiyya bint Abu 'Ubaid narrated this tradition of Allah's Prophet (may peace be upon him) on the authority of some wives of Allah's Apostle (may peace be upon him)",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20022",
        "11015",
        "30212",
        "20331",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sunan-abi-daud-1831",
      "hadith_no": "1831",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن أبي عدي، عن محمد بن إسحاق، قال ذكرت لابن شهاب فقال حدثني سالم بن عبد الله، أن عبد الله، - يعني ابن عمر - كان يصنع ذلك - يعني يقطع الخفين للمرأة المحرمة - ثم حدثته صفية بنت أبي عبيد أن عائشة حدثتها أن رسول الله صلى الله عليه وسلم قد كان رخص للنساء في الخفين فترك ذلك ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Salim ibn Abdullah said: Abdullah ibn Umar used to do so, that is to say, he would cut the shoes of a woman who put on ihram; then Safiyyah, daughter of AbuUbayd, reported to him that Aisha (may Allah be pleased with her) narrated to her that the Messenger of Allah (ﷺ) gave licence to women in respect of the shoes (i.e. women are not required to cut the shoes). He, therefore, abandoned it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20276",
        "11107",
        "11011",
        "18",
        "11811",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4117",
      "hadith_no": "4117",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي بكر بن نافع، عن أبيه، عن صفية بنت أبي عبيد، أنها أخبرته أن أم سلمة زوج النبي صلى الله عليه وسلم قالت لرسول الله صلى الله عليه وسلم حين ذكر الإزار فالمرأة يا رسول الله ‏.‏ قال ‏\"‏ ترخي شبرا ‏\"‏ ‏.‏ قالت أم سلمة إذا ينكشف عنها ‏.‏ قال ‏\"‏ فذراعا لا تزيد عليه ‏\"‏ ‏.‏",
      "text_en": " Safiyyah, daughter of AbuUbayd, said:                      When the Messenger of Allah (ﷺ) mentioned lower garment, Umm Salamah, wife of the Messenger of Allah (ﷺ), asked him: And a woman, Messenger of Allah? He replied: She may hang down a span. Umm Salamah said: Still it (foot) will be uncovered. He said: Then a forearm's length, nor exceeding it.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "25510",
        "11811"
      ]
    },
    {
      "id": "sunan-an-nasai-3503",
      "hadith_no": "3503",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الوهاب، قال سمعت نافعا، يقول عن صفية بنت أبي عبيد، أنها سمعت حفصة بنت عمر، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Abi 'Ubaid that she heard Hafsah bint 'Umar, the wife of the Prophet, (narrate) that the Prophet said:                      \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sunan-an-nasai-3504",
      "hadith_no": "3504",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الله بن الصباح، قال حدثنا محمد بن سواء، قال أنبأنا سعيد، عن أيوب، عن نافع، عن صفية بنت أبي عبيد، عن بعض، أزواج النبي صلى الله عليه وسلم وعن أم سلمة أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت أكثر من ثلاثة أيام إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Abi 'Ubaid from one of the wives of the Prophet, and from Umm Salamah, that the Prophet said:                      \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30142",
        "20565",
        "11168",
        "11015",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sunan-an-nasai-3505",
      "hadith_no": "3505",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا السهمي، - يعني عبد الله بن بكر - قال حدثنا سعيد، عن أيوب، عن نافع، عن صفية بنت أبي عبيد، عن بعض، أزواج النبي صلى الله عليه وسلم وهي أم سلمة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A similar report was narrated from Safiyyah bint Abi 'Ubaid from one of the wives of the Prophet -and she is Umm Salamah- from the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "11168",
        "11015",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sunan-ibn-majah-2164",
      "hadith_no": "2164",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن يحيى بن سعيد، عن نافع، عن صفية بنت أبي عبيد، عن حفصة، زوج النبي  صلى الله عليه وسلم  قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث إلا على زوج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah the wife of the Prophet (ﷺ) that:                     the Messenger of Allah (ﷺ), said: \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for any deceased person for more than three days, except for her husband.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20031",
        "11014",
        "11811"
      ]
    }
  ],
  "total_hadiths": 10
}