{
  "id": "11827",
  "name": "Ibrahim bin Muhammad bin Talha إبراهيم بن محمد بن طلحة بن عبيد الله",
  "full_name": "Ibrahim bin Muhammad bin Talha إبراهيم بن محمد بن طلحة بن عبيد الله",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Madni",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12246",
      "name": "'Abdullah bin Muhammad bin 'Aqil عبد الله بن محمد بن عقيل بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11193",
      "name": "'Abdur Rahman bin Humaid bin 'AR عبد الرحمن بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-6580",
      "hadith_no": "6580",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عباد، ومحمد بن مهران الرازي، - واللفظ لابن عباد - حدثنا  حاتم، - وهو ابن إسماعيل - عن عبد الرحمن بن حميد، عن إبراهيم بن محمد بن طلحة، قال سمعت أبا أسيد، خطيبا عند ابن عتبة فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار دار بني النجار ودار بني عبد الأشهل ودار بني الحارث بن الخزرج ودار بني ساعدة ‏\"‏ ‏.‏ والله لو كنت مؤثرا بها أحدا لآثرت بها عشيرتي ‏.‏",
      "text_en": " Ibrahim b. Muhammad b. Talha reported:                      I heard Abu Sa'ld delivering an address in the presence of Abu 'Utba that the Messenger of Allah (may peace be upon him) said: The worthiest settlements of the Ansar are those of Banu Najjar, then of Banu 'Abu al-Ashhal and then of Banu Harith and then of Banu Khazraj and then of the clan of Banu Sa'idah, and if I were to give preference to anyone besides them I would have given preference to my relatives.",
      "usc_msa_ref": "",
      "chain": [
        "30377",
        "30383",
        "20159",
        "11193",
        "11827"
      ]
    },
    {
      "id": "sunan-abi-daud-0-3",
      "hadith_no": "0",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زهير بن حرب، وغيره، قالا حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت رسول الله صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني امرأة أستحاض حيضة كثيرة شديدة فما ترى فيها قد منعتني الصلاة والصوم فقال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك ‏.‏ قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ فقالت هو أكثر من ذلك إنما أثج ثجا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما فعلت أجزأ عنك من الآخر وإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال لها ‏\"‏ إنما هذه ركضة من ركضات الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي حتى إذا رأيت أنك قد طهرت واستنقأت فصلي ثلاثا وعشرين ليلة أو أربعا وعشرين ليلة وأيامها وصومي فإن ذلك يجزئك وكذلك فافعلي في كل شهر كما تحيض النساء وكما يطهرن ميقات حيضهن وطهرهن وإن قويت على أن تؤخري الظهر وتعجلي العصر فتغتسلين وتجمعين بين الصلاتين الظهر والعصر وتؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الفجر فافعلي وصومي إن قدرت على ذلك ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وهذا أعجب الأمرين إلى ‏\"‏ ‏.1قال أبو داود ورواه عمرو بن ثابت عن ابن عقيل قال فقالت حمنة فقلت هذا أعجب الأمرين إلى ‏.‏2 لم يجعله من قول النبي صلى الله عليه وسلم جعله كلام حمنة ‏.‏ قال أبو داود وعمرو بن ثابت رافضي رجل سوء ولكنه كان صدوقا في الحديث وثابت بن المقدام رجل ثقة وذكره عن يحيى بن معين ‏.‏ قال أبو داود سمعت أحمد يقول حديث ابن عقيل في نفسي منه شىء ‏.‏",
      "text_en": " Narrated Hamnah daughter of Jahsh:                     Hamnah said my menstruation was great in quantity and severe. So I came to the Messenger of Allah (ﷺ) for a decision and told him. I found him in the house of my sister, Zaynab, daughter of Jahsh.  I said: Messenger of Allah, I am a woman who menstruates in great quantity and it is severe, so what do you think about it? It has prevented me from praying and fasting.  He said: I suggest that you should use cotton, for it absorbs the blood.  She replied: It is too copious for that.  He said: Then take a cloth.  She replied: It is too copious for that, for my blood keeps flowing.  The Messenger of Allah (ﷺ) said: I shall give you two commands; whichever of them you follow, that will be sufficient for you without the other, but you know best whether you are strong enough to follow both of them.  He added: This is a stroke of the Devil, so observe your menses for six or seven days, Allah alone knows which it should be; then wash. And when you see that you are purified and quite clean, pray during twenty-three or twenty-four days and nights and fast, for that will be enough for you, and do so every month, just as women menstruate and are purified at the time of their menstruation and their purification.  But if you are strong enough to delay the noon (Zuhr) prayer and advance the afternoon ('Asr) prayer, to wash, and then combine the noon and the afternoon prayer; to delay the sunset prayer and advance the night prayer, to wash, and then combine the two prayers, do so: and to wash at dawn, do so: and fast if you are able to do so if possible.The Messenger of Allah (ﷺ) said: Of the two commands this is more to my liking.1Abu Dawud said: 'Amr b. Thabit narrated from Ibn 'Aqil: Hamnah said: Of the two commands this is the one which is more to my liking.2 In this version these words were not quoted as the statement of the Prophet (ﷺ); it gives it as a statement of Hamnah.Abu Dawud said: 'Amr b. Thabit was a Rafidi. This has been said by Yahya b. Ma'in.Abu Dawud said: I heard Ahmad (b. Hanbal) say: I am doubtful about the tradition transmitted by Ibn 'Aqil.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20443",
        "20394",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "id": "jami-al-tirmidhi-128",
      "hadith_no": "128",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت النبي صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني أستحاض حيضة كثيرة شديدة فما تأمرني فيها قد منعتني الصيام والصلاة قال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فتلجمي ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ قالت هو أكثر من ذلك إنما أثج ثجا فقال النبي صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما صنعت أجزأ عنك فإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال ‏\"‏ إنما هي ركضة من الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي فإذا رأيت أنك قد طهرت واستنقأت فصلي أربعا وعشرين ليلة أو ثلاثا وعشرين ليلة وأيامها وصومي وصلي فإن ذلك يجزئك وكذلك فافعلي كما تحيض النساء وكما يطهرن لميقات حيضهن وطهرهن فإن قويت على أن تؤخري الظهر وتعجلي العصر ثم تغتسلين حين تطهرين وتصلين الظهر والعصر جميعا ثم تؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الصبح وتصلين وكذلك فافعلي وصومي إن قويت على ذلك ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وهو أعجب الأمرين إلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه عبيد الله بن عمرو الرقي وابن جريج وشريك عن عبد الله بن محمد بن عقيل عن إبراهيم بن محمد بن طلحة عن عمه عمران عن أمه حمنة إلا أن ابن جريج يقول عمر بن طلحة والصحيح عمران بن طلحة ‏.‏ قال وسألت محمدا عن هذا الحديث فقال هو حديث حسن صحيح ‏.‏ وهكذا قال أحمد بن حنبل هو حديث حسن صحيح ‏.‏ وقال أحمد وإسحاق في المستحاضة إذا كانت تعرف حيضها بإقبال الدم وإدباره وإقباله أن يكون أسود ‏.‏ وإدباره أن يتغير إلى الصفرة فالحكم لها على حديث فاطمة بنت أبي حبيش وإن كانت المستحاضة لها أيام معروفة قبل أن تستحاض فإنها تدع الصلاة أيام أقرائها ثم تغتسل وتتوضأ لكل صلاة وتصلي وإذا استمر بها الدم ولم يكن لها أيام معروفة ولم تعرف الحيض بإقبال الدم وإدباره فالحكم لها على حديث حمنة بنت جحش ‏.‏ وكذلك قال أبو عبيد ‏.‏ وقال الشافعي المستحاضة إذا استمر بها الدم في أول ما رأت فدامت على ذلك فإنها تدع الصلاة ما بينها وبين خمسة عشر يوما فإذا طهرت في خمسة عشر يوما أو قبل ذلك فإنها أيام حيض فإذا رأت الدم أكثر من خمسة عشر يوما فإنها تقضي صلاة أربعة عشر يوما ثم تدع الصلاة بعد ذلك أقل ما تحيض النساء وهو يوم وليلة ‏.‏ قال أبو عيسى واختلف أهل العلم في أقل الحيض وأكثره فقال بعض أهل العلم أقل الحيض ثلاثة وأكثره عشرة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يأخذ ابن المبارك وروي عنه خلاف هذا ‏.‏ وقال بعض أهل العلم منهم عطاء بن أبي رباح أقل الحيض يوم وليلة وأكثره خمسة عشر يوما ‏.‏ وهو قول مالك والأوزاعي والشافعي وأحمد وإسحاق وأبي عبيد ‏.‏",
      "text_en": " Hamnah bint Jahsh narrated:                     \"I had a case of blood flow that was severe and excessive. So I went to the Prophet to inform him and ask him about it. I found him in the house of my sister Zainab bint Jahsh. I said, 'O Messenger of Allah! I suffer from a case of severe and excessive blood flow. So what do you order me to do for it, and does this prevent me from fasting and performing Salat?' He said: 'Tie a cotton rag around yourself and the bIood will go away.' I said, 'It is more than that.' He said: 'Make it tight.' I said, 'It is more than that.' He said: 'Then use a cloth (to bind it).' I said, it is more than that. It flows too much.' So the Prophet said: 'I will order you to do one of two things, which ever of them you do, it will be acceptable for you. You should know which of them you are able to do.' Then he said: 'This is only a blow from Shaitan. Menstruate for six or seven days, which Allah knows, then perform Ghusl. When you see that you have become pure and clean, then perform Salat for twenty-three or twenty-four nights and their days. Perform Salat and fast, and that will be acceptable for you. So do this (if you can) just as (other) women who menstruate and become pure during their periods of menstruation and purity. If (not, and) you are able to delay Zuhr and hasten Asr then perform Ghusl when you have become pure, and pray Zuhr and Asr together. Then delay Maghrib and hasten Isha, then perform Ghusl and combine the two prayers. So do this (if you are able). Then perform Ghusl with the dawn and pray. Do this, and fast if you are able to do so.' Then Allah's Messenger said: 'That is what is preferable to me of the two.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1419",
      "hadith_no": "1419",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا عبد العزيز بن المطلب، عن عبد الله بن الحسن، عن إبراهيم بن محمد بن طلحة، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏ قال وفي الباب عن علي وسعيد بن زيد وأبي هريرة وابن عمر وابن عباس وجابر ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن وقد روي عنه من غير وجه ‏.‏ وقد رخص بعض أهل العلم للرجل أن يقاتل عن نفسه وماله ‏.‏ وقال ابن المبارك يقاتل عن ماله ولو درهمين ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Prophet (ﷺ) said: \"Whoever is killed over his wealth, then he is martyr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "20511",
        "19809",
        "11827",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1420",
      "hadith_no": "1420",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، قال حدثنا محمد بن عبد الوهاب الكوفي، شيخ ثقة عن سفيان الثوري، عن عبد الله بن الحسن بن الحسن بن علي بن أبي طالب، حدثني إبراهيم بن محمد بن طلحة، قال سفيان وأثنى عليه خيرا قال سمعت عبد الله بن عمرو يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أريد ماله بغير حق فقاتل فقتل فهو شهيد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"If someone tries to get another's wealth without right, and he fights and is killed, then he is a martyr.\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20012",
        "11827",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1420-2",
      "hadith_no": "1420",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عبد الله بن الحسن، عن إبراهيم بن محمد بن طلحة، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " (Another chain of narration) from 'Abdullah bin 'Amr, from the Prophet (ﷺ) with similar meaning.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "19809",
        "11827",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4088",
      "hadith_no": "4088",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا سفيان، قال حدثني عبد الله بن حسن، عن إبراهيم بن محمد بن طلحة، أنه سمع عبد الله بن عمرو، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ من أريد ماله بغير حق فقاتل فقتل فهو شهيد ‏\"‏ ‏.‏ هذا خطأ والصواب حديث سعير بن الخمس ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Muhammad bin Talhah that he heard 'Abdullah bin 'Amr narrating:                     From the Prophet [SAW], that he said: \"If a person's wealth is sought without right, and he fights (to protect it) and is killed, he is a martyr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11827",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4089",
      "hadith_no": "4089",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا معاوية بن هشام، قال حدثنا سفيان، عن عبد الله بن الحسن، عن إبراهيم بن محمد بن طلحة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20609",
        "20012",
        "19809",
        "11827",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-665",
      "hadith_no": "665",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، - إملاء على من كتابه وكان السائل غيري - أنبأنا ابن جريج عن عبد الله بن محمد بن عقيل عن إبراهيم بن محمد بن طلحة عن عمر بن طلحة عن أم حبيبة بنت جحش قالت كنت أستحاض حيضة كثيرة طويلة ‏.‏ قالت فجئت إلى النبي  صلى الله عليه وسلم  أستفتيه وأخبره ‏.‏ قالت فوجدته عند أختي زينب ‏.‏ قالت قلت يا رسول الله إن لي إليك حاجة ‏.‏ قال ‏\"‏ وما هي أى هنتاه ‏\"‏ ‏.‏ قلت إني أستحاض حيضة طويلة كبيرة وقد منعتني الصلاة والصوم فما تأمرني فيها قال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قلت هو أكثر ‏.‏ فذكر نحو حديث شريك ‏.‏",
      "text_en": " It was narrated that Umm Habibah bint Jahsh said:                     \"I used to bleed continuously and heavily. I went to the Prophet asking him for advice and telling him (about my situation). I found him with my sister Zainab and said: 'o Messenger of Allah! I need to ask you something.' He said: 'What is it?' I said: 'I bleed continuously and heavily, and that is keeping me from prayer and fasting. What do you command me to do about it?' He said: 'I advise you to use a piece of cotton, for that will take away the blood.' I said: 'It is more than that.'\" And he mentioned something like the Hadith of Sharik (below).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "11070",
        "12246",
        "11827",
        "22156"
      ]
    },
    {
      "id": "sunan-ibn-majah-670",
      "hadith_no": "670",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شريك، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش أنها استحيضت على عهد رسول الله  صلى الله عليه وسلم  فأتت رسول الله  صلى الله عليه وسلم  فقالت إني استحضت حيضة منكرة شديدة ‏.‏ قال لها ‏\"‏ احتشي كرسفا ‏\"‏ ‏.‏ قالت له إنه أشد من ذلك إني أثج ثجا ‏.‏ قال ‏\"‏ تلجمي وتحيضي في كل شهر في علم الله ستة أيام أو سبعة أيام ثم اغتسلي غسلا فصلي وصومي ثلاثة وعشرين أو أربعة وعشرين وأخري الظهر وقدمي العصر واغتسلي لهما غسلا وأخري المغرب وعجلي العشاء واغتسلي لهما غسلا وهذا أحب الأمرين إلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamnah bint Jahsh that:                     She experienced prolonged non-menstrual bleeding during the time of the Messenger of Allah. She came to the Messenger of Allah and said: \"I am suffering prolonged and painful bleeding.\" He said: \"Fill it with a pad of cloth.\" She said: \"It is worse than that, it is flowing copiously.\" He said: \"Then bind yourself with a cloth and observe your menses for six or seven days, in the knowledge of Allah, then have a bath and perform prayer and fast for twenty-three or twenty-four days. Delay Zuhr and bring 'Asr forward, and take (one) bath for both, and delay Maghrib and bring 'Isha' forward, and have (one) bath for both. That is what I prefer of the two matters.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20587",
        "12246",
        "11827",
        "578",
        "72"
      ]
    }
  ],
  "total_hadiths": 10
}