{
  "id": "11834",
  "name": "al-Harith bin 'Abdur Rahman الحارث بن عبد الرحمن بن عبد الله",
  "full_name": "al-Harith bin 'Abdur Rahman الحارث بن عبد الرحمن بن عبد الله",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "146",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  ت  س  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Dausi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11417",
      "name": "Isma'il bin Umayya bin 'Amr إسماعيل بن أمية بن عمرو",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20553",
      "name": "Safwan bin 'Isa al-Zhry صفوان بن عيسى الزهري أبو محمد البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن الحارث بن، عبد الرحمن بن أبي ذباب عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال كنا نخرج زكاة الفطر من ثلاثة أصناف الأقط والتمر والشعير ‏.‏",
      "text_en": " Abu Sa'id al Khudri reported:                      We used to take out the Zakat of Fitr in three kinds, cheese, dates and barley.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11834",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "6914",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن موسى بن عبد الله بن موسى بن عبد الله بن يزيد الأنصاري، حدثنا أنس بن عياض، حدثني الحارث بن أبي ذباب، عن يزيد، - وهو ابن هرمز - وعبد الرحمن الأعرج قالا سمعنا أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احتج آدم وموسى عليهما السلام عند ربهما فحج آدم موسى قال موسى أنت آدم الذي خلقك الله بيده ونفخ فيك من روحه وأسجد لك ملائكته وأسكنك في جنته ثم أهبطت الناس بخطيئتك إلى الأرض فقال آدم أنت موسى الذي اصطفاك الله برسالته وبكلامه وأعطاك الألواح فيها تبيان كل شىء وقربك نجيا فبكم وجدت الله كتب التوراة قبل أن أخلق قال موسى بأربعين عاما ‏.‏ قال آدم فهل وجدت فيها ‏{‏ وعصى آدم ربه فغوى‏}‏ قال نعم ‏.‏ قال أفتلومني على أن عملت عملا كتبه الله على أن أعمله قبل أن يخلقني بأربعين سنة قال رسول الله صلى الله عليه وسلم ‏\"‏ فحج آدم موسى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There was an argument between Adam and Moses (peace be upon both of them) in the presence of their Lord. Adam came the better of Moses. Moses said: Are you that Adam whom Allah created with His Hand and breathed into himHis sprit, and commanded angels to fall in prostration before him and He made you live in Paradise with comfort and ease. Then you caused the people to get down to the earth because of your lapse. Adam said: Are you that Moses whom Allah selected for His Messengership and for His conversation with him and conferred upon you the tablets, in which everything was clearly explained and granted you the audience in order to have confidential talk with you. What is your opinion, how long Torah would haye been written before I was created? Moses said: Forty years before. Adam said: Did you not see these words: Adam committed an error and he was enticed to (do so). He (Moses) said: Yes. Whereupon, he (Adam) said: Do you then blame me for an act which Allah had ordained for me forty years before He created me? Allah's Messenger (may peace be upon him) said: This is how Adam came the better of Moses.",
      "chain": [
        "30410",
        "20157",
        "11834",
        "10627"
      ]
    },
    {
      "hadith_no": "6989",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا أنس بن عياض، حدثنا الحارث، - وهو ابن عبد الرحمن بن أبي ذباب - عن عطاء بن ميناء، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يقولن أحدكم اللهم اغفر لي إن شئت اللهم ارحمني إن شئت ‏.‏ ليعزم في الدعاء فإن الله صانع ما شاء لا مكره له ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      None of you should say to Allah (like this): O Allah, grant me mercy, if thou so likest. The supplication (of his) should (be permeated with) conviction (that it would be accepted by the Lord), for Allah is the Doer of (everything) He likes to do, and there is none to force Him (to do or not to do this or that).",
      "chain": [
        "30410",
        "20157",
        "11834",
        "11205",
        "13"
      ]
    },
    {
      "hadith_no": "639",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو موسى الأنصاري، حدثنا عاصم بن عبد العزيز المدني، حدثنا الحارث بن عبد الرحمن بن أبي ذباب، عن سليمان بن يسار، وبسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فيما سقت السماء والعيون العشر وفيما سقي بالنضح نصف العشر ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك وابن عمر وجابر ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن بكير بن عبد الله بن الأشج عن سليمان بن يسار وبسر بن سعيد عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وكأن هذا أصح ‏.‏ وقد صح حديث ابن عمر عن النبي صلى الله عليه وسلم في هذا الباب وعليه العمل عند عامة الفقهاء ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"For what is watered by the heavens and steams, the Ushr is due, and for what is watered by irrigation, half of the  Ushr.\"",
      "chain": [
        "11834",
        "11005",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا صفوان بن عيسى، حدثنا الحارث بن عبد الرحمن بن أبي ذباب، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما خلق الله آدم ونفخ فيه الروح عطس فقال الحمد لله فحمد الله بإذنه فقال له ربه يرحمك الله يا آدم اذهب إلى أولئك الملائكة إلى ملإ منهم جلوس فقل السلام عليكم ‏.‏ قالوا وعليك السلام ورحمة الله ‏.‏ ثم رجع إلى ربه فقال إن هذه تحيتك وتحية بنيك بينهم ‏.‏ فقال الله له ويداه مقبوضتان اختر أيهما شئت قال اخترت يمين ربي وكلتا يدى ربي يمين مباركة ‏.‏ ثم بسطها فإذا فيها آدم وذريته فقال أى رب ما هؤلاء فقال هؤلاء ذريتك فإذا كل إنسان مكتوب عمره بين عينيه فإذا فيهم رجل أضوؤهم أو من أضوئهم ‏.‏ قال يا رب من هذا قال هذا ابنك داود قد كتبت له عمر أربعين سنة ‏.‏ قال يا رب زده في عمره ‏.‏ قال ذاك الذي كتبت له ‏.‏ قال أى رب فإني قد جعلت له من عمري ستين سنة قال أنت وذاك ‏.‏ قال ثم أسكن الجنة ما شاء الله ثم أهبط منها فكان آدم يعد لنفسه ‏.‏ قال فأتاه ملك الموت فقال له آدم قد عجلت قد كتب لي ألف سنة ‏.‏ قال بلى ولكنك جعلت لابنك داود ستين سنة فجحد فجحدت ذريته ونسي فنسيت ذريته ‏.‏ قال فمن يومئذ أمر بالكتاب والشهود ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم من رواية زيد بن أسلم عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “When Allah created Adam, He breathed the soul into him, then he sneezed and said: ‘All praise is due to Allah.’ So he praised Allah by His permission. Then His Lord said to him: ‘May Allah have mercy upon you O Adam. Go to those angels – to that gathering of them sitting – so say: “As-Salamu Alaikas-Salamu, Wa Rahmatullah’ Then he returned to his Lord, He said: ‘This is your greeting and the greeting of your children among each other.’ Then Allah said to him – while His Two Hands were closed – ‘Choose which of them you wish.’ He said:  ‘I chose the right My Lord and both of the Hands of my Lord are right, blessed.’ Then He extended it, and there was Adam and his offspring in it.’ So he said: ‘What are these O my Lord?’ He said: ‘These are your offspring?’ Each one of them had his age written between his eyes. But among them there was a man who was the most illuminating of them – or among the most illuminated of them. He said: ‘O Lord! Who is this?’ He said: ‘This is your son Dawud, I wrote forty years for him.’ He said: ‘O Lord! Add to his age.’ He said: ‘That is what I have written for him.’ He said: ‘O Lord! Give him sixty of my years.’ He said: ‘So you shall have it.’” He said: “Then, he resided in Paradise as long as Allah willed, then he was cast from it, so Adam was counting for himself.” He said: “So the Angel of death came to him, and Adam said to him: ‘You are hasty, one-thousand years were written for me.’ He said: ‘Of course! But you gave sixty years to your son Dawud.’ So he rejected, and his offspring rejected, and he forgot, and his offspring forgot.” He said: “So ever since that day, what is written and witnessed has been decreed.”",
      "chain": [
        "30160",
        "20553",
        "11834",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4063",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا يحيى بن اليمان، عن شيخ، من بني زهرة عن الحارث بن عبد الرحمن بن أبي ذباب، عن طلحة بن عبيد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ لكل نبي رفيق ورفيقي - يعني في الجنة عثمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ليس إسناده بالقوي وهو منقطع ‏.‏",
      "text_en": " Narrated Talhah bin 'Ubaidullah:                     that the Messenger of Allah (ﷺ) said: \"For every Prophet there is a friend (Rafiq), and my friend\" - meaning in Paradise - \"is 'Uthman.\"",
      "chain": [
        "30478",
        "11834",
        "6"
      ]
    },
    {
      "hadith_no": "2511",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن علي بن حرب، قال حدثنا محرز بن الوضاح، عن إسماعيل، - وهو ابن أمية - عن الحارث بن عبد الرحمن بن أبي ذباب، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال فرض رسول الله صلى الله عليه وسلم صدقة الفطر صاعا من شعير أو صاعا من تمر أو صاعا من أقط ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah enjoined Sadaqatul Fitr, a Sa' of barley or a Sa of dates or a Sa' of cottage cheese.\"",
      "chain": [
        "38553",
        "28554",
        "11417",
        "11834",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "3553",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا داود بن عبد الله، عن عبد العزيز بن محمد، عن الحارث بن أبي ذباب، عن عمه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا شرب أحدكم فلا يتنفس في الإناء فإذا أراد أن يعود فلينح الإناء ثم ليعد إن كان يريد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “When anyone of you drinks, let him not breathe into the vessel.Ifhe wants to continue drinking, let him move the vessel away (inorderto breathe) then bring it back, if he wants.”",
      "chain": [
        "30201",
        "11333",
        "20167",
        "11834",
        "13"
      ]
    }
  ],
  "total_hadiths": 8
}