{
  "id": "11832",
  "name": "Bakayr bin Masmar بكير بن مسمار",
  "full_name": "Bakayr bin Masmar بكير بن مسمار",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "153",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  ت  س  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20518",
      "name": "Muhajir bin Masmar مهاجر بن مسمار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20254",
      "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20597",
      "name": "'Amr bin Muhammad al-Anqazi عمرو بن محمد العنقزي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20120",
      "name": "al-Waqidi محمد بن عمر بن واقد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6373",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، - وتقاربا في اللفظ - قالا حدثنا حاتم، - وهو ابن إسماعيل - عن بكير بن مسمار، عن عامر بن سعد بن أبي وقاص، عن أبيه، قال أمر معاوية بن أبي سفيان سعدا فقال ما منعك أن تسب أبا التراب فقال أما ما ذكرت ثلاثا قالهن له رسول الله صلى الله عليه وسلم فلن أسبه لأن تكون لي واحدة منهن أحب إلى من حمر النعم سمعت رسول الله صلى الله عليه وسلم يقول له خلفه في بعض مغازيه فقال له علي يا رسول الله خلفتني مع النساء والصبيان فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى إلا أنه لا نبوة بعدي ‏\"‏ ‏.‏ وسمعته يقول يوم خيبر ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله ويحبه الله ورسوله ‏\"‏ ‏.‏ قال فتطاولنا لها فقال ‏\"‏ ادعوا لي عليا ‏\"‏ ‏.‏ فأتي به أرمد فبصق في عينه ودفع الراية إليه ففتح الله عليه ولما نزلت هذه الآية ‏{‏ فقل تعالوا ندع أبناءنا وأبناءكم‏}‏ دعا رسول الله صلى الله عليه وسلم عليا وفاطمة وحسنا وحسينا فقال ‏\"‏ اللهم هؤلاء أهلي ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated. on the authority of Shu'ba with the same chain of transmitters. Amir b. Sa'd b. Abi Waqqas reported on the authority of his father that Muawiya b. Abi Sufyin appointed Sa'd as the Governor and said:                      What prevents you from abusing Abu Turab (Hadrat 'Ali), whereupon be said: It is because of three things which I remember Allah's Messenger (may peace be upon him) having said about him that I would not abuse him and even if I find one of those three things for me, it would be more dear to me than the red camelg. I heard Allah's Messenger (may peace be upon him) say about 'Ali as he left behind hrin in one of his campaigns (that was Tabuk). 'All said to him: Allah's Messenger, you leave me behind along with women and children. Thereupon Allah's Messenger (may peace be upon him) said to him: Aren't you satisfied with being unto me what Aaron was unto Moses but with this exception that there is no prophethood after me. And I (also) heard him say on the Day of Khaibar: I would certainly give this standard to a person who loves Allah and his Messenger and Allah and his Messenger love him too. He (the narrator) said: We have been anxiously waiting for it, when he (the Holy Prophet) said: Call 'Ali. He was called and his eyes were inflamed. He applied saliva to his eyes and handed over the standard to him, and Allah gave him victory. (The third occasion is this) when the (following) verse was revealed:\" Let us summon our children and your children.\" Allah's Messenger (may peace be upon him) called 'Ali, Fitima, Hasan and Husain and said: O Allah, they are my family.",
      "chain": [
        "30367",
        "30377",
        "20159",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6390",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن بكير بن مسمار، عن عامر بن سعد، عن أبيه، أن النبي صلى الله عليه وسلم جمع له أبويه يوم أحد ‏.‏ قال كان رجل من المشركين قد أحرق المسلمين فقال له النبي صلى الله عليه وسلم ‏\"‏ ارم فداك أبي وأمي ‏\"‏ ‏.‏ قال فنزعت له بسهم ليس فيه نصل فأصبت جنبه فسقط فانكشفت عورته فضحك رسول الله صلى الله عليه وسلم حتى نظرت إلى نواجذه ‏.‏",
      "text_en": " 'Amir b. Sa'd reported oLi the authority of his father that Allah's Apostle (may peace be upon him) gathered for him on the Day of Uhud his parents when a polytheist had set fire to (i. e. attacked fiercely) the Muslims. Thereupon Allah's Apostle (may peace be upon him) said to him:                      (Sa'd), shoot an arrow, (Sa'd), may my mother and father be taken as ransom for you. I drew an arrow and I shot a featherless arrow at him aiming his side that lie fell down and his private parts were exposed. Allah's Messenger (may peace be upon him) laughed that I saw his front teeth.",
      "chain": [
        "30377",
        "20159",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "7621",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعباس بن عبد العظيم، - واللفظ لإسحاق - قال عباس حدثنا وقال، إسحاق أخبرنا - أبو بكر الحنفي، حدثنا بكير بن مسمار، حدثني  عامر بن سعد، قال كان سعد بن أبي وقاص في إبله فجاءه ابنه عمر فلما رآه سعد قال أعوذ بالله من شر هذا الراكب فنزل فقال له أنزلت في إبلك وغنمك وتركت الناس يتنازعون الملك بينهم فضرب سعد في صدره فقال اسكت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله يحب العبد التقي الغني الخفي ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Amir b. Sa'd that Sa'd b. Abi Waqqas was in the fold of his camels that his son 'Umar came to him. When Sa'd saw him he said:                      I seek refuge with Allah from the mischief of this rider. And as he got down he said to him: You are busy with your camels and your sheep and you have abandoned people who are contending with one another for kingdom. Sa'd struck his chest and said: Keep quite. I heard Allah's Messenger (may peace be upon him) as saying: Allah loves the servant who is God-conscious and is free from want and is hidden (from the view of people).",
      "chain": [
        "30123",
        "30437",
        "20254",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن بكير بن مسمار، هو مدني ثقة عن عامر بن سعد بن أبي وقاص، عن أبيه، قال لما أنزل الله هذه الآية ‏:‏ ‏(‏ ندع أبناءنا وأبناءكم ‏)‏ دعا رسول الله صلى الله عليه وسلم عليا وفاطمة وحسنا وحسينا فقال ‏\"‏ اللهم هؤلاء أهلي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated 'Amir bin Sa'd bin Abi Waqqas:                     from his father who said: \"When this Ayah was revealed: 'Come, let us call our sons and your sons, our women and your women... (3:61)' the Messenger of Allah (ﷺ) called 'Ali, Fatimah, Hasan and Husain and said: 'O Allah! This is my family.'\"",
      "chain": [
        "30367",
        "20159",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4090",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن بكير بن مسمار، عن عامر بن سعد بن أبي وقاص، عن أبيه، قال أمر معاوية بن أبي سفيان سعدا فقال ما يمنعك أن تسب أبا تراب قال أما ما ذكرت ثلاثا قالهن رسول الله صلى الله عليه وسلم فلن أسبه لأن تكون لي واحدة منهن أحب إلى من حمر النعم سمعت رسول الله صلى الله عليه وسلم يقول لعلي وخلفه في بعض مغازيه فقال له علي يا رسول الله تخلفني مع النساء والصبيان فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى إلا أنه لا نبوة بعدي ‏\"‏ ‏.‏ وسمعته يقول يوم خيبر ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله ويحبه الله ورسوله ‏\"‏ ‏.‏ قال فتطاولنا لها فقال ‏\"‏ ادع لي عليا ‏\"‏ ‏.‏ فأتاه وبه رمد فبصق في عينه فدفع الراية إليه ففتح الله عليه ‏.‏ وأنزلت هذه الآية ‏:‏ ‏(‏ قل تعالوا ندع أبناءنا وأبناءكم ‏)‏ الآية دعا رسول الله صلى الله عليه وسلم عليا وفاطمة وحسنا وحسينا فقال ‏\"‏ اللهم هؤلاء أهلي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Amir bin Sa'd bin Abi Waqqas:                     from his father, saying \"Mu'awiyah bin Abu Sufyan ordered Sa'd, saying 'What prevented you from reviling Abu Turab?' He said: 'Three things that I remember from the Messenger of Allah (ﷺ) prevent me from reviling him. That I should have even one those things is more beloved to me than red camels. I heard the Messenger of Allah (ﷺ) speaking to 'Ali, and he had left him behind in one of his battles. So 'Ali said to him: \"O Messenger of Allah! You leave me behind with women and children?\" So the Messenger of Allah (ﷺ) said to him: \"Are you not pleased that you should be in the position with me that Harun was with Musa? Except that there is no Prophethood after me?\" And on the Day of (the battle of) Khaibar, I heard him saying: \"I shall give the banner to a man who loves Allah and His Messenger, and Allah and His Messenger love him.\" So we all waited for that, then he said: \"Call 'Ali for me.\" He said: 'So he came to him, and he had been suffering from Ramad (an eye condition), so he (ﷺ) put spittle in his eye and gave the banner to him, then Allah granted him victory. And when this Ayah was revealed: 'Let us call our sons and your sons, our women and your women...' (3:61) the Messenger of Allah (ﷺ) called 'Ali, Fatimah, Hasan, and Husain and said: \"O Allah, these are my family.\"",
      "chain": [
        "30367",
        "20159",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3630",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا العباس بن عبد العظيم العنبري، قال حدثنا عبد الكبير بن عبد المجيد، قال حدثنا بكير بن مسمار، قال سمعت عامر بن سعد، عن أبيه، أنه اشتكى بمكة فجاءه رسول الله صلى الله عليه وسلم فلما رآه سعد بكى وقال يا رسول الله أموت بالأرض التي هاجرت منها قال ‏\"‏ لا إن شاء الله ‏\"‏‏.‏ وقال يا رسول الله أوصي بمالي كله في سبيل الله قال ‏\"‏ لا ‏\"‏‏.‏ قال يعني بثلثيه قال ‏\"‏ لا ‏\"‏‏.‏ قال فنصفه قال ‏\"‏ لا ‏\"‏‏.‏ قال فثلثه قال رسول الله صلى الله عليه وسلم ‏\"‏ الثلث والثلث كثير إنك أن تترك بنيك أغنياء خير من أن تتركهم عالة يتكففون الناس ‏\"‏‏.‏",
      "text_en": " 'Amir bin Sa'd (narrated) from his father that he fell sick in Makkah and the Messenger of Allah came to him. When Sa'd saw him, he wept and said:                      \"O Messenger of Allah, am I to die in the land from which I emigrated?\" He said: \"No, if Allah wills.\" He said: \"O Messenger of Allah, shall I bequeath all of my wealth in the cause of Allah?\" He said: \"No.\" He said: \"Two-thirds?\" He said: \"No.\" He said: \"Half of it?\" He said: \"No.\" He said: \"One-third of it?\" The Messenger of Allah said: \"One-third, and one-third is a lot. If you leave your sons independent of means that is better than if you leave them poor, holding out their hands to people.\"",
      "chain": [
        "30437",
        "11832",
        "10554",
        "9"
      ]
    }
  ],
  "total_hadiths": 6
}