{
  "id": "11840",
  "name": "al-Hakam bin Myna'a al-Ansari Mwlahm الحكم بن ميناء",
  "full_name": "al-Hakam bin Myna'a al-Ansari Mwlahm الحكم بن ميناء",
  "grade": "Follower(Tabi')",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2201",
      "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1798",
      "name": "Yazid bin Jariyya ( يزيد بن جارية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10968",
      "name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2039",
      "hadith_no": "2039",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا أبو توبة، حدثنا معاوية، - وهو ابن سلام - عن زيد، - يعني أخاه - أنه سمع أبا سلام، قال حدثني الحكم بن ميناء، أنحدثاه أنهما، سمعا رسول الله صلى الله عليه وسلم يقول على أعواد منبره ‏\"‏ لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم ثم ليكونن من الغافلين ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Umar and Abu Huraira said that they heard Allah's Messenger (may peace be upon him) say on the planks of his pulpit:                      People must cease to neglect the Friday prayer or Allah will seal their hearts and then they will be among the negligent.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30335",
        "20401",
        "11840"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-6",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبان، قال حدثنا يحيى بن أبي كثير، عن الحضرمي بن لاحق، عن زيد، عن أبي سلام، عن الحكم بن ميناء، أنه سمع ابن عباس، وابن، عمر يحدثان أن رسول الله صلى الله عليه وسلم قال وهو على أعواد منبره ‏\"‏ لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم وليكونن من الغافلين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Hakam bin Mina' that:                     He heard Ibn Abbas and Ibn Umar narrated that while he was on the minbar, the Messenger of Allah (ﷺ) said: \"People should stop negleting jumu'ah or Allah (SWT) will place a seal on their hearts and they will be deemed as being among the negligent.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20218",
        "20577",
        "11449",
        "12060",
        "15",
        "11840",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-794",
      "hadith_no": "794",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن الحكم بن ميناء، أخبرني ابن عباس، وابن، عمر أنهما سمعا النبي  صلى الله عليه وسلم  يقول على أعواده ‏\"‏ لينتهين أقوام عن ودعهم الجماعات أو ليختمن الله على قلوبهم ثم ليكونن من الغافلين ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas and Ibn 'Umar narrated that:                     They heard the Prophet say on his pulpit: \"People should desist from failing to attend the congregations, otherwise Allah will seal their hearts, and they will be among the negligent.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20318",
        "20295",
        "11449",
        "11840",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}