{
  "id": "11845",
  "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
  "full_name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  م  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11260",
      "name": "'Ayyad bin 'Abdullah bin Sa'd عياض بن عبد الله بن سعد بن أبي سرح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19054",
      "name": "Musa bin Yasar al-Urdani موسى بن يسار الأردني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13533",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد الله بن أقرم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-480-5",
      "hadith_no": "480",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق، قالا أخبرنا أبو عامر العقدي، حدثنا داود بن قيس، حدثني إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي، قال نهاني حبي صلى الله عليه وسلم أن أقرأ راكعا أو ساجدا ‏.‏",
      "text_en": " 'Ali reported:                      My loved one (the Holy Prophet) forbade me that I should recite (the Qur'an) in a state of bowing and prostration.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30312",
        "20443",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-1301",
      "hadith_no": "1301",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أحمد بن عبد الرحمن بن وهب، حدثني عمي عبد الله، حدثني داود بن قيس، عن زيد بن أسلم، بهذا الإسناد وفي معناه قال ‏\"‏ يسجد سجدتين قبل السلام ‏\"‏ ‏.‏ كما قال سليمان بن بلال ‏.‏",
      "text_en": " This hadith has been narrated by Zaid b. Aslam with the same chain of transmitters and he said:                      He should perform two prostrations before the salutation, as it was mentioned by Sulaiman b. Bilal.",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "11845",
        "11163"
      ]
    },
    {
      "id": "sahih-muslim-2090",
      "hadith_no": "2090",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل بن جعفر، عن داود بن قيس، عن عياض بن عبد الله بن سعد، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان يخرج يوم الأضحى ويوم الفطر فيبدأ بالصلاة فإذا صلى صلاته وسلم قام فأقبل على الناس وهم جلوس في مصلاهم فإن كان له حاجة ببعث ذكره للناس أو كانت له حاجة بغير ذلك أمرهم بها وكان يقول ‏\"‏ تصدقوا تصدقوا تصدقوا ‏\"‏ ‏.‏ وكان أكثر من يتصدق النساء ثم ينصرف فلم يزل كذلك حتى كان مروان بن الحكم فخرجت مخاصرا مروان حتى أتينا المصلى فإذا كثير بن الصلت قد بنى منبرا من طين ولبن فإذا مروان ينازعني يده كأنه يجرني نحو المنبر وأنا أجره نحو الصلاة فلما رأيت ذلك منه قلت أين الابتداء بالصلاة فقال لا يا أبا سعيد قد ترك ما تعلم ‏.‏ قلت كلا والذي نفسي بيده لا تأتون بخير مما أعلم ‏.‏ ثلاث مرار ثم انصرف ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that the Messenger of Allah (may peace be upon him) used to go out on the day of Adha and on the day of Fitr and commenced the prayer. And after having observed his prayer and pronounced the salutation, he stood up facing people as they were seated at their places of worship. And if he intended to send out an army he made mention of it to the people, and if he intended any other thing besides it, he commanded them (to do that). He used to say (to the people):                      Give alms, give alms, give alms, and the majority that gave alms was of women. He then returned and this (practice) remained (in vogue) till Marwan b. al- Hakam (came into power). I went out hand in hand with Marwan till we came to the place of worship and there Kathir b. Salt had built a pulpit of clay and brick. Marwan began to tug me with his hand as though he were pulling me towards the pulpit, while I was pulling him towards the prayer. When I saw him doing that I said: What has happened to the practice of beginning with prayer? He said: No, Abu Sa'id, what you are familiar with has been abandoned. I thereupon said (three times and went back): By no means, by Him in Whose hand my life is, you are not doing anything better than what I am familiar with.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11845",
        "11260",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2331",
      "hadith_no": "2331",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا داود، - يعني ابن قيس - عن عياض، بن عبد الله عن أبي سعيد الخدري، قال كنا نخرج إذ كان فينا رسول الله صلى الله عليه وسلم زكاة الفطر عن كل صغير وكبير حر أو مملوك صاعا من طعام أو صاعا من أقط أو صاعا من شعير أو صاعا من تمر أو صاعا من زبيب فلم نزل نخرجه حتى قدم علينا معاوية بن أبي سفيان حاجا أو معتمرا فكلم الناس على المنبر فكان فيما كلم به الناس أن قال إني أرى أن مدين من سمراء الشام تعدل صاعا من تمر فأخذ الناس بذلك ‏.‏ قال أبو سعيد فأما أنا فلا أزال أخرجه كما كنت أخرجه أبدا ما عشت ‏.‏",
      "text_en": " Abd Sa'id al-Khudri reported:                      We, on behalf of every young or old, free man or slave (amongst us), used to take out during the lifetime of the Messenger of Allah (may peace be upon him) as the Zakat of Fitr one sa' of grain, or one sa' of cheese or one sa' of raisins. And we continued taking out these till Mu'awiya b. Abu Sufyan came to us for pilgrimage or 'Umra, and addressed the people on the pulpit and said to them: I see that two mudds of zakat out of the wheat (red) of Syria is equal to one sa' of dates. So the people accepted it. But Abu Sa'id said: I would continue to take out as I used to take out (before, i e. one sa') as long as I live.",
      "usc_msa_ref": "",
      "chain": [
        "11845",
        "11260",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3907",
      "hadith_no": "3907",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا داود بن قيس، عن موسى بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اشترى شاة مصراة فلينقلب بها فليحلبها فإن رضي حلابها أمسكها وإلا ردها ومعها صاع من تمر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be'upon him) as saying:                      He who bought a goat having its udder tied up should go back with it, milk it, and, if he is satisfied with its milk, he should retair it, otherwise he should return it along with a sa' of dates.",
      "usc_msa_ref": "",
      "chain": [
        "11845",
        "19054",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4407",
      "hadith_no": "4407",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا القعنبي، حدثنا داود بن قيس، عن موسى بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صنع لأحدكم خادمه طعامه ثم جاءه به وقد ولي حره ودخانه فليقعده معه فليأكل فإن كان الطعام مشفوها قليلا فليضع في يده منه أكلة أو أكلتين ‏\"‏ ‏.‏ قال داود يعني لقمة أو لقمتين ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When the slave of anyone amongst you prepares food for him and he serves him after having sat close to (and undergoing the hardship of) heat and smoke, he should make him (the slave) sit along with him and make him eat (along with him), and if the food seems to run short, then he should spare some portion for him (from his own share) - (another narrator) Dawud said:\" i. e. a morsel or two\". 4097",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "11845",
        "19054",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5115",
      "hadith_no": "5115",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عثمان بن عمر، ح وحدثني محمد بن رافع، حدثنا أبو المنذر القزاز، كلاهما عن داود بن قيس، عن عبيد الله بن مقسم، عن جابر بن، عبد الله قال بعث رسول الله صلى الله عليه وسلم بعثا إلى أرض جهينة واستعمل عليهم رجلا وساق الحديث بنحو حديثهم ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) sent an expedition to the land of the tribe of Juhaina, and appointed a person as a chief over them.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20262",
        "30375",
        "11845",
        "11521",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6706",
      "hadith_no": "6706",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا داود، - يعني ابن قيس - عن أبي، سعيد مولى عامر بن كريز عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحاسدوا ولا تناجشوا ولا تباغضوا ولا تدابروا ولا يبع بعضكم على بيع بعض وكونوا عباد الله إخوانا ‏.‏ المسلم أخو المسلم لا يظلمه ولا يخذله ولا يحقره ‏.‏ التقوى ها هنا ‏\"‏ ‏.‏ ويشير إلى صدره ثلاث مرات ‏\"‏ بحسب امرئ من الشر أن يحقر أخاه المسلم كل المسلم على المسلم حرام دمه وماله وعرضه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Don't nurse grudge and don't bid him out for raising the price and don't nurse aversion or enmity and don't enter into a transaction when the others have entered into that transaction and be as fellow-brothers and servants of Allah. A Muslim is the brother of a Muslim. He neither oppresses him nor humiliates him nor looks down upon him. The piety is here, (and while saying so) he pointed towards his chest thrice. It is a serious evil for a Muslim that he should look down upon his brother Muslim. All things of a Muslim are inviolable for his brother in faith: his blood, his wealth and his honour.",
      "usc_msa_ref": "",
      "chain": [
        "11845",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6741",
      "hadith_no": "6741",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا داود، - يعني ابن قيس - عن عبيد، الله بن مقسم عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اتقوا الظلم فإن الظلم ظلمات يوم القيامة واتقوا الشح فإن الشح أهلك من كان قبلكم حملهم على أن سفكوا دماءهم واستحلوا محارمهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) said:                      Be on your guardagainst committing oppression, for oppression is a darkness on the Day of Resurrection, and be on your guard against pettimindedness for pettimindedness destroyed those who were before you, as it incited them to shed blood and make lawful what was unlawful for them.",
      "usc_msa_ref": "",
      "chain": [
        "11845",
        "11521",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-562",
      "hadith_no": "562",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، أن عبد الملك بن عمرو، حدثهم عن داود بن قيس، قال حدثني سعد بن إسحاق، عن أبي سعيد المقبري، حدثني أبو ثمامة الحناط، أن كعب بن عجرة، أدركه وهو يريد المسجد أدرك أحدهما صاحبه قال فوجدني وأنا مشبك بيدى فنهاني عن ذلك وقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فأحسن وضوءه ثم خرج عامدا إلى المسجد فلا يشبكن يديه فإنه في صلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b ibn Ujrah:                     AbuThumamah al-Hannat said that Ka'b ibn Ujrah met him while he was going to the mosque; one of the two (companions) met his companion (on his way to the mosque) And he met crossing the fingers of my both hands. He prohibited me to do so, and said: The Messenger of Allah (ﷺ) has said: If any of you performs ablution, and performs his ablution perfectly, and then goes out intending for the mosque, he should not cross the fingers of his hand because he is already in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "11845",
        "11212",
        "13559",
        "4052"
      ]
    },
    {
      "id": "sunan-abi-daud-1616",
      "hadith_no": "1616",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا داود، - يعني ابن قيس - عن عياض بن عبد الله، عن أبي سعيد الخدري، قال كنا نخرج إذ كان فينا رسول الله صلى الله عليه وسلم زكاة الفطر عن كل صغير وكبير حر أو مملوك صاعا من طعام أو صاعا من أقط أو صاعا من شعير أو صاعا من تمر أو صاعا من زبيب فلم نزل نخرجه حتى قدم معاوية حاجا أو معتمرا فكلم الناس على المنبر فكان فيما كلم به الناس أن قال إني أرى أن مدين من سمراء الشام تعدل صاعا من تمر فأخذ الناس بذلك ‏.‏ فقال أبو سعيد فأما أنا فلا أزال أخرجه أبدا ما عشت ‏.‏ قال أبو داود رواه ابن علية وعبدة وغيرهما عن ابن إسحاق عن عبد الله بن عبد الله بن عثمان بن حكيم بن حزام عن عياض عن أبي سعيد بمعناه وذكر رجل واحد فيه عن ابن علية أو صاع حنطة ‏.‏ وليس بمحفوظ ‏.‏",
      "text_en": " Abu sa’id al-khudri said :                      When the Messenger of Allah(May peace be upon him) lived among us, we use to bring forth zakat, on closing the fast of Ramadan one sa’ of grain or of cheese, or of barley, or of dried dates, or of raisens, payable by every young and old freeman and slave. We continued to pay this till mu-awayah came to perform Haj or Umra and he spoke to the people on the pulpit. What he said to the people was : I think that Mudds of the wheat of syrria is equivalent to one sa’ of dried dates. So the people adopted it. Abu sa’id said : But I continued to pay one sa’ of wheat as long as I lived on.Abu Dawud said : this tradition has also been transmitted by Abu sa’id through a different chain of narrators to the same effect. A man has narrated in this version from Ibn-Ulayyah one sa’ of wheat.But this version is not guarded.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "11845",
        "11260",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-2842",
      "hadith_no": "2842",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا القعنبي، حدثنا داود بن قيس، عن عمرو بن شعيب، أن النبي صلى الله عليه وسلم ح وحدثنا محمد بن سليمان الأنباري حدثنا عبد الملك - يعني ابن عمرو - عن داود عن عمرو بن شعيب عن أبيه أراه عن جده قال سئل رسول الله صلى الله عليه وسلم عن العقيقة فقال ‏\"‏ لا يحب الله العقوق ‏\"‏ ‏.‏ كأنه كره الاسم وقال ‏\"‏ من ولد له ولد فأحب أن ينسك عنه فلينسك عن الغلام شاتان مكافئتان وعن الجارية شاة ‏\"‏ ‏.‏ وسئل عن الفرع قال ‏\"‏ والفرع حق وأن تتركوه حتى يكون بكرا شغزبا ابن مخاض أو ابن لبون فتعطيه أرملة أو تحمل عليه في سبيل الله خير من أن تذبحه فيلزق لحمه بوبره وتكفئ إناءك وتوله ناقتك ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather that the Messenger of Allah (ﷺ) was asked  about the aqiqah. He replied: Allah does not like the breaking of ties (uquq), as though he disliked the name. And he said: If anyone has a child born to him and wishes to offer a sacrifice on its behalf, he may offer two resembling sheep for a boy and one for a girl. And he was asked about fara'. He replied: Fara' is right. If you leave it (i.e. let it grow till it becomes a healthy camel of one year or two years, then you give it to a widow or give it in the path of Allah for using it as a riding beast, it is better than slaughtering it at the age when its meat is stuck to its hair, and you turn over your milking vessel and annoy your she-camel.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "11845",
        "19934"
      ]
    },
    {
      "id": "sunan-abi-daud-2892",
      "hadith_no": "2892",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني داود بن قيس، وغيره، من أهل العلم عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن امرأة، سعد بن الربيع قالت يا رسول الله إن سعدا هلك وترك ابنتين ‏.‏ وساق نحوه قال أبو داود وهذا هو الصواب ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The wife of Sa'd b. al-Rabi said: Messenger of Allah, Sa'd died and left two daughters. He then narrated the rest of the tradition in a similar way.Abu Dawud said: This is the most correct tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11845",
        "12246",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3846",
      "hadith_no": "3846",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا القعنبي، حدثنا داود بن قيس، عن موسى بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صنع لأحدكم خادمه طعاما ثم جاءه به وقد ولي حره ودخانه فليقعده معه ليأكل فإن كان الطعام مشفوها فليضع في يده منه أكلة أو أكلتين ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying :                      If the servant of any of you prepares food for him, and he brings it to him, while he had suffered its heat and smoke. He should make him sit with him to eat. If the food is scanty, he should put one or two morsels in his hand.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "11845",
        "19054",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-274",
      "hadith_no": "274",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن داود بن قيس، عن عبيد الله بن عبد الله بن الأقرم الخزاعي، عن أبيه، قال كنت مع أبي بالقاع من نمرة فمرت ركبة فإذا رسول الله صلى الله عليه وسلم قائم يصلي ‏.‏ قال فكنت أنظر إلى عفرتى إبطيه إذا سجد أى بياضه ‏.‏ قال وفي الباب عن ابن عباس وابن بحينة وجابر وأحمر بن جزء وميمونة وأبي حميد وأبي مسعود وأبي أسيد وسهل بن سعد ومحمد بن مسلمة والبراء بن عازب وعدي بن عميرة وعائشة ‏.‏ قال أبو عيسى وأحمر بن جزء هذا رجل من أصحاب النبي صلى الله عليه وسلم له حديث واحد ‏.‏ قال أبو عيسى حديث عبد الله بن أقرم حديث حسن لا نعرفه إلا من حديث داود بن قيس ولا نعرف لعبد الله بن أقرم الخزاعي عن النبي صلى الله عليه وسلم غير هذا الحديث ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ‏.‏ قال وعبد الله بن أقرم الخزاعي إنما له هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏ وعبد الله بن أرقم الزهري صاحب النبي صلى الله عليه وسلم ‏.‏ وهو كاتب أبي بكر الصديق ‏.‏",
      "text_en": " Ubaidallah bin Abdullah bin Arqam Al-Khuza'I narrated from his father (Abdullah bin Arqam), who said:                     \"I was with my father at the plains of Namirah. I passed by a mount and saw Allah's Messenger standing in Salat.\" He said: \"I was looking at the earthiness of his armpits when he prostrated.\" [That is]: \"Whiteness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "11845"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1306",
      "hadith_no": "1306",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كريب، حدثنا إسحاق بن سليمان الرازي، عن داود بن قيس، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنظر معسرا أو وضع له أظله الله يوم القيامة تحت ظل عرشه يوم لا ظل إلا ظله ‏\"‏ ‏.‏ قال وفي الباب عن أبي اليسر وأبي قتادة وحذيفة وابن مسعود وعبادة وجابر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whoever grants respite to an indigent or alleviates it for him, Allah will shade him on the Day of Judgement under His Throne, a Day in which there is no shade except His shade.\"[He said:] There are narrations on this topic from Abu Al-Yasar, Abu Qatadah, Hudhaifah, Abu Mas'ud, 'Ubadah, and Jabir.[Abu 'Eisa said:] The Hadith if Abu Hurairah is a Hasan Sahih Gharib Hadith from this route.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20310",
        "11845",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-120",
      "hadith_no": "120",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم وسليمان بن داود - واللفظ له - عن ابن نافع، عن داود بن قيس، عن زيد بن أسلم، عن عطاء بن يسار، عن أسامة بن زيد، قال دخل رسول الله صلى الله عليه وسلم وبلال الأسواق فذهب لحاجته ثم خرج قال أسامة فسألت بلالا ما صنع فقال بلال ذهب النبي صلى الله عليه وسلم لحاجته ثم توضأ فغسل وجهه ويديه ومسح برأسه ومسح على الخفين ثم صلى ‏.‏",
      "text_en": " It was narrated that Usamah bin Zaid said:                      \"The Messenger of Allah (ﷺ) and Bilal entered Al-Aswaf [1] and he went to relieve himself and then came out.\" Usamah said: \"I asked Bilal: 'What did he do?' Bilal said: 'The Prophet (ﷺ) went to relieve himself, then he performed Wudu', so he washed his hands and face, and wiped his head and he wiped over his Khuffs, then prayed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11845",
        "11163",
        "11020",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-741",
      "hadith_no": "741",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا إسماعيل بن عمر، قال حدثنا داود بن قيس، عن محمد بن عجلان، عن يحيى بن سعيد، عن أنس بن مالك، أنه رأى رسول الله صلى الله عليه وسلم يصلي على حمار وهو راكب إلى خيبر والقبلة خلفه ‏.‏ قال أبو عبد الرحمن لا نعلم أحدا تابع عمرو بن يحيى على قوله يصلي على حمار وحديث يحيى بن سعيد عن أنس الصواب موقوف والله سبحانه وتعالى أعلم ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that he saw the Messenger of Allah (ﷺ) praying on a donkey while he was riding, praying toward Khaibar with the Qiblah behind him.    Abu 'Abdur-Rahman (An-Nasa'i) said:                      We do not know of anyone who reported anything to support what 'Amr bin Yahya said about praying on a donkey. As for the Hadith of Yahya bin Sa'eed from Anas, what is correct is that it is Mawquf. [1] And Allah knows best.[1] That is a saying or action of a Companion of the Prophet (ﷺ)",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "38114",
        "11845",
        "10616",
        "11062",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1108",
      "hadith_no": "1108",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، قال حدثنا داود بن قيس، عن عبيد الله بن عبد الله بن أقرم، عن أبيه، قال صليت مع رسول الله صلى الله عليه وسلم فكنت أرى عفرة إبطيه إذا سجد ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin Abdullah bin Aqram that his father said:                     \"I prayed with the Messenger of Allah (ﷺ) and I used to see the whiteness of his armpits when he prostrated.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "11845",
        "13533"
      ]
    },
    {
      "id": "sunan-an-nasai-1118",
      "hadith_no": "1118",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا أبو علي الحنفي، وعثمان بن عمر، قال أبو علي حدثنا وقال، عثمان أنبأنا داود بن قيس، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي بن أبي طالب، - رضى الله عنه - قال نهاني حبي صلى الله عليه وسلم عن ثلاث - لا أقول نهى الناس - نهاني عن تختم الذهب وعن لبس القسي وعن المعصفر المفدمة ولا أقرأ ساجدا ولا راكعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abi Talib said:                     \"My beloved (ﷺ) forbade me from doing three things, but I do not say that he forbade the people. He forbade me from wearing gold rings, wearing Qassi, wearing clothes dyed with safflower Mufaddamah, and from reciting the Quran when prostrating or bowing.",
      "usc_msa_ref": "",
      "chain": [
        "20260",
        "20262",
        "4",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-1314",
      "hadith_no": "1314",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن داود بن قيس، قال حدثني علي بن يحيى بن خلاد بن رافع بن مالك الأنصاري، قال حدثني أبي، عن عم، له بدري قال كنت مع رسول الله صلى الله عليه وسلم جالسا في المسجد فدخل رجل فصلى ركعتين ثم جاء فسلم على النبي صلى الله عليه وسلم وقد كان النبي صلى الله عليه وسلم يرمقه في صلاته فرد عليه السلام ثم قال له ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ فرجع فصلى ثم جاء فسلم على النبي صلى الله عليه وسلم فرد عليه السلام ثم قال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ حتى كان عند الثالثة أو الرابعة فقال والذي أنزل عليك الكتاب لقد جهدت وحرصت فأرني وعلمني ‏.‏ قال ‏\"‏ إذا أردت أن تصلي فتوضأ فأحسن وضوءك ثم استقبل القبلة فكبر ثم اقرأ ثم اركع حتى تطمئن راكعا ثم ارفع حتى تعتدل قائما ثم اسجد حتى تطمئن ساجدا ثم ارفع حتى تطمئن قاعدا ثم اسجد حتى تطمئن ساجدا ثم ارفع فإذا أتممت صلاتك على هذا فقد تمت وما انتقصت من هذا فإنما تنتقصه من صلاتك ‏\"‏ ‏.‏",
      "text_en": " Ali bin Yahya bin Khallad bin Raf' bin Malik Al-Ansari said:                     \"My father narrated to me that a paternal uncle of his, who had been at Badr, said: 'I was sitting with the Messenger of Allah (ﷺ) in the masjid when a man came in and prayed two rak'ahs, then he came and greeted the Prophet (ﷺ) with salam. The Prophet (ﷺ) had been watching him as he prayed, so he returned his salam, then he said: \"Go back and pray, for you have not prayed.\" So he went back and prayed, then he came back and greeted the Prophet (ﷺ) with salam. He returned the salam, then he said: \"Go back and pray, for you have not prayed.\" The third or fourth time this happened, then the man said: \"By the One Who revealed the Book to you, I have done my best and have tried hard; show me and teach me.\" He said: 'When you want to pray, perform wudu and do it well, then turn to face the Qiblah and say the takbir. Then recite the Quran, then bow until you are at ease in bowing. Then stand up until you are standing straight, then prostrate until you are at ease prostrating, then sit up until you are at ease sitting, then prostrate until you are at ease prostrating, then get up. If you complete the prayer in this manner you wil hve done it properly, and whatever you do less than this is lacking from you prayer.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "11845"
      ]
    },
    {
      "id": "sunan-an-nasai-1579",
      "hadith_no": "1579",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا داود بن قيس، قال حدثني عياض، عن أبي سعيد، أن رسول الله صلى الله عليه وسلم كان يخرج يوم العيد فيصلي ركعتين ثم يخطب فيأمر بالصدقة فيكون أكثر من يتصدق النساء فإن كانت له حاجة أو أراد أن يبعث بعثا تكلم وإلا رجع ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     The Messenger of Allah (ﷺ) used to go out on the day of 'Eid and pray two rak'ahs, then he would deliver the Khutbah and enjoin giving charity, and the ones who gave most charity were the women. If he had any exigency or he needed to send an army he would speak of that, if not, he would go back.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11845",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2513",
      "hadith_no": "2513",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هناد بن السري، عن وكيع، عن داود بن قيس، عن عياض بن عبد الله، عن أبي سعيد، قال كنا نخرج صدقة الفطر إذ كان فينا رسول الله صلى الله عليه وسلم صاعا من طعام أو صاعا من تمر أو صاعا من شعير أو صاعا من أقط فلم نزل كذلك حتى قدم معاوية من الشام وكان فيما علم الناس أنه قال ما أرى مدين من سمراء الشام إلا تعدل صاعا من هذا ‏.‏ قال فأخذ الناس بذلك ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"We used to pay Salaqatul Fitr when the Messenger of Allah was among us; a Sa' of food, or a Sa' of dates, or a Sa' of barley, or a Sa' of cottage cheese. We continued to do so until Mu'awiyah came from Ash-Sham and one of the things that he taught the people was when he said: I think that two Mudds of wheat from Ash-Sham are equivalent to a Sa' of this, So the people took to that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11845",
        "11260",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2517",
      "hadith_no": "2517",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا داود بن قيس، قال حدثنا عياض، عن أبي سعيد الخدري، قال كنا نخرج في عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو زبيب أو أقط فلم نزل كذلك حتى كان في عهد معاوية قال ما أرى مدين من سمراء الشام إلا تعدل صاعا من شعير ‏.‏",
      "text_en": " It was narrated that Abu Sa' eed Al-Khudri said:                     \"At the time of the Messenger of Allah, we used to give a Sa' of barley, or dates, or raisins, or cottage cheese, and we continued to do so until the time of Mu'awiyah, when he said: 'I think that two Mudds of wheat from Ash-Sham are equivalent to a Sa' of barley.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11845",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-3348",
      "hadith_no": "3348",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا داود بن قيس، عن موسى بن يسار، عن أبي هريرة، قال كان الصداق إذ كان فينا رسول الله صلى الله عليه وسلم عشرة أواق ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The dowry, when the Messenger of Allah was among us, was ten Awaq.\"",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "11845",
        "19054",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4212",
      "hadith_no": "4212",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا داود بن قيس، عن عمرو بن شعيب، عن أبيه، عن جده، قال سئل رسول الله صلى الله عليه وسلم عن العقيقة فقال ‏\"‏ لا يحب الله عز وجل العقوق ‏\"‏ ‏.‏ وكأنه كره الاسم قال لرسول الله صلى الله عليه وسلم إنما نسألك أحدنا يولد له ‏.‏ قال ‏\"‏ من أحب أن ينسك عن ولده فلينسك عنه عن الغلام شاتان مكافأتان وعن الجارية شاة ‏\"‏ ‏.‏ قال داود سألت زيد بن أسلم عن المكافأتان قال الشاتان المشبهتان تذبحان جميعا ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his fahther, that his grandfather said:                     \"The messenger of Allah was asked about the 'Aqiqah and he said: \"Allah, the mighty and sublime, does not like Al-Uquq' as if he disliked the word (Al-Aqiqah). He said to the Messenger of Allah: 'But one of us may offer a sacrifice when a child is born to him.' He said: 'Whoever wants to offer a sacrifice for his child, let him do so, for a boy; two sheep, Mukafaatan, (of equal age), and for a girl, one.' (One of the narrators) Dawud said: 'I asked Ziad bin Aslam about the word Mukafaatan and he said: 'Two similar sheep that are slaughtered together.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11845",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4225",
      "hadith_no": "4225",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني إبراهيم بن يعقوب بن إسحاق، قال حدثنا عبيد الله بن عبد المجيد أبو علي الحنفي، قال حدثنا داود بن قيس، قال سمعت عمرو بن شعيب بن محمد بن عبد الله بن عمرو، عن أبيه، ‏{‏ عن أبيه، ‏}‏ وزيد بن أسلم قالوا يا رسول الله الفرع ‏.‏ قال ‏\"‏ حق فإن تركته حتى يكون بكرا فتحمل عليه في سبيل الله أو تعطيه أرملة خير من أن تذبحه فيلصق لحمه بوبره فتكفئ إناءك وتوله ناقتك ‏\"‏ ‏.‏ قالوا يا رسول الله فالعتيرة قال ‏\"‏ العتيرة حق ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو علي الحنفي هم أربعة إخوة أحدهم أبو بكر وبشر وشريك وآخر ‏.‏",
      "text_en": " 'Amr bin Shu'aib bin Muhammad bin 'Abdullah bin 'Amr (narrated) that his father and Zaid bin Aslam said:                     \"O Messenger of Allah! (What about) the Fara'?\" He said: \"It is a duty, but if you leave it (the animal) until it becomes half-grown and you load upon it (in Jihad) in the cause of Allah or give it to a widow, that is better than if you slaughter it (when it is just born) and its flesh is difficult to separate from its skin, then you turn your vessel upside down (because you will no longer be able to get milk from the mother) and you cause your she-camel to grieve (at the loss of its young).\" They said: \"O Messenger of Allah, (what about) the 'Atirah?\" He said: \"The 'Atirah is a duty.\" (Hasan)Abu 'Abdur-Rahman (An-Nasa'i) said:  Abu 'Ali Al-Hanafi (one of the narrators); they are four brothers: One of them is Abu Bakr, and Bishr, and Sharik, and the other.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "11845",
        "19934"
      ]
    },
    {
      "id": "sunan-an-nasai-4488",
      "hadith_no": "4488",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عبد الله بن الحارث، قال حدثني داود بن قيس، عن ابن يسار، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اشترى مصراة فإن رضيها إذا حلبها فليمسكها وإن كرهها فليردها ومعها صاع من تمر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"whoever buys a Musarraha, if he is please with it when he milks it, he may keep it, and if he is not please with it, he may return it, along with a Sa of daters\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "912",
        "11845",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5172",
      "hadith_no": "5172",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو علي الحنفي، وعثمان بن عمر، قال أبو علي حدثنا وقال، عثمان أنبأنا داود بن قيس، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي، قال نهاني حبي صلى الله عليه وسلم عن ثلاث لا أقول نهى الناس نهاني عن تختم الذهب وعن لبس القسي وعن المعصفر المفدمة ولا أقرأ ساجدا ولا راكعا ‏.‏ تابعه الضحاك بن عثمان ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"My beloved, the Messenger of Allah [SAW], forbade me three things but I do not say that he forbade them to the people. He forbade me from wearing rings of gold, from wearing Al-Qassi, and Al-Mu'asfar Al-Mufaddam (garments that are deeply dyed with safflower), and (he forbade me) from reciting Qur'an when prostrating or bowing.\" He was followed (in that narration) by Ad-Dahhak bin 'Uthman.",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20260",
        "20262",
        "4",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-930",
      "hadith_no": "930",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن داود بن قيس، عن عبد الله بن عبيد الله بن أقرم الخزاعي، عن أبيه، قال كنت مع أبي بالقاع من نمرة فمر بنا ركب فأناخوا بناحية الطريق فقال لي أبي كن في بهمك حتى آتي هؤلاء القوم فأسائلهم ‏.‏ قال فخرج وجئت - يعني دنوت - فإذا رسول الله  صلى الله عليه وسلم  فحضرت الصلاة فصليت معهم فكنت أنظر إلى عفرتى إبطى رسول الله  صلى الله عليه وسلم  كلما سجد ‏.‏ قال ابن ماجه الناس يقولون عبيد الله بن عبد الله وقال أبو بكر بن أبي شيبة يقول الناس عبد الله بن عبيد الله ‏.‏",
      "text_en": " It wasnarrated from (‘Ubaidullah bin ‘Abdullah) bin Aqram Al-Khuza’ithat his father said:                      “I was with my father on the plain inNamirah,*when some riders passed us and made their camels kneel downat theside of the road. My father said to me: ‘Stay with yourlambs until Igo to those people and see what they want.’ He said:Then he (myfather) went out and I came, (i.e., I came near,) thenthere was theMessenger of Allah (ﷺ), and the time for prayer cameso I prayedwith them, and I was looking at the whiteness of thearmpits of theMessenger of Allah (ﷺ) every time he prostrated.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11845"
      ]
    },
    {
      "id": "sunan-ibn-majah-931",
      "hadith_no": "931",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، وصفوان بن عيسى، وأبو داود قالوا حدثنا داود بن قيس، عن عبيد الله بن عبد الله بن أقرم، عن أبيه، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20553",
        "20547",
        "11845",
        "13533"
      ]
    },
    {
      "id": "sunan-ibn-majah-1347",
      "hadith_no": "1347",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، حدثنا داود بن قيس، عن عياض بن عبد الله، أخبرني أبو سعيد الخدري، قال كان رسول الله  صلى الله عليه وسلم  يخرج يوم العيد فيصلي بالناس ركعتين ثم يسلم فيقف على رجليه فيستقبل الناس وهم جلوس فيقول ‏\"‏ تصدقوا تصدقوا ‏\"‏ ‏.‏ فأكثر من يتصدق النساء بالقرط والخاتم والشىء فإن كانت حاجة يريد أن يبعث بعثا ذكره لهم وإلا انصرف ‏.‏",
      "text_en": " AbuSa’eed Al-Khudri said:                      “The Messenger of Allah (ﷺ) used to goout on the day of ‘Eid and lead the people in praying two Rak’ah,thenhe would say the Salam and stand on his two feet facing thepeoplewhile they were sitting down. He would say: ‘Give incharity. Give incharity.’ Those who gave most in charity were thewomen, (they wouldgive) earrings and rings and things. If he wantedto send out anexpedition he would mention it, otherwise he wouldleave.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "11845",
        "11260",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1901",
      "hadith_no": "1901",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن داود بن قيس الفراء، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال كنا نخرج زكاة الفطر إذ كان فينا رسول الله  صلى الله عليه وسلم  صاعا من طعام صاعا من تمر صاعا من شعير صاعا من أقط صاعا من زبيب فلم نزل كذلك حتى قدم علينا معاوية المدينة فكان فيما كلم به الناس أن قال لا أرى مدين من سمراء الشام إلا تعدل صاعا من هذا ‏.‏ فأخذ الناس بذلك ‏.‏ قال أبو سعيد لا أزال أخرجه كما كنت أخرجه على عهد رسول الله  صلى الله عليه وسلم  أبدا ما عشت ‏.‏",
      "text_en": " It was narrated that:                     Abu Sa'eed Al-Khudri said: “We used to pay Zakatul-Fitr when the Messenger of Allah was among us, one Sa of food, one Sa of dates, one Sa of barley, one Sa of sun-baked cottage cheese, one Sa of raisins. We continued to do that until Mu'awiyah came to us in Al-Madinah. One of the things he said to the people was: 'I think that two Mudd wheat from Sham is equivalent to one Sa of this (i.e. dates).' So the people followed that.”Abu Sa'eed said: “I'll continue to pay it as I used to pay it at the time of Messenger of Allah for as long as I live.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11845",
        "11260",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-4068",
      "hadith_no": "4068",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا بكر بن عبد الوهاب، حدثنا عبد الله بن نافع، ويونس بن يحيى، جميعا عن داود بن قيس، عن أبي سعيد، مولى عبد الله بن عامر بن كريز عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كل المسلم على المسلم حرام دمه وماله وعرضه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The whole of the Muslim is sacred to his fellow Muslim, hisblood, his wealth and his honor.”",
      "usc_msa_ref": "",
      "chain": [
        "32006",
        "30411",
        "11845",
        "13"
      ]
    }
  ],
  "total_hadiths": 34
}