{
  "id": "11858",
  "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
  "full_name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  د  تم  س  ق  -  صدوق يخطئ ]",
      "Hadith"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "1238",
      "name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11879",
      "name": "'Abdur Rahman bin Abi Sa'id al-Khudri عبد الرحمن بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "63",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن سعيد  هو المقبري  عن شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يقول بينما نحن جلوس مع النبي صلى الله عليه وسلم في المسجد، دخل رجل على جمل فأناخه في المسجد، ثم عقله، ثم قال لهم أيكم محمد والنبي صلى الله عليه وسلم متكئ بين ظهرانيهم‏.‏ فقلنا هذا الرجل الأبيض المتكئ‏.‏ فقال له الرجل ابن عبد المطلب فقال له النبي صلى الله عليه وسلم ‏\"‏ قد أجبتك ‏\"‏‏.‏ فقال الرجل للنبي صلى الله عليه وسلم إني سائلك فمشدد عليك في المسألة فلا تجد على في نفسك‏.‏ فقال ‏\"‏ سل عما بدا لك ‏\"‏‏.‏ فقال أسألك بربك ورب من قبلك، آلله أرسلك إلى الناس كلهم فقال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن نصلي الصلوات الخمس في اليوم والليلة قال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن نصوم هذا الشهر من السنة قال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن تأخذ هذه الصدقة من أغنيائنا فتقسمها على فقرائنا فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏‏.‏ فقال الرجل آمنت بما جئت به، وأنا رسول من ورائي من قومي، وأنا ضمام بن ثعلبة أخو بني سعد بن بكر‏.‏ رواه موسى وعلي بن عبد الحميد عن سليمان عن ثابت عن أنس عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While we were sitting with the Prophet in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1013",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد، قال أخبرنا أبو ضمرة، أنس بن عياض قال حدثنا شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يذكر أن رجلا، دخل يوم الجمعة من باب كان وجاه المنبر، ورسول الله صلى الله عليه وسلم قائم يخطب فاستقبل رسول الله صلى الله عليه وسلم قائما فقال يا رسول الله، هلكت المواشي وانقطعت السبل، فادع الله يغيثنا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه فقال ‏\"‏ اللهم اسقنا، اللهم اسقنا، اللهم اسقنا ‏\"‏‏.‏ قال أنس ولا والله ما نرى في السماء من سحاب ولا قزعة ولا شيئا، وما بيننا وبين سلع من بيت ولا دار، قال فطلعت من ورائه سحابة مثل الترس، فلما توسطت السماء انتشرت ثم أمطرت‏.‏ قال والله ما رأينا الشمس ستا، ثم دخل رجل من ذلك الباب في الجمعة المقبلة، ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبله قائما فقال يا رسول الله، هلكت الأموال وانقطعت السبل، فادع الله يمسكها، قال فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم حوالينا ولا علينا، اللهم على الآكام والجبال والآجام والظراب والأودية ومنابت الشجر ‏\"‏‏.‏ قال فانقطعت وخرجنا نمشي في الشمس‏.‏ قال شريك فسألت أنسا أهو الرجل الأول قال لا أدري‏.‏",
      "text_en": " Narrated Sharik bin `Abdullah bin Abi Namir:                     I heard Anas bin Malik saying, \"On a Friday a person entered the main Mosque through the gate facing the pulpit while Allah's Apostle was delivering the Khutba. The man stood in front of Allah's Apostle and said, 'O Allah's Apostle! The livestock are dying and the roads are cut off; so please pray to Allah for rain.' \" Anas added, \"Allah's Apostle (p.b.u.h) raised both his hands and said, 'O Allah! Bless us with rain! O Allah! Bless us with rain! O Allah! Bless us with rain!' \" Anas added, \"By Allah, we could not see any trace of cloud in the sky and there was no building or a house between us and (the mountains of) Sila.\" Anas added, \"A heavy cloud like a shield appeared from behind it (i.e. Sila' Mountain). When it came in the middle of the sky, it spread and then rained.\" Anas further said, \"By Allah! We could not see the sun for a week. Next Friday a person entered through the same gate and at that time Allah's Apostle was delivering the Friday's Khutba. The man stood in front of him and said, 'O Allah's Apostle! The livestock are dying and the roads are cut off, please pray to Allah to withhold rain.' \" Anas added, \"Allah's Apostle I raised both his hands and said, 'O Allah! Round about us and not on us. O Allah! On the plateaus, on the mountains, on the hills, in the valleys and on the places where trees grow.' So the rain stopped and we came out walking in the sun.\" Sharik asked Anas whether it was the same person who had asked for the rain (the last Friday). Anas replied that he did not know.",
      "chain": [
        "30213",
        "20157",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1017",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، هلكت المواشي وانقطعت السبل، فادع الله، فدعا رسول الله صلى الله عليه وسلم فمطروا من جمعة إلى جمعة، فجاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، تهدمت البيوت وتقطعت السبل وهلكت المواشي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم على رءوس الجبال والآكام وبطون الأودية ومنابت الشجر ‏\"‏‏.‏ فانجابت عن المدينة انجياب الثوب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! Livestock are destroyed and the roads are cut off. So please invoke Allah.\" So Allah's Apostle prayed and it rained from that Friday to the next Friday. Then he came to Allah's Apostle I and said, \"O Allah's Apostle! Houses have collapsed, roads are cut off and the livestock are destroyed.\" So Allah's Apostle (p.b.u.h) prayed, \"O Allah! (Let it rain) on the tops of mountains, on the plateaus, in the valleys and over the places where trees grow.\" So the clouds cleared away from Medina as clothes are taken off.",
      "chain": [
        "30103",
        "20001",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1019",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، أنه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله هلكت المواشي، وتقطعت السبل، فادع الله‏.‏ فدعا الله، فمطرنا من الجمعة إلى الجمعة، فجاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله، تهدمت البيوت وتقطعت السبل وهلكت المواشي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم على ظهور الجبال والآكام وبطون الأودية ومنابت الشجر ‏\"‏‏.‏ فانجابت عن المدينة انجياب الثوب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! Livestock are destroyed and the roads are cut off; so please invoke Allah.\" So Allah's Apostle prayed for rain and it rained from that Friday till the next Friday. Then a man came to the Prophet (p.b.u.h) and said, \"O Allah's Apostle! The houses have collapsed, roads are cut off and the livestock are destroyed.\" So Allah's Apostle said, \"O Allah ! (Let it rain) on the tops of the mountains, on the plateaus, in the valleys and over the places where trees grow.\" So the clouds cleared away from Medina as clothes are taken off.",
      "chain": [
        "30355",
        "20001",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1030",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "وقال الأويسي حدثني محمد بن جعفر، عن يحيى بن سعيد، وشريك، سمعا أنسا، عن النبي صلى الله عليه وسلم أنه رفع يديه حتى رأيت بياض إبطيه‏.‏",
      "text_en": " The narrator Anas added that the Prophet () raised his hands (during the invocation) to such an extent that the whiteness of his armpits was visible.",
      "chain": [
        "30105",
        "20173",
        "11062",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن شريك بن عبد الله بن أبي نمر، سمعت أنس بن مالك، يحدثنا عن ليلة، أسري بالنبي صلى الله عليه وسلم من مسجد الكعبة جاء ثلاثة نفر قبل أن يوحى إليه، وهو نائم في مسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم وقال آخرهم خذوا خيرهم‏.‏ فكانت تلك، فلم يرهم حتى جاءوا ليلة أخرى، فيما يرى قلبه، والنبي صلى الله عليه وسلم نائمة عيناه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فتولاه جبريل ثم عرج به إلى السماء‏.‏",
      "text_en": " Narrated Sharik bin `Abdullah bin Abi Namr:                     I heard Anas bin Malik telling us about the night when the Prophet was made to travel from the Ka`ba Mosque. Three persons (i.e. angels) came to the Prophet before he was divinely inspired was an Aspostle), while he was sleeping in Al Masjid-ul-Haram. The first (of the three angels) said, \"Which of them is he?\" The second said, \"He is the best of them.\" That was all that happened then, and he did not see them till they came at another night and he perceived their presence with his heart, for the eyes of the Prophet were closed when he was asleep, but his heart was not asleep (not unconscious). This is characteristic of all the prophets: Their eyes sleep but their hearts do not sleep. Then Gabriel took charge of the Prophet and ascended along with him to the Heaven.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "3718",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن مسكين أبو الحسن، حدثنا يحيى بن حسان، حدثنا سليمان، عن شريك بن أبي نمر، عن سعيد بن المسيب، قال أخبرني أبو موسى الأشعري، أنه توضأ في بيته ثم خرج، فقلت لألزمن رسول الله صلى الله عليه وسلم، ولأكونن معه يومي هذا‏.‏ قال فجاء المسجد، فسأل عن النبي صلى الله عليه وسلم فقالوا خرج ووجه ها هنا، فخرجت على إثره أسأل عنه، حتى دخل بئر أريس، فجلست عند الباب، وبابها من جريد حتى قضى رسول الله صلى الله عليه وسلم حاجته، فتوضأ فقمت إليه، فإذا هو جالس على بئر أريس، وتوسط قفها، وكشف عن ساقيه ودلاهما في البئر، فسلمت عليه ثم انصرفت، فجلست عند الباب، فقلت لأكونن بواب رسول الله صلى الله عليه وسلم اليوم، فجاء أبو بكر فدفع الباب‏.‏ فقلت من هذا فقال أبو بكر‏.‏ فقلت على رسلك‏.‏ ثم ذهبت فقلت يا رسول الله هذا أبو بكر يستأذن‏.‏ فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فأقبلت حتى قلت لأبي بكر ادخل، ورسول الله صلى الله عليه وسلم يبشرك بالجنة‏.‏ فدخل أبو بكر فجلس عن يمين رسول الله صلى الله عليه وسلم معه في القف، ودلى رجليه في البئر، كما صنع النبي صلى الله عليه وسلم، وكشف عن ساقيه، ثم رجعت فجلست وقد تركت أخي يتوضأ ويلحقني، فقلت إن يرد الله بفلان خيرا  يريد أخاه  يأت به‏.‏ فإذا إنسان يحرك الباب‏.‏ فقلت من هذا فقال عمر بن الخطاب‏.‏ فقلت على رسلك‏.‏ ثم جئت إلى رسول الله صلى الله عليه وسلم فسلمت عليه، فقلت هذا عمر بن الخطاب يستأذن‏.‏ فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فجئت فقلت ادخل وبشرك رسول الله صلى الله عليه وسلم بالجنة‏.‏ فدخل، فجلس مع رسول الله صلى الله عليه وسلم في القف عن يساره، ودلى رجليه في البئر، ثم رجعت فجلست، فقلت إن يرد الله بفلان خيرا يأت به‏.‏ فجاء إنسان يحرك الباب، فقلت من هذا فقال عثمان بن عفان‏.‏ فقلت على رسلك‏.‏ فجئت إلى رسول الله صلى الله عليه وسلم فأخبرته‏.‏ فقال ‏\"‏ ائذن له وبشره بالجنة على بلوى تصيبه ‏\"‏ فجئته فقلت له ادخل وبشرك رسول الله صلى الله عليه وسلم بالجنة على بلوى تصيبك‏.‏ فدخل فوجد القف قد ملئ، فجلس وجاهه من الشق الآخر‏.‏ قال شريك قال سعيد بن المسيب فأولتها قبورهم‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I performed ablution in my house and then went out and said, \"Today I shall stick to Allah's Apostle and stay with him all this day of mine (in his service).\" I went to the Mosque and asked about the Prophet . They said, \"He had gone in this direction.\" So I followed his way, asking about him till he entered a place called Bir Aris. I sat at its gate that was made of date-palm leaves till the Prophet finished answering the call of nature and performed ablution. Then I went up to him to see him sitting at the well of Aris at the middle of its edge with his legs uncovered, hanging in the well. I greeted him and went back and sat at the gate. I said, \"Today I will be the gatekeeper of the Prophet.\" Abu Bakr came and pushed the gate. I asked, \"Who is it?\" He said, \"Abu Bakr.\" I told him to wait, went in and said, \"O Allah's Apostle! Abu Bakr asks for permission to enter.\" He said, \"Admit him and give him the glad tidings that he will be in Paradise.\" So I went out and said to Abu Bakr, \"Come in, and Allah's Apostle gives you the glad tidings that you will be in Paradise\" Abu Bakr entered and sat on the right side of Allah's Apostle on the built edge of the well and hung his legs n the well as the Prophet did and uncovered his legs. I then returned and sat (at the gate). I had left my brother performing ablution and he intended to follow me. So I said (to myself). \"If Allah wants good for so-and-so (i.e. my brother) He will bring him here.\" Suddenly somebody moved the door. I asked, \"Who is it?\" He said, \"`Umar bin Al-Khattab.\" I asked him to wait, went to Allah's Apostle, greeted him and said, `Umar bin Al-Khattab asks the permission to enter.\" He said, \"Admit him, and give him the glad tidings that he will be in Paradise.\" I went to \"`Umar and said \"Come in, and Allah's Apostle, gives you the glad tidings that you will be in Paradise.\" So he entered and sat beside Allah's Apostle on the built edge of the well on the left side and hung his legs in the well. I returned and sat (at the gate) and said, (to myself), \"If Allah wants good for so-and-so, He will bring him here.\" Somebody came and moved the door. I asked \"Who is it?\" He replied, \"Uthman bin `Affan.\" I asked him to wait and went to the Prophet and informed him. He said, \"Admit him, and give him the glad tidings of entering Paradise, I asked him to wait and went to the Prophet and informed him. He said, \"Adult him, and give him the glad tidings of entering Paradise after a calamity that will befall him.\" So I went up to him and said to him, \"Come in; Allah's Apostle gives you the glad tidings of entering Paradise after a calamity that will befall you. \"Uthman then came in and found that the built edge of the well was occupied, so he sat opposite to the Prophet on the other side. Sa`id bin Al-Musaiyab said, \"I interpret this (narration) in terms of their graves.\"",
      "chain": [
        "30275",
        "20300",
        "20160",
        "11858",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "4581",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال حدثني شريك بن أبي نمر، أن عطاء بن يسار، وعبد الرحمن بن أبي عمرة الأنصاري، قالا سمعنا أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ ليس المسكين الذي ترده التمرة والتمرتان ولا اللقمة ولا اللقمتان‏.‏ إنما المسكين الذي يتعفف واقرءوا إن شئتم يعني قوله ‏{‏لا يسألون الناس إلحافا‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The poor person is not the one for whom a date or two or a morsel or two (of food is sufficient but the poor person is he who does not (beg or) ask the people (for something) or show his poverty at all. Recite if you wish, (Allah's Statement): \"They do not beg of people at all.\" (2.273)",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11020",
        "1238"
      ]
    },
    {
      "hadith_no": "4612",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد، فلما كان ثلث الليل الآخر قعد فنظر إلى السماء فقال ‏{‏إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏، ثم قام فتوضأ واستن، فصلى إحدى عشرة ركعة، ثم أذن بلال فصلى ركعتين، ثم خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I stayed overnight in the house of my aunt Maimuna. Allah's Apostle talked with his wife for a while and then went to bed. When it was the last third of the night, he got up and looked towards the sky and said: \"Verily! In the creation of the Heavens and the Earth and in the alteration of night and day, there are indeed signs for men of understanding.\" (3.190) Then he stood up, performed ablution, brushed his teeth with a Siwak, and then prayed eleven rak`at. Then Bilal pronounced the Adhan (i.e. call for the Fajr prayer). The Prophet then offered two rak`at (Sunna) prayer and went out (to the Mosque) and offered the (compulsory congregational) Fajr prayer.",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "6286",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال أخبرني شريك، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت في بيت ميمونة والنبي صلى الله عليه وسلم عندها، فلما كان ثلث الليل الآخر أو بعضه قعد فنظر إلى السماء فقرأ ‏{‏إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I stayed overnight at the house of Maimuna and the Prophet was there with her. When it was the last third of the night, or some part of the night, the Prophet got up looking towards the sky and recited: 'Verily! In the creation of the heavens and the earth, and in the alternation of Night and Day, there are indeed signs for men of u understanding.' (3.190)",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "6415",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "قال أبو عبد الله وقال الأويسي حدثني محمد بن جعفر، عن يحيى بن سعيد، وشريك، سمعا أنسا، عن النبي صلى الله عليه وسلم رفع يديه حتى رأيت بياض إبطيه‏.‏",
      "text_en": "",
      "chain": [
        "30184",
        "30105",
        "20173",
        "11062",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "6581",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن عثمان، حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثني شريك بن عبد الله بن أبي نمر، عن عطاء، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله قال من عادى لي وليا فقد آذنته بالحرب، وما تقرب إلى عبدي بشىء أحب إلى مما افترضت عليه، وما يزال عبدي يتقرب إلى بالنوافل حتى أحبه، فإذا أحببته كنت سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها ورجله التي يمشي بها، وإن سألني لأعطينه، ولئن استعاذني لأعيذنه، وما ترددت عن شىء أنا فاعله ترددي عن نفس المؤمن، يكره الموت وأنا أكره مساءته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said, 'I will declare war against him who shows hostility to a pious worshipper of Mine. And the most beloved things with which My slave comes nearer to Me, is what I have enjoined upon him; and My slave keeps on coming closer to Me through performing Nawafil (praying or doing extra deeds besides what is obligatory) till I love him, so I become his sense of hearing with which he hears, and his sense of sight with which he sees, and his hand with which he grips, and his leg with which he walks; and if he asks Me, I will give him, and if he asks My protection (Refuge), I will protect him; (i.e. give him My Refuge) and I do not hesitate to do anything as I hesitate to take the soul of the believer, for he hates death, and I hate to disappoint him.\"",
      "chain": [
        "30214",
        "30463",
        "20160",
        "11858",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "7542",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس، قال بت في بيت ميمونة ليلة والنبي صلى الله عليه وسلم عندها لأنظر كيف صلاة رسول الله صلى الله عليه وسلم بالليل، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد، فلما كان ثلث الليل الآخر أو بعضه قعد فنظر إلى السماء فقرأ ‏{‏إن في خلق السموات والأرض‏}‏ إلى قوله ‏{‏لأولي الألباب‏}‏ ثم قام فتوضأ واستن، ثم صلى إحدى عشرة ركعة، ثم أذن بلال بالصلاة فصلى ركعتين، ثم خرج فصلى للناس الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I stayed overnight at the house of (my aunt ) Maimuna while the Prophet was with her, to see how was the night prayer of Allah s Apostle Allah's Apostle talked to his wife for a while and then slept. When it was the last third of the night (or part of it), the Prophet got up and looked towards the sky and recited the Verse:-- 'Verily! In the creation of the Heavens and the Earth....there are indeed signs for the men of understanding.' (3.190) Then He got up and performed the ablution, brushed his teeth and offered eleven rak`at. Then Bilal pronounced the Adhan whereupon the Prophet offered a two-rak`at (Sunna) prayer and went out to lead the people in Fajr (morning compulsory congregational prayer.",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني سليمان، - وهو ابن بلال - قال حدثني شريك بن عبد الله بن أبي نمر، قال سمعت أنس بن مالك، يحدثنا عن ليلة، أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام وساق الحديث بقصته نحو حديث ثابت البناني وقدم فيه شيئا وأخر وزاد ونقص ‏.‏",
      "text_en": " Anas b. Malik, while recounting the Night journey of the Holy Prophet (may peace be upon him), from the mosque of Ka'bah, reported:                      Three beings (angels) came to him in the mosque of the Ka'bah, while he was sleeping in the sacred mosque before it (the Command of Night Journey and Accension) was revealed to him. The rest of the hadith is narrated like that of Thabit. However, some portions have occurred before and some of them have occurred after; some have been added and some deleted.",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر - قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - وهو ابن جعفر - عن شريك، - يعني ابن أبي نمر - عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، قال خرجت مع رسول الله صلى الله عليه وسلم يوم الاثنين إلى قباء حتى إذا كنا في بني سالم وقف رسول الله صلى الله عليه وسلم على باب عتبان فصرخ به فخرج يجر إزاره فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعجلنا الرجل ‏\"‏ ‏.‏ فقال عتبان يا رسول الله أرأيت الرجل يعجل عن امرأته ولم يمن ماذا عليه قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الماء من الماء ‏\"‏ ‏.‏",
      "text_en": " Sa'id al-Khudri narrated it from his father:                      I went to Quba' with the Messenger of Allah (may peace be upon him) on Monday till we reached (the habitation) of Banu Salim. The Messenger of Allah (may peace be upon him) stood at the door of 'Itban and called him loudly. So he came out dragging his lower garnment. Upon this the Messenger of Allah (may peace be upon him) said: We have made this man to make haste 'Itban said: Messenger of Allah, if a man parts with his wife suddenly without seminal emission, what is he required to do (with regard to bath)? The Messenger of Allah (may peace be upon him) said: It is with the seminal emission that bath becomes obligatory.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11858",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - يعنون ابن جعفر - عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، أنه قال ما صليت وراء إمام قط أخف صلاة ولا أتم صلاة من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported:                      I never prayed behind an Imam who was more brief and more perfect in prayer than the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20387",
        "30399",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1834",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو بكر بن إسحاق، أخبرنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك بن أبي نمر، عن كريب، عن ابن عباس، أنه قال رقدت في بيت ميمونة ليلة كان النبي صلى الله عليه وسلم عندها لأنظر كيف صلاة النبي صلى الله عليه وسلم بالليل - قال - فتحدث النبي صلى الله عليه وسلم مع أهله ساعة ثم رقد ‏.‏ وساق الحديث وفيه ثم قام فتوضأ واستن ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported:                      He spent (one night) in the house of the Messenger of Allah (may peace be upon him). He (the Holy Prophet) got up, brushed his teeth and performed ablution and said:\" In the creation of the heavens and the earth, and the alternation of the night and the day, there are indeed signs for people of understanding\" (al-Qur'an, iii. 190), to the end of the Surah. He then stood up and prayed two rak'ahs, standing, bowing and prostrating himself at length in them. Then he finished, went to sleep and snored. He did that three times, six rak'ahs altogether, each time cleaning his teeth, performing ablution, and reciting these verses. Then he observed three rak'ahs of Witr. The Mu'adhdhin then pronounced the Adhan and he went out for prayer and was saying,:\" O Allah I place light in my heart, light in my tongue, place light in my hearing, place light in my eyesight, place light behind me, and light in front of me, and place light above me, and light below me. O Allah! grant me light.\"",
      "chain": [
        "11108",
        "30232",
        "20173",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2115",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة، وابن، حجر قال يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل بن جعفر، عن شريك بن أبي نمر، عن أنس بن مالك، أنجمعة من باب كان نحو دار القضاء ورسول الله صلى الله عليه وسلم قائم يخطب فاستقبل رسول الله صلى الله عليه وسلم قائما ثم قال يا رسول الله هلكت الأموال وانقطعت السبل فادع الله يغثنا ‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم أغثنا اللهم أغثنا اللهم أغثنا ‏\"‏ ‏.‏ قال أنس ولا والله ما نرى في السماء من سحاب ولا قزعة وما بيننا وبين سلع من بيت ولا دار - قال - فطلعت من ورائه سحابة مثل الترس فلما توسطت السماء انتشرت ثم أمطرت - قال - فلا والله ما رأينا الشمس سبتا - قال - ثم دخل رجل من ذلك الباب في الجمعة المقبلة ورسول الله صلى الله عليه وسلم قائم يخطب فاستقبله قائما فقال يا رسول الله هلكت الأموال وانقطعت السبل فادع الله يمسكها عنا - قال - فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم حولنا ولا علينا اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر ‏\"‏ ‏.‏ فانقلعت وخرجنا نمشي في الشمس ‏.‏ قال شريك فسألت أنس بن مالك أهو الرجل الأول قال لا أدري ‏.‏",
      "text_en": " Anas b. Malik reported that a person entered the mosque through the door situated on theside of Daral-Qada' during Friday (prayer) and the messenger of Allah (may peace be upon him) was delivering the sermon while standing. He came and stood in front of the Messenger of Allah (may peace be upon him) and said:                      Messenger of Allah, the camels died and the passages were blocked; so supplicate Allah to send down rain upon us. The Messenger of Allah (may peace be upon him) raised his hands and then said: (O Allah, send down rain upon us; O Allah, send dowp rain upon us; O Allah, send down rain upon us. Anas said: By Allah, we did not see any cloud or any patch of it, and there was neither any house or building standing between us and the (hillock) Sal'a. There appeared a cloud in the shape of a shield from behind it, and as it (came high) in the sky it spread and then there was a downpour of rain. By Allah, we did not see the sun throughout the week. Then (that very man) came on the coming Friday through the same door when the Messenger of Allah (may peace be upon him) was standing and delivering the sermon. He stood in front of him and said: Messenger of Allah, our animals died and the passages blocked. Supplicate Allah to stop the rain for us. The Messenger of Allah (may peace be upon him) again raised his hands and said: O Allah, let it (rain) fall in our suburbs and not on us, O Allah (send it down) on the hillocks and small mountains and the river-beds and at places where trees grow. The rain stopped, and as we stepped out we were walking in sun- shine. He (the narrator) said to Sharik: I asked Anas b. Malik if he was the same man. He said: I do not know.",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20031",
        "20155",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "2242",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، والوليد بن شجاع السكوني، قال الوليد حدثني وقال الآخران، حدثنا ابن وهب، أخبرني أبو صخر، عن شريك بن عبد، الله بن أبي نمر عن كريب، مولى ابن عباس عن عبد الله بن عباس، أنه مات ابن له بقديد أو بعسفان فقال يا كريب انظر ما اجتمع له من الناس ‏.‏ قال فخرجت فإذا ناس قد اجتمعوا له فأخبرته فقال تقول هم أربعون قال نعم ‏.‏ قال أخرجوه فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من رجل مسلم يموت فيقوم على جنازته أربعون رجلا لا يشركون بالله شيئا إلا شفعهم الله فيه ‏\"‏ ‏.‏ وفي رواية ابن معروف عن شريك بن أبي نمر عن كريب عن ابن عباس ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that his son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said:                      So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (may peace be upon him) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
      "chain": [
        "30280",
        "30492",
        "30482",
        "20733",
        "20029",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، ويحيى بن أيوب، وقتيبة بن سعيد، قال يحيى بن يحيى أخبرنا وقال الآخران، حدثنا إسماعيل بن جعفر، عن شريك، - وهو ابن أبي نمر - عن عطاء بن يسار، عن عائشة، أنها قالت كان رسول الله صلى الله عليه وسلم - كلما كان ليلتها من رسول الله صلى الله عليه وسلم - يخرج من آخر الليل إلى البقيع فيقول ‏\"‏ السلام عليكم دار قوم مؤمنين وأتاكم ما توعدون غدا مؤجلون وإنا إن شاء الله بكم لاحقون اللهم اغفر لأهل بقيع الغرقد ‏\"‏ ‏.‏ ولم يقم قتيبة قوله ‏\"‏ وأتاكم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported (that whenever it was her turn for Allah's Messenger [may peace be upon him] to spend the night with her) he would go out towards the end of the night to al-Baqi' and say:                      Peace be upon you, abode of a people who are believers. What you were promised would come to you tomorrow, you receiving it after some delay; and God willing we shall join you. O Allah, grant forgiveness to the inhabitants of Baqi' al-Gharqad. Qutaiba did not mention his words:\" would come to you\".",
      "chain": [
        "30399",
        "20379",
        "30367",
        "30399",
        "20155",
        "11858",
        "11020",
        "53"
      ]
    },
    {
      "hadith_no": "2441",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، قال ابن أيوب حدثنا إسماعيل، - وهو ابن جعفر - أخبرني شريك، عن عطاء بن يسار، مولى ميمونة عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين بالذي ترده التمرة والتمرتان ولا اللقمة واللقمتان إنما المسكين المتعفف اقرءوا إن شئتم ‏{‏ لا يسألون الناس إلحافا‏}‏ ‏\"‏ ‏.‏",
      "text_en": "  Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Miskin is not he who is dismissed with one or two dates, and with one morsel or two morsels. (In fact) miskin is he who abstains (from begging). Read if you so desire (the verse):\" They beg not of men importunately)\" (ii. 273).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11858",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنيه أبو بكر بن إسحاق، حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، أخبرني شريك، أخبرني عطاء بن يسار، وعبد الرحمن بن أبي عمرة، أنهما سمعا أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث إسماعيل ‏.‏",
      "text_en": "  This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "5462",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وابن، حجر قال يحيى بن يحيى أخبرنا  وقال الآخران، حدثنا إسماعيل، - وهو ابن جعفر - عن شريك، - وهو ابن أبي نمر - عن عبد الله بن أبي عتيق، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن في عجوة العالية شفاء أو إنها ترياق أول البكرة ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      The 'ajwa' dates of 'Aliya' contain heating effects and these are antidote in the early morning.",
      "chain": [
        "30399",
        "20379",
        "30399",
        "20155",
        "11858",
        "53"
      ]
    },
    {
      "hadith_no": "6025",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثني أبو جعفر، محمد بن الصباح وعلي بن حجر السعدي جميعا عن شريك، قال ابن حجر أخبرنا شريك، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ أشعر كلمة تكلمت بها العرب كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest word spoken by an Arab (pre-Islamic) in poetry is this verse of Labid:\" Behold! apart from Allah everything is vain.\"",
      "chain": [
        "20587",
        "11858",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6367",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن مسكين اليمامي، حدثنا يحيى بن حسان، حدثنا سليمان، - وهو ابن بلال - عن شريك بن أبي نمر، عن سعيد بن المسيب، أخبرني أبو موسى الأشعري، أنه توضأ في بيته ثم خرج فقال لألزمن رسول الله صلى الله عليه وسلم ولأكونن معه يومي هذا ‏.‏ قال فجاء المسجد فسأل عن النبي صلى الله عليه وسلم فقالوا خرج ‏.‏ وجه ها هنا - قال - فخرجت على أثره أسأل عنه حتى دخل بئر أريس - قال - فجلست عند الباب وبابها من جريد حتى قضى رسول الله صلى الله عليه وسلم حاجته وتوضأ فقمت إليه فإذا هو قد جلس على بئر أريس وتوسط قفها وكشف عن ساقيه ودلاهما في البئر - قال - فسلمت عليه ثم انصرفت فجلست عند الباب فقلت لأكونن بواب رسول الله صلى الله عليه وسلم اليوم ‏.‏ فجاء أبو بكر فدفع الباب فقلت من هذا فقال أبو بكر ‏.‏ فقلت على رسلك - قال - ثم ذهبت فقلت يا رسول الله هذا أبو بكر يستأذن فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏ ‏.‏ قال فأقبلت حتى قلت لأبي بكر ادخل ورسول الله صلى الله عليه وسلم يبشرك بالجنة - قال - فدخل أبو بكر فجلس عن يمين رسول الله صلى الله عليه وسلم معه في القف ودلى رجليه في البئر كما صنع النبي صلى الله عليه وسلم وكشف عن ساقيه ثم رجعت فجلست وقد تركت أخي يتوضأ ويلحقني فقلت إن يرد الله بفلان - يريد أخاه - خيرا يأت به ‏.‏ فإذا إنسان يحرك الباب فقلت من هذا فقال عمر بن الخطاب ‏.‏ فقلت على رسلك ‏.‏ ثم جئت إلى رسول الله صلى الله عليه وسلم فسلمت عليه وقلت هذا عمر يستأذن فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏ ‏.‏ فجئت عمر فقلت أذن ويبشرك رسول الله صلى الله عليه وسلم بالجنة - قال - فدخل فجلس مع رسول الله صلى الله عليه وسلم في القف عن يساره ودلى رجليه في البئر ثم رجعت فجلست فقلت إن يرد الله بفلان خيرا - يعني أخاه - يأت به فجاء إنسان فحرك الباب فقلت من هذا فقال عثمان بن عفان ‏.‏ فقلت على رسلك - قال - وجئت النبي صلى الله عليه وسلم فأخبرته فقال ‏\"‏ ائذن له وبشره بالجنة مع بلوى تصيبه ‏\"‏ ‏.‏ قال فجئت فقلت ادخل ويبشرك رسول الله صلى الله عليه وسلم بالجنة مع بلوى تصيبك - قال - فدخل فوجد القف قد ملئ فجلس وجاههم من الشق الآخر ‏.‏ قال شريك فقال سعيد بن المسيب فأولتها قبورهم ‏.‏",
      "text_en": " Abu Musa Ash'ari reported that he performed ablution in his house and then came out saying:                      I would remain with Allah's Messenger (may peace be upon him) the whole day long. He came to the mosque, and asked about Allah's Apostle (may peace be upon him). They (his Companions) said: He has gone in this direction. He (Abu Musa Ash'ari) said: I followed his steps asking about him until I came to Bi'r Aris (it is a well in the suburb of Medina). I sat by its wooden door until Allah's Messenger (may peace be upon him) had relieved himself and then performed ablution. I went to him and he was sitting with his shanks uncovered hp to the knees and his legs dangl- ing in that well. I offered him salutations. I then came back and sat at the door as if I had been a chamberlain at the door of Allah's Messenger (may peace be upon him) that day. There came Abu Bakr and knocked the door and I said: Who is it? He said: This is Abu Bakr. I said: Wait, please. I went and said: Allah's Messenger, here is Abu Bakr seeking permission. Thereupon he said: Admit him and give him glad tidings of Paradise. I came and I said to Abu Bakr to get in (and also told him) that Allah's Messenger (may peace be upon him) was giving him the glad tidings of Paradise. Abu Bakr got in and sat on the right side of Allah's Messenger (may peace be upon him) and dangled his feet in the well as Allah's Messenger (may peace be upon him) had done, and he uncovered his shanks. I then returned and sat there and I had left my brother as he had been performing ablution and he was to meet me and I said: If Allah would intend goodness for such and such he would intend goodness for his brother and He would bring him. I was thinking this that a person stirred the door. I said: Who is it. He said: This is Umar b., Khattab. I said: Wait. Then I came to Allah's Messenger (may peace be upon him), greeted him and said: Here is 'Umar seeking your. permission to get in. Thereupon he said: Let him come in and give him glad tid- ings of Paradise. I came to Umar and said: There is permission for you and glad tidings for you from Allah's Messenger (may peace be upon him) for Paradise. He got in and sat on the left side of Allah's Messenger (may peace be upon him) with his feet dangling in the well. I then returned and sat and said: If Allah would intend goodness for such and such (that is for his brother), He would bring him. And I was contemplat- ing over it that a man stirred the door and I said: Who is it? He said: This is Uthman b. Affan. I said: Wait, please. I then came to Allah's Messenger (may peace be upon him) and informed him. and he said: Admit him and give him glad tidings (and inform) him of the turmoil which he shall have to face. I came and said: Get in, Allah's Messenger (may peace be upon him) gives you the glad tidings of Paradise along with the trial which you shall have to face. He got in and saw the elevated plan round the well fully occupied. He sat on the other side. Sharik said that Sa'id b. al-Musayyib reported: I drew a conclusion from it that their groves would be (in this very state, the graves of Hadrat Abu Bakr, 'Umar Faruq by the tide of the Holy Prophet [may peace be upon him] and the grave of Hadrat 'Uthman away from their graves). Abu Musa. reported: I set out with the intention (of meeting) Allah's Messenger (may peace be upon him) and came to know that he had gone to the gardens (in the suburb of Medina). I followed him and found him in a garden sitting upon an elevated place round the well with his shanks uncovered which had been dangling in the well. The rest of the hadith is the same but with this variation that there is no mention of the words of Sa'id: all drew a conclusion from it pertaining to their graves.\"",
      "chain": [
        "30275",
        "20300",
        "20160",
        "11858",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "6368",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنيه أبو بكر بن إسحاق، حدثنا سعيد بن عفير، حدثني سليمان بن بلال، حدثني  شريك بن عبد الله بن أبي نمر، سمعت سعيد بن المسيب، يقول حدثني أبو موسى الأشعري، ها هنا - وأشار لي سليمان إلى مجلس سعيد ناحية المقصورة - قال أبو موسى خرجت أريد رسول الله صلى الله عليه وسلم فوجدته قد سلك في الأموال فتبعته فوجدته قد دخل مالا فجلس في القف وكشف عن ساقيه ودلاهما في البئر ‏.‏ وساق الحديث بمعنى حديث يحيى بن حسان ولم يذكر قول سعيد فأولتها قبورهم ‏.‏",
      "text_en": "",
      "chain": [
        "30233",
        "20160",
        "11858",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "6369",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا حسن بن علي الحلواني، وأبو بكر بن إسحاق قالا حدثنا سعيد بن أبي، مريم حدثنا محمد بن جعفر بن أبي كثير، أخبرني شريك بن عبد الله بن أبي نمر، عن سعيد، بن المسيب عن أبي موسى الأشعري، قال خرج رسول الله صلى الله عليه وسلم يوما إلى حائط بالمدينة لحاجته فخرجت في إثره ‏.‏ واقتص الحديث بمعنى حديث سليمان بن بلال وذكر في الحديث قال ابن المسيب ‏.‏ فتأولت ذلك قبورهم اجتمعت ها هنا وانفرد عثمان ‏.‏",
      "text_en": " Sa'id b. al-Musayyib reported Abu Musa Ash'ari having said that Allah's Messenger (may peace be upon him) set out one day to the suburbs of Medina for reliev- ing himself. I followed his steps. The rest of the hadith is the same. Ibn Musayyib said:                      I concluded (from the manner of their sitting) the (order) of their graves. (The three) would be together (the graves of the Holy Prophet, Hadrat Abu Bakr and Hadrat Umar) and that of 'Uthman would be separate (from them).",
      "chain": [
        "11108",
        "30232",
        "20173",
        "11858",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا أسود بن عامر، حدثنا شريك، وهذا، لفظه ح وحدثنا محمد بن عبد الله، - يعني المخرمي - حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن المغيرة، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا أتى الخلاء أتيته بماء في تور أو ركوة فاستنجى ‏.‏ قال أبو داود في حديث وكيع ثم مسح يده على الأرض ثم أتيته بإناء آخر فتوضأ ‏.‏ قال أبو داود وحديث الأسود بن عامر أتم ‏.‏",
      "text_en": " Narrated Abu Hurayrah :                     When the Prophet (sal Allaahu alayhi wa sallam ) went to the privy, I took to him water in a small vessel  or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel  and he performed ablution.Abu Dawud said : The tradition is transmitted by al-Aswad b. 'Amir is more perfect.",
      "chain": [
        "38072",
        "20380",
        "20587",
        "30271",
        "20032",
        "11858",
        "18002",
        "166",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "256",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، حدثنا شريك، عن قيس بن وهب، عن رجل، من بني سواءة بن عامر عن عائشة، عن النبي صلى الله عليه وسلم أنه كان يغسل رأسه بالخطمي وهو جنب يجتزئ بذلك ولا يصب عليه الماء ‏.‏",
      "text_en": " 'Aishah said:                      The Messenger of Allah (May peace be upon him) used to wash his head with marsh-mallow while he was sexually defiled. It was sufficient for him and he did not pour water upon it.",
      "chain": [
        "20173",
        "11858",
        "10815",
        "53"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عيسى بن حماد، حدثنا الليث، عن سعيد المقبري، عن شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يقول دخل رجل على جمل فأناخه في المسجد ثم عقله ثم قال أيكم محمد ورسول الله صلى الله عليه وسلم متكئ بين ظهرانيهم فقلنا له هذا الأبيض المتكئ ‏.‏ فقال الرجل يا ابن عبد المطلب ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ قد أجبتك ‏\"‏ ‏.‏ فقال له الرجل يا محمد إني سائلك ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Anas b. Malik reported :                      A man entered the mosque on camel and made it kneel down, and then tied his leg with rope. He then asked: Who among you is Muhammad? The Messenger of Allah (May peace be upon him) was sitting leaning upon something among them. We said to him: This white (man) who is leaning. The man said: O son of ‘Abd al-Muttalib. The Prophet (peace be upon him) said; I already responded to you. The man (again) said: O Muhammad. I am asking you. The narrator then narrated the rest of the tradition.",
      "chain": [
        "30412",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "838",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، وحسين بن عيسى، قالا حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي صلى الله عليه وسلم إذا سجد وضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I saw that the Prophet (ﷺ) placed his knees (on the ground) before placing his hands when he prostrated himself. And when he stood up, he raised his hands before his knees.",
      "chain": [
        "30115",
        "30326",
        "20472",
        "11858",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1175",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا عيسى بن حماد، أخبرنا الليث، عن سعيد المقبري، عن شريك بن عبد الله بن أبي نمر، عن أنس، أنه سمعه يقول فذكر نحو حديث عبد العزيز قال فرفع رسول الله صلى الله عليه وسلم يديه بحذاء وجهه فقال ‏\"‏ اللهم اسقنا ‏\"‏ ‏.‏ وساق نحوه ‏.‏",
      "text_en": " Narrated The above mentioned tradition has been narrated by Anas through a different chain of transmitters:                     The Messenger of Allah (ﷺ) raised his hands in front of his face and said: O Allah! Give us water.  the narrator then reported then reported the tradition like the former.",
      "chain": [
        "30412",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1355",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا زهير بن محمد، عن شريك بن عبد الله بن أبي نمر، عن كريب، عن الفضل بن عباس، قال ‏:‏ بت ليلة عند النبي صلى الله عليه وسلم لأنظر كيف يصلي فقام فتوضأ ثم صلى ركعتين قيامه مثل ركوعه، وركوعه مثل سجوده، ثم نام، ثم استيقظ فتوضأ واستن ثم قرأ بخمس آيات من آل عمران ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار ‏}‏ فلم يزل يفعل هذا حتى صلى عشر ركعات، ثم قام فصلى سجدة واحدة فأوتر بها، ونادى المنادي عند ذلك، فقام رسول الله صلى الله عليه وسلم بعد ما سكت المؤذن فصلى سجدتين خفيفتين، ثم جلس حتى صلى الصبح ‏.‏ قال أبو داود ‏:‏ خفي على من ابن بشار بعضه ‏.‏",
      "text_en": " Narrated Fadl b. 'Abbas:                     I spent a night with the Prophet (ﷺ) to see how he prayed. He got up, performed ablution and prayed two rak'ahs. His standing was like his bowing (i.e. equal in duration), and his bowing was like his prostration (equal in length). Then he slept. Afterwards he awoke, performed ablution, and used tooth-stick. He then recited five verses from Surah Al-'Imran : \"In the creation of the heavens and the earth and the alternation of night and day\". He went on doing so till he prayed ten rak'ahs. He then stood up and prayed one rak'ah observing witr with it. In the meantime the mu'adhdhin called to prayer. The Messenger of Allah (ﷺ) stood up after the mu'adhdhin had kept silent. He prayed two light rak'ahs and remained sitting till he offered the dawn prayer.Abu Dawud said: A part of the tradition transmitted by Ibn Bashshar remained hidden from me.",
      "chain": [
        "30160",
        "20241",
        "20394",
        "11858",
        "11211",
        "135"
      ]
    },
    {
      "hadith_no": "1599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الربيع بن سليمان، حدثنا ابن وهب، عن سليمان، - يعني ابن بلال - عن شريك بن عبد الله بن أبي نمر، عن عطاء بن يسار، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم بعثه إلى اليمن فقال ‏\"‏ خذ الحب من الحب والشاة من الغنم والبعير من الإبل والبقرة من البقر ‏\"‏ ‏.‏ قال أبو داود شبرت قثاءة بمصر ثلاثة عشر شبرا ورأيت أترجة على بعير بقطعتين قطعت وصيرت على مثل عدلين ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     When the Messenger of Allah (ﷺ) sent him to the Yemen, he said (to him): Collect corn from the corn, sheep from the sheep, camel from the camels, and cow from the cows.Abu Dawud said: In Egypt I saw a cucumber thirteen spans in length and a citron cut into two pieces loaded on a camel like two loads.",
      "chain": [
        "30583",
        "20029",
        "20160",
        "11858",
        "11020",
        "32"
      ]
    },
    {
      "hadith_no": "2784",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله القعنبي، حدثنا عبد العزيز، - يعني ابن محمد - عن شريك، - يعني ابن أبي نمر - عن عطاء بن يسار، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال ‏\"‏ الرجل يكون على الفئام من الناس فيأخذ من حظ هذا وحظ هذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ata' ibn Yasar:                     Ata' reported a similar tradition (to No 2777) from the Prophet (ﷺ). This version adds: a man is appointed on groups of people, and takes (wages) from the share of this, and from the share of this.",
      "chain": [
        "20164",
        "20167",
        "11858",
        "11020"
      ]
    },
    {
      "hadith_no": "3170",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا الوليد بن شجاع السكوني، حدثنا ابن وهب، أخبرني أبو صخر، عن شريك بن عبد الله بن أبي نمر، عن كريب، عن ابن عباس، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم يموت فيقوم على جنازته أربعون رجلا لا يشركون بالله شيئا إلا شفعوا فيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     I heard the Prophet (ﷺ) say: If any Muslim dies and forty men associate nothing with Allah stand over his bier. Allah will accept them as intercessors for him.",
      "chain": [
        "30482",
        "20029",
        "11858",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "3344",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وقتيبة بن سعيد، عن شريك، عن سماك، عن عكرمة، رفعه - قال عثمان وحدثنا وكيع، عن شريك، عن سماك، عن عكرمة، - عن ابن عباس، عن النبي صلى الله عليه وسلم مثله قال اشترى من عير تبيعا وليس عنده ثمنه فأربح فيه فباعه فتصدق بالربح على أرامل بني عبد المطلب وقال لا أشتري بعدها شيئا إلا وعندي ثمنه ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Ibn 'Abbas though a different chain of narrators. This version says:                      \"He (the Prophet) purchased a calf from a caravan, but he had no money with him. He then sold it with some profit and gave the profit in charity to the poor and widows of Banu 'Abd al-Muttalib. He then said: I shall not buy anything after this but only when I have money with me.",
      "chain": [
        "30203",
        "30367",
        "20587",
        "10770",
        "4",
        "20032",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الحسن بن محمد، وسلمة بن شبيب، قالا حدثنا يزيد بن هارون، حدثنا شريك، عن عبد العزيز بن رفيع، عن أمية بن صفوان بن أمية، عن أبيه، أن رسول الله صلى الله عليه وسلم استعار منه أدراعا يوم حنين فقال أغصب يا محمد فقال ‏\"‏ لا بل عارية مضمونة ‏\"‏ ‏.‏ قال أبو داود وهذه رواية يزيد ببغداد وفي روايته بواسط تغير على غير هذا ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     The Messenger of Allah (ﷺ) borrowed coats of mail from him on the day of (the battle of) Hunayn. He asked: Are you taking them by force. Muhammad? He replied: No, it is a loan with a guarantee of their return.Abu Dawud said: This tradition narrated by Yazid (b. Harun) at Baghdad. There is some change in the tradition narrated by him at Wasit, which is something different.",
      "chain": [
        "30245",
        "30417",
        "20472",
        "11858",
        "11257",
        "13005",
        "449"
      ]
    },
    {
      "hadith_no": "3700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، حدثنا شريك، عن زياد بن فياض، عن أبي عياض، عن عبد الله بن عمرو، قال ذكر رسول الله صلى الله عليه وسلم الأوعية الدباء والحنتم والمزفت والنقير فقال أعرابي إنه لا ظروف لنا ‏.‏ فقال ‏\"‏ اشربوا ما حل ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b.’ Amr said:                      The Prophet(ﷺ) mentioned the vessels: pumpkins, green jarrs, vessels smeared with pitch and hollow stumps. A desert Arab said: We have no vessels(except these). He said: Drink(from them) what is lawful.",
      "chain": [
        "20173",
        "11858",
        "10764",
        "11714",
        "29"
      ]
    },
    {
      "hadith_no": "3828",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا الجراح أبو وكيع، عن أبي إسحاق، عن شريك، عن علي، عليه السلام قال نهي عن أكل الثوم، إلا مطبوخا ‏.‏ قال أبو داود شريك بن حنبل ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     It is forbidden to eat garlic unless it is cooked.Abu Dawud said: The full name of the narrator Sharik is Sharik bin Hanbal.",
      "chain": [
        "30175",
        "11049",
        "11858"
      ]
    },
    {
      "hadith_no": "3889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا سليمان بن داود، حدثنا شريك، ح وحدثنا العباس العنبري، حدثنا يزيد بن هارون، أخبرنا شريك، عن العباس بن ذريح، عن الشعبي، - قال العباس - عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا رقية إلا من عين أو حمة أو دم يرقأ ‏\"‏ ‏.‏ لم يذكر العباس العين وهذا لفظ سليمان بن داود ‏.‏",
      "text_en": " Anas reported the Prophet (ﷺ) as saying :                      No spell is to be used except for the evil eye, or sting of  poisonous insects, or bleeding. The narrator al-‘Abhas did mention the words “evil eye”. The is the version of Sulaiman b. Dawud.",
      "chain": [
        "30584",
        "20587",
        "30437",
        "20472",
        "11858",
        "11052",
        "100",
        "19"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، ح وحدثنا محمد، - يعني ابن عيسى - عن شريك، عن عثمان بن أبي زرعة، عن المهاجر الشامي، عن ابن عمر، - قال في حديث شريك يرفعه - قال ‏\"‏ من لبس ثوب شهرة ألبسه الله يوم القيامة ثوبا مثله ‏\"‏ ‏.‏ زاد عن أبي عوانة ‏\"‏ ثم تلهب فيه النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) as saying: If anyone wears a garment for gaining fame, Allah will clothe him in a similar garment on the Day of Resurrection.",
      "chain": [
        "31167",
        "20469",
        "31167",
        "11858",
        "21619",
        "18"
      ]
    },
    {
      "hadith_no": "4171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن جعفر بن زياد، قال حدثنا شريك، عن سالم، عن سعيد بن جبير، قال لا بأس بالقرامل ‏.‏ قال أبو داود كأنه يذهب إلى أن المنهي، عنه شعور النساء ‏.‏ قال أبو داود كان أحمد يقول القرامل ليس به بأس ‏.‏",
      "text_en": " Sa'id b. Jubair said:                      There is no harm in fastening the hair with silk or woollen threads.Abu Dawud said: It appears that he held the view that what is prohibited is the adding of the hair of women.Abu Dawud said: Ahmad (b. hanbal) used to say: There is no harm in tying the hair with silk or woollen threads.",
      "chain": [
        "20173",
        "11858",
        "11011",
        "11050",
        "30002",
        "30007"
      ]
    },
    {
      "hadith_no": "4226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني سليمان بن بلال، عن شريك بن أبي نمر، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، - رضى الله تعالى عنه - عن النبي صلى الله عليه وسلم ‏.‏ قال شريك وأخبرني أبو سلمة بن عبد الرحمن أن النبي صلى الله عليه وسلم كان يتختم في يمينه ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) used to wear the signet-ring on his right hand.",
      "chain": [
        "30226",
        "20029",
        "20160",
        "11858",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "4645",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا قطن بن نسير، حدثنا جعفر يعني ابن سليمان، ح حدثنا سليمان بن داود، عن شريك، عن سليمان الأعمش، قال جمعت مع الحجاج فخطب فذكر حديث أبي بكر بن عياش قال فيها فاسمعوا وأطيعوا لخليفة الله وصفيه عبد الملك بن مروان ‏.‏ وساق الحديث قال ولو أخذت ربيعة بمضر ولم يذكر قصة الحمراء ‏.‏",
      "text_en": " Sulaiman al-A’mash said:                      I prayed the Friday prayer with al-Hajjaj and he addressed. He then transmitted the tradition of Abu Bakr b. ‘Ayyash. He said in it: Hear and obey the caliph of Allah and his select ‘Abd al-Malik bin Marwan. He then transmitted the rest of the tradition, and said: If I seized Rabi’ah for Mudar. But he did not mention the story of the clients (i.e. non Arabs).",
      "chain": [
        "30444",
        "20532",
        "30584",
        "11858",
        "11060"
      ]
    },
    {
      "hadith_no": "4808",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة ومحمد بن الصباح البزاز قالوا حدثنا شريك، عن المقدام بن شريح، عن أبيه، قال سألت عائشة عن البداوة، فقالت كان رسول الله صلى الله عليه وسلم يبدو إلى هذه التلاع وإنه أراد البداوة مرة فأرسل إلى ناقة محرمة من إبل الصدقة فقال لي ‏\"‏ يا عائشة ارفقي فإن الرفق لم يكن في شىء قط إلا زانه ولا نزع من شىء قط إلا شانه ‏\"‏ ‏.‏ قال ابن الصباح في حديثه محرمة يعني لم تركب ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Al-Miqdam ibn Shurayh, quoting his father, said: I asked Aisha about living in the desert. She said: The Messenger of Allah (ﷺ) used to go to the desert to these rivulets. Once he intended to go to the desert and he sent to me a she-camel from the camel of sadaqah which had not been used for riding so far. He said to me: Aisha! show gentleness, for if gentleness is found in anything, it beautifies it and when it is taken out from anything it damages it.Ibn al-Sabbah said in his version: Muharramah means a mount which has not been used for riding.",
      "chain": [
        "4",
        "11858",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سلمة بن شبيب، وأحمد بن إبراهيم الدورقي، والحسن بن علي الحلواني، وعبد الله بن منير، وغير، واحد، قالوا حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد يضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ قال زاد الحسن بن علي في حديثه قال يزيد بن هارون ولم يرو شريك عن عاصم بن كليب إلا هذا الحديث ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرف أحدا رواه مثل هذا عن شريك ‏.‏ والعمل عليه عند أكثر أهل العلم يرون أن يضع الرجل ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ وروى همام عن عاصم هذا مرسلا ولم يذكر فيه وائل بن حجر ‏.‏",
      "text_en": " Wa'il bin Hujr narrated:                     \"I saw Allah's Messenger when he prostrated placing his knees (on the ground) before his hands, and when he got up, he raised his hands before his knees.\"",
      "chain": [
        "30417",
        "30494",
        "30115",
        "30353",
        "20472",
        "11858",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا إسرائيل، وشريك، عن سماك بن حرب، عن جابر بن سمرة، أن رجلا، قتل نفسه فلم يصل عليه النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ واختلف أهل العلم في هذا فقال بعضهم يصلى على كل من صلى إلى القبلة وعلى قاتل النفس ‏.‏ وهو قول سفيان الثوري وإسحاق ‏.‏ وقال أحمد لا يصلي الإمام على قاتل النفس ويصلي عليه غير الإمام ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"A man killed himself, so the Prophet did not perform Salat over him.\"",
      "chain": [
        "30401",
        "20032",
        "20311",
        "11858",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1679",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عمر بن الوليد الكندي الكوفي، وأبو كريب ومحمد بن رافع قالوا حدثنا يحيى بن آدم، عن شريك، عن عمار يعني الدهني، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم دخل مكة ولواؤه أبيض ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يحيى بن آدم عن شريك ‏.‏ قال وسألت محمدا عن هذا الحديث فلم يعرفه إلا من حديث يحيى بن آدم عن شريك وقال حدثنا غير واحد عن شريك عن عمار عن أبي الزبير عن جابر أن النبي صلى الله عليه وسلم دخل مكة وعليه عمامة سوداء ‏.‏ قال محمد والحديث هو هذا ‏.‏ قال أبو عيسى والدهن بطن من بجيلة وعمار الدهني هو عمار بن معاوية الدهني ويكنى أبا معاوية وهو كوفي وهو ثقة عند أهل الحديث ‏.‏",
      "text_en": " Narrated Jabir:                     \"The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.\"[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said: \"More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'\"Muhammad said: \"This is the Hadith.\"[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith.",
      "chain": [
        "20364",
        "11858",
        "10802",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن شريك، عن منصور، عن ربعي بن حراش، حدثنا علي بن أبي طالب، بالرحبة قال لما كان يوم الحديبية خرج إلينا ناس من المشركين فيهم سهيل بن عمرو وأناس من رؤساء المشركين فقالوا يا رسول الله خرج إليك ناس من أبنائنا وإخواننا وأرقائنا وليس لهم فقه في الدين وإنما خرجوا فرارا من أموالنا وضياعنا فارددهم إلينا ‏.‏ ‏\"‏ فإن لم يكن لهم فقه في الدين سنفقههم ‏\"‏ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معشر قريش لتنتهن أو ليبعثن الله عليكم من يضرب رقابكم بالسيف على الدين قد امتحن الله قلبه على الإيمان ‏\"‏ ‏.‏ قالوا من هو يا رسول الله فقال له أبو بكر من هو يا رسول الله وقال عمر من هو يا رسول الله قال ‏\"‏ هو خاصف النعل ‏\"‏ ‏.‏ وكان أعطى عليا نعله يخصفها ثم التفت إلينا علي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث ربعي عن علي ‏.‏ قال وسمعت الجارود يقول سمعت وكيعا يقول لم يكذب ربعي بن حراش في الإسلام كذبة ‏.‏ وأخبرني محمد بن إسماعيل عن عبد الله بن أبي الأسود قال سمعت عبد الرحمن بن مهدي يقول منصور بن المعتمر أثبت أهل الكوفة ‏.‏",
      "text_en": " Narrated Rib'i bin Hirash:                     \"At Ar-Rahbah, 'Ali narrated us: 'On the Day of (the Pledge of) Hudaibiyah, some people from the idolaters came out to us. Among them was Suhail bin 'Amr, and some people among the heads of the idolaters. They said: \"O Messenger of Allah! People among our fathers, brothers, and slaves have come to you, and they have no knowledge of the religion, rather they came fleeing from our wealth and property, so return them to us. If they do not have knowledge of the religion, then we will teach them.\" So the Prophet (ﷺ) said: \"O people of Quraish, you will desist, or Allah will send upon you one who will chop your necks with the sword over the religion. Allah has tested their hearts regarding faith.\" They said: \"Who is he O Messenger of Allah?\" Abu Bakr said to him:  \"Who is he O Messenger of Allah?\" 'Umar said to him:  \"Who is he O Messenger of Allah?\" He said: \"He is the one repairing the sandals.\" - And he had given 'Ali his sandals to repair them. - He said: \"Then 'Ali turned to us and said: 'Indeed the Messenger of Allah (ﷺ) said: \"Whoever lies upon me intentionally, then let him take his seat in the Fire.\"",
      "chain": [
        "35047",
        "11858",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا أبي، أنبأنا الحسن، - وهو ابن صالح - عن أبي إسحاق، ح وحدثنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا شريك، عن أبي إسحاق، عن الأسود، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم لا يتوضأ بعد الغسل ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) used not to perform Wudu' after Ghusl.\"",
      "chain": [
        "30185",
        "35078",
        "20647",
        "11049",
        "30153",
        "20033",
        "11858",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا أبي، حدثنا حسن، عن أبي إسحاق، ح وأنبأنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا شريك، عن أبي إسحاق، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يتوضأ بعد الغسل ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) would not perform Wudu' after Ghusl.\"",
      "chain": [
        "30185",
        "35078",
        "11049",
        "30153",
        "20033",
        "11858",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1504",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله هلكت المواشي وانقطعت السبل فادع الله عز وجل ‏.‏ فدعا رسول الله صلى الله عليه وسلم فمطرنا من الجمعة إلى الجمعة فجاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله تهدمت البيوت وانقطعت السبل وهلكت المواشي ‏.‏ فقال ‏\"‏ اللهم على رءوس الجبال والآكام وبطون الأودية ومنابت الشجر ‏\"‏ ‏.‏ فانجابت عن المدينة انجياب الثوب ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"A man came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, the livestock have died and the routes have been cut off; pray to Allah (SWT), the Mighty and Sublime.' So the Messenger of Allah (ﷺ) prayed to Allah (SWT) and it rained from that Friday until the next. Then a man came to the Messenger of Allah (ﷺ) and said: 'The houses have been destroyed, the routes have been cut off and the livestock have died.' He said: 'O Allah, on the tops of the mountains and hills, in the bottom of the valleys and where the trees grow.' So (the rain) was lifted from Al-Madinah like a garment being removed.\"",
      "chain": [
        "30367",
        "20001",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1515",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا عيسى بن حماد، قال حدثنا الليث، عن سعيد، - وهو المقبري - عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، أنه سمعه يقول بينا نحن في المسجد يوم الجمعة ورسول الله صلى الله عليه وسلم يخطب الناس فقام رجل فقال يا رسول الله تقطعت السبل وهلكت الأموال وأجدب البلاد فادع الله أن يسقينا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه حذاء وجهه فقال ‏\"‏ اللهم اسقنا ‏\"‏ ‏.‏ فوالله ما نزل رسول الله صلى الله عليه وسلم عن المنبر حتى أوسعنا مطرا وأمطرنا ذلك اليوم إلى الجمعة الأخرى فقام رجل - لا أدري هو الذي قال لرسول الله صلى الله عليه وسلم استسق لنا أم لا - فقال يا رسول الله انقطعت السبل وهلكت الأموال من كثرة الماء فادع الله أن يمسك عنا الماء ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم حوالينا ولا علينا ولكن على الجبال ومنابت الشجر ‏\"‏ ‏.‏ قال والله ما هو إلا أن تكلم رسول الله صلى الله عليه وسلم بذلك تمزق السحاب حتى ما نرى منه شيئا ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that he said:                     \"While we were in the masjid on Friday and the Messenger of Allah (ﷺ) was addressing the people,  a man stood up and said: 'O Messenger of Allah, the routes have been cut off, our wealth has been destroyed and prices have gone up. Pray to Allah (SWT) to give us rain.' So the Messenger of Allah (ﷺ) raised his hands in level with his face and said: 'O Allah, give us rain.' By Allah (SWT), the Messenger of Allah (ﷺ) had not come down from the minbar before it started to pour with rain, and it rained from that day until the following Friday. Then a man stood up- I do not know if he was the same man who had asked the Messenger of Allah (ﷺ) to pray for rain for us or not- and said: 'O Messenger of Allah, the routes have been cut off, and our wealth has been destroyed because there is too much water. Pray to Allah (SWT ) to stop the rain for us.' The Messenger of Allah (ﷺ) said: 'O Allah, around us and not on us, rather on the mountains and places where trees grow.' By Allah, hardly had the Messenger of Allah (ﷺ) spoken these words than the clouds split apart (and vanished) until we could not see anything of them.'\"",
      "chain": [
        "30412",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "2039",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، قال حدثنا شريك، - وهو ابن أبي نمر - عن عطاء، عن عائشة، قالت ‏:‏ كان رسول الله صلى الله عليه وسلم كلما كانت ليلتها من رسول الله صلى الله عليه وسلم يخرج في آخر الليل إلى البقيع فيقول ‏:‏ ‏\"‏ السلام عليكم دار قوم مؤمنين، وإنا وإياكم متواعدون غدا أو مواكلون، وإنا إن شاء الله بكم لاحقون، اللهم اغفر لأهل بقيع الغرقد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said that:                     every time it was her night for the Messenger of Allah to stay with her, he would go out at the end of the night to Al-Baqi' and say: \"As-salamu 'alaykum dara qawmin mu'minin, wa inna wa iyyakum mutawa'idun ghadan wa mutawakilun, wa inna in sha' Allahu bikum lahiqun. Allahummaghfir li ahli baqi'il gharaqad. (Peace be upon you, O abode of believing people. You and we used to remind one another about the Day of Resurrection and we are relying on one another (with regard to intercession and bearing witness). Soon we will join you, if Allah willing. O Allah, forgive the people of Baqi' Al-Charqad.)\"",
      "chain": [
        "20387",
        "20208",
        "11858",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "2092",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عيسى بن حماد، عن الليث، عن سعيد، عن شريك بن أبي نمر، أنه سمع أنس بن مالك، يقول بينا نحن جلوس في المسجد جاء رجل على جمل فأناخه في المسجد ثم عقله فقال لهم أيكم محمد - ورسول الله صلى الله عليه وسلم متكئ بين ظهرانيهم - قلنا له هذا الرجل الأبيض المتكئ فقال له الرجل يا ابن عبد المطلب ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ قد أجبتك ‏\"‏ ‏.‏ فقال الرجل إني سائلك يا محمد فمشدد عليك في المسألة فلا تجدن في نفسك ‏.‏ قال ‏\"‏ سل ما بدا لك ‏\"‏ ‏.‏ فقال الرجل نشدتك بربك ورب من قبلك آلله أرسلك إلى الناس كلهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك الله آلله أمرك أن تصلي الصلوات الخمس في اليوم والليلة قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك الله آلله أمرك أن تصوم هذا الشهر من السنة قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك الله آلله أمرك أن تأخذ هذه الصدقة من أغنيائنا فتقسمها على فقرائنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ فقال الرجل آمنت بما جئت به وأنا رسول من ورائي من قومي وأنا ضمام بن ثعلبة أخو بني سعد بن بكر ‏.‏ خالفه يعقوب بن إبراهيم ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"While we were sitting in the Masjid, a man came on a camel and made it keneel in the Masjid, then he hobbled it and said to them: 'Which of you is Muhammad?' The Messenger of Allah was reclining amid his Companions, and we said to him: This white man who is reclining.' The man said to him: 'O son of 'Abdul-Muttalib.' The Messenger of Allah said: ' I have answered you.' The man said; 'O Muhammad, I am going to ask you questions, and I will be harsh in asking; do not get upset.; The man said: 'I adjure you by your Lord and the Lord of those who cam before you, has Allah sent you to all the people?' The Messenger of Allah said: 'By Allah, yes.' He said; 'I adjure you by Allah, has Allah commanded you to offer five prayers each day and night?' The Messenger of Allah said: 'By Allah, yes.; He said: 'I adjure you by Allah, has Allah commanded you to fast this month each year? The Messenger of Allah said: 'By Allah, Yes.' He said: 'I adjure you by Allah, has Allah commanded you to take this charity from our rich and distribute it among our poor?' The Messenger of Allah said. 'By Allah, yes.' The man said: 'I believe in that which you have brought, and I am the envoy of my people who are coming after me. I am Dimam bin Thalabah, the brother of Banu sad bin Bakr.\"' Yaqub bin Ibrahim contradicted him.",
      "chain": [
        "30412",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "2093",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، من كتابه قال حدثنا عمي، قال حدثنا الليث، قال حدثنا ابن عجلان، وغيره، من إخواننا عن سعيد المقبري، عن شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يقول بينما نحن عند رسول الله صلى الله عليه وسلم جلوس في المسجد دخل رجل على جمل فأناخه في المسجد ثم عقله ثم قال أيكم محمد - وهو متكئ بين ظهرانيهم - فقلنا له هذا الرجل الأبيض المتكئ فقال له الرجل يا ابن عبد المطلب ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ قد أجبتك ‏\"‏ ‏.‏ قال الرجل يا محمد إني سائلك فمشدد عليك في المسألة ‏.‏ قال ‏\"‏ سل عما بدا لك ‏\"‏ ‏.‏ قال أنشدك بربك ورب من قبلك آلله أرسلك إلى الناس كلهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك الله آلله أمرك أن تصوم هذا الشهر من السنة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك الله آلله أمرك أن تأخذ هذه الصدقة من أغنيائنا فتقسمها على فقرائنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ فقال الرجل إني آمنت بما جئت به وأنا رسول من ورائي من قومي وأنا ضمام بن ثعلبة أخو بني سعد بن بكر ‏.‏ خالفه عبيد الله بن عمر ‏.‏",
      "text_en": " Anas bin Malik said:                     \"while we were with the Messenger of Allah, sitting in the Masjid, a man entered on a camel. He made it kneel in the Masjid, then he hobbled it. Then he said; 'Which of you is Muhammad?' He was reclining among them, and we said to him: 'This white man who is reclining.' The man said to him: 'O son of 'Abdul-Muttalib.' The Messenger of Allah said to him: 'I have answered you.' The man said: 'O Muhammad, I am going  to ask you questions and I will be harsh in asking.' He said; 'Ask whatever you like.' The man said; 'I adjure you by your Lord, and the Lord of those who came begfore you, has Allah sent you to all the people?' The messenger of Allah said: 'by Allah, yes,' He said: 'Iadjure you by Allah, has Allah commanded you to fast this month each year?' The Messenger of Allah said: 'I adjure you by Allah, has Allah commanded you to take this charity from our rich and divide it among our poor?' The Messenger of Allah said: 'By Allah, Yes.' The ma said; 'I believe in that which you have brought, and I am the envoy of my people who are coming after me. I am Dimam bin Thalabah, the brother of Banu sad bin Bakr.\"' (Sahih) 'Ubaidullah bin 'Umar contradicted him.",
      "chain": [
        "20023",
        "10616",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أبو محمد، موسى بن محمد - هو الشامي - قال حدثنا ميمون بن الأصبغ، قال حدثنا يزيد بن هارون، قال أنبأنا شريك، عن أبي إسحاق، عن القاسم بن عبد الرحمن، عن أبيه، عن عبد الله، رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه أمر بقتل الحيات وقال ‏\"‏ من خاف ثأرهن فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah (may Allah be pleased with him) that the Messenger of Allah (ﷺ) commanded that snakes be killed and he said:                      \"Whoever fears their vengeance is not one of us.\"",
      "chain": [
        "20472",
        "11858",
        "11049",
        "19896"
      ]
    },
    {
      "hadith_no": "4147",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال أنبأنا محبوب، قال أنبأنا أبو إسحاق، عن شريك، عن خصيف، عن مجاهد، قال الخمس الذي لله وللرسول كان للنبي صلى الله عليه وسلم وقرابته لا يأكلون من الصدقة شيئا فكان للنبي صلى الله عليه وسلم خمس الخمس ولذي قرابته خمس الخمس ولليتامى مثل ذلك وللمساكين مثل ذلك ولابن السبيل مثل ذلك ‏.‏ قال أبو عبد الرحمن قال الله جل ثناؤه ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ وقوله عز وجل لله ابتداء كلام لأن الأشياء كلها لله عز وجل ولعله إنما استفتح الكلام في الفىء والخمس بذكر نفسه لأنها أشرف الكسب ولم ينسب الصدقة إلى نفسه عز وجل لأنها أوساخ الناس والله تعالى أعلم وقد قيل يؤخذ من الغنيمة شىء فيجعل في الكعبة وهو السهم الذي لله عز وجل وسهم النبي صلى الله عليه وسلم إلى الإمام يشتري الكراع منه والسلاح ويعطي منه من رأى ممن رأى فيه غناء ومنفعة لأهل الإسلام ومن أهل الحديث والعلم والفقه والقرآن وسهم لذي القربى وهم بنو هاشم وبنو المطلب بينهم الغني منهم والفقير وقد قيل إنه للفقير منهم دون الغني كاليتامى وابن السبيل وهو أشبه القولين بالصواب عندي والله تعالى أعلم والصغير والكبير والذكر والأنثى سواء لأن الله عز وجل جعل ذلك لهم وقسمه رسول الله صلى الله عليه وسلم فيهم وليس في الحديث أنه فضل بعضهم على بعض ولا خلاف نعلمه بين العلماء في رجل لو أوصى بثلثه لبني فلان أنه بينهم وأن الذكر والأنثى فيه سواء إذا كانوا يحصون فهكذا كل شىء صير لبني فلان أنه بينهم بالسوية إلا أن يبين ذلك الآمر به والله ولي التوفيق وسهم لليتامى من المسلمين وسهم للمساكين من المسلمين وسهم لابن السبيل من المسلمين ولا يعطى أحد منهم سهم مسكين وسهم ابن السبيل وقيل له خذ أيهما شئت والأربعة أخماس يقسمها الإمام بين من حضر القتال من المسلمين البالغين ‏.‏",
      "text_en": " It was narrated that Mujahid said:                     \"The Khumus that is for Allah and His Messenger was for the Prophet and His relatives; they did not take anything from the Sadaqah. The Prophet was allocated one-fifth of the Khumus; his relatives were allocated one-fifth of the Khumus; the same was allocated to orphans, the poor and they wayfarers.\" (Da 'if)Abu Abdur-Rahman (An-Nasi) said: Allah, the Majestic is he and Praised, said: \"And know that whatever of spoils of war that you may gain, verily, one-fifth of it is assigned to Allah, and to the Messenger, and to the near relatives ( of the Messenger (Muhammad)), (and also) the orphans, Al-Masakin (the Poor) and the wayfarer.\" His, the Mighty and Sublime, saying to Allah starts the speech since everything is of Allah, the Mighty and Sublime, saying to Allah starts the speech since everything is of Allah, the Mighty and Sublime. And perhaps He only oened His speech about the Fay and the Khumus, mentioning Himself, because that is the noblest of earnings. And He did not attribute Sadaqah to Himself, the Mighty and Sublime, because that is the dirt of people. And Allah knows best.It was said that something should be taken form the spoils of war and placed inside the Kabah, and this is the share that is for Allah, the Mighty and Sublime. The share of the Messenger is to be given to the imam to buy horses and weapons, and to give to whomever he thinks will benefit the people of Islam, and to the people of Hadith, Knowledge, Fiqh  and the Quran. The share that is for near relatives should be given to Banu Hashim and Banu Al-Muttablib, rich and poor alike, or it was said that it should be given to the poor among them and not to the rich, such as orphans and wayfarers. This is the view that is more appropriate in my view, and Allah knows best. And the young and the old, male and female, are equal in that, because Allah, the mighty and sublime, has allocated it to them and the Messenger of Allah distributed it among them, and there is nothing in the Hadith to indicate that he preferred some of them over others. And there is no scholarly dispute, as far as we know, to suggest that if a man bequeaths one-third of his wealth to such a tribe, to be distributed out among them equally, that it should be done otherwise, unless the giver stipulated otherwise. And Allah is the source of strength. And (there is) a share for the orphans among the Muslims, and a share for the poor among the Muslims, and a share for the wayfarers among the Muslims. No one should be given both a share for the poor and a share for the wayfarer; it is to be said to him: \"Take whichever of them you want.\" And the other four-fifths are to be divided by the imam among those adult Muslims who were present in the battle. (Daif)",
      "chain": [
        "11210",
        "11049",
        "11858",
        "19908",
        "11028"
      ]
    },
    {
      "hadith_no": "5203",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ‏{‏ ابن، ‏}‏ وهب عن سليمان، - هو ابن بلال - عن شريك، - هو ابن أبي نمر - عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، قال شريك وأخبرني أبو سلمة، أن النبي صلى الله عليه وسلم كان يلبس خاتمه في يمينه ‏.‏",
      "text_en": " Ibn Wahab narrated from Sulaiman - and he is Ibn Bilal - from Sharik - and he is Ibn Abi Namr - from Ibrahim Ibn 'Abdullah bin Hunain, from his father, from 'Ali; Sharik said:                      \"And Abu Salamah informed me\" -That the Prophet [SAW] used to wear his ring on his right hand.",
      "chain": [
        "30583",
        "20160",
        "11858",
        "11150",
        "11181",
        "5",
        "20587",
        "10567"
      ]
    },
    {
      "hadith_no": "5686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا إبراهيم بن أبي العباس، قال حدثنا شريك، عن عباس بن ذريح، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر قليلها وكثيرها وما أسكر من كل شراب ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من حديث ابن شبرمة وهشيم بن بشير كان يدلس وليس في حديثه ذكر السماع من ابن شبرمة ورواية أبي عون أشبه بما رواه الثقات عن ابن عباس ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in small or large amounts, as was every kind of drink that intoxicates.\"",
      "chain": [
        "38181",
        "30007",
        "11858",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وإسماعيل بن موسى، قالوا حدثنا شريك، عن أبي إسحاق، عن حبشي بن جنادة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ علي مني وأنا منه ولا يؤدي عني إلا علي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hubshi bin Junadah said:                     \"I heard the Messenger of Allah say: ''Ali is part of me and I am part of him, and no one will represent me except 'Ali.'\"",
      "chain": [
        "30201",
        "30547",
        "35016",
        "11858",
        "11049",
        "4112"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وإسماعيل بن موسى السدي، قالوا حدثنا شريك، عن المقدام بن شريح بن هانئ، عن أبيه، عن عائشة، قالت من حدثك أن رسول الله  صلى الله عليه وسلم  بال قائما فلا تصدقه أنا رأيته يبول قاعدا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"If anyone tells you that the Messenger of Allah urinated while standing, do not believe him, for I (always) saw him urinating while sitting down.\"",
      "chain": [
        "30201",
        "30547",
        "35016",
        "11858",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن بن سلمة حدثنا أبو حاتم، وإبراهيم بن سليمان الواسطي، قالا حدثنا أبو نعيم، حدثنا شريك، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "38473",
        "20348",
        "11858"
      ]
    },
    {
      "hadith_no": "387",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قضى حاجته ثم استنجى من تور ثم دلك يده بالأرض ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet relieved himself, then he cleaned himself (with water) from a pot made of brass, then he wiped his hand on the ground.",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11858",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن يحيى، وإسحاق بن منصور، قالوا حدثنا أبو داود، حدثنا شريك، عن سماك، عن عكرمة، عن ابن عباس، عن ميمونة، زوج النبي  صلى الله عليه وسلم  أن النبي  صلى الله عليه وسلم  توضأ بفضل غسلها من الجنابة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas, from Maimunah the wife of the Prophet, that :                     the Prophet performed ablution with the water left over after she had taken a bath to cleanse herself from sexual impurity.",
      "chain": [
        "30170",
        "11222",
        "30313",
        "20547",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "511",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  توضأ في تور ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet performed ablution using (the water in) a vessel made of brass.",
      "chain": [
        "30201",
        "38409",
        "20032",
        "11858",
        "18002",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "622",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن عامر بن زرارة، وإسماعيل بن موسى السدي، قالوا حدثنا شريك، عن أبي إسحاق، عن الأسود، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  لا يتوضأ بعد الغسل من الجنابة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah would not perform ablution after the bath to cleanse himself from sexual impurity.\"",
      "chain": [
        "30201",
        "30467",
        "35016",
        "11858",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1165",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن محمد الدراوردي، عن شريك بن عبد الله بن أبي نمر، عن عطاء بن يسار، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  قرأ يوم الجمعة تبارك وهو قائم فذكرنا بأيام الله وأبو الدرداء أو أبو ذر يغمزني فقال متى أنزلت هذه السورة إني لم أسمعها إلا الآن ‏.‏ فأشار إليه أن اسكت فلما انصرفوا قال سألتك متى أنزلت هذه السورة فلم تخبرني فقال أبى ليس لك من صلاتك اليوم إلا ما لغوت ‏.‏ فذهب إلى رسول الله  صلى الله عليه وسلم  فذكر ذلك له وأخبره بالذي قال أبى فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ صدق أبى ‏\"‏ ‏.‏",
      "text_en": " ‘Ata’bin Yasar narrated from Ubayy bin Ka’b:                      “The Messenger of Allah(ﷺ) recited Tabarak [Al-Mulk (67)] one Friday, while he wasstandingand reminding us of the Days of Allah (i.e., preaching tous). AbuDarda’ or Abu Dharr raised an eyebrow at me and said:‘When was thisSurah revealed? For I have not heard it before now.’He (Ubayy)gestured to him that he should remain silent. When theyfinished, hesaid: ‘I asked you when this Surah was revealed andyou did not answerme.” Ubayy said: ‘You have gained nothing fromyour prayer todayexcept the idle talk that you engaged in.’ Hewent to the Prophet(ﷺ) and told him about that, and what Ubayy hadsaid to him. TheMessenger of Allah (ﷺ) said: ‘Ubayy spoke thetruth.’”",
      "chain": [
        "20167",
        "11858",
        "11020",
        "39"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "قال أبو الحسن بن سلمة القطان حدثنا ابن ديزيل، حدثنا آدم، حدثنا شيبان، عن جابر، عن عامر، ح وحدثنا إبراهيم بن نصر، حدثنا إسرائيل، عن جابر، عن عامر، ح وحدثنا إبراهيم بن نصر، حدثنا أبو نعيم، حدثنا شريك، عن أبي إسحاق، عن عامر، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20404",
        "20240",
        "34",
        "11052",
        "20311",
        "34",
        "11052",
        "20348",
        "11858",
        "11049",
        "11052"
      ]
    },
    {
      "hadith_no": "1466",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عيسى بن حماد المصري، أنبأنا الليث بن سعد، عن سعيد المقبري، عن شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يقول بينما نحن جلوس في المسجد دخل رجل على رحل فأناخه في المسجد ثم عقله ثم قال لهم أيكم محمد ورسول الله  صلى الله عليه وسلم  متكئ بين ظهرانيهم ‏.‏ قال فقالوا هذا الرجل الأبيض المتكئ ‏.‏ فقال له الرجل يا ابن عبد المطلب ‏.‏ فقال له النبي  صلى الله عليه وسلم  ‏\"‏ قد أجبتك ‏\"‏ ‏.‏ فقال له الرجل يا محمد إني سائلك ومشدد عليك في المسألة فلا تجدن على في نفسك ‏.‏ فقال ‏\"‏ سل ما بدا لك ‏\"‏ ‏.‏ قال له الرجل نشدتك بربك ورب من قبلك آلله أرسلك إلى الناس كلهم فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك بالله آلله أمرك أن تصلي الصلوات الخمس في اليوم والليلة قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك بالله آلله أمرك أن تصوم هذا الشهر من السنة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ قال فأنشدك بالله آلله أمرك أن تأخذ هذه الصدقة من أغنيائنا فتقسمها على فقرائنا فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم نعم ‏\"‏ ‏.‏ فقال الرجل آمنت بما جئت به وأنا رسول من ورائي من قومي ‏.‏ وأنا ضمام بن ثعلبة أخو بني سعد بن بكر ‏.‏",
      "text_en": " It wasnarrated from Sharik bin ‘Abdullah bin Abu Namir that he heardAnasbin Malik say:                      “While we were sitting in the mosque, a manenteredriding a camel; he made it kneel in the mosque, then hehobbled itand said to them: ‘Which of you is Muhammad?’ The MessengerofAllah (ﷺ) was reclining among them, so they said: ‘Thisfair-skinned man who is reclining.’ The man said to him: ‘O sonof ‘Abdul-Muttalib!’ The Prophet (ﷺ) said: ‘I am listening toyou.’ The mansaid: O Muhammad! I am asking you and will be sternin asking, so donot bear any ill-feelings towards me.’ He said:‘Ask whatever youthink.’ The man said: ‘I adjure you by yourLord and the Lord of thosewho came before you, has Allah sent you toall of mankind?’ TheMessenger of Allah (ﷺ) said: ‘By Allah,yes.; He said: ‘I adjure youby Allah, has Allah commanded you topray the five prayers each dayand night?’ The Messenger of Allah(ﷺ) said: ‘By Allah, yes.’ Hesaid: ‘I adjure you by Allah,has Allah commanded you to fast thismonth of each year?’ TheMessenger of Allah (ﷺ) said: ‘By Allah,yes.’ He said: ‘Iadjure you by Allah, has Allah commanded you to takethis charityfrom our rich and distribute it among our poor?’ TheMessenger ofAllah (ﷺ) said: ‘By Allah, yes.’ The man said: ‘Ibelieve inwhat you have brought, and I am the envoy of my people whoare behindme. I am Dimam bin Tha’labah, the brother of Banu Sa’d binBakr.’”",
      "chain": [
        "30412",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1886",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن شريك بن أبي نمر، عن عطاء بن يسار، عن معاذ بن جبل، أن رسول الله  صلى الله عليه وسلم  بعثه إلى اليمن وقال له ‏\"‏ خذ الحب من الحب والشاة من الغنم والبعير من الإبل والبقرة من البقر ‏\"‏ ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated that:                     the Messenger of Allah sent him to Yemen and said to him: “Take grains from grains, sheep from sheep, camels from camels and cows from cows”",
      "chain": [
        "30443",
        "20029",
        "20160",
        "11858",
        "11020",
        "32"
      ]
    },
    {
      "hadith_no": "2588",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا أحمد بن سنان، والعلاء بن سالم، قالا حدثنا يزيد بن هارون، أنبأنا شريك، عن سماك، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كانت له أرض فأراد بيعها فليعرضها على جاره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Prophet (ﷺ) said:                     “Whoever has land and wants to sell it, let him offer it to his neighbor.”",
      "chain": [
        "30297",
        "20472",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2611",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا شريك، عن حسين بن عبد الله بن عبيد الله بن عباس، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل ولدت أمته منه فهي معتقة عن دبر منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “Any man whose slave won an bears him a child, she will be free after he dies.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "11858",
        "12056",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2924",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا الحسن بن علي الخلال، وعبدة بن عبد الله، قال حدثنا يحيى بن آدم، حدثنا شريك، عن عمار الدهني، عن أبي الزبير، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم دخل مكة يوم الفتح ولواؤه أبيض ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Prophet (ﷺ)enteredMakkah on the Day of the Conquest, and his standard was white.",
      "chain": [
        "30115",
        "30149",
        "20364",
        "11858",
        "10802",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3737",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عبادة، ومحمد بن عبد الملك الواسطيان، قالا حدثنا يزيد بن هارون، أنبأنا شريك، عن عثمان بن أبي زرعة، عن مهاجر، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من لبس ثوب شهرة ألبسه الله يوم القيامة ثوب مذلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)said:‘Whoever wears a garment of pride and vanity, Allah will clothehim, on the Day of Resurrection, in a garment of humiliation.’”",
      "chain": [
        "30378",
        "20472",
        "11858",
        "21619",
        "18"
      ]
    }
  ],
  "total_hadiths": 76
}