{
  "id": "11855",
  "name": "Sulaiman bin Sahaym سليمان بن سحيم",
  "full_name": "Sulaiman bin Sahaym سليمان بن سحيم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Madni",
      "Client"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ م  د  س  ق  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ م  د  س  ق  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ م  د  س  ق  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [2nd Generation]",
        "ar": "تابعي [الجيل الثاني]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی دووەم]"
      }
    },
    {
      "id": "11825",
      "name": "Ibrahim bin 'Abdullah bin Ma'bad إبراهيم بن عبد الله بن معبد بن عباس",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "3180",
      "name": "Umayma bint Qays ( أمية بنت قيس أبي الصلت الغفارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "19469",
      "name": "Hkymh bint Umayya bin حكيمة بنت أمية",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "11245",
      "name": "Ziyad bin Sa'd bin 'Abdur Rahman زياد بن سعد بن عبد الرحمن الخراساني",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-479-2",
      "hadith_no": "479",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان بن عيينة، أخبرني سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد، عن أبيه، عن ابن عباس، قال كشف رسول الله صلى الله عليه وسلم الستارة والناس صفوف خلف أبي بكر فقال ‏\"‏ أيها الناس إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم أو ترى له ألا وإني نهيت أن أقرأ القرآن راكعا أو ساجدا فأما الركوع فعظموا فيه الرب عز وجل وأما السجود فاجتهدوا في الدعاء فقمن أن يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) drew aside the curtain (of his apartment) and (he saw) people in rows (saying prayer) behind Aba Bakr. And he said: Nothing remains of the glad tidings of apostlehood, except good visions which a Muslim sees or someone is made to see for him. And see that I have been forbidden to recite the Qur'an in the state of bowing and prostration. So far as Ruk'u is concerned, extol in it the Great and Glorious Lord, and while prostrating yourselves be earnest in supplication, for it is fitting that your supplications should be answered.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "11855",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-479-3",
      "hadith_no": "479",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "قال أبو بكر حدثنا سفيان، عن سليمان، حدثنا يحيى بن أيوب، حدثنا إسماعيل بن جعفر، أخبرني سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد بن عباس، عن أبيه، عن عبد الله بن عباس، قال كشف رسول الله صلى الله عليه وسلم الستر ورأسه معصوب في مرضه الذي مات فيه فقال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ ثلاث مرات ‏\"‏ إنه لم يبق من مبشرات النبوة إلا الرؤيا يراها العبد الصالح أو ترى له ‏\"‏ ‏.‏ ثم ذكر بمثل حديث سفيان ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported:                      The Messenger of Allah (may peace be upon him) drew aside the curtain and his head was bandaged on account of illness in which he died. He said: O Allah, have I not delivered (Thy Message)? (He repeated it) three times. Nothing has been left out of the glad tidings of apostlebood, but good vision. which a pious servant (of Allah) sees or someone else is made to see for him. He then narrated like the hadith transmitted by Sufyan.",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20012",
        "11060",
        "20379",
        "20155",
        "11855",
        "11825",
        "11873",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-313",
      "hadith_no": "313",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو الرازي، حدثنا سلمة، - يعني ابن الفضل - أخبرنا محمد، - يعني ابن إسحاق - عن سليمان بن سحيم، عن أمية بنت أبي الصلت، عن امرأة، من بني غفار قد سماها لي قالت أردفني رسول الله صلى الله عليه وسلم على حقيبة رحله - قالت - فوالله لم يزل رسول الله صلى الله عليه وسلم إلى الصبح فأناخ ونزلت عن حقيبة رحله فإذا بها دم مني فكانت أول حيضة حضتها - قالت - فتقبضت إلى الناقة واستحييت فلما رأى رسول الله صلى الله عليه وسلم ما بي ورأى الدم قال ‏\"‏ ما لك لعلك نفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فأصلحي من نفسك ثم خذي إناء من ماء فاطرحي فيه ملحا ثم اغسلي ما أصاب الحقيبة من الدم ثم عودي لمركبك ‏\"‏ ‏.‏ قالت فلما فتح رسول الله صلى الله عليه وسلم خيبر رضخ لنا من الفىء - قالت - وكانت لا تطهر من حيضة إلا جعلت في طهورها ملحا وأوصت به أن يجعل في غسلها حين ماتت ‏.‏",
      "text_en": " Narrated Woman of Banu Ghifar:                     Umayyah, daughter of AbusSalt, quoted a certain woman of Banu Ghifar, whose name was mentioned to me, as saying: The Messenger of Allah (ﷺ) made me ride behind him on the rear of the camel saddle. By Allah, the Messenger of Allah (ﷺ) got down in the morning. He made his camel kneel down and I came down from the back of his saddle. There was a mark of blood on it (saddle) and that was the first menstruation that I had. I stuck to the camel and felt ashamed.  When the Messenger of Allah (ﷺ) saw what had happened to me and saw the blood, he said: Perhaps you are menstruating.  I said: Yes.  He then said: Set yourself right (i.e. tie some cloth to prevent bleeding), then take a vessel of water and put some salt in it, and then wash the blood from the back of the saddle, and then return to your mount. When the Messenger of Allah (ﷺ) conquered Khaybar, he gave us a portion of the booty. Whenever the woman became purified from her menses, she would put salt in water. And when she died, she left a will to put salt in the water for washing her (after death).",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "28221",
        "11107",
        "11855"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-876",
      "hadith_no": "876",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم كشف الستارة والناس صفوف خلف أبي بكر فقال ‏\"‏ يا أيها الناس إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم أو ترى له وإني نهيت أن أقرأ راكعا أو ساجدا فأما الركوع فعظموا الرب فيه وأما السجود فاجتهدوا في الدعاء فقمن أن يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Prophet(ﷺ) lifted the curtain (and saw that) the people were standing in rows(of prayers) behind Abu Bakr. He said: O people, there remained nothing that gives good tidings from prophethood except a true dream which a Muslim has himself or which another Muslim has for him. I have been prohibited to recite the Qur’an while bowing or prostration. As regards owing, exalt the Lord in it, and as to prostration, make supplication with exertion in it, that is worthy of being accepted.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20012",
        "11855",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-1045",
      "hadith_no": "1045",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد بن عباس، عن أبيه، عن ابن عباس، قال كشف النبي صلى الله عليه وسلم الستارة والناس صفوف خلف أبي بكر - رضى الله عنه - فقال ‏\"‏ أيها الناس إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم أو ترى له - ثم قال - ألا إني نهيت أن أقرأ راكعا أو ساجدا فأما الركوع فعظموا فيه الرب وأما السجود فاجتهدوا في الدعاء قمن أن يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Prophet (ﷺ) drew back the curtain when the people were in rows behind Abu Bakr, may Allah be pleased with him, and said: 'O people, there is nothing left of the features of Prophethood except a good dream that a Muslim sees or is seen by others for him.' Then he said: 'Verily, I have been forbidden from reciting the Qur'an when bowing or prostrating. As for bowing, glorify the Lord therein, and as for prostration, strive hard in supplication for it is more deserving of a response.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11855",
        "11825",
        "11873",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1120",
      "hadith_no": "1120",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا علي بن حجر المروزي، قال أنبأنا إسماعيل، - هو ابن جعفر - قال حدثنا سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد بن عباس، عن أبيه، عن عبد الله بن عباس، قال كشف رسول الله صلى الله عليه وسلم الستر ورأسه معصوب في مرضه الذي مات فيه فقال ‏\"‏ اللهم قد بلغت - ثلاث مرات - إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها العبد أو ترى له ألا وإني قد نهيت عن القراءة في الركوع والسجود فإذا ركعتم فعظموا ربكم وإذا سجدتم فاجتهدوا في الدعاء فإنه قمن أن يستجاب لكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Abbas said:                     \"The Messenger of Allah (ﷺ) drew aside the curtain when he had a cloth wrapped around his head during his final illness, and said: 'O Allah, I have conveyed (the Message)' three times. 'There is nothing left of the features of Prophethood except a good dream that a person sees or is seen by others for him. But I have been forbidden to recite the Qur'an when bowing and prostrating, so when you bow, then glorify your Lord and when you prostrate, then strive hard in supplication, for it is more deserving of a response.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20155",
        "11855",
        "11825",
        "11873",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-3115",
      "hadith_no": "3115",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن محمد بن إسحاق، حدثني سليمان بن سحيم، عن أم حكيم بنت أمية، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أهل بعمرة من بيت المقدس غفر له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Whoever begins the Talbiyah for ‘Umrah from Baitul-Maqdis, willbe forgiven.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20246",
        "11107",
        "11855",
        "19469",
        "56"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3899",
      "hadith_no": "3899",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا إسحاق بن إسماعيل الأيلي، حدثنا سفيان بن عيينة، عن سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد بن عباس، عن أبيه، عن ابن عباس، قال كشف رسول الله  صلى الله عليه وسلم  الستارة في مرضه والناس صفوف خلف أبي بكر فقال ‏\"‏ أيها الناس إنه لم يبق من مبشرات النبوة إلا الرؤيا الصالحة يراها المسلم أو ترى له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)drewaside the curtain when he was sick, and the rows (of worshippers)were behind Abu Bakr. He said: ‘O people, nothing of the gladtidingsof prophecy is left except a good dream that a Muslim sees oris seenabout him.’”",
      "usc_msa_ref": "",
      "chain": [
        "20005",
        "11855",
        "11825",
        "11873",
        "17"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 8,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}