{
  "id": "11876",
  "name": "'Abdur Rahman bin Ishaq عبد الرحمن بن إسحاق بن عبد الله",
  "full_name": "'Abdur Rahman bin Ishaq عبد الرحمن بن إسحاق بن عبد الله",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  م  4  -  صدوق ]"
    ],
    "tags": [
      "al-Madni",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "12260",
      "name": "'Abdullah bin Yazid عبد الله بن يزيد المدني مولى المنبعث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19954",
      "name": "Abu 'Ubaida bin Muhammad bin Yasir أبو عبيدة بن محمد بن عمار بن ياسر العنسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20706",
      "name": "Musa bin Y'aqub bin 'Abdullah bin Wahb موسى بن يعقوب بن عبد الله بن وهب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2214-2",
      "hadith_no": "2214",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، بهذا وقال في كل ما لم يقسم‏.‏ تابعه هشام عن معمر‏.‏ قال عبد الرزاق في كل مال‏.‏ رواه عبد الرحمن بن إسحاق عن الزهري‏.‏",
      "text_en": " Narrated Mussaddad from `Abdul Wahid:                     the same as above but said, \"... in every joint undivided thing...\" Narrated Hisham from Ma`mar the same as above but said, \" ... in every property... \"",
      "usc_msa_ref": "417",
      "chain": [
        "30175",
        "20115",
        "11876"
      ]
    },
    {
      "id": "sunan-abi-daud-756",
      "hadith_no": "756",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا حفص بن غياث، عن عبد الرحمن بن إسحاق، عن زياد بن زيد، عن أبي جحيفة، أن عليا، - رضى الله عنه - قال السنة وضع الكف على الكف في الصلاة تحت السرة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuJuhayfah said: Ali said that it is a sunnah to place one hand on the other in prayer below the navel.",
      "usc_msa_ref": "",
      "chain": [
        "30171",
        "20317",
        "11876",
        "4047",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-1105",
      "hadith_no": "1105",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا عبد الرحمن، - يعني ابن إسحاق - عن عبد الرحمن بن معاوية، عن ابن أبي ذباب، عن سهل بن سعد، قال ما رأيت رسول الله صلى الله عليه وسلم شاهرا يديه قط يدعو على منبره ولا على غيره ولكن رأيته يقول هكذا وأشار بالسبابة وعقد الوسطى بالإبهام ‏.‏",
      "text_en": " Narrated Sahl ibn Sa'd:                     I never saw the Messenger of Allah (ﷺ) raising his hands and praying on the pulpit or otherwise. But I saw him saying (doing) this way, and he would point with his forefinger making a circle by joining the middle finger with his thumb.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11876",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-1258",
      "hadith_no": "1258",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا عبد الرحمن، - يعني ابن إسحاق المدني - عن ابن زيد، عن ابن سيلان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدعوهما وإن طردتكم الخيل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Do not omit them (the two rak'ahs before the dawn prayer) even if you are driven away by the horses.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20423",
        "11876",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1603",
      "hadith_no": "1603",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن السري الناقط، حدثنا بشر بن منصور، عن عبد الرحمن بن إسحاق، عن الزهري، عن سعيد بن المسيب، عن عتاب بن أسيد، قال أمر رسول الله صلى الله عليه وسلم أن يخرص العنب كما يخرص النخل وتؤخذ زكاته زبيبا كما تؤخذ زكاة النخل تمرا ‏.‏",
      "text_en": " Narrated Attab ibn Usayd:                     The Messenger of Allah (ﷺ) commanded to estimate vines (for collecting zakat) as palm-trees are estimated. The zakat is to be paid in raisins as the zakat on palm trees is paid in dried dates.",
      "usc_msa_ref": "",
      "chain": [
        "20531",
        "11876",
        "11013",
        "11002",
        "994"
      ]
    },
    {
      "id": "sunan-abi-daud-2473",
      "hadith_no": "2473",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن عبد الرحمن، - يعني ابن إسحاق - عن الزهري، عن عروة، عن عائشة، أنها قالت السنة على المعتكف أن لا يعود مريضا ولا يشهد جنازة ولا يمس امرأة ولا يباشرها ولا يخرج لحاجة إلا لما لا بد منه ولا اعتكاف إلا بصوم ولا اعتكاف إلا في مسجد جامع ‏.‏ قال أبو داود غير عبد الرحمن بن إسحاق لا يقول فيه قالت السنة ‏.‏ قال أبو داود جعله قول عائشة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The sunnah for one who is observing i'tikaf (in a mosque) is not to visit a patient, or to attend a funeral, or touch or embrace one's wife, or go out for anything but necessary purposes. There is no i'tikaf without fasting, and there is no i'tikaf except in a congregational mosque.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "11876",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3390",
      "hadith_no": "3390",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن علية، ح وحدثنا مسدد، حدثنا بشر، - المعنى - عن عبد الرحمن بن إسحاق، عن أبي عبيدة بن محمد بن عمار، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما أتاه رجلان - قال مسدد من الأنصار ثم اتفقا - قد اقتتلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان هذا شأنكم فلا تكروا المزارع ‏\"‏ ‏.‏ زاد مسدد فسمع قوله ‏\"‏ لا تكروا المزارع ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Urwah b. al-Zubair:                     That Zayd ibn Thabit said: May Allah forgive Rafi' ibn Khadij. I swear by Allah, I have more knowledge of Hadith than him. Two persons of the Ansar (according to the version of Musaddad) came to him who were disputing with each other. The Messenger of Allah (ﷺ) said: If this is your position, then do not lease the agricultural land. The version of Musaddad has: So he (Rafi' ibn Khadij) heard his statement: Do not lease agricultural lands.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "30175",
        "11876",
        "19954",
        "10623",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-3779",
      "hadith_no": "3779",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن علية، عن عبد الرحمن بن إسحاق، عن عبد الرحمن بن معاوية، عن عثمان بن أبي سليمان، عن صفوان بن أمية، قال كنت آكل مع النبي صلى الله عليه وسلم فآخذ اللحم بيدي من العظم فقال ‏\"‏ أدن العظم من فيك فإنه أهنأ وأمرأ ‏\"‏ ‏.‏ قال أبو داود عثمان لم يسمع من صفوان وهو مرسل ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     I was eating with the Prophet (ﷺ) and snatching the meat from the bone with my hand. He said: bring the bone near your mouth, for it is more beneficial and wholesome.Abu Dawud said: 'Uthman did not hear (traditions) from Safwan. This is a mursal tradition.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20208",
        "11876",
        "10649",
        "449"
      ]
    },
    {
      "id": "sunan-abi-daud-4272",
      "hadith_no": "4272",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا حماد، أخبرنا عبد الرحمن بن إسحاق، عن أبي الزناد، عن مجالد بن عوف، أن خارجة بن زيد، قال سمعت زيد بن ثابت، في هذا المكان يقول أنزلت هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها ‏}‏ بعد التي في الفرقان ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ‏}‏ بستة أشهر ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The verse \"If a man kills a believer intentionally, his recompense is Hell to abide therein for ever\" was revealed six months after the verse \"And those who invoke not with Allah any other god, nor slay such life as Allah has made sacred, except for just cause in Surat al-Furqan.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20022",
        "11876",
        "11061",
        "13553",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-4661",
      "hadith_no": "4661",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، قال حدثني موسى بن يعقوب، عن عبد الرحمن بن إسحاق، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن زمعة، أخبره بهذا الخبر، قال لما سمع النبي صلى الله عليه وسلم صوت عمر قال ابن زمعة خرج النبي صلى الله عليه وسلم حتى أطلع رأسه من حجرته ثم قال ‏\"‏ لا لا لا ليصل للناس ابن أبي قحافة ‏\"‏ ‏.‏ يقول ذلك مغضبا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Abd Allah b. Zam’ah through a different chain. He said:                      When the Prophet (May peace be upon him) heard ‘Umar’s voice, Ibn Zam’ah said: The Prophet (May peace be upon him) came out until he took out his head of his apartment. He then said : No, no, no; the son of Abu Quhafah should lead the people in prayer. He said it angrily.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20172",
        "20706",
        "11876",
        "11013",
        "11004",
        "192"
      ]
    },
    {
      "id": "sunan-abi-daud-4816",
      "hadith_no": "4816",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا عبد الرحمن بن إسحاق، عن سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم في هذه القصة قال ‏\"‏ وإرشاد السبيل ‏\"‏ ‏.‏",
      "text_en": " ABU HURAIRAH REPORTED THE PROPHET(MAY PEACE BE UPON HIM) AS SAYING ON THE SAME OCCASION:                      AND GUIDING THE PEOPLE ON THEIR WAY.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20212",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-102",
      "hadith_no": "102",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، هو القرشي عن أبي عبيدة بن محمد بن عمار بن ياسر، قال سألت جابر بن عبد الله عن المسح، على الخفين فقال السنة يا ابن أخي ‏.‏ قال وسألته عن المسح، على العمامة فقال أمس الشعر الماء ‏.‏",
      "text_en": " Abu Ubaidah bin Muttammad bin Ammar bin Yasir said:                     \"I asked Jabir bin Abdullah about wiping over the Khuff. He said, 'O my nephew! It is the Sunnah.'\" [He said:] \"And I asked him about wiping over the lmamah. He said, '[Wipe1 the hair [with water].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20212",
        "11876",
        "19954",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-741",
      "hadith_no": "741",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، قال أخبرنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال سأله رجل فقال أى شهر تأمرني أن أصوم بعد شهر رمضان قال له ما سمعت أحدا يسأل عن هذا إلا رجلا سمعته يسأل رسول الله صلى الله عليه وسلم وأنا قاعد فقال يا رسول الله أى شهر تأمرني أن أصوم بعد شهر رمضان قال ‏\"‏ إن كنت صائما بعد شهر رمضان فصم المحرم فإنه شهر الله فيه يوم تاب الله فيه على قوم ويتوب فيه على قوم آخرين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " An-Nu'man bin Sa'd narrated:                     \"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11876",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1071",
      "hadith_no": "1071",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قبر الميت - أو قال أحدكم أتاه ملكان أسودان أزرقان يقال لأحدهما المنكر والآخر النكير فيقولان ما كنت تقول في هذا الرجل فيقول ما كان يقول هو عبد الله ورسوله أشهد أن لا إله إلا الله وأن محمدا عبده ورسوله ‏.‏ فيقولان قد كنا نعلم أنك تقول هذا ‏.‏ ثم يفسح له في قبره سبعون ذراعا في سبعين ثم ينور له فيه ثم يقال له نم ‏.‏ فيقول أرجع إلى أهلي فأخبرهم فيقولان نم كنومة العروس الذي لا يوقظه إلا أحب أهله إليه ‏.‏ حتى يبعثه الله من مضجعه ذلك ‏.‏ وإن كان منافقا قال سمعت الناس يقولون فقلت مثله لا أدري ‏.‏ فيقولان قد كنا نعلم أنك تقول ذلك ‏.‏ فيقال للأرض التئمي عليه ‏.‏ فتلتئم عليه ‏.‏ فتختلف فيها أضلاعه فلا يزال فيها معذبا حتى يبعثه الله من مضجعه ذلك ‏\"‏ ‏.‏ وفي الباب عن علي وزيد بن ثابت وابن عباس والبراء بن عازب وأبي أيوب وأنس وجابر وعائشة وأبي سعيد كلهم رووا عن النبي صلى الله عليه وسلم في عذاب القبر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"",
      "usc_msa_ref": "",
      "chain": [
        "20212",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2112",
      "hadith_no": "2112",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن في الجنة غرفا ترى ظهورها من بطونها وبطونها من ظهورها ‏\"‏ ‏.‏ فقام أعرابي فقال لمن هي يا رسول الله قال ‏\"‏ لمن أطاب الكلام وأطعم الطعام وأدام الصيام وصلى لله بالليل والناس نيام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث عبد الرحمن بن إسحاق ‏.‏ وقد تكلم بعض أهل الحديث في عبد الرحمن بن إسحاق هذا من قبل حفظه وهو كوفي وعبد الرحمن بن إسحاق القرشي مدني وهو أثبت من هذا وكلاهما كانا في عصر واحد ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah said:                     \"Indeed in Paradise there are chambers, whose outside can be seen from their inside, and their inside can be seen from their outside.\" A Bedouin stood and said : 'Who are they for, O Messenger of Allah?\" He said: \"For those who speak well, feed others, fast regularly, and perform salat [for Allah] during the night while the people sleep.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11876",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2190",
      "hadith_no": "2190",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن بديل بن قريش اليامي الكوفي، حدثنا محمد بن فضيل، حدثنا عبد الرحمن بن إسحاق، عن القاسم بن عبد الرحمن، هو ابن عبد الله بن مسعود عن أبيه، عن ابن مسعود، قال حدث رسول الله صلى الله عليه وسلم عن ليلة، أسري به أنه لم يمر على ملإ من الملائكة إلا أمروه أن مر أمتك بالحجامة ‏.‏ قال أبو عيسى وهذا حديث حسن غريب من حديث ابن مسعود ‏.‏",
      "text_en": " Ibn Mas'ud said:                     \"The Messenger of Allah (S.A.W) narrated about the Night of Isra', saying that he did not pass an assembly of angels except that they ordered him: 'Order cupping among your Ummah.\"",
      "usc_msa_ref": "",
      "chain": [
        "35000",
        "20356",
        "11876",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2619",
      "hadith_no": "2619",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شعار المؤمن على الصراط رب سلم سلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث المغيرة بن شعبة لا نعرفه إلا من حديث عبد الرحمن بن إسحاق ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated that The Messenger of Allah (s.a.w) said:                     \"The sign of the  believers upon the Sirat is: O lord, protect (us), protect (us).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11876",
        "166"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2718",
      "hadith_no": "2718",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن في الجنة لغرفا يرى ظهورها من بطونها وبطونها من ظهورها ‏\"‏ ‏.‏ فقام إليه أعرابي فقال لمن هي يا رسول الله قال ‏\"‏ هي لمن أطاب الكلام وأطعم الطعام وأدام الصيام وصلى لله بالليل والناس نيام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد تكلم بعض أهل العلم في عبد الرحمن بن إسحاق هذا من قبل حفظه وهو كوفي وعبد الرحمن بن إسحاق القرشي مدني وهو أثبت من هذا ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed in Paradise there are chambers whose outside can be seen from their inside, and their inside can be seen fom their outside.\" A Bedouin stood and said: \"Who are they for O Prophet of Allah?\" he said: \"For those who speak well, feed others, fast regularly, and perform Salat for Allah during the night while the people sleep.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "11876",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2747",
      "hadith_no": "2747",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أحمد بن منيع، وهناد، قالا حدثنا أبو معاوية، حدثنا عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن في الجنة لسوقا ما فيها شراء ولا بيع إلا الصور من الرجال والنساء فإذا اشتهى الرجل صورة دخل فيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed in Paradise there is a market in which there is no buying nor selling- except for images of men and women. So whenever a man desires an image, he enters it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "30480",
        "20354",
        "11876",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2763",
      "hadith_no": "2763",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، وأحمد بن منيع، قالا حدثنا أبو معاوية، قال حدثنا عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن في الجنة لمجتمعا للحور العين يرفعن بأصوات لم يسمع الخلائق مثلها قال يقلن نحن الخالدات فلا نبيد ونحن الناعمات فلا نبأس ونحن الراضيات فلا نسخط طوبى لمن كان لنا وكنا له ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وأبي سعيد وأنس ‏.‏ قال أبو عيسى حديث علي حديث غريب ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed in Paradise there is a gathering for Al-Hur Al-'Ein wherein they rasie their voices. The creatures have not heard the likes of them.\" [He said:] \"They say: 'We are the eternal ones, we shall not die. We are the ones who live in joy and comfort, we have no needs. We are the pleased ones, we do not get angry. Tuba(good news) to the one who belongs to us and we to him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30242",
        "20354",
        "11876",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3157",
      "hadith_no": "3157",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الواحد بن زياد، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خيركم من تعلم القرآن وعلمه ‏\"‏ ‏.‏ وهذا حديث لا نعرفه من حديث علي عن النبي صلى الله عليه وسلم إلا من حديث عبد الرحمن بن إسحاق ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     that the Messenger of Allah (ﷺ) said: \"The best of you is he who learns the Qur'an and teaches it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20256",
        "11876",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3462-2",
      "hadith_no": "3462",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا عبد الواحد بن زياد، عن عبد الرحمن بن إسحاق، عن القاسم بن عبد الرحمن، عن أبيه، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقيت إبراهيم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏ قال وفي الباب عن أبي أيوب ‏.‏ قال هذا حديث حسن غريب من هذا الوجه من حديث ابن مسعود ‏.‏",
      "text_en": " Ibn Mas’ud narrated that:                     The Messenger of Allah said: “I met Ibrahim on the night of my ascent, so he said: ‘O Muhammad, recite Salam from me to your nation, and inform them that Paradise has pure soil and delicious water, and that it is a flat treeless plain, and that its sees are: “Glory is to Allah (Subhan Allah) [and] all praise is due to Allah (Al-Hamdulillah) and ‘none has the right to be worshipped but Allah’ (La ilaha Illallah), and Allah is the greatest (Allahu Akbar).”",
      "usc_msa_ref": "",
      "chain": [
        "11429",
        "20256",
        "11876",
        "19896",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3545-2",
      "hadith_no": "3545",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا ربعي بن إبراهيم، عن عبد الرحمن بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رغم أنف رجل ذكرت عنده فلم يصل على ورغم أنف رجل دخل عليه رمضان ثم انسلخ قبل أن يغفر له ورغم أنف رجل أدرك عنده أبواه الكبر فلم يدخلاه الجنة ‏\"‏ ‏.‏ قال عبد الرحمن وأظنه قال أو أحدهما ‏.‏ قال وفي الباب عن جابر وأنس وهذا حديث حسن غريب من هذا الوجه ‏.‏ وربعي بن إبراهيم هو أخو إسماعيل بن إبراهيم وهو ثقة وهو ابن علية ‏.‏ ويروى عن بعض أهل العلم قال إذا صلى الرجل على النبي صلى الله عليه وسلم مرة في المجلس أجزأ عنه ما كان في ذلك المجلس ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “May the man before whom I am mentioned - and he does not send Salat upon me - be humiliated. And may a man upon whom Ramadan enters and then passes, before he is forgiven, be humiliated. And may a man whose parents reached old age in his presence, and they were not a cause for his entrance to Paradise, be humiliated”",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3563-2",
      "hadith_no": "3563",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يحيى بن حسان، حدثنا أبو معاوية، عن عبد الرحمن بن إسحاق، عن سيار، عن أبي وائل، عن علي، رضى الله عنه أن مكاتبا، جاءه فقال إني قد عجزت عن كتابتي فأعني ‏.‏ قال ألا أعلمك كلمات علمنيهن رسول الله صلى الله عليه وسلم لو كان عليك مثل جبل صير دينا أداه الله عنك قال ‏\"‏ قل اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Ali [may Allah be pleased with him] narrated:                     that a Mukatib came to him and said: “Indeed I am not capable of my Kitabah so aid me.” He said: “Should I not teach you words that the Messenger of Allah taught me? If you had a debt upon you similar to the mountain of Sir, Allah would fulfill it for you. He said: ‘Say: O Allah, suffice me with Your lawful against Your prohibited, and make me independent of all those besides You (Allahummakafini Bihalalika An Haramika, Wa Aghnini Bi Fadlika Amman Siwaka).’”",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20300",
        "20354",
        "11876",
        "11429",
        "11353",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3589-2",
      "hadith_no": "3589",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا حسين بن علي بن الأسود البغدادي، حدثنا محمد بن فضيل، عن عبد الرحمن بن إسحاق، عن حفصة بنت أبي كثير، عن أبيها أبي كثير، عن أم سلمة، قالت علمني رسول الله صلى الله عليه وسلم قال ‏\"‏ قولي اللهم هذا استقبال ليلك وإدبار نهارك وأصوات دعاتك وحضور صلواتك أسألك أن تغفر لي ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ وحفصة بنت أبي كثير لا نعرفها ولا أباها ‏.‏",
      "text_en": " Umm Salamah said:                     “The Messenger of Allah taught me, saying: ‘Say: “O Allah, this is the coming of Your night, and the departing of Your day, the voices of those calling to You, and the time of prayers to You, I ask You to forgive me (Allahumma Hadhastiqbalu Lailika, Wastidbaru Naharika, Wa Aswatu Du’atika Wa Huduru Salawatika, As’aluka An Taghfira Li).”",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20356",
        "11876",
        "19467",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-2618",
      "hadith_no": "2618",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، ويزيد، قالا حدثنا عبد الرحمن بن إسحاق، عن الزهري، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم أمر عتاب بن أسيد أن يخرص العنب فتؤدى زكاته زبيبا كما تؤدى زكاة النخل تمرا ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Al-Musayyab:                     That the Messenger of Allah told 'Attab bin Usaid to estimate the (harvest of) grapes, and to pay Zakah in raisins, just as the Zakah on date palms is given in died dates.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20212",
        "20472",
        "11876",
        "11013",
        "11002"
      ]
    },
    {
      "id": "sunan-an-nasai-3099",
      "hadith_no": "3099",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا بشر، - يعني ابن المفضل - قال أنبأنا عبد الرحمن بن إسحاق، عن الزهري، عن سهل بن سعد، قال رأيت مروان بن الحكم جالسا فجئت حتى جلست إليه فحدثنا أن زيد بن ثابت حدثه أن رسول الله صلى الله عليه وسلم أنزل عليه لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله ‏.‏ فجاء ابن أم مكتوم وهو يملها على فقال يا رسول الله لو أستطيع الجهاد لجاهدت فأنزل الله عز وجل وفخذه على فخذي فثقلت على حتى ظننت أن سترض فخذي ثم سري عنه ‏{‏ غير أولي الضرر ‏}‏ قال أبو عبد الرحمن عبد الرحمن بن إسحاق هذا ليس به بأس وعبد الرحمن بن إسحاق يروي عنه علي بن مسهر وأبو معاوية وعبد الواحد بن زياد عن النعمان بن سعد ليس بثقة ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                      \"I saw Marwan bin Al-Hakam sitting and I came and sat with him. He told us that Zaid bin Thabit told him, that the following was revealed to Allah's Messenger (ﷺ): (Not equal are those of the believers who sit (at home) and those who strive hard and fight in the cause of Allah), then Ibn Umm Maktum came when he was dictating it to me (Zaid), and said: 'O Messenger of Allah! If I were able to go for Jihad I would go out for Jihad.' Then Allah, the Mighty and Sublime, revealed to him - while his thigh was against mine, and became so heavy that I thought my thigh would break, until (the revelation) stopped -: 'Except those who are disabled (by injury or are blind or lame).'\" [1]Abu 'Abdur-Rahman (An-Nasa'i) said: This 'Abdur-Rahman bin Ishaq is tolerable, while 'Abdur-Rahman bin IShaq, from whom reports 'Ali bin Mushir, abu Mu'awiyah, and 'Abdul-Wahid bin Ziyad from An-Nu'man bin Sa'd - he is not trustworthy.[1] An-Nisa' 4:95.",
      "usc_msa_ref": "",
      "chain": [
        "30448",
        "20212",
        "11876",
        "11013",
        "399",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-3927",
      "hadith_no": "3927",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا الحسين بن محمد، قال حدثنا إسماعيل بن إبراهيم، قال حدثنا عبد الرحمن بن إسحاق، عن أبي عبيدة بن محمد، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما كانا رجلين اقتتلا فقال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ إن كان هذا شأنكم فلا تكروا المزارع ‏‏\"‏‏‏.‏‏ فسمع قوله ‏‏\"‏‏ لا تكروا المزارع ‏‏\"‏‏‏.‏‏ قال أبو عبد الرحمن كتابة مزارعة على أن البذر والنفقة على صاحب الأرض وللمزارع ربع ما يخرج الله عز وجل منها هذا كتاب كتبه فلان بن فلان بن فلان في صحة منه وجواز أمر لفلان بن فلان إنك دفعت إلى جميع أرضك التي بموضع كذا فى مدينة كذا مزارعة وهي الأرض التي تعرف بكذا وتجمعها حدود أربعة يحيط بها كلها وأحد تلك الحدود بأسره لزيق كذا والثاني والثالث والرابع دفعت إلى جميع أرضك هذه المحدودة في هذا الكتاب بحدودها المحيطة بها وجميع حقوقها وشربها وأنهارها وسواقيها أرضا بيضاء فارغة لا شىء فيها من غرس و لا زرع سنة تامة أولها مستهل شهر كذا من سنة كذا وآخرها انسلاخ شهر كذا من سنة كذا على أن أزرع جميع هذه الأرض المحدودة في هذا الكتاب الموصوف موضعها فيه هذه السنة المؤقتة فيها من أولها إلى آخرها كل ما أردت وبدا لي أن أزرع فيها من حنطة وشعير وسماسم وأرز وأقطان ورطاب وباقلا وحمص ولوبيا وعدس ومقاثي ومباطيخ وجزر وشلجم وفجل وبصل وثوم وبقول ورياحين وغير ذلك من جميع الغلات شتاء وصيفا ببذورك وبذرك وجميعه عليك دوني على أن أتولى ذلك بيدي وبمن أردت من أعواني وأجرائي وبقري وأدواتي وإلى زراعة ذلك وعمارته والعمل بما فيه نماؤه ومصلحته وكراب أرضه وتنقية حشيشها وسقى ما يحتاج إلى سقيه مما زرع وتسميد ما يحتاج إلى تسميده وحفر سواقيه وأنهاره واجتناء ما يجتنى منه والقيام بحصاد ما يحصد منه وجمعه ودياسة ما يداس منه وتذريته بنفقتك على ذلك كله دوني وأعمل فيه كله بيدي وأعواني دونك على أن لك من جميع ما يخرج الله عز وجل من ذلك كله في هذه المدة الموصوفة في هذا الكتاب من أولها إلى آخرها فلك ثلاثة أرباعه بحظ أرضك وشربك وبذرك ونفقاتك ولي الربع الباقي من جميع ذلك بزراعتي وعملي وقيامي على ذلك بيدي وأعواني ودفعت إلى جميع أرضك هذه المحدودة في هذا الكتاب بجميع حقوقها ومرافقها وقبضت ذلك كله منك يوم كذا من شهر كذا من سنة كذا فصار جميع ذلك في يدي لك لا ملك لي في شىء منه ولا دعوى ولا طلبة إلا هذه المزارعة الموصوفة في هذا الكتاب في هذه السنة المسماة فيه فإذا انقضت فذلك كله مردود إليك وإلى يدك ولك أن تخرجني بعد انقضائها منها وتخرجها من يدي ويد كل من صارت له فيها يد بسببي أقر فلان وفلان وكتب هذا الكتاب نسختين‏.‏‏",
      "text_en": " It was narrated that 'Urwah bin Az-Zubair said:                      \"Zaid bin Thabit said: 'May Allah forgive Rafi' bin Khadij. By Allah, I have more knowledge of the Hadith than him. We were two men who fought and the Messenger of Allah said: If this is how it is between you, then do not lease land. And he only heard the words: Do not lease land.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20208",
        "11876",
        "10623",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-4008",
      "hadith_no": "4008",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا عمرو بن علي، عن مسلم بن إبراهيم، قال حدثنا حماد بن سلمة، عن عبد الرحمن بن إسحاق، عن أبي الزناد، عن مجالد بن عوف، قال سمعت خارجة بن زيد بن ثابت، يحدث عن أبيه، أنه قال نزلت ‏{‏ ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها ‏}‏ أشفقنا منها فنزلت الآية التي في الفرقان ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ‏}‏ ‏.‏",
      "text_en": " It was narrated that Mujalid bin 'Awf said:                     \"I heard Kharijah bin Zaid bin Thabit narrate that his father said: (The Verse) 'And whoever kills a believer intentionally, his recompense is Hell' was revealed and we became worried about it. Then the Verse in Al-Furqan 'And those who invoke not any other ilah (god) along with Allah, or kill such person as Allah has forbidden, except by right.' was revealed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20285",
        "20021",
        "11876",
        "11061",
        "13553",
        "11006",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-5043",
      "hadith_no": "5043",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، قال حدثنا عبد الرحمن بن إسحاق، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من الفطرة الختان وحلق العانة ونتف الضبع وتقليم الظفر وتقصير الشارب ‏\"‏ ‏.‏ وقفه مالك ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Five things are of the Fitrah: Circumcision, shaving the pubes, plucking the armpit hair, clipping the nails and trimming the mustache.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-707-2",
      "hadith_no": "707",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن خالد بن عبد الله الواسطي، حدثنا أبي، عن عبد الرحمن بن إسحاق، عن الزهري، عن سالم، عن أبيه، أن النبي  صلى الله عليه وسلم  استشار الناس لما يهمهم إلى الصلاة فذكروا البوق فكرهه من أجل اليهود ثم ذكروا الناقوس فكرهه من أجل النصارى فأري النداء تلك الليلة رجل من الأنصار يقال له عبد الله بن زيد وعمر بن الخطاب فطرق الأنصاري رسول الله  صلى الله عليه وسلم  ليلا فأمر رسول الله  صلى الله عليه وسلم  بلالا به فأذن ‏.‏ قال الزهري وزاد بلال في نداء صلاة الغداة الصلاة خير من النوم فأقرها رسول الله  صلى الله عليه وسلم  ‏.‏ قال عمر يا رسول الله قد رأيت مثل الذي رأى ولكنه سبقني ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that:                     The Prophet consulted the people as to how he could call them to the prayer. They suggested a horn, but he disliked that because of the Jews (because the Jews used a horn). Then they suggested a bell but he disliked that because of the Christians (because the Christians used a bell). Then that night the call to the prayer was shown in a dream to a man among the Ansar whose name was 'Abdullah bin Zaid, and to 'Umar bin Khattab. The Ansari man came to the Messenger of Allah at night, and the Messenger of Allah commanded Bilal to give the call to the prayer. (Da'if)Zuhri said: \"Bilal added the phrase \"As-salatu khairum minan-nawm (the prayer is better than sleep)\" to the call for the morning prayer, and the Messenger of Allah approved of that.\" 'Umar said: \"O Messenger of Allah, I saw the same as he did, but he beat me to it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38496",
        "11876",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1254",
      "hadith_no": "1254",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن عبد الرحمن بن إسحاق، عن الزهري، عن عروة، عن عائشة، قالت كان النبي  صلى الله عليه وسلم  إذا صلى ركعتى الفجر اضطجع على شقه الأيمن ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Prophet (ﷺ) prayed thetwo (Sunnah) Rak’ah of Fajr, he would lie down on his right side.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11876",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2072",
      "hadith_no": "2072",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن خلف أبو سلمة، حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، عن الزهري، عن سالم، عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الشؤم في ثلاثة في الفرس والمرأة والدار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that:                     the Messenger of Allah said: \"Omens are only to be found in three things: a horse, a woman and a house.\" (Sahih)(One of the narrators) Az-Zuhri said: \" Abu 'Ubaidah bin 'Abdullah bin Zam'ah said that his mother, Zainab, narrated to him, from Umm Salamah, that she used to list these three, and add to them \"the sword.\"",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20212",
        "11876",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2512",
      "hadith_no": "2512",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل بن إبراهيم، عن عبد الرحمن بن إسحاق، عن عبد الرحمن بن معاوية، عن حنظلة بن قيس، عن أبي اليسر، صاحب النبي صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب أن يظله الله في ظله - فلينظر معسرا أو ليضع له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Yasar, the Companion of the Prophet (ﷺ) that :                     the Messenger of Allah (ﷺ) said: “Whoever would like Allah to shade him with His shade, let him give respite to one in difficulty, or waive repayment of the loan.”",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "20208",
        "11876",
        "11503"
      ]
    },
    {
      "id": "sunan-ibn-majah-2555",
      "hadith_no": "2555",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل ابن علية، حدثنا عبد الرحمن بن إسحاق، حدثني أبو عبيدة بن محمد بن عمار بن ياسر، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما أتى رجلان النبي صلى الله عليه وسلم وقد اقتتلا فقال ‏\"‏ إن كان هذا شأنكم فلا تكروا المزارع ‏\"‏ ‏.‏ قال فسمع رافع بن خديج قوله ‏\"‏ فلا تكروا المزارع ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Thabit said:                     “May Allah (SWT) forgive Rafi' bin Khadij. By Allah (SWT)! I have more knowledge of Ahadith than  he does. Two men who had quarreled came to the Prophet (ﷺ) and he said: 'If this is your situation, do not lease farms,' and what Rafi' bin khadij heard was 'Do not lease farms.'  ”",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "20208",
        "11876",
        "19954",
        "10623",
        "10511"
      ]
    }
  ],
  "total_hadiths": 35
}