{
  "id": "11875",
  "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
  "full_name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "153",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11833",
      "name": "Ja'far bin 'Abdullah جعفر بن عبد الله بن الحكم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11833",
      "name": "Ja'far bin 'Abdullah جعفر بن عبد الله بن الحكم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11231",
      "name": "Wahb bin Kysan al-Quraishi وهب بن كيسان القرشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10890",
      "name": "al-Aswad bin al-'Ala' bin Jaryh الأسود بن العلاء بن جارية",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11150",
      "name": "Ibrahim bin 'Abdullah إبراهيم بن عبد الله بن حنين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10605",
      "name": "'Imran bin Abi Anas عمران بن أبي أنس القرشي العامري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20554",
      "name": "'Abdullah bin Hmran عبد الله بن حمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20254",
      "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20120",
      "name": "al-Waqidi محمد بن عمر بن واقد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، - واللفظ لابن المثنى - قالا حدثنا الضحاك بن مخلد، أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك فأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
      "text_en": " Mahmud b. Labid reported:                      When 'Uthman b. 'Affan intended to build the mosque (of the Prophet) the people did not approve of it. They liked that it should be kept in the same state. Thereupon he said: I heard the Messenger of Allah (may peace be upon him) say: He who built a mosque for Allah, Allah would build a house for him like it in Paradise.",
      "chain": [
        "30022",
        "30170",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "3452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عبد الحميد بن جعفر، أن عمران بن أبي أنس، حدثه أن سلمان الأغر حدثه أنه، سمع أبا هريرة، يخبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما يسافر إلى ثلاثة مساجد مسجد الكعبة ومسجدي ومسجد إيلياء ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:                      One should undertake journey to three mosques: the mosque of the Ka'ba, my mosque, and the mosque of Elia (Bait al-Maqdis).",
      "chain": [
        "30492",
        "20029",
        "11875",
        "10605",
        "11171"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا هشيم، ح وحدثنا ابن نمير، حدثنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد، الله اليزني عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏ هذا لفظ حديث أبي بكر وابن المثنى ‏.‏ غير أن ابن المثنى قال ‏\"‏ الشروط ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word\" condition\" ) it is\" conditions\".",
      "chain": [
        "20379",
        "20468",
        "30212",
        "20032",
        "30201",
        "20326",
        "30170",
        "20031",
        "11875",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "3721",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني إبراهيم بن موسى الرازي، حدثنا عيسى، - يعني ابن يونس - حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفرك مؤمن مؤمنة إن كره منها خلقا رضي منها آخر ‏\"‏ ‏.‏ أو قال ‏\"‏ غيره ‏\"‏ ‏.‏",
      "text_en": " Ab Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A believing man should not hate a believing woman; if he dislikes one of her characteristics, he will be pleased with another.",
      "chain": [
        "30309",
        "20347",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "chain": [
        "30170",
        "20241",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "4133",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو أسامة، عن عبد الحميد، بن جعفر عن يزيد بن أبي حبيب، عن عطاء، عن جابر، قال سمعت رسول الله صلى الله عليه وسلم عام الفتح ح وحدثنا محمد بن المثنى حدثنا الضحاك - يعني أبا عاصم - عن عبد الحميد حدثني يزيد بن أبي حبيب قال كتب إلى عطاء أنه سمع جابر بن عبد الله يقول سمعت رسول الله صلى الله عليه وسلم عام الفتح بمثل حديث الليث ‏.‏",
      "text_en": " Yazid b. Abu Habib reported:                      'Ata' reported to me that he heard Jabir (b. 'Abdullah) saying it that he had heard that from Allah's Messenger (may peace be upon him) in the Year of Victory.",
      "chain": [
        "30201",
        "30212",
        "20318",
        "11875",
        "11411",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4611",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، حدثنا عبد الحميد بن جعفر، عن سعيد بن أبي سعيد المقبري، عن أبي شريح الخزاعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الضيافة ثلاثة أيام وجائزته يوم وليلة ولا يحل لرجل مسلم أن يقيم عند أخيه حتى يؤثمه ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف يؤثمه قال ‏\"‏ يقيم عنده ولا شىء له يقريه به ‏\"‏ ‏.‏",
      "text_en": " Abu Shuriah al-Khuza'i reported Allah's Messenger (may peace be upon him) as saying:                      (The period of the entertainment of a guest is three days, and utmost kindness and courtesy is for a day and a night. =\" It is not permissible for a Muslim to stay with, his brother until he makes him sinful. They said: Messenger of Allah, how he would make him sinful? He (the Holy Prophet) said: He stays with him (so long) that nothing is left with him to entertain him.",
      "chain": [
        "30216",
        "20032",
        "11875",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4612",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو بكر، - يعني الحنفي - حدثنا عبد الحميد، بن جعفر حدثنا سعيد المقبري، أنه سمع أبا شريح الخزاعي، يقول سمعت أذناى، وبصر، عيني ووعاه قلبي حين تكلم به رسول الله صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث الليث وذكر فيه ‏\"‏ ولا يحل لأحدكم أن يقيم عند أخيه حتى يؤثمه ‏\"‏ ‏.‏ بمثل ما في حديث وكيع ‏.‏",
      "text_en": " Sa'id al-Maqburi reported:                      I heard Abu Shuraih al-Khuzill saying: My ears heard and my eyes saw and my mind retained it, when Allah's Messenger (may peace be upon him) spok this, and he then narrated the hadith and made mention of this:\" It is not permissible for any one of you to stay with his brother until he makes him sinful.\"",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو بكر الحنفي، حدثني عبد الحميد بن جعفر، حدثني سعيد بن أبي سعيد المقبري، أنه سمع أبا هريرة، يقول بعث رسول الله صلى الله عليه وسلم خيلا له نحو أرض نجد فجاءت برجل يقال له ثمامة بن أثال الحنفي سيد أهل اليمامة ‏.‏ وساق الحديث بمثل حديث الليث إلا أنه قال إن تقتلني تقتل ذا دم ‏.‏",
      "text_en": " The same tradition has been narrated by a different chain of transmitters with a slight difference in the wording.",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5254",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو بكر، - يعني الحنفي - حدثنا عبد الحميد، بن جعفر حدثني أبي أنه، سمع أنس بن مالك، يقول لقد أنزل الله الآية التي حرم الله فيها الخمر وما بالمدينة شراب يشرب إلا من تمر ‏.‏",
      "text_en": " Anas b. Malik reported:                      Allah revealed the verse in which Allah prohibited the use of liquor. In those days no other liquor was drunk but that prepared from dates.",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11833",
        "19"
      ]
    },
    {
      "hadith_no": "5549",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا الضحاك، - يعني أبا عاصم - حدثنا عبد، الحميد بن جعفر حدثني يزيد بن أبي حبيب، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of azid b. Abu Habib with the same chain of transmitters.",
      "chain": [
        "30170",
        "11875"
      ]
    },
    {
      "hadith_no": "6973",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الله بن حمران، عن عبد الحميد بن جعفر، أخبرني  أبي جعفر، عن عمر بن الحكم، عن عبد الله بن عمرو بن العاص، عن النبي صلى الله عليه وسلم بمثل حديث هشام بن عروة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah b. Amr b. al-'As through another chain of transmitters.",
      "chain": [
        "30170",
        "20554",
        "11875",
        "11897",
        "29"
      ]
    },
    {
      "hadith_no": "7458",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين وأبو معن الرقاشي - واللفظ لأبي معن - قالا حدثنا خالد بن الحارث، حدثنا عبد الحميد بن جعفر، أخبرني أبي، عن سليمان بن، يسار عن عبد الله بن الحارث بن نوفل، قال كنت واقفا مع أبى بن كعب فقال لا يزال الناس مختلفة أعناقهم في طلب الدنيا ‏.‏ قلت أجل ‏.‏ قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يوشك الفرات أن يحسر عن جبل من ذهب فإذا سمع به الناس ساروا إليه فيقول من عنده لئن تركنا الناس يأخذون منه ليذهبن به كله قال فيقتتلون عليه فيقتل من كل مائة تسعة وتسعون ‏\"‏ ‏.‏ قال أبو كامل في حديثه قال وقفت أنا وأبى بن كعب في ظل أجم حسان ‏.‏",
      "text_en": " 'Abdullah b. Harith b. Naufal reported:                      I was standing along with Ubayy b. Ka, b and he said: The opinions of the people differ in regard to the achievement of worldly ends. I said: Yes, of course. Thereupon he said: I heard Allah's Messenger (may peace be upon him) as saying: The Euphrates would soon uncover a mountain of gold and when the people would bear of it they would flock towards it but the people who would possess that (treasure) (would say): If we allow these persons to take out of it they would take away the whole of it. So they would fight and ninety-nine out of one hundred would be killed. Abu Kamil in his narration said: I and Abu Ka'b stood under the shade of the battlement of Hassan.",
      "chain": [
        "20226",
        "11875",
        "11833",
        "11005",
        "912"
      ]
    },
    {
      "hadith_no": "7483",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو كامل الجحدري، وأبو معن زيد بن يزيد الرقاشي - واللفظ لأبي معن - قالا حدثنا خالد بن الحارث، حدثنا عبد الحميد بن جعفر، عن الأسود بن العلاء، عن  أبي سلمة، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يذهب الليل والنهار حتى تعبد اللات والعزى ‏\"‏ ‏.‏ فقلت يا رسول الله إن كنت لأظن حين أنزل الله ‏{‏ هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون‏}‏  أن ذلك تاما قال ‏\"‏ إنه سيكون من ذلك ما شاء الله ثم يبعث الله ريحا طيبة فتوفى كل من في قلبه مثقال حبة خردل من إيمان فيبقى من لا خير فيه فيرجعون إلى دين آبائهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The (system) of night and day would not end until the people have taken to the worship of Lat and 'Uzza. I said: Allah's Messenger, I think when Allah has revealed this verse:\" He it is Who has sent His Messenger with right guidance, and true religion, so that He may cause it to prevail upon all religions, though the polytheists are averse (to it)\" (ix. 33), it implies that (this promise) is going to be fulfilled. Thereupon he (Allah's Apostle) said: It would happen as Allah would like. Then Allah would send the sweet fragrant air by which everyone who has even a mustard grain of faith in Him would die and those only would survive who would have no goodness in them. And they would revert to the religion of their forefathers.",
      "chain": [
        "30559",
        "20226",
        "11875",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "7484",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو بكر، - وهو الحنفي - حدثنا عبد الحميد، بن جعفر بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Ja'far with the same chain of transmitters.",
      "chain": [
        "30170",
        "20254",
        "11875"
      ]
    },
    {
      "hadith_no": "7493",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا عبد الكبير بن عبد المجيد أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، قال سمعت عمر بن الحكم، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تذهب الأيام والليالي حتى يملك رجل يقال له الجهجاه ‏\"‏ ‏.‏ قال مسلم هم أربعة إخوة شريك وعبيد الله وعمير وعبد الكبير بنو عبد المجيد ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The day and the night would not come to an end before a man called al-Jahjah would occupy the throne.",
      "chain": [
        "30160",
        "11875",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "7662",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، كلاهما عن الضحاك، - قال ابن المثنى حدثنا الضحاك بن مخلد، - أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك وأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
      "text_en": " Mahmud b. Labid reported that 'Uthman b. 'Affan decided to rebuild the mosque (of Allah's Apostle in Medina) but the people did not like this idea and they wished that it should be preserved in the same (old) form. Thereupon he (Hadrat 'Uthman) said:                      I heard Allah's Messenger (may peace be upon him) as saying: He who builds a mosque for Allah, Allah would build for him (a house) in Paradise like it.",
      "chain": [
        "30022",
        "30170",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، ح وحدثنا مسدد، حدثنا يحيى، - وهذا حديث أحمد قال - أخبرنا عبد الحميد، - يعني ابن جعفر - أخبرني محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فلم فوالله ما كنت بأكثرنا له تبعا ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يرفع يديه حتى يحاذي بهما منكبيه ثم يكبر حتى يقر كل عظم في موضعه معتدلا ثم يقرأ ثم يكبر فيرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه ثم يعتدل فلا يصب رأسه ولا يقنع ثم يرفع رأسه فيقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يرفع يديه حتى يحاذي بهما منكبيه معتدلا ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم يهوي إلى الأرض فيجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتح أصابع رجليه إذا سجد ويسجد ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ويرفع رأسه ويثني رجله اليسرى فيقعد عليها حتى يرجع كل عظم إلى موضعه ثم يصنع في الأخرى مثل ذلك ثم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ثم يصنع ذلك في بقية صلاته حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ قالوا صدقت هكذا كان يصلي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Humaid al-Sa’idi once told a company of ten of the companions of the Messenger of Allah (ﷺ) ; Abu Qatadah was one of them:                      I am one among you who is more informed of the way the Messenger of Allah (ﷺ) prayed. They said: Why, By Allah, you did not follow him more than us, nor did you remain in his company longer than us? He said: Yes. They said: Then describe (how the Prophet prayed). He said: When the Messenger of Allah (ﷺ) stood up to pray, he raised his hands so as to bring them opposite his shoulders, and uttered the takbir (Allah is the most great), until every bone rested in its place properly: then re recited (some verses from the Quran); then he uttered the takbir (Allah is most great), raising his hands so as to bring them opposite his shoulders; then he bowed; placing the palms of his hands on his knees and keeping himself straight, neither raising nor lowering his head; then raised his head saying: “Allah listens to him who praise Him”; then raised his hands so as to bring them exactly opposite to his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated: then he uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of the two Rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders; then he bowed, placing the palms of his hands on his knees and keeping himself straight, neither raising or lowering his head: then raised his head saying: “Allah listens to him who praises Him”; then raised his hands so as to bring them exactly opposite his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated himself; then he prostrated; then uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of two rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders in the way he had uttered the Takbir (Allah is most great) at the beginning of the prayer; then he did that in the remainder of his prayer; and after prostration which if followed by the taslim (salutation) he out his left foot and sat on his left hip. They said: You have spoken the truth. This is how he(peace be upon him) used to pray.",
      "chain": [
        "30007",
        "20241",
        "30175",
        "20031",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا عبد الحميد يعني ابن جعفر، ح وحدثنا مسدد، حدثنا يحيى، حدثنا عبد الحميد، - يعني ابن جعفر - حدثني محمد بن عمرو، عن أبي حميد الساعدي، قال سمعته في، عشرة من أصحاب رسول الله صلى الله عليه وسلم - وقال أحمد قال أخبرني محمد بن عمرو بن عطاء قال سمعت أبا حميد الساعدي في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة - قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فاعرض ‏.‏ فذكر الحديث ‏.‏ قال ويفتح أصابع رجليه إذا سجد ثم يقول الله أكبر ويرفع ويثني رجله اليسرى فيقعد عليها ثم يصنع في الأخرى مثل ذلك فذكر الحديث ‏.‏ قال حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ زاد أحمد قالوا صدقت هكذا كان يصلي ولم يذكرا في حديثهما الجلوس في الثنتين كيف جلس",
      "text_en": " Abu Humaid al-sa’idi said (in the presence of ten compansions of the prophet):                      I am more informed than any of you regarding the manner in which the Messenger of Allah (ﷺ) offered his prayer. They said: Present it. The narrator then reported the tradition, saying: he bent the toes of his feet turning them towards the Qiblah when he prostrated, then he uttered “ Allah is most great,” and raised (his head), and bent his left foot and sat on it, and he did the same in the second Rakah. The narrator then transmitted the tradition, and added: In the prostration (i.e., the Rakah) which ended at the salutation, he sat on the hips at the left side. ahmad (b. Hanbal) added: they said : You are right. This is how he used to pray. They (Ahmed and Musaddad) did not mention in their versions how he sat after offering two rak’ahs of prayer.",
      "chain": [
        "30007",
        "20241",
        "11875",
        "30175",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة المروزي، أخبرنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن عطاء، عن ابن عمر، قال كان إذا كان بمكة فصلى الجمعة تقدم فصلى ركعتين ثم تقدم فصلى أربعا وإذا كان بالمدينة صلى الجمعة ثم رجع إلى بيته فصلى ركعتين ولم يصل في المسجد فقيل له فقال كان رسول الله صلى الله عليه وسلم يفعل ذلك ‏.‏",
      "text_en": " 'Ata said:                      When Ibn 'Umar offered the Friday prayer in Mecca he would go forward and pray two rak'ahs, he would then go forward and pray four rak'ahs; but when he was in Medina, he offered the Friday prayer, then returned to his house and prayed two rak'ahs, not praying them in the mosque. Someone mentioned this to him and he replied that the Messenger of Allah (ﷺ) used to do it.",
      "chain": [
        "20452",
        "11875",
        "11411",
        "11029",
        "18"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يحيى، - يعني القطان - عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة، عن عوف بن مالك، قال دخل علينا رسول الله صلى الله عليه وسلم المسجد وبيده عصا وقد علق رجل منا قنا حشفا فطعن بالعصا في ذلك القنو وقال ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها ‏\"‏ ‏.‏ وقال ‏\"‏ إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Messenger of Allah (ﷺ) entered upon us in the mosque, and he had a stick in his hand. A man hung there a bunch of hashaf. He struck the bunch with the stick, and said: If the owner of this sadaqah (alms) wishes to give a better one than it, he would give. The owner of this sadaqah will eat hashaf on the Day of Judgment.",
      "chain": [
        "38662",
        "20031",
        "11875",
        "18431",
        "19940",
        "10805"
      ]
    },
    {
      "hadith_no": "2244",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، حدثنا عبد الحميد بن جعفر، أخبرني أبي، عن جدي، رافع بن سنان أنه أسلم وأبت امرأته أن تسلم فأتت النبي صلى الله عليه وسلم فقالت ابنتي وهي فطيم أو شبهه وقال رافع ابنتي ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ اقعد ناحية ‏\"‏ ‏.‏ وقال لها ‏\"‏ اقعدي ناحية ‏\"‏ ‏.‏ قال وأقعد الصبية بينهما ثم قال ‏\"‏ ادعواها ‏\"‏ ‏.‏ فمالت الصبية إلى أمها فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم اهدها ‏\"‏ ‏.‏ فمالت الصبية إلى أبيها فأخذها ‏.‏",
      "text_en": " 'Abd al-Hamid ibn Ja'far reported from his father on the authority of his grandfather Rafi' ibn Sinan that he (Rafi' ibn Sinan) embraced Islam and his wife refused to embrace Islam. She came to the Prophet (ﷺ) and said:                      My daughter; she is weaned or about to wean. Rafi' said: My daughter. The Prophet (ﷺ) said to him: Be seated on a side. And he said to her: Be seated on a side. He then seated the girl between them, and said to them: Call her. The girl inclined to her mother. The Prophet (ﷺ) said: O Allah! guide her. The daughter then inclined to her father, and he took her.",
      "chain": [
        "30309",
        "20347",
        "11875",
        "11833"
      ]
    },
    {
      "hadith_no": "3116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مالك بن عبد الواحد المسمعي، حدثنا الضحاك بن مخلد، حدثنا عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان آخر كلامه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     The Messenger of Allah (ﷺ) as saying: If anyone's last words are \"There is no god but Allah\" he will enter Paradise.",
      "chain": [
        "11875",
        "18431",
        "19940",
        "32"
      ]
    },
    {
      "hadith_no": "3315",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن عمرو بن شعيب، عن ميمونة بنت كردم بن سفيان، عن أبيها، نحوه مختصر منه شىء قال ‏:‏ ‏\"‏ هل بها وثن أو عيد من أعياد الجاهلية ‏\"‏ ‏.‏ قال ‏:‏ لا ‏.‏ قلت ‏:‏ إن أمي هذه عليها نذر ومشى أفأقضيه عنها وربما قال ابن بشار ‏:‏ أنقضيه عنها قال ‏:‏ ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted in brief by Maimunah daughter of Kardam son of Sufyan on the authority of her father through a different chain of narrators. This version adds:                      (The Prophet asked): Does it contain an idol or was a festival of pre-Islamic times celebrated there ? He replied: No. I said: This mother of mine has taken a vow and walking (is binding on her). May I fulfill it on her behalf ? Sometimes the narrator Bashshar said: May we fulfill in on her behalf ? He said: Yes.",
      "chain": [
        "30160",
        "20254",
        "11875",
        "19934",
        "4015",
        "4016"
      ]
    },
    {
      "hadith_no": "3487",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، قال كتب إلى عطاء عن جابر، نحوه لم يقل ‏\"‏ هو حرام ‏\"‏ ‏.‏",
      "text_en": " Yazid b. Abi Habib said:                      Jabir wrote to me a similar tradition. But he did not say in this version \"It is forbidden.\"",
      "chain": [
        "30160",
        "20241",
        "11875",
        "11411",
        "34"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد القطان، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته وهو، في عشرة من أصحاب النبي صلى الله عليه وسلم أحدهم أبو قتادة بن ربعي يقول أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا ما كنت أقدمنا له صحبة ولا أكثرنا له إتيانا قال بلى ‏.‏ قالوا فاعرض ‏.‏ فقال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة اعتدل قائما ورفع يديه حتى يحاذي بهما منكبيه فإذا أراد أن يركع رفع يديه حتى يحاذي بهما منكبيه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ وركع ثم اعتدل فلم يصوب رأسه ولم يقنع ووضع يديه على ركبتيه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ورفع يديه واعتدل حتى يرجع كل عظم في موضعه معتدلا ثم أهوى إلى الأرض ساجدا ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم جافى عضديه عن إبطيه وفتخ أصابع رجليه ثم ثنى رجله اليسرى وقعد عليها ثم اعتدل حتى يرجع كل عظم في موضعه معتدلا ثم أهوى ساجدا ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم ثنى رجله وقعد واعتدل حتى يرجع كل عظم في موضعه ثم نهض ثم صنع في الركعة الثانية مثل ذلك حتى إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ثم صنع كذلك حتى كانت الركعة التي تنقضي فيها صلاته أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال ومعنى قوله ورفع يديه إذا قام من السجدتين يعني قام من الركعتين ‏.‏",
      "text_en": " Muhammad bin Amr bin Ata' narrated from Abu Humaid As-Saidi, :                     he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi - 'I am the most knowledgeable among you of the Salat of the Allah's Messenger.' They said: 'You did not precede us in his companionship, nor were you in his company more than us.' He said: 'Even still.\" They said: 'Go ahead.' So he said: 'When Allah's Messenger stood for Salat he would stand with his back straight and raise his hands until they were at the level of his shoulder. Then he would say: (Allahu Akbar) \"Allah is Most Great\" and bow. Then he would straighten (his back) so that he would not lower his head, nor raise it, and he placed his hands on his knees. Then he said: (Sami Allahu liman hamidah) \"Allah listens to those who praise Him.\" And he raised his hands and stood up straight until all of his bones completely returned to their places. Then he went down to the ground prostrating, then he said: (Allahu Akbar) \"Allah is Most Great.\" Then he held his upper arms away from his midsection, and opened his toes on his feet (facing the Qiblah), then he bend his left foot and sat on it then straightened up until all of his bones completely returned to their placed, then he went down to prostrate. Then he said: (Allahu Akbar) \"Allah is Most Great,\" then he bent his foot and sat and straightened up until all of his bones completely returned to their places. Then he got up. Then in the second Rak'ah he did the same as that, such that when he stood from the two prostrations, he sad the Takbir and raised his hands until they were at the level of his shoulders as he did when he opened the Salat. Then he did like that until it was the Rak'ah in which his Salat was to end, when he moved his left foot over and sat on his side (in the Mutawarrik postion). Then he said the Taslim.'\"",
      "chain": [
        "30160",
        "30170",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، والحسن بن علي الخلال الحلواني، وسلمة بن شبيب، وغير، واحد، قالوا حدثنا أبو عاصم النبيل، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب النبي صلى الله عليه وسلم منهم أبو قتادة بن ربعي فذكر نحو حديث يحيى بن سعيد بمعناه وزاد فيه أبو عاصم عن عبد الحميد بن جعفر هذا الحرف قالوا صدقت هكذا صلى النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى زاد أبو عاصم الضحاك بن مخلد في هذا الحديث عن عبد الحميد بن جعفر هذا الحرف قالوا صدقت هكذا صلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " (Another chain) that Muhammad bin Amir bin Ata narrated from Abu Humaid As-Saidi,:                     he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi.\"",
      "chain": [
        "30160",
        "30",
        "30417",
        "20241",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أبي بكر وعمر وعلي وعبد الله بن عمرو وأنس وابن عباس وعائشة وأم حبيبة وأبي ذر وعمرو بن عبسة وواثلة بن الأسقع وأبي هريرة وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث عثمان حديث حسن صحيح ‏.‏ ومحمود بن لبيد قد أدرك النبي صلى الله عليه وسلم ومحمود بن الربيع قد رأى النبي صلى الله عليه وسلم وهما غلامان صغيران مدنيان ‏.‏",
      "text_en": " Uthman bin Affan narrated that :                     he heard Allah's Messenger say: \"Whoever builds a Masjid for (the sake of) Allah, then Allah will build a similar house for him in Paradise.\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء أبو كريب، وسفيان بن وكيع، قالا حدثنا أبو أسامة، عن عبد الحميد بن جعفر، قال حدثنا أبو الأبرد، مولى بني خطمة أنه سمع أسيد بن ظهير الأنصاري، وكان، من أصحاب النبي صلى الله عليه وسلم يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ الصلاة في مسجد قباء كعمرة ‏\"‏ ‏.‏ قال وفي الباب عن سهل بن حنيف ‏.‏ قال أبو عيسى حديث أسيد حديث حسن غريب ‏.‏ ولا نعرف لأسيد بن ظهير شيئا يصح غير هذا الحديث ولا نعرفه إلا من حديث أبي أسامة عن عبد الحميد بن جعفر ‏.‏ وأبو الأبرد اسمه زياد مديني ‏.‏",
      "text_en": " Abu Al-Abrad the freed slave of Banu Khatmah narrated that he heard Usaid bin Zuhair Al-Ansari - and he was one of the Companions of the Prophet - narrated that :                     the Prophet said: \"The Salat in Masjid Quba is like Umrah.\"",
      "chain": [
        "30216",
        "35047",
        "20318",
        "11875",
        "1988"
      ]
    },
    {
      "hadith_no": "1127",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله اليزني أبي الخير، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشروط أن يوفى بها ما استحللتم به الفروج ‏\"‏ ‏.‏ حدثنا أبو موسى، محمد بن المثنى حدثنا يحيى بن سعيد، عن عبد الحميد بن جعفر، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب قال إذا تزوج رجل امرأة وشرط لها أن لا يخرجها من مصرها فليس له أن يخرجها ‏.‏ وهو قول بعض أهل العلم وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وروي عن علي بن أبي طالب أنه قال شرط الله قبل شرطها ‏.‏ كأنه رأى للزوج أن يخرجها وإن كانت اشترطت على زوجها أن لا يخرجها ‏.‏ وذهب بعض أهل العلم إلى هذا وهو قول سفيان الثوري وبعض أهل الكوفة ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhani narrated that:                     The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"",
      "chain": [
        "30401",
        "20032",
        "11875",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن بكر، حدثنا عبد الحميد بن جعفر، حدثني عتبة بن عبد الله، عن أسماء بنت عميس، أن رسول الله صلى الله عليه وسلم سألها ‏\"‏ بم تستمشين ‏\"‏ ‏.‏ قالت بالشبرم ‏.‏ قال ‏\"‏ حار جار ‏\"‏ ‏.‏ قالت ثم استمشيت بالسنا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو أن شيئا كان فيه شفاء من الموت لكان في السنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ يعني دواء المشى ‏.‏",
      "text_en": " Asma' bint 'Umais narrated that the Messenger of Allah (S.A.W) asked her what they used as a laxative. She said:                     \"Shubrum\" He said: \"It is hot and too strong.\" She said:\"Then I used Senna as a laxative.\" So the Prophet (S.A.W): \"If there was anything that would have a cure for death in it, then it would have been Senna.\"",
      "chain": [
        "30160",
        "20277",
        "11875",
        "20342",
        "69"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا أبو بكر الحنفي، عن عبد الحميد بن جعفر، عن عمر بن الحكم، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يذهب الليل والنهار حتى يملك رجل من الموالي يقال له جهجاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"The night and the day shall not go away until a man called Jahjah among the Mawali reigns.\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "3116",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا الحسن بن علي الخلال الحلواني، حدثنا أبو أسامة، حدثنا عبد الحميد بن جعفر، عن سعيد المقبري، عن عطاء، مولى أبي أحمد عن أبي هريرة، قال بعث رسول الله صلى الله عليه وسلم بعثا وهم ذو عدد فاستقرأهم فاستقرأ كل رجل منهم ما معه من القرآن فأتى على رجل منهم من أحدثهم سنا فقال ‏\"‏ ما معك يا فلان ‏\"‏ ‏.‏ قال معي كذا وكذا وسورة البقرة ‏.‏ قال ‏\"‏ أمعك سورة البقرة ‏\"‏ ‏.‏ فقال نعم ‏.‏ قال ‏\"‏ فاذهب فأنت أميرهم ‏\"‏ ‏.‏ فقال رجل من أشرافهم والله يا رسول الله ما منعني أن أتعلم سورة البقرة إلا خشية ألا أقوم بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تعلموا القرآن فاقرءوه وأقرئوه فإن مثل القرآن لمن تعلمه فقرأه وقام به كمثل جراب محشو مسكا يفوح بريحه كل مكان ومثل من تعلمه فيرقد وهو في جوفه كمثل جراب وكئ على مسك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) sent an expedition force [comprised] of many, and he asked each what he could recite, so each one of them mentioned what he could recite - meaning what he had memorized of the Qur'an. He came to one of the youngest men among them and said: 'What have you memorized O so-and-so?' He said: 'I memorized this and that and Surat Al-Baqarah.' He said: 'You memorized Surat Al-Baqarah?' He said: \"Yes.' He said: \"Then go, for you are their commander.' A man among their chief said: 'By Allah [O Messenger of Allah]! Nothing prevented me from learning Surat Al-Baqarah except fearing that I would not be able to stand with (in voluntary night prayer).' The Messenger of Allah (ﷺ) said: 'Learn the Qur'an to recite it, for indeed the parable of the Qur'an for the one who recites it and stands with it (in prayer) is that of a bag full of musk whose scent fills the air all around. And the parable of the one who learns it then sleeps while it is in his memory is that of a bag containing musk that is tied shut.'\"",
      "chain": [
        "30115",
        "20318",
        "11875",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3416",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما أنزل الله في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     that the Messenger of Allah (ﷺ) said: \"Allah has not revealed the likes of Umm Al-Kitab in the Tawrah, nor the Injil. It is the seven oft-repeated, and (Allah said) 'It is divided between Myself and My slave, and My slave shall have what he asks for.'\"",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "hadith_no": "3448",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، وغير، واحد، قالوا حدثنا محمد بن بكر البرساني، عن عبد الحميد بن جعفر، أخبرني أبي، عن ابن ميناء، عن أبي سعد بن أبي فضالة الأنصاري، وكان، من الصحابة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا جمع الله الناس ليوم القيامة ليوم لا ريب فيه نادى مناد من كان أشرك في عمل عمله لله أحدا فليطلب ثوابه من عند غير الله فإن الله أغنى الشركاء عن الشرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن بكر ‏.‏",
      "text_en": " Narrated 'Abdul-Hamid bin Ja'far:                     \"My father informed me, from Ibn Mina, from ABu Sa'eed bin Abi Fadalah Al-Ansari - and he was one of the Companions - who said: 'I heard the Messenger of Allah (ﷺ) said: \"When Allah gathers the people on the Day of Judgement - a Day in which there is no doubt in - a caller will call out: 'Whoever committed Shirk in any of his deeds he did for Allah - then let him seek his reward from other than Allah. For indeed Allah is the most free of the partners from any need of Shirk.\"",
      "chain": [
        "30160",
        "20277",
        "11875",
        "11833",
        "5350"
      ]
    },
    {
      "hadith_no": "914",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنزل الله عز وجل في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah (ﷺ) said: 'Allah, the Mighty and Sublime, did not reveal in the Tawrah or the Injil anything like Umm Al-Quran (Al-Fatihah), which is the seven oft-recited, and (Allah said) it is divided between Myself and My slave will have what he asked for.'\"",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "hadith_no": "1039",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا ركع اعتدل فلم ينصب رأسه ولم يقنعه ووضع يديه على ركبتيه ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"When the Prophet (ﷺ) bowed he was balanced, he did not make his head higher or lower than his back, and he put his hands on his knees.\"",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1101",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا أهوى إلى الأرض ساجدا جافى عضديه عن إبطيه وفتخ أصابع رجليه ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"When the Prophet (ﷺ) fell to the ground during prostration, he held his arms away from his sides and bent his toes.\"",
      "chain": [
        "30160",
        "20031",
        "11875",
        "1457"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته يحدث، قال كان النبي صلى الله عليه وسلم إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that:                     When the Prophet (ﷺ) stood up following two prostrations, he would say the takbir and raise his hands until they were level with his shoulders, as he had done at the beginning of the prayer.",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، بندار - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا كان في الركعتين اللتين تنقضي فيهما الصلاة أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"At the end of the last two rak'ahs of the prayer, the Prophet (ﷺ) would move his left foot forward and sit on his left buttock, Mutawarrikan, then he would say the taslim.",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا عبد الرحمن بن الأسود البصري، قال حدثنا محمد بن ربيعة، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن عراك بن مالك، عن عبيد الله بن عبد الله، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام بمكة خمسة عشر يصلي ركعتين ركعتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Messenger of Allah (ﷺ) stayed in Makkah (for fifteen days), praying each prayer with two rak'ahs.",
      "chain": [
        "25262",
        "11875",
        "11411",
        "11204",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1592",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني وهب بن كيسان، قال اجتمع عيدان على عهد ابن الزبير فأخر الخروج حتى تعالى النهار ثم خرج فخطب فأطال الخطبة ثم نزل فصلى ولم يصل للناس يومئذ الجمعة ‏.‏ فذكر ذلك لابن عباس فقال أصاب السنة ‏.‏",
      "text_en": " Wahb bin Kaisan said:                     \"Eid and Jumu'ah fell on the same day during the time of Ibn Az-Zubair, so he delayed going out until the sun had risen quite high. Then he went out and delivered a Khutbah, and he made the Khutbah lengthy. Then he came down and prayed, and he did not lead the people in praying jumu'ah that day. Mention of that was made to Ibn 'Abbas and he said: 'He has followed the sunnah.'\"",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11231"
      ]
    },
    {
      "hadith_no": "2296",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن سليمان بن يسار، عن حمزة، قال سألت رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah said:                     \"I asked the Messenger of Allah about fasting while traveling. He said: 'If you wish to fast then fast, and if you wish not to fast then do not fast.\"'",
      "chain": [
        "38265",
        "20025",
        "11875",
        "10605",
        "11005"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو بكر، قال حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن سليمان بن يسار، عن حمزة بن عمرو، قال سألت رسول الله صلى الله عليه وسلم عن الصوم في السفر فقال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I asked the Messenger of Allah about fasting while traveling. He said: 'If you wish to fast then fast, and if you wish not to fast then do not fast.\"'",
      "chain": [
        "30160",
        "20436",
        "11875",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا محمد بن بكر، قال أنبأنا عبد الحميد بن جعفر، قال أخبرني عمران بن أبي أنس، عن أبي سلمة بن عبد الرحمن، عن حمزة بن عمرو، أنه سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr that:                     he asked the Messenger of Allah about fasting while traveling. He said: \"If you wish to fast then fast, and if you wish not to fast then do not fast.\"",
      "chain": [
        "30524",
        "20277",
        "11875",
        "10605",
        "10567",
        "4123"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال أنبأنا يحيى، عن عبد الحميد بن جعفر، قال حدثني صالح بن أبي عريب، عن كثير بن مرة الحضرمي، عن عوف بن مالك، قال خرج رسول الله صلى الله عليه وسلم وبيده عصا وقد علق رجل قنو حشف فجعل يطعن في ذلك القنو فقال ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب من هذا إن رب هذه الصدقة يأكل حشفا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that  'Awf bin Malik said:                     \"The Messenger of Allah came out with a stick in his hand, and a man had hung up a bunch of dry and bad dates. He started hitting that bunch of dates and said: 'I wish that the one who gave this Sadaqah had given something better than this, for the one who gave these dry, bad dates will eat dry, bad dates on the Day of Resurrection.\"'",
      "chain": [
        "20184",
        "20031",
        "11875",
        "18431",
        "19940",
        "10805"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من فرس عربي إلا يؤذن له عند كل سحر بدعوتين اللهم خولتني من خولتني من بني آدم وجعلتني له فاجعلني أحب أهله وماله إليه أو من أحب ماله وأهله إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said: 'There is no Arabian horse but it is allowed to offer two supplications every Sahar (end of the night): O Allah, You have caused me to be owned by whoever You wanted among the sons of Adam, and you have made me belong to him. Make me the dearest of his family and wealth to him, or among the dearest of his family and wealth to him.'\"",
      "chain": [
        "30153",
        "20031",
        "11875",
        "11411",
        "16165",
        "398",
        "23"
      ]
    },
    {
      "hadith_no": "3886",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا محمد بن يزيد بن إبراهيم، قال حدثنا عبد الله بن حمران، قال حدثنا عبد الحميد بن جعفر، عن الأسود بن العلاء، عن أبي سلمة، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة‏.‏‏ رواه القاسم بن محمد عن رافع بن خديج‏.‏‏",
      "text_en": " It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.",
      "chain": [
        "34204",
        "20554",
        "11875",
        "10567",
        "1986"
      ]
    },
    {
      "hadith_no": "222",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عمرو بن عبد الله الأودي، حدثنا أبو أسامة، عن عبد الحميد بن جعفر، عن المقبري، عن عطاء، مولى أبي أحمد عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تعلموا القرآن واقرءوه وارقدوا فإن مثل القرآن ومن تعلمه فقام به كمثل جراب محشو مسكا يفوح ريحه كل مكان ومثل من تعلمه فرقد وهو في جوفه كمثل جراب أوكي على مسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Learn the Qur'an, recite it and go to bed, for the likeness of the Qur'an and the one who learns it and acts upon it is that of a sack filled with musk, which spreads its fragrance everywhere. And the likeness of one who learns it then goes to bed with it in his heart is that of a sack that is tied up from which no fragrance comes out.'\"",
      "chain": [
        "20318",
        "11875",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "736",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah say: 'Whoever builds a mosque for the sake of Allah, Allah will build something similar for him in Paradise.'\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد الطنافسي، حدثنا أبو أسامة، حدثني عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، يقول كان رسول الله  صلى الله عليه وسلم  إذا قام إلى الصلاة استقبل القبلة ورفع يديه وقال ‏\"‏ الله أكبر ‏\"‏ ‏.‏",
      "text_en": " Muhammadbin ‘Amr bin ‘Ata’ said:                      “I heard Abu Humaid As-Sa’idi say:‘When the Messenger of Allah (ﷺ) stood up for prayer, he wouldfacethe prayer direction, raise his hands, and say: “Allahu Akbar(Allahis Most Great).”",
      "chain": [
        "38409",
        "20318",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "911",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته وهو، في عشرة من أصحاب رسول الله  صلى الله عليه وسلم  أحدهم أبو قتادة بن ربعي قال أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  كان إذا قام في الصلاة اعتدل قائما ورفع يديه حتى يحاذي بهما منكبيه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ وإذا أراد أن يركع رفع يديه حتى يحاذي بهما منكبيه فإذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ رفع يديه فاعتدل فإذا قام من الثنتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It wasnarrated that Muhammad bin ‘Amr bin ‘Ata’ said, concerning AbuHumaid As-Sa’di:                      “I heard him when he was among ten of theCompanionsof the Messenger of Allah (ﷺ), one of whom was AbuQatadah binRib’i, saying: ‘I am the most knowledgeable of youabout the Messengerof Allah (ﷺ). When he stood up for prayer, hestood up straight andraised his hands until they were parallel tohis shoulders, then hesaid: Allahu Akbar. When he wanted to bow inRuku’, he raised hishands until they were parallel to hisshoulders. When he said Sami’Allahu liman hamidah (Allah hearsthose who praise Him), he raised hishands and stood up straight.When he stood up after two Rak’ah, hesaid Allahu Akbar and raisedhis hands until they were parallel to hisshoulders, as he did whenhe started the prayer.’”",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1114",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله  صلى الله عليه وسلم  فيهم أبو قتادة فقال أبو حميد أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  ‏.‏ قالوا لم فوالله ما كنت بأكثرنا له تبعة ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله  صلى الله عليه وسلم  إذا قام إلى الصلاة كبر ثم رفع يديه حتى يحاذي بهما منكبيه ويقر كل عضو منه في موضعه ثم يقرأ ثم يكبر ويرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه معتمدا لا يصب رأسه ولا يقنع معتدلا ثم يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ويرفع يديه حتى يحاذي بهما منكبيه حتى يقر كل عظم إلى موضعه ثم يهوي إلى الأرض ويجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتخ أصابع رجليه إذا سجد ثم يسجد ثم يكبر ويجلس على رجله اليسرى حتى يرجع كل عظم منه إلى موضعه ثم يقوم فيصنع في الركعة الأخرى مثل ذلك ثم إذا قام من الركعتين رفع يديه حتى يحاذي بهما منكبيه كما صنع عند افتتاح الصلاة ثم يصلي بقية صلاته هكذا حتى إذا كانت السجدة التي ينقضي فيها التسليم أخر إحدى رجليه وجلس على شقه الأيسر متوركا ‏.‏ قالوا صدقت هكذا كان يصلي رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Muhammadbin ‘Amr bin ‘Ata’ said:                      ‘While he was among ten of theCompanions of the Messenger of Allah (ﷺ) including Abu Qatadah: “Iheard Abu Humaid As-Sa’idi say: ‘I am the most knowledgeable ofyouconcerning the prayer of the Messenger of Allah (ﷺ).’ Theysaid:‘Why? By Allah, you did not follow him more than we did, andyou didnot accompany him for longer.’ He said: ‘Yes I am.’They said: ‘Showus.’ He said: ‘When the Messenger of Allah(ﷺ) stood up for prayer,he would say the Takbir, then he wouldraise his hands parallel to hisshoulders, and every part of his bodywould settle in place. Then hewould recite, then he would raise hishands parallel to his shouldersand bow, placing his palms on hisknees and supporting his weight onthem. He neither lowered his head,nor raised it up, it was evenlybalanced (between either extreme).Then he would say: “Sami’ Allahuliman hamidah (Allah hears thosewho praise Him); and he would raisehis hands parallel with hisshoulders, until every bone returned toits place. Then he wouldprostrate himself on the ground, keeping hisarms away from hissides. Then he would raise his head and tuck hisleft foot under himand sit on it, and he would spread his toes whenhe prostrated.* Thenhe would prostrate, then say the Takbir and siton his left foot,until every bone returned to its place. Then hewould stand up and dothe same in the next Rak’ah. Then when he stoodup after twoRak’ah, he would raise his hands level with his shouldersas he didat the beginning of the prayer. Then he would offer the restof hisprayer in like manner until, when he did the prostration aftertheTaslim comes, he would push one of his feet back and sit and hisweight on his left side, Mutawarrikan.’** They said: ‘You havespokenthe truth; this is how the Messenger of Allah (ﷺ) used toperformthe prayer.’”***",
      "chain": [
        "30160",
        "20241",
        "11875",
        "11220"
      ]
    },
    {
      "hadith_no": "1149",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شيخ، لنا عن عبد الحميد بن جعفر، عن محمد بن يحيى بن حبان، عن يوسف بن عبد الله بن سلام، عن أبيه، قال خطبنا النبي  صلى الله عليه وسلم  ‏.‏ فذكر ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "11875",
        "11222",
        "5335",
        "103"
      ]
    },
    {
      "hadith_no": "1476",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عبد الحميد بن جعفر، حدثنا أبو الأبرد، مولى بني خطمة أنه سمع أسيد بن ظهير الأنصاري، وكان، من أصحاب النبي  صلى الله عليه وسلم  يحدث عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ صلاة في مسجد قباء كعمرة ‏\"‏ ‏.‏",
      "text_en": " Abul-Abrad, the freed slave of Banu Khatmah, said that he heard Usaidbin Zuhair Ansari who was one of the Companions of the Prophet (ﷺ)narrating that the Prophet (ﷺ) said:                      “One prayer in the Quba’Mosqueis like ‘Umrah.”",
      "chain": [
        "30201",
        "20318",
        "11875",
        "1988"
      ]
    },
    {
      "hadith_no": "1496",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، قالا حدثنا عبد الحميد بن جعفر، عن أبيه، عن تميم بن محمود، عن عبد الرحمن بن شبل، قال نهى رسول الله  صلى الله عليه وسلم  عن ثلاث عن نقرة الغراب وعن فرشة السبع وأن يوطن الرجل المكان الذي يصلي فيه كما يوطن البعير ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Shibl said:                      “The Messenger ofAllah (ﷺ) forbade three things: Pecking like a crow, spreading (theforearms) like a beast of prey, and a man having a place in themosquein which he usually offers the prayer, like a camel has aplace towhich it usually goes.”",
      "chain": [
        "30201",
        "20032",
        "34043",
        "11062",
        "11875",
        "11833",
        "18098",
        "6792"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف ومحمد بن بشار قالا حدثنا يحيى بن سعيد، حدثنا عبد الحميد بن جعفر، عن أبيه، عن حكيم بن أفلح، عن أبي مسعود، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ للمسلم على المسلم أربع خلال يشمته إذا عطس ويجيبه إذا دعاه ويشهده إذا مات ويعوده إذا مرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Mas’ud that the Prophet (ﷺ) said:                      “TheMuslimhas four things due from the Muslim: He should answer [bysayingYarhamuk-Allah (may Allah have mercy on you)] to him if hesneezes(and says Al-Hamdulillah); he should accept his invitation ifheinvites him; he should attend his funeral if he dies; and he shouldvisit him if he falls sick.”",
      "chain": [
        "20031",
        "11875",
        "11833",
        "402"
      ]
    },
    {
      "hadith_no": "1893",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة الحضرمي، عن عوف بن مالك الأشجعي، قال خرج رسول الله  صلى الله عليه وسلم  وقد علق رجل قناء أو قنوا وبيده عصا فجعل يطعن بذلك يدقدق في ذلك القنو ويقول ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Awf bin Malik Al-Ashja'i said: “The Messenger of Allah went out, and a man had hung up one or more bunches of dates. He (the Prophet) had a stick in his hand and he started hitting that bunch of dates repeatedly, saying: 'If the owner of these dates wanted to give in charity, he should have given something better than these. The owner of this charity will eat rotten and shriveled dates on the Day of Resurrection.' ”",
      "chain": [
        "34043",
        "20031",
        "11875",
        "18431",
        "19940",
        "3051"
      ]
    },
    {
      "hadith_no": "2030",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عمرو بن عبد الله، ومحمد بن إسماعيل، قالا حدثنا أبو أسامة، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله، عن عقبة بن عامر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir:                     that the Prophet said: “The conditions most deserving to be fulfilled are those by means of which the private parts become permissible for you.”",
      "chain": [
        "34188",
        "20318",
        "11875",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عبد الحميد بن جعفر، عن زرعة بن عبد الرحمن، عن مولى، لمعمر التيمي عن معمر التيمي، عن أسماء بنت عميس، قالت قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ بماذا كنت تستمشين ‏\"‏ ‏.‏ قلت بالشبرم قال ‏\"‏ حار جار ‏\"‏ ‏.‏ ثم استمشيت بالسنى ‏.‏ فقال ‏\"‏ لو كان شىء يشفي من الموت كان السنى والسنى شفاء من الموت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint ‘Umais said:                      “The Messenger of Allah(ﷺ) said to me: ‘What do you use as a laxative?’ I said: ‘TheShubrum (spurge – Euphorb).’ He said: (It is) hot and powerful.’ThenI used senna as a laxative and he said: ‘If anything were tocuredeath, it would be senna. Senna is a cure for death.’”",
      "chain": [
        "30201",
        "20318",
        "11875",
        "69"
      ]
    }
  ],
  "total_hadiths": 60
}