{
  "id": "11897",
  "name": "'Umar bin al-Hakam bin Thuban عمر بن الحكم بن ثوبان",
  "full_name": "'Umar bin al-Hakam bin Thuban عمر بن الحكم بن ثوبان",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "117",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Madni",
      "Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5133",
      "name": "'Abdullah bin Anmh ( عبد الله بن عنمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "390",
      "name": "Ka'b bin Malik bin Abi Ka'b ( كعب بن مالك بن أبى كعب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22152",
      "name": "'Umar bin Ishaq bin 'Abdullah عمر بن إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7236",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "وقال محمد بن بشار حدثنا عبد الله بن حمران، حدثنا عبد الحميد، عن سعيد المقبري، عن عمر بن الحكم، عن أبي هريرة، قوله‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20554",
        "11703",
        "11168",
        "11897"
      ]
    },
    {
      "hadith_no": "3721",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني إبراهيم بن موسى الرازي، حدثنا عيسى، - يعني ابن يونس - حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يفرك مؤمن مؤمنة إن كره منها خلقا رضي منها آخر ‏\"‏ ‏.‏ أو قال ‏\"‏ غيره ‏\"‏ ‏.‏",
      "text_en": " Ab Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A believing man should not hate a believing woman; if he dislikes one of her characteristics, he will be pleased with another.",
      "chain": [
        "30309",
        "20347",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "chain": [
        "30170",
        "20241",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "6973",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الله بن حمران، عن عبد الحميد بن جعفر، أخبرني  أبي جعفر، عن عمر بن الحكم، عن عبد الله بن عمرو بن العاص، عن النبي صلى الله عليه وسلم بمثل حديث هشام بن عروة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah b. Amr b. al-'As through another chain of transmitters.",
      "chain": [
        "30170",
        "20554",
        "11875",
        "11897",
        "29"
      ]
    },
    {
      "hadith_no": "7493",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا عبد الكبير بن عبد المجيد أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، قال سمعت عمر بن الحكم، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تذهب الأيام والليالي حتى يملك رجل يقال له الجهجاه ‏\"‏ ‏.‏ قال مسلم هم أربعة إخوة شريك وعبيد الله وعمير وعبد الكبير بنو عبد المجيد ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The day and the night would not come to an end before a man called al-Jahjah would occupy the throne.",
      "chain": [
        "30160",
        "11875",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "796",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، عن بكر، - يعني ابن مضر - عن ابن عجلان، عن سعيد المقبري، عن عمر بن الحكم، عن عبد الله بن عنمة المزني، عن عمار بن ياسر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الرجل لينصرف وما كتب له إلا عشر صلاته تسعها ثمنها سبعها سدسها خمسها ربعها ثلثها نصفها ‏\"‏ ‏.‏",
      "text_en": " ‘Ammar b. Yasir said:                      I heard the apostle of Allah (ﷺ) say: A man returns after saying his prayer while a tenth part of his prayer, or a ninth part, or an eight part, or a seventh part, or a sixth part, or a fifth part, or a third part, or half of it, is recorded for him.",
      "chain": [
        "30367",
        "20374",
        "10616",
        "11168",
        "11897",
        "5133",
        "25"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا أبو بكر الحنفي، عن عبد الحميد بن جعفر، عن عمر بن الحكم، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يذهب الليل والنهار حتى يملك رجل من الموالي يقال له جهجاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"The night and the day shall not go away until a man called Jahjah among the Mawali reigns.\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحارث بن أسد، قال حدثنا بشر بن بكر، قال حدثني الأوزاعي، قال حدثني يحيى بن أبي كثير، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكن يا عبد الله مثل فلان كان يقوم الليل فترك قيام الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah (ﷺ) said to me: 'O Abdullah do not be like so-and-so; he used to pray Qiyam Al-Lail and then he stopped.'\"",
      "chain": [
        "20413",
        "20024",
        "11449",
        "11897",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "2973",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا محمد بن عمرو، عن عمر بن الحكم بن ثوبان، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث علقمة بن مجزز على بعث وأنا فيهم فلما انتهى إلى رأس غزاته أو كان ببعض الطريق استأذنته طائفة من الجيش فأذن لهم وأمر عليهم عبد الله بن حذافة بن قيس السهمي فكنت فيمن غزا معه فلما كان ببعض الطريق أوقد القوم نارا ليصطلوا أو ليصنعوا عليها صنيعا فقال عبد الله - وكانت فيه دعابة - أليس لي عليكم السمع والطاعة قالوا بلى ‏.‏ قال فما أنا بآمركم بشىء إلا صنعتموه قالوا نعم ‏.‏ قال فإني أعزم عليكم إلا تواثبتم في هذه النار ‏.‏ فقام ناس فتحجزوا فلما ظن أنهم واثبون قال أمسكوا على أنفسكم فإنما كنت أمزح معكم ‏.‏ فلما قدمنا ذكروا ذلك للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أمركم منهم بمعصية الله فلا تطيعوه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) sent ‘Alqamah bin Mujazziz at the head of a detachment, and Iwas among them. When he reached the battle site, or when he waspartway there, a group of the army asked permission to take adifferent route, and he gave them permission, and appointed ‘Abdullahbin Hudhafah bin Qais As-Sahmi as their leader, and I was one ofthosewho fought alongside with him. When we were partway there, thepeoplelit a fire to warm themselves and cook some food. ‘Abdullah,who was aman who liked to joke, said:                      “Do I not have the rightthat you shouldlisten to me and obey?” They said: “Yes.” Hesaid: “And if I commandyou to do something, will you not do it?”They said: “Of course.” Hesaid: “Then I command you to jumpinto this fire.” Some people got upand got ready to jump, and whenhe saw that they were about to jump,he said: “Restrain yourselves,for I was joking with you.” When wecame to Al-Madinah, theymentioned that to the Prophet (ﷺ), and theMessenger of Allah (ﷺ)said: “Whoever among you commands you to dosomething that involvesdisobedience to Allah, do not obey him.”",
      "chain": [
        "30201",
        "20472",
        "11220",
        "11897",
        "38"
      ]
    }
  ],
  "total_hadiths": 9
}