{
  "id": "11894",
  "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
  "full_name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  4  -  لا بأس به ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Mazin B.al-Najjar",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "6405",
      "name": "Ghazya bin al-Harith al-Ansari al-Mazni ( غزية بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11697",
      "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11428",
      "name": "Sami Maula Abi Bakr bin 'Abdur Rahman سمي مولى أبي بكر بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24066",
      "name": "Habib bin Abi Habib حبيب بن أبي حبيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11101",
      "name": "Sharhbayl bin Sa'd شرحبيل بن سعد أبو سعد الخطمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11232",
      "name": "Yahya bin 'Ammara يحيى بن عمارة بن أبي حسن الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11167",
      "name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11879",
      "name": "'Abdur Rahman bin Abi Sa'id al-Khudri عبد الرحمن بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11847",
      "name": "al-Rabi' bin Sbrh bin الربيع بن سبرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20379",
      "name": "Yahya bin Ayoub al-Ghafiqi يحيى بن أيوب الغافقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20702",
      "name": "'Abdur Rahman bin Abi Rajal عبد الرحمن بن أبي الرجال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20341",
      "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "246",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء والقاسم بن زكرياء بن دينار وعبد بن حميد قالوا حدثنا خالد بن مخلد، عن سليمان بن بلال، حدثني عمارة بن غزية الأنصاري، عن نعيم بن عبد الله المجمر، قال رأيت أبا هريرة يتوضأ فغسل وجهه فأسبغ الوضوء ثم غسل يده اليمنى حتى أشرع في العضد ثم يده اليسرى حتى أشرع في العضد ثم مسح رأسه ثم غسل رجله اليمنى حتى أشرع في الساق ثم غسل رجله اليسرى حتى أشرع في الساق ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يتوضأ ‏.‏ وقال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنتم الغر المحجلون يوم القيامة من إسباغ الوضوء فمن استطاع منكم فليطل غرته وتحجيله ‏\"‏ ‏.‏",
      "text_en": " Nu'aim b. 'Abdullah al-Mujmir reported:                      I saw Abu Huraira perform ablution. He washed his face and washed it well. He then washed his right hand including a portion of his arm. He then washed his left hand including a portion of his arm. He then wiped his head. He then washed his right foot including his shank, and then washed his left foot including shank, and then said: This is how I saw Allah's Messenger (may peace be upon him) perform his ablution. And (Abu Huraira) added that the Messenger of Allah (may peace be upon him) had observed: You shall have your faces hands and feet bright on the Day of Resurrection because of your perfect ablution. He who can afford among you, let him increase the brightness of his forehead and that of hands and legs.",
      "chain": [
        "30463",
        "20160",
        "11894",
        "11225"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا أبو جعفر، محمد بن جهضم الثقفي حدثنا إسماعيل بن جعفر، عن عمارة بن غزية، عن خبيب بن عبد الرحمن بن إساف، عن حفص بن عاصم بن عمر بن الخطاب، عن أبيه، عن جده، عمر بن الخطاب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قال المؤذن الله أكبر الله أكبر ‏.‏ فقال أحدكم الله أكبر الله أكبر ‏.‏ ثم قال أشهد أن لا إله إلا الله ‏.‏ قال أشهد أن لا إله إلا الله ثم قال أشهد أن محمدا رسول الله ‏.‏ قال أشهد أن محمدا رسول الله ‏.‏ ثم قال حى على الصلاة ‏.‏ قال لا حول ولا قوة إلا بالله ‏.‏ ثم قال حى على الفلاح ‏.‏ قال لا حول ولا قوة إلا بالله ‏.‏ ثم قال الله أكبر الله أكبر ‏.‏ قال الله أكبر الله أكبر ‏.‏ ثم قال لا إله إلا الله ‏.‏ قال لا إله إلا الله ‏.‏ من قلبه دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. al-Khattab reported:                      The Messenger of Allah (may peace be upon him) said: When the Mu'adhdhin says: Allah is the Greatest, Allah is the Greatest, and one of you should make this response: Allah is the Greatest, Allah is the Greatest; (and when the Mu'adhdhin) says: I testify that there is no god but Allah, one should respond: I testify that there is no god but Allah, and when he says: I testify that Muhammad is the Messenger of Allah, one should make a response: I testify that Muhammad is Allah's Messenger. When he (the Mu'adhdhin) says: Come to prayer, one should make a response: There is no might and no power except with Allah. When he (the Mu'adhdhin) says: Come to salvation, one should respond: There is no might and no power except with Allah, and when he (the Mu'adhdhin) says: Allah is the Greatest, Allah is the Greatest, then make a response: Allah is the Greatest, Allah is the Greatest. When he (the Mu'adhdhin) says: There is no god but Allah, and he who makes a re- sponse from the heart: There is no god but Allah, he will enter Paradise.",
      "chain": [
        "30313",
        "20155",
        "11894",
        "11420",
        "563",
        "3"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا هارون بن معروف، وعمرو بن سواد، قالا حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن عمارة بن غزية، عن سمى، مولى أبي بكر أنه سمع أبا صالح، ذكوان يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: The nearest a servant comes to his Lord is when he is prostrating himself, so make supplication (in this state).",
      "chain": [
        "30280",
        "30443",
        "20029",
        "20377",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا أخبرنا ابن وهب، أخبرني يحيى بن أيوب، عن عمارة بن غزية، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول في سجوده ‏\"‏ اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره وعلانيته وسره ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) used to say while prostrating himself: O Lord, forgive me all my sins, small and great, first and last, open and secret.",
      "chain": [
        "20029",
        "20379",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) by Abu Usaid.",
      "chain": [
        "30128",
        "20212",
        "11894",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو كامل الجحدري، فضيل بن حسين وعثمان بن أبي شيبة كلاهما عن بشر، - قال أبو كامل حدثنا بشر بن المفضل، - حدثنا عمارة بن غزية، حدثنا يحيى، بن عمارة قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "chain": [
        "30559",
        "20212",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2177",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى العنزي، حدثنا محمد بن جهضم، حدثنا إسماعيل، - وهو ابن جعفر - عن عمارة، - يعني ابن غزية - عن سعيد بن الحارث بن المعلى، عن عبد الله بن عمر، أنه قال كنا جلوسا مع رسول الله صلى الله عليه وسلم إذ جاءه رجل من الأنصار فسلم عليه ثم أدبر الأنصاري فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أخا الأنصار كيف أخي سعد بن عبادة ‏\"‏ ‏.‏ فقال صالح ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعوده منكم ‏\"‏ ‏.‏ فقام وقمنا معه ونحن بضعة عشر ما علينا نعال ولا خفاف ولا قلانس ولا قمص نمشي في تلك السباخ حتى جئناه فاستأخر قومه من حوله حتى دنا رسول الله صلى الله عليه وسلم وأصحابه الذين معه ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported:                      While we were sitting with the Messenger of Allah (may peace be upon him), a person, one of the Ansar, came to him and greeted him. The Ansari then turned back. Upon this the Messenger of Allah (may peace be upon him) said: o brother of Ansar, how is my brother Sa'd be 'Ubada? He said: He is better. The Messenger of Allah (may peace be upon him) said: Who amongst you would visit him? He (the Holy Prophet) stood up and we also got up along with him, and we were more than ten persons. We had neither shoes with us, nor socks, nor caps, nor shirts. We walked on the barren land till we came to him. The people around him kept away till the Messenger of Allah (may peace be upon him) and his Companions with him came near him (Sa'd b. 'Ubada).",
      "chain": [
        "30170",
        "30162",
        "20155",
        "11894",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "2313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو كامل، فضيل بن حسين الجحدري حدثنا بشر، - يعني ابن مفضل - حدثنا عمارة بن غزية، عن يحيى بن عمارة، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أوسق صدقة وليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Sadaqa (zakat) is payable on less than five wasqs of (dates or grains), on less than five camel-heads, and on less than five uqiyas (of silver).",
      "chain": [
        "30559",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2828",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن عبد الأعلى، حدثنا المعتمر، حدثنا عمارة بن غزية الأنصاري، قال سمعت محمد بن إبراهيم، يحدث عن أبي سلمة، عن أبي سعيد الخدري، - رضى الله عنه - قال إن رسول الله صلى الله عليه وسلم اعتكف العشر الأول من رمضان ثم اعتكف العشر الأوسط في قبة تركية على سدتها حصير - قال - فأخذ الحصير بيده فنحاها في ناحية القبة ثم أطلع رأسه فكلم الناس فدنوا منه فقال ‏\"‏ إني اعتكفت العشر الأول ألتمس هذه الليلة ثم اعتكفت العشر الأوسط ثم أتيت فقيل لي إنها في العشر الأواخر فمن أحب منكم أن يعتكف فليعتكف ‏\"‏ ‏.‏ فاعتكف الناس معه قال ‏\"‏ وإني أريتها ليلة وتر وأني أسجد صبيحتها في طين وماء ‏\"‏ ‏.‏ فأصبح من ليلة إحدى وعشرين وقد قام إلى الصبح فمطرت السماء فوكف المسجد فأبصرت الطين والماء فخرج حين فرغ من صلاة الصبح وجبينه وروثة أنفه فيهما الطين والماء وإذا هي ليلة إحدى وعشرين من العشر الأواخر ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) observed i'tikaf (confined himself for devotion and prayer) in the first ten (days) of Ramadan; he then observed i'tikaf in the middle ten (days) in a Turkish tent with a mat hanging at its door. He (the Holy Prophet) took hold of that mat and placed it in the nook of the tent. He then put his head out and talked with people and they came near him, and he (the Holy Prophet) said:                      I observed i'tikaf in the first ten (nights and days) in order to seek that night (Lailat-ul-Qadr). I then observed i'tikaf in the middle ten days. Then (an angel) was sent to me and I was told that this (night) is among the last ten (nights). He who among you likes to observe i'tikaf should do so; and the people observed it along with him, and he (the Holy Prophet) said: That (Lailat-ul-Qadr) was shown to me on an odd (night) and I (saw in the dream) that I was prostrating in the morning in clay and water. So in the morning of the twenty-first night when he (the Holy Prophet) got up for dawn (prayer). there was a rainfall and the mosque dripped, and I saw clay and water. When he came out after completing the morning prayer (I saw) that his forehead and the tip of his nose had (traces) of clay and water, and that was the twenty-first night among the last ten (nights).",
      "chain": [
        "30449",
        "20288",
        "11894",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين الجحدري حدثنا بشر، - يعني ابن مفضل - حدثنا عمارة بن غزية، عن الربيع بن سبرة، أن أباه، غزا مع رسول الله صلى الله عليه وسلم فتح مكة قال فأقمنا بها خمس عشرة - ثلاثين بين ليلة ويوم - فأذن لنا رسول الله صلى الله عليه وسلم في متعة النساء فخرجت أنا ورجل من قومي ولي عليه فضل في الجمال وهو قريب من الدمامة مع كل واحد منا برد فبردي خلق وأما برد ابن عمي فبرد جديد غض حتى إذا كنا بأسفل مكة أو بأعلاها فتلقتنا فتاة مثل البكرة العنطنطة فقلنا هل لك أن يستمتع منك أحدنا قالت وماذا تبذلان فنشر كل واحد منا برده فجعلت تنظر إلى الرجلين ويراها صاحبي تنظر إلى عطفها فقال إن برد هذا خلق وبردي جديد غض ‏.‏ فتقول برد هذا لا بأس به ‏.‏ ثلاث مرار أو مرتين ثم استمتعت منها فلم أخرج حتى حرمها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Rabi' b. Sabra reported that his father went on an expedition with Allah's Messenger (may peace be upon him) during the Victory of Mecca, and we stayed there for fifteen days (i. e. for thirteen full days and a day and a night), and Allah's Messenger (may peace be upon him) permitted us to contract temporary marriage with women. So I and another person of my tribe went out, and I was more handsome than he, whereas he was almost ugly. Each one of us had a cloaks, My cloak was worn out, whereas the cloak of my cousin was quite new. As we reached the lower or the upper side of Mecca, we came across a young woman like a young smart long-necked she-camel. We said:                      Is it possible that one of us may contract temporary marriage with you? She said: What will you give me as a dower? Each one of us spread his cloak. She began to cast a glance on both the persons. My companion also looked at her when she was casting a glance at her side and he said: This cloak of his is worn out, whereas my cloak is quite new. She, however, said twice or thrice: There is no harm in (accepting) this cloak (the old one). So I contracted temporary marriage with her, and I did not come out (of this) until Allah's Messenger (may peace be upon him) declared it forbidden.",
      "chain": [
        "30559",
        "11894",
        "11847"
      ]
    },
    {
      "hadith_no": "3487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا أبو النعمان، حدثنا وهيب، حدثنا عمارة بن غزية، حدثني الربيع بن سبرة الجهني، عن أبيه، قال خرجنا مع رسول الله صلى الله عليه وسلم عام الفتح إلى مكة ‏.‏ فذكر بمثل حديث بشر ‏.‏ وزاد قالت وهل يصلح ذاك وفيه قال إن برد هذا خلق مح ‏.‏",
      "text_en": " Rabi' b. S'abra al-jahanni reported on the authority of his father. We went with Allah's Messenger (may peace be upon him) to Mecca during the year of Victory and he narrated like this a hadith transmitted by Bishr (the previous one) but with this addition:                     \" She said: Can it be possible?\" And it is also mentioned in it:\" He said: The cloak of this (man) is old and worn out.\"",
      "chain": [
        "30296",
        "20283",
        "20299",
        "11894",
        "11847"
      ]
    },
    {
      "hadith_no": "5335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن عمارة بن، غزية عن أبي الزبير، عن جابر، أن رجلا، قدم من جيشان - وجيشان من اليمن - فسأل النبي صلى الله عليه وسلم عن شراب يشربونه بأرضهم من الذرة يقال له المزر فقال النبي صلى الله عليه وسلم ‏\"‏ أومسكر هو ‏\"‏ ‏.‏ قال نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام إن على الله عز وجل عهدا لمن يشرب المسكر أن يسقيه من طينة الخبال ‏\"‏ ‏.‏ قالوا يا رسول الله وما طينة الخبال قال ‏\"‏ عرق أهل النار أو عصارة أهل النار ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that a person came from Jaishan, a town of Yemen, and he asked Allah's Apostle (may peace be upon him) about the wine which was drunk in their land and which was prepared from millet and was called Mizr. Allah's Messenger (may peace be upon him) asked whether that was intoxicating. He said:                      Yes. Thereupon Allah's Messenger (may peace be upon him) said: Every intoxicant is forbidden. Verily Allah the Exalted and Majestic, made a covenant to those who drank intoxicants to make their drink Tinat al-Khabal. They said: Allah's Messenger, what is Tinat a]-Khabal? He said: It is the sweat of the denizens of Hell or the discharge of the denizens of Hell.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة، بن عبد الرحمن عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اهجوا قريشا فإنه أشد عليها من رشق بالنبل ‏\"‏ ‏.‏ فأرسل إلى ابن رواحة فقال ‏\"‏ اهجهم ‏\"‏ ‏.‏ فهجاهم فلم يرض فأرسل إلى كعب بن مالك ثم أرسل إلى حسان بن ثابت فلما دخل عليه قال حسان قد آن لكم أن ترسلوا إلى هذا الأسد الضارب بذنبه ثم أدلع لسانه فجعل يحركه فقال والذي بعثك بالحق لأفرينهم بلساني فرى الأديم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تعجل فإن أبا بكر أعلم قريش بأنسابها - وإن لي فيهم نسبا - حتى يلخص لك نسبي ‏\"‏ ‏.‏ فأتاه حسان ثم رجع فقال يا رسول الله قد لخص لي نسبك والذي بعثك بالحق لأسلنك منهم كما تسل الشعرة من العجين ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم يقول لحسان ‏\"‏ إن روح القدس لا يزال يؤيدك ما نافحت عن الله ورسوله ‏\"‏ ‏.‏ وقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هجاهم حسان فشفى واشتفى ‏\"‏ ‏.‏ قال حسان هجوت محمدا فأجبت عنه وعند الله في ذاك الجزاء هجوت محمدا برا تقيا رسول الله شيمته الوفاء فإن أبي ووالده وعرضي لعرض محمد منكم وقاء ثكلت بنيتي إن لم تروها تثير النقع من كنفى كداء يبارين الأعنة مصعدات على أكتافها الأسل الظماء تظل جيادنا متمطرات تلطمهن بالخمر النساء فإن أعرضتمو عنا اعتمرنا وكان الفتح وانكشف الغطاء وإلا فاصبروا لضراب يوم يعز الله فيه من يشاء وقال الله قد أرسلت عبدا يقول الحق ليس به خفاء وقال الله قد يسرت جندا هم الأنصار عرضتها اللقاء لنا في كل يوم من معد سباب أو قتال أو هجاء فمن يهجو رسول الله منكم ويمدحه وينصره سواء وجبريل رسول الله فينا وروح القدس ليس له كفاء",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be uport him) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet) sent (someone) to Ibn Rawiha and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b b. Malik (to do the same, but what he composed did not appeal to the Holy Prophet). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said:                      Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger (may peace be upon him) said: Don't be hasty; (let) Abu Bakr who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is thesame as theirs. Hassan then came to him (Abu Bakr) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet) and said: Allah's Messenger, he (Abu Bakr) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha said: I heard Allah's Messenger (may peace be upon him) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger (may peace be upon him) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Apostle of Allah is among us, and the Holy Spirit who has no match.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "527",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثني محمد بن جهضم، حدثنا إسماعيل بن جعفر، عن عمارة بن غزية، عن خبيب بن عبد الرحمن بن إساف، عن حفص بن عاصم بن عمر، عن أبيه، عن جده، عمر بن الخطاب - رضي الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال المؤذن الله أكبر الله أكبر فقال أحدكم الله أكبر الله أكبر فإذا قال أشهد أن لا إله إلا الله ‏.‏ قال أشهد أن لا إله إلا الله ‏.‏ فإذا قال أشهد أن محمدا رسول الله قال أشهد أن محمدا رسول الله ثم قال حى على الصلاة قال لا حول ولا قوة إلا بالله ثم قال حى على الفلاح قال لا حول ولا قوة إلا بالله ثم قال الله أكبر الله أكبر قال الله أكبر الله أكبر ثم قال لا إله إلا الله قال لا إله إلا الله من قلبه دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " ‘Umar b. al-khattab reported the Messenger of Allah (May peace be upon him) as saying; When the MU’ADHDHIN says:                      “Allah is most great, Allah is most great”, and one of you says in response: “Allah is most great”, Allah is most great; then says: “ I testify tht there is no god but Allah”, and he says in response: “I testify that there is no god but Allah”, then say:” I testify that Muhammad is the Messenger of Allah”, and he makes the response: “ I testify that Muhammad is the Messenger of Allah”, then says: “Come to prayer”, and he makes the response: “There is no might and no power except in Allah”: then says: “ Allah is most great, Allah is most great”, and he makes the response: “Allah is most great”, then says: “There is no god but Allah”, if he says this from his heart, he enter Paradise.",
      "chain": [
        "30170",
        "30162",
        "20155",
        "11894",
        "11420",
        "563",
        "3"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، ومحمد بن سلمة، قالوا حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، مولى أبي بكر أنه سمع أبا صالح، ذكوان يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The nearest a servant come to his Lord is when he is prostrating himself, so make supplication often.",
      "chain": [
        "30226",
        "30485",
        "20672",
        "20029",
        "20377",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، ح حدثنا أحمد بن السرح، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، عن عمارة بن غزية، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان يقول في سجوده ‏\"‏ اللهم اغفر لي ذنبي كله دقه وجله وأوله وآخره ‏\"‏ ‏.‏ زاد ابن السرح ‏\"‏ علانيته وسره ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The prophet (ﷺ) used to say when prostrating himself: “O Allah. Forgive me all my sins, small and great, first and last. “ the narrator Ibn al-sarh added: “open and secret.”",
      "chain": [
        "30226",
        "20029",
        "20029",
        "20379",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1164",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن عمارة بن غزية، عن عباد بن تميم، أن عبد الله بن زيد، قال استسقى رسول الله صلى الله عليه وسلم وعليه خميصة له سوداء فأراد رسول الله صلى الله عليه وسلم أن يأخذ بأسفلها فيجعله أعلاها فلما ثقلت قلبها على عاتقه ‏.‏",
      "text_en": " Abd Allah b. Zaid said:                      The Messenger of Allah (pbuh)prayed for rain wearing a black robe with ornamented border.  The Messenger of Allah (pbuh)wanted to reverse it from bottom to top by holding the bottom.  But when it was too heavy he turned it round on his shoulders.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، وهشام بن عمار، قالا حدثنا عبد الرحمن بن أبي الرجال، عن عمارة بن غزية، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه أبي سعيد، قال قال رسول الله ‏\"‏ من سأل وله قيمة أوقية فقد ألحف ‏\"‏ ‏.‏ فقلت ناقتي الياقوتة هي خير من أوقية ‏.‏ قال هشام خير من أربعين درهما فرجعت فلم أسأله شيئا زاد هشام في حديثه وكانت الأوقية على عهد رسول الله صلى الله عليه وسلم أربعين درهما ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: If anyone begs when he has something equivalent to an uqiyah in value, he has begged immoderately. So I said: My she-camel, Yaqutah, is better than an uqiyah. The version of Hisham goes: \"better than forty dirhams. So I returned and did not beg anything from him.\" Hisham added in his version: \"An uqiyah during the time of the Messenger of Allah (ﷺ) was equivalent to forty dirhams.\"",
      "chain": [
        "30367",
        "30288",
        "20702",
        "11894",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا عمارة بن غزية، حدثنا يحيى بن عمارة، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم قول لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) as saying: Recite to those of you who are dying \"There is no god but Allah.\"",
      "chain": [
        "30175",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا عمارة بن غزية، عن يحيى بن راشد، قال جلسنا لعبد الله بن عمر فخرج إلينا فجلس فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حالت شفاعته دون حد من حدود الله فقد ضاد الله ومن خاصم في باطل وهو يعلمه لم يزل في سخط الله حتى ينزع عنه ومن قال في مؤمن ما ليس فيه أسكنه الله ردغة الخبال حتى يخرج مما قال ‏\"‏ ‏.‏",
      "text_en": " Yahya ibn Rashid said:                      We were sitting waiting for Abdullah ibn Umar who came out to us and sat. He then said: I heard the Messenger of Allah (ﷺ) as saying: If anyone's intercession intervenes as an obstacle to one of the punishments prescribed by Allah, he has opposed Allah; if anyone disputes knowingly about something which is false, he remains in the displeasure of Allah till he desists, and if anyone makes an untruthful accusation against a Muslim, he will be made by Allah to dwell in the corrupt fluid flowing from the inhabitants of Hell till he retracts his statement.",
      "chain": [
        "30184",
        "20321",
        "11894",
        "24490"
      ]
    },
    {
      "hadith_no": "4813",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا عمارة بن غزية، قال حدثني رجل، من قومي عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعطي عطاء فوجد فليجز به فإن لم يجد فليثن به فمن أثنى به فقد شكره ومن كتمه فقد كفره ‏\"‏ ‏.‏ قال أبو داود رواه يحيى بن أيوب عن عمارة بن غزية عن شرحبيل عن جابر ‏.‏ قال أبو داود وهو شرحبيل يعني رجلا من قومي كأنهم كرهوه فلم يسموه ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: If someone is given something, he should give a return for it provided he can afford; if he cannot afford, he should praise him. He who praises him for it, thanks him, and he who conceals it is ungrateful to him.Abu Dawud said: It has been transmitted by Yahya b. Ayyub, from 'Umarah b. Ghaziyyah, from Sharahbil on the authority of JabirAbu Dawud said: In the chain of this tradition 'Umarah b. Ghaziyyah said: A man from my tribe said. The man referred by him is in Sharahbil. It is likely that they disliked him and, therefore, they did not blame him.",
      "chain": [
        "30175",
        "20212",
        "11894",
        "34"
      ]
    },
    {
      "hadith_no": "4932",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عوف، حدثنا سعيد بن أبي مريم، أخبرنا يحيى بن أيوب، قال حدثني عمارة بن غزية، أن محمد بن إبراهيم، حدثه عن أبي سلمة بن عبد الرحمن، عن عائشة، رضى الله عنها قالت قدم رسول الله صلى الله عليه وسلم من غزوة تبوك أو خيبر وفي سهوتها ستر فهبت ريح فكشفت ناحية الستر عن بنات لعائشة لعب فقال ‏\"‏ ما هذا يا عائشة ‏\"‏ ‏.‏ قالت بناتي ‏.‏ ورأى بينهن فرسا له جناحان من رقاع فقال ‏\"‏ ما هذا الذي أرى وسطهن ‏\"‏ ‏.‏ قالت فرس ‏.‏ قال ‏\"‏ وما هذا الذي عليه ‏\"‏ ‏.‏ قالت جناحان ‏.‏ قال ‏\"‏ فرس له جناحان ‏\"‏ ‏.‏ قالت أما سمعت أن لسليمان خيلا لها أجنحة قالت فضحك حتى رأيت نواجذه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) arrived after the expedition to Tabuk or Khaybar (the narrator is doubtful), the draught raised an end of a curtain which was hung in front of her store-room, revealing some dolls which belonged to her.  He asked: What is this?  She replied: My dolls.  Among them he saw a horse with wings made of rags, and asked: What is this I see among them?  She replied: A horse.  He asked: What is this that it has on it?  She replied: Two wings.  He asked: A horse with two wings?  She replied: Have you not heard that Solomon had horses with wings? She said: Thereupon the Messenger of Allah (ﷺ) laughed so heartily that I could see his molar teeth.",
      "chain": [
        "38566",
        "30232",
        "20379",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "828",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا هناد، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يلبي إلا لبى من عن يمينه أو عن شماله من حجر أو شجر أو مدر حتى تنقطع الأرض من ها هنا وها هنا ‏\"‏ ‏.‏ حدثنا الحسن بن محمد الزعفراني، وعبد الرحمن بن الأسود أبو عمرو البصري، قالا حدثنا عبيدة بن حميد، عن عمارة بن غزية، عن أبي حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم نحو حديث إسماعيل بن عياش ‏.‏ قال وفي الباب عن ابن عمر وجابر ‏.‏ قال أبو عيسى حديث أبي بكر حديث غريب لا نعرفه إلا من حديث ابن أبي فديك عن الضحاك بن عثمان ‏.‏ ومحمد بن المنكدر لم يسمع من عبد الرحمن بن يربوع وقد روى محمد بن المنكدر عن سعيد بن عبد الرحمن بن يربوع عن أبيه غير هذا الحديث ‏.‏ وروى أبو نعيم الطحان ضرار بن صرد هذا الحديث عن ابن أبي فديك عن الضحاك بن عثمان عن محمد بن المنكدر عن سعيد بن عبد الرحمن بن يربوع عن أبيه عن أبي بكر عن النبي صلى الله عليه وسلم ‏.‏ وأخطأ فيه ضرار ‏.‏ قال أبو عيسى سمعت أحمد بن الحسن يقول قال أحمد بن حنبل من قال في هذا الحديث عن محمد بن المنكدر عن ابن عبد الرحمن بن يربوع عن أبيه فقد أخطأ ‏.‏ قال وسمعت محمدا يقول وذكرت له حديث ضرار بن صرد عن ابن أبي فديك فقال هو خطأ ‏.‏ فقلت قد رواه غيره عن ابن أبي فديك أيضا مثل روايته ‏.‏ فقال لا شىء إنما رووه عن ابن أبي فديك ولم يذكروا فيه عن سعيد بن عبد الرحمن ‏.‏ ورأيته يضعف ضرار بن صرد ‏.‏ والعج هو رفع الصوت بالتلبية ‏.‏ والثج هو نحر البدن ‏.‏",
      "text_en": " Sahl bin Sa'd narrated that :                     the Messenger of Allah said: \"There is no Muslim who says the Talbiyah except that - on his right and left, until the end f the land, from here to there - the rocks, or trees, or mud say the Talbiyah.\"",
      "chain": [
        "30480",
        "20736",
        "11894",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأم سلمة وعائشة وجابر وسعدى المرية وهي امرأة طلحة بن عبيد الله ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن غريب صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'",
      "chain": [
        "30460",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2166",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن عياش، عن عمارة بن غزية، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعطي عطاء فوجد فليجز به ومن لم يجد فليثن فإن من أثنى فقد شكر ومن كتم فقد كفر ومن تحلى بما لم يعطه كان كلابس ثوبى زور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وفي الباب عن أسماء بنت أبي بكر وعائشة ‏.‏ ومعنى قوله ‏\"‏ ومن كتم فقد كفر ‏\"‏ ‏.‏ يقول قد كفر تلك النعمة ‏.‏",
      "text_en": " Jabir narrated that the Prophet (s.a.w) said:                     \"Whoever is given a gift, then if he finds something let him reciprocate. If he has nothing, then let him mention some praise. For whoever has mentioned some praise, then he has expressed his gratitude. And whoever refrains (from doing so) then he has committed Kufr. And whoever pretends to be satisfied by that which he was not given, he is like the one who wears a garment of falsehood.\" (Dai'f)",
      "chain": [
        "20387",
        "20736",
        "11894",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا إسحاق بن محمد الفروي، حدثنا إسماعيل بن جعفر، عن عمارة بن غزية، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن قتادة بن النعمان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أحب الله عبدا حماه الدنيا كما يظل أحدكم يحمي سقيمه الماء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن صهيب وأم المنذر ‏.‏ وهذا حديث حسن غريب ‏.‏ وقد روي هذا الحديث عن محمود بن لبيد عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Qatadah bin An-Nu'man narrated that the Messenger of Allah (s.a.w) said:                     \"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"",
      "chain": [
        "11222",
        "20155",
        "11894",
        "11103",
        "1830",
        "233"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، وزياد بن أيوب، قالا حدثنا أبو عامر العقدي، عن سليمان بن بلال، عن عمارة بن غزية، عن عبد الله بن علي بن حسين بن علي بن أبي طالب، عن أبيه، عن حسين بن علي بن أبي طالب، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البخيل الذي من ذكرت عنده فلم يصل على ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that the Messenger of Allah said:                     “The stingy person is the one before whom I am mentioned, and he does not send Salat upon me.”",
      "chain": [
        "30221",
        "30249",
        "20443",
        "20160",
        "11894",
        "6405",
        "20315",
        "5"
      ]
    },
    {
      "hadith_no": "1137",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، أنه سمع أبا صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه عز وجل وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"The closest that a person can be to his Lord, the Mighty and Sublime, is when he is prostrating, so increase in supplication then.\"",
      "chain": [
        "20672",
        "20029",
        "20377",
        "11894",
        "11428",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "1507",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد العزيز، عن عمارة بن غزية، عن عباد بن تميم، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم استسقى وعليه خميصة سوداء ‏.‏",
      "text_en": " It was narrated from Abdullah bin Zaid that:                     The Messenger of Allah (ﷺ) prayed for rain wearing a black khamisah.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر بن المفضل، قال حدثنا عمارة بن غزية، قال حدثنا يحيى بن عمارة، قال سمعت أبا سعيد، ح وأنبأنا قتيبة، قال حدثنا عبد العزيز، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed said:                     \"The Messenger of Allah said: 'Prompt your dying ones to say La ilaha illallah (there is none worthy of worship except Allah).\"'",
      "chain": [
        "30153",
        "20212",
        "11894",
        "11232",
        "38",
        "30367",
        "20167",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2257",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، عن عمارة بن غزية، عن محمد بن عبد الرحمن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم رأى ناسا مجتمعين على رجل فسأل فقالوا رجل أجهده الصوم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     the Messenger of Allah saw some people gathered around a man, so he asked (what was happening) and they said: \"It is a man who is exhausted because of fasting.\" The Messenger of Allah said: \"It is not righteousness to fast when traveling.\"",
      "chain": [
        "30367",
        "11267",
        "11894",
        "11105",
        "34"
      ]
    },
    {
      "hadith_no": "2595",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا قتيبة، قال حدثنا ابن أبي الرجال، عن عمارة بن غزية، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، قال سرحتني أمي إلى رسول الله صلى الله عليه وسلم فأتيته وقعدت فاستقبلني وقال ‏\"‏ من استغنى أغناه الله عز وجل ومن استعف أعفه الله عز وجل ومن استكفى كفاه الله عز وجل ومن سأل وله قيمة أوقية فقد ألحف ‏\"‏ ‏.‏ فقلت ناقتي الياقوتة خير من أوقية فرجعت ولم أسأله ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abu Sa'eed Al-Khudri that his father said:                     \"My mother sent me to the Messenger of Allah, and I came to him and sat down. He turned to me and said: 'Whoever wants to be independent of means, Allah, the Mighty and Sublime, will make him independent. Whoever wants to refrain from asking, Allah, the Mighty and Sublime, will help him to refrain. Whoever wants to be content with his lot, Allah, the Mighty and Sublime, Allah, the Mighty and Sublime, will suffice him. Whoever asks when he has something worth one Uqiyah, then he is being too demanding. 'I said: 'My she-camel Al-Yaqutah is worth more than and Uqiyah,' so I came back and did not ask him for anything.\"",
      "chain": [
        "30367",
        "11894",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أخبرني يحيى بن أيوب، وذكر، آخر قبله عن عمارة بن غزية، عن أبي الزبير، عن جابر بن عبد الله، قال لما كان يوم أحد وولى الناس كان رسول الله صلى الله عليه وسلم في ناحية في اثنى عشر رجلا من الأنصار وفيهم طلحة بن عبيد الله فأدركهم المشركون فالتفت رسول الله صلى الله عليه وسلم وقال ‏\"‏ من للقوم ‏\"‏ ‏.‏ فقال طلحة أنا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كما أنت ‏\"‏ ‏.‏ فقال رجل من الأنصار أنا يا رسول الله ‏.‏ فقال ‏\"‏ أنت ‏\"‏ ‏.‏ فقاتل حتى قتل ثم التفت فإذا المشركون فقال ‏\"‏ من للقوم ‏\"‏ ‏.‏ فقال طلحة أنا ‏.‏ قال ‏\"‏ كما أنت ‏\"‏ ‏.‏ فقال رجل من الأنصار أنا ‏.‏ فقال ‏\"‏ أنت ‏\"‏ ‏.‏ فقاتل حتى قتل ثم لم يزل يقول ذلك ويخرج إليهم رجل من الأنصار فيقاتل قتال من قبله حتى يقتل حتى بقي رسول الله صلى الله عليه وسلم وطلحة بن عبيد الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من للقوم ‏\"‏ ‏.‏ فقال طلحة أنا ‏.‏ فقاتل طلحة قتال الأحد عشر حتى ضربت يده فقطعت أصابعه فقال حس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قلت بسم الله لرفعتك الملائكة والناس ينظرون ‏\"‏ ‏.‏ ثم رد الله المشركين ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                      \"On the day of Uhud, the people ran away, and the Messenger of Allah (ﷺ) was in one position among twelve men of the Ansar, one of whom was Talhah bin 'Ubaidullah. He said: 'Who will face the people?' Talhah said: 'I will.' The Messenger of Allah (ﷺ) said: 'Stay where you are.' One of the Ansar said: 'I will, O Messenger of Allah (ﷺ).' He said: 'You (go ahead).' So he fought until he was killed. Then he turned and saw the idolators. He said: 'Who will face the people?' Talhah said: 'I will'. The Messenger of Allah (ﷺ) said: 'Stay where you are.' One of the Ansar said: 'I will, O Messenger of Allah (ﷺ).' He said: 'You (go ahead).' So he fought until he was killed. This carried on, and each man of the Ansar went out to face them and fought like the one before him, and was killed, until only the Messenger of Allah (ﷺ) and Talhah bin 'Ubaidullah were left. The Messenger of Allah (ﷺ) said: 'Who will face the people?' Talhah said: 'I will.' So Talhah fought like the eleven before him, until his hand was struck, and his fingers were cut off, and he exclaimed in pain. The Messenger of Allah (ﷺ) said: 'If you had said Bismillah (in the Name of Allah), the angels would have lifted you up with the people looking on.' Then Allah drove back the idolators.\"",
      "chain": [
        "30443",
        "20029",
        "20379",
        "11894",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن سعد بن الحكم بن أبي مريم، قال حدثنا عمي، قال حدثنا يحيى بن أيوب، قال أخبرني عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم وهي بنت ست سنين وبنى بها وهي بنت تسع ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah married me when I was six, and consummated the marriage with me when I was nine.\"",
      "chain": [
        "36001",
        "20379",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "5068",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، عن عبد العزيز، عن عمارة بن غزية، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن نتف الشيب ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     The Messenger of Allah [SAW] forbade plucking gray hairs.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5709",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد العزيز، عن عمارة بن غزية، عن أبي الزبير، عن جابر، أن رجلا، من جيشان - وجيشان من اليمن - قدم فسأل رسول الله صلى الله عليه وسلم عن شراب يشربونه بأرضهم من الذرة يقال له المزر فقال النبي صلى الله عليه وسلم ‏\"‏ أمسكر هو ‏\"‏ ‏.‏ قال نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام إن الله عز وجل عهد لمن شرب المسكر أن يسقيه من طينة الخبال ‏\"‏ ‏.‏ قالوا يا رسول الله وما طينة الخبال قال ‏\"‏ عرق أهل النار أو قال عصارة أهل النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that:                     A man from (the tribe of) Jaishan, who are from Yemen, came and asked the Messenger of Allah [SAW] about a drink that they drank in his homeland that was made of corn and called Al-Mizr (beer). The Prophet [SAW] said to him: \"Is it an intoxicant?\" He said: \"Yes.\" The Messenger of Allah [SAW] said: \"Every intoxicant is unlawful. Allah, the Mighty and Sublime, has promised the one who drinks intoxicants that He will give him to drink from the mud of Khibal.\" They said: \"O Messenger of Allah, what is the mud of Khibal?\" He said: \"The sweat of the people of Hell,\" or he said: \"The juice of the people of Hell.\"",
      "chain": [
        "30367",
        "20167",
        "11894",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، وعبد الوهاب بن الضحاك، قالا حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دخل أحدكم المسجد فليسلم على النبي  صلى الله عليه وسلم  ثم ليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"The Messenger of Allah said: 'When anyone of you enters the mosque, let him send peace upon the prophet, then let him say: \"Allahummaftah li abwaba rahmatika (O Allah, open to me the gates of Your mercy).\" And when he leaves, let him say: \"Allahumma inni as'aluka min fadlika. (O Allah, I ask of you from Your bounty).\"",
      "chain": [
        "10581",
        "38361",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "hadith_no": "798",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن أنس بن مالك، عن عمر بن الخطاب، عن النبي  صلى الله عليه وسلم  أنه كان يقول ‏\"‏ من صلى في مسجد جماعة أربعين ليلة لا تفوته الركعة الأولى من صلاة العشاء كتب الله له بها عتقا من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that:                     The Prophet used to say: \"Whoever performs prayer in congregation at the mosque for forty nights, never missing the first Rak'ah of the 'Isha' prayer, Allah will thereby decree for him salvation from the Fire.\"",
      "chain": [
        "30203",
        "20736",
        "11894",
        "19",
        "3"
      ]
    },
    {
      "hadith_no": "1512",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرحمن بن مهدي، عن سليمان بن بلال، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) said: ‘Urge your dying ones to say: “La ilaha illallah.”",
      "chain": [
        "11222",
        "20033",
        "20160",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، حدثني عمارة بن غزية، قال سمعت محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  اعتكف في قبة تركية على سدتها قطعة حصير ‏.‏ قال فأخذ الحصير بيده فنحاها في ناحية القبة ثم أطلع رأسه فكلم الناس ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that:                      The Messenger of Allah(ﷺ) observed I’tifak in a Turkish tent, over the door of whichwas apiece of reed matting. He pushed the mat aside, then he put hisheadout and spoke to the people.",
      "chain": [
        "20288",
        "11894",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أجملوا في طلب الدنيا فإن كلا ميسر لما خلق له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that the Messenger of Allah (ﷺ) said:                     Be moderate in seeking worldly things, for everyone will be facilitated for which he was created.\"",
      "chain": [
        "30288",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "hadith_no": "3033",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثنا عمارة بن غزية الأنصاري، عن أبي حازم، عن سهل بن سعد الساعدي، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ما من ملب يلبي إلا لبى ما عن يمينه وشماله من حجر أو شجر أو مدر حتى تنقطع الأرض من ها هنا وها هنا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Sa’d As-Sa’idi that the Messenger ofAllah(ﷺ) said:                      “There is no (pilgrim) who recites the Talbiyah butthat which is to his right and left also recites it, rocks and treesand hills, to the farthest ends of the earth in each direction, fromhere and from there.”",
      "chain": [
        "30288",
        "20736",
        "11894",
        "11172",
        "399"
      ]
    }
  ],
  "total_hadiths": 42
}