{
  "id": "11893",
  "name": "'Ali bin 'Abdur Rahman علي بن عبد الرحمن المعاوي",
  "full_name": "'Ali bin 'Abdur Rahman علي بن عبد الرحمن المعاوي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11540",
      "name": "Muslim bin Abi Maryam مسلم بن أبي مريم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن مسلم بن أبي مريم، عن علي بن عبد الرحمن المعاوي، أنه قال رآني عبد الله بن عمر وأنا أعبث بالحصى في الصلاة فلما انصرف نهاني فقال اصنع كما كان رسول الله صلى الله عليه وسلم يصنع ‏.‏ فقلت وكيف كان رسول الله صلى الله عليه وسلم يصنع قال كان إذا جلس في الصلاة وضع كفه اليمنى على فخذه اليمنى وقبض أصابعه كلها وأشار بإصبعه التي تلي الإبهام ووضع كفه اليسرى على فخذه اليسرى ‏.‏",
      "text_en": " 'Ali b. 'Abual-Rahman al-Mu'awi reported:                      'Abdullah b. Umar saw me playing with pebbles during prayer. After finishing the prayer he forbade me (to do it) and said: Do as the Messenger of Allah (may peace be upon him) used to do. I said: How did Allah's Messenger (may peace be upon him) do? He said that he (the Messenger of Allah) sat at tashahhud, placed his right palm on the right thigh and closed all his fingers and pointed with the help of finger next to the thumb, and placed his left palm on his left thigh.",
      "chain": [
        "30399",
        "11540",
        "11893"
      ]
    },
    {
      "hadith_no": "1340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مسلم بن أبي مريم، عن علي بن عبد الرحمن المعاوي، قال صليت إلى جنب ابن عمر ‏.‏ فذكر نحو حديث مالك وزاد قال سفيان فكان يحيى بن سعيد حدثنا به عن مسلم ثم حدثنيه مسلم ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "chain": [
        "30421",
        "20005",
        "11540",
        "11893"
      ]
    },
    {
      "hadith_no": "987",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن مسلم بن أبي مريم، عن علي بن عبد الرحمن المعاوي، قال رآني عبد الله بن عمر وأنا أعبث بالحصى في الصلاة فلما انصرف نهاني وقال اصنع كما كان رسول الله صلى الله عليه وسلم يصنع ‏.‏ فقلت وكيف كان رسول الله صلى الله عليه وسلم يصنع قال كان إذا جلس في الصلاة وضع كفه اليمنى على فخذه اليمنى وقبض أصابعه كلها وأشار بأصبعه التي تلي الإبهام ووضع كفه اليسرى على فخذه اليسرى ‏.‏",
      "text_en": " ’Abd al-Rahman al-Mu’awl said:                      ‘Abd Allah b. ‘Umar saw me playing with pebbles during prayer. When he finished his prayer, he forbade me (to do so) and said: Do as the Apostle (ﷺ) used to do. I asked him: How would the Messenger of Allah(ﷺ) do? He said: When he sat during the prayer (for reciting the tashahhud), he placed his right hand on his right thigh, and clenched all his fingers, and pointed with the finger which is adjacent to the thumb, and he placed his left hand on his left thigh.",
      "chain": [
        "20164",
        "20001",
        "11540",
        "11893"
      ]
    }
  ],
  "total_hadiths": 3
}