{
  "id": "11900",
  "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
  "full_name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "106",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Iraq",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "Iraq"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator[Grade:No Doubt] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Asha'ri"
    ]
  },
  "parents": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "409",
      "name": "Ibrahim bin Abi Musa al-Asha'ari ( إبراهيم بن أبي موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11902",
      "name": "Musa bin Abi Musa al-Asha'ari موسى بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11620",
      "name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11309",
      "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10745",
      "name": "Bdr bin 'Uthman al-Amwy بدر بن عثمان الأموي مولاهم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11636",
      "name": "'Abdullah bin Abi al-Safar عبد الله بن أبي السفر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "574",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هدبة بن خالد، قال حدثنا همام، حدثني أبو جمرة، عن أبي بكر بن أبي موسى، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى البردين دخل الجنة ‏\"‏‏.‏ وقال ابن رجاء حدثنا همام عن أبي جمرة أن أبا بكر بن عبد الله بن قيس أخبره بهذا‏.‏ حدثنا إسحاق، عن حبان، حدثنا همام، حدثنا أبو جمرة، عن أبي بكر بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Abu Bakr bin Abi Musa:                     My father said, \"Allah's Apostle said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to Paradise.' \"",
      "chain": [
        "20294",
        "20297",
        "11309",
        "11900",
        "41"
      ]
    },
    {
      "hadith_no": "6473",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبيد الله بن عبد المجيد، حدثنا إسرائيل، حدثنا أبو إسحاق، عن أبي بكر بن أبي موسى، وأبي، بردة  أحسبه  عن أبي موسى الأشعري، عن النبي صلى الله عليه وسلم أنه كان يدعو ‏\"‏ اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي هزلي وجدي وخطاى وعمدي، وكل ذلك عندي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet used to invoke Allah, saying, \"Allahumma ighfirli khati'ati wa jahli wa israfi fi `Amri, wa ma anta a-'lamu bihi minni. Allahumma ighfirli hazali wa jiddi wa khata'i wa amdi, wa kullu dhalika 'indi.\"",
      "chain": [
        "30170",
        "20311",
        "11049",
        "11900",
        "41"
      ]
    },
    {
      "hadith_no": "1425",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن بدر بن عثمان، عن أبي بكر بن أبي موسى، سمعه منه، عن أبيه، أن سائلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة ‏.‏ بمثل حديث ابن نمير غير أنه قال فصلى المغرب قبل أن يغيب الشفق في اليوم الثاني ‏.‏",
      "text_en": " Abu Musa reported on the authority of his father that an Inquirer came to the Prophet (may peace be upon him) and asked him about the times of prayers, and the rest of the hadith is the same (as narrated above) but for these words:                     \" On the second day he (the Holy Prophet) observed the evening prayer before the disappearance of the twilight.\"",
      "chain": [
        "30201",
        "20032",
        "10745",
        "11900",
        "41"
      ]
    },
    {
      "hadith_no": "7062",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن أبي بكر بن أبي موسى، عن البراء، أن النبي صلى الله عليه وسلم كان إذا أخذ مضجعه قال ‏\"‏ اللهم باسمك أحيا وباسمك أموت ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' reported that whenever Allah's Messenger (may peace be upon him) went to bed, he said:                     \" O Allah, it is with Thine Name that I live and it is with Thine Name that I die.\" And when he got up he used to say:\" Praise is due to Allah, Who gave us life after our death (sleep) and unto Thee is resurrection.\"",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11900",
        "400"
      ]
    },
    {
      "hadith_no": "1659",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة، حدثنا جعفر بن سليمان الضبعي، عن أبي عمران الجوني، عن أبي بكر بن أبي موسى الأشعري، قال سمعت أبي بحضرة العدو، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أبواب الجنة تحت ظلال السيوف ‏\"‏ ‏.‏ فقال رجل من القوم رث الهيئة أأنت سمعت هذا من رسول الله صلى الله عليه وسلم يذكره قال نعم ‏.‏ فرجع إلى أصحابه فقال أقرأ عليكم السلام ‏.‏ وكسر جفن سيفه فضرب به حتى قتل ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث جعفر بن سليمان الضبعي ‏.‏ وأبو عمران الجوني اسمه عبد الملك بن حبيب وأبو بكر بن أبي موسى قال أحمد بن حنبل هو اسمه ‏.‏",
      "text_en": " Narrated Abu Bakr bin Abi Musa Al-Ash'ari:                     \"I heard my father saying in the presence of the enemy: 'The Messenger of Allah (ﷺ) said: \"Indeed, the gates of Paradise are under the shadows of the swords.'\" A man among the people with ragged appearance said: 'Have you heard what you mentioned from the Messenger of Allah (ﷺ) ?' He said: 'Yes.' So he returned to his comrades and bid them Salam (farewell), broke the sheath of his sword, and began fighting with it until he was killed.\"[Abu 'Eisa said:] This Hadith is Sahih Gharib. We do not know it except as a narration of Ja'far bin Sulaiman [Ad-Dubai']. (One of the narrators) Abu 'Imran Al-Jawni's name is 'Abdul Malik bin Habib. As for Abu Bakr bin Abi Musa, Ahmad bin Hanbal said: \"That is his name.\"",
      "chain": [
        "30367",
        "20532",
        "11296",
        "11900"
      ]
    },
    {
      "hadith_no": "3980",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الفضل بن سهل أبو العباس الأعرج البغدادي، حدثنا عبد الرحمن بن غزوان أبو نوح، أخبرنا يونس بن أبي إسحاق، عن أبي بكر بن أبي موسى، عن أبيه، قال خرج أبو طالب إلى الشام وخرج معه النبي صلى الله عليه وسلم في أشياخ من قريش فلما أشرفوا على الراهب هبطوا فحلوا رحالهم فخرج إليهم الراهب وكانوا قبل ذلك يمرون به فلا يخرج إليهم ولا يلتفت ‏.‏ قال فهم يحلون رحالهم فجعل يتخللهم الراهب حتى جاء فأخذ بيد رسول الله صلى الله عليه وسلم قال هذا سيد العالمين هذا رسول رب العالمين يبعثه الله رحمة للعالمين ‏.‏ فقال له أشياخ من قريش ما علمك فقال إنكم حين أشرفتم من العقبة لم يبق شجر ولا حجر إلا خر ساجدا ولا يسجدان إلا لنبي وإني أعرفه بخاتم النبوة أسفل من غضروف كتفه مثل التفاحة ‏.‏ ثم رجع فصنع لهم طعاما فلما أتاهم به وكان هو في رعية الإبل قال أرسلوا إليه فأقبل وعليه غمامة تظله فلما دنا من القوم وجدهم قد سبقوه إلى فىء الشجرة فلما جلس مال فىء الشجرة عليه فقال انظروا إلى فىء الشجرة مال عليه ‏.‏ قال فبينما هو قائم عليهم وهو يناشدهم أن لا يذهبوا به إلى الروم فإن الروم إذا رأوه عرفوه بالصفة فيقتلونه فالتفت فإذا بسبعة قد أقبلوا من الروم فاستقبلهم فقال ما جاء بكم قالوا جئنا أن هذا النبي خارج في هذا الشهر فلم يبق طريق إلا بعث إليه بأناس وإنا قد أخبرنا خبره بعثنا إلى طريقك هذا فقال هل خلفكم أحد هو خير منكم قالوا إنما أخبرنا خبره بطريقك هذا ‏.‏ قال أفرأيتم أمرا أراد الله أن يقضيه هل يستطيع أحد من الناس رده قالوا لا ‏.‏ قال فبايعوه وأقاموا معه قال أنشدكم الله أيكم وليه قالوا أبو طالب فلم يزل يناشده حتى رده أبو طالب وبعث معه أبو بكر بلالا وزوده الراهب من الكعك والزيت ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash'ari:                     \"Abu Talib departed to Ash-Sham, and the Prophet (ﷺ) left with him, along with some older men from the Quraish. When they came across the monk they stopped there and began setting up their camp, and the monk came out to them. Before that they used to pass by him and he wouldn't come out nor pay attention to them.\" He said: \"They were setting up their camp when the monk was walking amidst them, until he came and took the hand of the Messenger of Allah (ﷺ). Then he said: 'This is the master of the men and jinn, this is the Messenger of the Lord of the worlds. Allah will raise him as a mercy to the men and jinn.' So some of the older people from the Quraish said: 'What do you know?' He said: 'When you people came along from the road, not a rock nor a tree was left, except that it prostrated, and they do not prostrate except for a Prophet. And I can recognize him by the seal of the Prophethood which is below his shoulder blade, like an apple.' Then he went back, and made them some food, and when he brought it to them, he [the Prophet (ﷺ)] was tending to the camels. So he said: 'Send for him.' So he came, and there was a cloud over him that was shading him. When he came close to the people, he found that they had beaten him to the tree's shade. So when he sat down, the shade of the tree leaned towards him. He (the monk) said: 'Look at the shade of the tree leaning towards him.'\" He said: \"So while he was standing over them, telling them not to take him to Rome with him - because if the Romans were to see him, they would recognize him by his description, and they would kill him - he turned, and there were seven people who had come from Rome. So he faced them and said: 'Why have you come?' They said: 'We came because this Prophet is going to appear during this month, and there isn't a road left except that people have been sent to it, and we have been informed of him, and we have been send to this road of yours.' So he said: 'Is there anyone better than you behind you?' They said: 'We only have news of him from this road of yours.' He said: 'Do you think that if there is a matter which Allah wishes to bring about, there is anyone among the people who can turn it away?' They said: 'No.'\" He said: \"So they gave him their pledge, and they stayed with him. And he said: 'I ask you by Allah, which of you is his guardian?' They said: 'Abu Talib.' So he kept adjuring him until Abu Talib returned him (back to Makkah) and he sent Abu Bakr and Bilal with him. And the monk gave him provisions of Ka'k (a type of bread) and olive oil.\"",
      "chain": [
        "30264",
        "10846",
        "11900",
        "41"
      ]
    }
  ],
  "total_hadiths": 6
}