{
  "id": "11902",
  "name": "Musa bin Abi Musa al-Asha'ari موسى بن أبي موسى الأشعري",
  "full_name": "Musa bin Abi Musa al-Asha'ari موسى بن أبي موسى الأشعري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "Iraq"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator[Grade:No Doubt] [ ت  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Asha'ri",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "534",
      "name": "Umm Khultum bint Fadl ibn al-'Abbas ( أم كلثوم بنت الفضل بن العباس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "409",
      "name": "Ibrahim bin Abi Musa al-Asha'ari ( إبراهيم بن أبي موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1003",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا محمد بن عمار، حدثني أسيد بن أبي أسيد، أن موسى بن أبي موسى الأشعري، أخبره عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من ميت يموت فيقوم باكيه فيقول واجبلاه واسيداه أو نحو ذلك إلا وكل به ملكان يلهزانه أهكذا كنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Musa bin Abi Musa Al-Asha'ri narrated from his father that:                     The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"",
      "chain": [
        "20387",
        "19800",
        "11902",
        "41"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا أسيد بن أبي أسيد، عن موسى بن أبي موسى الأشعري، عن أبيه، ‏.‏ أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الميت يعذب ببكاء الحى إذا قالوا واعضداه واكاسياه ‏.‏ واناصراه واجبلاه ونحو هذا - يتعتع ويقال أنت كذلك أنت كذلك ‏\"‏ ‏.‏ قال أسيد فقلت سبحان الله إن الله يقول ‏{ولا تزر وازرة وزر أخرى }‏ ‏.‏ قال ويحك أحدثك أن أبا موسى حدثني عن رسول الله  صلى الله عليه وسلم  فترى أن أبا موسى كذب على النبي  صلى الله عليه وسلم  أو ترى أني كذبت على أبي موسى",
      "text_en": " It wasnarrated from Asid bin Abu Asid, from Musa bin Abu Musa Ash’ari,from his father that the Prophet (ﷺ) said:                      “The deceased ispunished for the weeping of the living. If they say: ‘O mystrength, O he who clothed us, O my help, O my rock,’ and so on, heis rebuked and it is said: ‘Were you really like that? Were youreally like that?’” Asid said: \"I said: 'Subhan-Allah! Allah says: \"And no bearer of burdens shall another's burden (35:18).\" He said: \"Woe to you, I tell you that Abu Musa narrated to me from the Messenger of Allah (ﷺ), and you think that Abu Musa was telling lies about the Prophet (ﷺ)? Or do you think that I am telling lies about Abu Musa?\"",
      "chain": [
        "32048",
        "20167",
        "19800",
        "11902"
      ]
    }
  ],
  "total_hadiths": 2
}