{
  "id": "12013",
  "name": "Isma'il bin Basheer إسماعيل بن بشير مولى بني مغالة",
  "full_name": "Isma'il bin Basheer إسماعيل بن بشير مولى بني مغالة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  -  مجهول ]"
    ],
    "tags": [
      "Ansar",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "229",
      "name": "Abu Talha Ansari ( أبو طلحة الأنصاري زيد بن سهل بن الأسود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19147",
      "name": "Yahya bin Sulaym bin Zayd يحيى بن سليم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4884",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن الصباح، حدثنا ابن أبي مريم، أخبرنا الليث، قال حدثني يحيى بن سليم، أنه سمع إسماعيل بن بشير، يقول سمعت جابر بن عبد الله، وأبا، طلحة بن سهل الأنصاري يقولان قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من امرئ يخذل امرأ مسلما في موضع تنتهك فيه حرمته وينتقص فيه من عرضه إلا خذله الله في موطن يحب فيه نصرته وما من امرئ ينصر مسلما في موضع ينتقص فيه من عرضه وينتهك فيه من حرمته إلا نصره الله في موطن يحب نصرته ‏\"‏ ‏.‏ قال يحيى وحدثنيه عبيد الله بن عبد الله بن عمر وعقبة بن شداد ‏.‏ قال أبو داود يحيى بن سليم هذا هو ابن زيد مولى النبي صلى الله عليه وسلم وإسماعيل بن بشير مولى بني مغالة وقد قيل عتبة بن شداد موضع عقبة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah ; AbuTalhah ibn Sahl al-Ansari:                     The Prophet (ﷺ) said: No (Muslim) man will desert a man who is a Muslim in a place where his respect may be violated and his honour aspersed without Allah deserting him in a place here he wishes his help; and no (Muslim) man who will help a Muslim in a place where his honour may be aspersed and his respect violated without Allah helping him in a place where he wishes his help.Yahya said: 'Ubaid Allah b. 'Abd Allah b. 'Umar and 'Uqbah b. Shaddad transmitted it to me.Abu Dawud said: This yahya b. Sulaim is the son of Zaid, the freed slave of the Prophet (ﷺ), and Isma'il b. Bashir is the freed slave of Banu Maghalah. Sometimes the name of 'Utbah b. Shaddad is mentioned instead of 'Uqbah.",
      "chain": [
        "35013",
        "30232",
        "20023",
        "20204",
        "12013",
        "34",
        "229"
      ]
    }
  ],
  "total_hadiths": 1
}