{
  "id": "12036",
  "name": "Jbyr bin Abi Sulaiman جبير بن أبي سليمان بن جبير",
  "full_name": "Jbyr bin Abi Sulaiman جبير بن أبي سليمان بن جبير",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19849",
      "name": "'Aabadh bin Muslim al-Fzary عبادة بن مسلم الفزاري أبو يحيى البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19903",
      "name": "al-Harith bin 'Abdur Rahman الحارث بن عبد الرحمن القرشي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5074",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا وكيع، ح وحدثنا عثمان بن أبي شيبة، - المعنى - حدثنا ابن نمير، قالا حدثنا عبادة بن مسلم الفزاري، عن جبير بن أبي سليمان بن جبير بن مطعم، قال سمعت ابن عمر، يقول لم يكن رسول الله صلى الله عليه وسلم يدع هؤلاء الدعوات حين يمسي وحين يصبح ‏\"‏ اللهم إني أسألك العافية في الدنيا والآخرة اللهم إني أسألك العفو والعافية في ديني ودنياى وأهلي ومالي اللهم استر عورتي ‏\"‏ ‏.‏ وقال عثمان ‏\"‏ عوراتي وآمن روعاتي اللهم احفظني من بين يدى ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي ‏\"‏ ‏.‏ قال أبو داود قال وكيع يعني الخسف ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) never failed to utter these supplications in the evening and in the morning: O Allah, I ask  Thee for security in this world and in the Hereafter: O Allah! I ask Thee for forgiveness and security in my religion and my worldly affairs, in my family and my property; O Allah! conceal my fault or faults (according to Uthman's version), and keep me safe from the things which I fear; O Allah! guard me in front of me and behind me, on my right hand and on my left, and from above me: and I seek in Thy greatness from receiving unexpected harm from below me.\" AbuDawud said: Waki' said: That is to say, swallowing by the earth.",
      "chain": [
        "30221",
        "20032",
        "30212",
        "19849",
        "12036",
        "18"
      ]
    },
    {
      "hadith_no": "5529",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "حدثنا عمرو بن منصور، قال حدثنا الفضل بن دكين، عن عبادة بن مسلم، قال حدثني جبير بن أبي سليمان بن جبير بن مطعم، أن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بعظمتك أن أغتال من تحتي ‏\"‏ ‏.‏ قال جبير وهو الخسف ‏.‏ قال عبادة فلا أدري قول النبي صلى الله عليه وسلم أو قول جبير ‏.‏",
      "text_en": " 'Umar said:                     \"I heard the Messenger of Allah [SAW] say: 'Allahumma, inni a'udhu bi-'azamatika an ughtala min tahti (O Allah, I seek refuge in Your greatness from being swallowed up from beneath me.)'\"",
      "chain": [
        "38433",
        "20348",
        "12036",
        "18"
      ]
    },
    {
      "hadith_no": "3871",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد الطنافسي، حدثنا وكيع، حدثنا عبادة بن مسلم، حدثنا جبير بن أبي سليمان بن جبير بن مطعم، قال سمعت ابن عمر، يقول لم يكن رسول الله  صلى الله عليه وسلم  يدع هؤلاء الدعوات حين يمسي وحين يصبح ‏\"‏ اللهم إني أسألك العفو والعافية في الدنيا والآخرة اللهم إني أسألك العفو والعافية في ديني ودنياى وأهلي ومالي اللهم استر عوراتي وآمن روعاتي واحفظني من بين يدى ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بك أن أغتال من تحتي ‏\"‏ ‏.‏ قال وكيع يعني الخسف ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah (saas) never abandoned these supplications, every morning and evening: Allahumma inni as'alukal-'afwa wal-'afiyah fid-dunya wal-akhirah. Allahumma inni as'alukal-'afwa wal-'afiyah fi dini wa dunyaya wa ahli wa mali.  Allahum-mastur 'awrati, wa amin raw'ati wahfazni min bayni yadayya, wa min khalfi, wa 'an yamini wa 'an shimali, wa min fawqi, wa 'audhu bika an ughtala min tahti (O Allah, I ask You for forgiveness and well-being in this world and in the Hereafter. O Allah, I ask You for forgiveness and well-being in my religious and my worldly affairs.  O Allah, conceal my faults, calm my fears, and protect me from before me and behind me, from my right and my left, and from above me, and I seek refuge in You from being taken unaware from beneath me).\" Waki' (one of the narrators, explaining) said: \"Meaning Al-Khasf (disgrace).\"",
      "chain": [
        "38409",
        "20032",
        "12036",
        "18"
      ]
    }
  ],
  "total_hadiths": 3
}