{
  "id": "12046",
  "name": "Haritha bin Abi al-Rajal حارثة بن أبي الرجال",
  "full_name": "Haritha bin Abi al-Rajal حارثة بن أبي الرجال",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "148",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "10959",
      "name": "Muhammad bin 'Abdur Rahman bin Haritha محمد بن عبد الرحمن بن حارثة - أبو الرجال",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10959",
      "name": "Muhammad bin 'Abdur Rahman bin Haritha محمد بن عبد الرحمن بن حارثة - أبو الرجال",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "243",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن عرفة، ويحيى بن موسى، قالا حدثنا أبو معاوية، عن حارثة بن أبي الرجال، عن عمرة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث عائشة إلا من هذا الوجه ‏.‏ وحارثة قد تكلم فيه من قبل حفظه ‏.‏ وأبو الرجال اسمه محمد بن عبد الرحمن المديني ‏.‏",
      "text_en": " Aishah narrated:                     \"When the Prophet opened the Salat he would say: (Subhanaka allahumma wa bihamdika wa tabara asmuka, wa ta'ala jadduka wa la ilaha ghairuk.)\" 'Glorious You are O Allah, and with You praise, and blessed is You Name, and exalted is Your majesty, and none has the right to be worshipped but You.'",
      "chain": [
        "36540",
        "30221",
        "20354",
        "12046",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، وعبد الله بن عمران، قالا حدثنا أبو معاوية، حدثنا حارثة بن أبي الرجال، عن عمرة، عن عائشة، أن النبي  صلى الله عليه وسلم  كان إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that when the Prophet (ﷺ) startedSalat hewould say:                      “Subhanak Allahumma wa bi hamdika, wa tabarakas-muka wata’ala jadduka, wa la ilaha ghayruk (Glory and praise is toYou, OAllah, blessed is Your Name and exalted is Your majesty, nonehas theright to be worshipped but You).”",
      "chain": [
        "38409",
        "20354",
        "12046",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "923",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن حارثة بن أبي الرجال، عن عمرة، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يركع فيضع يديه على ركبتيه ويجافي بعضديه ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ) usedtobow with his hands on his knees and his upper arms held away fromhissides.”",
      "chain": [
        "30201",
        "20337",
        "12046",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1115",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن حارثة بن أبي الرجال، عن عمرة، قالت سألت عائشة كيف كانت صلاة رسول الله  صلى الله عليه وسلم  قالت كان النبي  صلى الله عليه وسلم  إذا توضأ فوضع يديه في الإناء سمى الله ويسبغ الوضوء ثم يقوم فيستقبل القبلة فيكبر ويرفع يديه حذاء منكبيه ثم يركع فيضع يديه على ركبتيه ويجافي بعضديه ثم يرفع رأسه فيقيم صلبه ويقوم قياما هو أطول من قيامكم قليلا ثم يسجد فيضع يديه تجاه القبلة ويجافي بعضديه ما استطاع فيما رأيت ثم يرفع رأسه فيجلس على قدمه اليسرى وينصب اليمنى ويكره أن يسقط على شقه الأيسر ‏.‏",
      "text_en": " It wasnarrated that ‘Amrah said:                      “I asked ‘Aishah: ‘How did theMessenger of Allah (ﷺ) perform prayer?’ She said: ‘When theProphet(ﷺ) performed ablution, he would put his hand in the vesseland sayBismillah, and he would perform ablution properly. Then hewould standand face the Qiblah. He would say the Takbir raising hishandsparallel to his shoulders. Then he would bow, putting his handson hisknees and keeping his arms away from his sides. Then he wouldraisehis head and straighten his back, and he would stand a littlelongerthan your standing. Then he would prostrate, pointing hishandstowards the Qiblah, keeping his arms away (from his sides) asmuch aspossible, according to what I have seen. Then he would raisehis headand sit on his left foot with his right foot held upright,and hedisliked leaning towards his left side.’”",
      "chain": [
        "30201",
        "20337",
        "12046",
        "11455"
      ]
    },
    {
      "hadith_no": "2188",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن نمير، عن حارثة بن أبي الرجال، عن عمرة، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حلف في قطيعة رحم أو فيما لا يصلح فبره أن لا يتم على ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:                     \"Whoever takes an oath to cut off the ties of kinship, or to do something that is not right, the fulfillment of his vow is not to do that.\"",
      "chain": [
        "38409",
        "20331",
        "12046",
        "11455",
        "53"
      ]
    }
  ],
  "total_hadiths": 5
}