{
  "id": "12062",
  "name": "Hafs bin 'Umar bin 'Abdur Rahman B. 'Auf حفص بن عمر بن عبد الرحمن بن عوف",
  "full_name": "Hafs bin 'Umar bin 'Abdur Rahman B. 'Auf حفص بن عمر بن عبد الرحمن بن عوف",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  مقبول ]"
    ],
    "tags": [
      "B.Zuhrah",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3306",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، قال حدثنا أبو عاصم، ح وحدثنا عباس العنبري، - المعنى - قال حدثنا روح، عن ابن جريج، قال أخبرني يوسف بن الحكم بن أبي سفيان، أنه سمع حفص بن عمر بن عبد الرحمن بن عوف، وعمرا، وقال، عباس ‏:‏ ابن حنة أخبراه عن عمر بن عبد الرحمن بن عوف، عن رجال، من أصحاب النبي صلى الله عليه وسلم بهذا الخبر ‏.‏ زاد فقال النبي صلى الله عليه وسلم ‏\"‏ والذي بعث محمدا بالحق لو صليت ها هنا لأجزأ عنك صلاة في بيت المقدس ‏\"‏ ‏.‏ قال أبو داود ‏:‏ رواه الأنصاري عن ابن جريج فقال جعفر بن عمرو، وقال عمرو بن حية وقال أخبراه عن عبد الرحمن بن عوف وعن رجال من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " The tradition mentioned above (No.3299) has also been transmitted by Umar ibn Abd al-Rahman ibn Awf on the authority of his father and the Companions of the Prophet (ﷺ). This version has:                      \"The Prophet (ﷺ) said: By Him Who sent Muhammad with truth, if you prayed here, this would be sufficient for you like the prayer in Jerusalem.\"Abu Dawud said: This tradition has also been transmitted by al-Ansari, from Ibn-Juraij. He said: Ja'far b. 'Umar and 'Amr b. Hayyah. He said: They transmitted from 'Abd al-Rahman b. 'Awf and from the Companions of the Prophet (ﷺ).",
      "chain": [
        "30567",
        "20241",
        "20229",
        "11070",
        "12062",
        "3",
        "10560"
      ]
    }
  ],
  "total_hadiths": 1
}