{
  "id": "12135",
  "name": "Sa'id bin Sm'an al-Ansari سعيد بن سمعان الأنصاري الزرقي",
  "full_name": "Sa'id bin Sm'an al-Ansari سعيد بن سمعان الأنصاري الزرقي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "B.Zurayq",
      "Client",
      "al-Azdi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-753",
      "hadith_no": "753",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن أبي ذئب، عن سعيد بن سمعان، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا دخل في الصلاة رفع يديه مدا ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) began his prayer, he raised his hands extensively.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20177",
        "12135",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-239",
      "hadith_no": "239",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، وأبو سعيد الأشج قالا حدثنا يحيى بن اليمان، عن ابن أبي ذئب، عن سعيد بن سمعان، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا كبر للصلاة نشر أصابعه ‏.‏ قال أبو عيسى حديث أبي هريرة حسن ‏.‏ وقد روى غير واحد هذا الحديث عن ابن أبي ذئب عن سعيد بن سمعان عن أبي هريرة أن النبي صلى الله عليه وسلم كان إذا دخل في الصلاة رفع يديه مدا ‏.‏ وهذا أصح من رواية يحيى بن اليمان وأخطأ يحيى بن اليمان في هذا الحديث ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"When Allah's Messenger performed the Takbir for Salat he would spread his fingers.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30200",
        "20177",
        "12135",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-240",
      "hadith_no": "240",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال وحدثنا عبد الله بن عبد الرحمن، أخبرنا عبيد الله بن عبد المجيد الحنفي، حدثنا ابن أبي ذئب، عن سعيد بن سمعان، قال سمعت أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة رفع يديه مدا ‏.‏ قال أبو عيسى قال عبد الله بن عبد الرحمن وهذا أصح من حديث يحيى بن اليمان وحديث يحيى بن اليمان خطأ ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"When Allah's Messenger would enter the Salat he would raise his hands while they were extended.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20177",
        "12135",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-883",
      "hadith_no": "883",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن أبي ذئب، قال حدثنا سعيد بن سمعان، قال جاء أبو هريرة إلى مسجد بني زريق فقال ثلاث كان رسول الله صلى الله عليه وسلم يعمل بهن تركهن الناس كان يرفع يديه في الصلاة مدا ويسكت هنيهة ويكبر إذا سجد وإذا رفع ‏.‏",
      "text_en": " Sa'eed bin Sam'an said Abu Hurairah came to the Masjid of Banu Zuraiq and said:                     \"There are three things that the Messenger of Allah (ﷺ) used to do and the people have abandoned; he used to raise his hands extended when praying, and he would fall silent briefly, and say takbir when he prostrated and when he sat up.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20177",
        "12135"
      ]
    }
  ],
  "total_hadiths": 4
}