{
  "id": "12153",
  "name": "Salmah bin Muhammad bin 'Ammar سلمة بن محمد بن عمار",
  "full_name": "Salmah bin Muhammad bin 'Ammar سلمة بن محمد بن عمار",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  ق  -  مجهول ]"
    ],
    "tags": [
      "al-'Ansi",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "18946",
      "name": "Muhammad bin 'Ammar bin Yasir محمد بن عمار بن ياسر العنسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "10664",
      "name": "'Ali bin Zayd bin 'Abdullah bin Zuhayr علي بن زيد بن عبد الله بن زهير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-54",
      "hadith_no": "54",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، وداود بن شبيب، قالا حدثنا حماد، عن علي بن زيد، عن سلمة بن محمد بن عمار بن ياسر، قال موسى عن أبيه، - وقال داود عن عمار بن ياسر، - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الفطرة المضمضة والاستنشاق ‏\"‏ ‏.‏ فذكر نحوه ولم يذكر إعفاء اللحية وزاد ‏\"‏ والختان ‏\"‏ ‏.‏ قال ‏\"‏ والانتضاح ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ انتقاص الماء ‏\"‏ ‏.‏ يعني الاستنجاء ‏.‏ قال أبو داود وروي نحوه عن ابن عباس وقال خمس كلها في الرأس وذكر فيها الفرق ولم يذكر إعفاء اللحية ‏.‏ قال أبو داود وروي نحو حديث حماد عن طلق بن حبيب ومجاهد وعن بكر بن عبد الله المزني قولهم ولم يذكروا إعفاء اللحية ‏.‏ وفي حديث محمد بن عبد الله بن أبي مريم عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم فيه وإعفاء اللحية وعن إبراهيم النخعي نحوه وذكر إعفاء اللحية والختان ‏.‏",
      "text_en": " Narrated Ammar b. Yasir:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) said : The rinsing of mouth and snuffing up water in the nose are acts that bear the characteristics of fitrah (nature). He then narrated a similar tradition (as reported by Aishah), but he did not mention the words \"letting the beard grow\". He added the words \"circumcision\" and \"sprinkling  water on the private part of the body\". He did not mention the words \"cleansing oneself after easing\".Abu Dawud said : A similar tradition has been reported on the authority of Ibn 'Abbas. He mentioned only five sunnahs all relating to the head, one of them being parting of the hair; it did not include wearing the beard.Abu Dawud said: The tradition as reported by Hammad has also been transmitted by Talq b. Habib , Mujahid, and Bakr b. 'Abd Allaah b. al-Muzani as their own statement ( not as a tradition from the Prophet, sal Allaahu alayhi wa sallam ).They did not mention the words \"letting the beard grow\". The version transmitted by Muhammad b. Abd Allaah b. Abi Maryam, Abu Salamah, and Abu Hurairah from the Prophet ( sal Allaahu alayhi wa sallam ) mentions the words \"letting the beard grow\". A similar tradition has been reported by Ibrahim al-Nakha'i. He mentioned the words \"wearing the beard and circumcision.\"",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20228",
        "20022",
        "10664",
        "12153",
        "20040",
        "25"
      ]
    },
    {
      "id": "sunan-ibn-majah-309",
      "hadith_no": "309",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سهل بن أبي سهل، ومحمد بن يحيى، قالا حدثنا أبو الوليد، حدثنا حماد، عن علي بن زيد، عن سلمة بن محمد بن عمار بن ياسر، عن عمار بن ياسر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من الفطرة المضمضة والاستنشاق والسواك وقص الشارب وتقليم الأظفار ونتف الإبط والاستحداد وغسل البراجم والانتضاح والاختتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ammar bin Yasir that:                     The Messenger of Allah said: \"Part of the Fitrah is rinsing out the mouth, rinsing out the nostrils, using the tooth stick, trimming the mustache, clipping the nails, plucking the armpit hairs, shaving the pubic hairs, washing the joints, washing the private parts and circumcision.'\" (Da'if)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "38259",
        "11222",
        "20296",
        "20022",
        "10664",
        "12153",
        "25"
      ]
    }
  ],
  "total_hadiths": 2
}