{
  "id": "12186",
  "name": "Safwan bin Abi Yazid صفوان بن أبي يزيد ويقال بن سليم",
  "full_name": "Safwan bin Abi Yazid صفوان بن أبي يزيد ويقال بن سليم",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ بخ  س  -  مقبول ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11409",
      "name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3110",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن سهيل، عن صفوان بن أبي يزيد، عن القعقاع بن اللجلاج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد أبدا ولا يجتمع الشح والإيمان في قلب عبد أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in the lungs of a slave, and the stinginess and faith can never be combined in a slave's heart.\"",
      "chain": [
        "30123",
        "20028",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3112",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني محمد بن عامر، قال حدثنا منصور بن سلمة، قال أنبأنا الليث بن سعد، عن ابن الهاد، عن سهيل بن أبي صالح، عن صفوان بن أبي يزيد، عن القعقاع بن اللجلاج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد ولا يجتمع الشح والإيمان في جوف عبد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in a slave's lungs, and stinginess and faith can never be combined in a slave's heart.'\"",
      "chain": [
        "38522",
        "20023",
        "11234",
        "11173",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3113",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عرعرة بن البرند، وابن أبي عدي، قالا حدثنا محمد بن عمرو، عن صفوان بن أبي يزيد، عن حصين بن اللجلاج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله عز وجل ودخان جهنم في منخرى مسلم أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"The dust in the cause of Allah, the Mighty and Sublime, and the smoke of Hell will never be combined in the nostrils of a Muslim.\"",
      "chain": [
        "30153",
        "24315",
        "20276",
        "11220",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3114",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني شعيب بن يوسف، قال حدثنا يزيد بن هارون، عن محمد بن عمرو، عن صفوان بن أبي يزيد، عن حصين بن اللجلاج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في منخرى مسلم ولا يجتمع شح وإيمان في قلب رجل مسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'The dust in the cause of Allah and the smoke of Hell will never be combined in the nostrils of a Muslim, and stinginess and faith will never be combined in a Muslim man's heart.'\"",
      "chain": [
        "20472",
        "11220",
        "12186",
        "13"
      ]
    },
    {
      "hadith_no": "3115",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن عبيد الله بن أبي جعفر، عن صفوان بن أبي يزيد، عن أبي العلاء بن اللجلاج، أنه سمع أبا هريرة، يقول لا يجمع الله عز وجل غبارا في سبيل الله ودخان جهنم في جوف امرئ مسلم ولا يجمع الله في قلب امرئ مسلم الإيمان بالله والشح جميعا ‏.‏",
      "text_en": " It was narrated from Abu Al-'Ala' bin Al-Lajlaj that he heard Abu Hurairah say:                      \"Allah will never combine the dust in the cause of Allah, the Mighty and Sublime, and the smoke of Hell, in the lungs of a Muslim man, and Allah will never combine faith in Allah, and stinginess in the heart of a Muslim man.\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11409",
        "12186",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}