{
  "id": "12180",
  "name": "Salah bin Rabi'ya bin al-Hdyr صالح بن ربيعة بن الهدير التيمي المدني",
  "full_name": "Salah bin Rabi'ya bin al-Hdyr صالح بن ربيعة بن الهدير التيمي المدني",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ س  -  مقبول ]"
    ],
    "tags": [
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2043",
      "hadith_no": "2043",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا حامد بن يحيى، حدثنا محمد بن معن المديني، أخبرني داود بن خالد، عن ربيعة بن أبي عبد الرحمن، عن ربيعة، - يعني ابن الهدير - قال ما سمعت طلحة بن عبيد الله، يحدث عن رسول الله صلى الله عليه وسلم حديثا قط غير حديث واحد ‏.‏ قال قلت وما هو قال خرجنا مع رسول الله صلى الله عليه وسلم يريد قبور الشهداء حتى إذا أشرفنا على حرة واقم فلما تدلينا منها وإذا قبور بمحنية قال قلنا يا رسول الله أقبور إخواننا هذه قال ‏\"‏ قبور أصحابنا ‏\"‏ ‏.‏ فلما جئنا قبور الشهداء قال ‏\"‏ هذه قبور إخواننا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rabi'ah ibn al-Hudayr:                     Rabi'ah ibn al-Hudayr said: I did not hear Talhah ibn Ubaydullah narrating any tradition from the Messenger of Allah (ﷺ) except one tradition. I (Rabi'ah ibn AbuAbdurRahman) asked: What is that? He said: We went out along with the Messenger of Allah (ﷺ) who was going to visit the graves of the martyrs. When we ascended Harrah Waqim, and then descended from it, we found there some graves at the turning of the valley. We asked: Messenger of Allah, are these the graves of our brethren? He replied: Graves of our companions. When we came to the graves of martyrs, he said: These are the graves of our brethren.",
      "usc_msa_ref": "",
      "chain": [
        "20180",
        "11162",
        "12180",
        "6"
      ]
    }
  ],
  "total_hadiths": 1
}