{
  "id": "123",
  "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
  "full_name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "53",
      "date_gregorian": "673",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Kufa",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "B.Khuza'",
      "Non-Quraish"
    ]
  },
  "parents": [
    {
      "id": "3100",
      "name": "Husain b. 'Ubayd b. Khalaf ( حصين بن عبيد بن خلف الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "3150",
      "name": "Khirniq bint Hussain bin 'Ubayd ( خرنيق بنت الحصين بن عبيد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "19073",
      "name": "Njyd bin 'Imran bin Husayn نجيد بن عمران",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3120",
      "name": "Ma'qil bin Yasar al-Mazni ( معقل بن يسار المزني البصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19073",
      "name": "Njyd bin 'Imran bin Husayn نجيد بن عمران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11114",
      "name": "Abu al-Aswad al-Du'ali أبو الأسود الديلي/الدؤلي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11318",
      "name": "Yazid bin 'Abdullah bin al-Shakhayr يزيد بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10677",
      "name": "al-Hakam bin 'Abdullah al-A'raj الحكم بن عبد الله بن إسحاق الأعرج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11589",
      "name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11693",
      "name": "Safwan bin Mhrz bin Ziyad صفوان بن محرز بن زياد المازني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11865",
      "name": "'Abdullah bin Rbah عبد الله بن رباح الأنصاري أبو خالد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10735",
      "name": "Abu Qtad'h al-Dwy al-'Abbassri أبو قتادة العدوي البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11617",
      "name": "Abu al-Swar al-Dwy al-'Abbassri أبو السوار العدوي البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10736",
      "name": "Abu al-Mahlab al-Jarmi أبو المهلب الجرمي البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11284",
      "name": "Zararah bin Awfa al-'Amiri al-Harshi زرارة بن أوفى العامري الحرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "344",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسدد، قال حدثني يحيى بن سعيد، قال حدثنا عوف، قال حدثنا أبو رجاء، عن عمران، قال كنا في سفر مع النبي صلى الله عليه وسلم وإنا أسرينا، حتى كنا في آخر الليل، وقعنا وقعة ولا وقعة أحلى عند المسافر منها، فما أيقظنا إلا حر الشمس، وكان أول من استيقظ فلان ثم فلان ثم فلان  يسميهم أبو رجاء فنسي عوف  ثم عمر بن الخطاب الرابع، وكان النبي صلى الله عليه وسلم إذا نام لم يوقظ حتى يكون هو يستيقظ، لأنا لا ندري ما يحدث له في نومه، فلما استيقظ عمر، ورأى ما أصاب الناس، وكان رجلا جليدا، فكبر ورفع صوته بالتكبير، فما زال يكبر ويرفع صوته بالتكبير حتى استيقظ لصوته النبي صلى الله عليه وسلم فلما استيقظ شكوا إليه الذي أصابهم قال ‏\"‏ لا ضير  أو لا يضير  ارتحلوا ‏\"‏‏.‏ فارتحل فسار غير بعيد ثم نزل، فدعا بالوضوء، فتوضأ ونودي بالصلاة فصلى بالناس، فلما انفتل من صلاته إذا هو برجل معتزل لم يصل مع القوم قال ‏\"‏ ما منعك يا فلان أن تصلي مع القوم ‏\"‏‏.‏ قال أصابتني جنابة ولا ماء‏.‏ قال ‏\"‏ عليك بالصعيد، فإنه يكفيك ‏\"‏‏.‏ ثم سار النبي صلى الله عليه وسلم فاشتكى إليه الناس من العطش فنزل، فدعا فلانا  كان يسميه أبو رجاء نسيه عوف  ودعا عليا فقال ‏\"‏ اذهبا فابتغيا الماء ‏\"‏‏.‏ فانطلقا فتلقيا امرأة بين مزادتين  أو سطيحتين  من ماء على بعير لها، فقالا لها أين الماء قالت عهدي بالماء أمس هذه الساعة، ونفرنا خلوفا‏.‏ قالا لها انطلقي إذا‏.‏ قالت إلى أين قالا إلى رسول الله صلى الله عليه وسلم‏.‏ قالت الذي يقال له الصابئ قالا هو الذي تعنين فانطلقي‏.‏ فجاءا بها إلى النبي صلى الله عليه وسلم وحدثاه الحديث قال فاستنزلوها عن بعيرها ودعا النبي صلى الله عليه وسلم بإناء، ففرغ فيه من أفواه المزادتين  أو السطيحتين  وأوكأ أفواههما، وأطلق العزالي، ونودي في الناس اسقوا واستقوا‏.‏ فسقى من شاء، واستقى من شاء، وكان آخر ذاك أن أعطى الذي أصابته الجنابة إناء من ماء قال ‏\"‏ اذهب، فأفرغه عليك ‏\"‏‏.‏ وهى قائمة تنظر إلى ما يفعل بمائها، وايم الله لقد أقلع عنها، وإنه ليخيل إلينا أنها أشد ملأة منها حين ابتدأ فيها، فقال النبي صلى الله عليه وسلم ‏\"‏ اجمعوا لها ‏\"‏‏.‏ فجمعوا لها من بين عجوة ودقيقة وسويقة، حتى جمعوا لها طعاما، فجعلوها في ثوب، وحملوها على بعيرها، ووضعوا الثوب بين يديها قال لها ‏\"‏ تعلمين ما رزئنا من مائك شيئا، ولكن الله هو الذي أسقانا ‏\"‏‏.‏ فأتت أهلها، وقد احتبست عنهم قالوا ما حبسك يا فلانة قالت العجب، لقيني رجلان فذهبا بي إلى هذا الذي يقال له الصابئ، ففعل كذا وكذا، فوالله إنه لأسحر الناس من بين هذه وهذه‏.‏ وقالت بإصبعيها الوسطى والسبابة، فرفعتهما إلى السماء  تعني السماء والأرض  أو إنه لرسول الله حقا، فكان المسلمون بعد ذلك يغيرون على من حولها من المشركين، ولا يصيبون الصرم الذي هي منه، فقالت يوما لقومها ما أرى أن هؤلاء القوم يدعونكم عمدا، فهل لكم في الإسلام فأطاعوها فدخلوا في الإسلام‏.‏",
      "text_en": " Narrated `Imran:                     Once we were traveling with the Prophet and we carried on traveling till the last part of the night and then we (halted at a place) and slept (deeply). There is nothing sweeter than sleep for a traveler in the last part of the night. So it was only the heat of the sun that made us to wake up and the first to wake up was so and so, then so and so and then so and so (the narrator `Auf said that Abu Raja' had told him their names but he had forgotten them) and the fourth person to wake up was `Umar bin Al- Khattab. And whenever the Prophet used to sleep, nobody would wake up him till he himself used to get up as we did not know what was happening (being revealed) to him in his sleep. So, `Umar got up and saw the condition of the people, and he was a strict man, so he said, \"Allahu Akbar\" and raised his voice with Takbir, and kept on saying loudly till the Prophet got up because of it. When he got up, the people informed him about what had happened to them. He said, \"There is no harm (or it will not be harmful). Depart!\" So they departed from that place, and after covering some distance the Prophet stopped and asked for some water to perform the ablution. So he performed the ablution and the call for the prayer was pronounced and he led the people in prayer. After he finished from the prayer, he saw a man sitting aloof who had not prayed with the people. He asked, \"O so and so! What has prevented you from praying with us?\" He replied, \"I am Junub and there is no water. \" The Prophet said, \"Perform Tayammum with (clean) earth and that is sufficient for you.\" Then the Prophet proceeded on and the people complained to him of thirst. Thereupon he got down and called a person (the narrator `Auf added that Abu Raja' had named him but he had forgotten) and `Ali, and ordered them to go and bring water. So they went in search of water and met a woman who was sitting on her camel between two bags of water. They asked, \"Where can we find water?\" She replied, \"I was there (at the place of water) this hour yesterday and my people are behind me.\" They requested her to accompany them. She asked, \"Where?\" They said, \"To Allah's Apostle .\" She said, \"Do you mean the man who is called the Sabi, (with a new religion)?\" They replied, \"Yes, the same person. So come along.\" They brought her to the Prophet and narrated the whole story. He said, \"Help her to dismount.\" The Prophet asked for a pot, then he opened the mouths of the bags and poured some water into the pot. Then he closed the big openings of the bags and opened the small ones and the people were called upon to drink and water their animals. So they all watered their animals and they (too) all quenched their thirst and also gave water to others and last of all the Prophet gave a pot full of water to the person who was Junub and told him to pour it over his body. The woman was standing and watching all that which they were doing with her water. By Allah, when her water bags were returned the looked like as if they were more full (of water) than they had been before (Miracle of Allah's Apostle) Then the Prophet ordered us to collect something for her; so dates, flour and Sawiq were collected which amounted to a good meal that was put in a piece of cloth. She was helped to ride on her camel and that cloth full of foodstuff was also placed in front of her and then the Prophet said to her, \"We have not taken your water but Allah has given water to us.\" She returned home late. Her relatives asked her: \"O so and so what has delayed you?\" She said, \"A strange thing! Two men met me and took me to the man who is called the Sabi' and he did such and such a thing. By Allah, he is either the greatest magician between this and this (gesturing with her index and middle fingers raising them towards the sky indicating the heaven and the earth) or he is Allah's true Apostle.\" Afterwards the Muslims used to attack the pagans around her abode but never touched her village. One day she said to her people, \"I think that these people leave you purposely. Have you got any inclination to Islam?\" They obeyed her and all of them embraced Islam. Abu `Abdullah said: The word Saba'a means \"The one who has deserted his old religion and embraced a new religion.\" Abul 'Ailya [??] said, \"The S`Abis are a sect of people of the Scripture who recite the Book of Psalms.\"",
      "chain": [
        "30175",
        "20031",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا عوف، عن أبي رجاء، قال حدثنا عمران بن حصين الخزاعي، أن رسول الله صلى الله عليه وسلم رأى رجلا معتزلا لم يصل في القوم فقال ‏\"‏ يا فلان ما منعك أن تصلي في القوم ‏\"‏‏.‏ فقال يا رسول الله، أصابتني جنابة ولا ماء‏.‏ قال ‏\"‏ عليك بالصعيد فإنه يكفيك ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain Al-Khuza`i:                     Allah's Apostle saw a person sitting aloof and not praying with the people. He asked him, \"O so and so! What prevented you from offering the prayer with the people?\" He replied, \"O Allah's Apostle! I am Junub and there is no water.\" The Prophet said, \"Perform Tayammum with clean earth and that will be sufficient for you.\"",
      "chain": [
        "30349",
        "20025",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "784",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن أبي العلاء، عن مطرف، عن عمران بن حصين، قال صلى مع علي  رضى الله عنه  بالبصرة فقال ذكرنا هذا الرجل صلاة كنا نصليها مع رسول الله صلى الله عليه وسلم‏.‏ فذكر أنه كان يكبر كلما رفع وكلما وضع‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     I offered the prayer with `Ali in Basra and he made us remember the prayer which we used to pray with Allah's Apostle. `Ali said Takbir on each rising and bowing.",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "1115",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق بن منصور، قال أخبرنا روح بن عبادة، أخبرنا حسين، عن عبد الله بن بريدة، عن عمران بن حصين  رضى الله عنه  أنه سأل نبي الله صلى الله عليه وسلم‏.‏ أخبرنا إسحاق قال أخبرنا عبد الصمد قال سمعت أبي قال حدثنا الحسين عن ابن بريدة قال حدثني عمران بن حصين  وكان مبسورا  قال سألت رسول الله صلى الله عليه وسلم عن صلاة الرجل قاعدا فقال ‏\"‏ إن صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     (who had piles) I asked Allah's Apostle about the praying of a man while sitting. He said, \"If he prays while standing it is better and he who prays while sitting gets half the reward of that who prays standing; and whoever prays while Lying gets half the reward of that who prays while sitting.\"",
      "chain": [
        "30313",
        "20229",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، قال حدثنا حسين المعلم، عن عبد الله بن بريدة، أن عمران بن حصين  وكان رجلا مبسورا  وقال أبو معمر مرة عن عمران، قال سألت النبي صلى الله عليه وسلم عن صلاة الرجل وهو قاعد فقال ‏\"‏ من صلى قائما فهو أفضل، ومن صلى قاعدا فله نصف أجر القائم، ومن صلى نائما فله نصف أجر القاعد ‏\"‏‏.‏ قال أبو عبد الله نائما عندي مضطجعا ها هنا‏.‏",
      "text_en": " Narrated `Abdullah bin Buraida:                     `Imran bin Husain had piles. Once Abu Ma mar narrated from `Imran bin Husain had said, \"I asked the Prophet (p.b.u.h) about the prayer of a person while sitting. He said, 'It is better for one to pray standing; and whoever prays sitting gets half the reward of that who prays while standing; and whoever prays while Lying gets half the reward of that who prays while sitting.' \"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "123",
        "123"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبدان، عن عبد الله، عن إبراهيم بن طهمان، قال حدثني الحسين المكتب، عن ابن بريدة، عن عمران بن حصين  رضى الله عنه  قال كانت بي بواسير فسألت النبي صلى الله عليه وسلم عن الصلاة فقال ‏\"‏ صل قائما، فإن لم تستطع فقاعدا، فإن لم تستطع فعلى جنب ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     had piles, so I asked the Prophet about the prayer. He said, \"Pray while standing and if you can't, pray while sitting and if you cannot do even that, then pray Lying on your side.\"",
      "chain": [
        "30349",
        "20025",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1596",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، قال حدثني مطرف، عن عمران  رضى الله عنه  قال تمتعنا على عهد رسول الله صلى الله عليه وسلم فنزل القرآن قال رجل برأيه ما شاء‏.‏",
      "text_en": " Narrated `Imran:                     We performed Hajj-at-Tamattu` in the lifetime of Allah's Apostle and then the Qur'an was revealed (regarding Hajj-at-Tamattu`) and somebody said what he wished (regarding Hajj-at-Tamattu`) according his own opinion.",
      "chain": [
        "20040",
        "20297",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "1983",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي، عن غيلان،‏.‏ وحدثنا أبو النعمان، حدثنا مهدي بن ميمون، حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه سأله  أو سأل رجلا وعمران يسمع  فقال ‏\"‏ يا أبا فلان أما صمت سرر هذا الشهر ‏\"‏‏.‏ قال أظنه قال يعني رمضان‏.‏ قال الرجل لا يا رسول الله‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏‏.‏ لم يقل الصلت أظنه يعني رمضان‏.‏ قال أبو عبد الله وقال ثابث عن مطرف عن عمران عن النبي صلى الله عليه وسلم ‏\"‏ من سرر شعبان ‏\"‏‏.‏",
      "text_en": " Narrated Mutarrif from `Imran Ibn Husain:                     That the Prophet asked him (Imran) or asked a man and `Imran was listening, \"O Abu so-and-so! Have you fasted the last days of this month?\" (The narrator thought that he said, \"the month of Ramadan\"). The man replied, \"No, O Allah's Apostle!\" The Prophet said to him, \"When you finish your fasting (of Ramadan) fast two days (in Shawwal).\" Through another series of narrators `Imran said, \"The Prophet said, '(Have you fasted) the last days of Sha'ban?\"",
      "chain": [
        "30140",
        "11307",
        "20283",
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "2651",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا أبو جمرة، قال سمعت زهدم بن مضرب، قال سمعت عمران بن حصين  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ‏\"‏‏.‏ قال عمران لا أدري أذكر النبي صلى الله عليه وسلم بعد قرنين أو ثلاثة‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إن بعدكم قوما يخونون ولا يؤتمنون، ويشهدون، ولا يستشهدون وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudrab:                     I heard `Imran bin Husain saying, \"The Prophet said, 'The best people are those living in my generation, then those coming after them, and then those coming after (the second generation).\" `Imran said \"I do not know whether the Prophet mentioned two or three generations after your present generation. The Prophet added, 'There will be some people after you, who will be dishonest and will not be trustworthy and will give witness (evidences) without being asked to give witness, and will vow but will not fulfill their vows, and fatness will appear among them.\"",
      "chain": [
        "20404",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن جامع بن شداد، عن صفوان بن محرز، عن عمران بن حصين  رضى الله عنهما  قال جاء نفر من بني تميم إلى النبي صلى الله عليه وسلم فقال ‏\"‏ يا بني تميم، أبشروا ‏\"‏‏.‏ قالوا بشرتنا فأعطنا‏.‏ فتغير وجهه، فجاءه أهل اليمن، فقال ‏\"‏ يا أهل اليمن، اقبلوا البشرى إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قبلنا‏.‏ فأخذ النبي صلى الله عليه وسلم يحدث بدء الخلق والعرش، فجاء رجل فقال يا عمران، راحلتك تفلتت، ليتني لم أقم‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     Some people of Bani Tamim came to the Prophet and he said (to them), \"O Bani Tamim! rejoice with glad tidings.\" They said, \"You have given us glad tidings, now give us something.\" On hearing that the color of his face changed then the people of Yemen came to him and he said, \"O people of Yemen ! Accept the good tidings, as Bani Tamim has refused them.\" The Yemenites said, \"We accept them. Then the Prophet started taking about the beginning of creation and about Allah's Throne. In the mean time a man came saying, \"O `Imran! Your she-camel has run away!'' (I got up and went away), but l wish I had not left that place (for I missed what Allah's Apostle had said).",
      "chain": [
        "28531",
        "20012",
        "11328",
        "11693",
        "123"
      ]
    },
    {
      "hadith_no": "3191",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا جامع بن شداد، عن صفوان بن محرز، أنه حدثه عن عمران بن حصين  رضى الله عنهما  قال دخلت على النبي صلى الله عليه وسلم وعقلت ناقتي بالباب، فأتاه ناس من بني تميم فقال ‏\"‏ اقبلوا البشرى يا بني تميم ‏\"‏‏.‏ قالوا قد بشرتنا فأعطنا‏.‏ مرتين، ثم دخل عليه ناس من أهل اليمن فقال ‏\"‏ اقبلوا البشرى يا أهل اليمن، إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قد قبلنا يا رسول الله، قالوا جئناك نسألك عن هذا الأمر قال ‏\"‏ كان الله ولم يكن شىء غيره، وكان عرشه على الماء، وكتب في الذكر كل شىء، وخلق السموات والأرض ‏\"‏‏.‏ فنادى مناد ذهبت ناقتك يا ابن الحصين‏.‏ فانطلقت فإذا هي يقطع دونها السراب، فوالله لوددت أني كنت تركتها‏.‏",
      "text_en": "     Narrated Imran bin Husain:                       I went to the Prophet and tied my she-camel at the gate. The people of Bani Tamim came to the Prophet who said \"O Bani Tamim! Accept the good tidings.\" They said twice, 'You have given us the good tidings, now give us something\" Then some Yemenites came to him and he said, \"Accept the good tidings, O people of Yemem, for Bani Tamim refused them.\" They said, \"We accept it, O Allah's Apostle! We have come to ask you about this matter (i.e. the start of creations).\" He said, \"First of all, there was nothing but Allah, and (then He created His Throne). His throne was over the water, and He wrote everything in the Book (in the Heaven) and created the Heavens and the Earth.\" Then a man shouted, \"O Ibn Husain! Your she-camel has gone away!\" So, I went away and could not see the she-camel because of the mirage. By Allah, I wished I had left that she-camel (but not that gathering).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11328",
        "11693",
        "123"
      ]
    },
    {
      "hadith_no": "3241",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو الوليد، حدثنا سلم بن زرير، حدثنا أبو رجاء، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The Prophet said, \"I looked at Paradise and found poor people forming the majority of its inhabitants; and I looked at Hell and saw that the majority of its inhabitants were women.\"",
      "chain": [
        "20296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إسحاق، حدثنا النضر، أخبرنا شعبة، عن أبي جمرة، سمعت زهدم بن مضرب، سمعت عمران بن حصين  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي قرني ثم الذين يلونهم ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فلا أدري أذكر بعد قرنه قرنين أو ثلاثا ‏\"‏ ثم إن بعدكم قوما يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     \"Allah's Apostle said, 'The best of my followers are those living in my generation (i.e. my contemporaries). and then those who will follow the latter\" `Imran added, \"I do not remember whether he mentioned two or three generations after his generation, then the Prophet added, 'There will come after you, people who will bear witness without being asked to do so, and will be treacherous and untrustworthy, and they will vow and never fulfill their vows, and fatness will appear among them.\"",
      "chain": [
        "30312",
        "20291",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "4408",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن أبي صخرة، عن صفوان بن محرز المازني، عن عمران بن حصين  رضى الله عنهما  قال أتى نفر من بني تميم النبي صلى الله عليه وسلم فقال ‏\"‏ اقبلوا البشرى يا بني تميم ‏\"‏‏.‏ قالوا يا رسول الله قد بشرتنا فأعطنا‏.‏ فريء ذلك في وجهه فجاء نفر من اليمن فقال ‏\"‏ اقبلوا البشرى إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قد قبلنا يا رسول الله‏.‏",
      "text_en": " Narrated `Imran bin Hussein:                     A delegation from Banu Tamim came to the Prophet . The Prophet said, \"Accept the good tidings, O Banu Tamim!\" They said, \"O Allah's Apostle! You have given us good tidings, so give us (something).\" Signs of displeasure appeared on his face. Then another delegation from Yemen came and he said (to them), \"Accept the good tidings, for Banu Tamim refuses to accept them.\" They replied, \"We have accepted them, O Allah's Apostle!\"",
      "chain": [
        "20348",
        "20012",
        "11693",
        "123"
      ]
    },
    {
      "hadith_no": "4429",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، حدثنا سفيان، حدثنا أبو صخرة، جامع بن شداد حدثنا صفوان بن محرز المازني، حدثنا عمران بن حصين، قال جاءت بنو تميم إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أبشروا يا بني تميم ‏\"‏‏.‏ قالوا أما إذ بشرتنا فأعطنا‏.‏ فتغير وجه رسول الله صلى الله عليه وسلم، فجاء ناس من أهل اليمن، فقال النبي صلى الله عليه وسلم ‏\"‏ اقبلوا البشرى إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قد قبلنا يا رسول الله‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The people of Banu Tamim came to Allah's Apostle, and he said, \"Be glad (i.e. have good tidings). O Banu Tamim!\" They said, \"As you have given us good tidings then give us (some material things).\" On that the features of Allah's Apostle changed (i.e. he took it ill). Then some people from Yemen came, and the Prophet said (to them) \"Accept good tidings as Banu Tamim have not accepted them.\" They said, \"We accept them, O Allah's Apostle!\"",
      "chain": [
        "30153",
        "20241",
        "20012",
        "11328",
        "11693",
        "123"
      ]
    },
    {
      "hadith_no": "4559",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عمران أبي بكر، حدثنا أبو رجاء، عن عمران بن حصين  رضى الله عنهما  قال أنزلت آية المتعة في كتاب الله ففعلناها مع رسول الله صلى الله عليه وسلم، ولم ينزل قرآن يحرمه، ولم ينه عنها حتى مات قال رجل برأيه ما شاء‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The Verse of Hajj-at-Tamatu was revealed in Allah's Book, so we performed it with Allah's Apostle, and nothing was revealed in Qur'an to make it illegal, nor did the Prophet prohibit it till he died. But the man (who regarded it illegal) just expressed what his own mind suggested.",
      "chain": [
        "30175",
        "20031",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "5253",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن أبي رجاء، عن عمران، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار، فرأيت أكثر أهلها النساء ‏\"‏‏.‏ تابعه أيوب وسلم بن زرير‏.‏",
      "text_en": " Narrated `Imran:                     The Prophet said, \"I looked at Paradise and saw that the majority of its residents were the poor; and I looked at the (Hell) Fire and saw that the majority of its residents were women.\"",
      "chain": [
        "30151",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "5767",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا حصين، عن عامر، عن عمران بن حصين  رضى الله عنهما  قال لا رقية إلا من عين أو حمة‏.‏ فذكرته لسعيد بن جبير فقال حدثنا ابن عباس قال رسول الله صلى الله عليه وسلم ‏\"‏ عرضت على الأمم، فجعل النبي والنبيان يمرون معهم الرهط، والنبي ليس معه أحد، حتى رفع لي سواد عظيم، قلت ما هذا أمتي هذه قيل هذا موسى وقومه‏.‏ قيل انظر إلى الأفق‏.‏ فإذا سواد يملأ الأفق، ثم قيل لي انظر ها هنا وها هنا في آفاق السماء فإذا سواد قد ملأ الأفق قيل هذه أمتك ويدخل الجنة من هؤلاء سبعون ألفا بغير حساب، ثم دخل ولم يبين لهم فأفاض القوم وقالوا نحن الذين آمنا بالله، واتبعنا رسوله، فنحن هم أو أولادنا الذين ولدوا في الإسلام فإنا ولدنا في الجاهلية‏.‏ فبلغ النبي صلى الله عليه وسلم فخرج فقال هم الذين لا يسترقون، ولا يتطيرون، ولا يكتوون وعلى ربهم يتوكلون ‏\"‏‏.‏ فقال عكاشة بن محصن أمنهم أنا يا رسول الله قال ‏\"‏ نعم ‏\"‏‏.‏ فقام آخر فقال أمنهم أنا قال ‏\"‏ سبقك عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, 'Nations were displayed before me; one or two prophets would pass by along with a few followers. A prophet would pass by accompanied by nobody. Then a big crowd of people passed in front of me and I asked, Who are they Are they my followers?\" It was said, 'No. It is Moses and his followers It was said to me, 'Look at the horizon.'' Behold! There was a multitude of people filling the horizon. Then it was said to me, 'Look there and there about the stretching sky! Behold! There was a multitude filling the horizon,' It was said to me, 'This is your nation out of whom seventy thousand shall enter Paradise without reckoning.' \"Then the Prophet entered his house without telling his companions who they (the 70,000) were. So the people started talking about the issue and said, \"It is we who have believed in Allah and followed His Apostle; therefore those people are either ourselves or our children who are born m the Islamic era, for we were born in the Pre-lslamic Period of Ignorance.'' When the Prophet heard of that, he came out and said. \"Those people are those who do not treat themselves with Ruqya, nor do they believe in bad or good omen (from birds etc.) nor do they get themselves branded (Cauterized). but they put their trust (only) in their Lord \" On that 'Ukasha bin Muhsin said. \"Am I one of them, O Allah's Apostle?' The Prophet said, \"Yes.\" Then another person got up and said, \"Am I one of them?\" The Prophet said, 'Ukasha has anticipated you.\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11052",
        "123"
      ]
    },
    {
      "hadith_no": "6185",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن قتادة، عن أبي السوار العدوي، قال سمعت عمران بن حصين، قال قال النبي صلى الله عليه وسلم ‏\"‏ الحياء لا يأتي إلا بخير ‏\"‏‏.‏ فقال بشير بن كعب مكتوب في الحكمة إن من الحياء وقارا، وإن من الحياء سكينة‏.‏ فقال له عمران أحدثك عن رسول الله صلى الله عليه وسلم وتحدثني عن صحيفتك‏.‏",
      "text_en": " Narrated Abu As-Sawar Al-Adawi:                     `Imran bin Husain said: The Prophet said, \"Haya' (pious shyness from committing religeous indiscretions) does not bring anything except good.\" Thereupon Bashir bin Ka`b said, 'It is written in the wisdom paper: Haya' leads to solemnity; Haya' leads to tranquility (peace of mind).\" `Imran said to him, \"I am narrating to you the saying of Allah's Apostle and you are speaking about your paper (wisdom book)?\"",
      "chain": [
        "20404",
        "20020",
        "11019",
        "11617",
        "123"
      ]
    },
    {
      "hadith_no": "6504",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت أبا جمرة، قال حدثني زهدم بن مضرب، قال سمعت عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم ‏\"‏‏.‏ قال عمران فما أدري قال النبي صلى الله عليه وسلم بعد قوله مرتين أو ثلاثا ‏\"‏ ثم يكون بعدهم قوم يشهدون ولا يستشهدون، ويخونون ولا يؤتمنون، وينذرون ولا يفون ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudarrib:                     `Imran bin Husain said: The Prophet said, \"The best people are my contemporaries (i.e., the present (my) generation) and then those who come after them (i.e., the next generation).\" `Imran added: I am not sure whether the Prophet repeated the statement twice after his first saying. The Prophet added, \"And after them there will come people who will bear witness, though they will not be asked to give their witness; and they will be treacherous and nobody will trust them, and they will make vows, but will not fulfill them, and fatness will appear among them.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "6526",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو الوليد، حدثنا سلم بن زرير، حدثنا أبو رجاء، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء، واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏ تابعه أيوب وعوف، وقال صخر وحماد بن نجيح عن أبي رجاء عن ابن عباس‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The Prophet said, \"I looked into Paradise and found that the majority of its dwellers were the poor people, and I looked into the (Hell) Fire and found that the majority of its dwellers were women.\"",
      "chain": [
        "20296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "6626",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن الهيثم، حدثنا عوف، عن أبي رجاء، عن عمران، عن النبي صلى الله عليه وسلم قال ‏\"‏ اطلعت في الجنة فرأيت أكثر أهلها الفقراء واطلعت في النار فرأيت أكثر أهلها النساء ‏\"‏‏.‏",
      "text_en": " Narrated `Imran:                     The Prophet said, \"I looked into paradise and saw that the majority of its people were the poor, and I looked into the Fire and found that the majority of its people were women.\"",
      "chain": [
        "30151",
        "11298",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "6646",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الحسن بن ذكوان، حدثنا أبو رجاء، حدثنا عمران بن حصين   رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج قوم من النار بشفاعة محمد صلى الله عليه وسلم فيدخلون الجنة، يسمون الجهنميين ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The Prophet said, \"Some people will be taken out of the Fire through the intercession of Muhammad they will enter Paradise and will be called Al-Jahannamiyin (the Hell Fire people).",
      "chain": [
        "30175",
        "20031",
        "11582",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "6676",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا يزيد الرشك، قال سمعت مطرف بن عبد الله بن الشخير، يحدث عن عمران بن حصين، قال قال رجل يا رسول الله أيعرف أهل الجنة من أهل النار قال ‏\"‏ نعم ‏\"‏‏.‏ قال فلم يعمل العاملون قال ‏\"‏كل يعمل لما خلق له  أو لما يسر له‏\"‏ ‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     A man said, \"O Allah's Apostle! Can the people of Paradise be known (differentiated) from the people of the Fire; The Prophet replied, \"Yes.\" The man said, \"Why do people (try to) do (good) deeds?\" The Prophet said, \"Everyone will do the deeds for which he has been created to do or he will do those deeds which will be made easy for him to do.\" (i.e. everybody will find easy to do such deeds as will lead him to his destined place for which he has been created).",
      "chain": [
        "20404",
        "20020",
        "11319",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "6778",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا مسدد، عن يحيى، عن شعبة، قال حدثني أبو جمرة، حدثنا زهدم بن مضرب، قال سمعت عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم قرني، ثم الذين يلونهم، ثم الذين يلونهم  قال عمران لا أدري ذكر ثنتين أو ثلاثا بعد قرنه  ثم يجيء قوم ينذرون ولا يفون، ويخونون ولا يؤتمنون، ويشهدون ولا يستشهدون، ويظهر فيهم السمن ‏\"‏‏.‏",
      "text_en": " Narrated Zahdam bin Mudarrab:                     `Imran bin Hussain said, \"The Prophet said, 'The best of you (people) are my generation, and the second best will be those who will follow them, and then those who will follow the second generation.\" `Imran added, \"I do not remember whether he mentioned two or three (generations) after his generation. He added, 'Then will come some people who will make vows but will not fulfill them; and they will be dishonest and will not be trustworthy, and they will give their witness without being asked to give their witness, and fatness will appear among them.' \"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11309",
        "11589",
        "123"
      ]
    },
    {
      "hadith_no": "6976",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا قتادة، قال سمعت زرارة بن أوفى، عن عمران بن حصين، أن رجلا، عض يد رجل، فنزع يده من فمه، فوقعت ثنيتاه، فاختصموا إلى النبي صلى الله عليه وسلم فقال ‏\"‏ يعض أحدكم أخاه كما يعض الفحل، لا دية لك ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     A man bit another man's hand and the latter pulled his hand out of his mouth by force, causing two of his incisors (teeth) to fall out. They submitted their case to the Prophet, who said, \"One of you bit his brother as a male camel bites. (Go away), there is no Diya (Blood-money) for you.\"",
      "chain": [
        "20404",
        "20020",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "hadith_no": "7507",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن جامع بن شداد، عن صفوان بن محرز، عن عمران بن حصين، قال إني عند النبي صلى الله عليه وسلم إذ جاءه قوم من بني تميم فقال ‏\"‏ اقبلوا البشرى يا بني تميم ‏\"‏‏.‏ قالوا بشرتنا فأعطنا‏.‏ فدخل ناس من أهل اليمن فقال ‏\"‏ اقبلوا البشرى يا أهل اليمن إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قبلنا‏.‏ جئناك لنتفقه في الدين ولنسألك عن أول هذا الأمر ما كان‏.‏ قال ‏\"‏ كان الله ولم يكن شىء قبله، وكان عرشه على الماء، ثم خلق السموات والأرض، وكتب في الذكر كل شىء ‏\"‏‏.‏ ثم أتاني رجل فقال يا عمران أدرك ناقتك فقد ذهبت فانطلقت أطلبها، فإذا السراب ينقطع دونها، وايم الله لوددت أنها قد ذهبت ولم أقم‏.‏",
      "text_en": " Narrated `Imran bin Hussain:                     While I was with the Prophet , some people from Bani Tamim came to him. The Prophet said, \"O Bani Tamim! Accept the good news!\" They said, \"You have given us the good news; now give us (something).\" (After a while) some Yemenites entered, and he said to them, \"O the people of Yemen! Accept the good news, as Bani Tamim have refused it. \" They said, \"We accept it, for we have come to you to learn the Religion. So we ask you what the beginning of this universe was.\" The Prophet said \"There was Allah and nothing else before Him and His Throne was over the water, and He then created the Heavens and the Earth and wrote everything in the Book.\" Then a man came to me and said, 'O `Imran! Follow your she-camel for it has run away!\" So I set out seeking it, and behold, it was beyond the mirage! By Allah, I wished that it (my she-camel) had gone but that I had not left (the gathering). \"",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11328",
        "11693",
        "123"
      ]
    },
    {
      "hadith_no": "7646",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، قال يزيد حدثني مطرف بن عبد الله، عن عمران، قال قلت يا رسول الله فيما يعمل العاملون قال ‏\"‏ كل ميسر لما خلق له ‏\"‏‏.‏",
      "text_en": " Narrated `Imran:                     I said, \"O Allah's Apostle! Why should a doer (people) try to do good deeds?' The Prophet said, \"Everybody will find easy to do such deeds as will lead him to his destined place for which he has been created.'",
      "chain": [
        "30315",
        "20258",
        "20472",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت أبا السوار، يحدث أنه سمع عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ الحياء لا يأتي إلا بخير ‏\"‏ ‏.‏ فقال بشير بن كعب إنه مكتوب في الحكمة أن منه وقارا ومنه سكينة ‏.‏ فقال عمران أحدثك عن رسول الله صلى الله عليه وسلم وتحدثني عن صحفك ‏.‏",
      "text_en": " It is narrated on the authority of 'Imran b. Husain that the Prophet (may peace and blessings be upon him) said:                      Modesty brings forth nothing but goodness. Bushair b. Ka'b said: It is recorded in the books of wisdom, there lies sobriety in it and calmness of mind in it, Imran said: I am narrating to you the tradition of the Messenger of Allah (may peace and blessings be upon him) and you talk of your books.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "123"
      ]
    },
    {
      "hadith_no": "167",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر، حدثنا أبو نعامة العدوي، قال سمعت حجير بن الربيع العدوي، يقول عن عمران بن حصين، عن النبي صلى الله عليه وسلم نحو حديث حماد بن زيد ‏.‏",
      "text_en": " Ishaq b. Ibrahim narrates this hadith of the Holy Prophet on the authority of Imran b. Husain, like the one narrated by Hammad b. Zaid.",
      "chain": [
        "30123",
        "20291",
        "20562",
        "10675",
        "123"
      ]
    },
    {
      "hadith_no": "546",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن خلف الباهلي، حدثنا المعتمر، عن هشام بن حسان، عن محمد، - يعني ابن سيرين - قال حدثني عمران، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب ‏\"‏ ‏.‏ قالوا ومن هم يا رسول الله قال ‏\"‏ هم الذين لا يكتوون ولا يسترقون وعلى ربهم يتوكلون ‏\"‏ ‏.‏ فقام عكاشة فقال ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت منهم ‏\"‏ ‏.‏ قال فقام رجل فقال يا نبي الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Imran that the Apostle of Allah (may peace be upon him) said:                      Seventy thousand people of my Ummah would be admitted into Paradise without rendering any account. They (the companions) said: Who would be of those (fortunate persons)? He (the Holy Prophet) said: Those who do not cauterise and practise charm, but repose trust in their Lord, 'Ukkasha then stood up and said: Supplicate (before) Allah that He should make me one among them. He (the Holy Prophet) said: Thou art one among them He (the narrator) said: A man stood up and said: Apostle of Allah, supplicate (before) Allah that He should make me one among them. He (the Holy Prophet said: 'Ukkasha has preceded you (in this matter).",
      "chain": [
        "30460",
        "20288",
        "11311",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا حاجب بن عمر أبو خشينة الثقفي، حدثنا الحكم بن الأعرج، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب ‏\"‏ ‏.‏ قالوا من هم يا رسول الله قال ‏\"‏ هم الذين لا يسترقون ولا يتطيرون ولا يكتوون وعلى ربهم يتوكلون ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      Verily the Messenger of Allah (may peace be upon him) said: Seventy thousand men of my Ummah would enter Paradise without rendering account. They (the companions of the Holy Prophet) said: Who would be those, Messenger of Allah? He (the Holy Prophet) said: They would be those who neither practise charm, not take omens, nor do they cauterise, but they repose their trust in their Lord.",
      "chain": [
        "30022",
        "20250",
        "10674",
        "10677",
        "123"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن منصور، وقتيبة بن سعيد، كلاهما عن أبي عوانة، قال سعيد حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الظهر - أو العصر - فقال ‏\"‏ أيكم قرأ خلفي بسبح اسم ربك الأعلى ‏\"‏ ‏.‏ فقال رجل أنا ولم أرد بها إلا الخير ‏.‏ قال ‏\"‏ قد علمت أن بعضكم خالجنيها ‏\"‏ ‏.‏",
      "text_en": " lmrin b. Husain reported:                      The Messenger of Allah (may peace beupon him) led us In Zuhr or 'Asr prayer (noon or the afternoon prayer). (On concluding it) he said: Who recited behind me (the verses): Sabbih Isma Rabbik al-a'la (Glorify the name of thy Lord, the Most High)? There upon a person said: It was I, but I in- tended nothing but goodness. I felt that some one of you was disputing with me in it (or he was taking out from my tongue what I was reciting), said the Holy Prophet (may peace be upon him).",
      "chain": [
        "30116",
        "30367",
        "20469",
        "11168",
        "20469",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت زرارة بن أوفى، يحدث عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم صلى الظهر فجعل رجل يقرأ خلفه بسبح اسم ربك الأعلى فلما انصرف قال ‏\"‏ أيكم قرأ ‏\"‏ أو ‏\"‏ أيكم القارئ ‏\"‏ فقال رجل أنا ‏.‏ فقال ‏\"‏ قد ظننت أن بعضكم خالجنيها ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      The Messenger of Allah (may peace be upon him) observed the Zuhr prayer and a person recited Sabbih Isma Rabbik al-a'la (Glorify the name of thy Lord, the Most High) behind him. When he (the Holy Pro- phet) concluded the prayer he said: Who amongst you recited (the above-mentioned verse) or who amongst you was the reciter? A person said: It was I. Upon this he (the Holy Prophet) observed: I thought as if someone amongst you was disputing with me (in what I was reciting).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "hadith_no": "1321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، - قال زهير حدثنا إسماعيل بن إبراهيم، - عن خالد، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم صلى العصر فسلم في ثلاث ركعات ثم دخل منزله فقام إليه رجل يقال له الخرباق وكان في يديه طول فقال يا رسول الله ‏.‏ فذكر له صنيعه ‏.‏ وخرج غضبان يجر رداءه حتى انتهى إلى الناس فقال ‏\"‏ أصدق هذا ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فصلى ركعة ثم سلم ثم سجد سجدتين ثم سلم ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      The Messenger of Allah (may peace be upon him) said the afternoon prayer and gave the salutation. at the end of three rak'ahs and then went into his house. A man called al-Khirbaq, who bad long aims, got up and went to him, and addressed him as Messenger of Allah and mentioned to him what he had done. He came out angrily trailing his mantle, and when he came to the people he said: Is this man telling the truth? They said: Yes. He then said one rak'ah and then gave salutation and then performed two prostrations and then gave salutation.",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20321",
        "20208",
        "11282",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "1595",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا عبيد الله بن عبد المجيد، حدثنا سلم بن زرير العطاردي، قال سمعت أبا رجاء العطاردي، عن عمران بن حصين، قال كنت مع نبي الله صلى الله عليه وسلم في مسير له فأدلجنا ليلتنا حتى إذا كان في وجه الصبح عرسنا فغلبتنا أعيننا حتى بزغت الشمس - قال - فكان أول من استيقظ منا أبو بكر وكنا لا نوقظ نبي الله صلى الله عليه وسلم من منامه إذا نام حتى يستيقظ ثم استيقظ عمر فقام عند نبي الله صلى الله عليه وسلم فجعل يكبر ويرفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم فلما رفع رأسه ورأى الشمس قد بزغت قال ‏\"‏ ارتحلوا ‏\"‏ ‏.‏ فسار بنا حتى إذا ابيضت الشمس نزل فصلى بنا الغداة فاعتزل رجل من القوم لم يصل معنا فلما انصرف قال له رسول الله صلى الله عليه وسلم ‏\"‏ يا فلان ما منعك أن تصلي معنا ‏\"‏ ‏.‏ قال يا نبي الله أصابتني جنابة ‏.‏ فأمره رسول الله صلى الله عليه وسلم فتيمم بالصعيد فصلى ثم عجلني في ركب بين يديه نطلب الماء وقد عطشنا عطشا شديدا ‏.‏ فبينما نحن نسير إذا نحن بامرأة سادلة رجليها بين مزادتين فقلنا لها أين الماء قالت أيهاه أيهاه لا ماء لكم ‏.‏ قلنا فكم بين أهلك وبين الماء ‏.‏ قالت مسيرة يوم وليلة ‏.‏ قلنا انطلقي إلى رسول الله صلى الله عليه وسلم ‏.‏ قالت وما رسول الله فلم نملكها من أمرها شيئا حتى انطلقنا بها فاستقبلنا بها رسول الله صلى الله عليه وسلم فسألها فأخبرته مثل الذي أخبرتنا وأخبرته أنها موتمة لها صبيان أيتام فأمر براويتها فأنيخت فمج في العزلاوين العلياوين ثم بعث براويتها فشربنا ونحن أربعون رجلا عطاش حتى روينا وملأنا كل قربة معنا وإداوة وغسلنا صاحبنا غير أنا لم نسق بعيرا وهي تكاد تنضرج من الماء - يعني المزادتين - ثم قال ‏\"‏ هاتوا ما كان عندكم ‏\"‏ ‏.‏ فجمعنا لها من كسر وتمر وصر لها صرة فقال لها ‏\"‏ اذهبي فأطعمي هذا عيالك واعلمي أنا لم نرزأ من مائك ‏\"‏ ‏.‏ فلما أتت أهلها قالت لقد لقيت أسحر البشر أو إنه لنبي كما زعم كان من أمره ذيت وذيت ‏.‏ فهدى الله ذاك الصرم بتلك المرأة فأسلمت وأسلموا ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      I was with the Apostle of Allah (may peace be upon him) in a journey. We travelled the whole of the night, and when it was about to dawn, we got down for rest, and were overpowered (by sleep) till the sun shone. Abu Bakr was the first to awake amongst us. and we did not awake the Apostle of Allah (may peace be upon him) from his sleep allowing him to wake up (of his own accord). It was 'Umar who then woke up. He stood by the side of the Apostle of Allah (may peace be upon him) and recited takbir in a loud voice till the Messenger of Allah (may peace be upon him) woke up. When he lifted his head, he saw that the sun had arisen; he then said: Proceed on. He travelled along with us till the sun shone brightly. He came down (from his camel) and led us in the morning prayer. A person, however, remained away from the people and did not say, prayer along with us. After having completed the prayer, the Messenger of Allah (may peace be upon him) said to him: O, so and so, what prevented you from observing prayer with us? He said: Apostle of Allah! I was not in a state of purity. The Messenger of Allah (may peace be upon him) ordered him arid lie performed Tayammum with dust and said prayer. He then urged me to go ahead immediately along with other riders to find out water, for we felt very thirsty. We were traveling when we came across a woman who was sitting (on a camel) with her feet hanging over two leathern water bags. We said to her: How far is water available? She, said: Far, very far, very far. You cannot get water. We (again) said: How much distance is there between (the residence of) your family and water? She said: It is a day and night journey. We said to her: You go to the Messenger of Allah (may peace be upon him). She said: Who is the Messenger of Allah? We somehow or the other managed to bring her to the Messenger of Allah (may peace be upon him) and he asked about her, and she informed him as she had informed us that she was a widow having orphan children. He ordered that her camel should be made to kneal down and he gargled in the opening (of her leathern water-bag). The camel was then raised up and we forty thirsty men drank water till we were completely satiated, and we filled up all leathern water-bags and water-skins that we had with us and we washed our companions, but we did not make any camel drink, and (the leathern water-bags) were about to burst (on account of excess of water). He then said: Bring whatever you have with you. So we collected the bits (of estable things) and dates and packed them up in a bundle, and said to her: Take it away. This is meant for your children, and know that we have not its any way done any loss to your water. W hen she came to her family she said: I have met the greatest magician amongst human beings, or he is an apostle, as he claims to be, and she then narrated what had happened and Allah guided aright those people through that woman. She affirmed her faith in Islam and so did the people embrace Islam.",
      "chain": [
        "30296",
        "11591",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني زهير بن حرب، وعلي بن حجر، قالا حدثنا إسماعيل، ح وحدثنا يحيى، بن أيوب حدثنا ابن علية، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أخا لكم قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ يعني النجاشي وفي رواية زهير ‏\"‏ إن أخاكم ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported Allah's Messenger (may peace be upon him) as saying:                      A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"",
      "chain": [
        "30022",
        "20387",
        "20208",
        "20379",
        "20208",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "2802",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا مهدي، - وهو ابن ميمون - حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين، - رضى الله عنهما - أنصلى الله عليه وسلم قال له أو قال لرجل وهو يسمع ‏\"‏ يا فلان أصمت من سرة هذا الشهر ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) said to him (or he said to another person and he was listening to it):                      O, so and so, did you observe fast in the middle of the month? He said: No. Thereupon he (the Messenger of Allah) said: When you break it, then observe fast for two days.",
      "chain": [
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا هداب بن خالد، حدثنا حماد بن سلمة، عن ثابت، عن مطرف، - ولم أفهم مطرفا من هداب - عن عمران بن حصين، - رضى الله عنهما - أن رسول الله صلى الله عليه وسلم قال له أو لآخر ‏\"‏ أصمت من سرر شعبان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with them) reported Allah's Messenger (may peace he upon him) having said to him or to someone else:                      Did you fast in the middle of Sha'ban? He said: No. Thereupon he (the Holy Prophet) said: If you did not observe fast, then you should observe fast for two days.",
      "chain": [
        "20021",
        "11269",
        "123"
      ]
    },
    {
      "hadith_no": "2809",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن الجريري، عن أبي، العلاء عن مطرف، عن عمران بن حصين، - رضى الله عنهما - أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ هل صمت من سرر هذا الشهر شيئا ‏\"‏ ‏.‏ قال لا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإذا أفطرت من رمضان فصم يومين مكانه ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain (Allah be pleased with them) reported that Allah's Apostle (way peace heupon him) said. to a person:                      Did you observe any fast in the middle of this month (Sha'ban)? He said: No. Thereupon the Messenger of Allah (may peace be upon him) said: Fast for two days instead of (one fast) when you have completed (fasts of) Ramadan.",
      "chain": [
        "30201",
        "20472",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "2810",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن ابن أخي، مطرف بن الشخير قال سمعت مطرفا، يحدث عن عمران بن حصين، - رضى الله عنهما - أنصلى الله عليه وسلم قال لرجل ‏\"‏ هل صمت من سرر هذا الشهر شيئا ‏\"‏ ‏.‏ يعني شعبان ‏.‏ قال لا ‏.‏ قال فقال له ‏\"‏ إذا أفطرت رمضان فصم يوما أو يومين ‏\"‏ ‏.‏ شعبة الذي شك فيه قال وأظنه قال يومين ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) said to a person:                      Did you observe fast in the middle of this month. i. e. Sha'ban? He said: No. Thereupon he said to him: When it is the end of Ramadan, then observe fast for one day or two (Shu'ba had some doubt about it) but he said: I think that he has said: two days.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3031",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا إسماعيل بن إبراهيم، حدثنا الجريري، عن أبي، العلاء عن مطرف، قال قال لي عمران بن حصين إني لأحدثك بالحديث اليوم ينفعك الله به بعد اليوم واعلم أن رسول الله صلى الله عليه وسلم قد أعمر طائفة من أهله في العشر فلم تنزل آية تنسخ ذلك ولم ينه عنه حتى مضى لوجهه ارتأى كل امرئ بعد ما شاء أن يرتئي ‏.‏",
      "text_en": " Mutarrif reported:                      'Imran b. Husain said to me: Should I not narrate to you a hadith today by which Allah will benefit you subsequently-and bear in mind that Allah's Messenger (may peace be upon him) made some members of his family perform 'Umra within ten days of Dhu'l-Hijja. No verse was revealed to abrogate that, and he (the Holy Prophet) did not refrain from doing it till he died. So after him everyone said as he liked, (but it would be his. personal opinion and not the verdict of the Shari'ah).",
      "chain": [
        "30022",
        "20208",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن حميد بن هلال، عن مطرف، قال قال لي عمران بن حصين أحدثك حديثا عسى الله أن ينفعك به إن رسول الله صلى الله عليه وسلم جمع بين حجة وعمرة ثم لم ينه عنه حتى مات ولم ينزل فيه قرآن يحرمه وقد كان يسلم على حتى اكتويت فتركت ثم تركت الكى فعاد ‏.‏",
      "text_en": " Imran b. Husain reported:                      I am narrating to you a hadith by which Allah will benefit you (and the hadith is) that Allah's Messenger (may peace be upon him) combined Hajj and 'Umra, and he did not forbid (this combination) till he died. (Moreover) nothing was revealed in the Holy Qur'an which forbade it. And I was always blessed till I was branded and then it (blessing) was abandoned. I then abandoned branding and it (the blessing was restored).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11281",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3037",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا همام، حدثنا قتادة، عن مطرف، عن عمران بن حصين، - رضى الله عنه - قال تمتعنا مع رسول الله صلى الله عليه وسلم ولم ينزل فيه القرآن ‏.‏ قال رجل برأيه ما شاء ‏.‏ وحدثنيه حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا إسماعيل، بن مسلم حدثني محمد بن واسع، عن مطرف بن عبد الله بن الشخير، عن عمران بن حصين، - رضى الله عنه - بهذا الحديث قال تمتع نبي الله صلى الله عليه وسلم وتمتعنا معه ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with him) reported:                      We performed Tamattu' (Hajj and 'Umra combining together) in the company of Allah's Messenger (may peace be upon him), and nothing was revealed in the Qur'an (concerning the abrogation of this practice), and whatever a person (Hadhrat 'Umar) said was his personal opinion. 'Imran b. Husain narrated this hadith (in these words also):\" Allah's Apostle (may peace be upon him) performed Hajj Tamattu' and we also performed it along with him.\"",
      "chain": [
        "30170",
        "20250",
        "20297",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3040",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه محمد بن حاتم، حدثنا يحيى بن سعيد، عن عمران القصير، حدثنا أبو رجاء عن عمران بن حصين، ‏.‏ بمثله غير أنه قال وفعلناها مع رسول الله صلى الله عليه وسلم ولم يقل وأمرنا بها ‏.‏",
      "text_en": "  A hadith like this is transmitted on the authority of Imran b. Husain, but with this variation that he ('Imran) said:                      We did that (Tamattu') in the company of Allah's Messenger (may peace be upon him) and he did not say anything but he (the Holy Prophet) commanded us to do it.",
      "chain": [
        "20031",
        "18819",
        "11440",
        "123"
      ]
    },
    {
      "hadith_no": "4333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني زهير بن حرب، وعلي بن حجر السعدي، - واللفظ لزهير - قالا حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، قال كانت ثقيف حلفاء لبني عقيل فأسرت ثقيف رجلين من أصحاب رسول الله صلى الله عليه وسلم وأسر أصحاب رسول الله صلى الله عليه وسلم رجلا من بني عقيل وأصابوا معه العضباء فأتى عليه رسول الله صلى الله عليه وسلم وهو في الوثاق قال يا محمد ‏.‏ فأتاه فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ فقال بم أخذتني وبم أخذت سابقة الحاج فقال إعظاما لذلك ‏\"‏ أخذتك بجريرة حلفائك ثقيف ‏\"‏ ‏.‏ ثم انصرف عنه فناداه فقال يا محمد يا محمد ‏.‏ وكان رسول الله صلى الله عليه وسلم رحيما رقيقا فرجع إليه فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال إني مسلم ‏.‏ قال ‏\"‏ لو قلتها وأنت تملك أمرك أفلحت كل الفلاح ‏\"‏ ‏.‏ ثم انصرف فناداه فقال يا محمد يا محمد ‏.‏ فأتاه فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال إني جائع فأطعمني وظمآن فأسقني ‏.‏ قال ‏\"‏ هذه حاجتك ‏\"‏ ‏.‏ ففدي بالرجلين - قال - وأسرت امرأة من الأنصار وأصيبت العضباء فكانت المرأة في الوثاق وكان القوم يريحون نعمهم بين يدى بيوتهم فانفلتت ذات ليلة من الوثاق فأتت الإبل فجعلت إذا دنت من البعير رغا فتتركه حتى تنتهي إلى العضباء فلم ترغ قال وناقة منوقة فقعدت في عجزها ثم زجرتها فانطلقت ونذروا بها فطلبوها فأعجزتهم - قال - ونذرت لله إن نجاها الله عليها لتنحرنها فلما قدمت المدينة رآها الناس ‏.‏ فقالوا العضباء ناقة رسول الله صلى الله عليه وسلم ‏.‏ فقالت إنها نذرت إن نجاها الله عليها لتنحرنها ‏.‏ فأتوا رسول الله صلى الله عليه وسلم فذكروا ذلك له ‏.‏ فقال ‏\"‏ سبحان الله بئسما جزتها نذرت لله إن نجاها الله عليها لتنحرنها لا وفاء لنذر في معصية ولا فيما لا يملك العبد ‏\"‏ ‏.‏ وفي رواية ابن حجر ‏\"‏ لا نذر في معصية الله ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain reported that the tribe of Thaqif was the ally of Banu 'Uqail. Thaqif took two persons from amongst the Companiobs of Allah's Messenger (may peace be upon him) as prisoners. The Campanions of Allah's Messenger (may peace be upon him) took one person at Banu Uqail as prisoner, and captured al-'Adbi (the she-camel of the Holy Prophet) along with him. Allah's Messenger (may peace be upon him) came to him and he was tied with ropes. He said:                      Muhammad. He came near him and said: What is the matter with you? Thereupon he (the prisoner) said: Why have you taken me as prisoner and why have you caught hold of one proceeding the pilgrims (the she-camel as she carried the Holy Prophet on her back and walked ahead of the multitude)? He (the Holy Prophet) said: (Yours is a great fault). I (my men) have caught hold of you for the crime of your allies, Banu Thaqif. He (the Holy Prophet) then turned away. He again called him and said: Muhammad, Muhammad, and since Allah's Messenger (may peace be upon him) was very compassionate, and tenderhearted, he returned to him, and said: What is the matter with you? He said: I am a Muslim, whereupon he (the Holy Prophet) said: Had you said this when you had been the master of yourself, you would have gained every success. He then turned away. He (the prisoner) called him again saying: Muhammad, Muhammad. He came to him and said: What is the matter with you? He said: I am hungry, feed me, and I am thirsty, so provide me with drink. He (the Holy Prophet) said: That is (to satisfy) your want. He was then ransomed for two persons (who had been taken prisoner by Thaqif). He (the narrator) said: A woman of the Ansar had been taken prisoner and also al-Adbi' was caught. The woman had been tied with ropes. The people were giving rest to their animals before their houses. She escaped one night from the bondage and came to the camels. As she drew near the camels, they fretted and fumed and so she left them until she came to al-, Adbi'. It did not fret and fume; it was docile She rode upon its back and drove it away and she went off. When they (the enemies of Islam) were warned of this, they went in search of it, but it (the she-camel) exhausted them. She (the woman) took vow for Allah, that in case He would save her through it, she would offer that as a sacrifice. As she reached Medina, the people saw her and they said: Here is al-Adbi, the she-camel of Allah's Messanger (may peace be upon him). She (the woman) said that she had taken a vow that if Allah would save her on its back, she would sacrifice it. They (the Prophet's Companions) came to Allah's Messenger (may peace be upon him) and made a mention of that to him, whereupon he said: Hallowed be Allah, how ill she rewarded it that she took vow to Allah that if He saves her on its back, she would sacrifice it! There is no fulfilment of the vow in an act of disobedience, nor in an act over which a person has no control. In the version of Ibn Hujr (the words are):\" There is no vow in disobedience to Allah.\"",
      "chain": [
        "30022",
        "20387",
        "20208",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "4425",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا علي بن حجر السعدي، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران، بن حصين ‏.‏ أن رجلا، أعتق ستة مملوكين له عند موته لم يكن له مال غيرهم فدعا بهم رسول الله صلى الله عليه وسلم فجزأهم أثلاثا ثم أقرع بينهم فأعتق اثنين وأرق أربعة وقال له قولا شديدا ‏.‏",
      "text_en": " 'Imran b. Husain reported that a person who had no other property emancipated six slaves of his at the time of his death. Allah's Messenger (may peace be upon him) called for them and divided them into three sections, cast lots amongst them, and set two free and kept four in slavery; and he (the Holy Prophet) spoke severely of him.",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "4427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن منهال الضرير، وأحمد بن عبدة، قالا حدثنا يزيد بن زريع، حدثنا هشام بن حسان، عن محمد بن سيرين، عن عمران بن حصين، عن النبي صلى الله عليه وسلم بمثل حديث ابن علية وحماد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Imran b. Husain through another chain of narrators.",
      "chain": [
        "30173",
        "30423",
        "20304",
        "11311",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "4459",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن زرارة، عن عمران بن حصين، قال قاتل يعلى ابن منية أو ابن أمية رجلا فعض أحدهما صاحبه فانتزع يده من فمه فنزع ثنيته - وقال ابن المثنى ثنيتيه - فاختصما إلى النبي صلى الله عليه وسلم فقال ‏\"‏ أيعض أحدكم كما يعض الفحل لا دية له ‏\"‏ ‏.‏",
      "text_en": " Imran b. Husain reported:                      Ya'la b. Munya or Ibn Umayya fought with a person, and the one bit the hand of the other. And he tried to draw his hand from his mouth and thus his foreteeth ware pulled out. They referred their dispute to Allah's Apostle (may peace be upon him), whereupon he said: Does any one of you bite as the camel bites? So there is no blood-wit for it.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "123"
      ]
    },
    {
      "hadith_no": "4461",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، أن رجلا، عض ذراع رجل فجذبه فسقطت ثنيته فرفع إلى النبي صلى الله عليه وسلم فأبطله وقال ‏\"‏ أردت أن تأكل لحمه ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported that a person bit the arm of another person; he pulled it out and his foretooth fell down. This matter was taken to Allah's Apostle (may peace be upon him), and he turned it down saying:                      Did you want to eat his flesh?",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11019",
        "11284",
        "123"
      ]
    }
  ],
  "total_hadiths": 165
}