{
  "id": "12361",
  "name": "Ata'a bin Abi Mrwan عطاء بن أبي مروان الأسلمي أبو مصعب",
  "full_name": "Ata'a bin Abi Mrwan عطاء بن أبي مروان الأسلمي أبو مصعب",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  -  ثقة ]"
    ],
    "tags": [
      "al-Aslami",
      "al-Madni",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1346",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال حدثنا ابن وهب، قال أخبرني حفص بن ميسرة، عن موسى بن عقبة، عن عطاء بن أبي مروان، عن أبيه، أن كعبا، حلف له بالله الذي فلق البحر لموسى إنا لنجد في التوراة أن داود نبي الله صلى الله عليه وسلم كان إذا انصرف من صلاته قال ‏\"‏ اللهم أصلح لي ديني الذي جعلته لي عصمة وأصلح لي دنياى التي جعلت فيها معاشي اللهم إني أعوذ برضاك من سخطك وأعوذ بعفوك من نقمتك وأعوذ بك منك لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏.‏ قال وحدثني كعب أن صهيبا حدثه أن محمدا صلى الله عليه وسلم كان يقولهن عند انصرافه من صلاته ‏.‏",
      "text_en": " It was narrated from 'Ata bin Abi Marwan, from his father, that:                     Ka'b swore to him: \"By Allah (SWT) Who parted the sea for Musa, we find in the Tawrah that when Dawud, the Prophet of Allah, finished his prayer, he would say: 'Allahumma Aslih li dinya-lladhi ja'altahu li ismatan wa aslih li dunyaya-llati ja'alta fiha ma'ashi, Allahumma inni a-udhu biridaka min sakhatik wa a-udhu bi'afwika min naqmatika wa a-udhu bika mink, la mani' lima a'taita wa la mu'tia lima mana'ta wa la yanfa'u dhal-jaddi minka al-jadd (O Allah, set straight my religious commitment that You have made a protection for me, and set straight my worldly affairs which You have made a means of my livelihood. O Allah, I seek refuge in Your pleasure from Your wrath, and I seek refuge in Your forgiveness from Your punishment, and I seek refuge in You from You. None can withhold what you have given and none can give what you have withheld, and no wealth or fortune can avail the man of wealth and fortune before You.)'\" He said: \"And Ka'b told me that Suhaib told him that Muhammad (ﷺ) used to say (these words) when he had finished praying.'\"",
      "chain": [
        "30443",
        "20029",
        "20421",
        "11106",
        "12361"
      ]
    }
  ],
  "total_hadiths": 1
}