{
  "id": "1238",
  "name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
  "full_name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "B.Mabdhul",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "359",
      "name": "Abu 'Amra bin 'Amr bin Mihsan ( أبو عمرة الأنصاري النجاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "542",
      "name": "Hind bint al-Muqawwim ( ‎هند بنت المقوم بن عبد المطلب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "1239",
      "name": "'Abdullah bin Abi 'Amra ( عبد الله بن أبي عمرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "21817",
      "name": "'Abdullah bin 'Abdur Rahman عبد الله بن عبد الرحمن بن أبي عمرة",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "359",
      "name": "Abu 'Amra bin 'Amr bin Mihsan ( أبو عمرة الأنصاري النجاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3625",
      "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1268",
      "name": "Kabsha bint bint Thabit ( كبشة بنت ثابت بن المنذر ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "21817",
      "name": "'Abdullah bin 'Abdur Rahman عبد الله بن عبد الرحمن بن أبي عمرة",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11006",
      "name": "Kharija ibn Zayd ibn Thabit خارجة بن زيد بن ثابت الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10933",
      "name": "'Abdullah bin 'Amr bin 'Uthman عبد الله بن عمرو بن عثمان المطرف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11229",
      "name": "Hilal bin Abi Maymuna هلال بن علي بن أسامة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10885",
      "name": "Yazid bin Yazid bin Jabir يزيد بن يزيد بن جابر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20441",
      "name": "'Abdur Rahman bin Abi al-Mawal عبد الرحمن بن أبي الموال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2378",
      "hadith_no": "2378",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حق الإبل أن تحلب على الماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"One of the rights of a she camel is that it should be milked at a place of water.\"",
      "usc_msa_ref": "565",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2399",
      "hadith_no": "2399",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى به في الدنيا والآخرة اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن مات وترك مالا فليرثه عصبته من كانوا، ومن ترك دينا أو ضياعا فليأتني فأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I am closer to the believers than their selves in this world and in the Hereafter, and if you like, you can read Allah's Statement: \"The Prophet is closer to the believers than their own selves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors (from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they should come to me as I am the guardian of the deceased.\"",
      "usc_msa_ref": "584",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2793",
      "hadith_no": "2793",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏لقاب قوس في الجنة خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏ وقال ‏\"‏ لغدوة أو روحة في سبيل الله خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A place in Paradise as small as a bow is better than all that on which the sun rises and sets (i.e. all the world).\" He also said, \"A single endeavor in Allah's Cause in the afternoon or in the forenoon is better than all that on which the sun rises and sets.\"",
      "usc_msa_ref": "51",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3117",
      "hadith_no": "3117",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أعطيكم ولا أمنعكم، أنا قاسم أضع حيث أمرت ‏\"‏‏.‏",
      "text_en": "  Abu Huraira:                     Allah's Apostle said, \"Neither do I give you (anything) nor withhold (anything) from you, but I am just a distributor (i.e. Qasim), and I give as I am ordered.\"",
      "usc_msa_ref": "",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3229",
      "hadith_no": "3229",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحدكم في صلاة ما دامت الصلاة تحبسه، والملائكة تقول اللهم اغفر له وارحمه‏.‏ ما لم يقم من صلاته أو يحدث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"As long as any-one of you is waiting for the prayer, he is considered to be praying actually, and the angels say, 'O Allah! Be merciful to him and forgive him', (and go on saying so) unless he leaves his place of praying or passes wind (i.e. breaks his ablution).",
      "usc_msa_ref": "452",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3252",
      "hadith_no": "3252",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة سنة، واقرءوا إن شئتم ‏{‏وظل ممدود‏}‏‏\"‏«ولقاب قوس أحدكم في الجنة خير مما طلعت عليه الشمس أو تغرب».",
      "text_en": " Narrated Abu Huraira:                     The Prophet said \"There is a tree in Paradise (which is so big and huge that) a rider could travel in its shade for a hundred years. And if you wish, you can recite:--'In shade long extended..' (56. 30) and a place in Paradise equal to an arrow bow of one of you, is better than (the whole earth) on which the sun rises and sets.\"",
      "usc_msa_ref": "475",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3254",
      "hadith_no": "3254",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أول زمرة تدخل الجنة على صورة القمر ليلة البدر، والذين على آثارهم كأحسن كوكب دري في السماء إضاءة، قلوبهم على قلب رجل واحد، لا تباغض بينهم ولا تحاسد، لكل امرئ زوجتان من الحور العين، يرى مخ سوقهن من وراء العظم واللحم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The first batch (of people) who will enter Paradise will be (glittering) like the full moon, and the batch next to them will be (glittering) like the most brilliant star in the sky. Their hearts will be as if the heart of a single man, for they will have neither enmity nor jealousy amongst themselves; everyone will have two wives from the houris, (who will be so beautiful, pure and transparent that) the marrow of the bones of their legs will be seen through the bones and the flesh.\"",
      "usc_msa_ref": "476",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3443",
      "hadith_no": "3443",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى الناس بعيسى ابن مريم في الدنيا والآخرة، والأنبياء إخوة لعلات، أمهاتهم شتى، ودينهم واحد ‏\"‏‏.‏   وقال إبراهيم بن طهمان عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Both in this world and in the Hereafter, I am the nearest of all the people to Jesus, the son of Mary. The prophets are paternal brothers; their mothers are different, but their religion is one.\"",
      "usc_msa_ref": "652",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3464",
      "hadith_no": "3464",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، قال حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم ح وحدثني محمد، حدثنا عبد الله بن رجاء، أخبرنا همام، عن إسحاق بن عبد الله، قال أخبرني عبد الرحمن بن أبي عمرة، أن أبا هريرة  رضى الله عنه  حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى بدا لله أن يبتليهم، فبعث إليهم ملكا، فأتى الأبرص‏.‏ فقال أى شىء أحب إليك قال لون حسن وجلد حسن، قد قذرني الناس‏.‏ قال فمسحه، فذهب عنه، فأعطي لونا حسنا وجلدا حسنا‏.‏ فقال أى المال أحب إليك قال الإبل  أو قال البقر هو شك في ذلك، إن الأبرص والأقرع، قال أحدهما الإبل، وقال الآخر البقر  فأعطي ناقة عشراء‏.‏ فقال يبارك لك فيها‏.‏ وأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن، ويذهب عني هذا، قد قذرني الناس‏.‏ قال فمسحه فذهب، وأعطي شعرا حسنا‏.‏ قال فأى المال أحب إليك قال البقر‏.‏ قال فأعطاه بقرة حاملا، وقال يبارك لك فيها‏.‏ وأتى الأعمى فقال أى شىء أحب إليك قال يرد الله إلى بصري، فأبصر به الناس‏.‏ قال فمسحه، فرد الله إليه بصره‏.‏ قال فأى المال أحب إليك قال الغنم‏.‏ فأعطاه شاة والدا، فأنتج هذان، وولد هذا، فكان لهذا واد من إبل، ولهذا واد من بقر، ولهذا واد من الغنم‏.‏ ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين، تقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله ثم بك، أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري‏.‏ فقال له إن الحقوق كثيرة‏.‏ فقال له كأني أعرفك، ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال لقد ورثت لكابر عن كابر‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت، وأتى الأقرع في صورته وهيئته، فقال له مثل ما قال لهذا، فرد عليه مثل ما رد عليه هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت‏.‏ وأتى الأعمى في صورته فقال رجل مسكين وابن سبيل وتقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله، ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري‏.‏ فقال قد كنت أعمى فرد الله بصري، وفقيرا فقد أغناني، فخذ ما شئت، فوالله لا أجهدك اليوم بشىء أخذته لله‏.‏ فقال أمسك مالك، فإنما ابتليتم، فقد رضي الله عنك وسخط على صاحبيك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard Allah's Apostle saying, \"Allah willed to test three Israelis who were a Leper, a blind man and a bald-headed man. So, he sent them an angel who came to the leper and said, 'What thing do you like most?' He replied, \"Good color and good skin, for the people have a strong aversion to me.' The angel touched him and his illness was cured, and he was given a good color and beautiful skin. The angel asked him, 'What kind of property do you like best?' He replied, 'Camels (or cows).' (The narrator is in doubt, for either the leper or the bald-headed man demanded camels and the other demanded cows.) So he (i.e. the leper) was given a pregnant she-camei, and the angel said (to him), 'May Allah bless you in it.' The angel then went to the bald-headed man and said, 'What thing do you like most?' He said, 'I like good hair and wish to be cured of this disease, for the people feel repulsion for me.' The angel touched him and his illness was cured, and he was given good hair. The angel asked (him), 'What kind of property do you like bests' He replied, 'Cows,' The angel gave him a pregnant cow and said, 'May Allah bless you in it.' The angel went to the blind man and asked, 'What thing do you like best?' He said, '(I like) that Allah may restore my eye-sight to me so that I may see the people.' The angel touched his eyes and Allah gave him back his eye-sight. The angel asked him, \"What kind of property do you like best?' He replied, 'Sheep.' The angel gave him a pregnant sheep. Afterwards, all the three pregnant animals gave birth to young ones, and multiplied and brought forth so much that one of the (three) men had a herd of camels filling a valley, and one had a herd of cows filling a valley, and one had a flock of sheep filling a valley. Then the angel, disguised in the shape and appearance of a leper, went to the leper and said, I am a poor man, who has lost all means of livelihood while on a journey. So none will satisfy my need except Allah and then you. In the Name of Him Who has given you such nice color and beautiful skin, and so much property, I ask you to give me a camel so that I may reach my destination. The man replied, 'I have many obligations (so I cannot give you).' The angel said, 'I think I know you; were you not a leper to whom the people had a strong aversion? Weren't you a poor man, and then Allah gave you (all this property).' He replied, '(This is all wrong), I got this property through inheritance from my fore-fathers' The angel said, 'If you are telling a lie, then let Allah make you as you were before. ' Then the angel, disguised in the shape and appearance of a bald man, went to the bald man and said to him the same as he told the first one, and he too answered the same as the first one did. The angel said, 'If you are telling a lie, then let Allah make you as you were before.' The angel, disguised in the shape of a blind man, went to the blind man and said, 'I am a poor man and a traveler, whose means of livelihood have been exhausted while on a journey. I have nobody to help me except Allah, and after Him, you yourself. I ask you in the Name of Him Who has given you back your eye-sight to give me a sheep, so that with its help, I may complete my journey' The man said, 'No doubt, I was blind and Allah gave me back my eye-sight; I was poor and Allah made me rich; so take anything you wish from my property. By Allah, I will not stop you for taking anything (you need) of my property which you may take for Allah's sake.' The angel replied, 'Keep your property with you. You (i.e 3 men) have been tested and Allah is pleased with you and is angry with your two companions.\"",
      "usc_msa_ref": "670",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4581",
      "hadith_no": "4581",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال حدثني شريك بن أبي نمر، أن عطاء بن يسار، وعبد الرحمن بن أبي عمرة الأنصاري، قالا سمعنا أبا هريرة  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ ليس المسكين الذي ترده التمرة والتمرتان ولا اللقمة ولا اللقمتان‏.‏ إنما المسكين الذي يتعفف واقرءوا إن شئتم يعني قوله ‏{‏لا يسألون الناس إلحافا‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The poor person is not the one for whom a date or two or a morsel or two (of food is sufficient but the poor person is he who does not (beg or) ask the people (for something) or show his poverty at all. Recite if you wish, (Allah's Statement): \"They do not beg of people at all.\" (2.273)",
      "usc_msa_ref": "63",
      "chain": [
        "30232",
        "20173",
        "11858",
        "11020",
        "1238"
      ]
    },
    {
      "id": "sahih-bukhari-4828",
      "hadith_no": "4828",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى الناس به في الدنيا والآخرة، اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن ترك مالا فليرثه عصبته من كانوا، فإن ترك دينا أو ضياعا فليأتني وأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no believer but I, of all the people, I am the closest to him both in this world and in the Hereafter. Recite if you wish: 'The Prophet is closer to the believers than their own selves.' (33.6) so if a believer (dies) leaves some property then his relatives will inherit that property; but if he is in debt or he leaves poor children, let those (creditors and children) come to me (that I may pay the debt and provide for the children), for them I am his sponsor (surely).",
      "usc_msa_ref": "304",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6734",
      "hadith_no": "6734",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "وقال عمرو بن عاصم حدثنا همام، حدثنا إسحاق بن عبد الله، حدثنا عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أراد الله أن يبتليهم، فبعث ملكا فأتى الأبرص فقال تقطعت بي الحبال، فلا بلاغ لي إلا بالله، ثم بك ‏\"‏‏.‏ فذكر الحديث‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7599",
      "hadith_no": "7599",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، سمعت عبد الرحمن بن أبي عمرة، قال سمعت أبا هريرة، قال سمعت النبي صلى الله عليه وسلم قال ‏\"‏ إن عبدا أصاب ذنبا  وربما قال أذنب ذنبا  فقال رب أذنبت  وربما قال أصبت  فاغفر لي فقال ربه أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي‏.‏ ثم مكث ما شاء الله، ثم أصاب ذنبا أو أذنب ذنبا، فقال رب أذنبت  أو أصبت  آخر فاغفره‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي، ثم مكث ما شاء الله ثم أذنب ذنبا  وربما قال أصاب ذنبا  قال قال رب أصبت  أو أذنبت  آخر فاغفره لي‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي  ثلاثا  فليعمل ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If somebody commits a sin and then says, 'O my Lord! I have sinned, please forgive me!' and his Lord says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sins).' Then he remains without committing any sin for a while and then again commits another sin and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sin). Then he remains without Committing any another sin for a while and then commits another sin (for the third time) and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord Who forgives sins and punishes for it I therefore have forgiven My slave (his sin), he can do whatever he likes.\"",
      "usc_msa_ref": "598",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1523",
      "hadith_no": "1523",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا المغيرة بن سلمة المخزومي، حدثنا عبد الواحد، - وهو ابن زياد - حدثنا عثمان بن حكيم، حدثنا عبد الرحمن بن أبي عمرة، قال دخل عثمان بن عفان المسجد بعد صلاة المغرب فقعد وحده فقعدت إليه فقال يا ابن أخي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى العشاء في جماعة فكأنما قام نصف الليل ومن صلى الصبح في جماعة فكأنما صلى الليل كله ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abd 'Amr reported:                      'Uthman b. 'Affan (narrated the mosque after evening prayer and sat alone. I also sat alone with him, so he said: 0, son of m brother, I heard tile Messenger of Allah (may peace be upon him) say: He who observed the 'Isya' prayer in congregation, it was as if he prayed up to the midnight, and he who prayed the morning prayer in congregation, it was as if he prayed the whole night.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20570",
        "20256",
        "11889",
        "1238"
      ]
    },
    {
      "id": "sahih-muslim-7162",
      "hadith_no": "7162",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا حماد بن سلمة، عن إسحاق بن عبد الله، بن أبي طلحة عن عبد الرحمن بن أبي عمرة، عن أبي هريرة، عن النبي صلى الله عليه وسلم فيما يحكي عن ربه عز وجل قال ‏\"‏ أذنب عبد ذنبا فقال اللهم اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى أذنب عبدي ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب ‏.‏ ثم عاد فأذنب فقال أى رب اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى عبدي أذنب ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب ‏.‏ ثم عاد فأذنب فقال أى رب اغفر لي ذنبي ‏.‏ فقال تبارك وتعالى أذنب عبدي ذنبا فعلم أن له ربا يغفر الذنب ويأخذ بالذنب واعمل ما شئت فقد غفرت لك ‏\"‏ ‏.‏ قال عبد الأعلى لا أدري أقال في الثالثة أو الرابعة ‏\"‏ اعمل ما شئت ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from Allah's Messenger (may peace be upon him) that his Lord, the Exalted and Glorious, thus said. A servant committed a sin and he said:                      O Allah, forgive me my sins, and Allah (the Exalted and Glorious) said: My servant commited a sin and then he came to realise that he has a Lord Who forgives the sins and takes to account (the sinner) for the sin. He then again committed a sin and said: My Lord, forgive me my sin, and Allah, the Exalted and High, said: My servant committed a sin and then came to realise that he has a Lord Who would forgive his sin or would take (him) to account for the sin. He again committed a sin and said: My Lord, forgive me for my sin, and Allah (the Exalted and High) said: My servant sas committed a sin and then came to realise that he has a Lord Who forgives the sins or takes (him) to account for sin. 0 servant, do what you like. I have granted you forgiveness. 'Abd al-A'la said: I do not know whether he said thrice or four times to do\" what you desire\". The hadlth has been narrated on the authority of 'Abd al-A'la b. Hammad with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30146",
        "20021",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7620",
      "hadith_no": "7620",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى فأراد الله أن يبتليهم فبعث إليهم ملكا فأتى الأبرص فقال أى شىء أحب إليك قال لون حسن وجلد حسن ويذهب عني الذي قد قذرني الناس ‏.‏ قال فمسحه فذهب عنه قذره وأعطي لونا حسنا وجلدا حسنا قال فأى المال أحب إليك قال الإبل - أو قال البقر شك إسحاق - إلا أن الأبرص أو الأقرع قال أحدهما الإبل وقال الآخر البقر - قال فأعطي ناقة عشراء فقال بارك الله لك فيها - قال - فأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن ويذهب عني هذا الذي قذرني الناس ‏.‏ قال فمسحه فذهب عنه وأعطي شعرا حسنا - قال - فأى المال أحب إليك قال البقر ‏.‏ فأعطي بقرة حاملا فقال بارك الله لك فيها - قال - فأتى الأعمى فقال أى شىء أحب إليك قال أن يرد الله إلى بصري فأبصر به الناس - قال - فمسحه فرد الله إليه بصره ‏.‏ قال فأى المال أحب إليك قال الغنم ‏.‏ فأعطي شاة والدا فأنتج هذان وولد هذا - قال - فكان لهذا واد من الإبل ولهذا واد من البقر ولهذا واد من الغنم ‏.‏ قال ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين قد انقطعت بي الحبال في سفري فلا بلاغ لي اليوم إلا بالله ثم بك أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري ‏.‏ فقال الحقوق كثيرة ‏.‏ فقال له كأني أعرفك ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال إنما ورثت هذا المال كابرا عن كابر ‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏ قال وأتى الأقرع في صورته فقال له مثل ما قال لهذا ورد عليه مثل ما رد على هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت ‏.‏ قال وأتى الأعمى في صورته وهيئته فقال رجل مسكين وابن سبيل انقطعت بي الحبال في سفري فلا بلاغ لي اليوم إلا بالله ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري فقال قد كنت أعمى فرد الله إلى بصري فخذ ما شئت ودع ما شئت فوالله لا أجهدك اليوم شيئا أخذته لله فقال أمسك مالك فإنما ابتليتم فقد رضي عنك وسخط على صاحبيك ‏.‏",
      "text_en": " Abu Huraira, narrated that he beard Allah's Messenger (may peace be upon him) as saying:                      There were three persons in Bani Isra'il, one suffering from leprosy, the other bald-headed and the third one blind. Allah decided to test them. So He sent an angel who came to one who was suffering from leprosy and said: Which thing do you like most? He said: Beautiful colour and fine skin and removal of that which makes me detestable in the eye of people. He wiped him and his illness was no more and he was conferred upon beautiful colour and beautiful skin. He (the angel) again said: Which property do you like most? He said: Camels, or he said: The cow the narrator is, however, doubtful about it, but (out of the persons) suffering from leprosy or baldness one of them definitely said: The came]. And the other one said: Cow. And he (one who demanded came]) was bestowed upon a she-camel, in an advanced stage of pregnancy, and while giving he said: May Allah bless you in this I Then he came to the bald-headed person and said: Which thing do you like most? He said: Beautiful hair and that (this baldness) may be removed from me because of which people hate me He wiped his body and his illness was removed and he was bestowed upon beautiful hair, and the angel said: Which wealth do you like most? He said: The cow. And he was given a pregnant cow and while handing it over to him he (the angel) said: May Allah bless you in this I Then he came to the blind man and he said: Which thing do you like most? He said: Allah should restore my eyesight so that I should be able to see people with the help of that. He wiped his body and Allah restored to him his eyesight, and he (the angel) also said: Which wealth do you like most? He said. The flock of sheep. And he was given a pregnant goat and that gave birth to young ones and it so happened that one valley abounded in camels and the other one in goats and the third one in sheep. He then came to one suffering from leprosy in his (old) form and shape and he said: I am a poor person and my provision has run short in my journey and there is none to take me to my destination except with the help of Allah and your favour. I beg of you in His name Who gave you fine colour and fine skin, and the camel in the shape of wealth (to confer upon me) a camel which should carry me in my journey. He said: I have many responsibilities to discharge. Thereupon he said: I perceive as if I recognise you. Were you not suffering from leprosy whom people hated and you were a destitude and Allah conferred upon you (wealth) He said: I have inherited this property from my forefathers. Thereupon he said: If you are a liar may Allah change you to that very position in which you had been. He then came to the one who was bald-headed in his (old) form and said to him the same what he had said to him (one suffering from leprosy) and he gave him the same reply as he had given him and he said: If you 'are a liar, may Allah turn you to your previous position in which you had been. And then he came to the blind man in his (old) form and shape and he said: I am a destitute person and a wayfarer. My provision have ran short and today there is no way to reach the destination but with the help of Allah and then with your help and I beg of you in the (name) of One Who restored your eyesight and gave you the flock of sheep to give me a sheep by which I should be able to make my provisions for the journey. He said: I was blind and Allah restored to me my eyesight; you take whatever you like and leave whatever you like. By Allah. I shall not stand in your way today for what you take in the name of God. Thereupon, he said: You keep with you what you have (in your possession). The fact is that you three were put to test and Allah is well pleased with you and He is annoyed with your companions.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20297",
        "11151",
        "1238",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-555",
      "hadith_no": "555",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسحاق بن يوسف، حدثنا سفيان، عن أبي سهل، - يعني عثمان بن حكيم - حدثنا عبد الرحمن بن أبي عمرة، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى العشاء في جماعة كان كقيام نصف ليلة ومن صلى العشاء والفجر في جماعة كان كقيام ليلة ‏\"‏ ‏.‏",
      "text_en": " ‘Uthman b. ‘Affan reported the Messenger of Allah (may peace be him) as saying; if anyone says the night prayer in congregation, he is like one who keeps vigil (in prayer) till midnight; and he who says both the night and dawn prayer in congregation is like one who keeps vigil (in prayer) the whole night.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20411",
        "20012",
        "1238",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-3596",
      "hadith_no": "3596",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، وأحمد بن السرح، قالا أخبرنا ابن وهب، أخبرني مالك بن أنس، عن عبد الله بن أبي بكر، أن أباه، أخبره أن عبد الله بن عمرو بن عثمان بن عفان أخبره أن عبد الرحمن بن أبي عمرة الأنصاري أخبره أن زيد بن خالد الجهني أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته أو يخبر بشهادته قبل أن يسألها ‏\"‏ ‏.‏ شك عبد الله بن أبي بكر أيتهما قال ‏.‏ قال أبو داود قال مالك الذي يخبر بشهادته ولا يعلم بها الذي هي له ‏.‏ قال الهمداني ويرفعها إلى السلطان ‏.‏ قال ابن السرح أو يأتي بها الإمام ‏.‏ والإخبار في حديث الهمداني ‏.‏ قال ابن السرح ابن أبي عمرة ‏.‏ لم يقل عبد الرحمن ‏.‏",
      "text_en": " Zaid bin Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:                      \"Shall I not tell you of the best witnesses ? He is the one who produces his deposition or gives his evidence (the narrator is doubtful) before he is asked for it.\" 'Abd Allah bin Abi Bakr dobted which of them he said.Abu Dawud said: Malis said: This refers to a man gives his evidence, but he does not know for whom it is meant. Al-Hamdani said: \"He should inform the authorities. Ibn al-Sarh said: \"He should give it to the ruler. The work ikhbar (inform) occurs in the version of al-Hamdani.\" Ibn al-Sarh said: \"Ibn Abi 'Amrah and not 'Abd al-Rahman.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20001",
        "11104",
        "11239",
        "10933",
        "1238",
        "3625"
      ]
    },
    {
      "id": "sunan-abi-daud-4820",
      "hadith_no": "4820",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا القعنبي، حدثنا عبد الرحمن بن أبي الموال، عن عبد الرحمن بن أبي عمرة الأنصاري، عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير المجالس أوسعها ‏\"‏ ‏.‏ قال أبو داود هو عبد الرحمن بن عمرو بن أبي عمرة الأنصاري ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     I heard the Messenger of Allah (ﷺ) as saying: The best places to sit are those which provide most room.Abu Dawud said: The name of 'Abd al-Rahman b. Abi 'Amr is 'Abd al-Rahman b. 'Amr b. Abi 'Umrat al-Ansari.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20441",
        "1238",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-221",
      "hadith_no": "221",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا بشر بن السري، حدثنا سفيان، عن عثمان بن حكيم، عن عبد الرحمن بن أبي عمرة، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد العشاء في جماعة كان له قيام نصف ليلة ومن صلى العشاء والفجر في جماعة كان له كقيام ليلة ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة وأنس وعمارة بن رويبة وجندب بن عبد الله بن سفيان البجلي وأبى بن كعب وأبي موسى وبريدة ‏.‏ قال أبو عيسى حديث عثمان حديث حسن ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن أبي عمرة عن عثمان موقوفا وروي من غير وجه عن عثمان مرفوعا ‏.‏",
      "text_en": " Uthman bin Affan narrated that :                     Allah's Messenger said: \"Whoever attends Isha (prayer) in congregation, then he has (the reward as if he had) stood half of the night. And whoever prays Isha and Fajr in congregation, then he has (the reward as if he had) spend the entire night standing (in prayer).\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11889",
        "1238",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1892",
      "hadith_no": "1892",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن يزيد بن يزيد بن جابر، عن عبد الرحمن بن أبي عمرة، عن جدته، كبشة قالت دخل على رسول الله صلى الله عليه وسلم فشرب من في قربة معلقة قائما فقمت إلى فيها فقطعته ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ويزيد بن يزيد بن جابر هو أخو عبد الرحمن بن يزيد بن جابر وهو أقدم منه موتا ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi 'Amrah:                     From his grandmother Kabshah who said: \"The Messenger of Allah (ﷺ) entered upon me. He drank from a hanging water-skin while standing. So I went to its mouth and cut it off.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. Yazid bin Yazid bin Jabir is the brother of 'Adbur-Rahman bin Yazid bin Jabir. He died earlier than him.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "10885",
        "1238"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2466",
      "hadith_no": "2466",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا بشر بن آدم ابن بنت أزهر السمان، حدثنا زيد بن الحباب، حدثنا أبى بن عباس بن سهل بن سعد، حدثني أبو بكر بن محمد بن عمرو بن حزم، حدثني عبد الله بن عمرو بن عثمان، حدثني خارجة بن زيد بن ثابت، حدثني عبد الرحمن بن أبي عمرة، حدثني زيد بن خالد الجهني، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الشهداء من أدى شهادته قبل أن يسألها ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah(s.a.w)   said:                     \"The best of witnesses is the one who gives his testimony before  being asked  for it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30125",
        "20650",
        "11239",
        "10933",
        "11006",
        "1238",
        "3625"
      ]
    },
    {
      "id": "sunan-ibn-majah-2364-2",
      "hadith_no": "2364",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن عبد الرحمن الجعفي، قالا حدثنا زيد بن الحباب العكلي، أخبرني أبى بن عباس بن سهل بن سعد الساعدي، حدثني أبو بكر بن عمرو بن حزم، حدثني محمد بن عبد الله بن عمرو بن عثمان بن عفان، حدثني خارجة بن زيد بن ثابت، أخبرني عبد الرحمن بن أبي عمرة الأنصاري، أنه سمع زيد بن خالد الجهني، يقول إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ خير الشهود من أدى شهادته قبل أن يسألها ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani said that he heard the Messenger of Allah (ﷺ) say:                     “The best of witnesses is the one who gives his testimony before he is asked for it.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "14346",
        "20650",
        "22187",
        "11006",
        "1238"
      ]
    },
    {
      "id": "sunan-ibn-majah-3549",
      "hadith_no": "3549",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن يزيد بن يزيد بن جابر، عن عبد الرحمن بن أبي عمرة، عن جدة، له يقال لها كبشة الأنصارية أن رسول الله  صلى الله عليه وسلم  دخل عليها وعندها قربة معلقة فشرب منها وهو قائم فقطعت فم القربة تبتغي بركة موضع في رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Abi ‘Amrah, from a grandmotherofhis who was called Kabshah Al-Ansariyyah, that the Messenger ofAllah(ﷺ) entered upon her, and there was a water skin hangingthere. Hedrank from it while standing, and she cut off the mouth ofthe waterskin, seeking the blessing of the place where the mouth oftheMessenger of Allah (ﷺ) had been.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "10885",
        "1238"
      ]
    }
  ],
  "total_hadiths": 24
}