{
  "id": "12391",
  "name": "'Umar bin 'Abdullah عمر بن عبد الله المدني",
  "full_name": "'Umar bin 'Abdullah عمر بن عبد الله المدني",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "146",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  -  ضعيف ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11114",
      "name": "Abu al-Aswad al-Du'ali أبو الأسود الديلي/الدؤلي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19297",
      "name": "Abu Tarayf, Client أبو طريف مولى عبد الرحمن بن طلحة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18548",
      "name": "'Abdullah bin 'Ali عبد الله بن علي بن السائب بن عبيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18008",
      "name": "Ibrahim bin Muhammad bin 'Ali إبراهيم بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20702",
      "name": "'Abdur Rahman bin Abi Rajal عبد الرحمن بن أبي الرجال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4692",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمر بن محمد، عن عمر، مولى غفرة عن رجل، من الأنصار عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل أمة مجوس ومجوس هذه الأمة الذين يقولون لا قدر من مات منهم فلا تشهدوا جنازته ومن مرض منهم فلا تعودوهم وهم شيعة الدجال وحق على الله أن يلحقهم بالدجال ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah reported the Messenger of Allah (May peace be upon him) as saying :                      Every people have Magians, and the Magians of this community are those who declare that there is no destination by Allah. If any one of them dies, do not attend his funeral, and if any one of them is ill, do not pay a sick visit to him. They are the partisans of the Antichrist (Dajjal), and Allah will surely join with the Antichrist.",
      "chain": [
        "28531",
        "20012",
        "11530",
        "12391",
        "145"
      ]
    },
    {
      "hadith_no": "3999",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو جعفر، محمد بن الحسين بن أبي حليمة من قصر الأحنف وأحمد بن عبدة الضبي وعلي بن حجر المعنى واحد قالوا حدثنا عيسى بن يونس، حدثنا عمر بن عبد الله، مولى غفرة حدثني إبراهيم بن محمد، من ولد علي بن أبي طالب قال كان علي رضى الله عنه إذا وصف النبي صلى الله عليه وسلم قال لم يكن بالطويل الممغط ولا بالقصير المتردد وكان ربعة من القوم ولم يكن بالجعد القطط ولا بالسبط كان جعدا رجلا ولم يكن بالمطهم ولا بالمكلثم وكان في الوجه تدوير أبيض مشرب أدعج العينين أهدب الأشفار جليل المشاش والكتد أجرد ذو مسربة شثن الكفين والقدمين إذا مشى تقلع كأنما يمشي في صبب وإذا التفت التفت معا بين كتفيه خاتم النبوة وهو خاتم النبيين أجود الناس كفا وأشرحهم صدرا وأصدق الناس لهجة وألينهم عريكة وأكرمهم عشرة من رآه بديهة هابه ومن خالطه معرفة أحبه يقول ناعته لم أر قبله ولا بعده مثله ‏.‏ قال أبو عيسى هذا حديث حسن غريب ليس إسناده بمتصل ‏.‏ قال أبو جعفر سمعت الأصمعي يقول في تفسيره صفة النبي صلى الله عليه وسلم الممغط الذاهب طولا ‏.‏ وسمعت أعرابيا يقول تمغط في نشابة أى مدها مدا شديدا ‏.‏ وأما المتردد فالداخل بعضه في بعض قصرا وأما القطط فالشديد الجعودة والرجل الذي في شعره حجونة قليلا وأما المطهم فالبادن الكثير اللحم وأما المكلثم فالمدور الوجه ‏.‏ وأما المشرب فهو الذي في بياضه حمرة والأدعج الشديد سواد العين والأهدب الطويل الأشفار والكتد مجتمع الكتفين وهو الكاهل والمسربة هو الشعر الدقيق الذي هو كأنه قضيب من الصدر إلى السرة ‏.‏ والشثن الغليظ الأصابع من الكفين والقدمين والتقلع أن يمشي بقوة والصبب الحدور يقول انحدرنا في صبوب وصبب وقوله جليل المشاش يريد رءوس المناكب والعشيرة الصحبة والعشير الصاحب والبديهة المفاجأة يقال بدهته بأمر أى فجأته ‏.‏",
      "text_en": " Narrated Ibrahim bin Muhammad, one of the offspring of 'Ali bin Abi Talib:                     said: \"When 'Ali [may Allah be pleased with him] described the Prophet (ﷺ) he would say: 'He was not extremely tall (Mummaghit), nor was he extremely short (Mutaraddid), and he was of medium height in relation to the people. The wave of his hair was not completely curly (Qatat), nor straight, but it was in between. He did not have a large head, nor a small head (Mukaltham), his face was round and a blended-white color (Mushrab), his eyes were dark black (Ad'aj), his eye-lashes were long (Ahdab). He was big-boned and broad shouldered (Al-Katad), his body hair was well-placed, and he had a Masrubah, his hands and feet were thick (Shathn). When he walked he walked briskly (Taqalla'), he leaned forward as if he was walking on a decline (Sabab). And if he turned his head, his body turned as well, between his two shoulders was the seal of Prophethood, and he was the seal of the Prophets. He was the most generous of people [in hand, and the most big-hearted of them] in breast. He was the most truthful of people in speech, the softest of them in nature, and the most noble of them in his relations ('Ishrah). Whoever saw him for the first time (Badihah) would fear him, and whoever got to know him, loved him. The one who tried to describe him would have to say: 'I have not seen before him or after him anyone who resembles him (ﷺ).'\"",
      "chain": [
        "20347",
        "12391",
        "5"
      ]
    }
  ],
  "total_hadiths": 2
}