{
  "id": "12404",
  "name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
  "full_name": "'Amr bin 'Alqama bin Waqqas عمرو بن علقمة بن وقاص الليثي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ت  س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Laithi",
      "B.Kinana",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "11042",
      "name": "'Alqama bin Waqqas علقمة بن وقاص",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "18546",
      "name": "'Abdullah bin 'Alqama عبد الله بن علقمة بن وقاص الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11042",
      "name": "'Alqama bin Waqqas علقمة بن وقاص",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-2319",
      "hadith_no": "2319",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن محمد بن عمرو، حدثني أبي، عن جدي، قال سمعت بلال بن الحارث المزني، صاحب رسول الله صلى الله عليه وسلم يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أحدكم ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيكتب الله له بها رضوانه إلى يوم يلقاه وإن أحدكم ليتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيكتب الله عليه بها سخطه إلى يوم يلقاه ‏\"‏ ‏.‏ قال وفي الباب عن أم حبيبة ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وهكذا رواه غير واحد عن محمد بن عمرو نحو هذا قالوا عن محمد بن عمرو عن أبيه عن جده عن بلال بن الحارث ‏.‏ وروى هذا الحديث مالك عن محمد بن عمرو عن أبيه عن بلال بن الحارث ولم يذكر فيه عن جده ‏.‏",
      "text_en": " Muhammed bin 'Amr narrated from his father, from his grandfather who said:                      \"I heard Bilal bin Al-Harith Al Muzani, the Companion of the Messenger of Allah (s.a.w) saying: 'I heard the Messenger of Allah (s.a.w) saying:\"Indeed one of you says a statement pleasing to Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His pleasure until the Day of Meeting Him. And one of you says a statement angering Allah, not realizing that you have achieved what you have achieved. Then for it, Allah writes for him His anger until the Day of Meeting with Him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11220",
        "12404"
      ]
    },
    {
      "id": "sunan-ibn-majah-4104",
      "hadith_no": "4104",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني أبي، عن أبيه، علقمة بن وقاص قال مر به رجل له شرف فقال له علقمة إن لك رحما وإن لك حقا وإني رأيتك تدخل على هؤلاء الأمراء وتتكلم عندهم بما شاء الله أن تتكلم به وإني سمعت بلال بن الحارث المزني صاحب رسول الله  صلى الله عليه وسلم  يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحدكم ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيكتب الله عز وجل له بها رضوانه إلى يوم القيامة وإن أحدكم ليتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيكتب الله عز وجل عليه بها سخطه إلى يوم يلقاه ‏\"‏ ‏.‏ قال علقمة فانظر ويحك ماذا تقول وماذا تكلم به فرب كلام - قد - منعني أن أتكلم به ما سمعت من بلال بن الحارث ‏.‏",
      "text_en": " It was narrated that ‘Alqamah bin Waqqas said that a man passed byhim, who held a prominent position, and ‘Alqamah said to him:                      “Youhave kinship and rights, and I see you entering upon these rulers andspeaking to them as Allah wills you should speak. But i heard Bilalbin Harith Al-Muzani, the Companion of the Messenger of Allah (ﷺ),say that the Messenger of Allah (ﷺ) said: ‘One of you may speak aword that pleases Allah, and not know how far it reaches, but Allahwill record for him as pleasure, until the Day of Resurrection due tothat word. And one of you may speak a word that angers Allah, and notknow how far it reaches, but Allah will record against him his anger,until the Day he meets Him due to that word.”'Alqamah said: \"So look, woe to you, at what you say and what you speak about, for there is something that I wanted to say but I refrained because of what I heard from Bilal bin Harith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "12404"
      ]
    }
  ],
  "total_hadiths": 2
}