{
  "id": "12489",
  "name": "Muhammad bin Hilal bin Aby محمد بن هلال بن أبي هلال المدني",
  "full_name": "Muhammad bin Hilal bin Aby محمد بن هلال بن أبي هلال المدني",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "162",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرني زيد بن حباب، أخبرني محمد بن هلال، حدثني أبي أنه، سمع أبا هريرة، يقول ‏:‏ كانت يمين رسول الله صلى الله عليه وسلم إذا حلف يقول ‏:‏ ‏\"‏ لا، وأستغفر الله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) swore an oath, it was: No, and I beg forgiveness of Allah.",
      "chain": [
        "30379",
        "20650",
        "12489",
        "13"
      ]
    },
    {
      "hadith_no": "4775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو عامر، حدثنا محمد بن هلال، سمع أباه، يحدث قال قال أبو هريرة وهو يحدثنا كان النبي صلى الله عليه وسلم يجلس معنا في المجلس يحدثنا فإذا قام قمنا قياما حتى نراه قد دخل بعض بيوت أزواجه فحدثنا يوما فقمنا حين قام فنظرنا إلى أعرابي قد أدركه فجبذه بردائه فحمر رقبته قال أبو هريرة وكان رداء خشنا فالتفت فقال له الأعرابي احمل لي على بعيرى هذين فإنك لا تحمل لي من مالك ولا من مال أبيك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا وأستغفر الله لا وأستغفر الله لا وأستغفر الله لا أحمل لك حتى تقيدني من جبذتك التي جبذتني ‏\"‏ ‏.‏ فكل ذلك يقول له الأعرابي والله لا أقيدكها ‏.‏ فذكر الحديث قال ثم دعا رجلا فقال له ‏\"‏ احمل له على بعيريه هذين على بعير شعيرا وعلى الآخر تمرا ‏\"‏ ‏.‏ ثم التفت إلينا فقال ‏\"‏ انصرفوا على بركة الله تعالى ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to sit with us in meetings and talk to us. When he stood up we also used to stand up and see him entering the house of one of his wives. One day he talked to us and we stood up as he stood up and we saw that an Arabi (a nomadic Arab) caught hold of him and gave his cloak a violent tug making his neck red.  AbuHurayrah said: The cloak was coarse. He turned to him and the Arabi said to him: Load these two camels of mine, for you do not give me anything from your property or from your father's property.  The Prophet (ﷺ) said to him: No, I ask Allah's forgiveness; no, I ask Allah's forgiveness; no, I ask Allah's forgiveness. I shall not give you the camel-load until you make amends for the way in which you tugged at me.  Each time the Arabi said to him: I swear by Allah, I shall not do so.  He then mentioned the rest of the tradition. He (the Prophet), then called a man and said to him: Load these two camels of his: one camel with barley and the other with dates. He then turned to us and said: Go on your way with the blessing of Allah.",
      "chain": [
        "30524",
        "20443",
        "12489"
      ]
    },
    {
      "hadith_no": "4912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وأحمد بن سعيد السرخسي، أن أبا عامر، أخبرهم قال حدثنا محمد بن هلال، قال حدثني أبي، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لمؤمن أن يهجر مؤمنا فوق ثلاث فإن مرت به ثلاث فليلقه فليسلم عليه فإن رد عليه السلام فقد اشتركا في الأجر وإن لم يرد عليه فقد باء بالإثم ‏\"‏ ‏.‏ زاد أحمد ‏\"‏ وخرج المسلم من الهجرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not allowable for a believer to keep from a believer for more than three days. If three days pass, he should meet him and give him a salutation, and if he replies to it they will both have shared in the reward; but if he does not reply he will bear his sin (according to Ahmad's version) and the one who gives the salutation will have come forth from the sin of keeping apart.",
      "chain": [
        "30024",
        "30296",
        "20443",
        "12489",
        "13"
      ]
    },
    {
      "hadith_no": "4776",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثني القعنبي، قال حدثني محمد بن هلال، عن أبيه، عن أبي هريرة، قال كنا نقعد مع رسول الله صلى الله عليه وسلم في المسجد فإذا قام قمنا فقام يوما وقمنا معه حتى لما بلغ وسط المسجد أدركه رجل فجبذ بردائه من ورائه - وكان رداؤه خشنا - فحمر رقبته فقال يا محمد احمل لي على بعيرى هذين فإنك لا تحمل من مالك ولا من مال أبيك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا وأستغفر الله لا أحمل لك حتى تقيدني مما جبذت برقبتي ‏\"‏ ‏.‏ فقال الأعرابي لا والله لا أقيدك ‏.‏ فقال رسول الله صلى الله عليه وسلم ذلك ثلاث مرات كل ذلك يقول لا والله لا أقيدك ‏.‏ فلما سمعنا قول الأعرابي أقبلنا إليه سراعا فالتفت إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ عزمت على من سمع كلامي أن لا يبرح مقامه حتى آذن له ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم لرجل من القوم ‏\"‏ يا فلان احمل له على بعير شعيرا وعلى بعير تمرا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ انصرفوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"We would sit with the Messenger of Allah in the Masjid and when he stood up, we would stand up too, Only day he stood up and we stood up with him, and when he reached the middle of the Masjid, a man caught up with him and pulled roughly on his Rida' (upper-warp) from behind. His Rida 'was of rough material, and that left a red mark on his neck. He said: 'O Muhammad! Load up these two camels of mine, for you are not giving me anything from your wealth or the wealth of your father!' The Messenger of Allah said: 'The Messenger of Allah said: 'No, and I pray for Allah's forgiveness. I will not load anything (onto your camels) untily you let me retaliate for your pulling roughly (on my cloak and leaving a mark on) my neck.' The Bedouin said: 'No, by Allah, I will not let you retaliate., The Messenger of Allah said that three times, and each time the man said: 'No, by Allah, I will not let you retaliate., When we heard what the Bedouin said, we turned toward him quickly. The Messenger of Allah turned to us and said; 'I urge anyone who hears me not to leave his place until give him permission. Then the Messenger of Allah said: 'O so and so, load one of his camels with barley and the other with dates.' Then the Messenger of Allah said: 'Leave,\"'",
      "chain": [
        "38556",
        "20164",
        "12489",
        "13"
      ]
    },
    {
      "hadith_no": "2171",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حماد بن خالد، ح وحدثنا يعقوب بن حميد بن كاسب، حدثنا معن بن عيسى، جميعا عن محمد بن هلال، عن أبيه، عن أبي هريرة، قال كانت يمين رسول الله  صلى الله عليه وسلم  ‏\"‏ لا وأستغفر الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The swearing of the Messenger of Allah (ﷺ) was: 'No, and I ask Allah for forgiveness.\"'",
      "chain": [
        "30201",
        "20537",
        "32048",
        "30112",
        "12489",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}