{
  "id": "12496",
  "name": "Mahrar bin Abi Huraira محرر بن أبي هريرة الدوسي المدني",
  "full_name": "Mahrar bin Abi Huraira محرر بن أبي هريرة الدوسي المدني",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Dausi",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2958",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، وعثمان بن عمر، قالا حدثنا شعبة، عن المغيرة، عن الشعبي، عن المحرر بن أبي هريرة، عن أبيه، قال جئت مع علي بن أبي طالب حين بعثه رسول الله صلى الله عليه وسلم إلى أهل مكة ببراءة قال ‏\"‏ ما كنتم تنادون ‏\"‏ ‏.‏ قال كنا ننادي ‏\"‏ إنه لا يدخل الجنة إلا نفس مؤمنة ولا يطوف بالبيت عريان ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فأجله أو أمده إلى أربعة أشهر فإذا مضت الأربعة أشهر فإن الله بريء من المشركين ورسوله ولا يحج بعد العام مشرك ‏\"‏ ‏.‏ فكنت أنادي حتى صحل صوتي ‏.‏",
      "text_en": " It was narrated from Muharrar bin Abi Hurairah that his father said:                     \"I came with Ali bin Abi Talib when the Messenger of Allah sent him to the people of Makkah with news of the dissolution of treaty obligations.\" He said: \"How did you announced that no one would enter Paradise but a believing soul, no one was to circumambulate the House naked: whoever had a treaty with the Messenger of Allah, then for its period, or, it extended to four months, and when four months had passed, and that Allah is free from (all) obligations to the idolaters and so is His Messenger. No idolater was to perform Hajj after this year. I kept on announcing it until my vice grew hoarse.\"",
      "chain": [
        "30160",
        "20278",
        "20262",
        "20020",
        "166",
        "11052",
        "12496",
        "13"
      ]
    },
    {
      "hadith_no": "2003",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا إسحاق بن عيسى، حدثنا ابن لهيعة، حدثني جعفر بن ربيعة، عن الزهري، عن المحرر بن أبي هريرة، عن أبيه، عن عمر بن الخطاب، قال نهى رسول الله  صلى الله عليه وسلم  أن يعزل عن الحرة إلا بإذنها ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     “The Messenger of Allah forbade practicing coitus interruptus with a free woman except with her consent.”",
      "chain": [
        "30115",
        "20624",
        "11407",
        "11013",
        "12496",
        "13",
        "3"
      ]
    }
  ],
  "total_hadiths": 2
}