{
  "id": "12514",
  "name": "Ma'mr bin 'Abdullah معمر بن عبد الله بن حنظلة",
  "full_name": "Ma'mr bin 'Abdullah معمر بن عبد الله بن حنظلة",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  مقبول ]"
    ],
    "tags": [
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2214",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يحيى بن آدم، حدثنا ابن إدريس، عن محمد بن إسحاق، عن معمر بن عبد الله بن حنظلة، عن يوسف بن عبد الله بن سلام، عن خويلة بنت مالك بن ثعلبة، قالت ظاهر مني زوجي أوس بن الصامت فجئت رسول الله صلى الله عليه وسلم أشكو إليه ورسول الله صلى الله عليه وسلم يجادلني فيه ويقول ‏\"‏ اتقي الله فإنه ابن عمك ‏\"‏ ‏.‏ فما برحت حتى نزل القرآن ‏{‏ قد سمع الله قول التي تجادلك في زوجها ‏}‏ إلى الفرض فقال ‏\"‏ يعتق رقبة ‏\"‏ ‏.‏ قالت لا يجد قال ‏\"‏ فيصوم شهرين متتابعين ‏\"‏ ‏.‏ قالت يا رسول الله إنه شيخ كبير ما به من صيام ‏.‏ قال ‏\"‏ فليطعم ستين مسكينا ‏\"‏ ‏.‏ قالت ما عنده من شىء يتصدق به قالت فأتي ساعتئذ بعرق من تمر قلت يا رسول الله فإني أعينه بعرق آخر ‏.‏ قال ‏\"‏ قد أحسنت اذهبي فأطعمي بها عنه ستين مسكينا وارجعي إلى ابن عمك ‏\"‏ ‏.‏ قال والعرق ستون صاعا قال أبو داود في هذا إنها كفرت عنه من غير أن تستأمره ‏.‏ وقال أبو داود وهذا أخو عبادة بن الصامت ‏.‏",
      "text_en": " Narrated Khuwaylah, daughter of Malik ibn Tha'labah:                     My husband, Aws ibn as-Samit, pronounced the words: You are like my mother. So I came to the Messenger of Allah (ﷺ), complaining to him about my husband.  The Messenger of Allah (ﷺ) disputed with me and said: Remain dutiful to Allah; he is your cousin.  I continued (complaining) until the Qur'anic verse came down: \"Certainly has Allah heard the speech of the one who argues with you, [O Muhammad], concerning her husband...\" [58:1] till the prescription of expiation.  He then said: He should set free a slave.  She said: He cannot afford it.  He said: He should fast for two consecutive months.  She said: Messenger of Allah, he is an old man; he cannot keep fasts.  He said: He should feed sixty poor people.  She said: He has nothing which he may give in alms. At that moment an araq (i.e. date-basket holding fifteen or sixteen sa's) was brought to him.  I said: I shall help him with another date-basked ('araq).  He said: You have done well. Go and feed sixty poor people on his behalf, and return to your cousin.  The narrator said: An araq holds sixty sa's of dates.Abu Dawud said: She atoned on his behalf without seeking his permission.Abu Dawud said: This man (Aws b. al-Samit) is the brother of 'Ubadah b. al-Samit.",
      "chain": [
        "30115",
        "20364",
        "20102",
        "11107",
        "12514",
        "5335"
      ]
    }
  ],
  "total_hadiths": 1
}