{
  "id": "12532",
  "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
  "full_name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "151",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ت  ق  -  منكر الحديث ]"
    ],
    "tags": [
      "B.Taym",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1823",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو النضر، هاشم بن القاسم قال حدثنا زياد بن عبد الله بن علاثة، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن جابر بن عبد الله، وأنس بن مالك، قالا كان رسول الله صلى الله عليه وسلم إذا دعا على الجراد قال ‏\"‏ اللهم أهلك الجراد اقتل كباره وأهلك صغاره وأفسد بيضه واقطع دابره وخذ بأفواههم عن معاشنا وأرزاقنا إنك سميع الدعاء ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله كيف تدعو على جند من أجناد الله بقطع دابره قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها نثرة حوت في البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وموسى بن محمد بن إبراهيم التيمي قد تكلم فيه وهو كثير الغرائب والمناكير وأبوه محمد بن إبراهيم ثقة وهو مدني ‏.‏",
      "text_en": " Narrated At-Taimi:                     From Jabir bin 'Abdullah and Anas bin Malik who said: \"When the Messenger of Allah (ﷺ) supplicated against locusts he would say: 'O Allah! Destroy the locusts, kill the large among him, and destroy the small, spoil his core, and cut off his rear. Take their mouths from our livelihood and our sustenance. Verily, You indeed listen to the supplication!' So a  man said: 'O Messenger of Allah! How is it that you supplicate against one of the Allah's armies that He cut off their rear?'\" He said: \"So the Messenger of Allah (ﷺ) said: 'They are bit scattered from a fish in the ocean.'\"[Abu 'Eisa said:] This Hadith is Gharib. We do not know of it except from this route. And Musa bin Muhammad bin Ibrahim At-Taimi has been criticized. He narrates many Gharib and Munkar narrations. His father Muhammad bin Ibrahim is trustworthy, and he is from Al-Madinah.",
      "chain": [
        "30277",
        "20390",
        "28189",
        "12532",
        "34",
        "19"
      ]
    },
    {
      "hadith_no": "2231",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن سعيد الأشج، حدثنا عقبة بن خالد السكوني، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخلتم على المريض فنفسوا له في أجله فإن ذلك لا يرد شيئا ويطيب نفسه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (S.A.W) said:                     \"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"",
      "chain": [
        "20344",
        "12532",
        "38"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد السكوني، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دخلتم على المريض فنفسوا له في الأجل فإن ذلك لا يرد شيئا وهو يطيب بنفس المريض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “When you enter upon one who is sick, cheer him up andgive him hope of a long life, for that does not change anything (ofthe Divine Decree), but it will cheer the heart of the one who issick.”",
      "chain": [
        "30201",
        "20344",
        "12532",
        "38"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد، عن موسى بن محمد بن إبراهيم التيمي، أخبرني أبي، عن أبي سعيد الخدري، قال مر النبي  صلى الله عليه وسلم  برجل وهو يجر شاة بأذنها فقال ‏\"‏ دع أذنها وخذ بسالفتها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Prophet (ﷺ)passed by a man who was dragging a sheep by its ear. He said: ‘Leaveits ear alone and hold it by the sides of its neck.’”",
      "chain": [
        "30201",
        "20344",
        "12532",
        "38"
      ]
    },
    {
      "hadith_no": "3306",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا عقبة بن خالد، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن أبي سعيد الخدري، قال نهى رسول الله  صلى الله عليه وسلم  أن يمثل بالبهائم ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) forbade mutilating animals.”",
      "chain": [
        "30201",
        "11184",
        "20344",
        "12532",
        "38"
      ]
    }
  ],
  "total_hadiths": 5
}