{
  "id": "12592",
  "name": "Yazid bin Ayad bin J'dbh يزيد بن عياض بن جعدبة",
  "full_name": "Yazid bin Ayad bin J'dbh يزيد بن عياض بن جعدبة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Liar",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Liar] [ ت  ق  -  كذب ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Madni",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "26",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا يزيد بن هارون، عن يزيد بن عياض، عن أبي ثفال المري، عن رباح بن عبد الرحمن بن أبي سفيان بن حويطب، عن جدته بنت سعيد بن زيد، عن أبيها، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Rabah Bin Abdur-Rahman bin Abu Sufyan bin Huwaitib narrated :                     the same from his grandmother the daughter of Sa'eed bin Zaid, from her father, from the Prophet.",
      "chain": [
        "30115",
        "20472",
        "12592",
        "18108",
        "12091"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا يزيد بن عياض، عن عاصم بن عمر بن قتادة، ح وحدثنا محمد بن إسماعيل، قال حدثنا أحمد بن خالد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ ويزيد بن عياض ضعيف عند أهل الحديث ‏.‏ وحديث محمد بن إسحاق أصح ‏.‏",
      "text_en": " Rafi bin Khadij narrated:                     \"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"",
      "chain": [
        "30242",
        "20472",
        "12592",
        "11103",
        "34188",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أنبأنا يزيد بن عياض، حدثنا أبو ثفال، عن رباح بن عبد الرحمن بن أبي سفيان، أنه سمع جدته بنت سعيد بن زيد، تذكر أنها سمعت أباها، سعيد بن زيد يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا صلاة لمن لا وضوء له ولا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed bin Zaid said:                     \"The Messenger of Allah said: 'There is no prayer for one who does not have ablution, and there is no ablution for one who does not mention the Name of Allah (before it).'\"",
      "chain": [
        "30115",
        "20472",
        "12592"
      ]
    }
  ],
  "total_hadiths": 3
}