{
  "id": "12604",
  "name": "Y'aqub bin Abi Y'aqub يعقوب بن أبي يعقوب المدني",
  "full_name": "Y'aqub bin Abi Y'aqub يعقوب بن أبي يعقوب المدني",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود، وأبو عامر - وهذا لفظ أبي عامر - عن فليح بن سليمان، عن أيوب بن عبد الرحمن بن صعصعة الأنصاري، عن يعقوب بن أبي يعقوب، عن أم المنذر بنت قيس الأنصارية، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي عليه السلام وعلي ناقه ولنا دوالي معلقة فقام رسول الله صلى الله عليه وسلم يأكل منها وقام علي ليأكل فطفق رسول الله صلى الله عليه وسلم يقول لعلي ‏\"‏ مه إنك ناقه ‏\"‏ ‏.‏ حتى كف علي عليه السلام ‏.‏ قالت وصنعت شعيرا وسلقا فجئت به فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا علي أصب من هذا فهو أنفع لك ‏\"‏ ‏.‏ قال أبو داود قال هارون العدوية ‏.‏",
      "text_en": " Narrated Umm al-Mundhar bint Qays al-Ansariyyah:                     The Messenger of Allah (ﷺ) came to visit me, accompanied by Ali who was convalescing. We had some ripe dates hung up. The Messenger of Allah (ﷺ) got up and began to eat from them.  Ali also got up to eat, but the Messenger of Allah (ﷺ) said repeatedly to Ali: Stop, Ali, for you are convalescing, and Ali stopped.  She said: I then prepared some barley and beer-root and brought it.  The Messenger of Allah (ﷺ) then said: Take some of this, Ali, for it will be more beneficial for you.  AbuDawud said: The narrator Harun said: al-Adawiyyah (i.e. Umm al-Mundhar).",
      "chain": [
        "30524",
        "30002",
        "20443",
        "20169",
        "12604"
      ]
    },
    {
      "hadith_no": "2170",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن يعقوب بن أبي يعقوب، عن أم المنذر، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي ولنا دوال معلقة قالت فجعل رسول الله صلى الله عليه وسلم يأكل وعلي معه يأكل ‏.‏ فقال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ مه مه يا علي فإنك ناقه ‏\"‏ ‏.‏ قال فجلس علي والنبي صلى الله عليه وسلم يأكل ‏.‏ قالت فجعلت لهم سلقا وشعيرا فقال النبي صلى الله عليه وسلم ‏\"‏ يا علي من هذا فأصب فإنه أوفق لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث فليح ‏.‏ ويروى عن فليح عن أيوب بن عبد الرحمن ‏.‏",
      "text_en": " Umm Al-Mundhir said:                     The Messenger of Allah (s.a.w) entered upon me, while 'Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (s.a.w) said to 'Ali: 'Stop, stop, for you are still recovering.' So 'Ali sat and the Prophet ate.\" She said: 'I made some chard and barley for them, so the Prophet said: 'O 'Ali eat from this, for indeed it will be more suitable for you.\"",
      "chain": [
        "30585",
        "20393",
        "20169",
        "11525",
        "12604"
      ]
    },
    {
      "hadith_no": "3568",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن أيوب بن عبد الرحمن بن عبد الله بن أبي صعصعة، ح وحدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا فليح بن سليمان، عن أيوب بن عبد الرحمن، عن يعقوب بن أبي يعقوب، عن أم المنذر بنت قيس الأنصارية، قالت دخل علينا رسول الله  صلى الله عليه وسلم  ومعه علي بن أبي طالب وعلي ناقه من مرض ولنا دوالي معلقة وكان النبي  صلى الله عليه وسلم  يأكل منها فتناول علي ليأكل فقال النبي  صلى الله عليه وسلم  ‏\"‏ مه يا علي إنك ناقه ‏\"‏ ‏.‏ قالت فصنعت للنبي  صلى الله عليه وسلم  سلقا وشعيرا فقال النبي  صلى الله عليه وسلم  ‏\"‏ يا علي من هذا فأصب فإنه أنفع لك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Mundhir bint Qais Ansariyyah said:                      “TheMessengerof Allah (ﷺ) entered upon us, and with him was ‘Ali binAbuTalib, who had recently recovered from an illness. We had bunchesofunripe dates hanging up, and the Prophet (ﷺ) was eating fromthem.‘Ali reached out to eat some, and the Prophet (ﷺ) said to‘Ali:‘Stop, O ‘Ali! You have just recovered from an illness.’ I madesome greens and barley for the Prophet (ﷺ), and the Prophet (ﷺ)said to ‘Ali: ‘O ‘Ali, eat some of this, for it is better foryou.’”",
      "chain": [
        "30201",
        "20393",
        "20169",
        "30160",
        "20443",
        "20547",
        "20169",
        "12604"
      ]
    }
  ],
  "total_hadiths": 3
}