{
  "id": "12618",
  "name": "Abu Ja'far al-Qari' أبو جعفر القارئ",
  "full_name": "Abu Ja'far al-Qari' أبو جعفر القارئ",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  -  ثقة ]"
    ],
    "tags": [
      "B.Makhzum",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "22220",
      "name": "Naf' bin 'Abdur Rahman نافع بن عبد الرحمن بن أبي نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "510",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، سمعت أبا جعفر، يحدث عن مسلم أبي المثنى، عن ابن عمر، قال إنما كان الأذان على عهد رسول الله صلى الله عليه وسلم مرتين مرتين والإقامة مرة مرة غير أنه يقول قد قامت الصلاة قد قامت الصلاة فإذا سمعنا الإقامة توضأنا ثم خرجنا إلى الصلاة ‏.‏ قال شعبة ولم أسمع من أبي جعفر غير هذا الحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The words of adhan were pronounced from the time of the Messenger of Allah (ﷺ) twice in pairs (i.e. four times) each, and the words of iqamah were pronounced once in pairs (twice each), except that the phrase \"The time for prayer has come\" would be pronounced twice. When we heard iqamah, we would perform ablution, and go out for prayer. Shu'bah said: I did not hear AbuJa'far narrating any other tradition except this one.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "12618",
        "18"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثني أبو جعفر، عن أبي المثنى، عن ابن عمر، قال كان الأذان على عهد رسول الله صلى الله عليه وسلم مثنى مثنى والإقامة مرة مرة إلا أنك تقول قد قامت الصلاة قد قامت الصلاة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"At the time of the Messenger of Allah (ﷺ) the phrases of the Adhan were said twice and the phrases of the Iqamah were said once, except that you should I say: 'Qad Qamatis-Salah, Qad Qamatis-Salah (prayer is about to begin, prayer is about to begin).'\"",
      "chain": [
        "30153",
        "20031",
        "20020",
        "12618",
        "18"
      ]
    },
    {
      "hadith_no": "5741",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن بسام، قال سألت أبا جعفر عن النبيذ، قال كان علي بن حسين رضى الله عنه ينبذ له من الليل فيشربه غدوة وينبذ له غدوة فيشربه من الليل ‏.‏",
      "text_en": " It was narrated that Bassam said:                     \"I asked Abu Ja'far about Nabidh and he said: \" 'Ali bin Husain, may Allah be pleased with him, would have Nabidh made for him at night, and he would drink it in the morning, and he would have Nabidh made in the morning and he would drink it at night.'\"",
      "chain": [
        "16",
        "12618",
        "11045"
      ]
    },
    {
      "hadith_no": "75",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا أبو النضر، حدثنا أبو جعفر، عن يونس، عن الحسن، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'I have been commanded to fight the people until they testify to La ilaha ill-allah (none has the right to be worshipped but Allah) and that I am the Messenger of Allah, and establish regular prayers and pay Zakat.'\"",
      "chain": [
        "38001",
        "20390",
        "12618",
        "20475",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "444",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك بن عبد الله النخعي، عن ثابت بن أبي صفية الثمالي، قال سألت أبا جعفر قلت له حدثت عن جابر بن عبد الله، أن النبي  صلى الله عليه وسلم  توضأ مرة مرة قال نعم ‏.‏ قلت ومرتين مرتين وثلاثا ثلاثا قال نعم ‏.‏",
      "text_en": " It was narrated that Thabit bin Abi Safiyyah Ath-Thumali said:                     \"I asked Abu Ja'far: Was it narrated to you from Jabir bin 'Abdullah that the Prophet performed ablution washing each part once?' He said: 'Yes.' I said: 'And each part twice, and each part thrice?' He said: 'Yes.'\"",
      "chain": [
        "30467",
        "20587",
        "12618",
        "34"
      ]
    }
  ],
  "total_hadiths": 5
}