{
  "id": "1264",
  "name": "Habiba bint Sahl bin Tha'laba ( حبيبة بنت سهل بن ثعلبة ( رضي الله عنها",
  "full_name": "Habiba bint Sahl bin Tha'laba ( حبيبة بنت سهل بن ثعلبة ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ د  س  -  صحابي ]"
    ],
    "tags": [
      "Female",
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar"
    ]
  },
  "parents": [
    {
      "id": "1281",
      "name": "'Amra bint Mas'ud #2 ( عمرة بنت مسعود بن قيس الثانية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "239",
      "name": "Thabit bin Qays b. Shammas ( ثابت بن قيس بن الشماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "1265",
      "name": "'Amira bint Sahl bin Tha'laba ( عميرة بنت سهيل بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1262",
      "name": "Rughayba bint Sahl bin Tha'laba ( رغيبة بنت سهل بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2227",
      "hadith_no": "2227",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا القعنبي، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن بن سعد بن زرارة، أنها أخبرته عن حبيبة بنت سهل الأنصارية، أنها كانت تحت ثابت بن قيس بن شماس وأن رسول الله صلى الله عليه وسلم خرج إلى الصبح فوجد حبيبة بنت سهل عند بابه في الغلس فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذه ‏\"‏ ‏.‏ فقالت أنا حبيبة بنت سهل ‏.‏ قال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قالت لا أنا ولا ثابت بن قيس ‏.‏ لزوجها فلما جاء ثابت بن قيس قال له رسول الله صلى الله عليه وسلم ‏\"‏ هذه حبيبة بنت سهل ‏\"‏ ‏.‏ وذكرت ما شاء الله أن تذكر وقالت حبيبة يا رسول الله كل ما أعطاني عندي ‏.‏ فقال رسول الله صلى الله عليه وسلم لثابت بن قيس ‏\"‏ خذ منها ‏\"‏ ‏.‏ فأخذ منها وجلست هي في أهلها ‏.‏",
      "text_en": " Amrah, daughter of 'Abd al-Rahman ibn Sa'd ibn Zurarah, reported on the authority of Habibah, daughter of Sahl al-Ansariyyah:                      She (Habibah) was the wife of Thabit ibn Qays ibn Shimmas. The Messenger of Allah (ﷺ) came out one morning and found Habibah by his door.  The Messenger of Allah (ﷺ) said: Who is this?  She replied: I am Habibah, daughter of Sahl. He asked: What is your case?  She replied: I and Thabit ibn Qays, referring to her husband, cannot live together.  When Thabit ibn Qays came, the Messenger of Allah (ﷺ) said to him: This is Habibah, daughter of Sahl, and she has mentioned (about you) what Allah wished to mention.  Habibah said: Messenger of Allah, all that he gave me is with me.  The Messenger of Allah (ﷺ) said to Thabit ibn Qays: Take it from her. So he took it from her, and she lived among her people (relatives).",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11062",
        "1264"
      ]
    },
    {
      "id": "sunan-an-nasai-3462",
      "hadith_no": "3462",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، أنها أخبرته عن حبيبة بنت سهل، أنها كانت تحت ثابت بن قيس بن شماس وأن رسول الله صلى الله عليه وسلم خرج إلى الصبح فوجد حبيبة بنت سهل عند بابه في الغلس فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذه ‏\"‏ ‏.‏ قالت أنا حبيبة بنت سهل يا رسول الله ‏.‏ قال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قالت لا أنا ولا ثابت بن قيس ‏.‏ لزوجها فلما جاء ثابت بن قيس قال له رسول الله صلى الله عليه وسلم ‏\"‏ هذه حبيبة بنت سهل قد ذكرت ما شاء الله أن تذكر ‏\"‏ ‏.‏ فقالت حبيبة يا رسول الله كل ما أعطاني عندي ‏.‏ فقال رسول الله صلى الله عليه وسلم لثابت ‏\"‏ خذ منها ‏\"‏ ‏.‏ فأخذ منها وجلست في أهلها ‏.‏",
      "text_en": " It was narrated from Yahya bin Sa'eed, from 'Amrah bint 'Abdur-Rahman, that she told him about Habibah bint Sahl:                      \"She was married to Thabit bin Qais bin Shammas. The Messenger of Allah went out to pray As-Subh and he found Habibah bint Sahl at his door at the end of the night. The Messenger of Allah said: 'Who is this?' She said: 'I am Habibah bint Sahl, O Messenger of Allah.' He said: 'What is the matter?' She said: 'I cannot live with Thabit bin Qais' -her husband. When Thabit bin Qais came, the Messenger of Allah said to him: 'Here is Habibah bint Sahl and she has said what Allah willed she should say.' Habibah said: 'O Messenger of Allah, everything that he gave me is with me.' The Messenger of Allah said: 'Take it from her.' So he took it from her and she stayed with her family.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11062",
        "11455",
        "1264"
      ]
    }
  ],
  "total_hadiths": 2
}