{
  "id": "130",
  "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
  "full_name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "as-Surat"
    },
    "death": {
      "date_hijri": "54",
      "date_gregorian": "663",
      "date_display": null,
      "place": "Hims",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "as-Surat",
      "Syria",
      "Hims"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  4  -  صحابي ]"
    ],
    "tags": [
      "Ally B. Hasim",
      "Yemen",
      "Freed Slave",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "10883",
      "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10878",
      "name": "Ma'dan bin Abi Talha معدان بن أبي طلحة ويقال بن طلحة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "18410",
      "name": "Shdad bin Hy Abu شداد بن حي أبو حي الحمصي المؤذن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19909",
      "name": "Rashid bin Sa'd راشد بن سعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18561",
      "name": "'Abdullah bin Ghabir,Abu 'Amir al-Alhani عبد الله بن غابر أبو عامر الألهاني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1362",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، عن الأوزاعي، عن أبي عمار، - اسمه شداد بن عبد الله - عن أبي أسماء، عن ثوبان، قال كان رسول الله صلى الله عليه وسلم إذا انصرف من صلاته استغفر ثلاثا وقال ‏\"‏ اللهم أنت السلام ومنك السلام تباركت ذا الجلال والإكرام ‏\"‏ ‏.‏ قال الوليد فقلت للأوزاعي كيف الاستغفار قال تقول أستغفر الله أستغفر الله ‏.‏",
      "text_en": " Thauban reported:                      When the Messenger of Allah (may peace be upon him) finished his prayer. he begged forgiveness three times and said: O Allah! Thou art Peace, and peace comes from Thee; Blessed art Thou, O Possessor of Glory and Honour. Walid reported: I said to Auza'i: How Is the seeking of forgiveness? He replied: You should say:, I beg forgiveness from Allah, 1 beg forgiveness from Allah.\"",
      "chain": [
        "30248",
        "20733",
        "20024",
        "130"
      ]
    },
    {
      "hadith_no": "2357",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الربيع الزهراني، وقتيبة بن سعيد، كلاهما عن حماد بن زيد، - قال أبو الربيع حدثنا حماد، - حدثنا أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل دينار ينفقه الرجل دينار ينفقه على عياله ودينار ينفقه الرجل على دابته في سبيل الله ودينار ينفقه على أصحابه في سبيل الله ‏\"‏ ‏.‏ قال أبو قلابة وبدأ بالعيال ثم قال أبو قلابة وأى رجل أعظم أجرا من رجل ينفق على عيال صغار يعفهم أو ينفعهم الله به ويغنيهم ‏.‏",
      "text_en": " Thauban reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent dinar is one that a person spends on his family, and the dinar which he spends on his animal in Allah's path, and the dinar he spends on his companions in Allah's path. Abu Qilaba (one of the narrators) said: He (the narrator) started with family, and then Abu Qilaba said: Who is the person with greater reward than a person who spends on young members of his family (and thus) preserves (saves them from want) (and by virtue of which) Allah brings profit for them and makes them rich.",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30137",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "5059",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع العتكي، وقتيبة بن سعيد، قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي ظاهرين على الحق لا يضرهم من خذلهم حتى يأتي أمر الله وهم كذلك ‏\"‏ ‏.‏ وليس في حديث قتيبة ‏\"‏ وهم كذلك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Thauban that the Messenger of Allah (may peace be upon him) said:                      A group of people from my Umma will always remain triumphant on the right path and continue to be triumphant (against their opponents). He who deserts them shall not be able to do them any harm. They will remain in this position until Allah's Command is executed (i.e. Qiyamah is established). In Qutaiba's version of the tradition, we do not have the words:\" They will remain in this position.\"",
      "chain": [
        "30116",
        "30367",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "5223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني زهير بن حرب، حدثنا معن بن عيسى، حدثنا معاوية بن صالح، عن أبي، الزاهرية عن جبير بن نفير، عن ثوبان، قال ذبح رسول الله صلى الله عليه وسلم ضحيته ثم قال ‏\"‏ يا ثوبان أصلح لحم هذه ‏\"‏ ‏.‏ فلم أزل أطعمه منها حتى قدم المدينة ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (way peace be upon him) slaughtered his sacrificial animal and then said:                      Thauban, make his meat usable (for journey), and I continuously served him that until he arrived in Medina.",
      "chain": [
        "30022",
        "30112",
        "20675",
        "10901",
        "4097",
        "130"
      ]
    },
    {
      "hadith_no": "6130",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار - وألفاظهم متقاربة - قالوا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، عن ثوبان، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إني لبعقر حوضي أذود الناس لأهل اليمن أضرب بعصاى حتى يرفض عليهم ‏\"‏ ‏.‏ فسئل عن عرضه فقال ‏\"‏ من مقامي إلى عمان ‏\"‏ ‏.‏ وسئل عن شرابه فقال ‏\"‏ أشد بياضا من اللبن وأحلى من العسل يغت فيه ميزابان يمدانه من الجنة أحدهما من ذهب والآخر من ورق ‏\"‏ ‏.‏  وحدثنيه زهير بن حرب، حدثنا الحسن بن موسى، حدثنا شيبان، عن قتادة، بإسناد هشام ‏.‏ بمثل حديثه غير أنه قال ‏\"‏ أنا يوم القيامة عند عقر الحوض ‏\"‏ ‏.‏",
      "text_en": " Thauban reported Allah's Apostle (may peace be upon him) as saying:                      I would be pushing back from my Cistern the crowd of people. I would strike away from it (the Cistern) with my staff the people of Yemen until the water (of the Haud) would spout forth upon them. He was asked about its breadth. He said: From this place of mine to 'Amman, and he was asked about the drink and he said: It is whiter than milk and sweeter than honey. There would spout into it two streamlets having their sources in Paradise. the one is from gold and the other is from silver. This hadith has been narrated on the authority of Hisham with the same chain of transmitters and the words are:\" I would be on the Day of Resurrection near the bank of the Cistern.\"",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11342",
        "10878",
        "130"
      ]
    },
    {
      "hadith_no": "6132",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا يحيى بن حماد، حدثنا شعبة، عن قتادة، عن سالم، بن أبي الجعد عن معدان، عن ثوبان، عن النبي صلى الله عليه وسلم حديث الحوض فقلت ليحيى بن حماد هذا حديث سمعته من أبي عوانة فقال وسمعته أيضا من شعبة فقلت انظر لي فيه فنظر لي فيه فحدثني به ‏.‏",
      "text_en": " Thaubin reported this hadith pertaining to the Cistern. Muhammad b. Bashshar said:                      I said to Yahya b. Hammad: This is the hadith that I heard from Abu 'Awana and he said: I also heard it from Shu'ba. I said: Narrate that to me and he narrated that to me.",
      "chain": [
        "30160",
        "20574",
        "20020",
        "11019",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "6716",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن منصور، وأبو الربيع الزهراني، قالا حدثنا حماد، - يعنيان ابن زيد - عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال أبو الربيع رفعه إلى النبي صلى الله عليه وسلم وفي حديث سعيد قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عائد المريض في مخرفة الجنة حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " Abu Rabi' reported directly from Allah's Apostle (may peace upon him) as saying:                      The one who visits the sick is in fact like one who is in the fruit garden of Paradise so long as he does not return.",
      "chain": [
        "30116",
        "30137",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "6718",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا يزيد بن زريع، حدثنا خالد، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المسلم إذا عاد أخاه المسلم لم يزل في خرفة الجنة حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " Thauban reported Allah's Apostle (may peace be upon him) as saying:                      Verily, when a Muslim visits his brother in Islam he is supposed to remain in the fruit garden of Paradise until he returns.",
      "chain": [
        "20304",
        "11282",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "7440",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو الربيع العتكي، وقتيبة بن سعيد، كلاهما عن حماد بن زيد، - واللفظ لقتيبة - حدثنا حماد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله زوى لي الأرض فرأيت مشارقها ومغاربها وإن أمتي سيبلغ ملكها ما زوي لي منها وأعطيت الكنزين الأحمر والأبيض وإني سألت ربي لأمتي أن لا يهلكها بسنة بعامة وأن لا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال يا محمد إني إذا قضيت قضاء فإنه لا يرد وإني أعطيتك لأمتك أن لا أهلكهم بسنة بعامة وأن لا أسلط عليهم عدوا من سوى أنفسهم يستبيح بيضتهم ولو اجتمع عليهم من بأقطارها - أو قال من بين أقطارها - حتى يكون بعضهم يهلك بعضا ويسبي بعضهم بعضا ‏\"‏ ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (may peace be upon him) said:                      Allah drew the ends of the world near one another for my sake. And I have seen its eastern and western ends. And the dominion of my Unimah would reach those ends which have been drawn near me and I have been granted the red and the white trea- sure and I begged my Lord for my Ummah that it should not be destroyed because of famine, nor be dominated by an enemy who is not amongst them to take their lives and destroy them root and branch, and my Lord said: Muhammad, whenever I make a decision, there is none to change it. Well, I grant you for your Ummah that it would not be destroyed by famine and it would not be dominated by an enemy who would not be amongst it and would take their lives and destroy them root and branch even if all the people from the different parts of the world join hands together (for this purpose), but it would be from amongst them, viz. your Ummah, that some people would kill the others or imprison the others.",
      "chain": [
        "30367",
        "20022",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "7441",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني زهير بن حرب، وإسحاق بن إبراهيم، ومحمد بن المثنى، وابن، بشار قال إسحاق أخبرنا وقال الآخرون، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن  أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى زوى لي الأرض حتى رأيت مشارقها ومغاربها وأعطاني الكنزين الأحمر والأبيض ‏\"‏ ‏.‏ ثم ذكر نحو حديث أيوب عن أبي قلابة ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (may peace be upon him) said. Verily, Allah drew the ends of the world near me until I saw its cast and west an He bestowed upon me two treasures, the red and the white. The rest of the hadith is the same.",
      "chain": [
        "30022",
        "30123",
        "30170",
        "30160",
        "30312",
        "20287",
        "20295",
        "11019",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن عياش، عن حبيب بن صالح، عن يزيد بن شريح الحضرمي، عن أبي حى المؤذن، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث لا يحل لأحد أن يفعلهن لا يؤم رجل قوما فيخص نفسه بالدعاء دونهم فإن فعل فقد خانهم ولا ينظر في قعر بيت قبل أن يستأذن فإن فعل فقد دخل ولا يصلي وهو حقن حتى يتخفف ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) said: Three things one is not allowed to do: supplicating Allah specifically for himself and ignoring others while leading people in prayer; if he did so, he deceived them; looking inside a house before taking permission: if he did so, it is as if he entered the house, saying prayer while one is feeling the call of nature until one eases oneself.",
      "chain": [
        "31167",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن ثور، عن راشد بن سعد، عن ثوبان، قال بعث رسول الله صلى الله عليه وسلم سرية فأصابهم البرد فلما قدموا على رسول الله صلى الله عليه وسلم أمرهم أن يمسحوا على العصائب والتساخين ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sent out an expedition. They were affected by cold. When they returned to the Messenger of Allah (ﷺ), he commanded them to wipe over turbans and stockings.",
      "chain": [
        "30007",
        "20031",
        "11155",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، والربيع بن نافع، وعثمان بن أبي شيبة، وشجاع بن مخلد، - بمعنى الإسناد - أن ابن عياش، حدثهم عن عبيد الله بن عبيد الكلاعي، عن زهير، - يعني ابن سالم العنسي - عن عبد الرحمن بن جبير بن نفير، قال عمرو وحده عن أبيه، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل سهو سجدتان بعد ما يسلم ‏\"‏ ‏.‏ لم يذكر عن أبيه ‏.‏ غير عمرو ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: For each forgetfulness there are two prostrations after giving the salutation. No one except Amr (ibn Uthman) mentioned the words \"from his father\" (in the chain AbdurRahman ibn Jubayr ibn Nufayr from Thawban).",
      "chain": [
        "10581",
        "30335",
        "30203",
        "30506",
        "17023",
        "10942",
        "130"
      ]
    },
    {
      "hadith_no": "1643",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عاصم، عن أبي العالية، عن ثوبان، قال وكان ثوبان مولى رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تكفل لي أن لا يسأل الناس شيئا وأتكفل له بالجنة ‏\"‏ ‏.‏ فقال ثوبان أنا ‏.‏ فكان لا يسأل أحدا شيئا ‏.‏",
      "text_en": " Thawban, the client of the Messenger of Allah (May peace be upon him), reported him as saying :                      If anyone guarantees me that he will not beg from people, I will guarantee him Paradise.  Thawban said : I (will not beg).  He never asked anyone for anything.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11080",
        "11618",
        "130"
      ]
    },
    {
      "hadith_no": "2226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة سألت زوجها طلاقا في غير ما بأس فحرام عليها رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: If any woman asks her husband for divorce without some strong reason, the odour of Paradise will be forbidden to her.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام، ح وحدثنا أحمد بن حنبل، حدثنا حسن بن موسى، حدثنا شيبان، - جميعا - عن يحيى، عن أبي قلابة، عن أبي أسماء، - يعني الرحبي - عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال شيبان أخبرني أبو قلابة أن أبا أسماء الرحبي حدثه أن ثوبان مولى رسول الله صلى الله عليه وسلم أخبره أنه سمع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: A man who cupped and a man  who has himself cupped broke their fast. The narrator Shayban said in his version: AbuQilabah told me that AbuAsma' ar-Rahbi told him that Thawban, the client of the Messenger of Allah (ﷺ), told him that he heard the Prophet (ﷺ) say this.",
      "chain": [
        "30175",
        "20031",
        "11065",
        "30007",
        "20240",
        "11449",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا الهيثم بن حميد، أخبرنا العلاء بن الحارث، عن مكحول، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو داود ورواه ابن ثوبان عن أبيه عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.Abu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
      "chain": [
        "37534",
        "20201",
        "20744",
        "10884",
        "11066",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2814",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا حماد بن خالد الخياط، قال حدثنا معاوية بن صالح، عن أبي الزاهرية، عن جبير بن نفير، عن ثوبان، قال ضحى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا ثوبان أصلح لنا لحم هذه الشاة ‏\"‏ ‏.‏ قال فما زلت أطعمه منها حتى قدمنا المدينة ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sacrificed during a journey and then said: Thawban, mend the meat of this goat. I then kept on supplying its meat until we reached Medina.",
      "chain": [
        "30352",
        "20537",
        "20675",
        "10901",
        "4097",
        "130"
      ]
    },
    {
      "hadith_no": "3177",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن موسى البلخي، أخبرنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن بن عوف، عن ثوبان، أن رسول الله صلى الله عليه وسلم أتي بدابة وهو مع الجنازة فأبى أن يركبها فلما انصرف أتي بدابة فركب فقيل له فقال ‏\"‏ إن الملائكة كانت تمشي فلم أكن لأركب وهم يمشون فلما ذهبوا ركبت ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     An animal was brought to the Messenger of Allah (ﷺ) while he was going with a funeral. He refused to ride on it. When the funeral was away, the animal was brought to him and he rode on it. He was asked about it. He said: The angels were on their feet. I was not to ride while they were walking. When they went away, I rode.",
      "chain": [
        "30221",
        "20121",
        "20115",
        "11449",
        "10567",
        "130"
      ]
    },
    {
      "hadith_no": "4252",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عيسى، قالا حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله زوى لي الأرض ‏\"‏ ‏.‏ أو قال ‏\"‏ إن ربي زوى لي الأرض فرأيت مشارقها ومغاربها وإن ملك أمتي سيبلغ ما زوي لي منها وأعطيت الكنزين الأحمر والأبيض وإني سألت ربي لأمتي أن لا يهلكها بسنة بعامة ولا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال لي يا محمد إني إذا قضيت قضاء فإنه لا يرد ولا أهلكهم بسنة بعامة ولا أسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم ولو اجتمع عليهم من بين أقطارها أو قال بأقطارها حتى يكون بعضهم يهلك بعضا وحتى يكون بعضهم يسبي بعضا وإنما أخاف على أمتي الأئمة المضلين وإذا وضع السيف في أمتي لم يرفع عنها إلى يوم القيامة ولا تقوم الساعة حتى تلحق قبائل من أمتي بالمشركين وحتى تعبد قبائل من أمتي الأوثان وإنه سيكون في أمتي كذابون ثلاثون كلهم يزعم أنه نبي وأنا خاتم النبيين لا نبي بعدي ولا تزال طائفة من أمتي على الحق ‏\"‏ ‏.‏ قال ابن عيسى ‏\"‏ ظاهرين ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ لا يضرهم من خالفهم حتى يأتي أمر الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) as saying: Allah, the Exalted, folded for me the earth, or he said (the narrator is doubtful): My Lord folded for me the earth, so much so that I saw its easts and wests (i.e. the extremities). The kingdom of my community will reach as far as the earth was floded for me. The two treasures, the red and the white, were bestowed on me. I prayed to my Lord that He may not destroy my community by prevailing famine, and not give their control to an enemy who annihilates then en masse except from among themselves. My Lord said to me: Muhammad, If I make a decision, it is not withdrawn ; and I shall not destroy them by prevailing famine, and I shall not give their control to an enemy, except from among themselves, who exterminates them en masse, even if they are stormed from all sides of the earth ; only a section of them will destroy another section, and a section will captive another section. I am afraid about my community of those leaders who will lead astray. When the sword is used among my people, it will not be withdrawn from them till the Day of Resurrection, and the Last Hour will not come before the tribes of my people attach themselves to the polytheists and tribes of my people worship idols. There will be among my people thirty great liars each of them asserting that he is (Allah's) prophet, where as I am the seal of the Prophet  s after whom (me) there will be no prophet ; and a section of my people will continue to hold to the truth - (according to the Ibn Isa's version: (will continue to dominate) - the agreed version goes: \"and will not be injured by those who oppose them, till Allah's command comes.\"",
      "chain": [
        "20193",
        "31167",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "4297",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا بشر بن بكر، حدثنا ابن جابر، حدثني أبو عبد السلام، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الأمم أن تداعى عليكم كما تداعى الأكلة إلى قصعتها ‏\"‏ ‏.‏ فقال قائل ومن قلة نحن يومئذ قال ‏\"‏ بل أنتم يومئذ كثير ولكنكم غثاء كغثاء السيل ولينزعن الله من صدور عدوكم المهابة منكم وليقذفن الله في قلوبكم الوهن ‏\"‏ ‏.‏ فقال قائل يا رسول الله وما الوهن قال ‏\"‏ حب الدنيا وكراهية الموت ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: The people will soon summon one another to attack you as people when eating invite others to share their dish. Someone asked: Will that be because of our small numbers at that time? He replied: No, you will be numerous at that time: but you will be scum and rubbish like that carried down by a torrent, and Allah will take fear of you from the breasts of your enemy and last enervation into your hearts.  Someone asked: What is wahn (enervation). Messenger of Allah (ﷺ): He replied: Love of the world and dislike of death.",
      "chain": [
        "20413",
        "130"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، حدثني حبيب بن صالح، عن يزيد بن شريح، عن أبي حى المؤذن الحمصي، عن ثوبان، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرئ أن ينظر في جوف بيت امرئ حتى يستأذن فإن نظر فقد دخل ولا يؤم قوما فيخص نفسه بدعوة دونهم فإن فعل فقد خانهم ولا يقوم إلى الصلاة وهو حقن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأبي أمامة ‏.‏ قال أبو عيسى حديث ثوبان حديث حسن ‏.‏ وقد روي هذا الحديث عن معاوية بن صالح عن السفر بن نسير عن يزيد بن شريح عن أبي أمامة عن النبي صلى الله عليه وسلم ‏.‏ وروي هذا الحديث عن يزيد بن شريح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وكأن حديث يزيد بن شريح عن أبي حى المؤذن عن ثوبان في هذا أجود إسنادا وأشهر ‏.‏",
      "text_en": " Thawban narrated that :                     the Prophet said: \"It is not allowed for a man to look into the interior of a man's house until he has been given permission, for if he looks, then he has entered. And one who leads people (in Salat) should not supplicate for himself alone with the exclusion of his congregation. If he does, then he has betrayed them. And one is not to stand for Salat while he has to urinate.\"",
      "chain": [
        "20387",
        "20736",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "967",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المسلم إذا عاد أخاه المسلم لم يزل في خرفة الجنة ‏\"‏ ‏.‏ وفي الباب عن علي وأبي موسى والبراء وأبي هريرة وأنس وجابر ‏.‏ قال أبو عيسى حديث ثوبان حديث حسن ‏.‏ وروى أبو غفار وعاصم الأحول هذا الحديث عن أبي قلابة عن أبي الأشعث عن أبي أسماء عن ثوبان عن النبي صلى الله عليه وسلم نحوه ‏.‏ وسمعت محمدا يقول من روى هذا الحديث عن أبي الأشعث عن أبي أسماء فهو أصح ‏.‏ قال محمد وأحاديث أبي قلابة إنما هي عن أبي أسماء إلا هذا الحديث فهو عندي عن أبي الأشعث عن أبي أسماء ‏.‏",
      "text_en": " Thawban narrated that :                     the Prophet said: \"Indeed the Muslim remains in the Khurfah (harvest) of Paradise while he visits his brother Muslim.\"",
      "chain": [
        "30430",
        "20304",
        "11282",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "968",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا يزيد بن هارون، عن عاصم الأحول، عن أبي قلابة، عن أبي الأشعث، عن أبي أسماء، عن ثوبان، عن النبي صلى الله عليه وسلم نحوه ‏.‏ وزاد فيه قيل ما خرفة الجنة قال ‏\"‏ جناها ‏\"‏ ‏.‏  حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، عن النبي صلى الله عليه وسلم نحو حديث خالد ‏.‏ ولم يذكر فيه عن أبي الأشعث ‏.‏ قال أبو عيسى ورواه بعضهم عن حماد بن زيد ولم يرفعه ‏.‏",
      "text_en": " (Another chain) from Thawban who narrated that:                     The Prophet said similarly, but he added in it: \"They said: 'What is the Khurfah of Paradise?' And he said: \"Its harvest.\"",
      "chain": [
        "20472",
        "11080",
        "11047",
        "30121",
        "130"
      ]
    },
    {
      "hadith_no": "1012",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عيسى بن يونس، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة فرأى ناسا ركبانا فقال ‏\"‏ ألا تستحيون إن ملائكة الله على أقدامهم وأنتم على ظهور الدواب ‏\"‏ ‏.‏ قال وفي الباب عن المغيرة بن شعبة وجابر بن سمرة ‏.‏ قال أبو عيسى حديث ثوبان قد روي عنه موقوفا قال محمد الموقوف منه أصح ‏.‏",
      "text_en": " Thawban narrated:                     \"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"",
      "chain": [
        "20387",
        "20347",
        "27053",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "1224",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، حدثنا مزاحم بن ذواد بن علبة، عن أبيه، عن ليث، عن أبي الخطاب، عن أبي زرعة، عن أبي إدريس، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ المختلعات هن المنافقات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Thawban narrated that:                     The Prophet said: \"The women who seek a Khul are hypocrites.\"",
      "chain": [
        "30216",
        "20023",
        "11406",
        "11027",
        "130"
      ]
    },
    {
      "hadith_no": "1572",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثني أبو رجاء، قتيبة بن سعيد حدثنا أبو عوانة، عن قتادة، عن سالم بن أبي الجعد، عن ثوبان، قال قال رسول الله ‏\"‏ من مات وهو بريء من ثلاث الكبر والغلول والدين دخل الجنة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وزيد بن خالد الجهني ‏.‏",
      "text_en": " Narrated Thawban:                     That the Messenger of Allah (ﷺ) said: \"Whoever dies and he is free of three: Kibr (Pride), Ghulul, and debt, he will enter paradise.\"There are narrations on this topic from Abu Hurairah and Zaid bin Khalid Al-JuhniFootnote: Ghulul refers to goods stolen from the spoils of war, or concealed, before it is divided among the soldiers",
      "chain": [
        "20469",
        "11019",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "2093",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، أن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل الدينار دينار ينفقه الرجل على عياله ودينار ينفقه الرجل على دابته في سبيل الله ودينار ينفقه الرجل على أصحابه في سبيل الله ‏\"‏ ‏.‏ قال أبو قلابة بدأ بالعيال ‏.‏ ثم قال فأى رجل أعظم أجرا من رجل ينفق على عيال له صغار يعفهم الله به ويغنيهم الله به ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah said:                     \"The most virtuous of the Dinar is the Dinar spent by a man on his dependants, and the Dinar spent by a man on his beast in the Cause of Allah, and the Dinar spent by a man on his companions in the Cause of Allah.\" Abu Qilabah (one of the narrators) said: \" He began with the dependants.\" Then he said: \"And which man is greater in reward than a man who spends upon his depandants, having little ones by which Allah causes him to abstain (from the unlawful) and by which Allah enriches him.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر الرباطي، حدثنا روح بن عبادة، حدثنا مرزوق أبو عبد الله الشامي، حدثنا سعيد، رجل من أهل الشام أخبرنا ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أصاب أحدكم الحمى فإن الحمى قطعة من النار فليطفئها عنه بالماء فليستنقع نهرا جاريا ليستقبل جرية الماء فيقول بسم الله اللهم اشف عبدك وصدق رسولك بعد صلاة الصبح قبل طلوع الشمس فليغتمس فيه ثلاث غمسات ثلاثة أيام فإن لم يبرأ في ثلاث فخمس وإن لم يبرأ في خمس فسبع فإن لم يبرأ في سبع فتسع فإنها لا تكاد تجاوز تسعا بإذن الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Thawban narrated that the Prophet (S.A.W) said:                     \"When one of you suffers from fever - and indeed fever is a piece of the Fire - let him extinguish it with water. Let him stand in a flowing river facing the direction of it and say: Allahummasahfi 'abdaka wa saddik Rasulak ('In the name off Allah. O Allah! Cure your slave and testify to Your Messenger.)' Doing so after Salat As-Subh(Fajr) and before the rising of the sun. Let him submerse himself in it three times, for three days. If he is not cured in three, then five. If he is not cured in five, then seven. If he is not cured in seven, then nine. For indeed it will not remain after nine, with the permission of Allah.\"",
      "chain": [
        "30296",
        "20229",
        "130"
      ]
    },
    {
      "hadith_no": "2176",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله زوى لي الأرض فرأيت مشارقها ومغاربها وإن أمتي سيبلغ ملكها ما زوي لي منها وأعطيت الكنزين الأحمر والأصفر وإني سألت ربي لأمتي أن لا يهلكها بسنة عامة وأن لا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال يا محمد إني إذا قضيت قضاء فإنه لا يرد وإني أعطيتك لأمتك أن لا أهلكهم بسنة عامة وأن لا أسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم ولو اجتمع عليهم من بأقطارها أو قال من بين أقطارها حتى يكون بعضهم يهلك بعضا ويسبي بعضهم بعضا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed Allah gathered the earth for me so that I saw its east and its west. And surely my Ummah's authority shall reach over all that was shown to me of it. And I have been granted the two treasures; the red and the white. I asked my Lord that my Ummah is not to be destroyed by a universal drought, and that He does not overcome them by enemies outside of them, reaching to their heart of power. My Lord said: 'O Muhammad! When I issue a decree it is not reversed. I have granted for your Ummah that they shall not be destroyed by universal drought. And that they not be overcome by enemies outside of themselves reaching to their heart of power- even if they gather against them from all the regions.\"' \tOr he said: \"Among the regions. But some of them will destroy others, and some will capture others.\"'",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2202",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع السيف في أمتي لم يرفع عنها إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah(s.a.w) said:                     \"When the sword is imposed on my Ummah, it shall not be removed from it until the Day of Resurrection.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تلحق قبائل من أمتي بالمشركين وحتى يعبدوا الأوثان وإنه سيكون في أمتي ثلاثون كذابون كلهم يزعم أنه نبي وأنا خاتم النبيين لا نبي بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah(s.a.w) said:                     \"The Hour shall not be established until tribes of my Ummah unite with the idolaters, and until they worship idols. And indeed there shall be thirty imposters in my Ummah,each of them claiming that he is a Prophet. And I am the last of the Prophets, there is no Prophet after me.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2229",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أخاف على أمتي الأئمة المضلين ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي على الحق ظاهرين لا يضرهم من يخذلهم حتى يأتي أمر الله ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ قال سمعت محمد بن إسماعيل يقول سمعت علي بن المديني يقول وذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏\"‏ لا تزال طائفة من أمتي ظاهرين على الحق ‏\"‏ ‏.‏ فقال علي هم أهل الحديث ‏.‏",
      "text_en": " Thawban narrated that the Messenger of Allah(s.a.w) said:                     \"I only fear for my Ummah from the misguiding A'immah.\" He said that the Messenger of Allah(s.a.w) said: \"There will never cease to be a group from my Ummah manifest upon the truth, they will not be harmed by those who forsake them until Allah's Decree comes.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "3377",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن منصور، عن سالم بن أبي الجعد، عن ثوبان، قال لما نزلت ‏:‏ ‏(‏ والذين يكنزون الذهب والفضة ‏)‏ قال كنا مع النبي صلى الله عليه وسلم في بعض أسفاره فقال بعض أصحابه أنزل في الذهب والفضة ما أنزل ‏.‏ لو علمنا أى المال خير فنتخذه فقال ‏\"‏ أفضله لسان ذاكر وقلب شاكر وزوجة مؤمنة تعينه على إيمانه ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ سألت محمد بن إسماعيل فقلت له سالم بن أبي الجعد سمع من ثوبان فقال لا ‏.‏ فقلت له ممن سمع من أصحاب النبي صلى الله عليه وسلم قال سمع من جابر بن عبد الله وأنس بن مالك وذكر غير واحد من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Thawban:                     \"When (the following) was revealed: And those who hoard up gold and silver... (9:34)\" He said: \"We were with the Messenger of Allah (ﷺ) during one of his journeys, so some of his Companions said: (This) has been revealed about gold and silver, if we knew which wealth was better then we would use it. So he (ﷺ) said: 'The most virtuous of it is a remembering tongue, a grateful heart, and a believing wife that helps him with his faith.'\"",
      "chain": [
        "30553",
        "20340",
        "20311",
        "11067",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "3389",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، عن أبي سعد، سعيد بن المرزبان عن أبي سلمة، عن ثوبان، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يمسي رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا كان حقا على الله أن يرضيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Thawban, may Allah be pleased with him, said:                     “The Messenger of Allah said: ‘Whoever says when he reaches the evening: “I am pleased with Allah as (my) Lord, with Islam as (my) religion, and with Muhammad (pbuh) as (my) Prophet  (Raditu Billahi Rabban Wabil-Islami Deenan Wa Bi-Muhammadan Nabiyyan) it is a duty upon Allah to please him.’” (Hasan Gharib)",
      "chain": [
        "30200",
        "20344",
        "10567",
        "130"
      ]
    },
    {
      "hadith_no": "2590",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن أبي ذئب، حدثني محمد بن قيس، عن عبد الرحمن بن يزيد بن معاوية، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يضمن لي واحدة وله الجنة ‏\"‏ ‏.‏ قال يحيى ها هنا كلمة معناها أن لا يسأل الناس شيئا ‏.‏",
      "text_en": " It was narrated that Thawban said:                     \"The Messenger of Allah said: 'Whoever can promise me one thing. Paradise will be his.\" (One of the narrators) Yahya said:  \"Here a statement which means: That he will not ask the people for anything.\"",
      "chain": [
        "30153",
        "20031",
        "20177",
        "18652",
        "130"
      ]
    },
    {
      "hadith_no": "5141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا سليمان بن سلم البلخي، قال حدثنا النضر بن شميل، قال حدثنا هشام، عن يحيى، عن أبي سلام، عن أبي أسماء، عن ثوبان، قال جاءت بنت هبيرة إلى رسول الله صلى الله عليه وسلم وفي يدها فتخ من ذهب أى خواتيم ضخام نحوه ‏.‏",
      "text_en": " It was narrated that Thawban said:                     \"The daughter of Hubairah came to the Messenger of Allah [SAW] and on her hand were large gold rings.\" - a similar report.",
      "chain": [
        "20291",
        "11065",
        "20031",
        "130"
      ]
    },
    {
      "hadith_no": "10",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا محمد بن شعيب، حدثنا سعيد بن بشير، عن قتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يزال طائفة من أمتي على الحق منصورين لا يضرهم من خالفهم حتى يأتي أمر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that:                     The Messenger of Allah (ﷺ) said: \"A group among my Ummah will continue to follow the truth and prevail, and those who oppose them will not be able to harm them, until the command of Allah comes to pass.\"",
      "chain": [
        "30288",
        "20732",
        "20710",
        "11019",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن عيسى، عن عبد الله بن أبي الجعد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يزيد في العمر إلا البر ولا يرد القدر إلا الدعاء وإن الرجل ليحرم الرزق للخطيئة يعملها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Thawban said:                     \"The Messenger of Allah (ﷺ) said: 'Nothing extends one's life span but righteousness, nothing averts the Divine Decree but supplication, and nothing deprives a man of provision but the sin that he commits.'\"",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11361",
        "130"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن منصور، عن سالم بن أبي الجعد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ استقيموا ولن تحصوا واعلموا أن خير أعمالكم الصلاة ولا يحافظ على الوضوء إلا مؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Thawban said:                     \"The Messenger of Allah said: 'Adhere to righteousness even though you will not be able to do all acts of virtue. Know that the best of your deeds is Salat (prayer) and that no one maintains his ablution except a believer.'\"",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11067",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "662",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن حبيب بن صالح، عن أبي حى المؤذن، عن ثوبان، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ لا يقوم أحد من المسلمين وهو حاقن حتى يتخفف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that:                     The Messenger of Allah said: \"No one among the Muslims should stand to pray when he is suppressing (the need to urinate or defecate), until he has to relieve himself.\"",
      "chain": [
        "20644",
        "28090",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن حبيب بن صالح، عن يزيد بن شريح، عن أبي حى المؤذن، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يؤم عبد فيخص نفسه بدعوة دونهم فإن فعل فقد خانهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “The Messenger of Allah (ﷺ)said: ‘Noperson should lead others in prayer, then supplicate onlyfor himselfand not for them. If he does that, he has betrayed them.’”",
      "chain": [
        "20644",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "981",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب، حدثنا الأوزاعي، ح وحدثنا عبد الرحمن بن إبراهيم الدمشقي، قال حدثنا الوليد بن مسلم، قال حدثنا الأوزاعي، حدثني شداد أبو عمار، حدثنا أبو أسماء الرحبي، حدثني ثوبان، أن رسول الله  صلى الله عليه وسلم  كان إذا انصرف من صلاته استغفر ثلاث مرات ثم يقول ‏\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " Thawbannarrated that when he finished his prayer, the Messenger ofAllah(ﷺ) would ask for forgiveness three times, then he would say:                     “Allahumma Antas-Salam wa minkas-salam tabarakta wa Dhal-jalaliwal-ikram” (O Allah, You are As-Salam and from You is all peace,Blessedare You O Possessor of majesty and honour).”",
      "chain": [
        "30288",
        "20024",
        "30285",
        "20733",
        "20024",
        "10881",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "1276",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، وعثمان بن أبي شيبة، قالا حدثنا إسماعيل بن عياش، عن عبيد الله بن عبيد، عن زهير بن سالم العنسي، عن عبد الرحمن بن جبير بن نفير، عن ثوبان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ في كل سهو سجدتان بعد ما يسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “I heard the Messenger of Allah(ﷺ)say: ‘For every mistake there are two prostrations, after sayingthe Salam.’”",
      "chain": [
        "30288",
        "30203",
        "20736",
        "17023",
        "10942",
        "130"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، حدثني سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى على جنازة فله قيراط ومن شهد دفنها فله قيراطان ‏\"‏ ‏.‏ قال فسئل نبي الله  صلى الله عليه وسلم  عن القيراط فقال ‏\"‏ مثل أحد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Whoever offers the funeral prayer will have one Qirat and whoeverattends the burial will have two Qirat.” The Prophet (ﷺ) wasaskedabout the Qirat and he said: “(It is) like Uhud.”",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11342",
        "10878",
        "130"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا عبيد الله، أنبأنا شيبان، عن يحيى بن أبي كثير، حدثني أبو قلابة، أن أبا أسماء، حدثه عن ثوبان، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “I heard the Prophet (ﷺ) say:‘Thecupper and the one for whom cupping is done both break theirfast.’”",
      "chain": [
        "30535",
        "11201",
        "20240",
        "11449",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن ابن أبي ذئب، عن محمد بن قيس، عن عبد الرحمن بن يزيد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من يتقبل لي بواحدة وأتقبل له بالجنة ‏\"‏ قلت أنا ‏.‏ قال ‏\"‏ لا تسأل الناس شيئا ‏\"‏ ‏.‏ قال فكان ثوبان يقع سوطه وهو راكب فلا يقول لأحد ناولنيه حتى ينزل فيأخذه ‏.‏",
      "text_en": " Abdur-Rahman bin Yazid narrated that:                     Thawban said: “The Messenger of Allah said: 'Who will commit himself to one thing, I will guarantee him paradise?' I said: 'I will.' He said: 'Do not ask people for anything.' So Thawban would drop his whip while he was on his mount, and he would not say to anyone: 'Get that for me' rather he would dismount and grab it.”",
      "chain": [
        "38409",
        "20032",
        "20177",
        "11055",
        "130"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا وكيع، عن عبد الله بن عمرو بن مرة، عن أبيه، عن سالم بن أبي الجعد، عن ثوبان، قال لما نزل في الفضة والذهب ما نزل قالوا فأى المال نتخذ قال عمر فأنا أعلم لكم ذلك ‏.‏ فأوضع على بعيره فأدرك النبي  صلى الله عليه وسلم  وأنا في أثره فقال يا رسول الله أى المال نتخذ فقال ‏\"‏ ليتخذ أحدكم قلبا شاكرا ولسانا ذاكرا وزوجة مؤمنة تعين أحدكم على أمر الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Thawban said: “When the Verse concerning silver and gold was revealed, they said: 'What kind of wealth should we acquire?' Umar said: 'I will tell you about that.' So he rode on his camel and caught up with the Prophet, and I followed him. He said: 'O Messenger of Allah what kind of wealth should we acquire?' He said: 'Let one of acquire a thankful heart, a tongue that remembers Allah and a believing wife who will help him with regard to the Hereafter.' ”",
      "chain": [
        "38475",
        "20032",
        "20645",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "2133",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن الفضل، عن حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أيما امرأة سألت زوجها الطلاق في غير ما بأس فحرام عليها رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that the Messenger of Allah (ﷺ) said:                     'Any woman who asks her husband for a divorce when it is not absolutely necessary, the fragrance of Paradise will be forbidden to her.'\"",
      "chain": [
        "38001",
        "20283",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2865",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، حدثنا أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل دينار ينفقه الرجل دينار ينفقه على عياله ودينار ينفقه على فرس في سبيل الله ودينار ينفقه الرجل على أصحابه في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Thebest Dinar that a man can spend is a Dinar that he spends on hisfamily, a Dinar that he spends on a horse in the cause of Allah, andaDinar that a man spends on his companions in the cause of Allah.”",
      "chain": [
        "28454",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "4158",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن عيسى، عن عبد الله بن أبي الجعد، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يزيد في العمر إلا البر ولا يرد القدر إلا الدعاء وإن الرجل ليحرم الرزق بالذنب يصيبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Nothing increases one’s life span except righteousness andnothingrepels the Divine decree except supplication, and a man maybedeprived of provision by a sin that he commits.’”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11361",
        "130"
      ]
    },
    {
      "hadith_no": "4222",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن يحيى، وأحمد بن يوسف، قالا حدثنا عبد الرزاق، عن سفيان الثوري، عن خالد الحذاء، عن أبي قلابة، عن أبي أسماء الرحبي، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقتتل عند كنزكم ثلاثة كلهم ابن خليفة ثم لا يصير إلى واحد منهم ثم تطلع الرايات السود من قبل المشرق فيقتلونكم قتلا لم يقتله قوم ‏\"‏ ‏.‏ ثم ذكر شيئا لا أحفظه فقال ‏\"‏ فإذا رأيتموه فبايعوه ولو حبوا على الثلج فإنه خليفة الله المهدي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that the Messenger of Allah (ﷺ) said:                     \"Three will fight one another for your treasure, each one ofthem theson of a caliph, but none of them will gain it. Then theblack bannerswill come from the east, and they will kill you in anunprecedentedmanner.\" Then he mentioned something that I do notremember, then hesaid: \"When you see them, then pledge yourallegiance to them even ifyou have to crawl over the snow, for thatis the caliph of Allah,Mahdi.\"",
      "chain": [
        "11222",
        "30535",
        "20121",
        "20012",
        "11282",
        "11047",
        "10883",
        "130"
      ]
    }
  ],
  "total_hadiths": 52
}