{
  "id": "13020",
  "name": "Da'ud bin 'Ali bin 'Abdullah bin 'Abbas داود بن علي بن عبد الله بن عباس",
  "full_name": "Da'ud bin 'Ali bin 'Abdullah bin 'Abbas داود بن علي بن عبد الله بن عباس",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "133",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ بخ  ت  -  مقبول ]"
    ],
    "tags": [
      "B.Hashim",
      "Makkah"
    ]
  },
  "parents": [
    {
      "id": "10949",
      "name": "'Ali bin 'Abdullah bin 'Abbas علي بن عبد الله بن عباس بن عبد المطلب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10961",
      "name": "Muhammad bin 'Ali bin 'Abd. bin 'Abbas محمد بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18389",
      "name": "Sulaiman bin 'Ali bin 'Abdullah سليمان بن علي بن عبد الله بن عباس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "23513",
      "name": "'Isa bin 'Ali bin 'Abdullah bin 'Abbas عيسى بن علي بن عبد الله بن عباس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28601",
      "name": "al-Nadr bin 'Alqama Abu النضر بن علقمة أبو المغيرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-1241",
      "hadith_no": "1241",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن قزعة البصري، أنبأنا مسلمة بن علقمة، أنبأنا داود بن علي، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله صلى الله عليه وسلم من نسائه وحرم فجعل الحرام حلالا وجعل في اليمين كفارة ‏.‏ قال وفي الباب عن أنس وأبي موسى ‏.‏ قال أبو عيسى حديث مسلمة بن علقمة عن داود رواه علي بن مسهر وغيره عن داود عن الشعبي أن النبي صلى الله عليه وسلم ‏.‏ مرسلا ‏.‏ وليس فيه عن مسروق عن عائشة وهذا أصح من حديث مسلمة بن علقمة ‏.‏ والإيلاء هو أن يحلف الرجل أن لا يقرب امرأته أربعة أشهر فأكثر ‏.‏ واختلف أهل العلم فيه إذا مضت أربعة أشهر فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر يوقف فإما أن يفيء وإما أن يطلق ‏.‏ وهو قول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر فهي تطليقة بائنة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "13020",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3419-2",
      "hadith_no": "3419",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن عمران بن أبي ليلى، حدثني أبي، حدثني ابن أبي ليلى، عن داود بن علي، هو ابن عبد الله بن عباس عن أبيه، عن جده ابن عباس، قال سمعت نبي الله صلى الله عليه وسلم يقول ليلة حين فرغ من صلاته ‏\"‏ اللهم إني أسألك رحمة من عندك تهدي بها قلبي وتجمع بها أمري وتلم بها شعثي وتصلح بها غائبي وترفع بها شاهدي وتزكي بها عملي وتلهمني بها رشدي وترد بها ألفتي وتعصمني بها من كل سوء اللهم أعطني إيمانا ويقينا ليس بعده كفر ورحمة أنال بها شرف كرامتك في الدنيا والآخرة اللهم إني أسألك الفوز في العطاء ويروى في القضاء ونزل الشهداء وعيش السعداء والنصر على الأعداء اللهم إني أنزل بك حاجتي وإن قصر رأيي وضعف عملي افتقرت إلى رحمتك فأسألك يا قاضي الأمور ويا شافي الصدور كما تجير بين البحور أن تجيرني من عذاب السعير ومن دعوة الثبور ومن فتنة القبور اللهم ما قصر عنه رأيي ولم تبلغه نيتي ولم تبلغه مسألتي من خير وعدته أحدا من خلقك أو خير أنت معطيه أحدا من عبادك فإني أرغب إليك فيه وأسألكه برحمتك رب العالمين اللهم ذا الحبل الشديد والأمر الرشيد أسألك الأمن يوم الوعيد والجنة يوم الخلود مع المقربين الشهود الركع السجود الموفين بالعهود إنك رحيم ودود وأنت تفعل ما تريد اللهم اجعلنا هادين مهتدين غير ضالين ولا مضلين سلما لأوليائك وعدوا لأعدائك نحب بحبك من أحبك ونعادي بعداوتك من خالفك اللهم هذا الدعاء وعليك الاستجابة وهذا الجهد وعليك التكلان اللهم اجعل لي نورا في قبري ونورا في قلبي ونورا من بين يدى ونورا من خلفي ونورا عن يميني ونورا عن شمالي ونورا من فوقي ونورا من تحتي ونورا في سمعي ونورا في بصري ونورا في شعري ونورا في بشري ونورا في لحمي ونورا في دمي ونورا في عظامي اللهم أعظم لي نورا وأعطني نورا واجعل لي نورا سبحان الذي تعطف العز وقال به سبحان الذي لبس المجد وتكرم به سبحان الذي لا ينبغي التسبيح إلا له سبحان ذي الفضل والنعم سبحان ذي المجد والكرم سبحان ذي الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث ابن أبي ليلى من هذا الوجه ‏.‏ وقد روى شعبة وسفيان الثوري عن سلمة بن كهيل عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم بعض هذا الحديث ولم يذكره بطوله ‏.‏",
      "text_en": " Ibn Abbas said:                     “One night, When he (pbuh) exited his Salat, I heard the Messenger of Allah saying: ‘O Allah, I ask You of Your mercy, that You guide by it my heart, and gather by it my affair, and bring together, that which has been scattered of my affairs, and correct with it, that which is hidden from me, and raise by it, that which is apparent from me, and purify by it my actions, and inspire me by it, with that which contains my guidance, and protect me by it, from that which I seek protection, and protect me by it from every evil. O Allah give me faith and certainty after which there is no disbelief, and mercy, by which I may attain the high level of Your generosity in the world and the Hereafter.  O Allah, I ask You for success [in that which You grant, and relief] in the Judgment, and the positions of the martyrs, and the provision of the successful, and aid against the enemies. O Allah, I leave to You my need, and my actions are weak, I am in need of Your mercy, so I ask You, O Decider of the affairs, and O Healer of the chests, as You separate me from the punishment of the blazing flame, and from seeking destruction, and from the trial of the graves. O Allah, whatever my opinion has fallen short of, and my intention has not reached it, and my request has not encompassed it, of good that You have promised to anyone from Your creation, or any good You are going to give to any of Your slaves, then indeed, I seek it from You and I ask You for it, by Your mercy, O Lord of the Worlds. O Allah, Possessor of the strong rope, and the guided affair, I ask You for security of the Day of the Threat, and Paradise on the Day of Immortality along with the witnesses, brought-close, who bow and prostrate, who fulfill the covenants, You are Merciful, Loving, and indeed, You do what You wish. O Allah, make us guided guiders and not misguided misguiders, an ally to Your friends, an enemy to Your enemies. We love due to Your love, those who love You, and hate, due to Your enmity those who oppose You. O Allah, this is the supplication (that we are capable of), and it is upon You to respond, and this is the effort (that we are capable of), and upon You is the reliance. O Allah, appoint a light in my heart for me, and a light in my grave, and light in front of me, and light behind me, and light on my right, and light on my left, and light above me, and light below me, and light in my hearing, and light in my vision, and light in my hair, and light in my skin, and light in my flesh, and light in my blood, and light in my bones. O Allah, magnify for me light, and appoint for me a light. Glory is to the One who wears Glory and grants by it. Glory is to the One for Whom glorification is not fitting except for Him, the Possessor of Honor and Bounties, Glory is to the Possessor of Glory and Generosity, Glory is to the Possessor of Majesty and Honor’ (Allahumma Inni As’aluka Rahmatan Min Indika Tahdi Biha Qalbi, Wa Tajma’u Bika Amri, Wa Talammu Biha Sha’athi, Wa Tuslihu Biha Gha’ibi, Wa Tarfa’u Biha Shahidi, Wa Tuzakki Biha Amali, Wa Tulhimuni Biha Rushdi, Wa Taruddu Biha Ulfati, Wa Ta’simuni Biha Min Kuli Sww’in, Allahumma A’tini Imanan Wa Yaqinan Laisa Ba’adahu Kufr. Wa Rahmatan Analu Biha Sharafa Karamatika Fid-Dunyya Wal-Akhira, Allahumma Inni As’alukal-Fawza [Fil-Ata’i Wa Yurwi] Fil-Qada’I Wa Nuzulash-Shuhada’I Wa Aisha-Su’ada’I Wan-Nasra Alal-A’da, Allahumma Inni Unsilu Bika Hajati Wa In Qasura Ra’iy Wa Da’ufa Amali Itaqartu Ila Rahmatik, Fa’sa’luka Ya Qadiyal-Umur, Wa Ya Shafiyas-Sudur, Kama Tujiru Bainal-Buhur, An Tujrani Min Adhabis-Sa’ir, Wa Min Da’watith-Thubur, Wa Min Fitnatil-Qubur. Allahumma Ma Qaura Anhu Ra’iy Wa Lam Tablughhu Niyyati Wa Lam Tablughhu Mas’alatu Min Khairin Wa’adtahu Ahadan Min Khalqika Aw Khairin Anta Mu’tihi Ahadan Min Ibadika Fa Inni Arghabu Ilaika Fihi Wa Asa’luka Bi-Rahmatika Rabbal-Alamin. Allahumma Dhal-Hablish-Shadid, Wal-Amrir-Rashid, As’aluka Al-Amna Yawm Al-Wa’id, Wal-Jannata Yawmal-Khulud Ma Al-Muqarrabinash-Shuhud, Ar-Rukka’is-Sujud, Al-Mufina, Bil-Uhud, Anta Rahimun Wadud, Wa Innaka Taf’alu Ma Turid. Allahummaj’alna Hadina Muhtadina Ghaira Dallina Wa La Mudillna Silman Li-Awliya’ika Wa Aduwwan Li0Ada’ika, Nuhibbu Bihubbika Man Ahabbaka Wa Nu’adi Bi’adawatika Man Khalafa. Allahumma Hadhah-Du’a’u Wa Alaikal-Ijabatu Wa Hadhal-Juhdu Wa Alaikat-Taklan. Allahummaj’alli Nuran Fi Qabli Wa Nuran Fi Qabri, Wa Nuran Min Baini Yadayya, Wa Nuran Min Khaldi, Wa Nuran An Yamini, Wa Nuran An Shimali, Wa Nuran Min Fawqi, Wa Nuran Min Tahti, Wa Nuran Fi Sam’I, Wa Nuran Fi Basari, Wa Nuran Fi Sha’ri, Wa Nuran Fi Bashari, Wa Nuran Fi Lahmi, Wa Nuran Fi Dami, Wa Nuran Wa A’tini Nuran Waj’alli Nuran, Subhanal-Ladhi Ta’ttafal-Izza WA Qala Bihi, Suhanal-Ladhi Labisal-Majda Wa Takarrama Bihi Subhanal-Ladhi La Yanbaghit-Tasbihu Illa Lahu, Subhana Dhil-Fadli Wan-Ni’am, Subhana Dhil-Majdi Wal-Karam, Subhana Dhil-Jalali Wal-Ikram).”",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "11196",
        "13020",
        "10949",
        "17"
      ]
    }
  ],
  "total_hadiths": 2
}