{
  "id": "13110",
  "name": "Muhammad bin Talha bin Yazid محمد بن طلحة بن يزيد",
  "full_name": "Muhammad bin Talha bin Yazid محمد بن طلحة بن يزيد",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ص  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Muttalib",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10557",
      "name": "Ibrahim bin Sa'd ibn Abi Waqqas إبراهيم بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11706",
      "name": "'Ubaidullah bin al-Aswad عبيد الله بن الأسود الخولاني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "2516",
      "name": "'Aisha bint Mas'ud bin al-Aswad ( عائشة بنت مسعود بن الأسود ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13550",
      "name": "Muhammad bin Thabit bin Shrhbyl محمد بن ثابت بن شرحبيل",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "871",
      "name": "Jubayr bin Mut'im ( جبير بن مطعم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثنا محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن طلحة بن يزيد بن ركانة، عن عبيد الله الخولاني، عن ابن عباس، قال دخل على علي - يعني ابن أبي طالب - وقد أهراق الماء فدعا بوضوء فأتيناه بتور فيه ماء حتى وضعناه بين يديه فقال يا ابن عباس ألا أريك كيف كان يتوضأ رسول الله صلى الله عليه وسلم قلت بلى ‏.‏ قال فأصغى الإناء على يده فغسلها ثم أدخل يده اليمنى فأفرغ بها على الأخرى ثم غسل كفيه ثم تمضمض واستنثر ثم أدخل يديه في الإناء جميعا فأخذ بهما حفنة من ماء فضرب بها على وجهه ثم ألقم إبهاميه ما أقبل من أذنيه ثم الثانية ثم الثالثة مثل ذلك ثم أخذ بكفه اليمنى قبضة من ماء فصبها على ناصيته فتركها تستن على وجهه ثم غسل ذراعيه إلى المرفقين ثلاثا ثلاثا ثم مسح رأسه وظهور أذنيه ثم أدخل يديه جميعا فأخذ حفنة من ماء فضرب بها على رجله وفيها النعل ففتلها بها ثم الأخرى مثل ذلك ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال أبو داود وحديث ابن جريج عن شيبة يشبه حديث علي لأنه قال فيه حجاج بن محمد عن ابن جريج ومسح برأسه مرة واحدة ‏.‏ وقال ابن وهب فيه عن ابن جريج ومسح برأسه ثلاثا ‏.‏",
      "text_en": " Ibn’Abbas said:                      ‘Ali b. Abi Talib entered upon me after he has passed water. He then called for water for ablution. We brought to him a vessel containing water, and placed it before him. He said: O Ibn’Abbas, may I not show you how the Messenger of Allah(ﷺ) used to perform ablution? I replied : Why not? He then inclined the vessel to his hand and washed it. He then put his right hand in the vessel and poured water over the other hand and washed his hands up to the wrist. He then rinsed his mouth and snuffed up water. He then put both of his hands together in the water and took out a handful of water and threw it upon the face. He then inserted both of his thumbs in the front part of the ears. He did like that twice and thrice. He then took a handful of water and poured it over his forehead and left it running down his face. He then washed his forearms up to the elbow three times. He then wiped his head and the back of his ears. He then put both of his hands together in the water and took a handful of it and threw it on his foot. He had a shoe foot like that. Do you wash your foot while it is in the shoe? He replied : Yes, while it is in the shoe. This question and answer were repeated thrice. Abu Dawud said: The version transmitted by Ibn Juraij from Shaibah is similar to the one narrated by ‘ Ali. In this version Hajjaj reported on the authority of Ibn Juraij the wording: He wiped his head once. Ibn Wahb narrated from Ibn Juraij the wording: he wiped his head three times.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "13110",
        "11706",
        "17"
      ]
    }
  ],
  "total_hadiths": 1
}