{
  "id": "13129",
  "name": "Nwh bin S's'h نوح بن صعصعة",
  "full_name": "Nwh bin S's'h نوح بن صعصعة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ د  -  مستور ]"
    ],
    "tags": [
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5331",
      "name": "Yazid bin 'Amir bin al-Aswad ( يزيد بن عامر بن الأسود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28202",
      "name": "Sa'id bin al-Sa'ib bin Ysar سعيد بن السائب بن يسار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-577",
      "hadith_no": "577",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا معن بن عيسى، عن سعيد بن السائب، عن نوح بن صعصعة، عن يزيد بن عامر، قال جئت والنبي صلى الله عليه وسلم في الصلاة فجلست ولم أدخل معهم في الصلاة - قال - فانصرف علينا رسول الله صلى الله عليه وسلم فرأى يزيد جالسا فقال ‏\"‏ ألم تسلم يا يزيد ‏\"‏ ‏.‏ قال بلى يا رسول الله قد أسلمت ‏.‏ قال ‏\"‏ فما منعك أن تدخل مع الناس في صلاتهم ‏\"‏ ‏.‏ قال إني كنت قد صليت في منزلي وأنا أحسب أن قد صليتم ‏.‏ فقال ‏\"‏ إذا جئت إلى الصلاة فوجدت الناس فصل معهم وإن كنت قد صليت تكن لك نافلة وهذه مكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Yazid ibn Amir:                     I came while the Prophet (ﷺ) was saying the prayer. I sat down and did not pray along with them. The Messenger of Allah (ﷺ) turned towards us and saw that Yazid was sitting there. He said: Did you not embrace Islam, Yazid? He replied: Why not, Messenger of Allah; I have embraced Islam. He said: What prevented you from saying prayer along with the people? He replied: I have already prayed in my house, and I thought that you had prayed (in congregation). He said: When you come to pray (in the mosque) and find the people praying, then you should pray along with them, though you have already prayed. This will be a supererogatory prayer for you and that will be counted as obligatory.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30112",
        "28202",
        "13129"
      ]
    }
  ],
  "total_hadiths": 1
}