{
  "id": "13127",
  "name": "Nafid, Abu Ma'bad, Client Of Ibn 'Abbas نافذ أبو معبد مولى بن عباس",
  "full_name": "Nafid, Abu Ma'bad, Client Of Ibn 'Abbas نافذ أبو معبد مولى بن عباس",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "104",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ع السته][ع  الستة]"
    ],
    "tags": [
      "Client",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "841",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا عبد الرزاق، قال أخبرنا ابن جريج، قال أخبرني عمرو، أن أبا معبد، مولى ابن عباس أخبره أن ابن عباس  رضى الله عنهما  أخبره أن رفع الصوت بالذكر حين ينصرف الناس من المكتوبة كان على عهد النبي صلى الله عليه وسلم‏.‏ وقال ابن عباس كنت أعلم إذا انصرفوا بذلك إذا سمعته‏.‏",
      "text_en": " Narrated Abu Ma`bad:                     (the freed slave of Ibn `Abbas) Ibn `Abbas told me, \"In the lifetime of the Prophet it was the custom to celebrate Allah's praises aloud after the compulsory congregational prayers.\" Ibn `Abbas further said, \"When I heard the Dhikr, I would learn that the compulsory congregational prayer had ended.\"",
      "chain": [
        "30311",
        "20121",
        "11070",
        "11210",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1413",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا  رضى الله عنه  إلى اليمن فقال ‏\"‏ ادعهم إلى شهادة أن لا إله إلا الله، وأني رسول الله، فإن هم أطاعوا لذلك فأعلمهم أن الله قد افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم، تؤخذ من أغنيائهم وترد على فقرائهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet () sent Mu`adh to Yemen and said, \"Invite the people to testify that none has the right to be worshipped but Allah and I am Allah's Apostle, and if they obey you to do so, then teach them that Allah has enjoined on them five prayers in every day and night (in twenty-four hours), and if they obey you to do so, then teach them that Allah has made it obligatory for them to pay the Zakat from their property and it is to be taken from the wealthy among them and given to the poor.\"",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1481",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، عن إسماعيل بن أمية، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس  رضى الله عنهما أن رسول الله صلى الله عليه وسلم لما بعث معاذا  رضى الله عنه  على اليمن قال ‏\"‏ إنك تقدم على قوم أهل كتاب، فليكن أول ما تدعوهم إليه عبادة الله، فإذا عرفوا الله فأخبرهم أن الله قد فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا فعلوا، فأخبرهم أن الله فرض عليهم زكاة ‏{‏تؤخذ‏}‏ من أموالهم وترد على فقرائهم، فإذا أطاعوا بها فخذ منهم، وتوق كرائم أموال الناس ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle (p.b.u.h) sent Mu`adh to Yemen, he said (to him), \"YOU are going to people of a (Divine) Book. First of all invite them to worship Allah (alone) and when they come to know Allah, inform them that Allah has enjoined on them, five prayers in every day and night; and if they start offering these prayers, inform them that Allah has enjoined on them, the Zakat. And it is to be taken from the rich amongst them and given to the poor amongst them; and if they obey you in that, take Zakat from them and avoid (don't take) the best property of the people as Zakat.\"",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11417",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1521",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لمعاذ بن جبل حين بعثه إلى اليمن ‏\"‏ إنك ستأتي قوما أهل كتاب، فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، فإن هم أطاعوا لك بذلك، فأخبرهم أن الله قد فرض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم، فإن هم أطاعوا لك بذلك فإياك وكرائم أموالهم، واتق دعوة المظلوم، فإنه ليس بينه وبين الله حجاب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Ma`bad:                     (the slave of Ibn `Abbas) Allah's Apostle said to Mu`adh when he sent him to Yemen, \"You will go to the people of the Scripture. So, when you reach there, invite them to testify that none has the right to be worshipped but Allah, and that Muhammad is His Apostle. And if they obey you in that, tell them that Allah has enjoined on them five prayers in each day and night. And if they obey you in that tell them that Allah has made it obligatory on them to pay the Zakat which will be taken from the rich among them and given to the poor among them. If they obey you in that, then avoid taking the best of their possessions, and be afraid of the curse of an oppressed person because there is no screen between his invocation and Allah.\"",
      "chain": [
        "30213",
        "20025",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1893",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عمرو، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تسافر المرأة إلا مع ذي محرم، ولا يدخل عليها رجل إلا ومعها محرم ‏\"‏‏.‏ فقال رجل يا رسول الله إني أريد أن أخرج في جيش كذا وكذا، وامرأتي تريد الحج‏.‏ فقال ‏\"‏ اخرج معها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with whom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit her except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Apostle! I intend to go to such and such an army and my wife wants to perform Hajj.\" The Prophet said (to him), \"Go along with her (to Hajj).",
      "chain": [
        "20283",
        "20022",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، حدثنا زكرياء بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقال ‏\"‏ اتق دعوة المظلوم، فإنها ليس بينها وبين الله حجاب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet sent Mu`adh to Yemen and said, \"Be afraid, from the curse of the oppressed as there is no screen between his invocation and Allah.\"",
      "chain": [
        "30221",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3006",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عمرو، عن أبي معبد، عن ابن عباس  رضى الله عنهما  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا يخلون رجل بامرأة، ولا تسافرن امرأة إلا ومعها محرم ‏\"‏‏.‏ فقام رجل فقال يا رسول الله، اكتتبت في غزوة كذا وكذا، وخرجت امرأتي حاجة‏.‏ قال ‏\"‏ اذهب فحج مع امرأتك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That he heard the Prophet saying, \"It is not permissible for a man to be alone with a woman, and no lady should travel except with a Muhram (i.e. her husband or a person whom she cannot marry in any case for ever; e.g. her father, brother, etc.).\" Then a man got up and said, \"O Allah's Apostle! I have enlisted in the army for such-and-such Ghazwa and my wife is proceeding for Hajj.\" Allah's Apostle said, \"Go, and perform the Hajj with your wife.\"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3061",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن ابن جريج، عن عمرو بن دينار، عن أبي معبد، عن ابن عباس  رضى الله عنهما  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله، إني كتبت في غزوة كذا وكذا، وامرأتي حاجة‏.‏ قال ‏\"‏ ارجع فحج مع امرأتك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man came to the Prophet and said, \"O Allah's Apostle! I have enlisted in the army for such-andsuch Ghazwa, and my wife is leaving for Hajj.\" Allah's Apostle said, \"Go back and perform Hajj with your wife.\"",
      "chain": [
        "20348",
        "20012",
        "11070",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "4390",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني حبان، أخبرنا عبد الله، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لمعاذ بن جبل حين بعثه إلى اليمن ‏\"‏ إنك ستأتي قوما من أهل الكتاب، فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله، وأن محمدا رسول الله، فإن هم طاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم خمس صلوات في كل يوم وليلة، فإن هم طاعوا لك بذلك، فأخبرهم أن الله قد فرض عليكم صدقة، تؤخذ من أغنيائهم، فترد على فقرائهم، فإن هم طاعوا لك بذلك، فإياك وكرائم أموالهم، واتق دعوة المظلوم فإنه ليس بينه وبين الله حجاب ‏\"‏‏.‏ قال أبو عبد الله ‏{‏طوعت‏}‏ طاعت وأطاعت لغة، طعت وطعت وأطعت‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said to Mu`adh bin Jabal when he sent him to Yemen. \"You will come to the people of Scripture, and when you reach them, invite them to testify that none has the right to be worshipped except Allah and that Muhammad is His Apostle. And if they obey you in that, then tell them that Allah has enjoined on them five prayers to be performed every day and night. And if they obey you in that, then tell them that Allah has enjoined on them Sadaqa (i.e. rak`at) to be taken from the rich amongst them and given to the poor amongst them. And if they obey you in that, then be cautious! Don't take their best properties (as Zakat) and be afraid of the curse of an oppressed person as there is no screen between his invocation and Allah.",
      "chain": [
        "20218",
        "20025",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "5288",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو، عن أبي معبد، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يخلون رجل بامرأة إلا مع ذي محرم ‏\"‏‏.‏ فقام رجل فقال يا رسول الله امرأتي خرجت حاجة واكتتبت في غزوة كذا وكذا‏.‏ قال ‏\"‏ ارجع فحج مع امرأتك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"No man should stay with a lady in seclusion except in the presence of a Dhu- Muhram.\" A man stood up and said, \"O Allah's Apostle! My wife has gone out intending to perform the Hajj and I have been enrolled (in the army) for such-and-such campaign.\" The Prophet said, \"Return and perform the Hajj with your wife.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "7459",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو عاصم، حدثنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن‏.‏",
      "text_en": "",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "7460",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وحدثني عبد الله بن أبي الأسود، حدثنا الفضل بن العلاء، حدثنا إسماعيل بن أمية، عن يحيى بن عبد الله بن محمد بن صيفي، أنه سمع أبا معبد، مولى ابن عباس يقول سمعت ابن عباس، يقول لما بعث النبي صلى الله عليه وسلم معاذا نحو اليمن قال له ‏\"‏ إنك تقدم على قوم من أهل الكتاب فليكن أول ما تدعوهم إلى أن يوحدوا الله تعالى فإذا عرفوا ذلك فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا صلوا فأخبرهم أن الله افترض عليهم زكاة في أموالهم تؤخذ من غنيهم فترد على فقيرهم، فإذا أقروا بذلك فخذ منهم وتوق كرائم أموال الناس ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet sent Mu`adh to Yemen, he said to him, \"You are going to a nation from the people of the Scripture, so let the first thing to which you will invite them, be the Tauhid of Allah. If they learn that, tell them that Allah has enjoined on them, five prayers to be offered in one day and one night. And if they pray, tell them that Allah has enjoined on them Zakat of their properties and it is to be taken from the rich among them and given to the poor. And if they agree to that, then take from them Zakat but avoid the best property of the people.\"",
      "chain": [
        "30145",
        "20269",
        "11417",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن زكرياء بن إسحاق، قال حدثني يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، عن معاذ بن جبل، - قال أبو بكر ربما قال وكيع عن ابن عباس، أن معاذا، - قال بعثني رسول الله صلى الله عليه وسلم قال ‏\"‏ إنك تأتي قوما من أهل الكتاب ‏.‏ فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنه ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that Mu'adh said:                      The Messenger of Allah sent me (as a governor of Yemen) and (at the time of departure) instructed me thus: You will soon find yourself in a community one among the people of the Book, so first call them to testify that there is no god but Allah, that I (Muhammad) am the messenger of Allah, and if they accept this, then tell them Allah has enjoined upon them five prayers during the day and the night and if they accept it, then tell them that Allah has made Zakat obligatory for them that it should be collected from the rich and distributed among the poor, and if they agree to it don't pick up (as a share of Zakat) the best of their wealths. Beware of the supplication of the oppressed for there is no barrier between him and Allah.",
      "chain": [
        "30201",
        "20032",
        "20436",
        "20032",
        "11244",
        "11448",
        "13127",
        "17",
        "32",
        "20032",
        "17",
        "32"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، حدثنا زكرياء بن إسحاق، ح وحدثنا عبد بن حميد، حدثنا أبو عاصم، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك ستأتي قوما ‏\"‏ بمثل حديث وكيع ‏.‏",
      "text_en": "",
      "chain": [
        "30421",
        "20190",
        "11244",
        "30553",
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "132",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أمية بن بسطام العيشي، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن إسماعيل بن أمية، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لما بعث معاذا إلى اليمن قال ‏\"‏ إنك تقدم على قوم أهل كتاب فليكن أول ما تدعوهم إليه عبادة الله عز وجل فإذا عرفوا الله فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم فإذا فعلوا فأخبرهم أن الله قد فرض عليهم زكاة تؤخذ من أغنيائهم فترد على فقرائهم فإذا أطاعوا بها فخذ منهم وتوق كرائم أموالهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that when the Messenger of Allah (may peace be upon him) sent Mu'adh towards Yemen (as governor) he said to him:                      Verily you would reach a community of the people of the Book, the very first thing to which you should call them is the worship of Allah, may His Glory be Magnificent, and when they become fully aware of Allah, instruct them that He has enjoined five prayers on them during the day and the night, and when they begin observing it, then instruct them that verily Allah has made Zakat obligatory for them which would be collected from the wealthy amongst them and distributed to their needy ones, and when they submit to it, then collect it from them and avoid (the temptation) of selecting the best (items) of their riches.",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11417",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1345",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن أبي معبد، مولى ابن عباس أنه سمعه يخبر، عن ابن عباس، قال ما كنا نعرف انقضاء صلاة رسول الله صلى الله عليه وسلم إلا بالتكبير ‏.‏ قال عمرو فذكرت ذلك لأبي معبد فأنكره وقال لم أحدثك بهذا ‏.‏ قال عمرو وقد أخبرنيه قبل ذلك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      We knew the finishing of the prayer of the Messenger of Allah (may peace be upon him) through takbir. 'Amr (b. Dinar) said: I made a mention of it to Abu Mas'ud. hue he rejected it and said: I never narrated it to you. 'Amr said: He did narrate it before this.",
      "chain": [
        "30421",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حاتم، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح قال وحدثني إسحاق بن منصور، - واللفظ له - قال أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عمرو بن دينار، أن أبا معبد، مولى ابن عباس أخبره أن ابن عباس أخبره أن رفع الصوت بالذكر حين ينصرف الناس من المكتوبة كان على عهد النبي صلى الله عليه وسلم ‏.‏ وأنه قال قال ابن عباس كنت أعلم إذا انصرفوا بذلك إذا سمعته ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Dhikr (mentioning the name of Allah) in a loud voice after obligatory prayers was (a common practice) during the lifetime of the Apostle of Allah (may peace be upon him) ; and when I heard that I came to knew that they (the people) had finished the prayer.",
      "chain": [
        "38487",
        "20277",
        "11070",
        "30313",
        "20121",
        "11070",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا ابن رمح، أخبرني الليث، عن أبي، الزبير عن أبي معبد، مولى ابن عباس عن ابن عباس، عن الفضل بن عباس، وكان، رديف رسول الله صلى الله عليه وسلم أنه قال في عشية عرفة وغداة جمع للناس حين دفعوا ‏\"‏ عليكم بالسكينة ‏\"‏ ‏.‏ وهو كاف ناقته حتى دخل محسرا - وهو من منى - قال ‏\"‏ عليكم بحصى الخذف الذي يرمى به الجمرة ‏\"‏ ‏.‏ وقال لم يزل رسول الله صلى الله عليه وسلم يلبي حتى رمى الجمرة .",
      "text_en": "  Ibn 'Abbas narrated from al-Fadl b. Abbas (Allah be pleased with them) who sat behind Allah's Messenger (may peace be upon him) that he (the Holy Prophet) said to the people on the evening of 'Arafa and on the morning to the gathering of people (at Muzdalifa) as they were pushing on to proceed slowly. And he himself drove his she-camel with restraint until he entered Muhassir (it is a place in Mina), and further told them to take up pebbles which were to be thrown at Jamra. And Allah's Messenger (may peace be upon him) continued pronouncing Talbiya till he stoned the Jamra.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11263",
        "13127",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن سفيان، - قال أبو بكر حدثنا سفيان بن عيينة، - حدثنا عمرو بن دينار، عن أبي معبد، قال سمعت ابن عباس، يقول سمعت النبي صلى الله عليه وسلم يخطب يقول ‏\"‏ لا يخلون رجل بامرأة إلا ومعها ذو محرم ولا تسافر المرأة إلا مع ذي محرم ‏\"‏ ‏.‏ فقام رجل فقال يا رسول الله إن امرأتي خرجت حاجة وإني اكتتبت في غزوة كذا وكذا ‏.‏ قال ‏\"‏ انطلق فحج مع امرأتك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      I heard Allah's Messenger (may peace be upon him) delivering a sermon and making this observation:\" No person should be alone with a woman except when there is a Mahram with her, and the woman should not undertake journey except with a Mahram.\" A person stood up and said: Allah's Messenger, my wife has set out for pilgrimage, whereas I am enlisted to fight in such and such battle, whereupon he said:\" You go and perform Hajj with your wife.\"",
      "chain": [
        "30201",
        "30022",
        "20005",
        "20436",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1002",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرنا سفيان، عن عمرو، عن أبي معبد، عن ابن عباس، قال كان يعلم انقضاء صلاة رسول الله صلى الله عليه وسلم بالتكبير ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The end of the prayer of the Messenger of Allah (ﷺ) was known by the takbir (pronounced aloud).",
      "chain": [
        "30423",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا عبد الرزاق، أخبرني ابن جريج، أخبرنا عمرو بن دينار، أن أبا معبد، مولى ابن عباس أخبره أن ابن عباس أخبره أن رفع الصوت للذكر حين ينصرف الناس من المكتوبة كان ذلك على عهد رسول الله صلى الله عليه وسلم وأن ابن عباس قال كنت أعلم إذا انصرفوا بذلك وأسمعه ‏.‏",
      "text_en": " Ibn Abbas said :                      To raise the voice for making the mention of Allah after the people had finished their obligatory prayer was for in vogue the time of the Messenger of Allah (May peace be upon him).Ibn ‘Abbas said : I used to know by it when they finished the prayer and would listen to it (making the mention of Allah).",
      "chain": [
        "30221",
        "20121",
        "11070",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     said When the Messenger of Allah(ﷺ) sent Mu’adh to Yemen, he said to him You are going to a people who are people of the book. So call them to bear witness that there is no diety but Allah, and that I am the Messenger of Allah. If they obey you in this respect, tell them that Allah has prescribed five prayers on them every day and night. If they obey you in this regard tell them that Allah has prescribed sadaqah(zakat) on their property and returned it to their poor. If they obey you in this respect, do not take the best of their property. Beware of the curse of the oppressed, for there is no curtain between it and Allah.",
      "chain": [
        "30007",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "625",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال له ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في اليوم والليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد على فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏ وفي الباب عن الصنابحي ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وأبو معبد مولى ابن عباس اسمه نافذ ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Messenger of Allah sent Mu'adh to Yemen and said to him: \"You are going to a people from the People of the Book, so invite them to testify that none has the right to be worshipped but Allah, and that I am the Messenger of Allah. If they comply with that, then inform them that Allah has made five prayers obligatory upon them in a day and a night. If they comply with that, then inform then that Allah has ordained a charity upon their wealth, which is to be taken from the rich among them and given to the poor among them. If they comply with that, then beware of their most precious wealth, and protect yourself from the supplication of the oppressed, for there is no barrier between it and Allah.\"",
      "chain": [
        "30216",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن زكريا بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذ بن جبل إلى اليمن فقال ‏\"‏ اتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أنس وأبي هريرة وعبد الله بن عمر وأبي سعيد ‏.‏ وهذا حديث حسن صحيح وأبو معبد اسمه نافذ ‏.‏",
      "text_en": " Ibn 'Abbas narrated:                      \"The Messenger of Allah sent Mu'adh [bin Jabal] to Yemen, and said:'Beware of the supplication of the oppressed; for indeed there is no barrier between it and Allah.'\"",
      "chain": [
        "30216",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1335",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا يحيى بن آدم، عن سفيان بن عيينة، عن عمرو بن دينار، عن أبي معبد، عن ابن عباس، قال إنما كنت أعلم انقضاء صلاة رسول الله صلى الله عليه وسلم بالتكبير ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I used to know that the prayer of the Messenger of Allah (ﷺ) ended by the takbir.\"",
      "chain": [
        "30126",
        "20364",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2435",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن زكريا بن إسحاق المكي، قال حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمعاذ حين بعثه إلى اليمن ‏\"‏ إنك تأتي قوما أهل كتاب فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإن هم أطاعوك بذلك فأخبرهم أن الله عز وجل فرض عليهم خمس صلوات في يوم وليلة فإن هم - يعني أطاعوك بذلك - فأخبرهم أن الله عز وجل فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم فإن هم أطاعوك بذلك فاتق دعوة المظلوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said to Mu'adh when he sent him to Yemen: 'You are going to some of the People of the book. When you come to them, call them to testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they obey you in that, then tell them that Allah, the Mighty and Sublime, has enjoined on them a charity (Zakah) to be taken from their rich and given to their poor. If they obey you in that, then beware of the supplication of the oppressed person.\"'",
      "chain": [
        "30029",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "2522",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا زكريا بن إسحاق، - وكان ثقة - عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذ بن جبل إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك فأعلمهم أن الله عز وجل افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك فأعلمهم أن الله عز وجل قد افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم فتوضع في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله عز وجل حجاب ‏\"‏ ‏.‏",
      "text_en": " It was narrataead from Ibn 'Abbas that the Prophet sent Mu'adh bin Jabal to Yemen and said:                     \"You are going to some people from among the people of the Book. Call them to bear witness that there is none worthly of worship except Allah and that I am the Messenger of Allah. If they obey you in that, then teach them that Allah has enjoined upon them five prayers every day and night. If they obey you in that, then teach them that Allah has enjoined upon them Sadaqah (Zakah) from their wealth, to be taken from their rich and given to their poor. If they obey you in that, then do not touch and fear the supplication of the one who has been wronged, for there is no barrier between it and Allah, the Mighty and sublime.\"",
      "chain": [
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3020",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن أبي الزبير، عن أبي معبد، مولى ابن عباس عن ابن عباس، عن الفضل بن عباس، وكان، رديف رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال في عشية عرفة وغداة جمع للناس حين دفعوا ‏\"‏ عليكم السكينة ‏\"‏ ‏.‏ وهو كاف ناقته حتى إذا دخل محسرا وهو من منى قال ‏\"‏ عليكم بحصى الخذف الذي يرمى به ‏\"‏ ‏.‏ فلم يزل رسول الله صلى الله عليه وسلم يلبي حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin Abbas, who rode behind the Messenger of Allah, that:                     on the eveing of Arafat and on the morning of Jam (Al-Muzdalifah), when they departed, the Messenger of Allah said to the people: \"You must be tranquil,\" and was reining in his she-came. Then, when he was in Muhassir, which is part of Mina, he said: \"You have to look for pebbles the size of date stones of fingertips,\" with which to stone the Jamrat. And the Messenger of Allah continued to recite the Talbiyah until he stoned Jamrat Al-Aqabah.",
      "chain": [
        "30367",
        "20023",
        "11263",
        "13127",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3052",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن جريج، قال أخبرني أبو الزبير، عن أبي معبد، عن عبد الله بن عباس، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم للناس حين دفعوا عشية عرفة وغداة جمع ‏\"‏ عليكم بالسكينة ‏\"‏ ‏.‏ وهو كاف ناقته حتى إذا دخل منى فهبط حين هبط محسرا قال ‏\"‏ عليكم بحصى الخذف الذي يرمى به الجمرة ‏\"‏ ‏.‏ وقال قال النبي صلى الله عليه وسلم يشير بيده كما يخذف الإنسان ‏.‏",
      "text_en": " It was narrated that Al-Fadl bin Abbas said:                      \"The Messenger of Allah said to the people when they moved on the evening of Arafat and the morning of Jam' (assembly at Al-Muzdalifah): 'You must have tranquility.' He was reining in his camel, and when he entered Mina, he came down to Muhassir and said: 'You have to pick up pebbles the size of date stones of fingertips with which to stone the Jamrat.' And he (Al-Fadl) said: 'And the Prophet gestured with his hand like a man throwing a pebble.'\"",
      "chain": [
        "30359",
        "20031",
        "11070",
        "11263",
        "13127",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3058",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن جريج، قال أخبرني أبو الزبير، عن أبي معبد، عن عبد الله بن عباس، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم للناس حين دفعوا عشية عرفة وغداة جمع ‏\"‏ عليكم بالسكينة ‏\"‏ ‏.‏ وهو كاف ناقته حتى إذا دخل منى فهبط حين هبط محسرا قال ‏\"‏ عليكم بحصى الخذف الذي ترمى به الجمرة ‏\"‏ ‏.‏ قال والنبي صلى الله عليه وسلم يشير بيده كما يخذف الإنسان ‏.‏",
      "text_en": " It was narrated that Al-Fadl bin Abbas said:                     \"The Messenger of Allah said to the people when they moved on the evening of Arafat and the morning of Jam' (assembly at Al-Muzdalifah): 'You must have tranquility.' He was reining in his camel, and when he entered Mina, he came down to Muhassir and said: 'You have to pick up pebbles the size of date stones of fingertips with which to stone the Jamrat.' And he (Al-Fadl) said: 'And the Prophet gestured with his hand like a man throwing a pebble.'\"",
      "chain": [
        "30359",
        "20031",
        "11070",
        "11263",
        "13127",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "1855",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع بن الجراح، حدثنا زكريا بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس، أن النبي  صلى الله عليه وسلم  بعث معاذا إلى اليمن فقال ‏\"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " 'Ibn Abbas(RAH) narrated that:                     the Prophet send Muadh to Yemen, and said: “You are going to some people among the People of the Book. Call them to bear witness that none has the right to be worshipped but Allah, and that I am the messenger of Allah. If they obey that, then tell them that Allah has enjoined upon them five prayers every day and night. If they obey that, then tell them that Allah has enjoined upon them charity (Zakat) from their wealth, to be taken from the rich and given to their poor. If they obey that, then beware of  (taking) the best of their wealth. And beware of the supplication of the oppressed, for there is no barrier between and Allah.”",
      "chain": [
        "38409",
        "20032",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3012",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا شعيب بن إسحاق، حدثنا ابن جريج، حدثني عمرو بن دينار، أنه سمع أبا معبد، مولى ابن عباس عن ابن عباس، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  قال إني اكتتبت في غزوة كذا وكذا وامرأتي حاجة ‏.‏ قال ‏\"‏ فارجع معها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A Bedouin came to the Prophet(ﷺ) and said: ‘I have enlisted for such and such a militarycampaignand my wife is going for Hajj.’ He said: ‘Go back withher.’”",
      "chain": [
        "30288",
        "20239",
        "11070",
        "11081",
        "13127",
        "17"
      ]
    }
  ],
  "total_hadiths": 32
}