{
  "id": "13389",
  "name": "Abu Bakr bin Abi al-Jhm أبو بكر بن أبي الجهم بن صخير العد",
  "full_name": "Abu Bakr bin Abi al-Jhm أبو بكر بن أبي الجهم بن صخير العد",
  "grade": "Follower(Tabi')",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "B.'Adi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3787",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا أبو عاصم، حدثنا سفيان الثوري، حدثني أبو بكر بن أبي الجهم، قال دخلت أنا وأبو سلمة بن عبد الرحمن على فاطمة بنت قيس فسألناها فقالت كنت عند أبي عمرو بن حفص بن المغيرة فخرج في غزوة نجران ‏.‏ وساق الحديث بنحو حديث ابن مهدي وزاد قالت فتزوجته فشرفني الله بابن زيد وكرمني الله بابن زيد ‏.‏",
      "text_en": " Abu Bakr b. Abu'l-Jahm reported:                      I and Abu Salama b 'Abd al-Rahman came to fatima bint Qais (Al! ah be pleased with her) and asked her (about divorce, etc.). She said: I was the wife of Abu 'Amr b. Hafs b. al-Mughira, and he set out to join the battle of Najran. The rest of the hadith is the same, but he made this addition:\" She said: I married him and Allah hornoured me on account of Ibn Zaid and Allah favoured me because of him.\"",
      "chain": [
        "30313",
        "20241",
        "20012",
        "13389"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، قال أخبرني أبو بكر بن أبي الجهم، قال دخلت أنا وأبو سلمة بن عبد الرحمن على فاطمة بنت قيس فحدثتنا أن زوجها طلقها ثلاثا ولم يجعل لها سكنى ولا نفقة ‏.‏ قالت ووضع لي عشرة أقفزة عند ابن عم له خمسة شعيرا وخمسة برا ‏.‏ قالت فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له ‏.‏ قالت فقال ‏\"‏ صدق ‏\"‏ ‏.‏ قالت فأمرني أن أعتد في بيت أم شريك ثم قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إن بيت أم شريك بيت يغشاه المهاجرون ولكن اعتدي في بيت ابن أم مكتوم فعسى أن تلقي ثيابك فلا يراك فإذا انقضت عدتك فجاء أحد يخطبك فآذنيني ‏\"‏ ‏.‏ فلما انقضت عدتي خطبني أبو جهم ومعاوية ‏.‏ قالت فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ أما معاوية فرجل لا مال له وأما أبو جهم فرجل شديد على النساء ‏\"‏ ‏.‏ قالت فخطبني أسامة بن زيد فتزوجني فبارك الله لي في أسامة ‏.‏ هذا حديث صحيح ‏.‏ وقد رواه سفيان الثوري عن أبي بكر بن أبي الجهم، نحو هذا الحديث وزاد فيه فقال لي النبي صلى الله عليه وسلم ‏\"‏ انكحي أسامة ‏\"‏ ‏.‏ حدثنا محمود بن غيلان حدثنا وكيع عن سفيان عن أبي بكر بن أبي الجهم بهذا ‏.‏",
      "text_en": " Abu Bakr bin Al-Jahm narrated:                     \"Abu Salamah bin Abdur-Rahman and I visited Fatimah bint Qais. She narrated to us that her husband had divorced her three times, and he did not leave her with anywhere to live nor any wealth. She said: 'He left ten Aqfizah for me with the son of his uncle: five were of barley, five of wheat.' She said: 'I went to the Messenger of Allah and mentioned that to him.' She said: 'He said: 'He is correct.'\" (She said: ) 'So he ordered me to complete my Iddah in the home of Umm Sharik. But then the Messenger of Allah said to me: \"Umm Sharik's home is visited by Muhajirun, so spend your Iddah in the home of Ibn Umm Maktum, for there you can remove your garments and he will not see you. Then when your Iddah is completed and someone proposed to you come to me.\" 'So when my Iddah completed. Abu Jahm and Mu'awiyah proposed to me.' She said: 'I went to the Messenger of Allah and mentioned that to him, and he said: \"As for Mu'awiyah, he is a man with no wealth,  and as for Abu Jahm he is a man who is harsh with women.\" She said: 'Then Usamah bin Zaid proposed to me, and he married me. So Allah blessed me with Usamah.'\"",
      "chain": [
        "30277",
        "30002",
        "20020",
        "13389"
      ]
    },
    {
      "hadith_no": "1533",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو بكر بن أبي الجهم، عن عبيد الله بن عبد الله، عن ابن عباس، أن رسول الله صلى الله عليه وسلم صلى بذي قرد وصف الناس خلفه صفين صفا خلفه وصفا موازي العدو فصلى بالذين خلفه ركعة ثم انصرف هؤلاء إلى مكان هؤلاء وجاء أولئك فصلى بهم ركعة ولم يقضوا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     The Messenger of Allah (ﷺ) prayed at Dhi Qarad and the people formed two rows behind him, one row behind him and one row facing the enemy. He led those who were behind him in praying one rak'ah, then they went and took the place of the others, and the others came and he led them in praying one rak'ah, and they did not make it up.",
      "chain": [
        "30160",
        "20031",
        "20012",
        "13389",
        "11004",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}