{
  "id": "13429",
  "name": "Abu 'Alqama Mwla bina Hashim أبو علقمة مولى بني هاشم",
  "full_name": "Abu 'Alqama Mwla bina Hashim أبو علقمة مولى بني هاشم",
  "grade": "Follower(Tabi')",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [د  أبي  داود]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3682",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا عبد، الأعلى عن سعيد، عن قتادة، عن أبي الخليل، أن أبا علقمة الهاشمي، حدث أن أبا سعيد الخدري حدثهم أن نبي الله صلى الله عليه وسلم بعث يوم حنين سرية ‏.‏ بمعنى حديث يزيد بن زريع غير أنه قال إلا ما ملكت أيمانكم منهن فحلال لكم ولم يذكر إذا انقضت عدتهن ‏.",
      "text_en": "  Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Apostle (may peace be upon him) sent a small army. The rest of the hadith is the same except this that he said:                      Except what your right hands possess out of them are lawful for you; and he did not mention\" when their 'idda period comes to an end\".",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20246",
        "11168",
        "11019",
        "11291",
        "13429",
        "38"
      ]
    },
    {
      "hadith_no": "5510",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، وذكر، كلمة معناها حدثنا شعبة، عن يعلى بن عطاء، قال سمعت أبا علقمة الهاشمي، قال سمعت أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أطاعني فقد أطاع الله ومن عصاني فقد عصى الله ‏\"‏ ‏.‏ وكان يتعوذ من عذاب القبر وعذاب جهنم وفتنة الأحياء والأموات وفتنة المسيح الدجال ‏.‏",
      "text_en": " Abu Hurairah said:                     \"I heard the Messenger of Allah [SAW] say: 'Whoever obeys me has obeyed Allah and whoever disobeys me has disobeyed Allah.' And he used to seek refuge from the torment of the grave, the torment of Hell, the trials that may befall the living and the dead, and the tribulation of Al-Masihid-Dajjal.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10986",
        "13429",
        "13"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا عبد العزيز بن محمد الدراوردي، حدثني قدامة بن موسى، عن محمد بن الحصين التميمي، عن أبي علقمة، مولى ابن عباس عن يسار، مولى ابن عمر عن ابن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ليبلغ شاهدكم غائبكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah said: \"Let those of you who are present convey it to those of you who are absent.\"",
      "chain": [
        "30423",
        "20167",
        "10610",
        "13429",
        "18"
      ]
    }
  ],
  "total_hadiths": 3
}