{
  "id": "13495",
  "name": "Abu Najih أبو نجيح والد عبد الله بن أبي نجي",
  "full_name": "Abu Najih أبو نجيح والد عبد الله بن أبي نجي",
  "grade": "Follower(Tabi')",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "107",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11254",
      "name": "'Abdullah bin Abi Najih عبد الله بن أبي نجيح",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-2173",
      "hadith_no": "2173",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وإسحاق بن إبراهيم كلهم عن ابن، عيينة - قال ابن نمير حدثنا سفيان، - عن ابن أبي نجيح، عن أبيه، عن عبيد بن عمير، قال قالت أم سلمة لما مات أبو سلمة قلت غريب وفي أرض غربة لأبكينه بكاء يتحدث عنه ‏.‏ فكنت قد تهيأت للبكاء عليه إذ أقبلت امرأة من الصعيد تريد أن تسعدني فاستقبلها رسول الله صلى الله عليه وسلم وقال ‏\"‏ أتريدين أن تدخلي الشيطان بيتا أخرجه الله منه ‏\"‏ ‏.‏ مرتين فكففت عن البكاء فلم أبك ‏.‏",
      "text_en": " Umm Salama reported:                      When Abu Salama died I said: I am a stranger in a strange land; I shall weep for him in a manner that would be talked of. I made preparation for weeping for him when a woman from the upper side of the city came there who intended to help me (in weeping). She happened to come across the Messenger of Allah (may peace be upon him) and he said: Do you intend to bring the devil into a house from which Allah has twice driven him out? I (Umm Salama), therefore, refrained from weeping and I did not weep.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "30212",
        "20005",
        "11254",
        "13495",
        "11259"
      ]
    },
    {
      "id": "sunan-abi-daud-1952",
      "hadith_no": "1952",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن إبراهيم بن نافع، عن ابن أبي نجيح، عن أبيه، عن رجلين، من بني بكر قالا رأينا رسول الله صلى الله عليه وسلم يخطب بين أوسط أيام التشريق ونحن عند راحلته وهي خطبة رسول الله صلى الله عليه وسلم التي خطب بمنى ‏.‏",
      "text_en": " Ibn AbuNajih reported from his father on the authority of two men from Banu Bakr who said:                      We saw the Messenger of Allah (ﷺ) addressing (the people) in the middle of the tashriq days when we were staying near his mount. This is the address of the Messenger of Allah (ﷺ) which he gave at Mina.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "20189",
        "11254",
        "13495"
      ]
    },
    {
      "id": "jami-al-tirmidhi-751",
      "hadith_no": "751",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن منيع، وعلي بن حجر، قالا حدثنا سفيان بن عيينة، وإسماعيل بن إبراهيم، عن ابن أبي نجيح، عن أبيه، قال سئل ابن عمر عن صوم، يوم عرفة بعرفة فقال حججت مع النبي صلى الله عليه وسلم فلم يصمه ومع أبي بكر فلم يصمه ومع عمر فلم يصمه ومع عثمان فلم يصمه ‏.‏ وأنا لا أصومه ولا آمر به ولا أنهى عنه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث عن ابن أبي نجيح عن أبيه عن رجل عن ابن عمر ‏.‏ وأبو نجيح اسمه يسار ‏وقد سمع من ابن عمر.‏",
      "text_en": " Ibn Abi Najib narrated from his father who said:                     \"Ibn Umar was asked about fasting (the Day of) Arafah  (at Arafat). He said: 'I performed Hajj with the Prophet, and he did not fast it, and with Abu Bakr, and he did not fast it, and with Umar, and he did not fast it, and with Uthman, and he did not fast it. I do no fast it, nor order it nor forbid it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20387",
        "20005",
        "20208",
        "11254",
        "13495"
      ]
    }
  ],
  "total_hadiths": 3
}