{
  "id": "14",
  "name": "Salman Farsi ( سلمان أبو عبد الله الفارسي ( رضي الله عنه",
  "full_name": "Salman Farsi ( سلمان أبو عبد الله الفارسي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Kazerun, Iran"
    },
    "death": {
      "date_hijri": "36",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "al-Mada'in,Iraq",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Asbahan",
      "Jia",
      "Medina",
      "Fars",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh",
      "Science",
      "Governor"
    ],
    "tags": [
      "al-Farsi",
      "Servant",
      "Client",
      "Trench"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4052",
      "name": "Ka'b bin 'Ajra al-Salmi, al-Ansari ( كعب بن عجرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10911",
      "name": "Zadhan Abu 'Umar زاذان أبو عمر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10768",
      "name": "Sa'id bin Wahb al-Hmdany سعيد بن وهب الهمداني الخيواني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-883",
      "hadith_no": "883",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، قال أخبرني أبي، عن ابن وديعة، عن سلمان الفارسي، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته ثم يخرج، فلا يفرق بين اثنين، ثم يصلي ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
      "text_en": " Narrated Salman-Al-Farsi:                     The Prophet (p.b.u.h) said, \"Whoever takes a bath on Friday, purifies himself as much as he can, then uses his (hair) oil or perfumes himself with the scent of his house, then proceeds (for the Jumua prayer) and does not separate two persons sitting together (in the mosque), then prays as much as (Allah has) written for him and then remains silent while the Imam is delivering the Khutba, his sins in-between the present and the last Friday would be forgiven.\"",
      "usc_msa_ref": "8",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "14"
      ]
    },
    {
      "id": "sahih-bukhari-910",
      "hadith_no": "910",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن ابن وديعة، عن سلمان الفارسي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة، وتطهر بما استطاع من طهر، ثم ادهن أو مس من طيب، ثم راح فلم يفرق بين اثنين، فصلى ما كتب له، ثم إذا خرج الإمام أنصت، غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
      "text_en": " Narrated Salman Al-Farsi:                     Allah's Apostle (p.b.u.h) said, \"Anyone who takes a bath on Friday and cleans himself as much as he can and puts oil (on his hair) or scents himself; and then proceeds for the prayer and does not force his way between two persons (assembled in the mosque for the Friday prayer), and prays as much as is written for him and remains quiet when the Imam delivers the Khutba, all his sins in between the present and the last Friday will be forgiven.\"",
      "usc_msa_ref": "33",
      "chain": [
        "30349",
        "20025",
        "20177",
        "11168",
        "11212",
        "14"
      ]
    },
    {
      "id": "sahih-bukhari-3994",
      "hadith_no": "3994",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني الحسن بن عمر بن شقيق، حدثنا معتمر، قال أبي وحدثنا أبو عثمان، عن سلمان الفارسي، أنه تداوله بضعة عشر من رب إلى رب‏.‏",
      "text_en": " Narrated Salman Al-Farisi:                     That he was sold (as a slave) by one master to another for more than ten times (i.e between 13 and 19).",
      "usc_msa_ref": "282",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sahih-muslim-7151",
      "hadith_no": "7151",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني الحكم بن موسى، حدثنا معاذ بن معاذ، حدثنا سليمان التيمي، حدثنا أبو عثمان النهدي عن سلمان الفارسي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لله مائة رحمة فمنها رحمة بها يتراحم الخلق بينهم وتسعة وتسعون ليوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Salman Farisi reported Allah's Messenger (may peace be upon him) as saying:                      Verily, there are one hundred (parts of) mercy for Allah, and it is one part of this mercy by virtue of which there is mutual love between the people and ninety-nine reserved for the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20286",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-7",
      "hadith_no": "7",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قيل له لقد علمكم نبيكم كل شىء حتى الخراءة ‏.‏ قال أجل لقد نهانا صلى الله عليه وسلم أن نستقبل القبلة بغائط أو بول وأن لا نستنجي باليمين وأن لا يستنجي أحدنا بأقل من ثلاثة أحجار أو يستنجي برجيع أو عظم ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     It was said to Salman: Your Prophet teaches you everything, even about excrement. He replied: Yes. He has forbidden us to face the qiblah at the time of easing or urinating, and cleansing with right hand, and cleansing with less than three stones, or cleansing with dung or bone.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-1488",
      "hadith_no": "1488",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا عيسى، - يعني ابن يونس - حدثنا جعفر، - يعني ابن ميمون صاحب الأنماط - حدثني أبو عثمان، عن سلمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن ربكم تبارك وتعالى حيي كريم يستحيي من عبده إذا رفع يديه إليه أن يردهما صفرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     The Prophet (ﷺ) said: Your Lord is munificent and generous, and is ashamed to turn away empty the hands of His servant when he raises them to Him.",
      "usc_msa_ref": "",
      "chain": [
        "38659",
        "20347",
        "18132",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-3761",
      "hadith_no": "3761",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا قيس، عن أبي هاشم، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء قبله فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ وكان سفيان يكره الوضوء قبل الطعام ‏.‏ قال أبو داود وهو ضعيف ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     I read in the Torah that the blessing of food consists in ablution before it. So I mentioned it to the Prophet (ﷺ). He said: The blessing of food consists in ablution before it and ablution after it.Sufyan disapproved of performing ablution before taking food.Abu Dawud said: It is weak.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "11046",
        "11454",
        "10911",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-3813",
      "hadith_no": "3813",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن الفرج البغدادي، حدثنا ابن الزبرقان، حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن سلمان، قال سئل النبي صلى الله عليه وسلم عن الجراد فقال ‏\"‏ أكثر جنود الله لا آكله ولا أحرمه ‏\"‏ ‏.‏ قال أبو داود رواه المعتمر عن أبيه عن أبي عثمان عن النبي صلى الله عليه وسلم لم يذكر سلمان ‏.‏",
      "text_en": " Narrated Salman al-Farsi:                     The Messenger of Allah (ﷺ) was asked about (eating) locusts. He replied: They are the most numerous of Allah's hosts. I neither eat them nor declare them unlawful.",
      "usc_msa_ref": "",
      "chain": [
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-abi-daud-3814",
      "hadith_no": "3814",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا نصر بن علي، وعلي بن عبد الله، قالا حدثنا زكرياء بن يحيى بن عمارة، عن أبي العوام الجزار، عن أبي عثمان النهدي، عن سلمان، أن رسول الله صلى الله عليه وسلم سئل فقال مثله فقال ‏\"‏ أكثر جند الله ‏\"‏ ‏.‏ قال علي اسمه فائد يعني أبا العوام ‏.‏ قال أبو داود رواه حماد بن سلمة عن أبي العوام عن أبي عثمان عن النبي صلى الله عليه وسلم لم يذكر سلمان ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Salman through a different chain of narrators. This version goes:                      Salman said: The Messenger of Allah(ﷺ) was asked about locusts. He replied in a similar way(as mentioned above) saying: The most numerous of Allah’s host. The narrator ‘Ali said: His name is Fa’id, that is the name of al-Awwam.Abu Dawud said: This tradition has been transmitted by Hammad b. Salamah, from Abu al-Awwam from Abu uthman, from the Prophet (ﷺ). He did not mention salman (i.e., the companions).",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "30026",
        "24147",
        "11113",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1726",
      "hadith_no": "1726",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، حدثنا سيف بن هارون البرجمي، عن سليمان التيمي، عن أبي عثمان، عن سلمان، قال سئل رسول الله صلى الله عليه وسلم عن السمن والجبن والفراء ‏.‏ فقال ‏\"‏ الحلال ما أحل الله في كتابه والحرام ما حرم الله في كتابه وما سكت عنه فهو مما عفا عنه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن المغيرة ‏.‏ وهذا حديث غريب لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ وروى سفيان وغيره عن سليمان التيمي عن أبي عثمان عن سلمان قوله وكأن الحديث الموقوف أصح ‏.‏ وسألت البخاري عن هذا الحديث فقال ما أراه محفوظا روى سفيان عن سليمان التيمي عن أبي عثمان عن سلمان موقوفا ‏.‏ قال البخاري وسيف بن هارون مقارب الحديث وسيف بن محمد عن عاصم ذاهب الحديث ‏.‏",
      "text_en": " Narrated Salman:                     \"The Messenger of Allah (ﷺ) was asked about fat, cheese, and furs, so he said: 'The lawful is what Allah made lawful in His Book, the unlawful is what Allah made unlawful in his Book, and what He was silent about; then it is among that for which He has pardoned.'\"[Abu 'Eisa said:] There is something on this topic from Al-Mughirah, and this Hadith is Gharib, we do not know of it being Marfu' except from this route. Sufyan and others reported it from Sulaiman At-Taimi, from Abu 'Uthman, from Salman as his own saying. It is as if the Mawquf narration is more correct. I asked Al-Bukhari about this Hadith and he said: 'I do not think it is preserved. Sufyan reported it from Sulaiman At-Taimi from Abu 'Uthman, from Salman in Mawquf form.' Al-Bukhari said: \"Saif bin Harun is Muqarib (Average) in Hadith, and as for Saif bin Muhammad from 'Asim, his narrations are left.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1846",
      "hadith_no": "1846",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الله بن نمير، حدثنا قيس بن الربيع، ح قال وحدثنا قتيبة، حدثنا عبد الكريم الجرجاني، عن قيس بن الربيع المعنى، واحد، عن أبي هاشم يعني الرماني، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء بعده فذكرت ذلك للنبي صلى الله عليه وسلم فأخبرته بما قرأت في التوراة فقال رسول الله صلى الله عليه وسلم ‏\"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ قال وفي الباب عن أنس وأبي هريرة ‏.‏ قال أبو عيسى لا نعرف هذا الحديث إلا من حديث قيس بن الربيع ‏.‏ وقيس بن الربيع يضعف في الحديث وأبو هاشم الرماني اسمه يحيى بن دينار ‏.‏",
      "text_en": " Narrated Salman:                     \"I read in the Tawrah that the blessing for food is in the Wudu' after it. So I mentioned that to the Prophet (ﷺ), telling him what I read in the Tawrah. So the Messenger of Allah (ﷺ) said: 'The food's blessing is in the Wudu' before it and the Wudu' after it.'\"He said: There are narrations on this topic from Anas and Abu Hurairah.[Abu 'Eisa said:] We do not know of this Hadith except as a narration of Qais bin Ar-Rabi'. Qais [bin Ar-Rabi'] was graded weak in Hadith. Abu Hashim Ar-Rumani's (a narrator in the chain) name is Yahya bin Dinar.",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20331",
        "25246",
        "30367",
        "25246",
        "11454",
        "10911",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2289",
      "hadith_no": "2289",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن حميد الرازي، وسعيد بن يعقوب، قالا حدثنا يحيى بن الضريس، عن أبي مودود، عن سليمان التيمي، عن أبي عثمان النهدي، عن سلمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرد القضاء إلا الدعاء ولا يزيد في العمر إلا البر ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي أسيد ‏.‏ وهذا حديث حسن غريب من حديث سلمان لا نعرفه إلا من حديث يحيى بن الضريس ‏.‏ وأبو مودود اثنان أحدهما يقال له فضة وهو الذي روى هذا الحديث اسمه فضة بصري والآخر عبد العزيز بن أبي سليمان أحدهما بصري والآخر مدني وكانا في عصر واحد ‏.‏",
      "text_en": " 'Salman narrated that the Messenger of Allah (s.a.w) said:                     \"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20678",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3556-2",
      "hadith_no": "3556",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، قال أنبأنا جعفر بن ميمون، صاحب الأنماط عن أبي عثمان النهدي، عن سلمان الفارسي، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله حيي كريم يستحي إذا رفع الرجل إليه يديه أن يردهما صفرا خائبتين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ورواه بعضهم ولم يرفعه ‏.‏",
      "text_en": " Salman Al-farsi narrated that the Prophet said:                     “Indeed, Allah, is Hayy, Generous, when a man raises his hands to Him, He feels too shy to return them to him empty and rejected.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "18132",
        "11113",
        "14"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4306",
      "hadith_no": "4306",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى الأزدي، وأحمد بن منيع، وغير، واحد، قالوا حدثنا أبو بدر، شجاع بن الوليد عن قابوس بن أبي ظبيان، عن أبيه، عن سلمان، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا سلمان لا تبغضني فتفارق دينك ‏\"‏ ‏.‏ قلت يا رسول الله كيف أبغضك وبك هدانا الله قال ‏\"‏ تبغض العرب فتبغضني ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث أبي بدر شجاع بن الوليد ‏.‏ وسمعت محمد بن إسماعيل يقول أبو ظبيان لم يدرك سلمان مات سلمان قبل علي ‏.‏",
      "text_en": " Narrated Salman:                     \"The Messenger of Allah (ﷺ) said to me: 'O Salman! Do not detest me and thereby leave your religion.' I said: 'O Messenger of Allah! How could I detest you while Allah guided us by you.' He said: 'You will detest the Arabs and thereby detest me.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34251",
        "30242",
        "20328",
        "15452",
        "14"
      ]
    },
    {
      "id": "sunan-an-nasai-41",
      "hadith_no": "41",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو معاوية، قال حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال له رجل إن صاحبكم ليعلمكم حتى الخراءة ‏.‏ قال أجل نهانا أن نستقبل القبلة بغائط أو بول أو نستنجي بأيماننا أو نكتفي بأقل من ثلاثة أحجار ‏.‏",
      "text_en": " It was narrated that Salman said, that a man said to him:                      \"Your companion (meaning, the Prophet(ﷺ)) even teaches you how to go to the toilet!\" He said: \"Yes, he forbade us from facing the Qiblah when defecating or urinating, or cleaning ourselves with out right hands, or to use less than three stones.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20354",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "id": "sunan-an-nasai-49",
      "hadith_no": "49",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، وشعيب بن يوسف، واللفظ، له عن عبد الرحمن بن مهدي، عن سفيان، عن منصور، والأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال المشركون إنا لنرى صاحبكم يعلمكم الخراءة ‏.‏ قال أجل نهانا أن يستنجي أحدنا بيمينه ويستقبل القبلة وقال ‏\"‏ لا يستنجي أحدكم بدون ثلاثة أحجار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said:                      \"The idolators said: 'We see that your companion teaches you how to go to the toilet.' He said: 'Yes, he forbade us from cleaning ourselves with our right hand, and from facing toward the Qiblah, and he said: 'None of you should clean with less than three stones.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20005",
        "11067",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-40",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن أبي معشر، زياد بن كليب عن إبراهيم، عن علقمة، عن القرثع الضبي، - وكان من القراء الأولين - عن سلمان، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل يتطهر يوم الجمعة كما أمر ثم يخرج من بيته حتى يأتي الجمعة وينصت حتى يقضي صلاته إلا كان كفارة لما قبله من الجمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said:                     \"The Messenger of Allah (ﷺ) said to me: 'There is no man who purifies himself on Friday as he is commanded, then comes out of his house to the Friday prayer, and listens attentively until he finishes his prayer, but it will be an expiation for what came before it the week before.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11067",
        "10765",
        "11051",
        "11017",
        "14"
      ]
    },
    {
      "id": "sunan-an-nasai-3168",
      "hadith_no": "3168",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، قال حدثني أيوب بن موسى، عن مكحول، عن شرحبيل بن السمط، عن سلمان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رابط في سبيل الله يوما وليلة كانت له كصيام شهر وقيامه فإن مات جرى عليه عمله الذي كان يعمل وأمن الفتان وأجري عليه رزقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Whoever guards Ribat (the frontier) in the cause of Allah for one day and one night, he will have (a reward) like that of fasting and praying Qiyam for a month. If he dies he will continue to receive reward for what he did, and he will be kept safe from Al-Fattan, and he will be given provision.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30355",
        "20023",
        "11241",
        "11066",
        "6225",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-337",
      "hadith_no": "337",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، ح وحدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن منصور، والأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال له بعض المشركين وهم يستهزئون به إني أرى صاحبكم يعلمكم كل شىء حتى الخراءة ‏.‏ قال أجل أمرنا أن لا نستقبل القبلة وأن لا نستنجي بأيماننا ولا نكتفي بدون ثلاثة أحجار ليس فيها رجيع ولا عظم ‏.‏",
      "text_en": " Salman said that one of the idolaters said to him, while they were making fun of him:                     \"I see that your companion (the Prophet) is teaching you everything, even how to relieve yourselves?\" He said: \"Yes indeed. He has ordered us not to face the Qiblah (prayer direction) nor to clean ourselves with our right hands, and not to be content with anything less than three stones, which are not to include any excrement or bones.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "30160",
        "20033",
        "20005",
        "11067",
        "11060",
        "11051",
        "11055",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-505",
      "hadith_no": "505",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا العباس بن الوليد، وأحمد بن الأزهر، قالا حدثنا مروان بن محمد، حدثنا يزيد بن السمط، حدثنا الوضين بن عطاء، عن محفوظ بن علقمة، عن سلمان الفارسي، أن رسول الله  صلى الله عليه وسلم  توضأ فقلب جبة صوف كانت عليه فمسح بها وجهه ‏.‏",
      "text_en": " It was narrated from salman Al-Farisi that :                     The Messenger of Allah performed ablution, then he turned inside out the woolen garment that he was wearing and wiped his face with it.",
      "usc_msa_ref": "",
      "chain": [
        "38001",
        "20640",
        "27556",
        "17548",
        "18970",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-2319",
      "hadith_no": "2319",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا إبراهيم بن المستمر العروقي، حدثنا أبي، حدثنا عبيس بن ميمون، حدثنا عون العقيلي، عن أبي عثمان النهدي، عن سلمان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من غدا إلى صلاة الصبح غدا براية الإيمان ومن غدا إلى السوق غدا براية إبليس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salman said :                     \"I heard the Messenger of Allah (ﷺ) saying: 'Whoever goes to the Morning prayer first thing in the morning, he goes out with the banner of faith but whoever goes out to the marketplace first thing in the morning, he goes out under the banner of Iblis (Satan).' \"",
      "usc_msa_ref": "",
      "chain": [
        "34023",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3340",
      "hadith_no": "3340",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف ونصر بن علي قالا حدثنا زكريا بن يحيى بن عمارة، حدثنا أبو العوام، عن أبي عثمان النهدي، عن سلمان، قال سئل رسول الله  صلى الله عليه وسلم  عن الجراد فقال ‏\"‏ أكثر جنود الله لا آكله ولا أحرمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salman said:                      “The Messenger of Allah (ﷺ) wasaskedabout locusts. He said: ‘(They are) the most numerous troop ofAllah. I neither eat them nor forbid them.’”",
      "usc_msa_ref": "",
      "chain": [
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3476",
      "hadith_no": "3476",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا داود بن سليمان العسكري، قال حدثنا محمد بن الصباح، حدثنا سعيد بن محمد الثقفي، عن موسى الجهني، عن زيد بن وهب، عن عطية بن عامر الجهني، قال سمعت سلمان، وأكره، على طعام يأكله فقال حسبي إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن أكثر الناس شبعا في الدنيا أطولهم جوعا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Atiyyah bin ‘Amir Al-Juhani said:                      “I heardSalman, when he was forced to eat food, say: ‘It is sufficient formethat I heard the Messenger of Allah (ﷺ) say: The people who mosteattheir fill in this world will be the most hungry on the Day ofResurrection.’”",
      "usc_msa_ref": "",
      "chain": [
        "38211",
        "30269",
        "25107",
        "28270",
        "11341",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3492",
      "hadith_no": "3492",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن موسى السدي، حدثنا سيف بن هارون، عن سليمان التيمي، عن أبي عثمان النهدي، عن سلمان الفارسي، قال سئل رسول الله  صلى الله عليه وسلم  عن السمن والجبن والفراء قال ‏\"‏ الحلال ما أحل الله في كتابه والحرام ما حرم الله في كتابه وما سكت عنه فهو مما عفا عنه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salman Al-Farisi said:                      “The Messenger of Allah(ﷺ)was asked about ghee, cheese and wild donkeys. He said: ‘What islawful is that which Allah has permitted, in His Book and what isunlawful is that which Allah has forbidden in His Book. What Heremained silent about is what is pardoned.’”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3693",
      "hadith_no": "3693",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، وأحمد بن الأزهر، قالا حدثنا مروان بن محمد، حدثنا يزيد بن السمط، حدثني الوضين بن عطاء، عن محفوظ بن علقمة، عن سلمان الفارسي، أن رسول الله  صلى الله عليه وسلم  توضأ فقلب جبة صوف كانت عليه فمسح بها وجهه ‏.‏",
      "text_en": " It wasnarrated from Salman Farisi that the Messenger of Allah (ﷺ)performed ablution, then he turned his woolen cloak that he waswearing inside out and wiped his face with it.",
      "usc_msa_ref": "",
      "chain": [
        "38001",
        "20640",
        "27556",
        "17548",
        "18970",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3742",
      "hadith_no": "3742",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن ليث، عن شهر بن حوشب، عن سلمان، قال كان لبعض أمهات المؤمنين شاة فماتت فمر رسول الله  صلى الله عليه وسلم  عليها فقال ‏\"‏ ما ضر أهل هذه لو انتفعوا بإهابها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salman said:                      “One of the Mothers of theBelievers hada sheep that died. The Messenger of Allah (ﷺ) passedby it andsaid: ‘It would not have harmed its owners if they had madeuse ofits hide.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "20023",
        "11044",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3865",
      "hadith_no": "3865",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن جعفر بن ميمون، عن أبي عثمان، عن سلمان، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن ربكم حيي كريم يستحيي من عبده أن يرفع إليه يديه فيردهما صفرا - أو قال خائبتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salman that the :                     Prophet (saas) said: \"Your Lord is Kind and Most Generous, and is too kind to let His slave, if he raises his hands to Him, bring them back empty,\" or he said \"frustrated.\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "18132",
        "11113",
        "14"
      ]
    }
  ],
  "total_hadiths": 27
}