{
  "id": "14048",
  "name": "Thabit bin Amarh al-Hnfy ثابت بن عمارة الحنفي",
  "full_name": "Thabit bin Amarh al-Hnfy ثابت بن عمارة الحنفي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "149",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10710",
      "name": "Ghnym bin Qays al-Mazny غنيم بن قيس المازني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11597",
      "name": "Tarayf bin Mujalad, Abu Tamayma طريف بن مجالد أبو تميمة الهجيمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19845",
      "name": "Rabi'ya bin Shyban al-Sa'dy ربيعة بن شيبان السعدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19480",
      "name": "Ryth bint Hryth ريطة بنت حريث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28337",
      "name": "'Abdur Rahman bin 'Uthman al-Thaqifi عبد الرحمن بن عثمان الثقفي أبو بحر البكر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1415",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن الصباح العطار، حدثنا أبو بحر، حدثنا ثابت بن عمارة، حدثنا أبو تميمة الهجيمي، قال لما بعثنا الركب - قال أبو داود يعني إلى المدينة قال - كنت أقص بعد صلاة الصبح فأسجد فنهاني ابن عمر فلم أنته ثلاث مرار ثم عاد فقال إني صليت خلف رسول الله صلى الله عليه وسلم ومع أبي بكر وعمر وعثمان - رضى الله عنهم - فلم يسجدوا حتى تطلع الشمس ‏.‏",
      "text_en": " Narrated AbuTamimah al-Hujaymi:                     When we came to Medina accompanying the caravan, I used to preach after the dawn prayer, and prostrate on account of the recitation of the Qur'an. Ibn Umar prohibited me three times, but I did not cease  doing that. He then repeated (his prohibition) saying: I prayed behind the Messenger of Allah (ﷺ), AbuBakr, Umar and Uthman, they would not prostrate (on account of the recitation of the Qur'an) till the sun had risen.",
      "chain": [
        "30142",
        "28337",
        "14048",
        "11597",
        "18"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ثابت بن عمارة، حدثتني ريطة، عن كبشة بنت أبي مريم، قالت سألت أم سلمة ما كان النبي صلى الله عليه وسلم ينهى عنه قالت كان ينهانا أن نعجم النوى طبخا أو نخلط الزبيب والتمر ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     Kabshah, daughter of AbuMaryam, asked Umm Salamah (Allah be pleased with her): What did the Prophet (ﷺ) prohibit? She replied: He forbade us to boil dates so much so that the kernels are spoiled, and to mix raisins and dried dates.",
      "chain": [
        "30175",
        "20031",
        "14048"
      ]
    },
    {
      "hadith_no": "4173",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، أخبرنا ثابت بن عمارة، حدثني غنيم بن قيس، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استعطرت المرأة فمرت على القوم ليجدوا ريحها فهي كذا وكذا ‏\"‏ ‏.‏ قال قولا شديدا ‏.‏",
      "text_en": " Narrated AbuMusa:                     The Prophet (ﷺ) said: If a woman uses perfume and passes the people so that they may get its odour, she is so-and-so, meaning severe remarks.",
      "chain": [
        "30175",
        "20031",
        "14048",
        "10710",
        "41"
      ]
    },
    {
      "hadith_no": "3015",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، عن ثابت بن عمارة الحنفي، عن غنيم بن قيس، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل عين زانية والمرأة إذا استعطرت فمرت بالمجلس فهي كذا وكذا يعني زانية ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Musa:                     that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.",
      "chain": [
        "30160",
        "20031",
        "14048",
        "10710",
        "41"
      ]
    },
    {
      "hadith_no": "5126",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا ثابت، - وهو ابن عمارة - عن غنيم بن قيس، عن الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة استعطرت فمرت على قوم ليجدوا من ريحها فهي زانية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Ash'ari said:                     \"The Messenger of Allah [SAW] said: 'Any woman who puts on perfume then passes by people so that they can smell her fragrance then she is an adulteress.'\"",
      "chain": [
        "34033",
        "20423",
        "14048",
        "10710"
      ]
    }
  ],
  "total_hadiths": 5
}