{
  "id": "14056",
  "name": "Jam' bin Mtr al-Hbty جامع بن مطر الحبطي",
  "full_name": "Jam' bin Mtr al-Hbty جامع بن مطر الحبطي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ي  د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حفص بن عمر، حدثنا جامع بن مطر، عن علقمة بن وائل، بإسناده مثله ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Alqamah bin Wa’il through a different chain of narrators.”",
      "chain": [
        "30329",
        "14056"
      ]
    },
    {
      "hadith_no": "4500",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا يحيى بن سعيد، قال حدثني جامع بن مطر، حدثني علقمة بن وائل، بإسناده ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Alqamah b. Wa'il through a different chain of narrators and to the same effect.",
      "chain": [
        "30024",
        "20031",
        "14056"
      ]
    },
    {
      "hadith_no": "4725",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا جامع بن مطر الحبطي، عن علقمة بن وائل، عن أبيه، عن النبي صلى الله عليه وسلم بمثله ‏.‏ قال يحيى وهو أحسن منه ‏.‏",
      "text_en": " A similar report was narrated from 'Alqamah bin Wa'il from his father, from the Prophet. Yahya (one of the narrators) said:                     \"He is better than him.\" [1]",
      "chain": [
        "30160",
        "20031",
        "14056",
        "10801"
      ]
    },
    {
      "hadith_no": "4726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا حفص بن عمر، - وهو الحوضي - قال حدثنا جامع بن مطر، عن علقمة بن وائل، عن أبيه، قال كنت قاعدا عند رسول الله صلى الله عليه وسلم جاء رجل في عنقه نسعة فقال يا رسول الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار فضرب به رأس صاحبه فقتله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى وقال يا نبي الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار فضرب به رأس صاحبه فقتله ‏.‏ فقال ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى ثم قام فقال يا رسول الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار - أراه قال - فضرب رأس صاحبه فقتله ‏.‏ فقال ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى قال ‏\"‏ اذهب إن قتلته كنت مثله ‏\"‏ ‏.‏ فخرج به حتى جاوز فناديناه أما تسمع ما يقول رسول الله صلى الله عليه وسلم فرجع فقال إن قتلته كنت مثله قال ‏\"‏ نعم اعف ‏\"‏ ‏.‏ فخرج يجر نسعته حتى خفي علينا ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Wa'il that his father said:                     \"I was sitting with the Messenger of Allah when a man came with a string around his neck and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, Killing him. 'The Prophet said: 'Forgive him,' but he refused and said: 'O Prophet of Allah, this man and my brother were digging a whole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused, then he stood up and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused. He (the prophet) said: 'Go, but if you kill him, you will be like him. So he took him out, and they called out to him: Didn't you hear what the Messenger of Allah said?' So he came back and he said: 'If I kill him will I be like him?' He said: 'Yes. Forgive him.' Then he went out, dragging his string, until he disappeared from our view.\"",
      "chain": [
        "38433",
        "34062",
        "14056",
        "10801"
      ]
    }
  ],
  "total_hadiths": 4
}