{
  "id": "14069",
  "name": "Habib bin Abi Fadalan/Fadala حبيب بن أبي فضلان/ فضالة المالكي",
  "full_name": "Habib bin Abi Fadalan/Fadala حبيب بن أبي فضلان/ فضالة المالكي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  مقبول ]"
    ],
    "tags": [
      "al-Maalki",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "24151",
      "name": "Ziyad bin Abi Muslim زياد بن أبي مسلم ويقال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20237",
      "name": "Salam bin Mskyn bin Rabi'ya سلام بن مسكين بن ربيعة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24210",
      "name": "Sard bin Abi al-Manazil صرد بن أبي المنازل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1545",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا خالد، أخبرنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  أنها قالت يا رسول الله، نرى الجهاد أفضل العمل، أفلا نجاهد قال ‏\"‏ لا، لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of the faithful believers) I said, \"O Allah's Apostle! We consider Jihad as the best deed.\" The Prophet said, \"The best Jihad (for women) is Hajj Mabrur. \"",
      "chain": [
        "30147",
        "20423",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا حبيب بن أبي عمرة، قال حدثتنا عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  قالت قلت يا رسول الله ألا نغزوا ونجاهد معكم فقال ‏\"‏ لكن أحسن الجهاد وأجمله الحج، حج مبرور ‏\"‏‏.‏ فقالت عائشة فلا أدع الحج بعد إذ سمعت هذا من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha (mother of the faithful believers):                     I said, \"O Allah's Apostle! Shouldn't we participate in Holy battles and Jihad along with you?\" He replied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" `Aisha added: Ever since I heard that from Allah's Apostle I have determined not to miss Hajj.",
      "chain": [
        "30175",
        "20256",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2784",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله ترى الجهاد أفضل العمل، أفلا نجاهد قال ‏\"‏ لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (That she said), \"O Allah's Apostle! We consider Jihad as the best deed. Should we not fight in Allah's Cause?\" He said, \"The best Jihad (for women) is Hajj-Mabrur (i.e. Hajj which is done according to the Prophet's tradition and is accepted by Allah).",
      "chain": [
        "30175",
        "20423",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2876",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن معاوية، بهذا‏.‏ وعن حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، عن النبي صلى الله عليه وسلم سأله نساؤه عن الجهاد فقال ‏\"‏ نعم الجهاد الحج ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     the mother of the faithful believers: The Prophet was asked by his wives about the Jihad and he replied, \"The best Jihad (for you) is (the performance of) Hajj.\"",
      "chain": [
        "20351",
        "20012",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "5295",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمزفت والنقير وأن يخلط البلح بالزهو ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) forbade the (preparation of Nabidh) in gourd in pitcher besmeared with pitch, in varnished jar, and in hollow stumps.",
      "chain": [
        "30201",
        "20356",
        "14069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3497",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا معاوية بن عمرو، عن أبي إسحاق الفزاري، عن سفيان الثوري، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، في قول الله تعالى ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض ‏)‏ قال غلبت وغلبت كان المشركون يحبون أن يظهر أهل فارس على الروم لأنهم وإياهم أهل أوثان وكان المسلمون يحبون أن يظهر الروم على فارس لأنهم أهل كتاب فذكروه لأبي بكر فذكره أبو بكر لرسول الله صلى الله عليه وسلم قال ‏\"‏ أما إنهم سيغلبون ‏\"‏ ‏.‏ فذكره أبو بكر لهم فقالوا اجعل بيننا وبينك أجلا فإن ظهرنا كان لنا كذا وكذا وإن ظهرتم كان لكم كذا وكذا فجعل أجل خمس سنين فلم يظهروا فذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ ألا جعلته إلى دون - قال أراه العشر ‏\"‏ ‏.‏ قال سعيد والبضع ما دون العشر قال ثم ظهرت الروم بعد ‏.‏ قال فذلك قوله تعالى ‏:‏ ‏(‏ الم * غلبت الروم ‏)‏ إلى قوله ‏:‏ ‏(‏يفرح المؤمنون * بنصر الله ينصر من يشاء ‏)‏ قال سفيان سمعت أنهم ظهروا عليهم يوم بدر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب إنما نعرفه من حديث سفيان الثوري عن حبيب بن أبي عمرة ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     from Ibn 'Abbas, regarding the saying of Allah, Most High: Alif Lam Mim. The Romans have been defeated. In the nearest land (30:1-3)\" he said: \"Ghulibat wa Ghalabat (defeated and then victorious).\" He said: \"The idolaters wanted the Persians to be victorious over the Romans because they too were people who worshiped idols, while the Muslims wanted the Romans to be victorious over the Persians because they were people of the Book. This was mentioned to Abu Bakr, so Abu Bakr mentioned that to the Messenger of Allah (ﷺ) and he said: 'They will certainly prevail.' Abu Bakr mentioned that to them, and they said: 'Make a wager between us and you; if we win, we shall get this and that, and if you win, you shall get this or that.' He made the term five years, but they (the Romans) were not victorious. They mentioned that to the Prophet (ﷺ) and he said: \"Why did you not make it less (than)\" - He (one of the narrators said): I think he said: \"ten?\" He said: Sa'eed said: \"Al-Bid' is what is less than then\" - he said: \"Afterwards the Romans have been victorious.\" He said: \"That is what Allah Most High said: 'Alif Lam Mim. The Romans have been defeated' up to His saying: 'And on the day, the believers will rejoice - with the help of Allah. He helps whom He wills (30:1-5).' Sufyan said: \"I heard that they were victorious over them on the Day of Badr.\"",
      "chain": [
        "30325",
        "20389",
        "20405",
        "20012",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "3549",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، عن عنبسة بن سعيد، عن حبيب بن أبي عمرة، عن مجاهد، قال قال ابن عباس أتدري ما سعة جهنم قلت لا ‏.‏ قال أجل والله ما تدري ‏.‏ حدثتني عائشة أنها سألت رسول الله صلى الله عليه وسلم عن قوله ‏:‏ ‏(‏والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه ‏)‏ قالت قلت فأين الناس يومئذ يا رسول الله قال ‏\"‏ على جسر جهنم ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Mujahid:                     that Ibn 'Abbas said: \"Do you know what is the width of Jahannam?\" I said: \"No.\" He said: \"Yes, and by Allah I do not know. 'Aishah narrated to me that she asked the Messenger of ALlah (ﷺ) about Allah's saying: 'On the Day of Resurrection the whole earth will be grasped by His Hand and the heavens will be rolled up in his Right Hand (39:67).' She said: 'I said \"Where will the people be on that day O Messenger of Allah?\" He said: \"Upon the bridge over Jahannam.\"",
      "chain": [
        "38265",
        "20025",
        "25221",
        "14069",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "3616",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا عفان بن مسلم، حدثنا حفص بن غياث، حدثنا حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، في قول الله عز وجل ‏:‏ ‏(‏ما قطعتم من لينة أو تركتموها قائمة على أصولها ‏)‏ ‏.‏ قال اللينة النخلةيخزي الفاسقين ‏)‏ قال استنزلوهم من حصونهم قال وأمروا بقطع النخل فحك في صدورهم ‏.‏ فقال المسلمون قد قطعنا بعضا وتركنا بعضا فلنسألن رسول الله صلى الله عليه وسلم هل لنا فيما قطعنا من أجر وهل علينا فيما تركنا من وزر فأنزل الله تعالى ‏:‏ ‏(‏ما قطعتم من لينة أو تركتموها قائمة على أصولها ‏)‏ ‏.‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Hafs bin Ghiyath narrated:                     “Habib bin Abi Amrah narrated to us, from Sa’eed bin Jubair, from Ibn Abbas, regarding the saying of Allah, the Mighty and Sublime: What you cut down of the Linah, or you left of them standing on their trunks – he said: ‘The Linah is the date-palms.’ That He might disgrace the rebellious. He said: ‘They were forced from their forts.’ And they were ordered to cut down the date-pals, that caused some hesitation in their chests, so the Muslims said: “We cut some of them, and we left some of them, so let us ask the Messenger of Allah is we are to be rewarded for those that we cut down, and if we will be burdened for what we left?” So Allah [Most High] revealed the Ayah: What you cut down of the Linah, or you left of them standing on their trunks.”",
      "chain": [
        "30245",
        "30106",
        "20317",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "وروى بعضهم، هذا الحديث عن حفص بن غياث، عن حبيب بن أبي عمرة، عن سعيد بن جبير، مرسلا ولم يذكر فيه عن ابن عباس، ‏.‏ حدثني بذلك عبد الله بن عبد الرحمن، حدثنا هارون بن معاوية، عن حفص بن غياث، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال أبو عيسى سمع مني محمد بن إسماعيل هذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "20317",
        "14069",
        "11050",
        "20317",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن حبيب، - وهو ابن أبي عمرة - عن عائشة بنت طلحة، قالت أخبرتني أم المؤمنين، عائشة قالت قلت يا رسول الله ألا نخرج فنجاهد معك فإني لا أرى عملا في القرآن أفضل من الجهاد ‏.‏ قال ‏\"‏ لا ولكن أحسن الجهاد وأجمله حج البيت حج مبرور ‏\"‏ ‏.‏",
      "text_en": " The Mother of the Believers, 'Aishah, said:                     \"I said: 'O Messenger of allah, shall we not go out and fight in jihad with you, for I do not think there is any deed in the qur'an that is better than jihad.' He said: 'No. the best and most beautiful (type) of jihad is Hajj to the House; Hajj Al-Mabrur. ''(sahih)",
      "chain": [
        "30123",
        "20028",
        "14069",
        "10504"
      ]
    },
    {
      "hadith_no": "5548",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمزفت والنقير وأن يخلط البلح والزهو‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] forbade Ad-Dubba', Al-Hantam, Al-Muzaffat, and An-Naqir, and (he forbade) mixing Al-Balh with Az-Zahuw.\"",
      "chain": [
        "20356",
        "14069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5549",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن الدباء والمزفت - وزاد مرة أخرى - والنقير وأن يخلط التمر بالزبيب والزهو بالتمر‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] forbade Ad-Dubba', Al-Muzaffat,\" - and on one occasion he added: \"An-Naqir,\" - \"and (he forbade) mixing At-Tamr (dried dates) with raisins, and Az-Zahuw with At-Tamr.\"",
      "chain": [
        "30123",
        "20028",
        "14069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5559",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن آدم، وعلي بن سعيد، قالا حدثنا عبد الرحيم، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن خليط التمر والزبيب وعن التمر والبسر‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] forbade mixing dried dates and raisins, and dried dates and Al-Busr.\"",
      "chain": [
        "38401",
        "20334",
        "14069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5575",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سفيان، عن حبيب بن أبي عمرة، عن سعيد بن جبير، قال السكر خمر ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jubair said:                     \"Strong drink is Khamr.\"",
      "chain": [
        "18",
        "20005",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "5576",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن حبيب، - وهو ابن أبي عمرة - عن سعيد بن جبير، قال السكر خمر ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jubair said:                     \"Strong drink is Khamr.\"",
      "chain": [
        "30123",
        "20028",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "3013",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة، قالت قلت يا رسول الله على النساء جهاد قال ‏\"‏ نعم عليهن جهاد لا قتال فيه الحج والعمرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I said: ‘O Messenger of Allah, isJihad obligatory for women?’ He said: “Yes: Upon them is a Jihadinwhich there is no fighting: Al-Hajj and Al-‘Umrah.”",
      "chain": [
        "30201",
        "20356",
        "14069",
        "10504",
        "53"
      ]
    }
  ],
  "total_hadiths": 16
}