{
  "id": "14135",
  "name": "Zayd bin al-Hwary Abu زيد بن الحواري أبو الحواري",
  "full_name": "Zayd bin al-Hwary Abu زيد بن الحواري أبو الحواري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [4  الأربعة][4  الأربعة]"
    ],
    "tags": [
      "Judge",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11306",
      "name": "Mua'wiya bin Qurrah bin Iyas معاوية بن قرة بن إياس بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11268",
      "name": "Bakr bin 'Amr Abu al-Siddique al-Naji بكر بن عمرو/ قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15060",
      "name": "Jabir bin Yazid bin al-Harith جابر بن يزيد بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11711",
      "name": "Amarh bin Abi Hafs'h عمارة بن أبي حفصة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "521",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن زيد العمي، عن أبي إياس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرد الدعاء بين الأذان والإقامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The supplication made between the adhan and the iqamah is not rejected.",
      "chain": [
        "28531",
        "20012",
        "14135",
        "19"
      ]
    },
    {
      "hadith_no": "4119",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن سفيان، أخبرني زيد العمي، عن أبي الصديق الناجي، عن ابن عمر، قال رخص رسول الله صلى الله عليه وسلم لأمهات المؤمنين في الذيل شبرا ثم استزدنه فزادهن شبرا فكن يرسلن إلينا فنذرع لهن ذراعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) gave licence to others of the believers (i.e. the wives of the Prophet) to hang down their lower garment a span. Then they asked him to increase it, and he increased one span for them. They would send (the garment) to us and we would measure it one forearm's length for them.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "14135",
        "11268",
        "18"
      ]
    },
    {
      "hadith_no": "212",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، وعبد الرزاق، وأبو أحمد وأبو نعيم قالوا حدثنا سفيان، عن زيد العمي، عن أبي إياس، معاوية بن قرة عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الدعاء لا يرد بين الأذان والإقامة ‏\"‏ ‏.‏ قال أبو عيسى حديث أنس حديث حسن ‏.‏ وقد رواه أبو إسحاق الهمداني عن بريد بن أبي مريم عن أنس عن النبي صلى الله عليه وسلم مثل هذا ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     Allah's Messenger said: \"The supplication made between the Adhan and Iqamah is not rejected.\"",
      "chain": [
        "30277",
        "20032",
        "20121",
        "20005",
        "14135",
        "19"
      ]
    },
    {
      "hadith_no": "1442",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن مسعر، عن زيد العمي، عن أبي الصديق الناجي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم ضرب الحد بنعلين أربعين ‏.‏ قال مسعر أظنه في الخمر ‏.‏ قال وفي الباب عن علي وعبد الرحمن بن أزهر وأبي هريرة والسائب وابن عباس وعقبة بن الحارث ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن ‏.‏ وأبو الصديق الناجي اسمه بكر بن عمرو ويقال بكر بن قيس ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     That the Messenger of Allah (ﷺ) implemented the penalty by beating forty times, with two shoes - Mis'ar (one of the narrators) said: \"It think it was for wine.\"",
      "chain": [
        "35047",
        "20359",
        "14135",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "2678",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن عمران بن زيد التغلبي، عن زيد العمي، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا استقبله الرجل فصافحه لا ينزع يده من يده حتى يكون الرجل الذي ينزع ولا يصرف وجهه عن وجهه حتى يكون الرجل هو الذي يصرفه ولم ير مقدما ركبتيه بين يدى جليس له ‏.‏ قال هذا حديث غريب ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"When the Prophet(s.a.w) would receive a man to shake hands with him,he would not remove his hand until he [the man]removed his, and he would not turn his face away from his face until the man turned and he would not be seen advancing his knees before one sitting with him.\"",
      "chain": [
        "38265",
        "20025",
        "14135",
        "19"
      ]
    },
    {
      "hadith_no": "3594",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو هشام الرفاعي، محمد بن يزيد الكوفي حدثنا يحيى بن اليمان، حدثنا سفيان، عن زيد العمي، عن أبي إياس، معاوية بن قرة عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الدعاء لا يرد بين الأذان والإقامة ‏\"‏ ‏.‏ قالوا فماذا نقول يا رسول الله قال ‏\"‏ سلوا الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد زاد يحيى بن اليمان في هذا الحديث هذا الحرف قالوا فماذا نقول قال ‏\"‏ سلوا الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah said:                     “The supplication is not rejected between the Adhan and the Iqamah.” They said: “So what should we say, O Messenger of Allah?” He said: “Ask Allah for Al-Afiyah in the world and in the Hereafter.”",
      "chain": [
        "30478",
        "20012",
        "14135",
        "19"
      ]
    },
    {
      "hadith_no": "3595",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، وعبد الرزاق، وأبو أحمد وأبو نعيم عن سفيان، عن زيد العمي، عن معاوية بن قرة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء لا يرد بين الأذان والإقامة ‏\"‏ ‏.‏ قال أبو عيسى وهكذا روى أبو إسحاق الهمداني هذا الحديث عن بريد بن أبي مريم الكوفي عن أنس عن النبي صلى الله عليه وسلم نحو هذا وهذا أصح ‏.‏",
      "text_en": " Anas [bin Malik] narrated that the Prophet said:                     “The supplication is not rejected between the Adhan and the Iqamah.”",
      "chain": [
        "30277",
        "20032",
        "20121",
        "20005",
        "14135",
        "11306",
        "19"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شريك، عن جابر، عن زيد العمي، عن أبي الصديق الناجي، عن عائشة، أن النبي  صلى الله عليه وسلم  كان يغسل مقعدته ثلاثا ‏.‏ قال ابن عمر فعلناه فوجدناه دواء وطهورا ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Prophet used to wash his private parts three times. Ibn 'Umar said: \"We did that and we found it to be healing and a means of purification.\"",
      "chain": [
        "38409",
        "20032",
        "20587",
        "34",
        "14135",
        "11268",
        "53"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا إسماعيل بن قعنب أبو بشر، حدثنا عبد الله بن عرادة الشيباني، عن زيد بن الحواري، عن معاوية بن قرة، عن عبيد بن عمير، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  دعا بماء فتوضأ مرة مرة فقال ‏\"‏ هذا وظيفة الوضوء ‏\"‏ ‏.‏ أو قال ‏\"‏ وضوء من لم يتوضأه لم يقبل الله له صلاة ‏\"‏ ‏.‏ ثم توضأ مرتين مرتين ثم قال ‏\"‏ هذا وضوء من توضأه أعطاه الله كفلين من الأجر ‏\"‏ ‏.‏ ثم توضأ ثلاثا ثلاثا فقال ‏\"‏ هذا وضوئي ووضوء المرسلين من قبلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah called for water and performed ablution once. He said: \"This is the minimum requirement of ablution' or he said: 'The ablution of one who, if he does not perform this ablution, Allah will not accept his prayer.\" Then he performed ablution washing each part twice, and he said: 'This is the ablution of one who, if he performs it, Allah will give him two shares of reward.\" Then he performed ablution washing each part three times, and said: 'This is my ablution and the ablution of the Messengers who were sent before me.\"",
      "chain": [
        "38132",
        "24241",
        "14135",
        "11306",
        "11259",
        "39"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن عبد الرحمن، حدثنا الحسين بن علي، وزيد بن الحباب، ح وحدثنا محمد بن يحيى، حدثنا أبو نعيم، قالوا حدثنا عمرو بن عبد الله بن وهب أبو سليمان النخعي، قال حدثني زيد العمي، عن أنس بن مالك، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من توضأ فأحسن الوضوء ثم قال ثلاث مرات أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله فتح له ثمانية أبواب الجنة من أيها شاء دخل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     The Prophet said: \"Whoever performs ablution and does it well, then says three times: 'Ashhadu an la ilaha illallah wahdahu la sharika lahu, wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (I bear witness that none has the right to be worshipped but Allah alone, with no partner, and I bear witness that Muhammed is His slave and His Messenger),' eight gates of Paradise will be opened for him; whichever one he wants he may enter.\" (Da'if)Another chain with similar wording.",
      "chain": [
        "20315",
        "20650",
        "11222",
        "20348",
        "14135",
        "19"
      ]
    },
    {
      "hadith_no": "877",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو داود الطيالسي، حدثنا المسعودي، حدثنا زيد العمي، عن أبي نضرة، عن أبي سعيد الخدري، قال اجتمع ثلاثون بدريا من أصحاب رسول الله  صلى الله عليه وسلم  فقالوا تعالوا حتى نقيس قراءة رسول الله  صلى الله عليه وسلم  فيما لم يجهر فيه من الصلاة ‏.‏ فما اختلف منهم رجلان فقاسوا قراءته في الركعة الأولى من الظهر بقدر ثلاثين آية وفي الركعة الأخرى قدر النصف من ذلك وقاسوا ذلك في صلاة العصر على قدر النصف من الركعتين الأخريين من الظهر ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “Thirty of theCompanions of the Messenger of Allah (ﷺ) who had been at Badr cametogether and said: ‘Come, let us estimate the length of therecitationof the Messenger of Allah (ﷺ) for the prayer in whichQur’an is notrecited out aloud.’ No two men among themdisagreed, and theyestimated the length of his recitation in thefirst Rak’ah of the Zuhrto be thirty Verses and in the secondRak’ah to be half of that. Theyestimated his recitation in ‘Asrto be half of the last two Rak’ah ofZuhr.”",
      "chain": [
        "34280",
        "20547",
        "20724",
        "14135",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3712",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن زيد العمي، عن أبي الصديق الناجي، عن ابن عمر، أن أزواج النبي،  صلى الله عليه وسلم  رخص لهن في الذيل ذراعا فكن يأتينا فنذرع لهن بالقصب ذراعا ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar:                      “The wives of the Prophet (ﷺ) wereallowed to let their hems hang down, so they used to come to us andwewould measure one forearms length for them with a reed.”",
      "chain": [
        "20436",
        "20033",
        "20012",
        "14135",
        "11268",
        "18"
      ]
    },
    {
      "hadith_no": "3716",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن أبي يحيى الطويل، - رجل من أهل الكوفة - عن زيد العمي، عن أنس بن مالك، قال كان النبي  صلى الله عليه وسلم  إذا لقي الرجل فكلمه لم يصرف وجهه عنه حتى يكون هو الذي ينصرف وإذا صافحه لم ينزع يده من يده حتى يكون هو الذي ينزعها ولم ير متقدما بركبتيه جليسا له قط ‏.‏",
      "text_en": " It was narrated that Anas bin Malik  said:                     \"Whenever the Prophet(ﷺ) met a man, he would speak to him, and would not tun away until he (the other man) was the one who turned away. And if he shook hands with him, he would not withdraw his hand until he (the other man) withdrew his hand. And he was never seen sitting with his knees ahead of the knees of the one who was sitting next to him.\"",
      "chain": [
        "38409",
        "20032",
        "14135",
        "19"
      ]
    },
    {
      "hadith_no": "4221",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا محمد بن مروان العقيلي، حدثنا عمارة بن أبي حفصة، عن زيد العمي، عن أبي صديق الناجي، عن أبي سعيد الخدري، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ يكون في أمتي المهدي إن قصر فسبع وإلا فتسع فتنعم فيه أمتي نعمة لم ينعموا مثلها قط تؤتى أكلها ولا تدخر منهم شيئا والمال يومئذ كدوس فيقوم الرجل فيقول يا مهدي أعطني فيقول خذ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Prophet (ﷺ)said:                      \"The Mahdi will be among my nation. If he lives for ashortperiod, it will be seven, and if he lives for a long period, itwillbe nine, during which my nation will enjoy a time of ease suchas ithas never enjoyed. The land will bring forth its yield and willnothold back anything, and wealth at that time will be piled up. Amanwill stand up and say: 'O Mahdi, give me!' He will say: 'Take.'\"",
      "chain": [
        "30395",
        "24415",
        "11711",
        "14135",
        "38"
      ]
    }
  ],
  "total_hadiths": 14
}