{
  "id": "14150",
  "name": "Sa'id bin 'Ubaid al-Hna'iy سعيد بن عبيد الهنائي",
  "full_name": "Sa'id bin 'Ubaid al-Hna'iy سعيد بن عبيد الهنائي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ت  س  -  لا بأس به ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20195",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Ubaid عبد الرحمن بن عبد الله بن عبيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-3309",
      "hadith_no": "3309",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الصمد بن عبد الوارث، حدثنا سعيد بن عبيد الهنائي، حدثنا عبد الله بن شقيق، حدثنا أبو هريرة، أن رسول الله صلى الله عليه وسلم نزل بين ضجنان وعسفان فقال المشركون إن لهؤلاء صلاة هي أحب إليهم من آبائهم وأبنائهم وهي العصر فأجمعوا أمركم فميلوا عليهم ميلة واحدة وإن جبريل أتى النبي صلى الله عليه وسلم فأمره أن يقسم أصحابه شطرين فيصلي بهم وتقوم طائفة أخرى وراءهم وليأخذوا حذرهم وأسلحتهم ثم يأتي الآخرون ويصلون معه ركعة واحدة ثم يأخذ هؤلاء حذرهم وأسلحتهم فتكون لهم ركعة ركعة ولرسول الله صلى الله عليه وسلم ركعتان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن شقيق عن أبي هريرة ‏.‏ وفي الباب عن عبد الله بن مسعود وزيد بن ثابت وابن عباس وجابر وأبي عياش الزرقي وابن عمر وحذيفة وأبي بكرة وسهل بن أبي حثمة وأبو عياش الزرقي اسمه زيد بن صامت ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) halted between Dajnan and 'Usfan, and the idolaters aid: \"These people have a prayer which is more loved to them than their fathers and their children.\" That is, 'Asr. They gathered their forces and advanced altogether. And Jibra'il came to the Prophet (ﷺ) and told him to divide his Companions into two lines and lead them in prayer, and another group stood behind them on guard with their weapons. Then the other group came and prayed one Rak'ah with him. Then these people stood guard with their weapons, so each of them performed one Rak'ah while the Messenger of Allah (ﷺ) performed two Rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20250",
        "14150",
        "10694",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1544",
      "hadith_no": "1544",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثني عبد الصمد بن عبد الوارث، قال حدثني سعيد بن عبيد الهنائي، قال حدثنا عبد الله بن شقيق، قال حدثنا أبو هريرة، قال كان رسول الله صلى الله عليه وسلم نازلا بين ضجنان وعسفان محاصر المشركين فقال المشركون إن لهؤلاء صلاة هي أحب إليهم من أبنائهم وأبكارهم أجمعوا أمركم ثم ميلوا عليهم ميلة واحدة فجاء جبريل عليه السلام فأمره أن يقسم أصحابه نصفين فيصلي بطائفة منهم وطائفة مقبلون على عدوهم قد أخذوا حذرهم وأسلحتهم فيصلي بهم ركعة ثم يتأخر هؤلاء ويتقدم أولئك فيصلي بهم ركعة تكون لهم مع النبي صلى الله عليه وسلم ركعة ركعة وللنبي صلى الله عليه وسلم ركعتان ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) was camping between Dajnan and 'Usfan, besieging the idolaters. The idolaters said: 'These people have a prayer that is dearer to them than their sons and daughters. Plan it, then strike them with a single heavy blow.' Jibril, peace be upon him, came and told the Messenger of Allah (ﷺ) to divide his companions into two groups, then lead one group in prayer while the others faced the enemy, on guard and with weapons at the ready. So he led them in praying one rak'ah, then they moved back and the others moved forward, and he led them in praying on rak'ah, so that each one of them had prayed one rak'ah with the Prophet (ﷺ) and the Prophet (ﷺ) had prayed two rak'ahs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20250",
        "14150",
        "10694",
        "13"
      ]
    }
  ],
  "total_hadiths": 2
}