{
  "id": "14179",
  "name": "Shryk bin Shhab al-Harithy شريك بن شهاب الحارثي البصري",
  "full_name": "Shryk bin Shhab al-Harithy شريك بن شهاب الحارثي البصري",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ س  -  مقبول ]"
    ],
    "tags": [
      "B.Haritha",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4103",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن معمر البصري الحراني، قال حدثنا أبو داود الطيالسي، قال حدثنا حماد بن سلمة، عن الأزرق بن قيس، عن شريك بن شهاب، قال كنت أتمنى أن ألقى، رجلا من أصحاب النبي صلى الله عليه وسلم أسأله عن الخوارج فلقيت أبا برزة في يوم عيد في نفر من أصحابه فقلت له هل سمعت رسول الله صلى الله عليه وسلم يذكر الخوارج فقال نعم سمعت رسول الله صلى الله عليه وسلم بأذني ورأيته بعيني أتي رسول الله صلى الله عليه وسلم بمال فقسمه فأعطى من عن يمينه ومن عن شماله ولم يعط من وراءه شيئا فقام رجل من ورائه فقال يا محمد ما عدلت في القسمة ‏.‏ رجل أسود مطموم الشعر عليه ثوبان أبيضان فغضب رسول الله صلى الله عليه وسلم غضبا شديدا وقال ‏\"‏ والله لا تجدون بعدي رجلا هو أعدل مني ‏\"‏ ‏.‏ ثم قال ‏\"‏ يخرج في آخر الزمان قوم كأن هذا منهم يقرءون القرآن لا يجاوز تراقيهم يمرقون من الإسلام كما يمرق السهم من الرمية سيماهم التحليق لا يزالون يخرجون حتى يخرج آخرهم مع المسيح الدجال فإذا لقيتموهم فاقتلوهم هم شر الخلق والخليقة ‏\"‏ ‏.‏ قال أبو عبد الرحمن رحمه الله شريك بن شهاب ليس بذلك المشهور ‏.‏",
      "text_en": " it was narrated that Sharik bin Shihab said:                     \"I used to wish that I could meet a man among the Companions of the Prophet [SAW] and ask him about the Khawarij. Then I met Abu Barzah on the day of 'Id, with a number of his companions. I said to him: 'Did you hear the Messenger of Allah [SAW] mention the Khawarij?' He said: 'Yes. I heard the Messenger of Allah [SAW] with my own ears, and saw him with my own eyes. Some wealth was brought to the Messenger of Allah [SAW] and he distributed it to those on his right and on his left, but he did not give anything to those who were behind him. Then a man stood behind him and said: \"O Muhammad! You have not been just in your division!\" He was a man with black patchy (shaved) hair, wearing two white garments. So Allah's Messenger [SAW] became very angry and said: \"By Allah! You will not find a man after me who is more just than me.\" Then he said: \"A people will come at the end of time; as if he is one of them, reciting the Qur'an without it passing beyond their throats. They will go through Islam just as the arrow goes through the target. Their distinction will be shaving. They will not cease to appear until the last of them comes with Al-Masih Ad-Dajjal. So when you meet them, then kill them, they are the worst of created beings.\"",
      "chain": [
        "30172",
        "20547",
        "20021",
        "11574",
        "14179"
      ]
    }
  ],
  "total_hadiths": 1
}