{
  "id": "14212",
  "name": "'Abdullah bin Saraqa al-Azdi عبد الله بن سراقة الأزدي",
  "full_name": "'Abdullah bin Saraqa al-Azdi عبد الله بن سراقة الأزدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-'Ajli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4756",
      "hadith_no": "4756",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت النبي صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ إنه لم يكن نبي بعد نوح إلا وقد أنذر الدجال قومه، وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم وقال ‏:‏ ‏\"‏ لعله سيدركه من قد رآني وسمع كلامي ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله كيف قلوبنا يومئذ أمثلها اليوم قال ‏:‏ ‏\"‏ أو خير ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUbaydah ibn al-Jarrah:                     I heard the Prophet (ﷺ) say: There has been no Prophet after Noah who has not warned his people about the antichrist (Dajjal), and I warn you of him. The Messenger of Allah (ﷺ) described him to us, saying: Perhaps some who have seen me and heard my words will live till his time. The people asked: Messenger of Allah! what will be the condition of our hearts on that day? Like what we are today? He replied: Or better.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2234-2",
      "hadith_no": "2234",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه لم يكن نبي بعد نوح إلا قد أنذر الدجال قومه وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لعله سيدركه بعض من رآني أو سمع كلامي ‏\"‏ ‏.‏ قالوا يا رسول الله فكيف قلوبنا يومئذ قال ‏\"‏ مثلها يعني اليوم أو خير ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن بسر وعبد الله بن الحارث بن جزى وعبد الله بن مغفل وأبي هريرة ‏.‏ وهذا حديث حسن غريب من حديث أبي عبيدة بن الجراح لا نعرفه إلا من حديث خالد الحذاء وقد رواه شعبة أيضا عن خالد الحذاء ‏.‏ وأبو عبيدة بن الجراح اسمه عامر بن عبد الله بن الجراح ‏.‏",
      "text_en": " Abu 'Ubaidah bin Al-Jarrah said:                     \"I heard the Messenger of Allah(s.a.w): 'There was never a Prophet after Nuh but that he warned his people about the Dajjal, and indeed I shall warn you of him.' Then the Messenger of Allah(s.a.w) described him for us, and he said: \"Perhaps some of you who see me, or hear my words shall live to see him.\" They said: \"O Messenger of Allah! How will our hearts be on that day?\" He said: \"The same",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    }
  ],
  "total_hadiths": 2
}