{
  "id": "14262",
  "name": "'Utba bin Hameed al-Dby عتبة بن حميد الضبي أبو معاذ",
  "full_name": "'Utba bin Hameed al-Dby عتبة بن حميد الضبي أبو معاذ",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11436",
      "name": "'Ubaidullah bin Abi Bakr عبيد الله بن أبي بكر بن أنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19893",
      "name": "'Aabadh bin Nsy عبادة بن نسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19138",
      "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق الهنائي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "28326",
      "name": "'Abdur Rahman bin Ziyad عبد الرحمن بن زياد بن أنعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "54",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا رشدين بن سعد، عن عبد الرحمن بن زياد بن أنعم، عن عتبة بن حميد، عن عبادة بن نسى، عن عبد الرحمن بن غنم، عن معاذ بن جبل، قال رأيت النبي صلى الله عليه وسلم إذا توضأ مسح وجهه بطرف ثوبه ‏.‏ قال أبو عيسى هذا حديث غريب وإسناده ضعيف ‏.‏ ورشدين بن سعد وعبد الرحمن بن زياد بن أنعم الإفريقي يضعفان في الحديث ‏.‏ وقد رخص قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم في التمندل بعد الوضوء ومن كرهه إنما كرهه من قبل أنه قيل إن الوضوء يوزن ‏.‏ وروي ذلك عن سعيد بن المسيب والزهري ‏.‏ حدثنا محمد بن حميد الرازي حدثنا جرير قال حدثنيه علي بن مجاهد عني وهو عندي ثقة عن ثعلبة عن الزهري قال إنما كره المنديل بعد الوضوء لأن الوضوء يوزن ‏.‏",
      "text_en": " Muadh bin Jabal narrated:                     \"I saw the Prophet when he performed Wudu, he wiped his face with the edge of his garment.\"  Abu Eisa said: This Hadith is gharib, and its chain is weak. Rishdin bin Sa'd and Abdur- Rahman bin Ziyad bin An'um Al Ifriqi [narrators in the chain of this Hadith] are weak in Hadith. Some people of knowledge among the Companions of the Prophet  and those after them, permitted using a towel after Wudu. Those who disliked it, only disliked it from the view of the saying: \"Wudu is weighed.\" That as reported from Sa'eed bin Al- Musayyab and Az-Zuhri. Muhammad bin Humaid [Ar-Razi] narrated to us, Jarir narrated to us,  he said: Ali bin Mujahid narrated to me, and he is trustworthy to me, from me, from: Tha'labah from Az-Zuhri, he said: \"The towel is only disliked after Wudu because Wudu is weighed.\"",
      "chain": [
        "30367",
        "26012",
        "28326",
        "14262",
        "5152",
        "32"
      ]
    },
    {
      "hadith_no": "3181",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كريب، حدثنا رشدين بن سعد، عن عبد الرحمن بن زياد بن أنعم، عن عتبة بن حميد، عن عبادة بن نسى، عن عبد الرحمن بن غنم، عن معاذ بن جبل، أن النبي صلى الله عليه وسلم قرأ ‏(‏هل تستطيع ربك ‏)‏ قال هذا حديث غريب لا نعرفه إلا من حديث رشدين وليس إسناده بالقوي ‏.‏ ورشدين بن سعد وعبد الرحمن بن زياد بن أنعم الإفريقي يضعفان في الحديث ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     \"The Prophet (ﷺ) would recite: 'Hal Tastati'u Rabbak'\"",
      "chain": [
        "30216",
        "26012",
        "28326",
        "14262",
        "5152",
        "32"
      ]
    },
    {
      "hadith_no": "2526",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني عتبة بن حميد الضبي، عن يحيى بن أبي إسحاق الهنائي، قال سألت أنس بن مالك الرجل منا يقرض أخاه المال فيهدي له قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقرض أحدكم قرضا فأهدى له أو حمله على الدابة فلا يركبها ولا يقبله إلا أن يكون جرى بينه وبينه قبل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Yahya bin Abu Ishaq Al-Huna'i said:                     “I asked Anas bin Malik: 'What if a man gives his brother a loan, then (the borrower) give him a gift?’ The Messenger of Allah (ﷺ) said: ‘If anyone of you borrow something then he gives (the lender) a gift or  gives him a ride on his riding-beast, he should not accept the gift or the ride, unless they used to treat each other in that manner beforehand.'”",
      "chain": [
        "30288",
        "20736",
        "14262",
        "19138",
        "19"
      ]
    }
  ],
  "total_hadiths": 3
}