{
  "id": "14330",
  "name": "Kathir bin Ziyad كثير بن زياد",
  "full_name": "Kathir bin Ziyad كثير بن زياد",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra",
      "Bulkh"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]"
    ],
    "tags": [
      "al-'Atki",
      "al-Azdi",
      "Basri",
      "Bulkh"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "28447",
      "name": "'Amr bin 'Uthman bin Ya'la bin Marra عمرو بن عثمان بن يعلى بن مرة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11579",
      "name": "Tauba al-'Anbari al-Basri توبة العنبري البصري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20237",
      "name": "Salam bin Mskyn bin Rabi'ya سلام بن مسكين بن ربيعة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20715",
      "name": "'Abdullah bin Shwdhb عبد الله بن شوذب الخراساني أبو عبد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19877",
      "name": "'Ali bin Abd al-A'la علي بن عبد الأعلى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28664",
      "name": "Yonus bin Naf' al-Khrasany يونس بن نافع الخراساني أبو غانم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-311",
      "hadith_no": "311",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا زهير، حدثنا علي بن عبد الأعلى، عن أبي سهل، عن مسة، عن أم سلمة، قالت كانت النفساء على عهد رسول الله صلى الله عليه وسلم تقعد بعد نفاسها أربعين يوما أو أربعين ليلة وكنا نطلي على وجوهنا الورس يعني من الكلف ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The woman having bleeding after delivery (puerperal haemorrhage) would refrain (from prayer) for forty days or forty nights; and we would anoint our faces with an aromatic herb called wars to remove dark spots.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-312",
      "hadith_no": "312",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن يحيى، أخبرنا محمد بن حاتم، - يعني حبي - حدثنا عبد الله بن المبارك، عن يونس بن نافع، عن كثير بن زياد، قال حدثتني الأزدية، - يعني مسة - قالت حججت فدخلت على أم سلمة فقلت يا أم المؤمنين إن سمرة بن جندب يأمر النساء يقضين صلاة المحيض ‏.‏ فقالت لا يقضين كانت المرأة من نساء النبي صلى الله عليه وسلم تقعد في النفاس أربعين ليلة لا يأمرها النبي صلى الله عليه وسلم بقضاء صلاة النفاس ‏.‏ قال محمد يعني ابن حاتم واسمها مسة تكنى أم بسة ‏.‏ قال أبو داود كثير بن زياد كنيته أبو سهل ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAl-Azdiyyah, viz. Mussah, said:                      I performed Hajj and came to Umm Salamah and said (to her): Mother of the believers, Samurah b. Jundub commands women to complete the prayers abandoned during their menstrual period. She said: They should not do so. The wives of the Prophet (ﷺ) would refrain (from prayer) for forty nights (i.e. days) during the course of bleeding after child birth. The Prophet (ﷺ) would not command them to complete the prayers abandoned during the period of bleeding.Muhammad b. Hatim said: The name of Al-Azdiyyah is Mussah and her patronymic name is Umm Busrah.Abu Dawud said: The patronymic names of Kathir b. Ziyad s Abu Sahl.",
      "usc_msa_ref": "",
      "chain": [
        "34057",
        "30514",
        "20025",
        "28664",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-139",
      "hadith_no": "139",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد أبو بدر، عن علي بن عبد الأعلى، عن أبي سهل، عن مسة الأزدية، عن أم سلمة، قالت كانت النفساء تجلس على عهد رسول الله صلى الله عليه وسلم أربعين يوما فكنا نطلي وجوهنا بالورس من الكلف ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث أبي سهل عن مسة الأزدية عن أم سلمة ‏.‏ واسم أبي سهل كثير بن زياد ‏.‏ قال محمد بن إسماعيل علي بن عبد الأعلى ثقة وأبو سهل ثقة ‏.‏ ولم يعرف محمد هذا الحديث إلا من حديث أبي سهل ‏.‏ وقد أجمع أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم على أن النفساء تدع الصلاة أربعين يوما إلا أن ترى الطهر قبل ذلك فإنها تغتسل وتصلي ‏.‏ فإذا رأت الدم بعد الأربعين فإن أكثر أهل العلم قالوا لا تدع الصلاة بعد الأربعين وهو قول أكثر الفقهاء ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ ويروى عن الحسن البصري أنه قال إنها تدع الصلاة خمسين يوما إذا لم تر الطهر ‏.‏ ويروى عن عطاء بن أبي رباح والشعبي ستين يوما ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The time of waiting for Nifas during the time of AIlah's Messenger was forty days. We used to cover our faces with reddish-brown Wars.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20328",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-411",
      "hadith_no": "411",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا شبابة بن سوار، حدثنا عمر بن الرماح البلخي، عن كثير بن زياد، عن عمرو بن عثمان بن يعلى بن مرة، عن أبيه، عن جده، أنهم كانوا مع النبي صلى الله عليه وسلم في مسير فانتهوا إلى مضيق وحضرت الصلاة فمطروا السماء من فوقهم والبلة من أسفل منهم فأذن رسول الله صلى الله عليه وسلم وهو على راحلته وأقام - أو أقام - فتقدم على راحلته فصلى بهم يومئ إيماء يجعل السجود أخفض من الركوع ‏.‏ قال أبو عيسى هذا حديث غريب تفرد به عمر بن الرماح البلخي لا يعرف إلا من حديثه ‏.‏ وقد روى عنه غير واحد من أهل العلم ‏.‏ وكذلك روي عن أنس بن مالك أنه صلى في ماء وطين على دابته ‏.‏ والعمل على هذا عند أهل العلم وبه يقول أحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Uthman bin Ya'la bin Murrah narrated from his father, from his grand-father that :                     They were with the Prophet (S) on a journey. They wound up in a narrow area when Salat became due. Then it began raining from the sky above them, and it was wet beneath them. So Allah's Messenger (S) called the Adhan while he was on his mount, and then the Iqamah, going forward on his mount. He let them in Salat by making gestures, making his prostrations lower than his bowing.",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20426",
        "14330",
        "10581",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-692",
      "hadith_no": "692",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد، عن علي بن عبد الأعلى، عن أبي سهل، عن مسة الأزدية، عن أم سلمة، قالت كانت النفساء على عهد رسول الله  صلى الله عليه وسلم  تجلس أربعين يوما وكنا نطلي وجوهنا بالورس من الكلف ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"At the time of the Messenger of Allah, women in postnatal bleeding (after childbirth) used to wait for forty days, and we used to put Wars on our faces because of freckles.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20328",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    }
  ],
  "total_hadiths": 5
}