{
  "id": "14434",
  "name": "Yusuf bin Sa'd al-Jumahi يوسف بن سعد الجمحي",
  "full_name": "Yusuf bin Sa'd al-Jumahi يوسف بن سعد الجمحي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  س  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Jumah",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16570",
      "name": "'Abdullah bin Jbyr bin Hyh عبد الله بن جبير بن حيه الثقفي أخ",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "19335",
      "name": "Abu 'Ali al-Azdi أبو علي الأزدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24135",
      "name": "al-Rabi' bin Sbyh الربيع بن صبيح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20564",
      "name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3673",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، حدثنا القاسم بن الفضل الحداني، عن يوسف بن سعد، قال قام رجل إلى الحسن بن علي بعد ما بايع معاوية فقال سودت وجوه المؤمنين ‏.‏ أو يا مسود وجوه المؤمنين ‏.‏ فقال لا تؤنبني رحمك الله فإن النبي صلى الله عليه وسلم أري بني أمية على منبره فساءه ذلك فنزلت ‏:‏ ‏(‏ إنا أعطيناك الكوثر ‏)‏ يا محمد يعني نهرا في الجنة ونزلت ‏:‏ ‏(‏ إنا أنزلناه في ليلة القدر * وما أدراك ما ليلة القدر * ليلة القدر خير من ألف شهر ‏)‏ يملكها بعدك بنو أمية يا محمد ‏.‏ قال القاسم فعددناها فإذا هي ألف شهر لا يزيد يوم ولا ينقص ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث القاسم بن الفضل ‏.‏ وقد قيل عن القاسم بن الفضل عن يوسف بن مازن ‏.‏ والقاسم بن الفضل الحداني هو ثقة وثقه يحيى بن سعيد وعبد الرحمن بن مهدي ويوسف بن سعد رجل مجهول ولا نعرف هذا الحديث على هذا اللفظ إلا من هذا الوجه ‏.‏",
      "text_en": " Al-Qasim bin Al-Fadl Al-Huddani narrated from Yusuf bin Sa’d, who said:                     “A man stood up in front of Al-Hasan bin Ali, after he pledged to Mu’awiyah, so he said: ‘You have made fools of the believers.’ – or: ‘O you who has made fools of the believers’ – So he said: ‘Do not scold me so, may Allah have mercy upon you, for indeed the Prophet had a dream in which he saw Banu Umayyah upon his Minbar. That distressed him, so (the following) was revealed: Verily We have granted you Al-Kauthar (O Muhammad) meaning a river in Paradise, and (the following) was revealed: ‘Verily We have sent it down on the Night of Al-Qadr. And what will make you know what the Night of Al-Qadr is? The Night of Al-Qadr is better than a thousand months, in which Banu Umayyah rules after you O Muhammad.” Al-Qasim said: “So we counted them, and found that they were one-thousand months, not a day more nor less.”",
      "chain": [
        "30277",
        "20547",
        "20564",
        "14434"
      ]
    }
  ],
  "total_hadiths": 1
}