{
  "id": "14443",
  "name": "Abu Bakr bin al-Nadr bin Anas أبو بكر بن النضر",
  "full_name": "Abu Bakr bin al-Nadr bin Anas أبو بكر بن النضر",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ س  -  مستور ]"
    ],
    "tags": [
      "Ansar",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "5131",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا حماد بن مسعدة، وصفوان بن عيسى، ح وحدثنا أبو بكر بن النضر، حدثنا أبو عاصم النبيل، كلهم عن يزيد بن أبي عبيد، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Yazid b. Abu Ubaid.",
      "chain": [
        "30123",
        "20224",
        "20553",
        "14443",
        "20241"
      ]
    },
    {
      "hadith_no": "5148",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو بكر بن النضر، وعبد بن حميد، قال عبد أخبرني وقال أبو بكر، حدثنا  يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح بن كيسان، عن ابن شهاب، عن أبي، أمامة بن سهل عن ابن عباس، أنه أخبره أن خالد بن الوليد أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة بنت الحارث وهى خالته فقدم إلى رسول الله صلى الله عليه وسلم لحم ضب جاءت به أم حفيد بنت الحارث من نجد وكانت تحت رجل من بني جعفر وكان رسول الله صلى الله عليه وسلم لا يأكل شيئا حتى يعلم ما هو ‏.‏ ثم ذكر بمثل حديث يونس وزاد في آخر الحديث وحدثه ابن الأصم عن ميمونة وكان في حجرها ‏.‏",
      "text_en": " Khalid b. Walid reported that he visited Maimuna daughter of al-Harith with the Messenger of Allah (may peace be upon him), and she was the sister of his mother. She presented to Allah's Messenger (may peace be upon him) the flesh of a lizard which Umm Hufaid daughter of al-Harith had brought from Najd, and she had been married to a person belonging to Banu Ja'far. It was the habit of Allah's Messenger (may peace be upon him) not to eat anything until he knew what that was. The rest of the hadith is the same but with this (addition):                     \" Ibn al-Asamm narrated it from Maimuna and he was under her care.\"",
      "chain": [
        "14443",
        "30553",
        "20436",
        "20184",
        "20150",
        "11176",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "6302",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني زهير بن حرب، وأبو بكر بن النضر قالا حدثنا يعقوب بن إبراهيم، حدثنا  أبي، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وعبد الرحمن الأعرج، عن أبي هريرة، قال استب رجلان رجل من اليهود ورجل من المسلمين فقال المسلم والذي اصطفى محمدا صلى الله عليه وسلم على العالمين ‏.‏ وقال اليهودي والذي اصطفى موسى عليه السلام على العالمين ‏.‏ قال فرفع المسلم يده عند ذلك فلطم وجه اليهودي فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فأخبره بما كان من أمره وأمر المسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تخيروني على موسى فإن الناس يصعقون فأكون أول من يفيق فإذا موسى باطش بجانب العرش فلا أدري أكان فيمن صعق فأفاق قبلي أم كان ممن استثنى الله ‏\"‏ ‏.‏",
      "text_en": " Abu Fluraira reported that two persons, one from amongst the Jews and the other from amongst the Muslims, fell into dispute and began to abuse one another. The Muslim said:                      By Him Who chose Muhammad (may peace be upon him) in the worlds. And the Jew said: By Him Who chose Moses in the worlds. Thereupon the Muslim lifted his hand and slapped at the face of the Jew. The Jew went to Allah's Messenger (may peace be upon him) and told him about his affair and the affair of the Muslim. Thereupon Allah's Messenger (may peace be upon him) laid: Don't make me superior to Moses for mankind will swoon and I would be the 'first to recover from it and Moses would be at that time seizing the side of the Throne and I do not know (whether) he would swoon and would recover before me or Allah would make an exception for him.",
      "chain": [
        "30022",
        "14443",
        "20184",
        "20150",
        "11013",
        "10567",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6523",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا زهير بن حرب، وأبو بكر بن النضر قالا حدثنا هاشم بن القاسم، حدثنا  ورقاء بن عمر اليشكري، قال سمعت عبيد الله بن أبي يزيد، يحدث عن ابن عباس، أنوسلم أتى الخلاء فوضعت له وضوءا فلما خرج قال ‏\"‏ من وضع هذا ‏\"‏ ‏.‏ في رواية زهير قالوا ‏.‏ وفي رواية أبي بكر قلت ابن عباس ‏.‏ قال ‏\"‏ اللهم فقهه ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) came to privy and I placed for him water for ablution, When he came out he said:                      Who placed it here? And in a version of Zuhair they (the Companions) said, and in the version of Abu Bakr (the words are): I said: It is Ibn 'Abbas (who has done that), whereupon he (the Holy Prophet) said: May Allah grant him deep understanding of religion.",
      "chain": [
        "30022",
        "14443",
        "20390",
        "20363",
        "11258"
      ]
    },
    {
      "hadith_no": "972",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن شجاع المروذي، قال حدثنا أبو عبيدة، عن عبد الله بن عبيد، قال سمعت أبا بكر بن النضر، قال كنا بالطف عند أنس فصلى بهم الظهر فلما فرغ قال إني صليت مع رسول الله صلى الله عليه وسلم صلاة الظهر فقرأ لنا بهاتين السورتين في الركعتين ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ ‏.‏",
      "text_en": " Abu Bakr bin An-Nadr said:                     \"We were in At-Taff with Anas, and he led them in praying Zuhr. When he had finished, he said: 'I prayed Zuhr with the Messenger of Allah (ﷺ) and he recited two surahs for us in the two rak'ahs: \"Glorify the Name of your Lord, the Most High' and 'Has there come to you the narration of the over-whelming (i.e. The Day of Resurrection)?'\"",
      "chain": [
        "14443"
      ]
    }
  ],
  "total_hadiths": 5
}