{
  "id": "145",
  "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
  "full_name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "37",
      "date_gregorian": "658",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "Ally B.'Abdul Ashhal",
      "Badr",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "1834",
      "name": "al-Yaman bin Jabir ( اليمان بن جابر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1877",
      "name": "al-Rabab bint Ka'b bin 'Adi ( الرباب بنت كعب بن عدي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "1904",
      "name": "Safwan ibn al-Yaman ( صفوان بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1875",
      "name": "Fatima bint al-Yaman ( فاطمة بنت اليمان العبسية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1878",
      "name": "Khawla bint al-Yaman ( خولة بنت اليمان ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "15680",
      "name": "Abu 'Ubaida bin Hudhayfah Ibn al-Yaman أبو عبيدة بن حذيفة بن اليمان العبسي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15789",
      "name": "S'ad bin Hdhyfh bin al-Yman سعد بن حذيفة بن اليمان العبسي عداد",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "15680",
      "name": "Abu 'Ubaida bin Hudhayfah Ibn al-Yaman أبو عبيدة بن حذيفة بن اليمان العبسي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15789",
      "name": "S'ad bin Hdhyfh bin al-Yman سعد بن حذيفة بن اليمان العبسي عداد",
      "grade": "Follower(Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "224",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن الأعمش، عن أبي وائل، عن حذيفة، قال أتى النبي صلى الله عليه وسلم سباطة قوم فبال قائما، ثم دعا بماء، فجئته بماء فتوضأ‏.‏",
      "text_en": " Narrated Hudhaifa:                     Once the Prophet went to the dumps of some people and passed urine while standing. He then asked for water and so I brought it to him and he performed ablution.",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي وائل، عن حذيفة، قال رأيتني أنا والنبي، صلى الله عليه وسلم نتماشى، فأتى سباطة قوم خلف حائط، فقام كما يقوم أحدكم فبال، فانتبذت منه، فأشار إلى فجئته، فقمت عند عقبه حتى فرغ‏.‏",
      "text_en": " Narrated Hudhaifa':                     The Prophet and I walked till we reached the dumps of some people. He stood, as any one of you stands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him and stood near his back till he finished.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن أبي وائل، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا قام من الليل يشوص فاه بالسواك‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet got up at night, he used to clean his mouth with Siwak.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "525",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن الأعمش، قال حدثني شقيق، قال سمعت حذيفة، قال كنا جلوسا عند عمر  رضى الله عنه  فقال أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتنة قلت أنا، كما قاله‏.‏ قال إنك عليه  أو عليها  لجريء‏.‏ قلت ‏\"‏ فتنة الرجل في أهله وماله وولده وجاره تكفرها الصلاة والصوم والصدقة والأمر والنهى ‏\"‏‏.‏ قال ليس هذا أريد، ولكن الفتنة التي تموج كما يموج البحر‏.‏ قال ليس عليك منها بأس يا أمير المؤمنين، إن بينك وبينها بابا مغلقا‏.‏ قال أيكسر أم يفتح قال يكسر‏.‏ قال إذا لا يغلق أبدا‏.‏ قلنا أكان عمر يعلم الباب قال نعم، كما أن دون الغد الليلة، إني حدثته بحديث ليس بالأغاليط‏.‏ فهبنا أن نسأل حذيفة، فأمرنا مسروقا فسأله فقال الباب عمر‏.‏",
      "text_en": " Narrated Shaqiq:                     that he had heard Hudhaifa saying, \"Once I was sitting with `Umar and he said, 'Who amongst you remembers the statement of Allah's Apostle about the afflictions?' I said, 'I know it as the Prophet had said it.' `Umar said, 'No doubt you are bold.' I said, 'The afflictions caused for a man by his wife, money, children and neighbor are expiated by his prayers, fasting, charity and by enjoining (what is good) and forbidding (what is evil).' `Umar said, 'I did not mean that but I asked about that affliction which will spread like the waves of the sea.' I (Hudhaifa) said, 'O leader of the faithful believers! You need not be afraid of it as there is a closed door between you and it.' `Umar asked, Will the door be broken or opened?' I replied, 'It will be broken.' `Umar said, 'Then it will never be closed again.' I was asked whether `Umar knew that door. I replied that he knew it as one knows that there will be night before the tomorrow morning. I narrated a Hadith that was free from any misstatement\" The subnarrator added that they deputized Masruq to ask Hudhaifa (about the door). Hudhaifa said, \"The door was `Umar himself.\"",
      "chain": [
        "30175",
        "20031",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "889",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن منصور، وحصين، عن أبي وائل، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا قام من الليل يشوص فاه‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet (p.b.u.h) got up at night (for the night prayer), he used to clean his mouth .",
      "chain": [
        "28531",
        "20012",
        "11067",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا خالد بن عبد الله، عن حصين، عن أبي وائل، عن حذيفة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قام للتهجد من الليل يشوص فاه بالسواك‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.",
      "chain": [
        "30329",
        "20423",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1457",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي وائل، عن حذيفة  رضى الله عنه  قال قال عمر  رضى الله عنه  أيكم يحفظ حديث رسول الله صلى الله عليه وسلم عن الفتنة قال قلت أنا أحفظه كما قال‏.‏ قال إنك عليه لجريء فكيف قال قلت فتنة الرجل في أهله وولده وجاره تكفرها الصلاة والصدقة والمعروف‏.‏ قال سليمان قد كان يقول ‏\"‏ الصلاة والصدقة، والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليس هذه أريد، ولكني أريد التي تموج كموج البحر‏.‏ قال قلت ليس عليك بها يا أمير المؤمنين بأس، بينك وبينها باب مغلق‏.‏ قال فيكسر الباب أو يفتح‏.‏ قال قلت لا‏.‏ بل يكسر‏.‏ قال فإنه إذا كسر لم يغلق أبدا‏.‏ قال قلت أجل‏.‏ فهبنا أن نسأله من الباب فقلنا لمسروق سله‏.‏ قال فسأله‏.‏ فقال عمر  رضى الله عنه ‏.‏ قال قلنا فعلم عمر من تعني قال نعم، كما أن دون غد ليلة، وذلك أني حدثته حديثا ليس بالأغاليط‏.‏",
      "text_en": " Narrated Abu Wail:                     Hudhaifa said, \"`Umar said, 'Who amongst you remembers the statement of Allah's Apostle (p.b.u.h) about afflictions'?' I said, 'I know it as the Prophet had said it.' `Umar said, 'No doubt, you are bold. How did he say it?' I said, 'A man's afflictions (wrong deeds) concerning his wife, children and neighbors are expiated by (his) prayers, charity, and enjoining good.' (The sub-narrator Sulaiman added that he said, 'The prayer, charity, enjoining good and forbidding evil.') `Umar said, 'I did not mean that, but I ask about that affliction which will spread like the waves of the sea.' I said, 'O chief of the believers! You need not be afraid of it as there is a closed door between you and it.' He asked, 'Will the door be broken or opened?' I replied, 'No, it will be broken.' He said, 'Then, if it is broken, it will never be closed again?' I replied, 'Yes.' \" Then we were afraid to ask what that door was, so we asked Masruq to inquire, and he asked Hudhaifa regarding it. Hudhaifa said, \"The door was `Umar. \"We further asked Hudhaifa whether `Umar knew what that door meant. Hudhaifa replied in the affirmative and added, \"He knew it as one knows that there will be a night before the tomorrow morning.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا جامع، عن أبي وائل، عن حذيفة، قال قال عمر  رضى الله عنه  من يحفظ حديثا عن النبي صلى الله عليه وسلم في الفتنة قال حذيفة أنا سمعته يقول ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصيام والصدقة ‏\"‏‏.‏ قال ليس أسأل عن ذه، إنما أسأل عن التي تموج كما يموج البحر‏.‏ قال وإن دون ذلك بابا مغلقا‏.‏ قال فيفتح أو يكسر قال يكسر‏.‏ قال ذاك أجدر أن لا يغلق إلى يوم القيامة‏.‏ فقلنا لمسروق سله أكان عمر يعلم من الباب فسأله فقال نعم، كما يعلم أن دون غد الليلة‏.‏",
      "text_en": " Narrated Abu Wail from Hudhaifa:                     `Umar asked the people, \"Who remembers the narration of the Prophet about the affliction?\" Hudhaifa said, \"I heard the Prophet saying, 'The affliction of a person in his property, family and neighbors is expiated by his prayers, fasting, and giving in charity.\" `Umar said, \"I do not ask about that, but I ask about those afflictions which will spread like the waves of the sea.\" Hudhaifa replied, \"There is a closed gate in front of those afflictions.\" `Umar asked, \"Will that gate be opened or broken?\" He replied, \"It will be broken.\" `Umar said, \"Then the gate will not be closed again till the Day of Resurrection.\" We said to Masruq, \"Would you ask Hudhaifa whether `Umar knew what that gate symbolized?\" He asked him and he replied \"He (`Umar) knew it as one knows that there will be night before tomorrow, morning.",
      "chain": [
        "30026",
        "20005",
        "11327",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "2077",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، أن ربعي بن حراش، حدثه أن حذيفة  رضى الله عنه  حدثه قال قال النبي صلى الله عليه وسلم ‏\"‏ تلقت الملائكة روح رجل ممن كان قبلكم قالوا أعملت من الخير شيئا قال كنت آمر فتياني أن ينظروا ويتجاوزوا عن الموسر قال قال فتجاوزوا عنه ‏\"‏‏.‏ وقال أبو مالك عن ربعي ‏\"‏ كنت أيسر على الموسر وأنظر المعسر ‏\"‏‏.‏ وتابعه شعبة عن عبد الملك عن ربعي‏.‏ وقال أبو عوانة عن عبد الملك عن ربعي ‏\"‏ أنظر الموسر، وأتجاوز عن المعسر ‏\"‏‏.‏ وقال نعيم بن أبي هند عن ربعي ‏\"‏ فأقبل من الموسر، وأتجاوز عن المعسر ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"Before your time the angels received the soul of a man and asked him, 'Did you do any good deeds (in your life)?' He replied, 'I used to order my employees to grant time to the rich person to pay his debts at his convenience.' So Allah said to the angels; \"Excuse him.\" Rabi said that (the dead man said), 'I used to be easy to the rich and grant time to the poor.' Or, in another narration, 'grant time to the well-off and forgive the needy,' or, 'accept from the well-off and forgive the needy.'",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2391",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ مات رجل، فقيل له قال كنت أبايع الناس، فأتجوز عن الموسر، وأخفف عن المعسر، فغفر له ‏\"‏‏.‏ قال أبو مسعود سمعته من النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     I heard the Prophet saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your life time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and (used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I heard the same (Hadith) from the Prophet.\"",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2471",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سليمان بن حرب، عن شعبة، عن منصور، عن أبي وائل، عن حذيفة  رضى الله عنه  قال لقد رأيت رسول الله صلى الله عليه وسلم، أو قال لقد أتى النبي صلى الله عليه وسلم سباطة قوم فبال قائما‏.‏",
      "text_en": " Narrated Hudhaifa:                     I saw Allah's Apostle coming (or the Prophet came) to the dumps of some people and urinated there while standing .",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن حذيفة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ اكتبوا لي من تلفظ بالإسلام من الناس ‏\"‏‏.‏ فكتبنا له ألفا وخمسمائة رجل، فقلنا نخاف ونحن ألف وخمسمائة فلقد رأيتنا ابتلينا حتى إن الرجل ليصلي وحده وهو خائف‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said (to us), \" List the names of those people who have announced that they are Muslims.\" So, we listed one thousand and five hundred men. Then we wondered, \"Should we be afraid (of infidels) although we are one thousand and five hundred in number?\" No doubt, we witnessed ourselves being afflicted with such bad trials that one would have to offer the prayer alone in fear.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "3628",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة،‏.‏ حدثني بشر بن خالد، حدثنا محمد، عن شعبة، عن سليمان، سمعت أبا وائل، يحدث عن حذيفة، أن عمر بن الخطاب  رضى الله عنه  قال أيكم يحفظ قول رسول الله صلى الله عليه وسلم في الفتنة فقال حذيفة أنا أحفظ كما قال‏.‏ قال هات إنك لجريء‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فتنة الرجل في أهله وماله وجاره تكفرها الصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليست هذه، ولكن التي تموج كموج البحر‏.‏ قال يا أمير المؤمنين لا بأس عليك منها، إن بينك وبينها بابا مغلقا‏.‏ قال يفتح الباب أو يكسر قال لا بل يكسر‏.‏ قال ذاك أحرى أن لا يغلق‏.‏ قلنا علم الباب قال نعم، كما أن دون غد الليلة، إني حدثته حديثا ليس بالأغاليط‏.‏ فهبنا أن نسأله، وأمرنا مسروقا، فسأله فقال من الباب قال عمر‏.‏",
      "text_en": " Narrated Hudhaifa:                     Once `Umar bin Al-Khattab said, said, \"Who amongst you remembers the statement of Allah's Apostle regarding the afflictions?\" Hudhaifa replied, \"I remember what he said exactly.\" `Umar said. \"Tell (us), you are really a daring man!'' Hudhaifa said, \"Allah's Apostle said, 'A man's afflictions (i.e. wrong deeds) concerning his relation to his family, his property and his neighbors are expiated by his prayers, giving in charity and enjoining what is good and forbidding what is evil.' \" `Umar said, \"I don't mean these afflictions but the afflictions that will be heaving up and down like waves of the sea.\" Hudhaifa replied, \"O chief of the believers! You need not fear those (afflictions) as there is a closed door between you and them.\" `Umar asked, \"Will that door be opened or broken?\" Hudhaifa replied, \"No, it will be broken.\" `Umar said, \"Then it is very likely that the door will not be closed again.\" Later on the people asked Hudhaifa, \"Did `Umar know what that door meant?\" He said. \"Yes, `Umar knew it as everyone knows that there will be night before the tomorrow morning. I narrated to `Umar an authentic narration, not lies.\" We dared not ask Hudhaifa; therefore we requested Masruq who asked him, \"What does the door stand for?\" He said, \"`Umar.\"",
      "chain": [
        "30160",
        "20276",
        "30126",
        "20278",
        "20020",
        "11005",
        "11353",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "3649",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني بسر بن عبيد الله الحضرمي، قال حدثني أبو إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر مخافة أن يدركني‏.‏ فقلت يا رسول الله إنا كنا في جاهلية وشر، فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هديي تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة إلى أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا فقال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about good, but I used to ask him about evil for fear that it might overtake me. Once I said, \"O Allah's Apostle! We were in ignorance and in evil and Allah has bestowed upon us the present good; will there by any evil after this good?\" He said, \"Yes.\" I asked, \"Will there be good after that evil?\" He said, \"Yes, but it would be tained with Dakhan (i.e. Little evil).\" I asked, \"What will its Dakhan be?\" He said, \"There will be some people who will lead (people) according to principles other than my tradition. You will see their actions and disapprove of them.\" I said, \"Will there by any evil after that good?\" He said, \"Yes, there will be some people who will invite others to the doors of Hell, and whoever accepts their invitation to it will be thrown in it (by them).\" I said, \"O Allah's Apostle! Describe those people to us.\" He said, \"They will belong to us and speak our language\" I asked, \"What do you order me to do if such a thing should take place in my life?\" He said, \"Adhere to the group of Muslims and their Chief.\" I asked, \"If there is neither a group (of Muslims) nor a chief (what shall I do)?\" He said, \"Keep away from all those different sects, even if you had to bite (i.e. eat) the root of a tree, till you meet Allah while you are still in that state.\"",
      "chain": [
        "30221",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "3650",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني يحيى بن سعيد، عن إسماعيل، حدثني قيس، عن حذيفة  رضى الله عنه  قال تعلم أصحابي الخير وتعلمت الشر‏.‏",
      "text_en": " Narrated Hudhaifa:                     My companions learned (something about) good (through asking the Prophet) while I learned (something about) evil.",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "145"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن أبي إسحاق، عن صلة، عن حذيفة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لأهل نجران ‏\"‏ لأبعثن  يعني عليكم  يعني أمينا  حق أمين ‏\"‏‏.‏ فأشرف أصحابه، فبعث أبا عبيدة رضى الله عنه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said to the people of Nijran, \"I will send you the most trustworthy man.\" (Every one of) the companions of the Prophet was looking forward (to be that person). He then sent Abu 'Ubaida.",
      "chain": [
        "20285",
        "20020",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "3808",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن عبد الرحمن بن يزيد،، قال سألنا حذيفة عن رجل، قريب السمت والهدى من النبي صلى الله عليه وسلم حتى نأخذ عنه فقال ما أعرف أحدا أقرب سمتا وهديا ودلا بالنبي صلى الله عليه وسلم من ابن أم عبد‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     We asked Hudhaifa to tell us of a person resembling (to some extent) the Prophet in good appearance and straight forward behavior so that we may learn from him (good manners and acceptable conduct). Hudhaifa replied, \"I do not know anybody resembling the Prophet (to some extent) in appearance and conduct more than Ibn Um `Abd.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "20395",
        "145"
      ]
    },
    {
      "hadith_no": "4423",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عباس بن الحسين، حدثنا يحيى بن آدم، عن إسرائيل، عن أبي إسحاق، عن صلة بن زفر، عن حذيفة، قال جاء العاقب والسيد صاحبا نجران إلى رسول الله صلى الله عليه وسلم يريدان أن يلاعناه، قال فقال أحدهما لصاحبه لا تفعل، فوالله لئن كان نبيا فلاعنا، لا نفلح نحن ولا عقبنا من بعدنا‏.‏ قالا إنا نعطيك ما سألتنا، وابعث معنا رجلا أمينا، ولا تبعث معنا إلا أمينا‏.‏ فقال ‏\"‏ لأبعثن معكم رجلا أمينا حق أمين ‏\"‏‏.‏ فاستشرف له أصحاب رسول الله صلى الله عليه وسلم فقال ‏\"‏ قم يا أبا عبيدة بن الجراح ‏\"‏‏.‏ فلما قام قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا أمين هذه الأمة ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     Al-`Aqib and Saiyid, the rulers of Najran, came to Allah's Apostle with the intention of doing Lian one of them said to the other, \"Do not do (this Lian) for, by Allah, if he is a Prophet and we do this Lian, neither we, nor our offspring after us will be successful.\" Then both of them said (to the Prophet ), \"We will give what you should ask but you should send a trustworthy man with us, and do not send any person with us but an honest one.\" The Prophet said, \"I will send an honest man who Is really trustworthy.\" Then every one of the companions of Allah's Apostle wished to be that one. Then the Prophet said, \"Get up, O Abu 'Ubaida bin Al-Jarrah.\" When he got up, Allah's Apostle said, \"This is the Trustworthy man of this (Muslim) nation.\"",
      "chain": [
        "30141",
        "20364",
        "20311",
        "11049",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "4424",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت أبا إسحاق، عن صلة بن زفر، عن حذيفة  رضى الله عنه  قال جاء أهل نجران إلى النبي صلى الله عليه وسلم فقالوا ابعث لنا رجلا أمينا‏.‏ فقال ‏\"‏ لأبعثن إليكم رجلا أمينا حق أمين ‏\"‏‏.‏ فاستشرف له الناس، فبعث أبا عبيدة بن الجراح‏.‏",
      "text_en": " Narrated Hudhaifa:                     The people of Najran came to the Prophet and said, \"Send an honest man to us.\" The Prophet said, \"I will send to you an honest man who is really trustworthy.\" Everyone of the (Muslim) people hoped to be that one. The Prophet then sent Abu Ubaida bin Al-Jarrah.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11049",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "5038",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا موسى، حدثنا إبراهيم، حدثنا ابن شهاب، أن أنس بن مالك، حدثه أن حذيفة بن اليمان قدم على عثمان وكان يغازي أهل الشأم في فتح إرمينية وأذربيجان مع أهل العراق فأفزع حذيفة اختلافهم في القراءة فقال حذيفة لعثمان يا أمير المؤمنين أدرك هذه الأمة قبل أن يختلفوا في الكتاب اختلاف اليهود والنصارى فأرسل عثمان إلى حفصة أن أرسلي إلينا بالصحف ننسخها في المصاحف ثم نردها إليك فأرسلت بها حفصة إلى عثمان فأمر زيد بن ثابت وعبد الله بن الزبير وسعيد بن العاص وعبد الرحمن بن الحارث بن هشام فنسخوها في المصاحف وقال عثمان للرهط القرشيين الثلاثة إذا اختلفتم أنتم وزيد بن ثابت في شىء من القرآن فاكتبوه بلسان قريش فإنما نزل بلسانهم ففعلوا حتى إذا نسخوا الصحف في المصاحف رد عثمان الصحف إلى حفصة وأرسل إلى كل أفق بمصحف مما نسخوا وأمر بما سواه من القرآن في كل صحيفة أو مصحف أن يحرق‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Hudhaifa bin Al-Yaman came to `Uthman at the time when the people of Sham and the people of Iraq were Waging war to conquer Arminya and Adharbijan. Hudhaifa was afraid of their (the people of Sham and Iraq) differences in the recitation of the Qur'an, so he said to `Uthman, \"O chief of the Believers! Save this nation before they differ about the Book (Qur'an) as Jews and the Christians did before.\" So `Uthman sent a message to Hafsa saying, \"Send us the manuscripts of the Qur'an so that we may compile the Qur'anic materials in perfect copies and return the manuscripts to you.\" Hafsa sent it to `Uthman. `Uthman then ordered Zaid bin Thabit, `Abdullah bin AzZubair, Sa`id bin Al-As and `AbdurRahman bin Harith bin Hisham to rewrite the manuscripts in perfect copies. `Uthman said to the three Quraishi men, \"In case you disagree with Zaid bin Thabit on any point in the Qur'an, then write it in the dialect of Quraish, the Qur'an was revealed in their tongue.\" They did so, and when they had written many copies, `Uthman returned the original manuscripts to Hafsa. `Uthman sent to every Muslim province one copy of what they had copied, and ordered that all the other Qur'anic materials, whether written in fragmentary manuscripts or whole copies, be burnt. Sa`id bin Thabit added, \"A Verse from Surat Ahzab was missed by me when we copied the Qur'an and I used to hear Allah's Apostle reciting it. So we searched for it and found it with Khuza`ima bin Thabit Al-Ansari. (That Verse was): 'Among the Believers are men who have been true in their covenant with Allah.' (33.23)",
      "chain": [
        "20040",
        "20150",
        "11013",
        "19",
        "145"
      ]
    },
    {
      "hadith_no": "5898",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، عن حذيفة  رضى الله عنه  قال نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج، وأن نجلس عليه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
      "chain": [
        "5",
        "20298",
        "11272",
        "11254",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "6164",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسحاق بن إبراهيم، قال قلت لأبي أسامة حدثكم الأعمش، سمعت شقيقا، قال سمعت حذيفة، يقول إن أشبه الناس دلا وسمتا وهديا برسول الله صلى الله عليه وسلم لابن أم عبد، من حين يخرج من بيته إلى أن يرجع إليه، لا ندري ما يصنع في أهله إذا خلا‏.‏",
      "text_en": " Narrated Hudhaifa:                     From among the people, Ibn Um `Abd greatly resembled Allah's Apostles in solemn gate and good appearance of piety and in calmness and sobriety from the time he goes out of his house till he returns to it. But we do not know how he behaves with his family when he is alone with them.",
      "chain": [
        "30123",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "6385",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الملك، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ باسمك أموت وأحيا ‏\"‏‏.‏ وإذا قام قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet went to bed, he would say: \"Bismika amutu wa ahya.\" and when he got up he would say:\" Al-hamdu li l-lahil-ladhi ahyana ba'da ma amatana wa ilaihin-nushur.\"",
      "chain": [
        "20351",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6387",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده ثم يقول ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     When the Prophet went to bed at night, he would put his hand under his cheek and then say, \"Allahumma bismika amutu wa ahya,\" and when he got up, he would say, \"Al-Hamdu lil-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi an-nushur.\"",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6397",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أراد أن ينام قال ‏\"‏ باسمك اللهم أموت وأحيا ‏\"‏‏.‏ وإذا استيقظ من منامه قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا، وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet intended to go to bed, he would recite: \"Bismika Allahumma amutu wa ahya (With Your name, O Allah, I die and I live).\" And when he woke up from his sleep, he would say: \"Al-hamdu lil-lahil-ladhi ahyana ba'da ma amatana; wa ilaihi an-nushur (All the Praises are for Allah Who has made us alive after He made us die (sleep) and unto Him is the Resurrection). \"",
      "chain": [
        "20348",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6558",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن ربعي، عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كان رجل ممن كان قبلكم يسيء الظن بعمله، فقال لأهله إذا أنا مت فخذوني فذروني، في البحر في يوم صائف، ففعلوا به، فجمعه الله ثم قال ما حملك على الذي صنعت قال ما حملني إلا مخافتك‏.‏ فغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said, \"There was a man amongst the people who had suspicion as to the righteousness of his deeds. Therefore he said to his family, 'If I die, take me and burn my corpse and throw my ashes into the sea on a hot (or windy) day.' They did so, but Allah, collected his particles and asked (him), What made you do what you did?' He replied, 'The only thing that made me do it, was that I was afraid of You.' So Allah forgave him.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "6576",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا الأعمش، عن زيد بن وهب، حدثنا حذيفة، قال حدثنا رسول الله صلى الله عليه وسلم حديثين رأيت أحدهما وأنا أنتظر الآخر، حدثنا ‏\"‏ أن الأمانة نزلت في جذر قلوب الرجال، ثم علموا من القرآن، ثم علموا من السنة ‏\"‏‏.‏ وحدثنا عن رفعها قال ‏\"‏ ينام الرجل النومة فتقبض الأمانة من قلبه، فيظل أثرها مثل أثر الوكت، ثم ينام النومة فتقبض فيبقى أثرها مثل المجل، كجمر دحرجته على رجلك فنفط، فتراه منتبرا، وليس فيه شىء، فيصبح الناس يتبايعون فلا يكاد أحد يؤدي الأمانة، فيقال إن في بني فلان رجلا أمينا‏.‏ ويقال للرجل ما أعقله وما أظرفه وما أجلده‏.‏ وما في قلبه مثقال حبة خردل من إيمان، ولقد أتى على زمان وما أبالي أيكم بايعت لئن كان مسلما رده الإسلام، وإن كان نصرانيا رده على ساعيه، فأما اليوم فما كنت أبايع إلا فلانا وفلانا ‏\"‏‏.‏ قال الفربري قال أبو جعفر حدثت أبا عبد الله فقال سمعت أحمد بن عاصم يقول سمعت أبا عبيد يقول قال الأصمعي وأبو عمرو وغيرهما جذر قلوب الرجال الجذر الأصل من كل شىء، والوكت أثر الشىء اليسير منه، والمجل أثر العمل في الكف إذا غلظ‏.‏",
      "text_en": " Narrated Hudhaifa:                     Allah's Apostle narrated to us two narrations, one of which I have seen (happening) and I am waiting for the other. He narrated that honesty was preserved in the roots of the hearts of men (in the beginning) and then they learnt it (honesty) from the Qur'an, and then they learnt it from the (Prophet's) Sunna (tradition). He also told us about its disappearance, saying, \"A man will go to sleep whereupon honesty will be taken away from his heart, and only its trace will remain, resembling the traces of fire. He then will sleep whereupon the remainder of the honesty will also be taken away (from his heart) and its trace will resemble a blister which is raised over the surface of skin, when an ember touches one's foot; and in fact, this blister does not contain anything. So there will come a day when people will deal in business with each other but there will hardly be any trustworthy persons among them. Then it will be said that in such-and-such a tribe there is such-and-such person who is honest, and a man will be admired for his intelligence, good manners and strength, though indeed he will not have belief equal to a mustard seed in his heart.\" The narrator added: There came upon me a time when I did not mind dealing with anyone of you, for if he was a Muslim, his religion would prevent him from cheating; and if he was a Christian, his Muslim ruler would prevent him from cheating; but today I cannot deal except with so-and-so and so-and-so. (See Hadith No. 208, Vol. 9)",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "6684",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن حذيفة  رضى الله عنه  قال لقد خطبنا النبي صلى الله عليه وسلم خطبة، ما ترك فيها شيئا إلى قيام الساعة إلا ذكره، علمه من علمه، وجهله من جهله، إن كنت لأرى الشىء قد نسيت، فأعرف ما يعرف الرجل إذا غاب عنه فرآه فعرفه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet once delivered a speech in front of us wherein he left nothing but mentioned (about) everything that would happen till the Hour. Some of us stored that our minds and some forgot it. (After that speech) I used to see events taking place (which had been referred to in that speech) but I had forgotten them (before their occurrence). Then I would recognize such events as a man recognizes another man who has been absent and then sees and recognizes him.",
      "chain": [
        "20290",
        "20012",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7173",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير، وكنت أسأله عن الشر، مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير، فهل بعد هذا الخير من شر قال ‏\"‏ نعم ‏\"‏‏.‏ قلت وهل بعد ذلك الشر من خير قال ‏\"‏ نعم، وفيه دخن ‏\"‏‏.‏ قلت وما دخنه قال ‏\"‏ قوم يهدون بغير هدى، تعرف منهم وتنكر ‏\"‏‏.‏ قلت فهل بعد ذلك الخير من شر قال ‏\"‏ نعم، دعاة على أبواب جهنم، من أجابهم إليها قذفوه فيها ‏\"‏‏.‏ قلت يا رسول الله صفهم لنا‏.‏ قال ‏\"‏ هم من جلدتنا، ويتكلمون بألسنتنا ‏\"‏‏.‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏‏.‏ قلت فإن لم يكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها، ولو أن تعض بأصل شجرة، حتى يدركك الموت، وأنت على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa bin Al-Yaman:                     The people used to ask Allah's Apostle about the good but I used to ask him about the evil lest I should be overtaken by them. So I said, \"O Allah's Apostle! We were living in ignorance and in an (extremely) worst atmosphere, then Allah brought to us this good (i.e., Islam); will there be any evil after this good?\" He said, \"Yes.\" I said, 'Will there be any good after that evil?\" He replied, \"Yes, but it will be tainted (not pure.)'' I asked, \"What will be its taint?\" He replied, \"(There will be) some people who will guide others not according to my tradition? You will approve of some of their deeds and disapprove of some others.\" I asked, \"Will there be any evil after that good?\" He replied, \"Yes, (there will be) some people calling at the gates of the (Hell) Fire, and whoever will respond to their call, will be thrown by them into the (Hell) Fire.\" I said, \"O Allah s Apostle! Will you describe them to us?\" He said, \"They will be from our own people and will speak our language.\" I said, \"What do you order me to do if such a state should take place in my life?\" He said, \"Stick to the group of Muslims and their Imam (ruler).\" I said, \"If there is neither a group of Muslims nor an Imam (ruler)?\" He said, \"Then turn away from all those sects even if you were to bite (eat) the roots of a tree till death overtakes you while you are in that state.\"",
      "chain": [
        "30170",
        "20733",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "7175",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا الأعمش، عن زيد بن وهب، حدثنا حذيفة، قال حدثنا رسول الله صلى الله عليه وسلم حديثين رأيت أحدهما وأنا أنتظر الآخر حدثنا ‏\"‏ أن الأمانة نزلت في جذر قلوب الرجال، ثم علموا من القرآن، ثم علموا من السنة ‏\"‏‏.‏ وحدثنا عن رفعها قال ‏\"‏ ينام الرجل النومة فتقبض الأمانة من قلبه، فيظل أثرها مثل أثر الوكت، ثم ينام النومة فتقبض فيبقى فيها أثرها مثل أثر المجل، كجمر دحرجته على رجلك فنفط، فتراه منتبرا وليس فيه شىء، ويصبح الناس يتبايعون فلا يكاد أحد يؤدي الأمانة فيقال إن في بني فلان رجلا أمينا‏.‏ ويقال للرجل ما أعقله، وما أظرفه، وما أجلده، وما في قلبه مثقال حبة خردل من إيمان، ولقد أتى على زمان، ولا أبالي أيكم بايعت، لئن كان مسلما رده على الإسلام، وإن كان نصرانيا رده على ساعيه، وأما اليوم فما كنت أبايع إلا فلانا وفلانا ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     Allah's Apostle related to us, two prophetic narrations one of which I have seen fulfilled and I am waiting for the fulfillment of the other. The Prophet told us that the virtue of honesty descended in the roots of men's hearts (from Allah) and then they learned it from the Qur'an and then they learned it from the Sunna (the Prophet's traditions). The Prophet further told us how that honesty will be taken away: He said: \"Man will go to sleep during which honesty will be taken away from his heart and only its trace will remain in his heart like the trace of a dark spot; then man will go to sleep, during which honesty will decrease further still, so that its trace will resemble the trace of blister as when an ember is dropped on one's foot which would make it swell, and one would see it swollen but there would be nothing inside. People would be carrying out their trade but hardly will there be a trustworthy person. It will be said, 'in such-and-such tribe there is an honest man,' and later it will be said about some man, 'What a wise, polite and strong man he is!' Though he will not have faith equal even to a mustard seed in his heart.\" No doubt, there came upon me a time when I did not mind dealing (bargaining) with anyone of you, for if he was a Muslim his Islam would compel him to pay me what is due to me, and if he was a Christian, the Muslim official would compel him to pay me what is due to me, but today I do not deal except with such-and-such person.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "7185",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، سمعت حذيفة، يقول بينا نحن جلوس عند عمر قال أيكم يحفظ قول النبي صلى الله عليه وسلم في الفتنة‏.‏ قال ‏\"‏ فتنة الرجل في أهله وماله وولده وجاره، تكفرها الصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليس عن هذا أسألك، ولكن التي تموج كموج البحر‏.‏ قال ليس عليك منها بأس يا أمير المؤمنين، إن بينك وبينها بابا مغلقا‏.‏ قال عمر أيكسر الباب أم يفتح قال بل يكسر‏.‏ قال عمر إذا لا يغلق أبدا‏.‏ قلت أجل‏.‏ قلنا لحذيفة أكان عمر يعلم الباب قال نعم كما أعلم أن دون غد ليلة، وذلك أني حدثته حديثا ليس بالأغاليط‏.‏ فهبنا أن نسأله من الباب فأمرنا مسروقا فسأله فقال من الباب قال عمر‏.‏",
      "text_en": " Narrated Shaqiq:                     I heard Hudhaifa saying, \"While we were sitting with `Umar, he said, 'Who among you remembers the statement of the Prophet about the afflictions?' Hudhaifa said, \"The affliction of a man in his family, his property, his children and his neighbors are expiated by his prayers, Zakat (and alms) and enjoining good and forbidding evil.\" `Umar said, \"I do not ask you about these afflictions, but about those afflictions which will move like the waves of the sea.\" Hudhaifa said, \"Don't worry about it, O chief of the believers, for there is a closed door between you and them.\" `Umar said, \"Will that door be broken or opened?\" I said, \"No. it will be broken.\" `Umar said, \"Then it will never be closed,\" I said, \"Yes.\" We asked Hudhaifa, \"Did `Umar know what that door meant?\" He replied, \"Yes, as I know that there will be night before tomorrow morning, that is because I narrated to him a true narration free from errors.\" We dared not ask Hudhaifa as to whom the door represented so we ordered Masruq to ask him what does the door stand for? He replied, \"`Umar.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7198",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن واصل الأحدب، عن أبي وائل، عن حذيفة بن اليمان، قال إن المنافقين اليوم شر منهم على عهد النبي صلى الله عليه وسلم كانوا يومئذ يسرون واليوم يجهرون‏.‏",
      "text_en": " Narrated Abi Waih:                     Hudhaifa bin Al-Yaman said, 'The hypocrites of today are worse than those of the lifetime of the Prophet, because in those days they used to do evil deeds secretly but today they do such deeds openly.'",
      "chain": [
        "20404",
        "20020",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7199",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا خلاد، حدثنا مسعر، عن حبيب بن أبي ثابت، عن أبي الشعثاء، عن حذيفة، قال إنما كان النفاق على عهد النبي صلى الله عليه وسلم فأما اليوم فإنما هو الكفر بعد الإيمان‏.‏",
      "text_en": " Narrated Abi Asha'sha:                     Hudhaifa said, 'In fact, it was hypocrisy that existed in the lifetime of the Prophet but today it is Kufr (disbelief) after belief.'",
      "chain": [
        "20359",
        "11331",
        "11351",
        "145"
      ]
    },
    {
      "hadith_no": "7217",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبدان، أخبرني أبي، عن شعبة، عن عبد الملك، عن ربعي، عن حذيفة، عن النبي صلى الله عليه وسلم قال في الدجال ‏\"‏ إن معه ماء ونارا، فناره ماء بارد، وماؤه نار ‏\"‏‏.‏ قال أبو مسعود أنا سمعته من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said about Ad-Dajjal that he would have water and fire with him: (what would seem to be) fire, would be cold water and (what would seem to be) water, would be fire.",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7341",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن صلة، عن حذيفة، أن النبي صلى الله عليه وسلم قال لأهل نجران ‏\"‏ لأبعثن إليكم رجلا أمينا حق أمين ‏\"‏‏.‏ فاستشرف لها أصحاب النبي صلى الله عليه وسلم فبعث أبا عبيدة‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said to the people of Najran, \"I will send to you an honest person who is really trustworthy.\" The Companion, of the Prophet each desired to be that person, but the Prophet sent Abu 'Ubaida.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "7362",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال سألت الأعمش فقال عن زيد بن وهب، سمعت حذيفة، يقول حدثنا رسول الله صلى الله عليه وسلم ‏\"‏ أن الأمانة نزلت من السماء في جذر قلوب الرجال، ونزل القرآن فقرءوا القرآن وعلموا من السنة ‏\"‏‏.‏",
      "text_en": " Narrated Hudhaifa:                     Allah's Apostle said to us, \"Honesty descended from the Heavens and settled in the roots of the hearts of men (faithful believers), and then the Qur'an was revealed and the people read the Qur'an, (and learnt it from it) and also learnt it from the Sunna.\" Both Qur'an and Sunna strengthened their (the faithful believers') honesty. (See Hadith No. 208)",
      "chain": [
        "30026",
        "20005",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "7368",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن همام، عن حذيفة، قال يا معشر القراء استقيموا فقد سبقتم سبقا بعيدا فإن أخذتم يمينا وشمالا، لقد ضللتم ضلالا بعيدا‏.‏",
      "text_en": " Narrated Hammam:                     Hudhaifa said, \"O the Group of Al-Qurra! Follow the straight path, for then you have taken a great lead (and will be the leaders), but if you divert right or left, then you will go astray far away.\"",
      "chain": [
        "20348",
        "20012",
        "11060",
        "11051",
        "11447",
        "145"
      ]
    },
    {
      "hadith_no": "7483",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا أوى إلى فراشه قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏‏.‏ وإذا أصبح قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Juhaifa:                     When the Prophet went to bed, he used to say, \"Allhumma bismika ahya wa amut.\" And when he got Up in the mornings he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana wa ilaihi-nnushur.\"",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني شيبان بن فروخ، وعبد الله بن محمد بن أسماء الضبعي، قالا حدثنا مهدي، - وهو ابن ميمون - حدثنا واصل الأحدب، عن أبي وائل، عن حذيفة، أنه بلغه أن رجلا، ينم الحديث فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة نمام ‏\"‏ ‏.‏",
      "text_en": " It is reported from Hudhaifa that news reached him (the Holy Prophet) that a certain man carried tales. Upon this Hudhaifa remarked:                      I heard Allah's Messenger (may peace be upon him) saying: The tale-bearer shall not enter Paradise.",
      "chain": [
        "20656",
        "11307",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، ح وحدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن زيد بن وهب، عن حذيفة، قال حدثنا رسول الله صلى الله عليه وسلم حديثين قد رأيت أحدهما وأنا أنتظر الآخر حدثنا ‏\"‏ أن الأمانة نزلت في جذر قلوب الرجال ثم نزل القرآن فعلموا من القرآن وعلموا من السنة ‏\"‏ ‏.‏ ثم حدثنا عن رفع الأمانة قال ‏\"‏ ينام الرجل النومة فتقبض الأمانة من قلبه فيظل أثرها مثل الوكت ثم ينام النومة فتقبض الأمانة من قلبه فيظل أثرها مثل المجل كجمر دحرجته على رجلك فنفط فتراه منتبرا وليس فيه شىء - ثم أخذ حصى فدحرجه على رجله - فيصبح الناس يتبايعون لا يكاد أحد يؤدي الأمانة حتى يقال إن في بني فلان رجلا أمينا ‏.‏ حتى يقال للرجل ما أجلده ما أظرفه ما أعقله وما في قلبه مثقال حبة من خردل من إيمان ‏\"‏ ‏.‏ ولقد أتى على زمان وما أبالي أيكم بايعت لئن كان مسلما ليردنه على دينه ولئن كان نصرانيا أو يهوديا ليردنه على ساعيه وأما اليوم فما كنت لأبايع منكم إلا فلانا وفلانا ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) narrated to us two ahadith. I have seen one (crystallized into reality), and I am waiting for the other. He told us: Trustworthiness descended in the innermost (root) of the hearts of people. Then the Qur'an was revealed and they learnt from the Qur'an and they learnt from the Sunnah. Then he (the Holy Prophet) told us about the removal of trustworthiness. He said: The man would have a wink of sleep and trustworthiness would be taken away from his heart leaving the impression of a faint mark. He would again sleep and trustworthiness would be taken away from his heart leaving an impression of a blister, as if you rolled down an ember on your foot and it was vesicled. He would see a swelling having nothing in it. He (the Holy Prophet) then took up a pebble and rolled it down over his foot and (said): The people would enter into transactions amongst one another and hardly a person would be left who would return (things) entrusted to him. (And there would be so much paucity of honest persons) till it would be said: There in such a such tribe is a trustworthy man. And they would also say about a person: How prudent he is, how broad-minded he is and how intelligent he is, whereas in his heart there would not be faith even to the weight of a mustard seed. I have passed through a time in which I did not care with whom amongst you I entered into a transaction, for if he were a Muslim his faith would compel him to discharge his obligations to me and it he were a Christian or a Jew, the ruler would compel him to discharge his obligations to me. But today I would not enter into a transaction with you except so and so.",
      "chain": [
        "30201",
        "20354",
        "20032",
        "30216",
        "20354",
        "11060",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني سليمان بن حيان - عن سعد بن طارق، عن ربعي، عن حذيفة، قال كنا عند عمر فقال أيكم سمع رسول الله صلى الله عليه وسلم يذكر الفتن فقال قوم نحن سمعناه ‏.‏ فقال لعلكم تعنون فتنة الرجل في أهله وجاره قالوا أجل ‏.‏ قال تلك تكفرها الصلاة والصيام والصدقة ولكن أيكم سمع النبي صلى الله عليه وسلم يذكر الفتن التي تموج موج البحر قال حذيفة فأسكت القوم فقلت أنا ‏.‏ قال أنت لله أبوك ‏.‏ قال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تعرض الفتن على القلوب كالحصير عودا عودا فأى قلب أشربها نكت فيه نكتة سوداء وأى قلب أنكرها نكت فيه نكتة بيضاء حتى تصير على قلبين على أبيض مثل الصفا فلا تضره فتنة ما دامت السموات والأرض والآخر أسود مربادا كالكوز مجخيا لا يعرف معروفا ولا ينكر منكرا إلا ما أشرب من هواه ‏\"‏ ‏.‏ قال حذيفة وحدثته أن بينك وبينها بابا مغلقا يوشك أن يكسر ‏.‏ قال عمر أكسرا لا أبا لك فلو أنه فتح لعله كان يعاد ‏.‏ قلت لا بل يكسر ‏.‏ وحدثته أن ذلك الباب رجل يقتل أو يموت ‏.‏ حديثا ليس بالأغاليط ‏.‏ قال أبو خالد فقلت لسعد يا أبا مالك ما أسود مربادا قال شدة البياض في سواد ‏.‏ قال قلت فما الكوز مجخيا قال منكوسا ‏.‏",
      "text_en": " It is narrated on the authority of Hudhaifa:                      We were sitting in the company of Umar and he said: Who amongst you has heard the Messenger of Allah (may peace be upon him) talking about the turmoil? Some people said: It is we who heard it. Upon this be remarked: Perhaps by turmoil you presume the unrest of man in regard to his household or neighbour, they replied: Yes. He ('Umar) observed: Such (an unrest) would be done away with by prayer, fasting and charity. But who amongst you has heard from the Apostle (may peace be upon him) describing that turmoil which would come like the wave of the ocean. Hudhaifa said: The people hushed into silence, I replied: It is I. He ('Umar) said: Ye, well, your father was also very pious. Hudhaifa said: I heard the Messenger of Allah (may peace be, upon him ) observing: Temptations will be presented to men's hearts as reed mat is woven stick by stick and any heart which is impregnated by them will have a black mark put into it, but any heart which rejects them will have a white mark put in it. The result is that there will become two types of hearts: one white like a white stone which will not be harmed by any turmoil or temptation, so long as the heavens and the earth endure; and the other black and dust-coloured like a vessel which is upset, not recognizing what is good or rejecting what is abominable, but being impregnated with passion. Hudhaifa said: I narrated to him ('Umar): There is between you and that (turmoil) a closed door, but there is every likelihood of its being broken. 'Umar said: Would it be broken? You have, been rendered fatherless. Had it been opened, it would have been perhaps closed also. I said: No, it would be broken, and I narrated to him: Verily that door implies a person who would be killed or die. There is no mistake in this hadith. Abu Khalid narrated: I said to Sa'd, O Abu Malik, what do you mean by the term\" Aswad Murbadda\"? He replied: High degree of whiteness in blackness. I said: What is meant by\" Alkoozu Mujakhiyyan\"? He replied: A vessel turned upside down.",
      "chain": [
        "30212",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن المثنى، وعمرو بن علي، وعقبة بن مكرم العمي، قالوا حدثنا محمد بن أبي عدي، عن سليمان التيمي، عن نعيم بن أبي هند، عن ربعي بن حراش، عن حذيفة، أن عمر، قال من يحدثنا أو قال أيكم يحدثنا - وفيهم حذيفة - ما قال رسول الله صلى الله عليه وسلم في الفتنة قال حذيفة أنا ‏.‏ وساق الحديث كنحو حديث أبي مالك عن ربعي وقال في الحديث قال حذيفة حدثته حديثا ليس بالأغاليط وقال يعني أنه عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is transmitted by Rib'i b. Hirash. who narrated it on the authority of Hudhaifa that verily 'Umar said:                      Who would narrate to us or who amongst you would narrate to us (and Hudhaifa was one amongst them) what the Messenger of Allah (may peace be upon him) had said about the turmoil? Hudhaifa said: I will, and recited the hadith like that transmitted by Abu Malik on the authority of Rib'i and he observed in connection with this hadith that Hudhaifa remarked: I am narrating to you a hadith and it has no mistake, and said: That it is transmitted from he Messenger of Allah (may peace be upon him).",
      "chain": [
        "30170",
        "30153",
        "30441",
        "20276",
        "11289",
        "10973",
        "11334",
        "145",
        "3"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو كريب - واللفظ لأبي كريب - قالوا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن حذيفة، قال كنا مع رسول الله صلى الله عليه وسلم فقال ‏\"‏ أحصوا لي كم يلفظ الإسلام ‏\"‏ ‏.‏ قال فقلنا يا رسول الله صلى الله عليه وسلم أتخاف علينا ونحن ما بين الستمائة إلى السبعمائة قال ‏\"‏ إنكم لا تدرون لعلكم أن تبتلوا ‏\"‏ ‏.‏ قال فابتلينا حتى جعل الرجل منا لا يصلي إلا سرا ‏.‏",
      "text_en": " Hudhaifa reported:                      We were in the company of the Messenger of Allah (may peace be upon him) when he said. Count for me those who profess al-Islam. We said: Messenger of Allah, do you entertain any fear concerning us and we are (at this time) between six hundred and seven hundred (in strength). He (the Holy Prophet) remarked: You don't perceive; you may be put to some trial, He (the narrator) said: We actually suffered trial so much so that some of our men were constrained to offer their prayers in concealment.",
      "chain": [
        "30201",
        "30212",
        "20354",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن طريف بن خليفة البجلي، حدثنا محمد بن فضيل، حدثنا أبو مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وأبو مالك عن ربعي، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله تبارك وتعالى الناس فيقوم المؤمنون حتى تزلف لهم الجنة فيأتون آدم فيقولون يا أبانا استفتح لنا الجنة ‏.‏ فيقول وهل أخرجكم من الجنة إلا خطيئة أبيكم آدم لست بصاحب ذلك اذهبوا إلى ابني إبراهيم خليل الله - قال - فيقول إبراهيم لست بصاحب ذلك إنما كنت خليلا من وراء وراء اعمدوا إلى موسى صلى الله عليه وسلم الذي كلمه الله تكليما ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقول لست بصاحب ذلك اذهبوا إلى عيسى كلمة الله وروحه ‏.‏ فيقول عيسى صلى الله عليه وسلم لست بصاحب ذلك ‏.‏ فيأتون محمدا صلى الله عليه وسلم فيقوم فيؤذن له وترسل الأمانة والرحم فتقومان جنبتى الصراط يمينا وشمالا فيمر أولكم كالبرق ‏\"‏ ‏.‏ قال قلت بأبي أنت وأمي أى شىء كمر البرق قال ‏\"‏ ألم تروا إلى البرق كيف يمر ويرجع في طرفة ‎03:43 م ‎19/‎01/‎2003ين ثم كمر الريح ثم كمر الطير وشد الرجال تجري بهم أعمالهم ونبيكم قائم على الصراط يقول رب سلم سلم حتى تعجز أعمال العباد حتى يجيء الرجل فلا يستطيع السير إلا زحفا - قال - وفي حافتى الصراط كلاليب معلقة مأمورة بأخذ من أمرت به فمخدوش ناج ومكدوس في النار ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفا ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira and Hudhaifa that the Messenger of Allah (may peace be upon him) said:                      Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Mubammad (may peace be upon him). He would then be permitted (to open the door of Paradise). Trust worthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell.",
      "chain": [
        "30476",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا علي بن مسهر، عن سعد بن طارق، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن حوضي لأبعد من أيلة من عدن والذي نفسي بيده إني لأذود عنه الرجال كما يذود الرجل الإبل الغريبة عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله وتعرفنا قال ‏\"‏ نعم تردون على غرا محجلين من آثار الوضوء ليست لأحد غيركم ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allab, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).",
      "chain": [
        "30203",
        "20345",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، عن حصين، عن أبي وائل، عن حذيفة، قال كان رسول الله صلى الله عليه وسلم إذا قام ليتهجد يشوص فاه بالسواك ‏.‏",
      "text_en": " Huddaifa reported:                      Whenever the Messenger of Allah (may peace be upon him) got up for Tahajjud prayer, he cleansed his mouth with the tooth-stick.",
      "chain": [
        "30201",
        "20468",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، ح وحدثنا ابن نمير، حدثنا أبي وأبو معاوية عن الأعمش، كلاهما عن أبي وائل، عن حذيفة، قال كان رسول الله صلى الله عليه وسلم إذا قام من الليل ‏.‏ بمثله ولم يقولوا ليتهجد ‏.‏",
      "text_en": " This hadith is reported from Hudaifa by another chain of transmitters. Whenever he (the Holy Prophet) got up in the night, they (the transmitters) have not mentioned the words:                      for offering Tahajjud prayer.",
      "chain": [
        "30123",
        "20028",
        "11067",
        "30212",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا عبد الرحمن، حدثنا سفيان، عن منصور، وحصين، والأعمش، عن أبي وائل، عن حذيفة، أن رسول الله صلى الله عليه وسلم كان إذا قام من الليل يشوص فاه بالسواك ‏.‏",
      "text_en": " (493) Hudaifa reported:                      Whenever he (the Holy Prophet) got up for prayer during the night, he cleansed his mouth with the tooth-stick.",
      "chain": [
        "30170",
        "30160",
        "20033",
        "20012",
        "11067",
        "15097",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "273",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو خيثمة، عن الأعمش، عن شقيق، عن حذيفة، قال كنت مع النبي صلى الله عليه وسلم فانتهى إلى سباطة قوم فبال قائما فتنحيت فقال ‏\"‏ ادنه ‏\"‏ ‏.‏ فدنوت حتى قمت عند عقبيه فتوضأ فمسح على خفيه ‏.‏",
      "text_en": " Hudhaifa reported:                      I was with the Apostle of Allah (may peace be upon him) when he came to the dumping ground of filth belonging to a particular tribe. He urinated while standing, and I went aside. He (the Holy Prophet) asked me to come near him and I went so near to him that I stood behind his heels. He then performed ablution and wiped over his socks.",
      "chain": [
        "30399",
        "30022",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، عن مسعر، عن واصل، عن أبي وائل، عن حذيفة، أن رسول الله صلى الله عليه وسلم لقيه وهو جنب فحاد عنه فاغتسل ثم جاء فقال كنت جنبا ‏.‏ قال ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) happened to meet him and he was (sexually) defiled, and he slipped away and took a bath and then came and said: I was (sexually) defiled. Upon this he (the Holy Prophet) remarked: A Muslim is never defiled.",
      "chain": [
        "30201",
        "30216",
        "20032",
        "20359",
        "11401",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي مالك الأشجعي، عن ربعي، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فضلنا على الناس بثلاث جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض كلها مسجدا وجعلت تربتها لنا طهورا إذا لم نجد الماء ‏\"‏ ‏.‏ وذكر خصلة أخرى ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be npon him) said: We have been made to excel (other) people in three (things): Our rows have been made like the rows of the angels and the whole earth has been made a mosque for us, and its dust has been made a purifier for us in case water is not available. And he mentioned another characteristic too",
      "chain": [
        "30201",
        "20356",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1194",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said like this.",
      "chain": [
        "30216",
        "20366",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1850",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو معاوية ح وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن جرير، كلهم عن الأعمش، ح وحدثنا ابن، نمير - واللفظ له - حدثنا أبي، حدثنا الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع النبي صلى الله عليه وسلم ذات ليلة فافتتح البقرة فقلت يركع عند المائة ‏.‏ ثم مضى فقلت يصلي بها في ركعة فمضى فقلت يركع بها ‏.‏ ثم افتتح النساء فقرأها ثم افتتح آل عمران فقرأها يقرأ مترسلا إذا مر بآية فيها تسبيح سبح وإذا مر بسؤال سأل وإذا مر بتعوذ تعوذ ثم ركع فجعل يقول ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ فكان ركوعه نحوا من قيامه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قام طويلا قريبا مما ركع ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ فكان سجوده قريبا من قيامه ‏.‏ قال وفي حديث جرير من الزيادة فقال ‏\"‏ سمع الله لمن حمده ربنا لك الحمد\"‏ ‏.‏",
      "text_en": " 'Abdullah reported:                      I prayed with the Messenger of Allah (may peace be upon him) and he lengthened it till I entertained an evil thought. It was said to him what that thought was. He said: I thought that I should sit down and forsake him.",
      "chain": [
        "30201",
        "20331",
        "20354",
        "30022",
        "30123",
        "11060",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبي مالك، الأشجعي عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏ وفي رواية واصل المقضي بينهم ‏.‏",
      "text_en": " It is narrated by Abu Huraira and Huraira that the Messenger of Allah (may peace be upon him) said:                      It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2020",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، أخبرنا ابن أبي زائدة، عن سعد بن طارق، حدثني ربعي بن، حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هدينا إلى الجمعة وأضل الله عنها من كان قبلنا ‏\"‏ ‏.‏ فذكر بمعنى حديث ابن فضيل ‏.‏",
      "text_en": " Huraira reported Allah's Messenger (may peace be upon him) as saying:                      We were guided aright to Friday (as a day of prayer and meditation), but Allah diverted those who were before us from it. The rest of the hadith is the same.",
      "chain": [
        "30216",
        "20366",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير عن ربعي بن حراش، عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فدخل الجنة فقيل له ما كنت تعمل قال فإما ذكر وإما ذكر ‏.‏ فقال إني كنت أبايع الناس فكنت أنظر المعسر وأتجوز في السكة أو في النقد ‏.‏ فغفر له ‏\"‏ ‏.‏ فقال أبو مسعود وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A person died and he entered Paradise. It was said to him What (act) did you do? (Either he recalled it himself or he was made to recall), he said I used to enter into transactions with people and I gave respite to the insolvent and did not show any strictness in case of accepting a coin or demanding cash payment. (For these acts of his) he was granted pardon. Abu Mas'ud said: I heard this from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4079",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن سعد بن طارق، عن ربعي، بن حراش عن حذيفة، قال ‏\"‏ أتي الله بعبد من عباده آتاه الله مالا فقال له ماذا عملت في الدنيا - قال ولا يكتمون الله حديثا - قال يا رب آتيتني مالك فكنت أبايع الناس وكان من خلقي الجواز فكنت أتيسر على الموسر وأنظر المعسر ‏.‏ فقال الله أنا أحق بذا منك تجاوزوا عن عبدي ‏\"‏ ‏.‏ فقال عقبة بن عامر الجهني وأبو مسعود الأنصاري هكذا سمعناه من في رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported:                      A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba b. 'Amir al-Juhani and Abu Mas'ud said: This is what we heard from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30200",
        "20326",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الوليد بن جميع، حدثنا أبو الطفيل حدثنا حذيفة بن اليمان، قال ما منعني أن أشهد، بدرا إلا أني خرجت أنا وأبي - حسيل - قال فأخذنا كفار قريش قالوا إنكم تريدون محمدا فقلنا ما نريده ما نريد إلا المدينة ‏.‏ فأخذوا منا عهد الله وميثاقه لننصرفن إلى المدينة ولا نقاتل معه فأتينا رسول الله صلى الله عليه وسلم فأخبرناه الخبر فقال ‏\"‏ انصرفا نفي لهم بعهدهم ونستعين الله عليهم ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Hudbaifa b. al-Yaman who said:                      Nothing prevented me from being present at! he Battle of Badr except this incident. I came out with my father Husail (to participate in the Battle), but we were caught by the disbelievers of Quraish. They said: (Do) you intend to go to Muhammad? We said: We do not intend to go to him, but we wish to go (back) to Medina. So they took from us a covenant in the name of God that we would turn back to Medina and would not fight on the side of Muhammad (may peace be upon him). So, we came to the Messenger of Allah (may peace be upon him) and related the incident to him. He said: Both, of you proceed (to Medina) ; we will fulfil the covenant made with them and seek God's help against them.",
      "chain": [
        "30201",
        "20318",
        "3660",
        "145"
      ]
    },
    {
      "hadith_no": "4890",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن بن يزيد بن، جابر حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، يقول سمعت حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير وكنت أسأله عن الشر مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير فهل بعد هذا الخير شر قال ‏\"‏ نعم ‏\"‏ فقلت هل بعد ذلك الشر من خير قال ‏\"‏ نعم وفيه دخن ‏\"‏ ‏.‏ قلت وما دخنه قال ‏\"‏ قوم يستنون بغير سنتي ويهدون بغير هديي تعرف منهم وتنكر ‏\"‏ ‏.‏ فقلت هل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة على أبواب جهنم من أجابهم إليها قذفوه فيها ‏\"‏ ‏.‏ فقلت يا رسول الله صفهم لنا ‏.‏ قال ‏\"‏ نعم قوم من جلدتنا ويتكلمون بألسنتنا ‏\"‏ ‏.‏ قلت يا رسول الله فما ترى إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏ ‏.‏ فقلت فإن لم تكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها ولو أن تعض على أصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hudhaifa b. al-Yaman who said:                      People used to ask the Messenger of Allah (may peace be upon him) about the good times, but I used to ask him about bad times fearing lest they overtake me. I said: Messenger of Allah, we were in the midst of ignorance and evil, and then God brought us this good (time through Islam). Is there any bad time after this good one? He said: Yes. I asked: Will there be a good time again after that bad time? He said: Yes, but therein will be a hidden evil. I asked: What will be the evil hidden therein? He said: (That time will witness the rise of) the people who will adopt ways other than mine and seek guidance other than mine. You will know good points as well as bad points. I asked: Will there be a bad time after this good one? He said: Yes. (A time will come) when there will be people standing and inviting at the gates of Hell. Whoso responds to their call they will throw them into the fire. I said: Messenger of Allah, describe them for us. He said: All right. They will be a people having the same complexion as ours and speaking our language. I said: Messenger of Allah, what do you suggest if I happen to live in that time? He said: You should stick to the main body of the Muslims and their leader. I said: If they have no (such thing as the) main body and have no leader? He said: Separate yourself from all these factions, though you may have to eat the roots of trees (in a jungle) until death comes to you and you are in this state.",
      "chain": [
        "30170",
        "20733",
        "20395",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "4891",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن سهل بن عسكر التميمي، حدثنا يحيى بن حسان، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا يحيى، - وهو ابن حسان - حدثنا معاوية، - يعني ابن سلام - حدثنا زيد بن سلام، عن أبي سلام، قال قال حذيفة بن اليمان قلت يا رسول الله إنا كنا بشر فجاء الله بخير فنحن فيه فهل من وراء هذا الخير شر قال نعم ‏.‏ قلت هل وراء ذلك الشر خير قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت فهل وراء ذلك الخير شر قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت كيف قال ‏\"‏ يكون بعدي أئمة لا يهتدون بهداى ولا يستنون بسنتي وسيقوم فيهم رجال قلوبهم قلوب الشياطين في جثمان إنس ‏\"‏ ‏.‏ قال قلت كيف أصنع يا رسول الله إن أدركت ذلك قال ‏\"‏ تسمع وتطيع للأمير وإن ضرب ظهرك وأخذ مالك فاسمع وأطع ‏\"‏ ‏.‏",
      "text_en": " It his been narrated through a different chain of transmitters, on the authority of Hudhaifa b. al-Yaman who said:                      Messenger of Allah, no doubt, we had an evil time (i. e. the days of Jahiliyya or ignorance) and God brought us a good time (i. e. Islamic period) through which we are now living Will there be a bad time after this good time? He (the Holy Prophet) said: Yes. I said: Will there be a good time after this bad time? He said: Yes. I said: Will there be a bad time after good time? He said: Yes. I said: How? Whereupon he said: There will be leaders who will not be led by my guidance and who will not adopt my ways? There will be among them men who will have the hearts of devils in the bodies of human beings. I said: What should I do. Messenger of Allah, if I (happen) to live in that time? He replied: You will listen to the Amir and carry out his orders; even if your back is flogged and your wealth is snatched, you should listen and obey.",
      "chain": [
        "20300",
        "30025",
        "20300",
        "20401",
        "10912",
        "145"
      ]
    },
    {
      "hadith_no": "5378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن خيثمة، عن أبي حذيفة، عن حذيفة، قال كنا إذا حضرنا مع النبي صلى الله عليه وسلم طعاما لم نضع أيدينا حتى يبدأ رسول الله صلى الله عليه وسلم فيضع يده وإنا حضرنا معه مرة طعاما فجاءت جارية كأنها تدفع فذهبت لتضع يدها في الطعام فأخذ رسول الله صلى الله عليه وسلم بيدها ثم جاء أعرابي كأنما يدفع فأخذ بيده فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشيطان يستحل الطعام أن لا يذكر اسم الله عليه وإنه جاء بهذه الجارية ليستحل بها فأخذت بيدها فجاء بهذا الأعرابي ليستحل به فأخذت بيده والذي نفسي بيده إن يده في يدي مع يدها ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      When we attended a dinner along with the Messenger of Allah (may peace be upon him) we did not lay our hands on the food until Allah's Messenger (may peace be upon him) had laid his hand and commenced eating (the food). Once we went with him to a dinner when a girl came rushingly as it someone had been pursuing her. She was about to lay her hand on the food, when Allah's Messenger (may peace be upon him) caught her hand. Then a desert Arab came there (rushingly) as if someone had been pursuing him. He (the Holy Prophet) caught his hand; and then Allah's Messenger (may peace be upon him) said: Satan considers that food lawful on which Allah's name is not mentioned. He had brought this girl so that the food might be made lawful for him and I caught her hand. And he had brought a desert Arab so that (the food) might be lawful for him. So I caught his hand. By Him, in Whose hand is my life, it was (Satan's) hand that was in my hand along with her hand.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11332",
        "20290",
        "145"
      ]
    },
    {
      "hadith_no": "5379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، أخبرنا عيسى بن يونس، أخبرنا الأعمش، عن خيثمة بن عبد الرحمن، عن أبي حذيفة الأرحبي، عن حذيفة بن اليمان، قال كنا إذا دعينا مع رسول الله صلى الله عليه وسلم إلى طعام ‏.‏ فذكر بمعنى حديث أبي معاوية وقال ‏\"‏ كأنما يطرد ‏\"‏ ‏.‏ وفي الجارية ‏\"‏ كأنما تطرد ‏\"‏ ‏.‏ وقدم مجيء الأعرابي في حديثه قبل مجيء الجارية وزاد في آخر الحديث ثم ذكر اسم الله وأكل ‏.‏",
      "text_en": " Hudhaifa b. al-Yaman reported:                      When we were invited to a dinner with Allah's Messenger (may peace be upon him) ; the rest of hadith is the same but there is a slight variation of wording (and the variation is) that in that hadith the desert Arab precedes the arrival of that girl, and at the conclusion there is an addition (to this effect):\" He (the Holy Prophet) then mentioned the name of Allah and ate.\" This hadith is reported on the authority of A'mash with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30021",
        "20347",
        "11060",
        "11332",
        "145"
      ]
    },
    {
      "hadith_no": "5520",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، ح وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، كلاهما عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن حذيفة، عن النبي صلى الله عليه وسلم بمعنى حديث من ذكرنا ‏.‏",
      "text_en": " This hadith has been reported on the authority of Hudhaila with the same chain of transmitters.",
      "chain": [
        "30123",
        "20028",
        "11067",
        "30170",
        "20276",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "6121",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا ابن فضيل، كلاهما عن حصين، عن أبي وائل، عن حذيفة، عن النبي صلى الله عليه وسلم نحو حديث الأعمش ومغيرة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hudhaifa through another chain of transmitters.",
      "chain": [
        "30465",
        "30201",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "6407",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، قال سمعت أبا إسحاق، يحدث عن صلة بن زفر، عن حذيفة، قال جاء أهل نجران إلى رسول الله صلى الله عليه وسلم فقالوا يا رسول الله ابعث إلينا رجلا أمينا ‏.‏ فقال ‏\"‏ لأبعثن إليكم رجلا أمينا حق أمين حق أمين ‏\"‏ ‏.‏ قال فاستشرف لها الناس - قال - فبعث أبا عبيدة بن الجراح ‏.‏",
      "text_en": " Hudhaifa reported that the people of Najran came to Allah's Messenger (may peace be upon him) and said:                      Allah's Messenger, send along with us a man of trust; whereupon he said: I would definitely send to you a man of trust, a man of trust in the true sense of the term. Thereupon his Companions looked up eagerly and he sent Abu Ubaida b. Jarrah.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11049",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "7444",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن أبا إدريس الخولاني، كان يقول قال حذيفة بن اليمان والله إني لأعلم الناس بكل فتنة هي كائنة فيما بيني وبين الساعة وما بي إلا أن يكون رسول الله صلى الله عليه وسلم أسر إلى في ذلك شيئا لم يحدثه غيري ولكن رسول الله صلى الله عليه وسلم قال وهو يحدث مجلسا أنا فيه عن الفتن فقال رسول الله صلى الله عليه وسلم وهو يعد الفتن ‏\"‏ منهن ثلاث لا يكدن يذرن شيئا ومنهن فتن كرياح الصيف منها صغار ومنها كبار ‏\"‏ ‏.‏ قال حذيفة فذهب أولئك الرهط كلهم غيري ‏.‏",
      "text_en": " Hudhaifa b. al-Yaman reported:                      By Allah, I have the best knowledge amongst people about every turmoil which is going to appear in the period intervening me and the Last Hour; and it is not for the fact that Allah's Messenger (may peace be upon him) told me something confidentially pertaining to it and he did not tell anybody else about it, but it is because of the fact that I was present in the assembly in which he had been describing the turmoil. and he especially made a mention of three turmoils which would not spare anything and amongst these there would be turmoils like storms in the hot season. Some of them would be violent and some of them would be comparatively mild. Hudhaifa said: All (who were present) except I have gone (to the next world).",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "7445",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، وإسحاق بن إبراهيم، قال عثمان حدثنا وقال، إسحاق أخبرنا جرير، عن الأعمش، عن شقيق، عن حذيفة، قال قام فينا رسول الله صلى الله عليه وسلم مقاما ما ترك شيئا يكون في مقامه ذلك إلى قيام الساعة إلا حدث به حفظه من حفظه ونسيه من نسيه قد علمه أصحابي هؤلاء وإنه ليكون منه الشىء قد نسيته فأراه فأذكره كما يذكر الرجل وجه الرجل إذا غاب عنه ثم إذا رآه عرفه ‏.‏",
      "text_en": " Hudhaifa reported that Allah's Messenger (may peace be upon him) stood before us one day and he did not leave anything unsaid (that he had to say) at that very spot which would happen (in the shape of turmoil) up to the Last Hour. Those who had to remember them preserved them in their minds and those who could not remember them forgot them. My friends knew them and there are certain things which slip out of my mind, but I recapitulate them when anyone makes a mention of them just as a person is lost from one's mind but is recalled to him on seeing his face.",
      "chain": [
        "30203",
        "30123",
        "30203",
        "30312",
        "4057",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7447",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثني أبو بكر، بن نافع حدثنا غندر، حدثنا شعبة، عن عدي بن ثابت، عن عبد الله بن يزيد، عن حذيفة، أنه قال أخبرني رسول الله صلى الله عليه وسلم بما هو كائن إلى أن تقوم الساعة فما منه شىء إلا قد سألته إلا أني لم أسأله ما يخرج أهل المدينة من المدينة",
      "text_en": " Hudhaifa reported:                      Allah's Messenger (may peace be upon him) informed me of what is going to happen before the approach of the Last Hour. And there is nothing that I did not ask him in this connection except this that I did not ask him as to what would turn the people of Medina out from Medina.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "20523",
        "20278",
        "20020",
        "11372",
        "1945",
        "145"
      ]
    },
    {
      "hadith_no": "7450",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، ومحمد بن العلاء أبو كريب، جميعا عن أبي، معاوية قال ابن العلاء حدثنا أبو معاوية، حدثنا الأعمش، عن شقيق، عن حذيفة، قال كنا عند عمر فقال أيكم يحفظ حديث رسول الله صلى الله عليه وسلم في الفتنة كما قال قال فقلت أنا ‏.‏ قال إنك لجريء وكيف قال قال قلت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فتنة الرجل في أهله وماله ونفسه وولده وجاره يكفرها الصيام والصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏ ‏.‏ فقال عمر ليس هذا أريد إنما أريد التي تموج كموج البحر - قال - فقلت ما لك ولها يا أمير المؤمنين إن بينك وبينها بابا مغلقا قال أفيكسر الباب أم يفتح قال قلت لا بل يكسر ‏.‏ قال ذلك أحرى أن لا يغلق أبدا ‏.‏ قال فقلنا لحذيفة هل كان عمر يعلم من الباب قال نعم كما يعلم أن دون غد الليلة إني حدثته حديثا ليس بالأغاليط ‏.‏ قال فهبنا أن نسأل حذيفة من الباب فقلنا لمسروق سله فسأله فقال عمر ‏.‏",
      "text_en": " Hudhaifa repotted:                      We were one day in the company of 'Umar that he said: Who amongst you has preserved in his mind most perfectly the hadith of Allah's Messenger (may peace be upon him) in regard to the turmoil as he told about it? I said: It is I. Thereupon he said: You are bold (enough to make this claim). And he further said: How? I said: I heard Allah's Messenger (may peace be upon him) as saying: There would (first) be turmoil for a person in regard to his family, his property, his own self, his children, his neighbours (and the sins comnaitted in their connection) would be expiated by fasting, prayer, charity, enjoining good and prohibiting evil. Thereupon 'Umar said: I do not mean (that turmoil on a small scale) but that one which would eme-ge like the mounting waves of the ocean. I said: Commander of the Faithful, you have nothing to do with it, for the door is closed between you and that. He said: Would that door be broken or opened? I said: No, it would be broken. Thereupon he said: Then it would not be closed despite best efforts. We said to Hudhaifa: Did Umar know the door? Thereupon he said: Yes, he knew it (for certain) just as one knows that night precede the next day. And I narrated to him something in which there was nothing fabricated. Shaqiq (one of the narrators) said: We dared not ask Hudhaifa about that door. So we requested Masrdq to ask him. So he asked him and he said: (By that door, he meant) 'Umar.",
      "chain": [
        "30212",
        "30216",
        "20354",
        "20354",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7452",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن جامع بن أبي راشد، والأعمش، عن  أبي وائل، عن حذيفة، قال قال عمر من يحدثنا عن الفتنة، واقتص الحديث، بنحو حديثهم ‏.‏",
      "text_en": " Hudhaifa reported that Umar said:                      Who would narrate to us (the ahadith pertaining to turmoil) and he reported a badith similar to these ahadith.",
      "chain": [
        "30421",
        "20005",
        "11327",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7551",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، ومحمد بن العلاء، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الدجال أعور العين اليسرى جفال الشعر معه جنة ونار فناره جنة وجنته نار ‏\"‏ ‏.‏",
      "text_en": " Hudhalfa reported that Allah's Messenger (may peace be upon him) said:                      Dajjal is blind of left eye with thick hair and there would be a garden and fire with him and his fire would be a garden and his garden would be fire.",
      "chain": [
        "30212",
        "30216",
        "30123",
        "30312",
        "20354",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7552",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأنا أعلم بما مع الدجال منه معه نهران يجريان أحدهما رأى العين ماء أبيض والآخر رأى العين نار تأجج فإما أدركن أحد فليأت النهر الذي يراه نارا وليغمض ثم ليطأطئ رأسه فيشرب منه فإنه ماء بارد وإن الدجال ممسوح العين عليها ظفرة غليظة مكتوب بين عينيه كافر يقرؤه كل مؤمن كاتب وغير كاتب ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20472",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7553",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن ربعي بن، حراش عن حذيفة، عن النبي صلى الله عليه وسلم أنه قال في الدجال ‏\"‏ إن معه ماء ونارا فناره ماء بارد وماؤه نار فلا تهلكوا ‏\"‏ ‏.‏   قال أبو مسعود وأنا سمعته من، رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa reported Allah's Messenger (may peace be upon him) as saying:                      the Dajjal would have with him water and fire and his fire would bays the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30150",
        "20286",
        "20020",
        "30170",
        "20173",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "7557",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، - واللفظ لابن حجر قال إسحاق أخبرنا وقال ابن حجر، حدثنا جرير، عن المغيرة، عن نعيم بن أبي هند، عن ربعي، بن حراش قال اجتمع حذيفة وأبو مسعود فقال حذيفة ‏\"‏ لأنا بما مع الدجال أعلم منه إن معه نهرا من ماء ونهرا من نار فأما الذي ترون أنه نار ماء وأما الذي ترون أنه ماء نار فمن أدرك ذلك منكم فأراد الماء فليشرب من الذي يراه أنه نار فإنه سيجده ماء ‏\"‏ ‏.‏ قال أبو مسعود هكذا سمعت النبي صلى الله عليه وسلم يقول ‏.‏",
      "text_en": " Hudhaifa and Ibn Mas'ud met together. Hudhaifa said:                      I know more than you as to what there would be along with the Dajjal. There would be along with him two canals (one flowing with water) and the other one (having) fire (within it), and what you would see as fire would be water and what you would see as water would be fire. So he who amongst you is able to see that and is desirous of water should drink out of that which he sees as fire.",
      "chain": [
        "20387",
        "30021",
        "20028",
        "11072",
        "10973",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "23",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حفص بن عمر، ومسلم بن إبراهيم، قالا حدثنا شعبة، ح وحدثنا مسدد، حدثنا أبو عوانة، - وهذا لفظ حفص - عن سليمان، عن أبي وائل، عن حذيفة، قال أتى رسول الله صلى الله عليه وسلم سباطة قوم فبال قائما ثم دعا بماء فمسح على خفيه ‏.‏ قال أبو داود قال مسدد قال فذهبت أتباعد فدعاني حتى كنت عند عقبه ‏.‏",
      "text_en": " Narrated Hudhaifah :                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) came to a midden of some people and urinated while standing. He then asked for water and wiped his shoes.Abu Dawud said: Musaddad, a narrator, reported: I went far away from him. He then called me and I reached just near his heals.",
      "chain": [
        "30329",
        "20285",
        "20020",
        "30175",
        "20469",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "55",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن منصور، وحصين، عن أبي وائل، عن حذيفة، أن رسول الله صلى الله عليه وسلم كان إذا قام من الليل يشوص فاه بالسواك ‏.‏",
      "text_en": " Narrated Hudhaifah:                     When the Apostle of Allaah (sal Allaahu alayhi wa sallam) got up during the night (to pray), he cleansed his mouth with the tooth-stick.",
      "chain": [
        "28531",
        "20012",
        "11067",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مسعر، عن واصل، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم لقيه فأهوى إليه فقال إني جنب ‏.‏ فقال ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah reported :                      The prophet (ﷺ) visited him and inclined towards him (for shaking hand). He said : I am sexually defiled. The prophet (ﷺ) replied : A muslim is not defiled.",
      "chain": [
        "30175",
        "20031",
        "20359",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "871",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال قلت لسليمان أدعو في الصلاة إذا مررت بآية تخوف فحدثني عن سعد بن عبيدة عن مستورد عن صلة بن زفر عن حذيفة أنه صلى مع النبي صلى الله عليه وسلم فكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ وفي سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ وما مر بآية رحمة إلا وقف عندها فسأل ولا بآية عذاب إلا وقف عندها فتعوذ ‏.‏",
      "text_en": " Hudhaifah said that he prayed along with the Prophet (ﷺ), and that he said when bowing, “Glory be to my mighty Lord, “ and when he prostrated himself, “Glory be to my most high Lord,\" when he came to a verse which spoke of mercy, he stopped and made supplication, and when he came to a verse which spoke of punishment, he stopped and sought refuge in Allah.",
      "chain": [
        "30329",
        "20020",
        "11344",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "874",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وعلي بن الجعد، قالا حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، مولى الأنصار عن رجل، من بني عبس عن حذيفة، أنه رأى رسول الله صلى الله عليه وسلم يصلي من الليل فكان يقول ‏\"‏ الله أكبر - ثلاثا - ذو الملكوت والجبروت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم استفتح فقرأ البقرة ثم ركع فكان ركوعه نحوا من قيامه وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ ثم رفع رأسه من الركوع فكان قيامه نحوا من ركوعه يقول ‏\"‏ لربي الحمد ‏\"‏ ‏.‏ ثم سجد فكان سجوده نحوا من قيامه فكان يقول في سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ ثم رفع رأسه من السجود وكان يقعد فيما بين السجدتين نحوا من سجوده وكان يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ فصلى أربع ركعات فقرأ فيهن البقرة وآل عمران والنساء والمائدة أو الأنعام شك شعبة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     Hudhayfah saw the Messenger of Allah (ﷺ) praying at night. He said: Allah is most great\" three times, \"Possessor of kingdom, grandeur, greatness and majesty.\" He then began (his prayer) and recited Surah al-Baqarah; then he bowed and he paused in bowing as long as he stood up; he said while bowing, \"Glory be to my mighty Lord,\" \"Glory be to my mighty Lord\" ; then he raised his head, after bowing: then he stood up and he paused as long as he paused in bowing and said, \"Praise be to my Lord\" ; then he prostrated and paused in prostration as long as he paused in the standing position; he said while prostrating: \"Glory be to my most high Lord\"; then he raised his head after prostration, and sat as long as he prostrated, and said while sitting: \"O my Lord forgive me.\" He offered four rak'ahs of prayer and recited in them Surah al-Baqarah, Aal Imran, an-Nisa, al-Ma'idah, or al-An'am. The narrator Shu'bah doubted.",
      "chain": [
        "20296",
        "20386",
        "20020",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "hadith_no": "1319",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا يحيى بن زكريا، عن عكرمة بن عمار، عن محمد بن عبد الله الدؤلي، عن عبد العزيز بن أخي، حذيفة عن حذيفة، قال ‏:‏ كان النبي صلى الله عليه وسلم إذا حزبه أمر صلى ‏.‏",
      "text_en": " Hudhaifah said:                      When anything distressed the Prophet (ﷺ), he prayed.",
      "chain": [
        "31167",
        "10704",
        "145"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا جرير بن عبد الحميد الضبي، عن منصور بن المعتمر، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا الشهر حتى تروا الهلال أو تكملوا العدة ثم صوموا حتى تروا الهلال أو تكملوا العدة ‏\"‏ ‏.‏ قال أبو داود ورواه سفيان وغيره عن منصور عن ربعي عن رجل من أصحاب النبي صلى الله عليه وسلم لم يسم حذيفة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     The Prophet (ﷺ) said: Do not fast (for Ramadan) before the coming of the month until you sight the moon or complete the number (of thirty days); then fast until you sight the moon or complete the number (of thirty days).",
      "chain": [
        "30269",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "3766",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو معاوية، عن الأعمش، عن خيثمة، عن أبي حذيفة، عن حذيفة، قال كنا إذا حضرنا مع رسول الله صلى الله عليه وسلم طعاما لم يضع أحدنا يده حتى يبدأ رسول الله صلى الله عليه وسلم وإنا حضرنا معه طعاما فجاء أعرابي كأنما يدفع فذهب ليضع يده في الطعام فأخذ رسول الله صلى الله عليه وسلم بيده ثم جاءت جارية كأنما تدفع فذهبت لتضع يدها في الطعام فأخذ رسول الله صلى الله عليه وسلم بيدها وقال ‏\"‏ إن الشيطان ليستحل الطعام الذي لم يذكر اسم الله عليه وإنه جاء بهذا الأعرابي يستحل به فأخذت بيده وجاء بهذه الجارية يستحل بها فأخذت بيدها فوالذي نفسي بيده إن يده لفي يدي مع أيديهما ‏\"‏ ‏.‏",
      "text_en": " When we were at food with the Messenger of Allah(ﷺ) none of us put in his hand till the Messenger of Allah(ﷺ)put his hand first. Once we were at food with him. A nomad Arab came in as though he were being pushed, and he was about to put his hand in food when the Messenger of Allah (ﷺ) seized him by the hand. Then a girl came in as though she were being pushed, and she was about to put her hand in the food when the Messenger of Allah (ﷺ) seized her by the hand, and he said:                      The devil considers the food when Allah’s name is not mentioned over it, and he brought his nomad Arab that it might be lawful by means of him, so I seized his hand: then he brought this girl that it might be lawful by means of her, so I seized her hand. By Him in Whose hand my soul is, His hand is in my hand along with their hands.",
      "chain": [
        "30203",
        "20354",
        "11060",
        "11332",
        "20290",
        "145"
      ]
    },
    {
      "hadith_no": "4240",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي وائل، عن حذيفة، قال قام فينا رسول الله صلى الله عليه وسلم قائما فما ترك شيئا يكون في مقامه ذلك إلى قيام الساعة إلا حدثه حفظه من حفظه ونسيه من نسيه قد علمه أصحابه هؤلاء وإنه ليكون منه الشىء فأذكره كما يذكر الرجل وجه الرجل إذا غاب عنه ثم إذا رآه عرفه ‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Messenger of Allah (ﷺ) stood among us (to give us an address) and he left out nothing that would happen up to the last hour without telling of it. Some remembered it and some forgot,  and these Companions of his have known it. When something of it which I have forgotten happens, I remembered it, just as a man remembers another's face when he is a away and recognizes him when he sees him.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "4247",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، حدثنا أبو التياح، عن صخر بن بدر العجلي، عن سبيع بن خالد، بهذا الحديث عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فإن لم تجد يومئذ خليفة فاهرب حتى تموت فإن تمت وأنت عاض ‏\"‏ ‏.‏ وقال في آخره قال قلت فما يكون بعد ذلك قال ‏\"‏ لو أن رجلا نتج فرسا لم تنتج حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Hudhaifah through a different chain of narrators from the Prophet (ﷺ). This version says:                      He said: If you do not find a caliph in those days, then flee away until you die, even of you die holding on (to a stump of a tree). I asked: What will come next ? He replied: If a man wants the mare to bring forth a foal, it will not deliver in till the Last Hour comes.",
      "chain": [
        "30175",
        "20258",
        "11317",
        "14187",
        "145"
      ]
    },
    {
      "hadith_no": "4692",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمر بن محمد، عن عمر، مولى غفرة عن رجل، من الأنصار عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل أمة مجوس ومجوس هذه الأمة الذين يقولون لا قدر من مات منهم فلا تشهدوا جنازته ومن مرض منهم فلا تعودوهم وهم شيعة الدجال وحق على الله أن يلحقهم بالدجال ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah reported the Messenger of Allah (May peace be upon him) as saying :                      Every people have Magians, and the Magians of this community are those who declare that there is no destination by Allah. If any one of them dies, do not attend his funeral, and if any one of them is ill, do not pay a sick visit to him. They are the partisans of the Antichrist (Dajjal), and Allah will surely join with the Antichrist.",
      "chain": [
        "28531",
        "20012",
        "11530",
        "12391",
        "145"
      ]
    },
    {
      "hadith_no": "4826",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان، حدثنا قتادة، قال حدثني أبو مجلز، عن حذيفة، أن رسول الله صلى الله عليه وسلم لعن من جلس وسط الحلقة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     The Messenger of Allah (ﷺ) cursed the one who sat in the middle of a circle.",
      "chain": [
        "20040",
        "20577",
        "11019",
        "11313",
        "145"
      ]
    },
    {
      "hadith_no": "4871",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وأبو بكر بن أبي شيبة قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن همام، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah reported the Messenger of Allah (May peace be upon him) as saying :                      A mischief-maker will not enter paradise.",
      "chain": [
        "30175",
        "30201",
        "20354",
        "11060",
        "11051",
        "11447",
        "145"
      ]
    },
    {
      "hadith_no": "4947",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، قال قال نبيكم صلى الله عليه وسلم ‏\"‏ كل معروف صدقة ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah said :                      Your prophet (May peace be upon him) said : Every good act is a SADAQAH (almsgiving).",
      "chain": [
        "28531",
        "20012",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4980",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، عن منصور، عن عبد الله بن يسار، عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا ما شاء الله وشاء فلان ولكن قولوا ما شاء الله ثم شاء فلان ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhayfah:                     The Prophet (ﷺ) said: Do not say: \"What Allah wills and so and so wills,\" but say: \"What Allah wills and afterwards so and so wills.",
      "chain": [
        "20296",
        "20020",
        "11067",
        "15313",
        "145"
      ]
    },
    {
      "hadith_no": "5049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن ربعي، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا نام قال ‏\"‏ اللهم باسمك أحيا وأموت ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah said :                      when the prophet (May peace be upon him) lay down on his bed (at night), he would say: O Allah! In Thy name I die and live. When he awoke, he said: praise be to Allah who has given us life after causing us to die and to whom we shall be resurrected.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "13",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن الأعمش، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم أتى سباطة قوم فبال عليها قائما فأتيته بوضوء فذهبت لأتأخر عنه فدعاني حتى كنت عند عقبيه فتوضأ ومسح على خفيه ‏.‏ قال أبو عيسى وسمعت الجارود يقول سمعت وكيعا يحدث بهذا الحديث عن الأعمش ‏.‏ ثم قال وكيع هذا أصح حديث روي عن النبي صلى الله عليه وسلم في المسح ‏.‏ وسمعت أبا عمار الحسين بن حريث يقول سمعت وكيعا فذكر نحوه ‏.‏ قال أبو عيسى وهكذا روى منصور وعبيدة الضبي عن أبي وائل عن حذيفة مثل رواية الأعمش ‏.‏ وروى حماد بن أبي سليمان وعاصم بن بهدلة عن أبي وائل عن المغيرة بن شعبة عن النبي صلى الله عليه وسلم وحديث أبي وائل عن حذيفة أصح ‏.‏ وقد رخص قوم من أهل العلم في البول قائما ‏.‏ قال أبو عيسى وعبيدة بن عمرو السلماني روى عنه إبراهيم النخعي ‏.‏ وعبيدة من كبار التابعين يروى عن عبيدة أنه قال أسلمت قبل وفاة النبي صلى الله عليه وسلم بسنتين ‏.‏ وعبيدة الضبي صاحب إبراهيم هو عبيدة بن معتب الضبي ويكنى أبا عبد الكريم ‏.‏",
      "text_en": " Hudhaifah narrated:                     \"Allah's Messenger came to a waste area used by people, so he urinated on it while standing. I brought him the (water for) Wudu. Then I left to be away from him, but he called me until I was behind him. So he performed Wudu and wiped (Masaba) over his Khuff.\"",
      "chain": [
        "30480",
        "20032",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن الأعمش، قال سمعت سعد بن عبيدة، يحدث عن المستورد، عن صلة بن زفر، عن حذيفة، أنه صلى مع النبي صلى الله عليه وسلم فكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ وفي سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ وما أتى على آية رحمة إلا وقف وسأل وما أتى على آية عذاب إلا وقف وتعوذ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah narrated that :                     he performed Salat with the Prophet, and that while he was bowing he would say: (Subhana Rabbiyal Azim); \"Glorious is my Lord the Magnificent\" and while prostrating: (Subhana Rabbiyal A'la) 'Glorious is my Lord the Most High.' And he would not recite an Ayah mentioning mercy, except that he would stop and ask (for mercy), and he would not recite an Ayah mentioning punishment, except that he would stop and seek refuge (with Allah from it).",
      "chain": [
        "30277",
        "30002",
        "20020",
        "11060",
        "11344",
        "2904",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال وحدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن شعبة، نحوه ‏.‏ وقد روي عن حذيفة، هذا الحديث من غير هذا الوجه أنه صلى بالليل مع النبي صلى الله عليه وسلم فذكر الحديث ‏.‏",
      "text_en": " (Another similar narration) This Hadith has been narrated from Hudhaifah :                     from another route: \"That he performed Salat during the night with the Prophet\" and he mentioned the Hadith.",
      "chain": [
        "30160",
        "20033",
        "20020",
        "145"
      ]
    },
    {
      "hadith_no": "986",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد القدوس بن بكر بن خنيس، حدثنا حبيب بن سليم العبسي، عن بلال بن يحيى العبسي، عن حذيفة بن اليمان، قال إذا مت فلا تؤذنوا بي أحدا إني أخاف أن يكون نعيا فإني سمعت رسول الله صلى الله عليه وسلم ينهى عن النعى ‏.‏ هذا حديث حسن ‏.‏",
      "text_en": " Bilal bin Yahya Al-Absiy narrated that:                     Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"",
      "chain": [
        "30242",
        "25171",
        "25047",
        "19863",
        "145"
      ]
    },
    {
      "hadith_no": "1783",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن مسلم بن نذير، عن حذيفة، قال أخذ رسول الله صلى الله عليه وسلم بعضلة ساقي أو ساقه فقال ‏\"‏ هذا موضع الإزار فإن أبيت فأسفل فإن أبيت فلا حق للإزار في الكعبين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ رواه الثوري وشعبة عن أبي إسحاق ‏.‏",
      "text_en": " Narrated Hudhaifa:                     \"The Messenger of Allah (ﷺ) took hold of the calf of my shin - or his shin - and he said: \"This is the place of the Izar, if you must lower it, then the Izar has no right to be on the ankles.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Ath-Thawri and Shu'bah reported it from Abu Ishaq.",
      "chain": [
        "30367",
        "20327",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "2138",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو هشام الرفاعي، محمد بن يزيد حدثنا محمد بن فضيل، عن الوليد بن عبد الله بن جميع، عن أبي الطفيل، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا إمعة تقولون إن أحسن الناس أحسنا وإن ظلموا ظلمنا ولكن وطنوا أنفسكم إن أحسن الناس أن تحسنوا وإن أساءوا فلا تظلموا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Hudhaifah narrated that the Messenger of Allah said:                     \"Do not let yourselves be 'yes-men', saying: 'If the people are good then we will be good, and if they are wrong then we will be wrong.'Rather, make up your own minds, if the people are good then you are good, and if they are evil, then do not behave unjustly.\"",
      "chain": [
        "30478",
        "20356",
        "10659",
        "3660",
        "145"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عبد الله الأنصاري، عن حذيفة بن اليمان، عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لتأمرن بالمعروف ولتنهون عن المنكر أو ليوشكن الله أن يبعث عليكم عقابا منه ثم تدعونه فلا يستجاب لكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Hudhaifah bint Al-Yaman narrated that the Prophet (s.a.w) said:                     \"By the One in Whose Hand is my soul! Either you command good and forbid evil, or Allah will soon send upon you a punishment from Him, then you will call upon Him, but He will not respond to you. \"",
      "chain": [
        "30367",
        "20167",
        "11209",
        "145"
      ]
    },
    {
      "hadith_no": "2170",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عبد الله، وهو ابن عبد الرحمن الأنصاري الأشهلي عن حذيفة بن اليمان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لا تقوم الساعة حتى تقتلوا إمامكم وتجتلدوا بأسيافكم ويرث دنياكم شراركم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " Hudhaifah bint Al-Yaman narrated that the Messenger of Allah (s.a.w) said:                     \"By the One in Whose Hand is my soul! The Hour will not be established until you fight your A'immah, and you strike each other with your swords, and your world will be inherited by the evilest among you.\"",
      "chain": [
        "30367",
        "20167",
        "11209",
        "18",
        "28446",
        "145"
      ]
    },
    {
      "hadith_no": "2179",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن زيد بن وهب، عن حذيفة بن اليمان، حدثنا رسول الله صلى الله عليه وسلم حديثين قد رأيت أحدهما وأنا أنتظر الآخر حدثنا ‏\"‏ أن الأمانة نزلت في جذر قلوب الرجال ثم نزل القرآن فعلموا من القرآن وعلموا من السنة ‏\"‏ ‏.‏ ثم حدثنا عن رفع الأمانة فقال ‏\"‏ ينام الرجل النومة فتقبض الأمانة من قلبه فيظل أثرها مثل الوكت ثم ينام نومة فتقبض الأمانة من قلبه فيظل أثرها مثل المجل كجمر دحرجته على رجلك فنفطت فتراه منتبرا وليس فيه شيء ‏\"‏ ‏.‏ ثم أخذ حصاة فدحرجها على رجله قال ‏\"‏ فيصبح الناس يتبايعون لا يكاد أحدهم يؤدي الأمانة حتى يقال إن في بني فلان رجلا أمينا وحتى يقال للرجل ما أجلده وأظرفه وأعقله وما في قلبه مثقال حبة من خردل من إيمان ‏\"‏ ‏.‏ قال ولقد أتى على زمان وما أبالي أيكم بايعت فيه لئن كان مسلما ليردنه على دينه ولئن كان يهوديا أو نصرانيا ليردنه على ساعيه فأما اليوم فما كنت لأبايع منكم إلا فلانا وفلانا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah [bin Al-Yaman] said:                     \"The Messenger of Allah {s.a.w} narrated two narrations to us, one of which I have seen {happening} and I am waiting for the other. He narrated that (in the beginning) trust was preserved in the roots of the hearts of men, then the Qur'an was revealed, and they learned it from the Qur'an, and then they learned it from the Sunnah. Then he narrated to us about the disappearance of trust, saying, 'A man will go to sleep whereupon trust will be taken away from his heart, and only its trace will remain, like speckles. He then will sleep, whereupon the remainder of the trust will also be taken away and trace will remain like a blister, like an ember that you roll on your feet, it causes pain and you see it swollen while it contains nothing.' Then he took a pebble and rolled it over his leg. He said: 'So there will come a day when people will deal in business with each other, but there will hardly be any trustworthy persons among them, such that it would be said that in such and such a tribe, there is such and such person, who is honest, and until a man will be admired for his strength, intelligence, and good manners, although indeed he will not have faith equal to a mustard seed in his heart.\"' He(Hudhaifah) added:  \"There came upon me a time when I did not mind dealing with anyone of you, for if he was a Muslim, his religion would prevent him from cheating me, and if was a Jew or a Christian, his Muslim ruler would prevent him from cheating me; but today I cannot deal except with so-and-so and s0-and-so.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "2209",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، ح قال وحدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، عن عبد الله، وهو ابن عبد الرحمن الأنصاري الأشهلي عن حذيفة بن اليمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يكون أسعد الناس بالدنيا لكع ابن لكع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث عمرو بن أبي عمرو ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman narrated that the Messenger of Allah(s.a.w) said:                     \"The Hour will not be established until the happiest of people in the world is Luka' bin Luka'.\"",
      "chain": [
        "30367",
        "20167",
        "11209",
        "20387",
        "20155",
        "11209",
        "16",
        "28446",
        "145"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن علي بن زيد، عن الحسن، عن جندب، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينبغي للمؤمن أن يذل نفسه ‏\"‏ ‏.‏ قالوا وكيف يذل نفسه ‏.‏ قال ‏\"‏ يتعرض من البلاء لما لا يطيق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " It was narrated from Hudhaifah, that the Messenger of Allah(s.a.w) said:                     \"It is not for the believer to humiliate himself.\" They said: \"How does he humiliate himself?\" He said: \"By taking on a trial which he can not bear.\"",
      "chain": [
        "30160",
        "20267",
        "20021",
        "10664",
        "11016",
        "4053",
        "145"
      ]
    },
    {
      "hadith_no": "2258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن الأعمش، وحماد، وعاصم بن بهدلة، سمعوا أبا وائل، عن حذيفة، قال قال عمر أيكم يحفظ ما قال رسول الله صلى الله عليه وسلم في الفتنة فقال حذيفة أنا ‏.‏ قال حذيفة فتنة الرجل في أهله وماله وولده وجاره يكفرها الصلاة والصوم والصدقة والأمر بالمعروف والنهى عن المنكر ‏.‏ فقال عمر لست عن هذا أسألك ولكن عن الفتنة التي تموج كموج البحر قال يا أمير المؤمنين إن بينك وبينها بابا مغلقا ‏.‏ قال عمر أيفتح أم يكسر قال بل يكسر ‏.‏ قال إذا لا يغلق إلى يوم القيامة ‏.‏ قال أبو وائل في حديث حماد فقلت لمسروق سل حذيفة عن الباب فسأله فقال عمر ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " Abu Wa'il narrated from Hudhaifah that 'Umar said:                     \"Which of you remembers what the Messenger of Allah(s.a.w) said about the Fitnah?\" So Hudhaifah said: \"I do.\" Hudhaifah said: \"A man's Fitnah is in his family, his wealth, his children, and his neighbors. It is atoned for by the Salat, fasting, charity, and by commanding good and forbidding evil.\" 'Umar said: \"I am not asking you about this. Rather, about the Fitnah that spreads like the waves of the sea.\" He said: \"O Commander of the Believers! Between you and it is a closed door.\" 'Umar said: \"Will it be opened or broken?\" He said: \"It will be broken.\" He said: \"Then it will never be closed until the Day of Judgement.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11060",
        "20022",
        "11358",
        "145"
      ]
    },
    {
      "hadith_no": "3398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، رضى الله عنهما أن النبي صلى الله عليه وسلم كان إذا أراد أن ينام وضع يده تحت رأسه ثم قال ‏\"‏ اللهم قني عذابك يوم تجمع عبادك أو تبعث عبادك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman [may Allah be pleased with him] narrated that:                     When the Prophet would sleep, he would put his hand under his head then say: “O Allah, safeguard me from Your Punishment the Day You gather [Your slaves] (Allahumma Qini Adhabaka Yawma Tajma’u [Ibadak])” or “You resurrect Your slaves (Tab’athu Ibadak).”",
      "chain": [
        "30421",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن عبد الملك بن عمير، عن ربعي، عن حذيفة بن اليمان، رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا أراد أن ينام قال ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيا نفسي بعد ما أماتها وإليه النشور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Al-Yaman [may Allah be pleased with him] narrated that when the Prophet wanted to sleep, he would say:                     “O Allah, in Your Name I dies and I live (Allahumma Bismika Amutu Wa Ahya).” And when he would wake, he would say: “Allah praise is due to Allah who revived my soul after causing its death and to Him is the resurrection (Al-Hamdulillah, Alladhi Ahya Nafsi Ba’da Ma Amataha Wa Ilaihin-Nushur).”",
      "chain": [
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن الصباح البزار، حدثنا سفيان بن عيينة، عن زائدة، عن عبد الملك بن عمير، عن ربعي، هو ابن حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتدوا باللذين من بعدي أبي بكر وعمر ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that the Messenger of Allah (ﷺ) said: \"Stick to the two after me, Abu Bakr and 'Umar.\"",
      "chain": [
        "30244",
        "20005",
        "20320",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا وكيع، عن سالم أبي العلاء المرادي، عن عمرو بن هرم، عن ربعي بن حراش، عن حذيفة، رضى الله عنه قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ إني لا أدري ما بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " Narrated Hudhaifah [may Allah be pleased with him]:                     \"We were sitting with the Prophet (ﷺ) and he said: 'I do not know how long I will be with you, so stick to the two after me,' and he signaled towards Abu Bakr and 'Umar.\"",
      "chain": [
        "30254",
        "20032",
        "10708",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، وإسحاق بن منصور، قالا أخبرنا محمد بن يوسف، عن إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن زر بن حبيش، عن حذيفة، قال سألتني أمي متى عهدك - تعني - بالنبي صلى الله عليه وسلم ‏.‏ فقلت ما لي به عهد منذ كذا وكذا ‏.‏ فنالت مني فقلت لها دعيني آتي النبي صلى الله عليه وسلم فأصلي معه المغرب وأسأله أن يستغفر لي ولك ‏.‏ فأتيت النبي صلى الله عليه وسلم فصليت معه المغرب فصلى حتى صلى العشاء ثم انفتل فتبعته فسمع صوتي فقال ‏\"‏ من هذا حذيفة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ما حاجتك غفر الله لك ولأمك ‏\"‏ ‏.‏ قال ‏\"‏ إن هذا ملك لم ينزل الأرض قط قبل هذه الليلة استأذن ربه أن يسلم على ويبشرني بأن فاطمة سيدة نساء أهل الجنة وأن الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث إسرائيل ‏.‏",
      "text_en": " Narrated Hudhaifah :                     \"My mother asked me: 'When is your planned time - meaning with the Prophet (ﷺ)?' So I said: 'I have not had a planned time to see him since such and such time.' She rebuked me, so I said to her: 'Let me go to the Prophet (ﷺ) so that I may perform Maghrib (prayer) with him, and ask him to seek forgiveness for you and I.' So I came to the Prophet (ﷺ), and I prayed Maghrib with him, then he prayed until he prayed Al-'Isha. Then he turned, and I followed him, and he heard my voice, and said: 'Who is this? Hudhaifah?' I said: 'Yes.' He said: \"What is your need, may Allah forgive you and your mother?' He said: 'Indeed, this is an angel that never descended to the earth ever before tonight. He sought permission from his Lord to greet me with peace and to give me the glad tidings that Fatimah is the chief of the women of Paradise, and that Al-Hasan and Al-Husain are the chiefs of the youths of the people of Paradise.'\"",
      "chain": [
        "30025",
        "30313",
        "30388",
        "20311",
        "25322",
        "11656",
        "11337",
        "145"
      ]
    },
    {
      "hadith_no": "4165",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن أبي إسحاق، عن صلة بن زفر، عن حذيفة بن اليمان، قال جاء العاقب والسيد إلى النبي صلى الله عليه وسلم فقالا ابعث معنا أمينا ‏.‏ فقال ‏\"‏ فإني سأبعث معكم أمينا حق أمين ‏\"‏ ‏.‏ فأشرف لها الناس فبعث أبا عبيدة بن الجراح رضى الله عنه ‏.‏ قال وكان أبو إسحاق إذا حدث بهذا الحديث عن صلة قال سمعته منذ ستين سنة ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روي عن عمر وأنس رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل أمة أمين وأمين هذه الأمة أبو عبيدة بن الجراح ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhaifah bin Al-Yaman:                     that Al-'Aqib and As-Sayyid (two of the leaders of the Christians of Najran) came to the Prophet (ﷺ) and said: \"Send us your trustworthy one.\" He said: \"I shall send with you a trustworthy one who is truly a trustworthy one.\" So the people desired that, and he sent Abu 'Ubaidah, may Allah be pleased with him.",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11049",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن هلال، مولى ربعي عن ربعي بن حراش، عن حذيفة، قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏\"‏ إني لا أدري ما قدر بقائي فيكم فاقتدوا باللذين من بعدي وأشار إلى أبي بكر وعمر واهتدوا بهدى عمار وما حدثكم ابن مسعود فصدقوه ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏ وروى إبراهيم بن سعد هذا الحديث عن سفيان الثوري عن عبد الملك بن عمير عن هلال مولى ربعي عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقد روى سالم المرادي كوفي عن عمرو بن هرم عن ربعي بن حراش عن حذيفة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4182",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسحاق بن عيسى، عن شريك، عن أبي اليقظان، عن زاذان، عن حذيفة، قال قالوا يا رسول الله لو استخلفت ‏.‏ قال ‏\"‏ إن استخلفت عليكم فعصيتموه عذبتم ولكن ما حدثكم حذيفة فصدقوه وما أقرأكم عبد الله فاقرءوه ‏\"‏ ‏.‏ قال عبد الله فقلت لإسحاق بن عيسى يقولون هذا عن أبي وائل ‏.‏ قال لا عن زاذان إن شاء الله ‏.‏ قال هذا حديث حسن وهو حديث شريك ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that they said: \"O Messenger of Allah, if you were to appoint someone as a successor.\" He said: \"If I were to appoint a successor over you, and you were to disobey him, you would be punished. But whatever Hudhaifah narrates to you, then believe him, and whatever 'Abdullah teaches you to recite, then recite it.\"",
      "chain": [
        "30025",
        "20587",
        "10911",
        "145"
      ]
    },
    {
      "hadith_no": "2",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، وقتيبة بن سعيد، عن جرير، عن منصور، عن أبي وائل، عن حذيفة، قال كان رسول الله صلى الله عليه وسلم إذا قام من الليل يشوص فاه بالسواك ‏.‏",
      "text_en": " It was narrated that Huthaifah said:                      \"When the Messenger of Allah (ﷺ) got up at night, he would brush his mouth with the Siwak.\"",
      "chain": [
        "30123",
        "30367",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "18",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، قال أنبأنا الأعمش، عن شقيق، عن حذيفة، قال كنت أمشي مع رسول الله صلى الله عليه وسلم فانتهى إلى سباطة قوم فبال قائما فتنحيت عنه فدعاني وكنت عند عقبيه حتى فرغ ثم توضأ ومسح على خفيه ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      \"I was walking with the Messenger of Allah (ﷺ) and he came to some people's garbage dump and urinated while standing up. I turned to go away, but he called me back (to conceal him), and I was just behind him. Then when he had finished, he performed Wudu' and wiped over his Khuffs.\"",
      "chain": [
        "30123",
        "20347",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا مؤمل بن هشام، قال أنبأنا إسماعيل، قال أخبرنا شعبة، عن سليمان، عن أبي وائل، عن حذيفة، أن رسول الله صلى الله عليه وسلم أتى سباطة قوم فبال قائما ‏.‏",
      "text_en": " It was narrated from Hudhifah that the Messenger of Allah (ﷺ)came to some people's garbage dump and urinated while standing.",
      "chain": [
        "30180",
        "20208",
        "20020",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "27",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال أنبأنا محمد، قال أنبأنا شعبة، عن منصور، قال سمعت أبا وائل، أن حذيفة، قال إن رسول الله صلى الله عليه وسلم أتى سباطة قوم فبال قائما ‏.‏",
      "text_en": " It was narrated that Mansur said:                      \"I heard Abu Wa'il (say) that Hudhaifah said: 'The Messenger of Allah (ﷺ) came to some people's garbage dump and urinated while standing.'\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن عبيد الله، قال أنبأنا بهز، قال أنبأنا شعبة، عن سليمان، ومنصور، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم مشى إلى سباطة قوم فبال قائما ‏.‏ قال سليمان في حديثه ومسح على خفيه ولم يذكر منصور المسح ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Prophet (ﷺ) went to some people's garbage dump and urinated while standing. In his narration, Sulaiman bin 'Ubaidullah said:                      \"And he wiped over his Khuffs,\" but Mansur did not mention the wiping. [1][1]Meaning, in this route, since Shu'bah narrated it from both Sulaiman and Mansur.",
      "chain": [
        "38252",
        "20214",
        "20020",
        "11060",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "269",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن الشيباني، عن أبي بردة، عن حذيفة، قال كان رسول الله صلى الله عليه وسلم إذا لقي الرجل من أصحابه ماسحه ودعا له - قال - فرأيته يوما بكرة فحدت عنه ثم أتيته حين ارتفع النهار فقال ‏\"‏ إني رأيتك فحدت عني ‏\"‏ ‏.‏ فقلت إني كنت جنبا فخشيت أن تمسني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Huthaifah said:                      \"When the Messenger of Allah (ﷺ) met a man from among his Companions, he would shake hands with him and supplicate for him. I saw him one day in the early morning, and I tried to avoid him, then I came to him later in the day. He said: 'I saw you but you were avoiding me.' I said: 'I was Junub and I was afraid that you would touch me.' The Messenger of Allah (ﷺ) said: 'The Muslim is not made impure (Najis).'\"",
      "chain": [
        "30123",
        "20028",
        "11352",
        "11901",
        "145"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أخبرنا يحيى، قال حدثنا مسعر، قال حدثني واصل، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم لقيه وهو جنب ‏.‏ فأهوى إلى فقلت إني جنب فقال ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Huthaifah that the Prophet (ﷺ) met him when he was Junub:                      \"And he came close to me and reached out his hand. I said: 'I am Junub.' He said: 'The Muslim is not made impure (Najis).'\"",
      "chain": [
        "30313",
        "30020",
        "20359",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1008",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، وعبد الرحمن، وابن أبي عدي، عن شعبة، عن سليمان، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أنه صلى إلى جنب النبي صلى الله عليه وسلم ليلة فقرأ فكان إذا مر بآية عذاب وقف وتعوذ وإذا مر بآية رحمة وقف فدعا وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ وفي سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed beside the Prophet (ﷺ) one night. He recited, and when he came to a verse that mentioned punishment, he would pause and seek refuge with Allah; if he came to a verse that mentioned mercy, he would pause for mercy. In his bowing he would say: 'Subhana Rabbil-Azim (Glory be to my Lord Almighty)' and in his prostration he would say: 'Subhan Rabbil-A'la (Glory be to my Lord the Most High).'\"",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20276",
        "20020",
        "11005",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1009",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن آدم، عن حفص بن غياث، عن العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، والأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي صلى الله عليه وسلم قرأ البقرة وآل عمران والنساء في ركعة لا يمر بآية رحمة إلا سأل ولا بآية عذاب إلا استجار ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Prophet (ﷺ) recited Surat Al-Baqarah, Al 'Imran and An-Nisa' in one rak'ah, and he did not reach any verse that spoke of mercy but he asked Allah for it, nor any verse that spoke of punishment but he asked Allah for protection therefrom.",
      "chain": [
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1046",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو معاوية، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع رسول الله صلى الله عليه وسلم فركع فقال في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ وفي سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I prayed with the Messenger of Allah (ﷺ), and he bowed and said when bowing: 'Subhana Rabbial-azim (Glory be to my Lord Almighty).' And when prostrating: 'Subhana Rabbial-'Ala (Glory be to my Lord Most High).'\"",
      "chain": [
        "30123",
        "20354",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1069",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا يزيد بن زريع، قال حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، عن رجل، من بني عبس عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم ذات ليلة فسمعه حين كبر قال ‏\"‏ الله أكبر ذا الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ وإذا رفع رأسه من الركوع قال ‏\"‏ لربي الحمد لربي الحمد ‏\"‏ ‏.‏ وفي سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ وبين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ وكان قيامه وركوعه ‏.‏ وإذا رفع رأسه من الركوع وسجوده وما بين السجدتين قريبا من السواء ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed with the Messenger of Allah (ﷺ) one night and he heard him say when he said the takbir: \"Allahu Akbara dhal-jabaruti wal-malakuti wal-kibriya'i wal-'azamah (Allah is Most Great, the One Who has all power, sovereignty, magnificence and might.)\" When bowing he would say: \"Subhana Rabbial-'Azim (Glory be to my Lord Almighty).\" When he raised his head from bowing he would say: \"Lirabbil-hamd, Lirabbil-hamd (To my Lord be praise, to my Lord be praise).\" And when he prostrated (he said): \"Subhana Rabbial-A'la (Glory be to my Lord Most High).\" And between the two prostrations (he said): \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me).\" His standing, his bowing, when he raised his head from bowing, his prostration and the time between the two prostrations, were almost the same.",
      "chain": [
        "30430",
        "20304",
        "20020",
        "11381",
        "20458",
        "145"
      ]
    },
    {
      "hadith_no": "1133",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع رسول الله صلى الله عليه وسلم ذات ليلة فاستفتح بسورة البقرة فقرأ بمائة آية لم يركع فمضى قلت يختمها في الركعتين فمضى قلت يختمها ثم يركع فمضى حتى قرأ سورة النساء ثم قرأ سورة آل عمران ثم ركع نحوا من قيامه يقول في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ربنا لك الحمد ‏\"‏ ‏.‏ وأطال القيام ثم سجد فأطال السجود يقول في سجوده ‏\"‏ سبحان ربي الأعلى سبحان ربي الأعلى سبحان ربي الأعلى ‏\"‏ ‏.‏ لا يمر بآية تخويف أو تعظيم لله عز وجل إلا ذكره ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I prayed with the Messenger of Allah (ﷺ) one night. He started reciting Surat Al-Baqarah and he recited one hundred verses, then did not bow, rather he continued. I thought: 'He will complete it in two rak'ahs, but he continued.' I thought: 'He will complete it and then bow,' but he continued until he recited Surat An-Nisa', then Al Imran. Then he bowed for almost as long as he had stood, saying while bowing: 'Subhan Rabbial-azim, Subhan Rabbial-azim, Subhan Rabbial-azim ( Glory be to my Lord Almighty, Glory be to my Lord Almighty, Glory be to my Lord Almighty).' Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him). Then he prostrated and made his prostration lengthy, saying: \"Subhan Rabbial-A'la, Subhan Rabbial-A'la, Subhan Rabbial-A'la (Glory be to my Lord Most High, Glory be to my Lord Most High, Glory be to my Lord Most High). And he did not come to any verse that spoke of fear or glorifying Allah, the Mighty and Sublime, but he said something appropriate.\"",
      "chain": [
        "30123",
        "20028",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1145",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، سمعه يحدث، عن رجل، من عبس عن حذيفة، أنه انتهى إلى النبي صلى الله عليه وسلم فقام إلى جنبه فقال ‏\"‏ الله أكبر ذو الملكوت والجبروت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم قرأ بالبقرة ثم ركع فكان ركوعه نحوا من قيامه فقال في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ وقال حين رفع رأسه ‏\"‏ لربي الحمد لربي الحمد ‏\"‏ ‏.‏ وكان يقول في سجوده ‏\"‏ سبحان ربي الأعلى سبحان ربي الأعلى ‏\"‏ ‏.‏ وكان يقول بين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏",
      "text_en": " A man from (the tribe of) 'Abs narrated from Hudhaifah that:                     He came to the Prophet (ﷺ) and stood by his side, and he said: \"Allahu Akbar Dhul-malakut wal-jabarut wal-kibriya' wal 'azamah (Allah is Most Great, the One Who has all sovereignty, power, magnificence, and might.)\" Then he recited Al-Baqarah, then he bowed, and his bowing lasted almost as long as his standing, and he said when bowing: 'Subahana Rabbial-'azim, Subhana Rabbial-'azim (Glory be to my Lord Almighty, Glory be to my Lord Almighty).\" When he raised his head he said: \"Li Rabbial-hamd, Li Rabbial-hamd (To my Lord be praise, to my Lord be praise).\" And when he prostrated he said: \"Subahana Rabbial-A'la, Subahna Rabbial-A'la (Glory be to my Lord Most High, glory be to my Lord Most High).\" And between the two prostrations he would say: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me).\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11381",
        "20458",
        "145"
      ]
    },
    {
      "hadith_no": "1312",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، - وهو ابن مغول - عن طلحة بن مصرف، عن زيد بن وهب، عن حذيفة، أنه رأى رجلا يصلي فطفف فقال له حذيفة منذ كم تصلي هذه الصلاة قال منذ أربعين عاما ‏.‏ قال ما صليت منذ أربعين سنة ولو مت وأنت تصلي هذه الصلاة لمت على غير فطرة محمد صلى الله عليه وسلم ثم قال إن الرجل ليخفف ويتم ويحسن ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He saw a man praying (And his bowing and prostration) were lacking. Hudhaifah said to him: 'For how long have you been praying like this?' He said: \"For forty years.' He said: 'You have not been praying for forty years and if you die praying like this, you will have died following a path other than the path of Muhammad (ﷺ). Then he said: 'It is possible for a man to pray briefly, but still do it properly.\"",
      "chain": [
        "38022",
        "20364",
        "20358",
        "11356",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عز وجل عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله عز وجل بنا فهدانا ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم لنا تبع يوم القيامة ونحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah (SWT) sent astray from Friday those who came before us, so the Jews had Saturday and the Christians had Sunday. Then Allah (SWT), the Mighty and Sublime, brought us and guided us to Friday, so there is Friday, Saturday and Sunday, and thus they will follow us on the Day of Resurrection. We are the last of the people of this world but the first on the Day of Resurrection for whom judgment will be passed before all other creatures.'\"",
      "chain": [
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1621",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، عن عبد الرحمن، عن سفيان، عن منصور، والأعمش، وحصين، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم كان إذا قام من الليل يشوص فاه بالسواك ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     When the Prophet (ﷺ) got up to pray at night, he would brush his teeth with the siwak.",
      "chain": [
        "30153",
        "30170",
        "20033",
        "20012",
        "11067",
        "11060",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1622",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن حصين، قال سمعت أبا وائل، يحدث عن حذيفة، قال كان رسول الله صلى الله عليه وسلم إذا قام من الليل يشوص فاه بالسواك ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"When the Messenger of Allah (ﷺ) got up to pray tahajjud at night, he would brush his teeth with the siwak.",
      "chain": [
        "30449",
        "20423",
        "20020",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1623",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن سعيد، عن إسحاق بن سليمان، عن أبي سنان، عن أبي حصين، عن شقيق، عن حذيفة، قال كنا نؤمر بالسواك إذا قمنا من الليل ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"We were commanded to use the siwak when we got up to pray at night.\"",
      "chain": [
        "11184",
        "20310",
        "11371",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع النبي صلى الله عليه وسلم ليلة فافتتح البقرة فقلت يركع عند المائة فمضى فقلت يركع عند المائتين فمضى فقلت يصلي بها في ركعة فمضى فافتتح النساء فقرأها ثم افتتح آل عمران فقرأها يقرأ مترسلا إذا مر بآية فيها تسبيح سبح وإذا مر بسؤال سأل وإذا مر بتعوذ تعوذ ثم ركع فقال ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ فكان ركوعه نحوا من قيامه ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فكان قيامه قريبا من ركوعه ثم سجد فجعل يقول ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ فكان سجوده قريبا من ركوعه ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I prayed with the Prophet (ﷺ) one night. He started to recite Al-Baqarah and I thought, 'he will bow when he reaches one hundred,' but he carried on. I thought, 'he is going to recite the whole surah in one rak'ah,' but he carried on. He started to recite An-Nisa' and recited (the whole surah), then he started to recite Al Imran and recited (the whole surah), reciting slowly. When he reached a verse that spoke of glorifying Allah (SWT), he glorified Him. When he reached a verse that spoke of supplication, he made supplication. When he reached a verse that spoke of seeking refuge with Allah, he sought refuge with Him. Then he bowed and said: 'Subhana Rabbiyal-Azim.(Glory be to my Lord Almighty)', and he bowed for almost as long as he had stood. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him)', and he stood for almost as long as he had bowed. Then he prostrated and started to say:  Subhana Rabbiyal-'Ala (Glory be to my Lord Most High),' and he prostrated for almost as long as he had bowed.'\"",
      "chain": [
        "38181",
        "20331",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1665",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن محمد المروزي، - ثقة - قال حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد الأنصاري، عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم في رمضان فركع فقال في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ مثل ما كان قائما ثم جلس يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ مثل ما كان قائما ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ مثل ما كان قائما فما صلى إلا أربع ركعات حتى جاء بلال إلى الغداة ‏.‏ قال أبو عبد الرحمن هذا الحديث عندي مرسل وطلحة بن يزيد لا أعلمه سمع من حذيفة شيئا وغير العلاء بن المسيب قال في هذا الحديث عن طلحة عن رجل عن حذيفة ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He prayed with the Messenger of Allah during Ramadan. He bowed and said: \"Subhana Rabbiyal-Azim while bowing, for as long as he had stood. Then he sat down and said: \"Rabbighfirli, Rabbighfirli (Lord forgive me, Lord forgive me),\" for as long as he had stood. Then he prostrated and said: \"Subhana Rabbiyal-'Ala for as long as he had stood And he prayed no more than four rak'ahs when Bilal came for Al-Ghadah.",
      "chain": [
        "30123",
        "28603",
        "11647",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "hadith_no": "2080",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن منصور، عن ربعي، عن حذيفة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان رجل ممن كان قبلكم يسيء الظن بعمله فلما حضرته الوفاة قال لأهله إذا أنا مت فأحرقوني ثم اطحنوني ثم اذروني في البحر فإن الله إن يقدر على لم يغفر لي ‏.‏ قال فأمر الله عز وجل الملائكة فتلقت روحه قال له ما حملك على ما فعلت قال يا رب ما فعلت إلا من مخافتك ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Messenger of Allah said:                     \"There was a man among those who came before you who thought badly of his deeds, so when death was approaching he said to his family: 'When I am dead, burn my body and grind up my bones, then scatter me in the sea, for if Allah gets hold of me, He will never forgive me.' But Allah commanded the angles to seize his soul. He said to him: 'What made you do what you did?' He said:: 'O Lord, I only did it  because I feared You.' So Allah forgave him.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2126",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن ربعي بن حراش، عن حذيفة بن اليمان، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقدموا الشهر حتى تروا الهلال قبله أو تكملوا العدة ثم صوموا حتى تروا الهلال أو تكملوا العدة قبله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ribii bin Hirash, from Hudhaifah bin Al-Yaman, that the Messenger of Allah said:                     \"Do not anticipate the month until you see the crescent before it, or you complete the number of days. Then fast until you see the new moon, or you complete the number of days.\"",
      "chain": [
        "30123",
        "20028",
        "11067",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "5329",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، ومحمد بن قدامة، عن جرير، عن الأعمش، عن أبي إسحاق، عن مسلم بن نذير، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ موضع الإزار إلى أنصاف الساقين والعضلة فإن أبيت فأسفل فإن أبيت فمن وراء الساق ولا حق للكعبين في الإزار ‏\"‏ ‏.‏ واللفظ لمحمد ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah [SAW] said: 'The Izar should come to the middle of the shins and the calf. If you insist, then a little lower, and if you insist, then a little further down, but the Izar has no right to (come to) the ankle.\" This is the wordings of Muhammad.",
      "chain": [
        "30123",
        "20028",
        "11060",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "51",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا داود بن سليمان العسكري، حدثنا محمد بن علي أبو هاشم بن أبي خداش الموصلي، قال حدثنا محمد بن محصن، عن إبراهيم بن أبي عبلة، عن عبد الله بن الديلمي، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقبل الله لصاحب بدعة صوما ولا صلاة ولا صدقة ولا حجا ولا عمرة ولا جهادا ولا صرفا ولا عدلا يخرج من الإسلام كما تخرج الشعرة من العجين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah will not accept any fasting, prayer, charity, Hajj, 'Umrah, Jihad, or any other obligatory or voluntary action from a person who follows innovation (Bid'ah). He comes out of Islam like a hair pulled out of dough.\" (Maudu')",
      "chain": [
        "38211",
        "11442",
        "11667",
        "5136",
        "145"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا مؤمل، قالا حدثنا سفيان، عن عبد الملك بن عمير، عن مولى، لربعي بن حراش عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لا أدري قدر بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Yaman said:                     \"The Messenger of Allah said: 'I do not know howlong I will stay among you, so follow the example of these two after I am gone,' and he pointed to Abu Bakr and 'Umar.\"",
      "chain": [
        "38409",
        "20032",
        "30160",
        "30180",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، جميعا عن أبي إسحاق، عن صلة بن زفر، عن حذيفة، أن رسول الله  صلى الله عليه وسلم  قال لأهل نجران ‏\"‏ سأبعث معكم رجلا أمينا حق أمين ‏\"‏ ‏.‏ قال فتشوف لها الناس فبعث أبا عبيدة بن الجراح ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Messenger of Allah said to the people of Najran: \"I will send you a trustworthy man with you, who is indeed trustworthy.\" The people craned their necks to see, and he sent Abu 'Ubaidah bin Jarrah.",
      "chain": [
        "38409",
        "20032",
        "20012",
        "30160",
        "20173",
        "20020",
        "11049",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عاصم العباداني، حدثنا بشير بن ميمون، قال سمعت أشعث بن سوار، عن ابن سيرين، عن حذيفة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تعلموا العلم لتباهوا به العلماء أو لتماروا به السفهاء أو لتصرفوا وجوه الناس إليكم فمن فعل ذلك فهو في النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I heard the Messenger of Allah say: 'Do not acquire knowledge in order to show off before the scholars, or to argue with the foolish, or to attract people's attention, for whoever does that will be in Hell.'\"",
      "chain": [
        "36509",
        "23009",
        "10891",
        "11035",
        "145"
      ]
    },
    {
      "hadith_no": "301",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، وأبي، عن الأعمش، ح وحدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن منصور، وحصين، عن أبي وائل، عن حذيفة، قال كان رسول الله  صلى الله عليه وسلم  إذا قام من الليل يتهجد يشوص فاه بالسواك ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"Whenever the Messenger of Allah got up for prayer at night to pray Tahajjud (night optional prayer), he would clean his mouth with the tooth stick.\"",
      "chain": [
        "30212",
        "20354",
        "11060",
        "38409",
        "20032",
        "20012",
        "11067",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، وهشيم، ووكيع، عن الأعمش، عن أبي وائل، عن حذيفة، أن رسول الله  صلى الله عليه وسلم  أتى سباطة قوم فبال عليها قائما ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Messenger of Allah came to the garbage dump of some people and he urinated on it standing up.",
      "chain": [
        "30201",
        "20587",
        "20468",
        "20032",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال شعبة قال عاصم يومئذ وهذا الأعمش يرويه عن أبي وائل عن حذيفة وما حفظه ‏.‏ فسألت عنه منصورا فحدثنيه عن أبي وائل عن حذيفة أن رسول الله  صلى الله عليه وسلم  أتى سباطة قوم فبال قائما ‏.‏",
      "text_en": "",
      "chain": [
        "20020",
        "11353",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "578",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا إسحاق بن منصور، أنبأنا يحيى بن سعيد، جميعا عن مسعر، عن واصل الأحدب، عن أبي وائل، عن حذيفة، قال خرج النبي  صلى الله عليه وسلم  فلقيني وأنا جنب فحدت عنه فاغتسلت ثم جئت فقال ‏\"‏ ما لك ‏\"‏ ‏.‏ قلت كنت جنبا ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Prophet came out and met me when I was sexually impure, so I kept away from him. Then I had a bath and came to him. He said: 'What is the matter with you?' I said: 'I was sexually impure.' The Messenger of Allah said: 'The Muslim does not become impure.'\"",
      "chain": [
        "38409",
        "20032",
        "30313",
        "20031",
        "20359",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "587",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا وكيع، ح وحدثنا أبو همام الوليد بن شجاع بن الوليد، حدثنا أبي وابن، عيينة وابن أبي زائدة جميعا عن الأعمش، عن أبي وائل، عن حذيفة، أن رسول الله  صلى الله عليه وسلم  توضأ ومسح على خفيه ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Messenger of Allah performed ablution and wiped over his leather socks.",
      "chain": [
        "30212",
        "38409",
        "20032",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "938",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رمح المصري، أنبأنا ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبي الأزهر، عن حذيفة بن اليمان، أنه سمع رسول الله  صلى الله عليه وسلم  يقول إذا ركع ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ ثلاث مرات وإذا سجد قال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah bin Al-Yaman that he heard theMessenger ofAllah (ﷺ) say when he bowed:                      “Subhana Rabbiyal-‘Azim(Glory isto my Lord, the Most Great)” three times, and when heprostrated hesaid: “Subhana Rabbiyal-A’la (Glory is to my Lord theMost High)”three times.",
      "chain": [
        "30490",
        "20624",
        "11409",
        "145"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا حفص بن غياث، حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، ح وحدثنا علي بن محمد، حدثنا حفص بن غياث، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي  صلى الله عليه وسلم  كان يقول بين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah that the Prophet (ﷺ) used to saybetweenthe two prostrations:                      “Rabbighfir li, Rabbighfir li (O Lordforgiveme, O Lord forgive me).”",
      "chain": [
        "38409",
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "38409",
        "20317",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1076",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هناد بن السري، وعبد الله بن عامر بن زرارة، قالا حدثنا أبو بكر بن عياش، عن عاصم، عن أبي وائل، عن حذيفة، أنه رأى شبث بن ربعي بزق بين يديه فقال يا شبث لا تبزق بين يديك فإن رسول الله  صلى الله عليه وسلم  كان ينهى عن ذلك وقال ‏\"‏ إن الرجل إذا قام يصلي أقبل الله عليه بوجهه حتى ينقلب أو يحدث حدث سوء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah that he saw Shabath bin Rib’i spittinginfront of him. He said:                      “O Shabath! Do not spit in front of you, forthe Messenger of Allah (ﷺ) used to forbid that, and he said: ‘Whenaman stands up to perform prayer, Allah turns His Face towards himuntil he turns away or he commits an evil Hadath.’”*",
      "chain": [
        "30480",
        "30467",
        "20373",
        "11080",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن المنذر، حدثنا ابن فضيل، حدثنا أبو مالك الأشجعي، عن ربعي بن حراش، عن حذيفة، وعن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أضل الله عن الجمعة من كان قبلنا كان لليهود يوم السبت والأحد للنصارى فهم لنا تبع إلى يوم القيامة نحن الآخرون من أهل الدنيا والأولون المقضي لهم قبل الخلائق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Allah led those who came before us astray from Friday.Saturdaywas for the Jews and Sunday was for the Christians. And theywill lagbehind us until the Day of Resurrection. We are the last ofthe peopleof this world but we will be the first to be judged amongall ofcreation.’”",
      "chain": [
        "20356",
        "10766",
        "11334",
        "145",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1412",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي  صلى الله عليه وسلم  صلى فكان إذا مر بآية رحمة سأل وإذا مر بآية عذاب استجار وإذا مر بآية فيها تنزيه لله سبح ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah that the Prophet (ﷺ) prayed, andwhen herecited a Verse which mentioned mercy, he would ask for mercy;whenhe recited a Verse that mentioned punishment he would pray fordeliverance from it; and when he recited a Verse that mentioned theTanzih of Allah, he would glorify Him.",
      "chain": [
        "38409",
        "20354",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو بكر بن عياش، عن عاصم، عن زر، عن حذيفة، قال تسحرت مع رسول الله  صلى الله عليه وسلم  هو النهار إلا أن الشمس لم تطلع ‏.‏",
      "text_en": " It wasnarrated that Hudhaifah said:                      “I ate Suhur with the MessengerofAllah (ﷺ) when it was daybreak but the sun had not yet risen.”[(One of the narrators) Abu Ishaq said: “The Hadith of Hudhaifah isabrogated and does not mean anything.”]",
      "chain": [
        "38409",
        "20373",
        "11080",
        "11337",
        "145"
      ]
    },
    {
      "hadith_no": "2198",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، أن رجلا، من المسلمين رأى في النوم أنه لقي رجلا من أهل الكتاب فقال نعم القوم أنتم لولا أنكم تشركون تقولون ما شاء الله وشاء محمد ‏.‏ وذكر ذلك للنبي  صلى الله عليه وسلم  فقال ‏\"‏ أما والله إن كنت لأعرفها لكم قولوا ما شاء الله ثم شاء محمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that :                     a Muslim man saw in a dream that he met a man from among the People of the Book, who said: \"What good people you would be if only you were not committing Shirk. For you say: 'What Allah  wills and Muhammad wills.\"' He mentioned that to the Prophet (ﷺ) and he said: \"By Allah, I am aware of that. Say: 'What Allah wills then what Muhammad wills.\"'Another chain from Tufail bin Sakhbarah, the brother of 'Aishah by her mother, from the Prophet (ﷺ), with similar wording.",
      "chain": [
        "30288",
        "20005",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2513",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت ربعي بن حراش، يحدث عن حذيفة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا مات فقيل له ما عملت - فإما ذكر أو ذكر - قال إني كنت أتجوز في السكة والنقد وأنظر المعسر ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Prophet (ﷺ) said:                     “A man died and it was said to him: 'What did you do?' Either he remembered or was reminded and said: 'I used to be easy going in coins and cash collecting debts due, and I used to give respite to (the debtor) who was in difficulty. So, Allah (SWT) forgave him.' ” Abu Masud said: “I heard that from the Messenger of Allah (ﷺ).”",
      "chain": [
        "30160",
        "20443",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "3540",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن حذيفة، قال نهى رسول الله  صلى الله عليه وسلم  عن الشرب في آنية الذهب والفضة وقال ‏\"‏ هي لهم في الدنيا وهي لكم في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Hudhaifah said:                      “The Messenger of Allah (ﷺ)forbadedrinking from vessels of gold and silver. He said: “They areforthem in this world and for you in the Hereafter.’”",
      "chain": [
        "30450",
        "20469",
        "11419",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "3702",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن مسلم بن نذير، عن حذيفة، قال أخذ رسول الله  صلى الله عليه وسلم  بأسفل عضلة ساقي أو ساقه فقال ‏\"‏ هذا موضع الإزار فإن أبيت ‏.‏ فأسفل فإن أبيت فأسفل فإن أبيت فلا حق للإزار في الكعبين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Hudhaifah said:                      “The Messenger of Allah (ﷺ)tookhold of the lower part of my calf or his calf and said: ‘This iswhere the lower wrap should come to. If you insist, then lower, andifyou insist, then lower, but the lower wrap has no right to (cometo)the ankle.’”",
      "chain": [
        "30201",
        "20327",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "3703",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا علي بن محمد، حدثنا سفيان بن عيينة، حدثني أبو إسحاق، عن مسلم بن نذير، عن حذيفة، عن النبي  صلى الله عليه وسلم  مثله ‏.‏",
      "text_en": "",
      "chain": [
        "38409",
        "20005",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "3721",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن شعبة، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن حذيفة، قال نهى رسول الله  صلى الله عليه وسلم  عن لبس الحرير والذهب وقال ‏\"‏ هو لهم في الدنيا ولنا في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Hudhaifah said:                      “The Messenger of Allah (ﷺ)forbadewearing silk and gold. He said: ‘They are for them in thisworldand for us in the Hereafter.’”",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11069",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "3817",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو بكر بن عياش، عن أبي إسحاق، عن أبي المغيرة، عن حذيفة، قال كان في لساني ذرب على أهلي وكان لا يعدوهم إلى غيرهم فذكرت ذلك للنبي  صلى الله عليه وسلم  فقال ‏\"‏ أين أنت من الاستغفار تستغفر الله في اليوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I was harsh in the way I spoke to my family, but not to others.  I mentioned that to the Prophet (saas) and he said: 'Why don't you ask for forgiveness? Ask Allah to forgive you, seventy times each day.'\"",
      "chain": [
        "38409",
        "20373",
        "11049",
        "20442",
        "145"
      ]
    },
    {
      "hadith_no": "3880",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة، قال كان رسول الله  صلى الله عليه وسلم  إذا انتبه من الليل قال ‏\"‏ الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      “Whenever the Messenger of Allah (ﷺ) woke up in the morning, he would say: ‘Al-hamdu lillahil-ladhi ahyana ba’dama amatana wa ilayhi’n-nushur (Praise is to Allah Who has given us life after taking it from us, and unto Him is the Resurrection).’”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4090",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو معاوية، وأبي، عن الأعمش، عن شقيق، عن حذيفة، قال كنا جلوسا عند عمر فقال أيكم يحفظ حديث رسول الله  صلى الله عليه وسلم  في الفتنة قال حذيفة فقلت أنا ‏.‏ قال إنك لجريء قال كيف قال سمعته يقول ‏\"‏ فتنة الرجل في أهله وولده وجاره تكفرها الصلاة والصيام والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏ ‏.‏ فقال عمر ليس هذا أريد إنما أريد التي تموج كموج البحر ‏.‏ فقال مالك ولها يا أمير المؤمنين إن بينك وبينها بابا مغلقا ‏.‏ قال فيكسر الباب أو يفتح قال لا بل يكسر ‏.‏ قال ذاك أجدر أن لا يغلق ‏.‏ قلنا لحذيفة أكان عمر يعلم من الباب قال نعم كما يعلم أن دون غد الليلة إني حدثته حديثا ليس بالأغاليط ‏.‏ فهبنا أن نسأله من الباب فقلنا لمسروق سله فسأله فقال عمر ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      “We were sitting with ‘Umarand he said: ‘Which of you has remembered a Hadith from theMessenger of Allah (ﷺ) concerning Fitnah?’” Hudhaifah said: “Isaid: ‘I have.’ He said: ‘You are very bold.’ He said: ‘How?’He said: ‘I heard him say: “The fitnah of a man with regard tohis family, his children and his neigbors are expiated by hisprayers, fasts, charity and enjoining what is good and forbiddingwhat is evil.” ‘Umar said: ‘This is not what I meant, rather Imeant that which moves like the waves of the sea.’” Hudhaifahsaid: “Don’t worry about it, O Commander of the Believers! Forthere is a closed door between you and them.” ‘Umar said: “Willthat door be broken or opened?” I said: “No, it will be broken.”‘Umar said: “Then it will never be closed.’”We asked Hudhaifah: “Did ‘Umar know what that door meant?” He said: \"Yes, just as he knows that there will be night before morning, because I narrated to him a Hadith in which there are no errors.” We were afraid to ask him who the door was, so we said to Masruq: “Ask him.\" He said: “‘Umar.”",
      "chain": [
        "30212",
        "20354",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "4114",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا الوليد بن مسلم، حدثني عبد الرحمن بن يزيد بن جابر، حدثني بسر بن عبيد الله، حدثني أبو إدريس الخولاني، أنه سمع حذيفة بن اليمان، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يكون دعاة على أبواب جهنم من أجابهم إليها قذفوه فيها ‏\"‏ ‏.‏ قلت يا رسول الله صفهم لنا قال ‏\"‏ هم قوم من جلدتنا يتكلمون بألسنتنا ‏\"‏ ‏.‏ قلت فما تأمرني إن أدركني ذلك قال ‏\"‏ فالزم جماعة المسلمين وإمامهم فإن لم يكن لهم جماعة ولا إمام فاعتزل تلك الفرق كلها ولو أن تعض بأصل شجرة حتى يدركك الموت وأنت كذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “There will be callers at the gates of Hell; whoeverresponds to them they throw them into it.” I said: “O MessengerofAllah, describe them to us.” He said: “They will be from ourpeople,speaking our language.” I said: “What do you command meto do, if Ilive to see that?” He said: “Adhere tothe main bodyof the Muslims andtheir leader. If there is no such body and noleader, then withdrawfrom all their groups, even if you bite ontothe trunk of a tree untildeath finds you in that state.”",
      "chain": [
        "38409",
        "20733",
        "20395",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "4116",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عمر بن علي المقدمي، حدثنا سعيد بن عامر، حدثنا أبو عامر الخزاز، عن حميد بن هلال، عن عبد الرحمن بن قرط، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تكون فتن على أبوابها دعاة إلى النار فأن تموت وأنت عاض على جذل شجرة خير لك من أن تتبع أحدا منهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “There will be tribulations at the gates of which willbecallers (calling people) to Hell. Dying when you are biting ontothestump of a tree will be better for you than following anyone ofthem.”",
      "chain": [
        "30582",
        "20232",
        "10690",
        "11281",
        "5154",
        "145"
      ]
    },
    {
      "hadith_no": "4152",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن علي بن زيد، عن الحسن، عن جندب، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا ينبغي للمؤمن أن يذل نفسه ‏\"‏ ‏.‏ قالوا وكيف يذل نفسه قال ‏\"‏ يتعرض من البلاء لما لا يطيقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Messenger of Allah (ﷺ)said:                      “The believer should not humiliate himself.” They said:“Howcould he humiliate himself?” He said: “By taking on atrial that hecannot deal with.”",
      "chain": [
        "30160",
        "20267",
        "20021",
        "10664",
        "11016",
        "4053",
        "145"
      ]
    },
    {
      "hadith_no": "4165",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أحصوا لي كل من تلفظ بالإسلام ‏\"‏ ‏.‏ قلنا يا رسول الله أتخاف علينا ونحن ما بين الستمائة إلى السبعمائة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنكم لا تدرون لعلكم أن تبتلوا ‏\"‏ ‏.‏ قال فابتلينا حتى جعل الرجل منا ما يصلي إلا سرا ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Messenger of Allah (ﷺ)said:                      “Count for me all those who have uttered (the word of)Islam.”We said: “O Messenger of Allah, do you fear for us whenwe numberbetween six and seven hundred?” The Messenger of Allah(ﷺ) said:“You do not know, perhaps you will be tested.”",
      "chain": [
        "30212",
        "38409",
        "20354",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "4179",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز الدراوردي، حدثنا عمرو، - مولى المطلب - عن عبد الله بن عبد الرحمن الأنصاري، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تقوم الساعة حتى تقتلوا إمامكم وتجتلدوا بأسيافكم ويرث دنياكم شراركم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “The Hour will not begin until you kill your ruler andfight one another with swords, and your world is inherited by theworst of you.”",
      "chain": [
        "30288",
        "20167",
        "11209",
        "145"
      ]
    },
    {
      "hadith_no": "4185",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن أبي مالك الأشجعي، عن ربعي بن حراش، عن حذيفة بن اليمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يدرس الإسلام كما يدرس وشى الثوب حتى لا يدرى ما صيام ولا صلاة ولا نسك ولا صدقة وليسرى على كتاب الله عز وجل في ليلة فلا يبقى في الأرض منه آية وتبقى طوائف من الناس الشيخ الكبير والعجوز يقولون أدركنا آباءنا على هذه الكلمة لا إله إلا الله فنحن نقولها ‏\"‏ ‏.‏ فقال له صلة ما تغني عنهم لا إله إلا الله وهم لا يدرون ما صلاة ولا صيام ولا نسك ولا صدقة فأعرض عنه حذيفة ثم ردها عليه ثلاثا كل ذلك يعرض عنه حذيفة ثم أقبل عليه في الثالثة فقال يا صلة تنجيهم من النار ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah(ﷺ) said:                      “Islam will wear out as embroidery on a garment wearsout, until no one will know what fasting, prayer, (pilgrimage) ritesand charity are. The Book of Allah will be taken away at night, andnot one Verse of it will be left on earth. And there will be somepeople left, old men and old women, who will say: “We saw ourfathers saying these words: ‘La ilaha illallah’ so we say themtoo.” Silah said to him: “What good will (saying): La ilahaillallah do them, when they do not know what fasting, prayer,(pilgrimage) rites and charity are?” Hudhaifah turned away fromhis. He repeated his question three times, and Hudhaifah turned awayfrom him each time. Then he turned to him on the third time and said:“O Silah! It will save them from Hell,” three times.",
      "chain": [
        "38409",
        "20354",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن الأعمش، عن زيد بن وهب، عن حذيفة، قال حدثنا رسول الله  صلى الله عليه وسلم  حديثين قد رأيت أحدهما وأنا أنتظر الآخر حدثنا ‏\"‏ أن الأمانة نزلت في جذر قلوب الرجال ‏\"‏ ‏.‏ - قال الطنافسي يعني وسط قلوب الرجال - ونزل القرآن فعلمنا من القرآن وعلمنا من السنة ‏.‏ ثم حدثنا عن رفعهما فقال ‏\"‏ ينام الرجل النومة فترفع الأمانة من قلبه فيظل أثرها كأثر الوكت ثم ينام النومة فتنزع الأمانة من قلبه فيظل أثرها كأثر المجل كجمر دحرجته على رجلك فنفط فتراه منتبرا وليس فيه شىء ‏\"‏ ‏.‏ ثم أخذ حذيفة كفا من حصى فدحرجه على ساقه ‏.‏ قال ‏\"‏ فيصبح الناس يتبايعون ولا يكاد أحد يؤدي الأمانة حتى يقال إن في بني فلان رجلا أمينا ‏.‏ وحتى يقال للرجل ما أعقله وأجلده وأظرفه ‏.‏ وما في قلبه حبة خردل من إيمان ‏\"‏ ‏.‏ ولقد أتى على زمان ولست أبالي أيكم بايعت لئن كان مسلما ليردنه على إسلامه ولئن كان يهوديا أو نصرانيا ليردنه على ساعيه فأما اليوم فما كنت لأبايع إلا فلانا وفلانا ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      “The Messenger of Allah (ﷺ)told us two Ahadith, one of which I have seen, and I am still waitingfor the other. He told us: ‘Honesty was preserved in the roots ofmen’s hearts’ – (One of the narrators) Tanafisi said: ‘Meaningin the middle of men’s hearts’ – ‘Then the Qur’an wasrevealed and we learned (it) from the Qur’an and the Sunnah.’Then he told us about its disappearance, saying; ‘A man will go tosleep and honesty will be taken away from his heart, and only itstrace will remain, like spots without color. Then he will go to sleepagain and the remainder of the honesty will also be taken away (fromhis heart) and leaving a trace like a blister, as when an embertouches your foot and raises a blister which has nothing inside.’”Then Hudhaifah picked up a handful of pebbles and rolled them on hisleg. He said: “People will engage in business with one another, butthere will hardly be any honest persons among them. Then it will besaid that in such and such a tribe there is an honest man, and a manwill be admired for his intelligence, good manners and strength, butthere will not be even a mustard seed of faith in his heart.”\"There was a time when I did not mind dealing with anyone of you, for if he was a Muslim, his religion would prevent him from cheating; and if he was a Christian, his Muslim ruler would prevent him from cheating. But today I cannot deal except with so-and-so and so-and-so.\"",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11341",
        "145"
      ]
    },
    {
      "hadith_no": "4209",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا أبو معاوية، حدثنا الأعمش، عن شقيق، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الدجال أعور عين اليسرى جفال الشعر معه جنة ونار فناره جنة وجنته نار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                      \"The Messenger of Allah(ﷺ)said: 'The Dajjal (False Christ) is blind in his left eye andhasabundant hair. With him will be a Paradise and a Hell, but hisHell isParadise and his Paradise is Hell.'\"",
      "chain": [
        "30212",
        "38409",
        "20354",
        "11060",
        "11353",
        "145"
      ]
    }
  ],
  "total_hadiths": 165
}