{
  "id": "1457",
  "name": "Abu Hameed al-Sa'idi al-Ansari ( عبد الرحمن بن سعد, أبو حميد الساعدي ( رضي الله عنه",
  "full_name": "Abu Hameed al-Sa'idi al-Ansari ( عبد الرحمن بن سعد, أبو حميد الساعدي  ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "60",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Sa'ida B.Ka'b B.al-Khazraj",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1456",
      "name": "Kabsha bint 'Abd 'Amr bin 'Ubaid ( كبشة بنت عبد عمرو بن عبيد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11697",
      "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19961",
      "name": "Muhammad bin 'Amr bin 'Ata' محمد بن عمرو بن عطاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-925",
      "hadith_no": "925",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عروة، عن أبي حميد الساعدي، أنه أخبره أن رسول الله صلى الله عليه وسلم قام عشية بعد الصلاة، فتشهد وأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏ تابعه أبو معاوية وأبو أسامة عن هشام عن أبيه عن أبي حميد عن النبي صلى الله عليه وسلم قال ‏\"‏ أما بعد ‏\"‏‏.‏ تابعه العدني عن سفيان في أما بعد‏.‏",
      "text_en": " Narrated Abu Hummaid As-Sa`idi:                     One night Allah's Apostle (p.b.u.h) stood up after the prayer and recited \"Tashah-hud\" and then praised Allah as He deserved and said, \"Amma ba'du.\"",
      "usc_msa_ref": "47",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-1505",
      "hadith_no": "1505",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم غزوة تبوك فلما جاء وادي القرى إذا امرأة في حديقة لها فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ اخرصوا ‏\"‏‏.‏ وخرص رسول الله صلى الله عليه وسلم عشرة أوسق فقال لها ‏\"‏ أحصي ما يخرج منها ‏\"‏‏.‏ فلما أتينا تبوك قال ‏\"‏ أما إنها ستهب الليلة ريح شديدة فلا يقومن أحد، ومن كان معه بعير فليعقله ‏\"‏‏.‏ فعقلناها وهبت ريح شديدة فقام رجل فألقته بجبل طيئ  وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا وكتب له ببحرهم  فلما أتى وادي القرى قال للمرأة ‏\"‏ كم جاء حديقتك ‏\"‏‏.‏ قالت عشرة أوسق خرص رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إني متعجل إلى المدينة، فمن أراد منكم أن يتعجل معي فليتعجل ‏\"‏‏.‏ فلما  قال ابن بكار كلمة معناها  أشرف على المدينة قال ‏\"‏ هذه طابة ‏\"‏‏.‏ فلما رأى أحدا قال ‏\"‏ هذا جبيل يحبنا ونحبه، ألا أخبركم بخير دور الأنصار ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ دور بني النجار، ثم دور بني عبد الأشهل، ثم دور بني ساعدة، أو دور بني الحارث بن الخزرج، وفي كل دور الأنصار  يعني  خيرا ‏\"‏‏.‏ وقال سليمان بن بلال حدثني عمرو، ‏\"‏ ثم دار بني الحارث، ثم بني ساعدة ‏\"‏‏.‏ وقال سليمان عن سعد بن سعيد، عن عمارة بن غزية، عن عباس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحد جبل يحبنا ونحبه ‏\"‏‏.‏ قال أبو عبد الله كل بستان عليه حائط فهو حديقة، وما لم يكن عليه حائط لم يقل حديقة‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     We took part in the holy battle of Tabuk in the company of the Prophet and when we arrived at the Wadi-al-Qura, there was a woman in her garden. The Prophet asked his companions to estimate the amount of the fruits in the garden, and Allah's Apostle estimated it at ten Awsuq (One Wasaq = 60 Sa's) and 1 Sa'= 3 kg. approximately). The Prophet said to that lady, \"Check what your garden will yield.\" When we reached Tabuk, the Prophet said, \"There will be a strong wind tonight and so no one should stand and whoever has a camel, should fasten it.\" So we fastened our camels. A strong wind blew at night and a man stood up and he was blown away to a mountain called Taiy, The King of Aila sent a white mule and a sheet for wearing to the Prophet as a present, and wrote to the Prophet that his people would stay in their place (and will pay Jizya taxation.) (1) When the Prophet reached Wadi-al- Qura he asked that woman how much her garden had yielded. She said, \"Ten Awsuq,\" and that was what Allah's Apostle had estimated. Then the Prophet said, \"I want to reach Medina quickly, and whoever among you wants to accompany me, should hurry up.\" The sub-narrator Ibn Bakkar said something which meant: When the Prophet (p.b.u.h) saw Medina he said, \"This is Taba.\" And when he saw the mountain of Uhud, he said, \"This mountain loves us and we love it. Shall I tell you of the best amongst the Ansar?\" They replied in the affirmative. He said, \"The family of Bani-n-Najjar, and then the family of Bani Sa`ida or Bani Al-Harith bin Al-Khazraj. (The above-mentioned are the best) but there is goodness in all the families of Ansar.\"",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-1525",
      "hadith_no": "1525",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، أخبرنا هشام بن عروة، عن أبيه، عن أبي حميد الساعدي  رضى الله عنه  قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأسد على صدقات بني سليم يدعى ابن اللتبية، فلما جاء حاسبه‏.‏",
      "text_en": " Narrated Abu Humaid Al-Sa`idi:                     Allah's Apostle (p.b.u.h) appointed a man called Ibn Al-Lutbiya, from the tribe of Al-Asd to collect Zakat from Bani Sulaim. When he returned, (after collecting the Zakat) the Prophet checked the account with him.",
      "usc_msa_ref": "576",
      "chain": [
        "30224",
        "20318",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-1905",
      "hadith_no": "1905",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل بن سعد، عن أبي حميد  رضى الله عنه  أقبلنا مع النبي صلى الله عليه وسلم من تبوك حتى أشرفنا على المدينة فقال ‏\"‏ هذه طابة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid:                     We came with the Prophet from Tabuk, and when we reached near Medina, the Prophet said, \"This is Tabah.\"",
      "usc_msa_ref": "96",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-2597",
      "hadith_no": "2597",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن عروة بن الزبير، عن أبي حميد الساعدي  رضى الله عنه  قال استعمل النبي صلى الله عليه وسلم رجلا من الأزد يقال له ابن اللتبية على الصدقة، فلما قدم قال هذا لكم، وهذا أهدي لي‏.‏ قال ‏\"‏ فهلا جلس في بيت أبيه أو بيت أمه، فينظر يهدى له أم لا والذي نفسي بيده لا يأخذ أحد منه شيئا إلا جاء به يوم القيامة يحمله على رقبته، إن كان بعيرا له رغاء أو بقرة لها خوار أو شاة تيعر  ثم رفع بيده، حتى رأينا عفرة إبطيه  اللهم هل بلغت اللهم هل بلغت ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid Al-Sa`idi:                     The Prophet appointed a man from the tribe of Al-Azd, called Ibn 'Utbiyya for collecting the Zakat. When he returned he said, \"This (i.e. the Zakat) is for you and this has been given to my as a present.\" The Prophet said, \"Why hadn't he stayed in his father's or mother's house to see whether he would be given presents or not? By Him in Whose Hands my life is, whoever takes something from the resources of the Zakat (unlawfully) will be carrying it on his neck on the Day of Resurrection; if it be a camel, it will be grunting; if a cow, it will be mooing; and if a sheep, it will be bleating.\" The Prophet then raised his hands till we saw the whiteness of his armpits, and he said thrice, \"O Allah! Haven't I conveyed Your Message (to them)?\"",
      "usc_msa_ref": "769",
      "chain": [
        "30351",
        "20005",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-3161",
      "hadith_no": "3161",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم تبوك، وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا، وكتب له ببحرهم‏.‏",
      "text_en": " Narrated Abu Humaid As-Saidi:                     We accompanied the Prophet in the Ghazwa of Tabuk and the king of 'Aila presented a white mule and a cloak as a gift to the Prophet. And the Prophet wrote to him a peace treaty allowing him to keep authority over his country.",
      "usc_msa_ref": "387",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-3369",
      "hadith_no": "3369",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، أخبرني أبو حميد الساعدي  رضى الله عنه  أنهم قالوا يا رسول الله كيف نصلي عليك فقال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته، كما صليت على آل إبراهيم، وبارك على محمد وأزواجه وذريته، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     The people asked, \"O Allah's Apostle! How shall we (ask Allah to) send blessings on you?\" Allah's Apostle replied, \"Say: O Allah! Send Your Mercy on Muhammad and on his wives and on his off spring, as You sent Your Mercy on Abraham's family; and send Your Blessings on Muhammad and on his offspring, as You sent Your Blessings on Abraham's family, for You are the Most Praiseworthy, the Most Glorious.\"",
      "usc_msa_ref": "588",
      "chain": [
        "30355",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-3838",
      "hadith_no": "3838",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل، عن أبي حميد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن خير دور الأنصار دار بني النجار، ثم عبد الأشهل، ثم دار بني الحارث، ثم بني ساعدة، وفي كل دور الأنصار خير ‏\"‏‏.‏ فلحقنا سعد بن عبادة فقال أبا أسيد ألم تر أن نبي الله صلى الله عليه وسلم خير الأنصار فجعلنا أخيرا فأدرك سعد النبي صلى الله عليه وسلم فقال يا رسول الله، خير دور الأنصار فجعلنا آخرا‏.‏ فقال ‏\"‏ أوليس بحسبكم أن تكونوا من الخيار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid:                     The Prophet said, \"The best of the Ansar families (homes) are the families (homes) of Banu An- Najjar, and then that of Banu `Abdul Ash-hal, and then that of Banu Al-Harith, and then that of Banu Saida; and there is good in all the families (homes) of the Ansar.\" Sa`d bin 'Ubada followed us and said, \"O Abu Usaid ! Don't you see that the Prophet compared the Ansar and made us the last of them in superiority? Then Sa`d met the Prophet and said, \"O Allah's Apostle! In comparing the Ansar's families (homes) as to the degree of superiority, you have made us the last of them.\" Allah's Apostle replied, \"Isn't it sufficient that you are regarded amongst the best?\"",
      "usc_msa_ref": "",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-4466",
      "hadith_no": "4466",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، قال حدثني عمرو بن يحيى، عن عباس بن سهل بن سعد، عن أبي حميد، قال أقبلنا مع النبي صلى الله عليه وسلم من غزوة تبوك حتى إذا أشرفنا على المدينة قال ‏\"‏ هذه طابة، وهذا أحد، جبل يحبنا ونحبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid:                     We returned in the company of the Prophet from the Ghazwa of Tabuk, and when we looked upon Medina, the Prophet said, \"This is Taba (i.e. Medina), and this is Uhud, a mountain that loves us and is loved by us.\"",
      "usc_msa_ref": "706",
      "chain": [
        "30463",
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-6434",
      "hadith_no": "6434",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرو بن سليم الزرقي، قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته، كما صليت على آل إبراهيم، وبارك على محمد وأزواجه وذريته، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid As-Saidi:                     The people said, \"O Allah's Apostle ! How may we send Salat on you?\" He said, \"Say: Allahumma Salli 'ala- Muhammadin wa azwajihi wa dhurriyyatihi kama sal-laita 'ala `Ali Ibrahim; wa barik 'ala Muhammadin wa azwajihi wa dhurriyyatihi kamabarakta 'ala `Ali Ibrahim innaka hamidun majid.\"",
      "usc_msa_ref": "371",
      "chain": [
        "20164",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-6717",
      "hadith_no": "6717",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عروة، عن أبي حميد الساعدي، أنه أخبره أن رسول الله صلى الله عليه وسلم استعمل عاملا فجاءه العامل حين فرغ من عمله فقال يا رسول الله هذا لكم، وهذا أهدي لي‏.‏ فقال له ‏\"‏ أفلا قعدت في بيت أبيك وأمك فنظرت أيهدى لك أم لا ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم عشية بعد الصلاة فتشهد وأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فما بال العامل نستعمله، فيأتينا فيقول هذا من عملكم، وهذا أهدي لي‏.‏ أفلا قعد في بيت أبيه وأمه فنظر هل يهدى له أم لا، فوالذي نفس محمد بيده لا يغل أحدكم منها شيئا، إلا جاء به يوم القيامة يحمله على عنقه، إن كان بعيرا جاء به له رغاء، وإن كانت بقرة جاء بها لها خوار، وإن كانت شاة جاء بها تيعر، فقد بلغت ‏\"‏‏.‏ فقال أبو حميد ثم رفع رسول الله صلى الله عليه وسلم يده حتى إنا لننظر إلى عفرة إبطيه‏.‏ قال أبو حميد وقد سمع ذلك معي زيد بن ثابت من النبي صلى الله عليه وسلم فسلوه‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     Allah's Apostle employed an employee (to collect Zakat). The employee returned after completing his job and said, \"O Allah's Apostle! This (amount of Zakat) is for you, and this (other amount) was given to me as a present.\" The Prophet said to him, \"Why didn't you stay at your father's or mother's house and see if you would be given presents or not?\" Then Allah's Apostle got up in the evening after the prayer, and having testified that none has the right to be worshipped but Allah and praised and glorified Allah as He deserved, he said, \"Now then ! What about an employee whom we employ and then he comes and says, 'This amount (of Zakat) is for you, and this (amount) was given to me as a present'? Why didn't he stay at the house of his father and mother to see if he would be given presents or not? By Him in Whose Hand Muhammad's soul is, none of you will steal anything of it (i.e. Zakat) but will bring it by carrying it over his neck on the Day of Resurrection. If it has been a camel, he will bring it (over his neck) while it will be grunting, and if it has been a cow, he will bring it (over his neck), while it will be mooing; and if it has been a sheep, he will bring it (over his neck) while it will be bleeding.\" The Prophet added, \"I have preached you (Allah's Message).\" Abu Humaid said, \"Then Allah's Apostle raised his hands so high that we saw the whiteness of his armpits.\"",
      "usc_msa_ref": "631",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-7065",
      "hadith_no": "7065",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا على صدقات بني سليم يدعى ابن اللتبية، فلما جاء حاسبه قال هذا مالكم وهذا هدية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وأمك، حتى تأتيك هديتك إن كنت صادقا ‏\"‏‏.‏ ثم خطبنا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد، فإني أستعمل الرجل منكم على العمل مما ولاني الله، فيأتي فيقول هذا مالكم وهذا هدية أهديت لي‏.‏ أفلا جلس في بيت أبيه وأمه حتى تأتيه هديته، والله لا يأخذ أحد منكم شيئا بغير حقه، إلا لقي الله يحمله يوم القيامة، فلأعرفن أحدا منكم لقي الله يحمل بعيرا له رغاء، أو بقرة لها خوار، أو شاة تيعر ‏\"‏‏.‏ ثم رفع يده حتى رئي بياض إبطه يقول ‏\"‏ اللهم هل بلغت ‏\"‏‏.‏ بصر عيني وسمع أذني‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     Allah's Apostle appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's tribe. When he returned, the Prophet called him to account. He said (to the Prophet, 'This is your money, and this has been given to me as a gift.\" On that, Allah's Apostle said, \"Why didn't you stay in your father's and mother's house to see whether you will be given gifts or not if you are telling the truth?\" Then the Prophet addressed us, and after praising and glorifying Allah, he said: \"Amma Ba'du\", I employ a man from among you to manage some affair of what Allah has put under my custody, and then he comes to me and says, 'This is your money and this has been given to me as a gift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? By Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of Resurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a mooing cow or a bleating sheep on meeting Allah.\" Then the Prophet raised both his hands till the whiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your Message)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).",
      "usc_msa_ref": "108",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-7262",
      "hadith_no": "7262",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، أنه سمع عروة، أخبرنا أبو حميد الساعدي، قال استعمل النبي صلى الله عليه وسلم رجلا من بني أسد يقال له ابن الأتبية على صدقة فلما قدم قال هذا لكم وهذا أهدي لي‏.‏ فقام النبي صلى الله عليه وسلم على المنبر  قال سفيان أيضا فصعد المنبر  فحمد الله وأثنى عليه ثم قال ‏\"‏ ما بال العامل نبعثه، فيأتي يقول هذا لك وهذا لي‏.‏ فهلا جلس في بيت أبيه وأمه فينظر أيهدى له أم لا، والذي نفسي بيده لا يأتي بشىء إلا جاء به يوم القيامة يحمله على رقبته، إن كان بعيرا له رغاء، أو بقرة لها خوار، أو شاة تيعر ‏\"‏‏.‏ ثم رفع يديه حتى رأينا عفرتى إبطيه ‏\"‏ ألا هل بلغت ‏\"‏ ثلاثا‏.‏ قال سفيان قصه علينا الزهري‏.‏ وزاد هشام عن أبيه عن أبي حميد قال سمع أذناى وأبصرته عيني، وسلوا زيد بن ثابت فإنه سمعه معي‏.‏ ولم يقل الزهري سمع أذني‏.‏ ‏{‏خوار‏}‏ صوت، والجؤار من تجأرون كصوت البقرة‏.‏",
      "text_en": " Narrated Abu Humaid Al-Sa`idi:                     The Prophet appointed a man from the tribe of Bani Asad, called Ibn Al-Utabiyya to collect the Zakat. When he returned (with the money) he said (to the Prophet), \"This is for you and this has been given to me as a gift.\" The Prophet stood up on the pulpit (Sufyan said he ascended the pulpit), and after glorifying and praising Allah, he said, \"What is wrong with the employee whom we send (to collect Zakat from the public) that he returns to say, 'This is for you and that is for me?' Why didn't he stay at his father's and mother's house to see whether he will be given gifts or not? By Him in Whose Hand my life is, whoever takes anything illegally will bring it on the Day of Resurrection by carrying it over his neck: if it is a camel, it will be grunting: if it is a cow, it will be mooing: and if it is a sheep it will be bleating!\" The Prophet then raised both his hands till we saw the whiteness of his armpits (and he said), \"No doubt! Haven't I conveyed Allah's Message?\" And he repeated it three times.",
      "usc_msa_ref": "286",
      "chain": [
        "30026",
        "20005",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-bukhari-7283",
      "hadith_no": "7283",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، حدثنا هشام بن عروة، عن أبيه، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم استعمل ابن الأتبية على صدقات بني سليم، فلما جاء إلى رسول الله صلى الله عليه وسلم وحاسبه قال هذا الذي لكم، وهذه هدية أهديت لي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وبيت أمك حتى تأتيك هديتك، إن كنت صادقا ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم فخطب الناس وحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فإني أستعمل رجالا منكم على أمور مما ولاني الله، فيأتي أحدكم فيقول هذا لكم وهذه هدية أهديت لي فهلا جلس في بيت أبيه وبيت أمه حتى تأتيه هديته إن كان صادقا، فوالله لا يأخذ أحدكم منها شيئا  قال هشام  بغير حقه إلا جاء الله يحمله يوم القيامة، ألا فلأعرفن ما جاء الله رجل ببعير له رغاء، أو ببقرة لها خوار، أو شاة تيعر ‏\"‏‏.‏ ثم رفع يديه حتى رأيت بياض إبطيه ‏\"‏ ألا هل بلغت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     The Prophet employed Ibn Al-Utbiyya to collect Zakat from Bani Sulaim, and when he returned (with the money) to Allah's Apostle the Prophet called him to account, and he said, \"This (amount) is for you, and this was given to me as a present.\" Allah's Apostle said, \"Why don't you stay at your father's house or your mother's house to see whether you will be given gifts or not, if you are telling the truth?\" Then Allah's Apostle stood up and addressed the people, and after glorifying and praising Allah, he said: Amma Ba'du (then after) I employ some men from among you for some job which Allah has placed in my charge, and then one of you comes to me and says, 'This (amount) is for you and this is a gift given to me.' Why doesn't he stay at the house of his father or the house of his mother and see whether he will be given gifts or not if he was telling the truth by Allah, none of you takes anything of it (i.e., Zakat) for himself (Hisham added: unlawfully) but he will meet Allah on the Day of Resurrection carrying it on his neck! I do not want to see any of you carrying a grunting camel or a mooing cow or a bleating sheep on meeting Allah.\" Then the Prophet raised both his hands till I saw the whiteness of his armpits, and said, \"(No doubt)! Haven't I conveyed Allah's Message!\"",
      "usc_msa_ref": "305",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-407-2",
      "hadith_no": "407",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا روح، وعبد الله بن نافع، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا روح، عن مالك بن أنس، عن عبد الله بن أبي بكر، عن أبيه، عن عمرو بن سليم، أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى أزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وعلى أزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid as-Sa'idi reported:                      They (the Companions of the Holy Prophet) said: Apostle of Allah, how should we bless you? He (the Holy Prophet) observed: Say:\" O Allah! bless Muhammad, his wives and his offspring as Thou didst bless Ibrahim, and grant favours to Muhammad, and his wives and his offspring as Thou didst grant favours to the family of Ibrahim; Thou art Praiseworthy and Glorious.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20229",
        "30411",
        "30123",
        "20229",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-3437",
      "hadith_no": "3437",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا سليمان بن بلال، عن عمرو بن يحيى، عن عباس بن سهل الساعدي، عن أبي حميد، قال خرجنا مع رسول الله صلى الله عليه وسلم في غزوة تبوك ‏.‏ وساق الحديث وفيه ثم أقبلنا حتى قدمنا وادي القرى فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني مسرع فمن شاء منكم فليسرع معي ومن شاء فليمكث ‏\"‏ ‏.‏ فخرجنا حتى أشرفنا على المدينة فقال ‏\"‏ هذه طابة وهذا أحد وهو جبل يحبنا ونحبه ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid (Allah be pleased with him) reported:                      We went out along with Allah's Messenger (may peace be upon him) in the expedition of Tabuk, and Humaid further related: We proceeded until we reached the valley of Qura; and Allah's Messenger (may peace be upon him) said: I am going forth, so he who among you wants to move fast with me may do so; and he who likes to go slowly may do so. We proceeded until Medina wag within our sight. and he said: This is Tibba (another name of Medina) ; this is Ubud, the mountain which loves us and we love it.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20160",
        "11210",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-4843",
      "hadith_no": "4843",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وابن أبي عمر، - واللفظ لأبي بكر - قالوا حدثنا سفيان بن عيينة، عن الزهري، عن عروة، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأسد يقال له ابن اللتبية - قال عمرو وابن أبي عمر على الصدقة - فلما قدم قال هذا لكم وهذا لي أهدي لي قال فقام رسول الله صلى الله عليه وسلم على المنبر فحمد الله وأثنى عليه وقال ‏\"‏ ما بال عامل أبعثه فيقول هذا لكم وهذا أهدي لي ‏.‏ أفلا قعد في بيت أبيه أو في بيت أمه حتى ينظر أيهدى إليه أم لا والذي نفس محمد بيده لا ينال أحد منكم منها شيئا إلا جاء به يوم القيامة يحمله على عنقه بعير له رغاء أو بقرة لها خوار أو شاة تيعر ‏\"‏ ‏.‏ ثم رفع يديه حتى رأينا عفرتى إبطيه ثم قال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Humaid as-Sa'idi who said:                      The Messenger of Allah (may peace be upon him) appointed a man from the Asad tribe who was called Ibn Lutbiyya in charge of Sadaqa (i. e. authorised hign to receive Sadaqa from the people on behalf of the State. When he returned (with the collictions), he said: This is for you and (this is mine as) it was presented to me as a gift. The narrator said: The Messenger of Allah (may peace be upod him) stood on the pulpit and praised God and extolled Him. Then he said: What about a State official whom I give an assignment and who (comes and) says: This is for you and this has been presented to me as a gift? Why didn't he remain in the house of his father or the house of his mother so that he could observe whether gifts were presented to him or not. By the Being in Whose Hand is the life of Muhammad, any one of you will not take anything from it but will bring it on the Day of Judgment, carrying on his neck a camel that will be growling, or a cow that will be bellowing or an ewe that will be bleating. Then he raised his hands so that we could see the whiteness of his armpits. Then he said twice: O God, I have conveyed (Thy Commandments).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30263",
        "30421",
        "20005",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-4844",
      "hadith_no": "4844",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، حدثنا معمر، عن الزهري، عن عروة، عن أبي حميد الساعدي، قال استعمل النبي صلى الله عليه وسلم ابن اللتبية - رجلا من الأزد - على الصدقة فجاء بالمال فدفعه إلى النبي صلى الله عليه وسلم فقال هذا مالكم وهذه هدية أهديت لي ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أفلا قعدت في بيت أبيك وأمك فتنظر أيهدى إليك أم لا ‏\"‏ ‏.‏ ثم قام النبي صلى الله عليه وسلم خطيبا ‏.‏ ثم ذكر نحو حديث سفيان ‏.‏",
      "text_en": " It has been reported on the authority of Abu Humaid as-Sa'idi who said:                      The Holy Prophet (may peace be upon him) appointed Ibn Lutbiyya, a man from the Azd tribe, in charge of Sadaqa (authorising him to receive gifts from the people on behalf of the State). He came with the collectio, gave it to the Holy Prophet (may peace be upon him). and said: This wealth is for you and this is a gift presented to me. The Holy Prophet (may peace be upon him) said to him: Why didn't you remain in the house of your father and your mother to see whether gifts were presented to you or not. Then he stood up to deliver a sermon. Here follows the tradition like the tradition of Sufyan.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-4845",
      "hadith_no": "4845",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأزد على صدقات بني سليم يدعى ابن الأتبية فلما جاء حاسبه قال هذا مالكم وهذا هدية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وأمك حتى تأتيك هديتك إن كنت صادقا ‏\"‏ ‏.‏ ثم خطبنا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فإني أستعمل الرجل منكم على العمل مما ولاني الله فيأتي فيقول هذا مالكم وهذا هدية أهديت لي ‏.‏ أفلا جلس في بيت أبيه وأمه حتى تأتيه هديته إن كان صادقا والله لا يأخذ أحد منكم منها شيئا بغير حقه إلا لقي الله تعالى يحمله يوم القيامة فلأعرفن أحدا منكم لقي الله يحمل بعيرا له رغاء أو بقرة لها خوار أو شاة تيعر ‏\"‏ ‏.‏ ثم رفع يديه حتى رئي بياض إبطيه ثم قال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ بصر عيني وسمع أذني ‏.‏",
      "text_en": " It has been reported on the authority of Abu Humaid as-Sa'idi who said:                      The Messenger of Allah (may peace be upon him) appointed a man from the Azd tribe. called Ibn al-, Utbiyya, in charge of Sadaqat to be received from Banu Sulaim. When he came (back), the Messenger of Allah (may peace be upon him) asked him to render his account. He said: This wealth is for you (i. e. for the public treasury) and this is a gift (presented to me). The Messenger of Allah (may peace be upon him) said: You should have remained in the house of your father and your mother, until your gift came to you if you spoke the truth; then he addressed us. He praised God and extolled Him, and afterwards said: I appoint a man from you to a responsible post sharing with the authority that God has entrusted to me, and he comes to me saying: This wealth is for you (i. e. for the public treasury) and this is a gift presented to me. Why did he not remain in the house of his father and his mother and his gift came to him, if he was truthful? By God, any one of you will not take anything from (the public funds) without any justification, but will meet his Lord carrying it on himself on the Day of judgment. I will recognise any one of you meeting Allah and carrying a growling camel, or a cow bellowing or a goat bleating. Then he raised his hands so high that whiteness of his armpits could be seen. Then he said: O my Lord, I have conveyed (Thy Commandments). The narrator says: My eyes saw (the Holy Prophet standing in that pose) and my ears heard (what he said).",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-5360",
      "hadith_no": "5360",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبد بن حميد، كلهم عن أبي عاصم، قال ابن المثنى حدثنا الضحاك، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر، بن عبد الله يقول أخبرني أبو حميد الساعدي، قال أتيت النبي صلى الله عليه وسلم بقدح لبن من النقيع ليس مخمرا فقال ‏\"‏ ألا خمرته ولو تعرض عليه عودا ‏\"‏ ‏.‏ قال أبو حميد إنما أمر بالأسقية أن توكأ ليلا وبالأبواب أن تغلق ليلا ‏.‏",
      "text_en": " Abu Humaid Sa'idi reported:                      I came to Allah's Messenger (may peace be upon him) with a cup of milk from Naqi' which had no cover over it, whereupon he said: Why did you not cover it? - even if you had covered it only with a stick. Abu Humaid said that he had been ordered that waterskins be tied during the night, and the doors be closed during the night.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "30553",
        "20241",
        "11070",
        "11263",
        "34",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-5361",
      "hadith_no": "5361",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني إبراهيم بن دينار، حدثنا روح بن عبادة، حدثنا ابن جريج، وزكرياء، بن إسحاق قالا أخبرنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرني أبو حميد، الساعدي أنه أتى النبي صلى الله عليه وسلم بقدح لبن ‏.‏ بمثله ‏.‏ قال ولم يذكر زكرياء قول أبي حميد بالليل ‏.‏",
      "text_en": " Abu Humaid Sa'idi reported through another chain of transmitters that he brought to Allah's Messenger (may peace be upon him) a cup containing milk, but there is no mention of the word\" in the night",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "20229",
        "11070",
        "11244",
        "11263",
        "34",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-6087",
      "hadith_no": "6087",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان بن بلال، عن عمرو بن يحيى، عن عباس بن سهل بن سعد الساعدي، عن أبي حميد، قال خرجنا مع رسول الله صلى الله عليه وسلم غزوة تبوك فأتينا وادي القرى على حديقة لامرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ اخرصوها ‏\"‏ ‏.‏ فخرصناها وخرصها رسول الله صلى الله عليه وسلم عشرة أوسق وقال ‏\"‏ أحصيها حتى نرجع إليك إن شاء الله ‏\"‏ ‏.‏ وانطلقنا حتى قدمنا تبوك فقال رسول الله صلى الله عليه وسلم ‏\"‏ ستهب عليكم الليلة ريح شديدة فلا يقم فيها أحد منكم فمن كان له بعير فليشد عقاله ‏\"‏ ‏.‏ فهبت ريح شديدة فقام رجل فحملته الريح حتى ألقته بجبلى طيئ وجاء رسول ابن العلماء صاحب أيلة إلى رسول الله صلى الله عليه وسلم بكتاب وأهدى له بغلة بيضاء فكتب إليه رسول الله صلى الله عليه وسلم وأهدى له بردا ثم أقبلنا حتى قدمنا وادي القرى فسأل رسول الله صلى الله عليه وسلم المرأة عن حديقتها ‏\"‏ كم بلغ ثمرها ‏\"‏ ‏.‏ فقالت عشرة أوسق ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني مسرع فمن شاء منكم فليسرع معي ومن شاء فليمكث ‏\"‏ ‏.‏ فخرجنا حتى أشرفنا على المدينة فقال ‏\"‏ هذه طابة وهذا أحد وهو جبل يحبنا ونحبه ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن خير دور الأنصار دار بني النجار ثم دار بني عبد الأشهل ثم دار بني عبد الحارث بن الخزرج ثم دار بني ساعدة وفي كل دور الأنصار خير ‏\"‏ ‏.‏ فلحقنا سعد بن عبادة فقال أبو أسيد ألم تر أن رسول الله صلى الله عليه وسلم خير دور الأنصار فجعلنا آخرا ‏.‏ فأدرك سعد رسول الله صلى الله عليه وسلم فقال يا رسول الله خيرت دور الأنصار فجعلتنا آخرا ‏.‏ فقال ‏\"‏ أوليس بحسبكم أن تكونوا من الخيار ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid as-Sa'idi reported:                      We went out with Allah's Messenger (may peace be upon him) on the expedition to Tabuk and we came to a wadi where there was a garden belonging to a woman. Allah's Apostle (may peace be upon him) said. Make an assessment (of the price of its fruit). And Allah's Messenger (may peace be upon him) also made an assessment and it was ten wasqs. He asked that lady (to calculate the amount) until they would, God willing, come back to her. So we proceeded on until we came to Tabuk and Allah's Messenger (may peace be upon him) said: The violent storm will overtake you during the night, so none amongst you should stand up and he who has a camel with him should hobble it firmly. A violent storm blew and a person who had stood up was carried away by the storm and thrown between the mountains of Tayy. Then the messenger of the son of al 'Alma', the ruler of Aila, came to Allah's Messenger (may peace be upon him) with a letter and a gift of a white mule. Allah's Messenger (may peace be upon him) wrote him (the reply) and presented him a cloak. We came back until we halted in the Wadi al-Qura. Allah's Messenger (may peace be upon him) asked that lady about her garden and the price of the fruits in that. She said: Ten wasqs. Thereupon Allah's Messenger (may peace be upon him) said: I am going to depart, and he who amongst you wishes may depart with me but he who wants to stay may stay. We resumed the journey until we came to the outskirts of Medina. (It was at this time) that Allah's Messenger (may peace be upon him) said: This is Taba, this is Uhud, that is a mountain which loves us and we love it, and then said: The best amongst the houses of the Ansar is the house of Bani Najjar. Then the house of Bani Abd al-Ashhal, then the house of Bani Abd al-Harith b. Khazraj, then the house of Bani Sa'ida, and there is goodness in all the houses of the Ansar. Said b. Ubada came to us and Abu Usaid said to him: Did you not see that Allah's Messenger (may peace be upon him) has declared the houses of the Ansar good and he has kept us at the end. Said met Allah's Messenger (may peace be upon him) and said: Allah's Messenger, you have declared the house of the Ansar as good and have kept us at the end, whereupon he said: Is it not enough for you that you have been counted amongst the good.",
      "usc_msa_ref": "",
      "chain": [
        "20160",
        "11210",
        "11697",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-735",
      "hadith_no": "735",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثني عتبة، حدثني عبد الله بن عيسى، عن العباس بن سهل الساعدي، عن أبي حميد، بهذا الحديث قال وإذا سجد فرج بين فخذيه غير حامل بطنه على شىء من فخذيه ‏.‏ قال أبو داود رواه ابن المبارك أخبرنا فليح سمعت عباس بن سهل يحدث فلم أحفظه فحدثنيه أراه ذكر عيسى بن عبد الله أنه سمعه من عباس بن سهل قال حضرت أبا حميد الساعدي بهذا الحديث ‏.‏",
      "text_en": " Abu Humaid reported to the same effect. He said:                      When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b. Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b. Sahl and Abu Humaid al-Sa’idi.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11361",
        "1457",
        "30002",
        "20025",
        "20169",
        "11697"
      ]
    },
    {
      "id": "sunan-abi-daud-963",
      "hadith_no": "963",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا عبد الحميد يعني ابن جعفر، ح وحدثنا مسدد، حدثنا يحيى، حدثنا عبد الحميد، - يعني ابن جعفر - حدثني محمد بن عمرو، عن أبي حميد الساعدي، قال سمعته في، عشرة من أصحاب رسول الله صلى الله عليه وسلم - وقال أحمد قال أخبرني محمد بن عمرو بن عطاء قال سمعت أبا حميد الساعدي في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة - قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فاعرض ‏.‏ فذكر الحديث ‏.‏ قال ويفتح أصابع رجليه إذا سجد ثم يقول الله أكبر ويرفع ويثني رجله اليسرى فيقعد عليها ثم يصنع في الأخرى مثل ذلك فذكر الحديث ‏.‏ قال حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ زاد أحمد قالوا صدقت هكذا كان يصلي ولم يذكرا في حديثهما الجلوس في الثنتين كيف جلس",
      "text_en": " Abu Humaid al-sa’idi said (in the presence of ten compansions of the prophet):                      I am more informed than any of you regarding the manner in which the Messenger of Allah (ﷺ) offered his prayer. They said: Present it. The narrator then reported the tradition, saying: he bent the toes of his feet turning them towards the Qiblah when he prostrated, then he uttered “ Allah is most great,” and raised (his head), and bent his left foot and sat on it, and he did the same in the second Rakah. The narrator then transmitted the tradition, and added: In the prostration (i.e., the Rakah) which ended at the salutation, he sat on the hips at the left side. ahmad (b. Hanbal) added: they said : You are right. This is how he used to pray. They (Ahmed and Musaddad) did not mention in their versions how he sat after offering two rak’ahs of prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20241",
        "11875",
        "30175",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-979",
      "hadith_no": "979",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، ح وحدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، أنه قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وأزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid al-Said said:                      Some people asked: Messenger of Allah, how should we invoke blessings on you? He said: Say,” O Allah, bless Muhammad, his wives and his off springs, as Thou didst bless Abraham’s family, and grant favours to Muhammad’s family, his wives and off springs, as Thou didst grant favours to Abraham’s family. Thou art indeed praiseworthy and glorious.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "30485",
        "20029",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-2946",
      "hadith_no": "2946",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، وابن أبي خلف، - لفظه - قالا حدثنا سفيان، عن الزهري، عن عروة، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم استعمل رجلا من الأزد يقال له ابن اللتبية - قال ابن السرح ابن الأتبية - على الصدقة فجاء فقال هذا لكم وهذا أهدي لي ‏.‏ فقام النبي صلى الله عليه وسلم على المنبر فحمد الله وأثنى عليه وقال ‏\"‏ ما بال العامل نبعثه فيجيء فيقول هذا لكم وهذا أهدي لي ‏.‏ ألا جلس في بيت أمه أو أبيه فينظر أيهدى له أم لا لا يأتي أحد منكم بشىء من ذلك إلا جاء به يوم القيامة إن كان بعيرا فله رغاء أو بقرة فلها خوار أو شاة تيعر ‏\"‏ ‏.‏ ثم رفع يديه حتى رأينا عفرة إبطيه ثم قال ‏\"‏ اللهم هل بلغت اللهم هل بلغت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Humaid al-Sa'idi:                     The Prophet (ﷺ) appointed a man of Azd called Ibn al-Lutbiyayah (to collect sadaqah). The narrator Ibn al-Sarh said: (He appointed) Ibn al-Utbiyyah to collect the sadaqah. When he returned he said: This is for you and this was given to me as present. So the Prophet (ﷺ) stood on the pulpit, and after praising and extolling Allah he said: What is the matter with a collector of sadaqah. We send him (to collect sadaqah), and when he return he says: This is for you and this is a present which was given to me. Why did he not sit in his father's or mother's house and see whether it would be given to him or not ? Whoever takes any of it will inevitably bring it on the Day of Resurrection, be it a camel which rumbles, an ox which bellows, or sheep which-bleats. Then raising his arms so that we could see where the hair grow under his armpits, he said: O Allah,  have I given full information ? O Allah, have I given full information ?",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-3079",
      "hadith_no": "3079",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب بن خالد، عن عمرو بن يحيى، عن العباس الساعدي، - يعني ابن سهل بن سعد - عن أبي حميد الساعدي، قال غزوت مع رسول الله صلى الله عليه وسلم تبوك فلما أتى وادي القرى إذا امرأة في حديقة لها فقال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ اخرصوا ‏\"‏ ‏.‏ فخرص رسول الله صلى الله عليه وسلم عشرة أوسق فقال للمرأة ‏\"‏ أحصي ما يخرج منها ‏\"‏ ‏.‏ فأتينا تبوك فأهدى ملك أيلة إلى رسول الله صلى الله عليه وسلم بغلة بيضاء وكساه بردة وكتب له - يعني - ببحره ‏.‏ قال فلما أتينا وادي القرى قال للمرأة ‏\"‏ كم كان في حديقتك ‏\"‏ ‏.‏ قالت عشرة أوسق خرص رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني متعجل إلى المدينة فمن أراد منكم أن يتعجل معي فليتعجل ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid Al Sa’idi said “I went to Tabuk on an expedition along with the Apostle of Allaah(ﷺ). When he reached Wadi Al Qura, he found a woman in her garden. The Apostle of Allaah(ﷺ) said to his Companions “Assess (the quantity o fruits). The Apostle of Allaah(ﷺ) assessed ten wasqs.” He said to the woman “Count the produce of it. We then came to Tabuk.” The monarch of Ailah presented a white mule as a gift to the Apostle of Allaah(ﷺ). He presented a cloak as a gift o him and wrote a document for his land at sea coast. When we came to Wadi Al Qura he said to the woman “How much is the produce of your garden?” She replied “Ten wasqs which the Apostle of Allaah(ﷺ) had assessed.” The Apostle of Allaah(ﷺ) said “I am going quickly to Madeenah if any of you intend to go quickly with me , he should make haste.”",
      "usc_msa_ref": "",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "id": "jami-al-tirmidhi-270",
      "hadith_no": "270",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عامر العقدي، حدثنا فليح بن سليمان، حدثني عباس بن سهل، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم كان إذا سجد أمكن أنفه وجبهته من الأرض ونحى يديه عن جنبيه ووضع كفيه حذو منكبيه ‏.‏ قال وفي الباب عن ابن عباس ووائل بن حجر وأبي سعيد ‏.‏ قال أبو عيسى حديث أبي حميد حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم أن يسجد الرجل على جبهته وأنفه فإن سجد على جبهته دون أنفه فقد قال قوم من أهل العلم يجزئه ‏.‏ وقال غيرهم لا يجزئه حتى يسجد على الجبهة والأنف ‏.‏",
      "text_en": " Abu Humaid As-Sa'idi narrated:                     \"When the Prophet would prostrate, he placed his nose and his forehead on the ground, and he held his forearms away from his sides, and he placed his hands parallel to his shoulders.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "20169",
        "11697",
        "1457"
      ]
    },
    {
      "id": "jami-al-tirmidhi-304",
      "hadith_no": "304",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد القطان، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته وهو، في عشرة من أصحاب النبي صلى الله عليه وسلم أحدهم أبو قتادة بن ربعي يقول أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا ما كنت أقدمنا له صحبة ولا أكثرنا له إتيانا قال بلى ‏.‏ قالوا فاعرض ‏.‏ فقال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة اعتدل قائما ورفع يديه حتى يحاذي بهما منكبيه فإذا أراد أن يركع رفع يديه حتى يحاذي بهما منكبيه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ وركع ثم اعتدل فلم يصوب رأسه ولم يقنع ووضع يديه على ركبتيه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ورفع يديه واعتدل حتى يرجع كل عظم في موضعه معتدلا ثم أهوى إلى الأرض ساجدا ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم جافى عضديه عن إبطيه وفتخ أصابع رجليه ثم ثنى رجله اليسرى وقعد عليها ثم اعتدل حتى يرجع كل عظم في موضعه معتدلا ثم أهوى ساجدا ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم ثنى رجله وقعد واعتدل حتى يرجع كل عظم في موضعه ثم نهض ثم صنع في الركعة الثانية مثل ذلك حتى إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ثم صنع كذلك حتى كانت الركعة التي تنقضي فيها صلاته أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال ومعنى قوله ورفع يديه إذا قام من السجدتين يعني قام من الركعتين ‏.‏",
      "text_en": " Muhammad bin Amr bin Ata' narrated from Abu Humaid As-Saidi, :                     he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi - 'I am the most knowledgeable among you of the Salat of the Allah's Messenger.' They said: 'You did not precede us in his companionship, nor were you in his company more than us.' He said: 'Even still.\" They said: 'Go ahead.' So he said: 'When Allah's Messenger stood for Salat he would stand with his back straight and raise his hands until they were at the level of his shoulder. Then he would say: (Allahu Akbar) \"Allah is Most Great\" and bow. Then he would straighten (his back) so that he would not lower his head, nor raise it, and he placed his hands on his knees. Then he said: (Sami Allahu liman hamidah) \"Allah listens to those who praise Him.\" And he raised his hands and stood up straight until all of his bones completely returned to their places. Then he went down to the ground prostrating, then he said: (Allahu Akbar) \"Allah is Most Great.\" Then he held his upper arms away from his midsection, and opened his toes on his feet (facing the Qiblah), then he bend his left foot and sat on it then straightened up until all of his bones completely returned to their placed, then he went down to prostrate. Then he said: (Allahu Akbar) \"Allah is Most Great,\" then he bent his foot and sat and straightened up until all of his bones completely returned to their places. Then he got up. Then in the second Rak'ah he did the same as that, such that when he stood from the two prostrations, he sad the Takbir and raised his hands until they were at the level of his shoulders as he did when he opened the Salat. Then he did like that until it was the Rak'ah in which his Salat was to end, when he moved his left foot over and sat on his side (in the Mutawarrik postion). Then he said the Taslim.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30170",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-an-nasai-1039",
      "hadith_no": "1039",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا ركع اعتدل فلم ينصب رأسه ولم يقنعه ووضع يديه على ركبتيه ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"When the Prophet (ﷺ) bowed he was balanced, he did not make his head higher or lower than his back, and he put his hands on his knees.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-an-nasai-1101",
      "hadith_no": "1101",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا أهوى إلى الأرض ساجدا جافى عضديه عن إبطيه وفتخ أصابع رجليه ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"When the Prophet (ﷺ) fell to the ground during prostration, he held his arms away from his sides and bent his toes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11875",
        "1457"
      ]
    },
    {
      "id": "sunan-an-nasai-1181",
      "hadith_no": "1181",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته يحدث، قال كان النبي صلى الله عليه وسلم إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that:                     When the Prophet (ﷺ) stood up following two prostrations, he would say the takbir and raise his hands until they were level with his shoulders, as he had done at the beginning of the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-an-nasai-1262",
      "hadith_no": "1262",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، بندار - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا كان في الركعتين اللتين تنقضي فيهما الصلاة أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"At the end of the last two rak'ahs of the prayer, the Prophet (ﷺ) would move his left foot forward and sit on his left buttock, Mutawarrikan, then he would say the taslim.",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-an-nasai-1294",
      "hadith_no": "1294",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك فقال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته ‏\"‏ ‏.‏ في حديث الحارث ‏\"‏ كما صليت على آل إبراهيم وبارك على محمد وأزواجه وذريته ‏\"‏ ‏.‏ قالا جميعا ‏\"‏ كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال أبو عبد الرحمن أنبأنا قتيبة بهذا الحديث مرتين ولعله أن يكون قد سقط عليه منه شطر ‏.‏",
      "text_en": " It was narrated that 'Amr bin Sulam Az-Zuraqi said:                     \"Abu Humaid As-Sa'idi told me that they said: 'O Messenger of Allah (ﷺ), how should we send salah upon you?' The Messenger of Allah (ﷺ) said: 'Say: Allahumma sali 'ala Muhammadin wa azwajihi wa dhuriyatihi ( O Allah, send salah upon Muhamad and his wives and progeny)- in the narration of Al-Harith (one of the two who narrated it)-kama salaita 'ala Ibraim wa barik 'alaMuhammad wa azwajihi wa dhuriyatti (as You sent salah upon Irahim and send blessings upon Muhammad and his wives and progeny)- both of them said that- kama barakta 'ala ali Ibrahima innaka hamidun majid (as You sent blessings upon Ibrahim, You are indeed worthy of praise, Full of glory.)\" Abu Abdur-Rahman (An-Nasa'i) said: Qutaibah informed us of this hadith two times, and perhaps he had missed a part of it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sunan-ibn-majah-772",
      "hadith_no": "772",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، وعبد الوهاب بن الضحاك، قالا حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دخل أحدكم المسجد فليسلم على النبي  صلى الله عليه وسلم  ثم ليقل اللهم افتح لي أبواب رحمتك ‏.‏ وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"The Messenger of Allah said: 'When anyone of you enters the mosque, let him send peace upon the prophet, then let him say: \"Allahummaftah li abwaba rahmatika (O Allah, open to me the gates of Your mercy).\" And when he leaves, let him say: \"Allahumma inni as'aluka min fadlika. (O Allah, I ask of you from Your bounty).\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "38361",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    },
    {
      "id": "sunan-ibn-majah-852",
      "hadith_no": "852",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد الطنافسي، حدثنا أبو أسامة، حدثني عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، يقول كان رسول الله  صلى الله عليه وسلم  إذا قام إلى الصلاة استقبل القبلة ورفع يديه وقال ‏\"‏ الله أكبر ‏\"‏ ‏.‏",
      "text_en": " Muhammadbin ‘Amr bin ‘Ata’ said:                      “I heard Abu Humaid As-Sa’idi say:‘When the Messenger of Allah (ﷺ) stood up for prayer, he wouldfacethe prayer direction, raise his hands, and say: “Allahu Akbar(Allahis Most Great).”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20318",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-ibn-majah-911",
      "hadith_no": "911",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته وهو، في عشرة من أصحاب رسول الله  صلى الله عليه وسلم  أحدهم أبو قتادة بن ربعي قال أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  كان إذا قام في الصلاة اعتدل قائما ورفع يديه حتى يحاذي بهما منكبيه ثم قال ‏\"‏ الله أكبر ‏\"‏ ‏.‏ وإذا أراد أن يركع رفع يديه حتى يحاذي بهما منكبيه فإذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ رفع يديه فاعتدل فإذا قام من الثنتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It wasnarrated that Muhammad bin ‘Amr bin ‘Ata’ said, concerning AbuHumaid As-Sa’di:                      “I heard him when he was among ten of theCompanionsof the Messenger of Allah (ﷺ), one of whom was AbuQatadah binRib’i, saying: ‘I am the most knowledgeable of youabout the Messengerof Allah (ﷺ). When he stood up for prayer, hestood up straight andraised his hands until they were parallel tohis shoulders, then hesaid: Allahu Akbar. When he wanted to bow inRuku’, he raised hishands until they were parallel to hisshoulders. When he said Sami’Allahu liman hamidah (Allah hearsthose who praise Him), he raised hishands and stood up straight.When he stood up after two Rak’ah, hesaid Allahu Akbar and raisedhis hands until they were parallel to hisshoulders, as he did whenhe started the prayer.’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-ibn-majah-958",
      "hadith_no": "958",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عمار بن طالوت، حدثنا عبد الملك بن عبد العزيز الماجشون، حدثنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، عن أبي حميد الساعدي، أنهم قالوا يا رسول الله أمرنا بالصلاة عليك فكيف نصلي عليك فقال ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته كما صليت على إبراهيم وبارك على محمد وأزواجه وذريته كما باركت على آل إبراهيم في العالمين إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Humaid As-Sa’di that they said:                      “O MessengerofAllah! We have been commanded to send peace and blessings upon you.How should we send peace and blessings upon you?” He said: “Say:Allahumma salli ‘ala Muhammadin wa azwajihi wa dhurriyatihi, kamasallayta ‘ala Ibrahim; wa barik ‘ala Muhammadin wa azwajihi wadhurriyatihi kama barakta ‘ala ali Ibrahim fil-‘alamin, innakaHamidumMajid (O Allah, send Your grace, honour and mercy uponMuhammad andhis wives and offspring, as You sent Your grace, honourand mercy uponIbrahim. O Allah, send Your blessings upon Muhammadand his wives andoffspring, as You sent Your blessings upon thefamily of Ibrahim amongthe nations, You are indeed Praiseworthy,Most Glorious).”",
      "usc_msa_ref": "",
      "chain": [
        "38418",
        "22136",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sunan-ibn-majah-2225",
      "hadith_no": "2225",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد الأنصاري، عن أبي حميد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أجملوا في طلب الدنيا فإن كلا ميسر لما خلق له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that the Messenger of Allah (ﷺ) said:                     Be moderate in seeking worldly things, for everyone will be facilitated for which he was created.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20736",
        "11894",
        "11162",
        "1457"
      ]
    }
  ],
  "total_hadiths": 39
}