{
  "id": "149",
  "name": "Khabbab ibn al-Aratt ( خباب بن الأرت ( رضي الله عنه",
  "full_name": "Khabbab ibn al-Aratt ( خباب بن الأرت ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Nejd"
    },
    "death": {
      "date_hijri": "37",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Ally B.Zuhrah",
      "B.Tamim",
      "Early Muslim",
      "Tortured",
      "Emigrant",
      "Badr",
      "Uhud"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "2233",
      "name": "Mulayka wife Khabbab ( مليكة امرأة خباب بن الأرت ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "2230",
      "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "2231",
      "name": "'Abdur Rahman bin Khabbab ibn al-Aratt ( عبد الرحمن بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2232",
      "name": "Zaynab bint Khabbab ibn al-Aratt ( زينب بنت خباب بن الأرت ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2230",
      "name": "'Abdullah bin Khabbab ibn al-Aratt ( عبد الله بن خباب بن الأرت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "5130",
      "name": "'Abdullah bin al-Shakhayr ( عبد الله بن الشخير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "19801",
      "name": "Harithh bin Mdrb حارثة بن مضرب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15691",
      "name": "Abu al-Knwd al-Azdy al-Kwfy أبو الكنود الأزدي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15692",
      "name": "Abu Lyla al-Kndy أبو ليلى الكندي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1276",
      "hadith_no": "1276",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، حدثنا خباب  رضى الله عنه  قال هاجرنا مع النبي صلى الله عليه وسلم نلتمس وجه الله، فوقع أجرنا على الله، فمنا من مات لم يأكل من أجره شيئا منهم مصعب بن عمير، ومنا من أينعت له ثمرته فهو يهدبها‏.‏ قتل يوم أحد، فلم نجد ما نكفنه إلا بردة إذا غطينا بها رأسه خرجت رجلاه، وإذا غطينا رجليه خرج رأسه، فأمرنا النبي صلى الله عليه وسلم أن نغطي رأسه، وأن نجعل على رجليه من الإذخر‏.‏",
      "text_en": " Narrated Khabbab:                     We emigrated with the Prophet (p.b.u.h) in Allah's cause, and so our reward was then surely incumbent on Allah. Some of us died and they did not take anything from their rewards in this world, and amongst them was Mustab bin `Umar; and the others were those who got their rewards. Mustab bin `Umar was martyred on the day of the Battle of Uhud and we could get nothing except his Burd to shroud him in. And when we covered his head his feet became bare and vice versa. So the Prophet ordered us to cover his head only and to put idhkhir (a kind of shrub) over his feet.",
      "usc_msa_ref": "366",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-2091",
      "hadith_no": "2091",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن سليمان، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية، وكان لي على العاص بن وائل دين، فأتيته أتقاضاه قال لا أعطيك حتى تكفر بمحمد صلى الله عليه وسلم‏.‏ فقلت لا أكفر حتى يميتك الله، ثم تبعث‏.‏ قال دعني حتى أموت وأبعث، فسأوتى مالا وولدا فأقضيك فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا ‏}‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith in the Pre-Islamic period, and 'Asi bin Wail owed me some money, so I went to him to demand it. He said (to me), \"I will not pay you unless you disbelieve Muhammad.\" I said, \"I will not disbelieve till Allah kills you and then you get resurrected.\" He said, \"Leave me till I die and get resurrected, then I will be given wealth and children and I will pay you your debt.\" On that occasion it was revealed to the Prophet: 'Have you seen him who disbelieved in Our signs and says: Surely I will be given wealth and children? Has he known the unseen, or has he taken a covenant from the Beneficent (Allah)? (19.77- 78)",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-2275",
      "hadith_no": "2275",
      "source": "Sahih Bukhari",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن مسلم، عن مسروق، حدثنا خباب، قال كنت رجلا قينا فعملت للعاص بن وائل فاجتمع لي عنده فأتيته أتقاضاه فقال لا والله لا أقضيك حتى تكفر بمحمد‏.‏ فقلت أما والله حتى تموت ثم تبعث فلا‏.‏ قال وإني لميت ثم مبعوث قلت نعم‏.‏ قال فإنه سيكون لي ثم مال وولد فأقضيك‏.‏ فأنزل الله تعالى ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my work, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in Muhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I be dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and offspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who disbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)",
      "usc_msa_ref": "475",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-2425",
      "hadith_no": "2425",
      "source": "Sahih Bukhari",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير بن حازم، أخبرنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية وكان لي على العاص بن وائل دراهم، فأتيته أتقاضاه فقال لا أقضيك حتى تكفر بمحمد، فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله ثم يبعثك‏.‏ قال فدعني حتى أموت ثم أبعث فأوتى مالا وولدا، ثم أقضيك‏.‏ فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ الآية‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith In the Pre-Islamic period of ignorance, and 'Asi bin Wail owed me some money. I went to him to demand it, but he said to me, \"I will not pay you unless you reject faith in Muhammad.\" I replied, \"By Allah, I will never disbelieve Muhammad till Allah let you die and then resurrect you.\" He said, \"Then wait till I die and come to life again, for then I will be given property and offspring and will pay your right.\" So, thus revelation came: \"Have you seen him who disbelieved in Our signs and yet says, 'I will be given property and offspring?' \" (19.77)",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-3655",
      "hadith_no": "3655",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، عن إسماعيل، حدثنا قيس، عن خباب بن الأرت، قال شكونا إلى رسول الله صلى الله عليه وسلم وهو متوسد بردة له في ظل الكعبة، قلنا له ألا تستنصر لنا ألا تدعو الله لنا قال ‏\"‏ كان الرجل فيمن قبلكم يحفر له في الأرض فيجعل فيه، فيجاء بالمنشار، فيوضع على رأسه فيشق باثنتين، وما يصده ذلك عن دينه، ويمشط بأمشاط الحديد، ما دون لحمه من عظم أو عصب، وما يصده ذلك عن دينه، والله ليتمن هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت، لا يخاف إلا الله أو الذئب على غنمه، ولكنكم تستعجلون ‏\"‏‏.‏",
      "text_en": " Narrated Khabbab bin Al-Arat:                     We complained to Allah's Apostle (of the persecution inflicted on us by the infidels) while he was sitting in the shade of the Ka`ba, leaning over his Burd (i.e. covering sheet). We said to him, \"Would you seek help for us? Would you pray to Allah for us?\" He said, \"Among the nations before you a (believing) man would be put in a ditch that was dug for him, and a saw would be put over his head and he would be cut into two pieces; yet that (torture) would not make him give up his religion. His body would be combed with iron combs that would remove his flesh from the bones and nerves, yet that would not make him abandon his religion. By Allah, this religion (i.e. Islam) will prevail till a traveler from Sana (in Yemen) to Hadrarmaut will fear none but Allah, or a wolf as regards his sheep, but you (people) are hasty.",
      "usc_msa_ref": "809",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-3900",
      "hadith_no": "3900",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا بيان، وإسماعيل، قالا سمعنا قيسا، يقول سمعت خبابا، يقول أتيت النبي صلى الله عليه وسلم وهو متوسد بردة، وهو في ظل الكعبة، وقد لقينا من المشركين شدة فقلت ألا تدعو الله فقعد وهو محمر وجهه فقال ‏\"‏ لقد كان من قبلكم ليمشط بمشاط الحديد ما دون عظامه من لحم أو عصب ما يصرفه ذلك عن دينه، ويوضع المنشار على مفرق رأسه، فيشق باثنين، ما يصرفه ذلك عن دينه، وليتمن الله هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت ما يخاف إلا الله ‏\"‏‏.‏ زاد بيان والذئب على غنمه‏.‏",
      "text_en": " Narrated Khabbaba:                     I came to the Prophet while he was leaning against his sheet cloak in the shade of the Ka`ba. We were suffering greatly from the pagans in those days. i said (to him). \"Will you invoke Allah (to help us)?\" He sat down with a red face and said, \"(A believer among) those who were before you used to be combed with iron combs so that nothing of his flesh or nerves would remain on his bones; yet that would never make him desert his religion. A saw might be put over the parting of his head which would be split into two parts, yet all that would never make him abandon his religion. Allah will surely complete this religion (i.e. Islam) so that a traveler from Sana to Hadra-maut will not be afraid of anybody except Allah.\" (The sub-narrator, Baiyan added, \"Or the wolf, lest it should harm his sheep.\")",
      "usc_msa_ref": "191",
      "chain": [
        "30418",
        "20005",
        "11326",
        "20208",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-3961",
      "hadith_no": "3961",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Khabbab:                     We migrated with Allah's Apostle (See Hadith No. 253 below).",
      "usc_msa_ref": "252",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-3962",
      "hadith_no": "3962",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وحدثنا مسدد، حدثنا يحيى، عن الأعمش، قال سمعت شقيق بن سلمة، قال حدثنا خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله، ووجب أجرنا على الله، فمنا من مضى لم يأكل من أجره شيئا، منهم مصعب بن عمير، قتل يوم أحد فلم نجد شيئا نكفنه فيه، إلا نمرة كنا إذا غطينا بها رأسه خرجت رجلاه، فإذا غطينا رجليه خرج رأسه، فأمرنا رسول الله صلى الله عليه وسلم أن نغطي رأسه بها، ونجعل على رجليه من إذخر، ومنا من أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": " Narrated Khabbab:                     We migrated with Allah's Apostle seeking Allah's Countenance, so our rewards became due and sure with Allah. Some of us passed away without eating anything of their rewards in this world. One of these was Mus`ab bin `Umar who was martyred on the day of the battle of Uhud. We did not find anything to shroud his body with except a striped cloak. When we covered his head with it, his feet remained uncovered, and when we covered his feet with it, his head remained uncovered. So Allah's Apostle ordered us to cover his head with it and put some Idhkhir (i.e. a kind of grass) over his feet. And there are some amongst us whose fruits have ripened and they are collecting them (i.e. they have received their rewards in this world).",
      "usc_msa_ref": "253",
      "chain": [
        "30175",
        "20031",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4097",
      "hadith_no": "4097",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأعمش، عن شقيق، عن خباب  رضى الله عنه  قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله، فوجب أجرنا على الله، ومنا من مضى أو ذهب لم يأكل من أجره شيئا، كان منهم مصعب بن عمير قتل يوم أحد، لم يترك إلا نمرة، كنا إذا غطينا بها رأسه خرجت رجلاه، وإذا غطي بها رجلاه خرج رأسه، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ غطوا بها رأسه، واجعلوا على رجله الإذخر  أو قال ألقوا على رجله من الإذخر ‏\"‏‏.‏ ومنا من قد أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": "      Narrated Khabbab bin Al-Art:                          We migrated in the company of Allah's Apostle, seeking Allah's      Pleasure. So our reward became due and sure with Allah. Some of us      have been dead without enjoying anything of their rewards (here), and      one of them was Mus'ab bin 'Umar who was martyred on the day of the      battle of Uhud, and did not leave anything except a Namira (i.e. a      sheet in which he was shrouded). If we covered his head with it, his      feet became naked, and if we covered his feet with it, his head became     naked. So the Prophet said to us, \"Cover his head with it and put some     Idhkhir (i.e. a kind of grass) over his feet or throw Idhkhir over his     feet.\" But some amongst us have got the fruits of their labor ripened,     and they are collecting them.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4131",
      "hadith_no": "4131",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأعمش، عن شقيق، عن خباب  رضى الله عنه  قال هاجرنا مع النبي صلى الله عليه وسلم ونحن نبتغي وجه الله، فوجب أجرنا على الله، فمنا من مضى أو ذهب لم يأكل من أجره شيئا، كان منهم مصعب بن عمير قتل يوم أحد، فلم يترك إلا نمرة كنا إذا غطينا بها رأسه خرجت رجلاه، وإذا غطي بها رجلاه خرج رأسه، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ غطوا بها رأسه، واجعلوا على رجليه الإذخر ‏\"‏‏.‏ أو قال ‏\"‏ ألقوا على رجليه من الإذخر ‏\"‏‏.‏ ومنا من أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": " Narrated Khabbab:                     We migrated with the Prophet for Allah's Cause, so our reward became due with Allah. Some of us passed away (i.e. died) without enjoying anything from their reward, and one of them was Mus`ab bin `Umar who was killed (i.e. martyred) on the day of Uhud. He did not leave behind except a sheet of striped woolen cloth. If we covered his head with it, his feet became naked, and if we covered his feet with it, his head became naked. The Prophet said to us, \"Cover his head with it and put Idhkhir (i.e. a kind of grass) over his feet,\" or said, \"Put some Idhkhir over his feet.\" But some of us have got their fruits ripened, and they are collecting them.",
      "usc_msa_ref": "408",
      "chain": [
        "30184",
        "20321",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4779",
      "hadith_no": "4779",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، قال سمعت خبابا، قال جئت العاصي بن وائل السهمي أتقاضاه حقا لي عنده، فقال لا أعطيك حتى تكفر بمحمد فقلت لا حتى تموت ثم تبعث‏.‏ قال وإني لميت ثم مبعوث قلت نعم‏.‏ قال إن لي هناك مالا وولدا فأقضيكه، فنزلت هذه الآية ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ رواه الثوري وشعبة وحفص وأبو معاوية ووكيع عن الأعمش‏.‏",
      "text_en": " Narrated Khabbab:                     I came to Al-`Asi bin Wail As-Sahmi and demanded something which he owed me. He said, \"I will not give you (your money) till you disbelieve in Muhammad.\" I said, \"No, I shall not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I die and then be resurrected?\" I said, 'Yes'. He said', \"Then I will have wealth and children there, and I will pay you (there).\" So this Verse was revealed:-- 'Have you then seen him who disbelieved in Our Signs and (yet) says: I shall certainly be given wealth and children? (19.77)",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4780",
      "hadith_no": "4780",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا بمكة، فعملت للعاصي بن وائل السهمي سيفا، فجئت أتقاضاه فقال لا أعطيك حتى تكفر بمحمد‏.‏ قلت لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله، ثم يحييك‏.‏ قال إذا أماتني الله ثم بعثني، ولي مال وولد فأنزل الله ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا‏}‏‏.‏ قال موثقا‏.‏ لم يقل الأشجعي عن سفيان سيفا ولا موثقا‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith in Mecca Once I made a sword for Al-`Asi bin Wail As-Sahmi. When I went to demand its price, he said, \"I will not give it to you till you disbelieve in Muhammad.\" I said, \"I shall not disbelieve in Muhammad till Allah make you die and then bring you to life again.\" He said, \"If Allah should make me die and then resurrect me and I would have wealth and children.\" So Allah revealed:-- 'Have you seen him who disbelieved in Our Signs, and (yet) says I shall certainly be given wealth and children? Has he known the unseen or has he taken a covenant from (Allah) the Beneficent?' (19.77- 78)",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4781",
      "hadith_no": "4781",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، سمعت أبا الضحى، يحدث عن مسروق، عن خباب، قال كنت قينا في الجاهلية، وكان لي دين على العاصي بن وائل قال فأتاه يتقاضاه، فقال لا أعطيك حتى تكفر بمحمد فقال والله لا أكفر حتى يميتك الله ثم تبعث‏.‏ قال فذرني حتى أموت ثم أبعث، فسوف أوتى مالا وولدا، فأقضيك فنزلت هذه الآية ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏",
      "text_en": " Narrated Masruq:                     Khabbab said, \"During the pre-lslamic period, I was a blacksmith and Al-Asi bin Wail owed me a debt.\" So Khabbab went to him to demand the debt. He said, \"I will not give you (your due) till you disbelieve in Muhammad.\" Khabbab said, \"By Allah, I shall not disbelieve in Muhammad till Allah makes you die and then resurrects you.\" Al-Asi said, \"So leave me till I die and then be resurrected, for I will be given wealth and children whereupon I will pay you your debt.\" So this Verse was revealed:-- 'Have you seen him who disbelieved in Our Signs and, (yet) says: I shall certainly be given wealth and children.' (19.77)",
      "usc_msa_ref": "258",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4782",
      "hadith_no": "4782",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت رجلا قينا، وكان لي على العاصي بن وائل دين فأتيته أتقاضاه، فقال لي لا أقضيك حتى تكفر بمحمد‏.‏ قال قلت لن أكفر به حتى تموت ثم تبعث‏.‏ قال وإني لمبعوث من بعد الموت فسوف أقضيك إذا رجعت إلى مال وولد‏.‏ قال فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا * أطلع الغيب أم اتخذ عند الرحمن عهدا * كلا سنكتب ما يقول ونمد له من العذاب مدا * ونرثه ما يقول ويأتينا فردا‏}‏‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith and Al-Asi Bin Wail owed me a debt, so I went to him to demand it. He said to me. \"I will not pay you your debt till you disbelieve in Muhammad.\" I said, \"I will not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I be resurrected after my death? If so, I shall pay you (there) if I should find wealth and children.\" So there was revealed:-- 'Have you seen him who disbelieved in Our Signs, and yet says: I shall certainly be given wealth and children? Has he, known to the unseen or has he taken a covenant from (Allah) the Beneficent? Nay ! We shall record what he says, and we shall add and add to his punishment. And We shall inherit from him all that he talks of, and he shall appear before Us alone.' (19.77-80)",
      "usc_msa_ref": "",
      "chain": [
        "30020",
        "20032",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-6506",
      "hadith_no": "6506",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن موسى، حدثنا وكيع، حدثنا إسماعيل، عن قيس، قال سمعت خبابا، وقد اكتوى يومئذ سبعا في بطنه وقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت بالموت، إن أصحاب محمد صلى الله عليه وسلم مضوا ولم تنقصهم الدنيا بشىء، وإنا أصبنا من الدنيا ما لا نجد له موضعا إلا التراب‏.‏",
      "text_en": " Narrated Qais:                     I heard Khabbab, who had branded his `Abdomen with seven brands, saying, \"Had Allah's Apostle not forbidden us to invoke Allah for death, I would have invoked Allah for death. The companions of Muhammad have left this world without taking anything of their reward in it (i.e., they will have perfect reward in the Hereafter), but we have collected of the worldly wealth what we cannot spend but on earth (i.e. on building houses).",
      "usc_msa_ref": "438",
      "chain": [
        "30221",
        "20032",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-6508",
      "hadith_no": "6508",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن الأعمش، عن أبي وائل، عن خباب   رضى الله عنه  قال هاجرنا مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Khabbab:                     We migrated with the Prophet..(This narration is related in the chapter of migration).",
      "usc_msa_ref": "440",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-7029",
      "hadith_no": "7029",
      "source": "Sahih Bukhari",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل، حدثنا قيس، عن خباب بن الأرت، قال شكونا إلى رسول الله صلى الله عليه وسلم وهو متوسد بردة له في ظل الكعبة فقلنا ألا تستنصر لنا ألا تدعو لنا‏.‏ فقال ‏\"‏ قد كان من قبلكم يؤخذ الرجل فيحفر له في الأرض فيجعل فيها، فيجاء بالمنشار فيوضع على رأسه فيجعل نصفين، ويمشط بأمشاط الحديد ما دون لحمه وعظمه، فما يصده ذلك عن دينه، والله ليتمن هذا الأمر، حتى يسير الراكب من صنعاء إلى حضرموت لا يخاف إلا الله والذئب على غنمه، ولكنكم تستعجلون ‏\"‏‏.‏",
      "text_en": " Narrated Khabbab bin Al-Art:                     We complained to Allah's Apostle (about our state) while he was leaning against his sheet cloak in the shade of the Ka`ba. We said, \"Will you ask Allah to help us? Will you invoke Allah for us?\" He said, \"Among those who were before you a (believer) used to be seized and, a pit used to be dug for him and then he used to be placed in it. Then a saw used to be brought and put on his head which would be split into two halves. His flesh might be combed with iron combs and removed from his bones, yet, all that did not cause him to revert from his religion. By Allah! This religion (Islam) will be completed (and triumph) till a rider (traveler) goes from San`a' (the capital of Yemen) to Hadramout fearing nobody except Allah and the wolf lest it should trouble his sheep, but you are impatient.\" (See Hadith No. 191, Vol. 5)",
      "usc_msa_ref": "76",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sahih-muslim-1436",
      "hadith_no": "1436",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن سعيد بن وهب، عن خباب، قال شكونا إلى رسول الله صلى الله عليه وسلم الصلاة في الرمضاء فلم يشكنا ‏.‏",
      "text_en": " Khabbab reported:                      We complained to the Messenger of Allah (may peace be upon him) (the difficulty of) saying prayer on the intensely heated (ground or sand), but he paid no heed to our complaint.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11049",
        "10768",
        "149"
      ]
    },
    {
      "id": "sahih-muslim-1437",
      "hadith_no": "1437",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أحمد بن يونس، وعون بن سلام، - قال عون أخبرنا وقال ابن يونس، واللفظ، له حدثنا زهير، - قال حدثنا أبو إسحاق، عن سعيد بن وهب، عن خباب، قال أتينا رسول الله صلى الله عليه وسلم فشكونا إليه حر الرمضاء فلم يشكنا ‏.‏ قال زهير قلت لأبي إسحاق أفي الظهر قال نعم ‏.‏ قلت أفي تعجيلها قال نعم ‏.‏",
      "text_en": " Khabbab reported:                      We came to the Messenger of Allah (may peace be upon him) and we complained to the Messenger of Allah (may peace be upon him) about (saying prayer) on the extremely heated ground (or sand), but he paid no heed to us. Zuhair said: I asked Abu Ishaq whether it was about the noon prayer. He said: Yes. I again said whether it concerned the (offering) of the noon (prayer) in earlier hours. He said: Yes. I said: Did it concern expediting it? He said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "30474",
        "20321",
        "11049",
        "10768",
        "149"
      ]
    },
    {
      "id": "sahih-muslim-2220",
      "hadith_no": "2220",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، وأبو بكر بن أبي شيبة ومحمد بن عبد الله بن نمير وأبو كريب - واللفظ ليحيى قال يحيى أخبرنا وقال الآخرون، حدثنا أبو معاوية، - عن الأعمش، عن شقيق، عن خباب بن الأرت، قال هاجرنا مع رسول الله صلى الله عليه وسلم في سبيل الله نبتغي وجه الله فوجب أجرنا على الله فمنا من مضى لم يأكل من أجره شيئا منهم مصعب بن عمير ‏.‏ قتل يوم أحد فلم يوجد له شىء يكفن فيه إلا نمرة فكنا إذا وضعناها على رأسه خرجت رجلاه وإذا وضعناها على رجليه خرج رأسه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ضعوها مما يلي رأسه واجعلوا على رجليه الإذخر ‏\"‏ ‏.‏ ومنا من أينعت له ثمرته فهو يهدبها ‏.‏",
      "text_en": " Khabbab al-Aratt reported:                      We migrated with the Messenger of Allah (may peace be upon him) in the path of Allah seeking Allah's pleasure alone. Thus our reward was assured with Allah. And amongst us were those who spent life (in such a state of piety and austerity) that nothing consumed their reward. Mus'ab b. 'Umair was one of them. He was killed on the Day of Uhud, and nothing but a woollen cloak was found to shroud him. When we covered his head with it, his feet became uncovered, and when we covered his feet, his head was uncovered. Upon this the Messenger of Allah (may peace be upon him) said: Place it (this cloak) on the side of his head and cover his feet with grass. And there is one amongst us for whom the fruit is ripened and he enjoys it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20031",
        "20354",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sahih-muslim-7240",
      "hadith_no": "7240",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن سعيد الأشج، - واللفظ لعبد الله - قالا حدثنا وكيع، حدثنا الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كان لي على العاص بن وائل دين فأتيته أتقاضاه فقال لي لن أقضيك حتى تكفر بمحمد - قال - فقلت له إني لن أكفر بمحمد حتى تموت ثم تبعث ‏.‏ قال وإني لمبعوث من بعد الموت فسوف أقضيك إذا رجعت إلى مال وولد ‏.‏ قال وكيع كذا قال الأعمش قال فنزلت هذه الآية ‏{‏ أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ إلى قوله ‏{‏ ويأتينا فردا‏}‏",
      "text_en": " Khabbab reported that al-As b. Wa'il owed debt to me. I came to him in order to demand that. He said:                      I will never repay you unless you belie Mubammad. I said: I would never belie Mubammad until you die and you are again raised up. He said: When I would be raised up after death, I would repay your debt when I would get my property and children back. Waki' said: This is how Almash has narrated and it was on this occasion that this verse was revealed:\" Hast thou seen him who dis. believes in Our message and says: I shall certainly be given wealth and children' (xis, 77) up to\" he would come to Us alone\" (xiX. 80).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sunan-abi-daud-2649",
      "hadith_no": "2649",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا هشيم، وخالد، عن إسماعيل، عن قيس بن أبي حازم، عن خباب، قال أتينا رسول الله صلى الله عليه وسلم وهو متوسد بردة في ظل الكعبة فشكونا إليه فقلنا ألا تستنصر لنا ألا تدعو الله لنا فجلس محمرا وجهه فقال ‏\"‏ قد كان من قبلكم يؤخذ الرجل فيحفر له في الأرض ثم يؤتى بالمنشار فيجعل على رأسه فيجعل فرقتين ما يصرفه ذلك عن دينه ويمشط بأمشاط الحديد ما دون عظمه من لحم وعصب ما يصرفه ذلك عن دينه والله ليتمن الله هذا الأمر حتى يسير الراكب ما بين صنعاء وحضرموت ما يخاف إلا الله تعالى والذئب على غنمه ولكنكم تعجلون ‏\"‏ ‏.‏",
      "text_en": " Khabbab said “We came to the Apostle of Allaah(ﷺ) while he was reclining on an outer garment in the shade of the Ka’bah. Complaining to him we said “Do you not ask Allaah for help for us? And do you not pray to Allaah for us? He sat aright turning red in his face and said “A man before you (i.e., in ancient times) was caught  and a pit was dug for him in the earth and then a saw was brought placed on his head and it was broken into two pieces but that did not turn him away from his religion. They were combed in iron combs in flesh and sinews above the bones. Even that did not turn them away from their religion. I swear by Allaah, Allaah will accomplish this affair until a rider will travel between San’a and Hadramaut and he will not fear anyone except Allaah, Most High(nor will he fear the attack of) a wolf on his sheep, but you are making haste.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20468",
        "11282",
        "20208",
        "11046",
        "149"
      ]
    },
    {
      "id": "sunan-abi-daud-2876",
      "hadith_no": "2876",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن خباب، قال مصعب بن عمير قتل يوم أحد ولم تكن له إلا نمرة كنا إذا غطينا بها رأسه خرجت رجلاه وإذا غطينا رجليه خرج رأسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ غطوا بها رأسه واجعلوا على رجليه من الإذخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Khabbab:                     Mus'ab b. 'Umar was killed at the battle of Uhud, and for him only a coarse cloth would be found as shroud. When we covered his head, his feet showed, and when we covered his feet, his head showed. So the Messenger of Allah (ﷺ) said: Cover his head with it (cloth), and put some rushes over his feet.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sunan-abi-daud-3155",
      "hadith_no": "3155",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن خباب، قال إن مصعب بن عمير قتل يوم أحد ولم يكن له إلا نمرة كنا إذا غطينا بها رأسه خرج رجلاه وإذا غطينا رجليه خرج رأسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ غطوا بها رأسه واجعلوا على رجليه شيئا من الإذخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Khabbab:                     Mus'ab b. 'Umari was killed on the day of Uhud. He had only a striped cloak. When we covered his head with it, his feet appeared, and when we covered his feet, his head appeared. Thereupon the Messenger of Allah (ﷺ) said: Cover his head with it, and cover his feet with some grass.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2175-2",
      "hadith_no": "2175",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان بن راشد، يحدث عن الزهري، عن عبد الله بن الحارث، عن عبد الله بن خباب بن الأرت، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم صلاة فأطالها قالوا يا رسول الله صليت صلاة لم تكن تصليها قال ‏\"‏ أجل إنها صلاة رغبة ورهبة إني سألت الله فيها ثلاثا فأعطاني اثنتين ومنعني واحدة سألته أن لا يهلك أمتي بسنة فأعطانيها وسألته أن لا يسلط عليهم عدوا من غيرهم فأعطانيها وسألته أن لا يذيق بعضهم بأس بعض فمنعنيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وفي الباب عن سعد وابن عمر ‏.‏",
      "text_en": " 'Abdullah bin Khabbab bin Al-Aratt narrated from his father:                     \"The Messenger of Allah (s.a.w) performed Salat, making it long. They said: 'O Messenger of Allah! You have performed Salat (in a manner) which you do not ordinarily perform it.' He said: 'Yes, It was a prayer of hope and fear. In it I asked Allah for three things. He granted me two, and withheld one from me. I asked him that my Ummah not be destroyed by drought. He granted that. I asked him that they not be overcome by enemies from other then them. He granted that. And I asked him that some of them not suffer from the harm of others, and He withheld that.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20298",
        "11272",
        "10971",
        "11013",
        "912",
        "2230",
        "149"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3458",
      "hadith_no": "3458",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، قال سمعت خباب بن الأرت، يقول جئت العاصي بن وائل السهمي أتقاضاه حقا لي عنده فقال لا أعطيك حتى تكفر بمحمد ‏.‏ فقلت لا حتى تموت ثم تبعث ‏.‏ قال وإني لميت ثم مبعوث فقلت نعم ‏.‏ فقال إن لي هناك مالا وولدا فأقضيك ‏.‏ فنزلت ‏:‏ ‏(‏ أرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا ‏)‏ الآية ‏.‏",
      "text_en": " Narrated Masruq:                     \"I heard Khabbab bin Al-Aratt saying: 'I came to Al-'As bin Wa'il As-Sahmi to collect a debt he owed me. He said: 'You shall not be given anything until you deny Muhammad.' So I said: 'No, not until you are dead and resurrected.' He said: 'After I die and I am resurrected?' So I said: 'Yes.' So he said: 'I shall indeed have wealth and offspring to repay you with.' So (the following) Ayah was revealed: Have you seen him who disbelieved in Our Ayat and said: I shall certainly be given wealth and children (19:77).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4225",
      "hadith_no": "4225",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله فوقع أجرنا على الله فمنا من مات ولم يأكل من أجره شيئا ومنا من أينعت له ثمرته فهو يهدبها وإن مصعب بن عمير مات ولم يترك إلا ثوبا كانوا إذا غطوا به رأسه خرجت رجلاه وإذا غطي بها رجلاه خرج رأسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ غطوا رأسه واجعلوا على رجليه الإذخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Khabbab:                     \"We emigrated with the Messenger of Allah (ﷺ), seeking the Face of Allah. So our reward is with Allah. Among us were those who died and did not consume any of the rewards (in this life), and among us were those who lived to see its fruits and tend to them. Verily, Musab bin 'Umair died without leaving anything behind but a garment. When they covered his head with it, his feet would become exposed. And when they covered his feet with it, his head will become exposed. So the Messenger of Allah (ﷺ) said: 'Cover his head and place Al-Idhkir over his feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4226",
      "hadith_no": "4226",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا هناد، حدثنا ابن إدريس، عن الأعمش، عن أبي وائل، شقيق بن سلمة عن خباب بن الأرت، نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20102",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sunan-an-nasai-501",
      "hadith_no": "501",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا حميد بن عبد الرحمن، قال حدثنا زهير، عن أبي إسحاق، عن سعيد بن وهب، عن خباب، قال شكونا إلى رسول الله صلى الله عليه وسلم حر الرمضاء فلم يشكنا ‏.‏ قيل لأبي إسحاق في تعجيلها قال نعم ‏.‏",
      "text_en": " It was narrated that Khabbab said:                      \"We complained to the Messenger of Alalh (ﷺ) about how hot the sand was, but he did not respond to our complaint.\" It was said to Abu Ishaq (one of the narrators): \"Did they complain regarding his praying it early?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "10561",
        "20321",
        "11049",
        "10768",
        "149"
      ]
    },
    {
      "id": "sunan-an-nasai-1638",
      "hadith_no": "1638",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي وبقية، قالا حدثنا ابن أبي حمزة، قال حدثني الزهري، قال أخبرني عبيد الله بن عبد الله بن الحارث بن نوفل، عن عبد الله بن خباب بن الأرت، عن أبيه، وكان، قد شهد بدرا",
      "text_en": " It was narrated from 'Abdullah bin Khabbab bin Al-Aratt, from his father who had been present at Badr with the Messenger of Allah (ﷺ), that:                     He watched the Messenger of Allah (ﷺ) one night when he prayed all night until Fajr time. When the Messenger of Allah (ﷺ) said the taslim at the end of his prayer, Khabbab said to him: 'May my father and mother be ransomed for you O Messenger of Allah, last night you offered a prayer the like of which I have never seen you offer.\" The Messenger of Allah (ﷺ) said: \"Yes indeed. This is a prayer of hope and fear in which I asked my Lord, the Mighty and Sublime, for three things, of which He gave me two and did not grant me one. I asked my Lord not to destroy us with which he destroyed the nations before us, and He granted me that. And I asked my Lord not to let an enemy from without prevail over us, and He granted me that. And I asked my Lord not to divide us into warring factions and He did not grant me that.\"",
      "usc_msa_ref": "",
      "chain": [
        "38429",
        "11013",
        "11513",
        "2230",
        "149"
      ]
    },
    {
      "id": "sunan-an-nasai-1903",
      "hadith_no": "1903",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن الأعمش، ح وأخبرنا إسماعيل بن مسعود، قال حدثنا يحيى بن سعيد القطان، قال سمعت الأعمش، قال سمعت شقيقا، قال حدثنا خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله تعالى فوجب أجرنا على الله فمنا من مات لم يأكل من أجره شيئا منهم مصعب بن عمير قتل يوم أحد فلم نجد شيئا نكفنه فيه إلا نمرة كنا إذا غطينا رأسه خرجت رجلاه وإذا غطينا بها رجليه خرجت رأسه فأمرنا رسول الله صلى الله عليه وسلم أن نغطي بها رأسه ونجعل على رجليه إذخرا ومنا من أينعت له ثمرته فهو يهدبها ‏.‏ واللفظ لإسماعيل ‏.‏",
      "text_en": " Khabbab said:                     \"We emigrated with the Messenger of Allah, seeking the Face of Allah, the Most High, so our reward became due from Allah. Some of us died without enjoying anything of his reward (in this world) among them is Mus'ab bin Umair. He was matyred on the day of Uhud and we could not find anything to shroud him in except a Namirah; if we covered his head with it, his feet were uncovered, and if we covered his feet with it, his head became uncovered. The Messenger of Allah told us to cover his head with it and to put Idhkhir over his feet. And for some of us, the fruits of our labor have ripened and we are gathering them.\" This is the wording of Isma'il",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11060",
        "34033",
        "20031",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sunan-an-nasai-5320",
      "hadith_no": "5320",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، ومحمد بن المثنى، عن يحيى، عن إسماعيل، قال حدثنا قيس، عن خباب بن الأرت، قال شكونا إلى رسول الله صلى الله عليه وسلم وهو متوسد بردة له في ظل الكعبة فقلنا ألا تستنصر لنا ألا تدعو الله لنا",
      "text_en": " It was narrated that Khabbab bin Al-Aratt said:                     \"We complained to the Messenger of Allah [SAW] when he was reclining on his rolled-up Burdah in the shade of the Ka'bah. We said: 'Will you not pray for victory for us, will you not pray to Allah for us?'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "30170",
        "20031",
        "11418",
        "11046",
        "149"
      ]
    },
    {
      "id": "sunan-ibn-majah-675-2",
      "hadith_no": "675",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن أبي إسحاق، عن حارثة بن مضرب العبدي، عن خباب، قال شكونا إلى رسول الله  صلى الله عليه وسلم  حر الرمضاء فلم يشكنا ‏.‏ قال القطان حدثنا أبو حاتم، حدثنا الأنصاري، حدثنا عوف، نحوه ‏.‏",
      "text_en": " It was narrated that Khabbab said:                     \"We complained to the Messenger of Allah about the heat of the sunbaked ground, but he did not respond to our complaint.\" (Sahih)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11049",
        "19801",
        "149"
      ]
    },
    {
      "id": "sunan-ibn-majah-3497",
      "hadith_no": "3497",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، حدثنا منير بن الزبير، أنه سمع عبادة بن نسى، يقول سمعت خباب بن الأرت، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ إياك والخمر فإن خطيئتها تفرع الخطايا كما أن شجرتها تفرع الشجر ‏\"‏ ‏.‏",
      "text_en": " ‘Ubadahbin Samit said:                      “I heard Khabbab bin Arat narrating that theMessenger of Allah (ﷺ) said: ‘Beware of wine! For its sinsoverwhelmother sins, just as the grapevine overwhelms other trees.’”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "17064",
        "149"
      ]
    }
  ],
  "total_hadiths": 34
}