{
  "id": "15",
  "name": "Zayd ibn Harithah ( زيد بن حارثة ( رضي الله عنه",
  "full_name": "Zayd ibn Harithah ( زيد بن حارثة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "35",
      "date_gregorian": "588",
      "date_display": [
        "35 BH",
        "588 CE"
      ],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "8",
      "date_gregorian": "629",
      "date_display": null,
      "place": "Busra, Near Karak, Syria, Mu'tah",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Commander",
      "Narrator [ س  ق  -  صحابي ]"
    ],
    "tags": [
      "Ally B.Hashim",
      "al-Kalbi",
      "Early Muslim",
      "Emigrant",
      "Badr",
      "Uhud",
      "Khandaq",
      "Mu'tah",
      "Freed Slave",
      "client"
    ]
  },
  "parents": [
    {
      "id": "2281",
      "name": "Harithah ibn Sharahil ( حارثة بن شراحيل ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "95",
      "name": "Umm Kulthum bint 'Uqba ( أم كلثوم بنت عقبة بن أبي معيط ( رضي الله عنها",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "453",
      "name": "Durrah bint Abi Lahab ( درة بنت أبي لهب بن عبد المطلب الهاشمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "202",
      "name": "Umm Ayman, Barakah ( أم أيمن مولاة النبي صلى الله عليه وسلم ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "57",
      "name": "Zaynab bint Jahsh ( زينب بنت جحش الأسدية أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "536",
      "name": "Mughith, the husband of Barira ( مغيث زوج بريرة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2280",
      "name": "Jabla bin Harithah ( جبلة بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [
    {
      "id": "550",
      "name": "Zayd ibn Zayd ( زيد بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "551",
      "name": "Ruqiyyah ibn Zayd ( رقية بنت زيد بن حارثة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "552",
      "name": "Zaynab ibn Zayd ( زينب بنت زيد بن حارثة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-956",
      "hadith_no": "956",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يخرج يوم الفطر والأضحى إلى المصلى، فأول شىء يبدأ به الصلاة ثم ينصرف، فيقوم مقابل الناس، والناس جلوس على صفوفهم، فيعظهم ويوصيهم ويأمرهم، فإن كان يريد أن يقطع بعثا قطعه، أو يأمر بشىء أمر به، ثم ينصرف‏.‏ قال أبو سعيد فلم يزل الناس على ذلك حتى خرجت مع مروان وهو أمير المدينة في أضحى أو فطر، فلما أتينا المصلى إذا منبر بناه كثير بن الصلت، فإذا مروان يريد أن يرتقيه قبل أن يصلي، فجبذت بثوبه فجبذني فارتفع، فخطب قبل الصلاة، فقلت له غيرتم والله‏.‏ فقال أبا سعيد، قد ذهب ما تعلم‏.‏ فقلت ما أعلم والله خير مما لا أعلم‏.‏ فقال إن الناس لم يكونوا يجلسون لنا بعد الصلاة فجعلتها قبل الصلاة‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet used to proceed to the Musalla on the days of Id-ul-Fitr and Id-ul-Adha; the first thing to begin with was the prayer and after that he would stand in front of the people and the people would keep sitting in their rows. Then he would preach to them, advise them and give them orders, (i.e. Khutba). And after that if he wished to send an army for an expedition, he would do so; or if he wanted to give and order, he would do so, and then depart. The people followed this tradition till I went out with Marwan, the Governor of Medina, for the prayer of Id-ul-Adha or Id-ul-Fitr. When we reached the Musalla, there was a pulpit made by Kathir bin As-Salt. Marwan wanted to get up on that pulpit before the prayer. I got hold of his clothes but he pulled them and ascended the pulpit and delivered the Khutba before the prayer. I said to him, \"By Allah, you have changed (the Prophet's tradition).\" He replied, \"O Abu Sa`id! Gone is that which you know.\" I said, \"By Allah! What I know is better than what I do not know.\" Marwan said, \"People do not sit to listen to our Khutba after the prayer, so I delivered the Khutba before the prayer.\"",
      "usc_msa_ref": "76",
      "chain": [
        "30232",
        "20173",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1485",
      "hadith_no": "1485",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله، عن أبي سعيد الخدري  رضى الله عنه  خرج رسول الله صلى الله عليه وسلم في أضحى أو فطر إلى المصلى ثم انصرف فوعظ الناس وأمرهم بالصدقة فقال ‏\"‏ أيها الناس تصدقوا ‏\"‏‏.‏ فمر على النساء فقال ‏\"‏ يا معشر النساء تصدقن، فإني رأيتكن أكثر أهل النار ‏\"‏‏.‏ فقلن وبم ذلك يا رسول الله قال ‏\"‏ تكثرن اللعن وتكفرن العشير، ما رأيت من ناقصات عقل ودين أذهب للب الرجل الحازم من إحداكن يا معشر النساء ‏\"‏‏.‏ ثم انصرف فلما صار إلى منزله جاءت زينب امرأة ابن مسعود تستأذن عليه فقيل يا رسول الله هذه زينب فقال ‏\"‏ أى الزيانب ‏\"‏‏.‏ فقيل امرأة ابن مسعود‏.‏ قال ‏\"‏ نعم ائذنوا لها ‏\"‏‏.‏ فأذن لها قالت يا نبي الله إنك أمرت اليوم بالصدقة، وكان عندي حلي لي، فأردت أن أتصدق به، فزعم ابن مسعود أنه وولده أحق من تصدقت به عليهم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ابن مسعود، زوجك وولدك أحق من تصدقت به عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     On `Id ul Fitr or `Id ul Adha Allah's Apostle (p.b.u.h) went out to the Musalla. After finishing the prayer, he delivered the sermon and ordered the people to give alms. He said, \"O people! Give alms.\" Then he went towards the women and said. \"O women! Give alms, for I have seen that the majority of the dwellers of Hell-Fire were you (women).\" The women asked, \"O Allah's Apostle! What is the reason for it?\" He replied, \"O women! You curse frequently, and are ungrateful to your husbands. I have not seen anyone more deficient in intelligence and religion than you. O women, some of you can lead a cautious wise man astray.\" Then he left. And when he reached his house, Zainab, the wife of Ibn Mas`ud, came and asked permission to enter It was said, \"O Allah's Apostle! It is Zainab.\" He asked, 'Which Zainab?\" The reply was that she was the wife of Ibn Mas'ub. He said, \"Yes, allow her to enter.\" And she was admitted. Then she said, \"O Prophet of Allah! Today you ordered people to give alms and I had an ornament and intended to give it as alms, but Ibn Mas`ud said that he and his children deserved it more than anybody else.\" The Prophet replied, \"Ibn Mas`ud had spoken the truth. Your husband and your children had more right to it than anybody else.\"",
      "usc_msa_ref": "541",
      "chain": [
        "30232",
        "20173",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1535",
      "hadith_no": "1535",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا أبو عمر، عن زيد، عن عياض بن عبد الله بن سعد، عن أبي سعيد الخدري  رضى الله عنه  قال كنا نخرج في عهد رسول الله صلى الله عليه وسلم يوم الفطر صاعا من طعام‏.‏ وقال أبو سعيد وكان طعامنا الشعير والزبيب والأقط والتمر‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     In the lifetime of Allah's Apostle , we used to give one Sa' of food (edible things) as Sadaqat-ul-Fitr (to the poor). Our food used to be either of barley, raisins (dried grapes), cottage cheese or dates.",
      "usc_msa_ref": "586",
      "chain": [
        "30177",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-1951",
      "hadith_no": "1951",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا محمد بن جعفر، قال حدثني زيد، عن عياض، عن أبي سعيد  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أليس إذا حاضت لم تصل، ولم تصم فذلك نقصان دينها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"Isn't it true that a woman does not pray and does not fast on menstruating? And that is the defect (a loss) in her religion.\"",
      "usc_msa_ref": "172",
      "chain": [
        "30232",
        "20173",
        "15",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-2658",
      "hadith_no": "2658",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا ابن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن عياض بن عبد الله، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ أليس شهادة المرأة مثل نصف شهادة الرجل ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فذلك من نقصان عقلها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Isn't the witness of a woman equal to half of that of a man?\" The women said, \"Yes.\" He said, \"This is because of the deficiency of a woman's mind.\"",
      "usc_msa_ref": "826",
      "chain": [
        "30232",
        "20173",
        "15",
        "11260",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4282",
      "hadith_no": "4282",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن أبي مريم، أخبرنا محمد بن جعفر، قال أخبرني زيد، عن أبيه، أنه سمع عمر بن الخطاب  رضى الله عنه  يقول أما والذي نفسي بيده، لولا أن أترك آخر الناس ببانا ليس لهم شىء، ما فتحت على قرية إلا قسمتها كما قسم النبي صلى الله عليه وسلم خيبر، ولكني أتركها خزانة لهم يقتسمونها‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     By Him in Whose Hand my soul is, were I not afraid that the other Muslims might be left in poverty, I would divide (the land of) whatever village I may conquer (among the fighters), as the Prophet divided the land of Khaibar. But I prefer to leave it as a (source of) a common treasury for them to distribute it revenue amongst themselves.",
      "usc_msa_ref": "542",
      "chain": [
        "30232",
        "20173",
        "15",
        "2281",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-6024",
      "hadith_no": "6024",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال ابن وهب أخبرنا عمرو  هو ابن الحارث  حدثه بكير، حدثه بسر، حدثه زيد، حدثه أبو طلحة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "11154",
        "11153",
        "15"
      ]
    },
    {
      "id": "sahih-bukhari-7529",
      "hadith_no": "7529",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قلنا يا رسول الله هل نرى ربنا يوم القيامة قال ‏\"‏ هل تضارون في رؤية الشمس والقمر إذا كانت صحوا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ فإنكم لا تضارون في رؤية ربكم يومئذ، إلا كما تضارون في رؤيتهما  ثم قال  ينادي مناد ليذهب كل قوم إلى ما كانوا يعبدون‏.‏ فيذهب أصحاب الصليب مع صليبهم، وأصحاب الأوثان مع أوثانهم، وأصحاب كل آلهة مع آلهتهم حتى يبقى من كان يعبد الله من بر أو فاجر، وغبرات من أهل الكتاب، ثم يؤتى بجهنم تعرض كأنها سراب فيقال لليهود ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد فما تريدون قالوا نريد أن تسقينا، فيقال اشربوا فيتساقطون في جهنم ثم يقال للنصارى ما كنتم تعبدون فيقولون كنا نعبد المسيح ابن الله‏.‏ فيقال كذبتم لم يكن لله صاحبة ولا ولد، فما تريدون فيقولون نريد أن تسقينا‏.‏ فيقال اشربوا‏.‏ فيتساقطون حتى يبقى من كان يعبد الله من بر أو فاجر فيقال لهم ما يحبسكم وقد ذهب الناس فيقولون فارقناهم ونحن أحوج منا إليه اليوم وإنا سمعنا مناديا ينادي ليلحق كل قوم بما كانوا يعبدون‏.‏ وإنما ننتظر ربنا  قال  فيأتيهم الجبار‏.‏ فيقول أنا ربكم‏.‏ فيقولون أنت ربنا‏.‏ فلا يكلمه إلا الأنبياء فيقول هل بينكم وبينه آية تعرفونه فيقولون الساق‏.‏ فيكشف عن ساقه فيسجد له كل مؤمن، ويبقى من كان يسجد لله رياء وسمعة، فيذهب كيما يسجد فيعود ظهره طبقا واحدا، ثم يؤتى بالجسر فيجعل بين ظهرى جهنم ‏\"‏‏.‏ قلنا يا رسول الله وما الجسر قال ‏\"‏ مدحضة مزلة، عليه خطاطيف وكلاليب وحسكة مفلطحة، لها شوكة عقيفاء تكون بنجد يقال لها السعدان، المؤمن عليها كالطرف وكالبرق وكالريح وكأجاويد الخيل والركاب، فناج مسلم وناج مخدوش ومكدوس في نار جهنم، حتى يمر آخرهم يسحب سحبا، فما أنتم بأشد لي مناشدة في الحق، قد تبين لكم من المؤمن يومئذ للجبار، وإذا رأوا أنهم قد نجوا في إخوانهم يقولون ربنا إخواننا كانوا يصلون معنا ويصومون معنا ويعملون معنا‏.‏ فيقول الله تعالى اذهبوا فمن وجدتم في قلبه مثقال دينار من إيمان فأخرجوه‏.‏ ويحرم الله صورهم على النار، فيأتونهم وبعضهم قد غاب في النار إلى قدمه وإلى أنصاف ساقيه، فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال نصف دينار فأخرجوه‏.‏ فيخرجون من عرفوا، ثم يعودون فيقول اذهبوا فمن وجدتم في قلبه مثقال ذرة من إيمان فأخرجوه‏.‏ فيخرجون من عرفوا ‏\"‏‏.‏ قال أبو سعيد فإن لم تصدقوني فاقرءوا ‏{‏إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها‏}‏ ‏\"‏ فيشفع النبيون والملائكة والمؤمنون فيقول الجبار بقيت شفاعتي‏.‏ فيقبض قبضة من النار فيخرج أقواما قد امتحشوا، فيلقون في نهر بأفواه الجنة يقال له ماء الحياة، فينبتون في حافتيه كما تنبت الحبة في حميل السيل، قد رأيتموها إلى جانب الصخرة إلى جانب الشجرة، فما كان إلى الشمس منها كان أخضر، وما كان منها إلى الظل كان أبيض، فيخرجون كأنهم اللؤلؤ، فيجعل في رقابهم الخواتيم فيدخلون الجنة فيقول أهل الجنة هؤلاء عتقاء الرحمن أدخلهم الجنة بغير عمل عملوه ولا خير قدموه‏.‏ فيقال لهم لكم ما رأيتم ومثله معه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Sa'id Al-Khudri:                          We said, \"O Allah's Apostle! Shall we see our Lord on the Day of      Resurrection?\" He said, \"Do you have any difficulty in seeing the sun      and the moon when the sky is clear?\" We said, \"No.\" He said, \"So you      will have no difficulty in seeing your Lord on that Day as you have no     difficulty in seeing the sun and the moon (in a clear sky).\" The      Prophet then said, \"Somebody will then announce, 'Let every nation      follow what they used to worship.' So the companions of the cross will     go with their cross, and the idolators (will go) with their idols, and     the companions of every god (false deities) (will go) with their god,      till there remain those who used to worship Allah, both the obedient      ones and the mischievous ones, and some of the people of the      Scripture. Then Hell will be presented to them as if it were a mirage.     Then it will be said to the Jews, \"What did you use to worship?' They      will reply, 'We used to worship Ezra, the son of Allah.' It will be      said to them, 'You are liars, for Allah has neither a wife nor a son.      What do you want (now)?' They will reply, 'We want You to provide us      with water.' Then it will be said to them 'Drink,' and they will fall      down in Hell (instead). Then it will be said to the Christians, 'What      did you use to worship?'      They will reply, 'We used to worship Messiah, the son of Allah.' It      will be said, 'You are liars, for Allah has neither a wife nor a son.      What: do you want (now)?' They will say, 'We want You to provide us      with water.' It will be said to them, 'Drink,' and they will fall down     in Hell (instead). When there remain only those who used to worship      Allah (Alone), both the obedient ones and the mischievous ones, it      will be said to them, 'What keeps you here when all the people have      gone?' They will say, 'We parted with them (in the world) when we were     in greater need of them than we are today, we heard the call of one      proclaiming, 'Let every nation follow what they used to worship,' and      now we are waiting for our Lord.' Then the Almighty will come to them      in a shape other than the one which they saw the first time, and He      will say, 'I am your Lord,' and they will say, 'You are not our Lord.'     And none will speak: to Him then but the Prophets, and then it will be     said to them, 'Do you know any sign by which you can recognize Him?'      They will say. 'The Shin,' and so Allah will then uncover His Shin      whereupon every believer will prostrate before Him and there will      remain those who used to prostrate before Him just for showing off and     for gaining good reputation. These people will try to prostrate but      their backs will be rigid like one piece of a wood (and they will not      be able to prostrate). Then the bridge will be laid across Hell.\" We,      the companions of the Prophet said, \"O Allah's Apostle! What is the      bridge?'     He said, \"It is a slippery (bridge) on which there are clamps and      (Hooks like) a thorny seed that is wide at one side and narrow at the      other and has thorns with bent ends. Such a thorny seed is found in      Najd and is called As-Sa'dan. Some of the believers will cross the      bridge as quickly as the wink of an eye, some others as quick as      lightning, a strong wind, fast horses or she-camels. So some will be      safe without any harm; some will be safe after receiving some      scratches, and some will fall down into Hell (Fire). The last person      will cross by being dragged (over the bridge).\" The Prophet said, \"You     (Muslims) cannot be more pressing in claiming from me a right that has     been clearly proved to be yours than the believers in interceding with     Almighty for their (Muslim) brothers on that Day, when they see      themselves safe.      They will say, 'O Allah! (Save) our brothers (for they) used to pray      with us, fast with us and also do good deeds with us.' Allah will say,     'Go and take out (of Hell) anyone in whose heart you find faith equal      to the weight of one (gold) Dinar.' Allah will forbid the Fire to burn     the faces of those sinners. They will go to them and find some of them     in Hell (Fire) up to their feet, and some up to the middle of their      legs. So they will take out those whom they will recognize and then      they will return, and Allah will say (to them), 'Go and take out (of      Hell) anyone in whose heart you find faith equal to the weight of one      half Dinar.' They will take out whomever they will recognize and      return, and then Allah will say, 'Go and take out (of Hell) anyone in      whose heart you find faith equal to the weight of an atom (or a      smallest ant), and so they will take out all those whom they will      recognize.\" Abu Sa'id said: If you do not believe me then read the      Holy Verse:--     'Surely! Allah wrongs not even of the weight of an atom (or a smallest     ant) but if there is any good (done) He doubles it.' (4.40) The      Prophet added, \"Then the prophets and Angels and the believers will      intercede, and (last of all) the Almighty (Allah) will say, 'Now      remains My Intercession. He will then hold a handful of the Fire from      which He will take out some people whose bodies have been burnt, and      they will be thrown into a river at the entrance of Paradise, called      the water of life.      They will grow on its banks, as a seed carried by the torrent grows.      You have noticed how it grows beside a rock or beside a tree, and how      the side facing the sun is usually green while the side facing the      shade is white. Those people will come out (of the River of Life) like     pearls, and they will have (golden) necklaces, and then they will      enter Paradise whereupon the people of Paradise will say, 'These are      the people emancipated by the Beneficent. He has admitted them into      Paradise without them having done any good deeds and without sending      forth any good (for themselves).' Then it will be said to them, 'For      you is what you have seen and its equivalent as well.'\"",
      "usc_msa_ref": "532",
      "chain": [
        "30399",
        "20023",
        "11408",
        "11169",
        "15",
        "11020",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1745",
      "hadith_no": "1745",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، وحسن الحلواني، كلاهما عن زيد، قال حسن حدثنا زيد بن الحباب، حدثني الضحاك بن عثمان، حدثني عبد الله بن عروة، عن أبيه، عن عائشة، قالت لما بدن رسول الله صلى الله عليه وسلم وثقل كان أكثر صلاته جالسا ‏.‏",
      "text_en": " Hafsa reported:                      Never did I see the Messenger of Allah (may peace be upon him) observing supererogatory prayer sitting till one year before his death when he would observe Nafl prayer in a sitting position, and he would recite the Surah (of the Qur'an) in such a slow-measured tone (that duration of its recital) became more lengthy than the one longer than this.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "15",
        "20650",
        "20504",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1910",
      "hadith_no": "1910",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني الحسن بن علي الحلواني، حدثنا أبو توبة، - وهو الربيع بن نافع - حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، يقول حدثني أبو أمامة، الباهلي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اقرءوا القرآن فإنه يأتي يوم القيامة شفيعا لأصحابه اقرءوا الزهراوين البقرة وسورة آل عمران فإنهما تأتيان يوم القيامة كأنهما غمامتان أو كأنهما غيايتان أو كأنهما فرقان من طير صواف تحاجان عن أصحابهما اقرءوا سورة البقرة فإن أخذها بركة وتركها حسرة ولا تستطيعها البطلة ‏\"‏ ‏.‏ قال معاوية بلغني أن البطلة السحرة ‏.‏",
      "text_en": " This hadith has been narrated by Mu'awiya with the same chain of transmitters but with this exception that in this the words of Mu'awiya:                     \" It has been conveyed to me...\" have not been mentioned.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30335",
        "20401",
        "15",
        "4048"
      ]
    },
    {
      "id": "sahih-muslim-2203",
      "hadith_no": "2203",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبان بن يزيد، ح وحدثني إسحاق، بن منصور - واللفظ له - أخبرنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه أن أبا مالك الأشعري حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ أربع في أمتي من أمر الجاهلية لا يتركونهن الفخر في الأحساب والطعن في الأنساب والاستسقاء بالنجوم والنياحة ‏\"‏ ‏.‏ وقال ‏\"‏ النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ودرع من جرب ‏\"‏ ‏.‏",
      "text_en": " Abu Malik al-Ash'ari reported Allah's Messenger (may peace be upon him) as saying:                      Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20205",
        "30313",
        "20218",
        "20205",
        "11449",
        "15"
      ]
    },
    {
      "id": "sahih-muslim-2377",
      "hadith_no": "2377",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا حسن بن علي الحلواني، حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، يقول حدثني عبد الله بن فروخ، أنه سمع عائشة، تقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنه خلق كل إنسان من بني آدم على ستين وثلاثمائة مفصل فمن كبر الله وحمد الله وهلل الله وسبح الله واستغفر الله وعزل حجرا عن طريق الناس أو شوكة أو عظما عن طريق الناس وأمر بمعروف أو نهى عن منكر عدد تلك الستين والثلاثمائة السلامى فإنه يمشي يومئذ وقد زحزح نفسه عن النار ‏\"‏ ‏.‏ قال أبو توبة وربما قال ‏\"‏ يمسي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      Every one of the children of Adam has been created with three hundred and sixty joints; so he who declares the Glory of Allah, praises Allah, declares Allah to be One, Glorifies Allah, and seeks forgiveness from Allah, and removes stone, or thorn, or bone from people's path, and enjoins what is good and forbids from evil, to the number of those three hundred and sixty-four, will walk that day haviing removed himself from Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20401",
        "15",
        "24242"
      ]
    },
    {
      "id": "sahih-muslim-2405",
      "hadith_no": "2405",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن زيد، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى فذكر خصالا وقال ‏\"‏ من منح منيحة غدت بصدقة وراحت بصدقة صبوحها وغبوقها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) forbade (to do certain things) and then he made a mention of certain habits and said:                      He who gives a she-camel as a gift, for him is the reward (of the gift) both morn- ing and evening-a reward for drinking milk in the morning and a reward for drinking milk in the evening.",
      "usc_msa_ref": "",
      "chain": [
        "30560",
        "30464",
        "30024",
        "15",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4023",
      "hadith_no": "4023",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني ابن أبي خلف، وحجاج بن الشاعر، قالا حدثنا زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن زيد، عن الحكم، عن نافع، عن ابن عمر، أنه أتى رافعا فذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi, reported from Ibn Umar (Allah be pleated with them) that he came to Rafi and he narrated this hadith from Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "30464",
        "30024",
        "15",
        "11069",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4980",
      "hadith_no": "4980",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى بن حسان، حدثنا معاوية، أخبرني زيد، أنه سمع أبا سلام، قال حدثني النعمان بن بشير، قال كنت عند منبر رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث أبي توبة ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20300",
        "27",
        "15",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-5348",
      "hadith_no": "5348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، حدثنا عبيد الله، عن زيد، عن يحيى أبي عمر النخعي، قال سأل قوم ابن عباس عن بيع الخمر، وشرائها، والتجارة فيها فقال أمسلمون أنتم قالوا نعم ‏.‏ قال فإنه لا يصلح بيعها ولا شراؤها ولا التجارة فيها ‏.‏ قال فسألوه عن النبيذ فقال خرج رسول الله صلى الله عليه وسلم في سفر ثم رجع وقد نبذ ناس من أصحابه في حناتم ونقير ودباء فأمر به فأهريق ثم أمر بسقاء فجعل فيه زبيب وماء فجعل من الليل فأصبح فشرب منه يومه ذلك وليلته المستقبلة ومن الغد حتى أمسى فشرب وسقى فلما أصبح أمر بما بقي منه فأهريق ‏.‏",
      "text_en": " Yahya Abu 'Umar al-Nakhai reported that some people asked Ibn Abbas about the sale and purchase of wine and its commerce. He asked (them):                      Are you Muslims? They said, Yes. Thereupon he said: Its sale and purchase and its trade are not permissible. They then asked him about Nabidh and he said: Allah's Messenger (may peace be upon him) went out on a journey and then came back and some persons amongst his Companions prepared Nabidh for him in green pitcher, hollow stump and gourd. He commanded it to be thrown away, and it was done accordingly. He then ordered them (to prepare it.) in a waterskin and it was prepared in that by steeping raisins in water, and it was prepared in the night. In the morning he drank out of that and on that day and then the next night, and then on the next day until the evening. He drank and gave others to drink. When it was morning (of the third night) he commanded what was left of that to be thrown away.",
      "usc_msa_ref": "",
      "chain": [
        "30560",
        "30464",
        "11201",
        "15"
      ]
    },
    {
      "id": "sunan-abi-daud-137",
      "hadith_no": "137",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا هشام بن سعد، حدثنا زيد، عن عطاء بن يسار، قال قال لنا ابن عباس أتحبون أن أريكم، كيف كان رسول الله صلى الله عليه وسلم يتوضأ فدعا بإناء فيه ماء فاغترف غرفة بيده اليمنى فتمضمض واستنشق ثم أخذ أخرى فجمع بها يديه ثم غسل وجهه ثم أخذ أخرى فغسل بها يده اليمنى ثم أخذ أخرى فغسل بها يده اليسرى ثم قبض قبضة من الماء ثم نفض يده ثم مسح بها رأسه وأذنيه ثم قبض قبضة أخرى من الماء فرش على رجله اليمنى وفيها النعل ثم مسحها بيديه يد فوق القدم ويد تحت النعل ثم صنع باليسرى مثل ذلك ‏.‏",
      "text_en": " ‘Ata’ b. Yasar quoting Ibn ‘Abbas said:                      Do you like that I should show you how the Messenger of Allah (ﷺ) performed ablution? He then called for a vessel of water and took out a handful of water with his right hand. He then rinsed his mouth and snuffed up water. He then took out another handful of water and washed his face by both his hands together. He then took out another handful of water and washed his right hand and then washed his left hand by taking out another. He then took out some water and shook off his hand and wiped his head and ears with it. He then took out a handful of water and sprinkled it over his right foot in his shoe and wiped the upper part of the foot with his one hand, and beneath the shoe with his other hand. He then did the same with his left foot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "20519",
        "15",
        "11020"
      ]
    },
    {
      "id": "sunan-abi-daud-916",
      "hadith_no": "916",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، قال حدثني السلولي، - هو أبو كبشة - عن سهل ابن الحنظلية، قال ثوب بالصلاة - يعني صلاة الصبح - فجعل رسول الله صلى الله عليه وسلم يصلي وهو يلتفت إلى الشعب ‏.‏ قال أبو داود وكان أرسل فارسا إلى الشعب من الليل يحرس ‏.‏",
      "text_en": " Narrated Sahl ibn al-Hanzaliyyah:                     The iqamah for the morning prayer was pronounced and the Messenger of Allah (ﷺ) began to offer prayer while he was looking at the mountain-pass. (AbuDawud elaborated that the Prophet had sent a horseman to the mountain-pass at night in order to keep watch.)",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20401",
        "15",
        "1824"
      ]
    },
    {
      "id": "sunan-abi-daud-3055",
      "hadith_no": "3055",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا معاوية، - يعني ابن سلام - عن زيد، أنه سمع أبا سلام، قال حدثني عبد الله الهوزني، قال لقيت بلالا مؤذن رسول الله صلى الله عليه وسلم بحلب فقلت يا بلال حدثني كيف كانت نفقة رسول الله صلى الله عليه وسلم قال ما كان له شىء كنت أنا الذي ألي ذلك منه منذ بعثه الله إلى أن توفي وكان إذا أتاه الإنسان مسلما فرآه عاريا يأمرني فأنطلق فأستقرض فأشتري له البردة فأكسوه وأطعمه حتى اعترضني رجل من المشركين فقال يا بلال إن عندي سعة فلا تستقرض من أحد إلا مني ففعلت فلما أن كان ذات يوم توضأت ثم قمت لأؤذن بالصلاة فإذا المشرك قد أقبل في عصابة من التجار فلما أن رآني قال يا حبشي ‏.‏ قلت يا لباه ‏.‏ فتجهمني وقال لي قولا غليظا وقال لي أتدري كم بينك وبين الشهر قال قلت قريب ‏.‏ قال إنما بينك وبينه أربع فآخذك بالذي عليك فأردك ترعى الغنم كما كنت قبل ذلك فأخذ في نفسي ما يأخذ في أنفس الناس حتى إذا صليت العتمة رجع رسول الله صلى الله عليه وسلم إلى أهله فاستأذنت عليه فأذن لي فقلت يا رسول الله بأبي أنت وأمي إن المشرك الذي كنت أتدين منه قال لي كذا وكذا وليس عندك ما تقضي عني ولا عندي وهو فاضحي فأذن لي أن آبق إلى بعض هؤلاء الأحياء الذين قد أسلموا حتى يرزق الله رسوله صلى الله عليه وسلم ما يقضي عني فخرجت حتى إذا أتيت منزلي فجعلت سيفي وجرابي ونعلي ومجني عند رأسي حتى إذا انشق عمود الصبح الأول أردت أن أنطلق فإذا إنسان يسعى يدعو يا بلال أجب رسول الله صلى الله عليه وسلم فانطلقت حتى أتيته فإذا أربع ركائب مناخات عليهن أحمالهن فاستأذنت فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أبشر فقد جاءك الله بقضائك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألم تر الركائب المناخات الأربع ‏\"‏ ‏.‏ فقلت بلى ‏.‏ فقال ‏\"‏ إن لك رقابهن وما عليهن فإن عليهن كسوة وطعاما أهداهن إلى عظيم فدك فاقبضهن واقض دينك ‏\"‏ ‏.‏ ففعلت فذكر الحديث ثم انطلقت إلى المسجد فإذا رسول الله صلى الله عليه وسلم قاعد في المسجد فسلمت عليه فقال ‏\"‏ ما فعل ما قبلك ‏\"‏ ‏.‏ قلت قد قضى الله كل شىء كان على رسول الله صلى الله عليه وسلم فلم يبق شىء ‏.‏ قال ‏\"‏ أفضل شىء ‏\"‏ ‏.‏ قلت نعم قال ‏\"‏ انظر أن تريحني منه فإني لست بداخل على أحد من أهلي حتى تريحني منه ‏\"‏ ‏.‏ فلما صلى رسول الله صلى الله عليه وسلم العتمة دعاني فقال ‏\"‏ ما فعل الذي قبلك ‏\"‏ ‏.‏ قال قلت هو معي لم يأتنا أحد ‏.‏ فبات رسول الله صلى الله عليه وسلم في المسجد وقص الحديث حتى إذا صلى العتمة - يعني من الغد - دعاني قال ‏\"‏ ما فعل الذي قبلك ‏\"‏ ‏.‏ قال قلت قد أراحك الله منه يا رسول الله ‏.‏ فكبر وحمد الله شفقا من أن يدركه الموت وعنده ذلك ثم اتبعته حتى إذا جاء أزواجه فسلم على امرأة امرأة حتى أتى مبيته فهذا الذي سألتني عنه ‏.‏",
      "text_en": " Narrated Abdullah al-Hawzani:                     I met Bilal, the Mu'adhdhin of the Messenger of Allah (ﷺ) at Aleppo, and said: Bilal, tell me, what was the financial position of the Messenger of Allah (ﷺ)?  He said: He had nothing. It was I who managed it on his behalf since the day Allah made him Prophet of Allah (ﷺ) until he died. When a Muslim man came to him and he found him naked, he ordered me (to clothe him). I would go, borrow (some money), and purchase a cloak for him. I would then clothe him and feed him.  A man from the polytheists met me and said: I am well off, Bilal. Do not borrow money from anyone except me. So I did accordingly. One day when I performed ablution and stood up to make call to prayer, the same polytheist came along with a body of merchants.  When he saw me, he said: O Abyssinian.  I said: I am at your service. He met me with unpleasant looks and said harsh words to me.  He asked me: Do you know how many days remain in the completion of this month?  I replied: The time is near.  He said: Only four days remain in the completion of this month. I shall then take that which is due from you (i.e. loan), and then shall return you to tend the sheep as you did before. I began to think in my mind what people think in their minds (on such occasions). When I offered the night prayer, the Messenger of Allah (ﷺ) returned to his family. I sought permission from him and he gave me permission.  I said: Messenger of Allah, may my parents be sacrificed for you, the polytheist from whom I used to borrow money said to me such-and-such. Neither you nor I have anything to pay him for me, and he will disgrace me. So give me permission to run away to some of those tribes who have recently embraced Islam until Allah gives His Apostle (ﷺ) something with which he can pay (the debt) for me. So I came out and reached my house. I placed my sword, waterskin (or sheath), shoes and shield near my head. When dawn broke, I intended to be on my way.  All of a sudden I saw a man running towards me and calling: Bilal, return to the Messenger of Allah (ﷺ). So I went till I reached him. I found four mounts kneeling on the ground with loads on them. I sought permission.  The Messenger of Allah (ﷺ) said to me: Be glad, Allah has made arrangements for the payment (of your debt). He then asked: Have you not seen the four mounts kneeling on the ground?  I replied: Yes.  He said: You may have these mounts and what they have on them. There are clothes and food on them, presented to me by the ruler of Fadak. Take them away and pay off your debt. I did so.  He then mentioned the rest of the tradition. I then went to the mosque and found that the Messenger of Allah (ﷺ) was sitting there. I greeted him.  He asked: What benefit did you have from your property?  I replied: Allah Most High paid everything which was due from the Messenger of Allah (ﷺ). Nothing remains now.  He asked: Did anything remain (from that property)?  I said: Yes.  He said: Look, if you can give me some comfort from it, for I shall not visit any member of my family until you give me some comfort from it. When the Messenger of Allah (ﷺ) offered the night prayer, he called me and said: What is the position of that which you had with you (i.e. property)?  I said: I still have it, no one came to me. The Messenger of Allah (ﷺ) passed the night in the mosque.  He then narrated the rest of the tradition. Next day when he offered the night prayer, he called me and asked: What is the position of that which you had (i.e. the rest of the property)?  I replied: Allah has given you comfort from it, Messenger of Allah.  He said: Allah is Most Great, and praised Allah, fearing lest he should die while it was with him. I then followed him until he came to his wives and greeted each one of them and finally he came to his place where he had to pass the night. This is all for which you asked me.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20401",
        "15"
      ]
    },
    {
      "id": "sunan-abi-daud-4243",
      "hadith_no": "4243",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا ابن أبي مريم، أخبرنا ابن فروخ، أخبرني أسامة بن زيد، أخبرني ابن لقبيصة بن ذؤيب، عن أبيه، قال قال حذيفة بن اليمان والله ما أدري أنسي أصحابي أم تناسوا والله ما ترك رسول الله صلى الله عليه وسلم من قائد فتنة إلى أن تنقضي الدنيا يبلغ من معه ثلاثمائة فصاعدا إلا قد سماه لنا باسمه واسم أبيه واسم قبيلته ‏.‏",
      "text_en": " Narrated Hudhayfah ibn al-Yaman:                     I swear by Allah, I do not know whether my companions have forgotten or have pretended to forgot. I swear by Allah that the Messenger of Allah (ﷺ) did not omit a leader of a wrong belief (fitnah)--up to the end of the world--whose followers reach the number of three hundred and upwards but he mentioned to us his name, his father's name and the name of his tribe.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30232",
        "50",
        "15"
      ]
    },
    {
      "id": "sunan-abi-daud-4908",
      "hadith_no": "4908",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا أبان، ح وحدثنا زيد بن أخزم الطائي، حدثنا بشر بن عمر، حدثنا أبان بن يزيد العطار، حدثنا قتادة، عن أبي العالية، - قال زيد - عن ابن عباس، أن رجلا، لعن الريح - وقال مسلم إن رجلا نازعته الريح رداءه على عهد النبي صلى الله عليه وسلم فلعنها - فقال النبي صلى الله عليه وسلم ‏\"‏ لا تلعنها فإنها مأمورة وإنه من لعن شيئا ليس له بأهل رجعت اللعنة عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man cursed the wind. The narrator Muslim's version has: The wind snatched away a man's cloak during the time of the Prophet (ﷺ) and he cursed it. The Prophet (ﷺ) said: Do not curse it, for it is under command, and if anyone curses a thing undeservedly, the curse returns upon him.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20205",
        "30136",
        "20211",
        "20205",
        "11019",
        "11618",
        "15",
        "17",
        "20285"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1077",
      "hadith_no": "1077",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا إسماعيل بن أبان الوراق، عن يحيى بن يعلى الأسلمي، عن أبي فروة، يزيد بن سنان عن زيد، وهو ابن أبي أنيسة عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كبر على جنازة فرفع يديه في أول تكبيرة ووضع اليمنى على اليسرى ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ واختلف أهل العلم في هذا فرأى أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن يرفع الرجل يديه في كل تكبيرة على الجنازة ‏.‏ وهو قول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم لا يرفع يديه إلا في أول مرة ‏.‏ وهو قول الثوري وأهل الكوفة ‏.‏ وذكر عن ابن المبارك أنه قال في الصلاة على الجنازة لا يقبض يمينه على شماله ‏.‏ ورأى بعض أهل العلم أن يقبض بيمينه على شماله كما يفعل في الصلاة ‏.‏ قال أبو عيسى يقبض أحب إلى ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Messenger of Allah said, 'Allahu Akbar' over the deceased, so he raised his hands with the first Takbir, and he placed his right (hand) over his left.\"",
      "usc_msa_ref": "",
      "chain": [
        "20312",
        "15",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2286",
      "hadith_no": "2286",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا وكيع، عن الأعمش، عن زيد، نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "11060",
        "15"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-6",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبان، قال حدثنا يحيى بن أبي كثير، عن الحضرمي بن لاحق، عن زيد، عن أبي سلام، عن الحكم بن ميناء، أنه سمع ابن عباس، وابن، عمر يحدثان أن رسول الله صلى الله عليه وسلم قال وهو على أعواد منبره ‏\"‏ لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم وليكونن من الغافلين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Hakam bin Mina' that:                     He heard Ibn Abbas and Ibn Umar narrated that while he was on the minbar, the Messenger of Allah (ﷺ) said: \"People should stop negleting jumu'ah or Allah (SWT) will place a seal on their hearts and they will be deemed as being among the negligent.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20218",
        "20577",
        "11449",
        "12060",
        "15",
        "11840",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1441",
      "hadith_no": "1441",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرني محمد بن وهب، قال حدثني محمد بن سلمة، قال حدثني أبو عبد الرحيم، قال حدثني زيد، عن أيوب، - وهو ابن عائذ - عن بكير بن الأخنس، عن مجاهد أبي الحجاج، عن ابن عباس، قال فرضت صلاة الحضر على لسان نبيكم صلى الله عليه وسلم أربعا وصلاة السفر ركعتين وصلاة الخوف ركعة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The prayer of the resident was enjoined on the tongue of your Prophet (ﷺ), four (rak'ahs), and the prayer of the traveler is two rak'ahs, and the prayer of fear is one rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "15",
        "11621",
        "10748",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1706",
      "hadith_no": "1706",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا معمر بن مخلد، - ثقة - قال حدثنا عبيد الله بن عمرو، عن زيد، عن حبيب بن أبي ثابت، عن محمد بن علي، عن ابن عباس، قال استيقظ رسول الله صلى الله عليه وسلم فاستن وساق الحديث ‏.‏",
      "text_en": " 'Ubaidullah bin'Amr bin Zaid narrated from Habib bin Abi Thabit, from Muhammad bin Ali that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) woke up and cleaned his teeth,' and he quoted the hadith.",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "38642",
        "30024",
        "15",
        "11331",
        "11442",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1931",
      "hadith_no": "1931",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن وهب بن أبي كريمة الحراني، حدثنا محمد بن سلمة، - وهو الحراني - عن أبي عبد الرحيم، حدثني زيد، عن وهب بن كيسان، عن معبد بن كعب، عن أبي قتادة، قال كنا جلوسا عند رسول الله صلى الله عليه وسلم إذ طلعت جنازة فقال رسول الله صلى الله عليه وسلم ‏\"‏ مستريح ومستراح منه المؤمن يموت فيستريح من أوصاب الدنيا ونصبها وأذاها والفاجر يموت فيستريح منه العباد والبلاد والشجر والدواب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Qatadah said:                     \"We were sitting with the Messenger of Allah when a funeral appeared. The Messenger of Allah said: 'He is relieved and others are relieved of him. When the believer dies he is relieved of the calamities, hardships and troubles of this world, and when the evildoer dies, the people, the land, the trees and the animals are relieved of him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "15",
        "11231",
        "391"
      ]
    },
    {
      "id": "sunan-an-nasai-2211",
      "hadith_no": "2211",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن زيد، عن أبي إسحاق، عن عبد الله بن الحارث، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله تبارك وتعالى يقول الصوم لي وأنا أجزي به وللصائم فرحتان حين يفطر وحين يلقى ربه والذي نفسي بيده لخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that the Messenger of Allah said:                     \"Allah, may He be blessed and exalted, says: 'Fasting is for me and I shall reward for it. The fasting person has two moments of joy: When he breaks his fast and when he meets his Lord.' By the One in whose hand is my soul, the smell that comes from the mouth of the fasting person is better before Allah than the fragrance of musk.\" '",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "28464",
        "11201",
        "15",
        "11049",
        "912",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-2748",
      "hadith_no": "2748",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت زيدا، وأبا، بكر ابنى محمد بن زيد أنهما سمعا نافعا، يحدث عن عبد الله بن عمر، عن النبي صلى الله عليه وسلم أنه كان يقول ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Prophet used to say:                     \"Labbaika Allahumma Labbaik, Labbaika la sharika laka labbaik. Innal-hamda wan-ni'mata laka wal-mulk, la sharika lak (Here I am, O Allah, here I am. Here I am, You have no partner, here I am. Verily all praise and blessings are Yours, and all sovereignty, You have no partner).\"",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "20020",
        "15",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3332",
      "hadith_no": "3332",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله بن عمرو، عن زيد، عن عدي بن ثابت، عن يزيد بن البراء، عن أبيه، قال أصبت عمي ومعه راية فقلت أين تريد فقال بعثني رسول الله صلى الله عليه وسلم إلى رجل نكح امرأة أبيه فأمرني أن أضرب عنقه وآخذ ماله ‏.‏",
      "text_en": " It was narrated from Yazid bin Al-Bara' that his father said:                      \"I met my maternal uncle who was carrying a flag (for an expedition) and I said: 'Where are you going?' He said: 'The Messenger of Allah is sending me to a man who has married his father's wife, and he has commanded me to strike his neck (kill him) and seize his wealth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "108",
        "30024",
        "15",
        "11372"
      ]
    },
    {
      "id": "sunan-an-nasai-3709",
      "hadith_no": "3709",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرني محمد بن وهب، قال حدثنا محمد بن سلمة، قال حدثني أبو عبد الرحيم، قال حدثني زيد، عن أبي الزبير، عن طاوس، عن ابن عباس، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ترقبوا أموالكم فمن أرقب شيئا فهو لمن أرقبه ‏\"‏ ‏.‏",
      "text_en": " Zaid narrated from Abu Az-Zubair, from Tawus, from Ibn 'Abbas that the Messenger of Allah said:                      \"Do not give away your property on the basis of Ruqba, for whoever gives a gift on that basis, it belongs to the one to whom he gave it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "15",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3716",
      "hadith_no": "3716",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن ابن طاوس، عن أبيه، عن حجر المدري، عن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى للوارث ‏\"‏ ‏.‏",
      "text_en": " Sufyan narrated from Ibn Tawus, from his father, from Hujr Al-Madari, from Zaid, who said:                      \"The Messenger of Allah said: 'Umra (a gift given for life) is for the heir.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11433",
        "11053",
        "15"
      ]
    },
    {
      "id": "sunan-an-nasai-4075",
      "hadith_no": "4075",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا معاوية بن صالح الأشعري، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن أبي نضرة، عن أبي برزة، قال غضب أبو بكر على رجل غضبا شديدا حتى تغير لونه قلت يا خليفة رسول الله والله لئن أمرتني لأضربن عنقه فكأنما صب عليه ماء بارد فذهب غضبه عن الرجل ‏.‏ قال ثكلتك أمك أبا برزة وإنها لم تكن لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب أبو نصر واسمه حميد بن هلال خالفه شعبة ‏.‏",
      "text_en": " It was narrated from Abu Nadrah, that Abu Barzah said:                     \"Abu Bakr got very angry with a man, so much so that his color changed. I said: 'O Khalifah of the Messenger of Allah, if you tell me to, I will strike his neck (kill him).' It was as if cold water had been poured on him and he became calm. He said: 'May your mother be bereft of you, Abu Barzah! That is not for anyone after the Messenger of Allah [SAW].'\"",
      "usc_msa_ref": "",
      "chain": [
        "37535",
        "108",
        "11201",
        "15",
        "11381",
        "10721",
        "227"
      ]
    },
    {
      "id": "sunan-an-nasai-4546",
      "hadith_no": "4546",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن علي بن ميمون، قال حدثنا محمد بن يوسف الفريابي، قال حدثنا سفيان، عن إسماعيل بن أمية، عن عبد الله بن يزيد، عن زيد، عن سعد بن مالك، قال سئل رسول الله صلى الله عليه وسلم عن الرطب بالتمر فقال ‏\"‏ أينقص إذا يبس ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فنهى عنه ‏.‏",
      "text_en": " It was narrated that Sa 'd bin Malik said:                     \"The Messenger of Allah was asked about (buying) said; 'Will fresh dates decrees (in weight or volume) when they dry out? 'They said 'yes so he forbade that\"",
      "usc_msa_ref": "",
      "chain": [
        "38556",
        "20034",
        "20012",
        "11417",
        "1945",
        "15"
      ]
    },
    {
      "id": "sunan-an-nasai-5140",
      "hadith_no": "5140",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني زيد، عن أبي سلام، عن أبي أسماء الرحبي، أن ثوبان، مولى رسول الله صلى الله عليه وسلم حدثه قال جاءت بنت هبيرة إلى رسول الله صلى الله عليه وسلم وفي يدها فتخ - فقال كذا في كتاب أبي أى خواتيم ضخام - فجعل رسول الله صلى الله عليه وسلم يضرب يدها فدخلت على فاطمة بنت رسول الله صلى الله عليه وسلم تشكو إليها الذي صنع بها رسول الله صلى الله عليه وسلم فانتزعت فاطمة سلسلة في عنقها من ذهب وقالت هذه أهداها إلى أبو حسن فدخل رسول الله صلى الله عليه وسلم والسلسلة في يدها فقال ‏\"‏ يا فاطمة أيغرك أن يقول الناس ابنة رسول الله وفي يدها سلسلة من نار ‏\"‏ ‏.‏ ثم خرج ولم يقعد فأرسلت فاطمة بالسلسلة إلى السوق فباعتها واشترت بثمنها غلاما - وقال مرة عبدا - وذكر كلمة معناها فأعتقته فحدث بذلك فقال ‏\"‏ الحمد لله الذي أنجى فاطمة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Asma' Ar-Rahabi that Thawban, the freed slave of the Messenger of Allah [SAW], told him:                     \"Fatimah bint Hubairah came to the Messenger of Allah [SAW] with a big ring on her hand.\" He (the narrator) said: \"This is what I found in the book of my father, a huge ring.\"- \"The Messenger of Allah [SAW] started hitting her hand, so she entered upon Fatimah, the daughter of the Messenger of Allah [SAW], and complained to her about what the Messenger of Allah [SAW] had done. Fatimah took off a gold chain from her neck and said: 'This was given to me by Abu Hasan.' The Messenger of Allah [SAW] came in and (ﷺ) the chain in her hand. He said: 'O Fatimah, would you like the people to say that the daughter of the Messenger of Allah [SAW] has a chain of fire in her hand?' Then he went out, without sitting down. Fatimah sent the chain to the market and sold it, and she bought a slave with the money, and set him free. He was told of that and he said: 'Praise be to Allah, Who has saved Fatimah from the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11449",
        "15",
        "10883"
      ]
    },
    {
      "id": "sunan-an-nasai-5534",
      "hadith_no": "5534",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني العلاء بن هلال، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن القاسم بن عبد الرحمن، عن مسروق بن الأجدع، عن عائشة، قالت طلبت رسول الله صلى الله عليه وسلم ذات ليلة في فراشي فلم أصبه فضربت بيدي على رأس الفراش فوقعت يدي على أخمص قدميه فإذا هو ساجد يقول ‏\"‏ أعوذ بعفوك من عقابك وأعوذ برضاك من سخطك وأعوذ بك منك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I looked for the Messenger of Allah [SAW] one night in my bed, and I did not find him. I struck my hand on the head of the bed, and my hand fell on the soles of his feet. He was prostrating and saying: 'A'udhu bi 'afwika min 'iqabika, wa a'udhu bi ridaka min sakhatika, wa a'udhu bika minka (I seek refuge in Your forgiveness from Your punishment, and I seek refuge in Your pleasure from Your wrath, and I seek refuge in You from You.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "28464",
        "11201",
        "15",
        "11381",
        "19896",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1001",
      "hadith_no": "1001",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أسامة بن زيد، عن محمد بن قيس، - هو قاص عمر بن عبد العزيز - عن أبيه، عن أم سلمة، قالت كان النبي  صلى الله عليه وسلم  يصلي في حجرة أم سلمة فمر بين يديه عبد الله أو عمر بن أبي سلمة فقال بيده فرجع فمرت زينب بنت أم سلمة فقال بيده هكذا فمضت فلما صلى رسول الله  صلى الله عليه وسلم  قال ‏\"‏ هن أغلب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Prophet (ﷺ) wasperformingprayer in the house of Umm Salamah, and ‘Abdullah or ‘UmarbinAbu Salamah passed in front of him; he gestured his hand, and hewentback. Then Zainab bint Umm Salamah passed in front of him, and hegestured his hand, but she kept going. When the Messenger of Allah(ﷺ) finished his prayer, he said: ‘These (women) are morestubborn.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "50",
        "15",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-1878",
      "hadith_no": "1878",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بدر، عباد بن الوليد حدثنا محمد بن الفضل، حدثنا ابن المبارك، عن أسامة بن زيد، عن أبيه، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تؤخذ صدقات المسلمين على مياههم ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar narrated that:                     the Messenger of Allah said: “The Sadaqah of Muslims should be taken at their watering places.”",
      "usc_msa_ref": "",
      "chain": [
        "36577",
        "20283",
        "20025",
        "50",
        "15",
        "18"
      ]
    }
  ],
  "total_hadiths": 38
}