{
  "id": "15000",
  "name": "Aban bin Ishaq al-Asady أبان بن إسحاق الأسدي",
  "full_name": "Aban bin Ishaq al-Asady أبان بن إسحاق الأسدي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  -  ثقة ]"
    ],
    "tags": [
      "B.Asad",
      "al-Azdi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-2646",
      "hadith_no": "2646",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا محمد بن عبيد، عن أبان بن إسحاق، عن الصباح بن محمد، عن مرة الهمداني، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استحيوا من الله حق الحياء ‏\"‏ ‏.‏ قال قلنا يا رسول الله إنا لنستحيي والحمد لله ‏.‏ قال ‏\"‏ ليس ذاك ولكن الاستحياء من الله حق الحياء أن تحفظ الرأس وما وعى وتحفظ البطن وما حوى وتتذكر الموت والبلى ومن أراد الآخرة ترك زينة الدنيا فمن فعل ذلك فقد استحيا من الله حق الحياء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من هذا الوجه من حديث أبان بن إسحاق عن الصباح بن محمد ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:                     \" Have Haya' for Allah as is His due.\" [He said:] We said: \"O Prophet of Allah! We have Haya', and all praise is due to Allah.\" He said: \"Not that, but having the Haya' for Allah which He is due is to protect the head and what it contains and to protect the insides and what it includes, and to remember death and the trial, and whoever intends the Hereafter, he leaves the adornments of the world. So whoever does that, then he has indeed fulfilled Haya', meaning the Haya' which Allah is due.\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30213",
        "15000",
        "9759",
        "16"
      ]
    }
  ],
  "total_hadiths": 1
}