{
  "id": "15022",
  "name": "al-Aghr bin al-Sbah al-Tmymy الأغر بن الصباح التميمي المنقري",
  "full_name": "al-Aghr bin al-Sbah al-Tmymy الأغر بن الصباح التميمي المنقري",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-MunQari",
      "Client",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18261",
      "name": "Khlyfh bin Husayn bin Qays خليفة بن حصين بن قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "194",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثني أبو بكر بن حفص، عن الأغر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوضوء مما أنضجت النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      The Messenger of Allah (ﷺ) said: Perform ablution after eating anything which has been cooked by fire.",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11180",
        "15022",
        "13"
      ]
    },
    {
      "hadith_no": "355",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير العبدي، أخبرنا سفيان، حدثنا الأغر، عن خليفة بن حصين، عن جده، قيس بن عاصم قال أتيت النبي صلى الله عليه وسلم أريد الإسلام فأمرني أن أغتسل بماء وسدر ‏.‏",
      "text_en": " Narrated Qays ibn Asim:                     I came to the Prophet (ﷺ) with the intention of embracing Islam. He commanded me to take a bath with water (boiled with) the leaves of the lote-tree.",
      "chain": [
        "30169",
        "20012",
        "15022",
        "18261",
        "5242"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن كثير، حدثنا سفيان، عن مسعر، عن علي بن الأقمر، ح وحدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، - المعنى - عن الأغر، عن أبي سعيد، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أيقظ الرجل أهله من الليل فصليا أو صلى ركعتين جميعا كتبا في الذاكرين والذاكرات ‏\"‏ ‏.‏ ولم يرفعه ابن كثير ولا ذكر أبا هريرة جعله كلام أبي سعيد ‏.‏ قال أبو داود رواه ابن مهدي عن سفيان قال وأراه ذكر أبا هريرة ‏.‏ قال أبو داود وحديث سفيان موقوف ‏.‏",
      "text_en": " Narrated AbuSa'id and AbuHurayrah:                     The Prophet (ﷺ) said: If a man awakens his wife at night, and then both pray or both offer two rak'ahs together, the (name of the )man will be recorded among those who mention the name of Allah, and the (name of the) woman will be recorded among those who mention the name of Allah. Ibn Kathir did not narrate this tradition as a statement of the Prophet (ﷺ), but he reported it as a statement of Abu Sa'id.Abu Dawud said: This tradition has been narrated by Ibn Mahdi from Sufyan and I think he mentioned the name of Sufyan. He also said: The tradition transmitted by Sufyan is a statement of the Companion (and not that of the Prophet).",
      "chain": [
        "30169",
        "20012",
        "20359",
        "11375",
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "2387",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، - يعني الزبيري - أخبرنا إسرائيل، عن أبي العنبس، عن الأغر، عن أبي هريرة، أن رجلا، سأل النبي صلى الله عليه وسلم عن المباشرة للصائم فرخص له وأتاه آخر فسأله فنهاه ‏.‏ فإذا الذي رخص له شيخ والذي نهاه شاب ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A man  asked the Prophet (ﷺ) whether one who was fasting could embrace (his wife) and he gave him permission; but when another man came to him, and asked him, he forbade him. The one to whom he gave permission was an old man and the one whom he forbade was a youth.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "15022",
        "13"
      ]
    },
    {
      "hadith_no": "605",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن الأغر بن الصباح، عن خليفة بن حصين، عن قيس بن عاصم، أنه أسلم فأمره النبي صلى الله عليه وسلم أن يغتسل بماء وسدر ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من هذا الوجه ‏.‏ والعمل عليه عند أهل العلم يستحبون للرجل إذا أسلم أن يغتسل ويغسل ثيابه ‏.‏",
      "text_en": " Qais bin Asim narrated that:                     he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "15022",
        "18261",
        "5242"
      ]
    },
    {
      "hadith_no": "3623",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا محمد بن يوسف الفريابي، حدثنا قيس بن الربيع، عن الأغر بن الصباح، عن خليفة بن حصين، عن أبي نصر، عن ابن عباس، في قوله تعالى ‏:‏ ‏(‏ إذا جاءكم المؤمنات مهاجرات فامتحنوهن ‏)‏ قال كانت المرأة إذا جاءت النبي صلى الله عليه وسلم لتسلم حلفها بالله ما خرجت من بغض زوجي ما خرجت إلا حبا لله ولرسوله ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " [Abu An-Nasr narrated :                     from Ibn Abbas, regarding the saying of Allah, the Most High: When believing women come to you as emigrants, examine them. He said: “When a woman come to the Prophet to accept Islam, she would have to take and an oath by Allah: ‘I have not left out of anger with my husband, I have not left except out of love for Allah and His Messenger.’”]",
      "chain": [
        "30417",
        "20034",
        "25246",
        "15022",
        "18261"
      ]
    },
    {
      "hadith_no": "3520",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا علي بن ثابت، حدثني قيس بن الربيع، وكان، من بني أسد عن الأغر بن الصباح، عن خليفة بن حصين، عن علي بن أبي طالب، قال أكثر ما دعا به رسول الله صلى الله عليه وسلم عشية عرفة في الموقف ‏\"‏ اللهم لك الحمد كالذي نقول وخيرا مما نقول اللهم لك صلاتي ونسكي ومحياى ومماتي وإليك مآبي ولك رب تراثي اللهم إني أعوذ بك من عذاب القبر ووسوسة الصدر وشتات الأمر اللهم إني أعوذ بك من شر ما تجيء به الريح ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Ali bin Abi Talib said:                     “The most of what the Messenger of Allah supplicated with during the afternoon at Arafat while standing was: ‘O Allah to You is the praise like the one You say, and better than what we say. O Allah, for You is all my Salat, my sacrifice, my living and my dying. And to You is my return, and to You, my Lord, belongs my inheritance. O Allah, indeed, I seek refuge in You from the punishment of the grave, the whispering of the chest, and the diving of the affair. O Allah, indeed, I seek refuge in You from the evil of what the wing brings (Allahumma Lakal-Hamdu, Kalladhi Taqulu, Wa  Khairan Mimma Naqul. Allahumma Laka Salati Wa Nusuki, Wa Mahyaya Wa Mamati, Ilaika Mabi, Wa Laka, Rabbi, Turath. Allahumma Inni A’udhu Bika Min Adhabil-Qabri, Wa Waswasatis-Sadri, WA Shatatil-Amr. Allahumma Inni A’udhu Bika Min Sharri Ma Taji’u Bihir-Rih).”",
      "chain": [
        "38487",
        "28408",
        "25246",
        "15022",
        "18261",
        "5"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، عن الأغر، - وهو ابن الصباح - عن خليفة بن حصين، عن قيس بن عاصم، أنه أسلم فأمره النبي صلى الله عليه وسلم أن يغتسل بماء وسدر ‏.‏",
      "text_en": " It was narrated from Qais bin 'Asim that he accepted Islam, and the Prophet commanded him to perform Ghusl with water and lotus leaves.",
      "chain": [
        "30153",
        "20031",
        "20012",
        "15022",
        "18261",
        "5242"
      ]
    },
    {
      "hadith_no": "2899",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا محمد، قال حدثنا شعبة، عن سعد بن إبراهيم، قال سمعت أبا سلمة، قال سألت الأغر عن هذا الحديث، فحدث الأغر، أنه سمع أبا هريرة، يحدث أن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه من المساجد إلا الكعبة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet said:                     \"One prayer in this Masjid of mine is better than a thousand prayers in any other Masjid except Al-Masjid Al-Kabah.'\"",
      "chain": [
        "30153",
        "20278",
        "20020",
        "11063",
        "10567",
        "15022",
        "13"
      ]
    },
    {
      "hadith_no": "1396",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، حدثنا شيبان أبو معاوية، عن الأعمش، عن علي بن الأقمر، عن الأغر، عن أبي سعيد، وأبي، هريرة عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا استيقظ الرجل من الليل وأيقظ امرأته فصليا ركعتين كتبا من الذاكرين الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed and Abu Hurairah said that theProphet(ﷺ) said:                      ‘When a man wakes up at night and wakes his wife,andthey pray two Rak’ah, they will be recorded among the men andwomenwho remember Allah much.”",
      "chain": [
        "20733",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    }
  ],
  "total_hadiths": 10
}