{
  "id": "15086",
  "name": "Hryth bin Zuhyr حريث بن ظهير",
  "full_name": "Hryth bin Zuhyr حريث بن ظهير",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "al-Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ س  -  مجهول ]"
    ],
    "tags": [
      "al-Kufa",
      "al-Sham"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11378",
      "name": "Amarh bin 'Umayr al-Tymy عمارة بن عمير التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5398",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثنا الفريابي، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن حريث بن ظهير، عن عبد الله بن مسعود، قال أتى علينا حين ولسنا نقضي ولسنا هنالك وإن الله عز وجل قدر أن بلغنا ما ترون فمن عرض له قضاء بعد اليوم فليقض فيه بما في كتاب الله فإن جاء أمر ليس في كتاب الله فليقض بما قضى به نبيه فإن جاء أمر ليس في كتاب الله ولم يقض به نبيه صلى الله عليه وسلم فليقض بما قضى به الصالحون ولا يقول أحدكم إني أخاف وإني أخاف فإن الحلال بين والحرام بين وبين ذلك أمور مشتبهة فدع ما يريبك إلى ما لا يريبك‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"There was a time when we did not pass so many judgments, but now that time is over. Now Allah, the Mighty and Sublime, has decreed that we reach a time when, as you see, (we are asked to pass many judgments). Whoever among you is asked to pass a judgment after this day, let him pass judgment according to what is in the Book of Allah. If he is faced with a matter that is not mentioned in the Book of Allah, let him pass judgment according to the way His Prophet [SAW] passed judgment. If he is faced with a matter that is not mentioned in the Book of Allah, and concerning which His Prophet did not pass judgment, then let him pass judgment according to the way the righteous passed judgment. And let him not say 'I am afraid, I am afraid.' For that which is lawful is clear and that which is unlawful is clear, and between them are matters which are not as clear. Leave that which makes you doubt for that which does not make you doubt.\"",
      "chain": [
        "38556",
        "20034",
        "20012",
        "11060",
        "11378",
        "15086",
        "16"
      ]
    }
  ],
  "total_hadiths": 1
}