{
  "id": "15100",
  "name": "Husayn bin Qbys'h al-Fzary حصين بن قبيصة الفزاري الكوفي",
  "full_name": "Husayn bin Qbys'h al-Fzary حصين بن قبيصة الفزاري الكوفي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Fazari",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10763",
      "name": "Rakayn bin al-Rabi' bin 'Amila ركين بن الربيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11648",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-206",
      "hadith_no": "206",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبيدة بن حميد الحذاء، عن الركين بن الربيع، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فجعلت أغتسل حتى تشقق ظهري فذكرت ذلك للنبي صلى الله عليه وسلم - أو ذكر له - فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل إذا رأيت المذى فاغسل ذكرك وتوضأ وضوءك للصلاة فإذا فضخت الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " ‘Ali said:                      My prostatic fluid flowed excessively. I used to take a bath until my back cracked (because of frequent washing). I mentioned it to the prophet (May peace be upon him), or the fact was mentioned to him (by someone else). The Messenger of Allah (May peace be upon him) said; Do not do so. When you find prostatic fluid, wash your penis and perform ablution as you do for your prayer, but when you have seminal emission, you should take a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20341",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-194",
      "hadith_no": "194",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة بن سعيد، وعلي بن حجر، - واللفظ لقتيبة - قال حدثنا عبيدة بن حميد، عن الركين بن الربيع، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيت المذى فاغسل ذكرك وتوضأ وضوءك للصلاة وإذا فضخت الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"I was one who had a lot of prostatic discharge, and the Messenger of Allah (ﷺ) said to me: 'If you see Madhi (prostatic fluid) then wash your penis and perform Wudu' like that for Salah, but if you ejaculate semen, then perform Ghusl.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20387",
        "20341",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-195",
      "hadith_no": "195",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال أنبأنا عبد الرحمن، عن زائدة، ح وأخبرنا إسحاق بن إبراهيم، - واللفظ له - أنبأنا أبو الوليد، حدثنا زائدة، عن الركين بن الربيع بن عميلة الفزاري، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ إذا رأيت المذى فتوضأ واغسل ذكرك وإذا رأيت فضخ الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"I was one who had a lot of prostatic discharge, so I asked the Prophet (ﷺ) and he said: 'If you see Madhi (prostatic fluid) then perform Wudu' and wash your penis, but if you see semen ejaculated, then perform Ghusl.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20033",
        "20320",
        "30123",
        "20296",
        "20320",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-3705",
      "hadith_no": "3705",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شريك، عن عبد الملك بن عمير، عن حصين بن قبيصة، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا سفيان بن سهل لا تسبل فإن الله لا يحب المسبلين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Mughirah bin Shu’bah that the Messenger of Allah(ﷺ) said:                      “O Sufyan bin Sahl, do not let your garment hang, forAllah does not like those who let their garments hang below theankles.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20587",
        "11368",
        "15100",
        "166"
      ]
    }
  ],
  "total_hadiths": 4
}