{
  "id": "15116",
  "name": "Kharjh bin al-Slt al-Brjmy خارجة بن الصلت البرجمي",
  "full_name": "Kharjh bin al-Slt al-Brjmy خارجة بن الصلت البرجمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  -  مقبول ]"
    ],
    "tags": [
      "al-Ra'",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3420",
      "hadith_no": "3420",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت، عن عمه، أنه مر بقوم فأتوه فقالوا إنك جئت من عند هذا الرجل بخير فارق لنا هذا الرجل ‏.‏ فأتوه برجل معتوه في القيود فرقاه بأم القرآن ثلاثة أيام غدوة وعشية كلما ختمها جمع بزاقه ثم تفل فكأنما أنشط من عقال فأعطوه شيئا فأتى النبي صلى الله عليه وسلم فذكره له فقال النبي صلى الله عليه وسلم ‏\"‏ كل فلعمري لمن أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Kharijah b. al-Salt quoted his paternal uncle as saying that he passed by a clan (of the Arab) who came to him and said:                      You have brought what is good from this man. Then they brought a lunatic in chains. He recited Surat al-Fatihah over him three days, morning and evening. When he finished, he collected his saliva and then spat it out, (he felt relief) as if he were set free from a bond. They gave him something (as wages). He then came to the Prophet (ﷺ) and mentioned it to him. The Messenger of Allah (ﷺ) said: Accept it, for by my life, some accept it for a worthless charm, but you have done so far a genuine one.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "id": "sunan-abi-daud-3896",
      "hadith_no": "3896",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن زكريا، قال حدثني عامر، عن خارجة بن الصلت التميمي، عن عمه، أنه أتى رسول الله صلى الله عليه وسلم فأسلم ثم أقبل راجعا من عنده فمر على قوم عندهم رجل مجنون موثق بالحديد فقال أهله إنا حدثنا أن صاحبكم هذا قد جاء بخير فهل عندك شىء تداويه فرقيته بفاتحة الكتاب فبرأ فأعطوني مائة شاة فأتيت رسول الله صلى الله عليه وسلم فأخبرته فقال ‏\"‏ هل إلا هذا ‏\"‏ ‏.‏ وقال مسدد في موضع آخر ‏\"‏ هل قلت غير هذا ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ خذها فلعمري لمن أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Alaqah ibn Sahar at-Tamimi:                     Alaqah came to the Messenger of Allah (ﷺ) and embraced Islam. He then came back from him and passed some people who had a lunatic fettered in chains.  His people said: We are told that your companion has brought some good. Have you something with which you can cure him? I then recited Surat al-Fatihah and he was cured. They gave me one hundred sheep. I then came to the Messenger of Allah (ﷺ) and informed him of it.  He asked: Is it only this? The narrator, Musaddad, said in his other version: Did you say anything other than this?  I said: No.  He said: Take it, for by my life, some accept if for a worthless chain, but you have done so for a genuine one.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11338",
        "11052",
        "15116"
      ]
    },
    {
      "id": "sunan-abi-daud-3897",
      "hadith_no": "3897",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا ابن جعفر، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت، عن عمه، أنه مر - قال - فرقاه بفاتحة الكتاب ثلاثة أيام غدوة وعشية كلما ختمها جمع بزاقه ثم تفل فكأنما أنشط من عقال فأعطوه شيئا فأتى النبي صلى الله عليه وسلم ثم ذكر معنى حديث مسدد ‏.‏",
      "text_en": " Kharijah b. al-Salt quoted his parental uncle as saying that he passed (some people) :                      He recited Surat al-Fatihah over him for three days morning and evening. Whenever he finished it, he collected some of his saliva and spat it out, and he seemed as if he were set free from a bond. They gave him something as payment. He then came to the Prophet (ﷺ). He then transmitted the rest of the tradition to the same effect as Musaddad narrated.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    },
    {
      "id": "sunan-abi-daud-3901",
      "hadith_no": "3901",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن بشار، حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، عن خارجة بن الصلت التميمي، عن عمه، قال أقبلنا من عند رسول الله صلى الله عليه وسلم فأتينا على حى من العرب فقالوا إنا أنبئنا أنكم جئتم من عند هذا الرجل بخير فهل عندكم من دواء أو رقية فإن عندنا معتوها في القيود قال فقلنا نعم ‏.‏ قال فجاءوا بمعتوه في القيود - قال - فقرأت عليه فاتحة الكتاب ثلاثة أيام غدوة وعشية كلما ختمتها أجمع بزاقي ثم أتفل فكأنما نشط من عقال قال فأعطوني جعلا فقلت لا حتى أسأل رسول الله صلى الله عليه وسلم فقال ‏\"‏ كل فلعمري من أكل برقية باطل لقد أكلت برقية حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Alaqah ibn Sahar at-Tamimi:                     We proceeded from the Messenger of Allah (ﷺ) and came to a clan of the Arabs.  They said: We have been told that you have brought what is good from this man. Have you any medicine or a charm, for we have a lunatic in chains?  We said: Yes. Then they brought a lunatic in chains.  He said: I recited Surat al-Fatihah over him for three days, morning and evening. Whenever I finished it, I would collect my saliva and spit it out, and he seemed as if he were set free from a bond. He said: They gave me some payment, but I said: No, not until I ask the Messenger of Allah (ﷺ).  He (the Prophet) said: Accept it, for, by my life, some accept it for a worthless charm, but you have done so for a genuine one.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30160",
        "20173",
        "20020",
        "11636",
        "11052",
        "15116"
      ]
    }
  ],
  "total_hadiths": 4
}