{
  "id": "15113",
  "name": "Hnsh bin al-Ma'tmr حنش بن المعتمر",
  "full_name": "Hnsh bin al-Ma'tmr حنش بن المعتمر",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ د  ت  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Kanani",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5324",
      "name": "Wabsa bin Ma'bad bin 'Utba ( وابصة بن معبد الأسدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4163",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن قرة بن عبد الرحمن المعافري، وعمرو، بن الحارث وغيرهما أن عامر بن يحيى المعافري، أخبرهم عن حنش، أنه قال كنا مع فضالة بن عبيد في غزوة فطارت لي ولأصحابي قلادة فيها ذهب وورق وجوهر فأردت أن أشتريها فسألت فضالة بن عبيد فقال انزع ذهبها فاجعله في كفة واجعل ذهبك في كفة ثم لا تأخذن إلا مثلا بمثل فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يأخذن إلا مثلا بمثل ‏\"‏ ‏.‏",
      "text_en": " Hanash reported:                      We were along with Fadala b. Ubaid (Allah be pleased with him) in an expedition. There fell to my and my friend's lot a necklace made of gold, silver and jewels. I decided to buy that. I asked Fadala b. 'Ubaid, whereupon he said: Separate its gold and place it in one pan (of the balance) and place your gold in the other pan, and do not receive but equal for equal, for I heard Allah's Messenger (may peace be upon him) as saying: He who believes in Allah and the Hereafter should not take but equal for equal.",
      "chain": [
        "20029",
        "20377",
        "10925",
        "15113"
      ]
    },
    {
      "hadith_no": "2790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شريك، عن أبي الحسناء، عن الحكم، عن حنش، قال رأيت عليا يضحي بكبشين فقلت ما هذا فقال إن رسول الله صلى الله عليه وسلم أوصاني أن أضحي عنه فأنا أضحي عنه ‏.‏",
      "text_en": " Narrated Hanash:                     I saw Ali sacrificing two rams; so I asked him: What is this? He replied. The Messenger of Allah (ﷺ) enjoined upon me to sacrifice on his behalf, so that is what I am doing.",
      "chain": [
        "30203",
        "20587",
        "11069",
        "15113"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، وأبو بكر بن أبي شيبة وأحمد بن منيع قالوا حدثنا ابن المبارك، ح وحدثنا ابن العلاء، أخبرنا ابن المبارك، عن سعيد بن يزيد، حدثني خالد بن أبي عمران، عن حنش، عن فضالة بن عبيد، قال أتي النبي صلى الله عليه وسلم عام خيبر بقلادة فيها ذهب وخرز - قال أبو بكر وابن منيع فيها خرز معلقة بذهب - ابتاعها رجل بتسعة دنانير أو بسبعة دنانير فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينه وبينه ‏\"‏ ‏.‏ فقال إنما أردت الحجارة فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينهما ‏\"‏ ‏.‏ قال فرده حتى ميز بينهما ‏.‏ وقال ابن عيسى أردت التجارة ‏.‏ قال أبو داود وكان في كتابه الحجارة فغيره فقال التجارة ‏.‏",
      "text_en": " Narrated Fudalah ibn Ubayd:                     The Prophet (ﷺ) was brought a necklace in which there were gold and pearls. (The narrators AbuBakr and (Ahmad) Ibn Mani' said: The pearls were set with gold in it, and a man bought it for nine or seven dinars.) The Prophet (ﷺ) said: (It must not be sold) till the contents are considered separately. The narrator said: He returned it till the contents were considered separately. The narrator Ibn Asa said: By this I intended trade.Abu Dawud said: The word hijarah (stone) was recorded in his note-book before, but he changed it and narrated tijarah (trade).",
      "chain": [
        "31167",
        "20025",
        "20025",
        "10906",
        "15113",
        "1935"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن عون، قال أخبرنا شريك، عن سماك، عن حنش، عن علي، عليه السلام قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن قاضيا فقلت يا رسول الله ترسلني وأنا حديث السن ولا علم لي بالقضاء فقال ‏\"‏ إن الله سيهدي قلبك ويثبت لسانك فإذا جلس بين يديك الخصمان فلا تقضين حتى تسمع من الآخر كما سمعت من الأول فإنه أحرى أن يتبين لك القضاء ‏\"‏ ‏.‏ قال فما زلت قاضيا أو ما شككت في قضاء بعد ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) sent me to the Yemen as judge, and I asked: Messenger of Allah, are you sending me when I am young and have no knowledge of the duties of a judge? He replied: Allah will guide your heart and keep your tongue true. When two litigants sit in front of you, do not decide till you hear what the other has to say as you heard what the first had to say; for it is best that you should have a clear idea of the best decision. He said: I had been a judge (for long); or he said (the narrator is doubtful): I have no doubts about a decision afterwards.",
      "chain": [
        "30154",
        "20587",
        "10770",
        "15113"
      ]
    },
    {
      "hadith_no": "188",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من جمع بين الصلاتين من غير عذر فقد أتى بابا من أبواب الكبائر ‏\"‏ ‏.‏ قال أبو عيسى وحنش هذا هو أبو علي الرحبي وهو حسين بن قيس وهو ضعيف عند أهل الحديث ضعفه أحمد وغيره ‏.‏ والعمل على هذا عند أهل العلم أن لا يجمع بين الصلاتين إلا في السفر أو بعرفة ‏.‏ ورخص بعض أهل العلم من التابعين في الجمع بين الصلاتين للمريض وبه يقول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم يجمع بين الصلاتين في المطر وبه يقول الشافعي وأحمد وإسحاق ‏.‏ ولم ير الشافعي للمريض أن يجمع بين الصلاتين ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"Whoever combines two prayers without any excuse then he has committed something from the major sins.\"",
      "chain": [
        "30460",
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد، حدثنا حسين الجعفي، عن زائدة، عن سماك بن حرب، عن حنش، عن علي، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا تقاضى إليك رجلان فلا تقض للأول حتى تسمع كلام الآخر فسوف تدري كيف تقضي ‏\"‏ ‏.‏ قال علي فما زلت قاضيا بعد ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Ali narrated:                      \"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" 'Ali said: \"I did not err since then.\"",
      "chain": [
        "30480",
        "20315",
        "20320",
        "10770",
        "15113",
        "5"
      ]
    },
    {
      "hadith_no": "1495",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن عبيد المحاربي الكوفي، حدثنا شريك، عن أبي الحسناء، عن الحكم، عن حنش، عن علي، أنه كان يضحي بكبشين أحدهما عن النبي صلى الله عليه وسلم والآخر عن نفسه، فقيل له فقال أمرني به يعني النبي صلى الله عليه وسلم - فلا أدعه أبدا ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك ‏.‏ وقد رخص بعض أهل العلم أن يضحى عن الميت ولم ير بعضهم أن يضحى عنه ‏.‏ وقال عبد الله بن المبارك أحب إلى أن يتصدق عنه ولا يضحى عنه وإن ضحى فلا يأكل منها شيئا ويتصدق بها كلها ‏.‏ قال محمد قال علي بن المديني وقد رواه غير شريك ‏.‏ قلت له أبو الحسناء ما اسمه فلم يعرفه ‏.‏ قال مسلم اسمه الحسن ‏.‏",
      "text_en": " Narrated Hanash:                     That 'Ali used to slaughter two male sheep, one for the Prophet (ﷺ) and the other for himself. When this was mentioned to him, he said: \"He ordered me to\" - meaning the Prophet (ﷺ) - \"So I will never leave it.\"",
      "chain": [
        "30213",
        "20587",
        "11069",
        "15113",
        "5"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن حنش، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ من قبض يتيما بين المسلمين إلى طعامه وشرابه أدخله الله الجنة البتة إلا أن يعمل ذنبا لا يغفر له ‏\"‏ ‏.‏ قال وفي الباب عن مرة الفهري وأبي هريرة وأبي أمامة وسهل بن سعد ‏.‏ قال أبو عيسى وحنش هو حسين بن قيس وهو أبو علي الرحبي وسليمان التيمي يقول حنش وهو ضعيف عند أهل الحديث ‏.‏",
      "text_en": " Ibn 'Abbas narrated that:                     the Prophet said: Whoever takes in an orphan among the Muslims to raise, to feed him and give him drink, Allah admits him into Paradise without a doubt, unless he has done a sin for which he is not forgiven.\"",
      "chain": [
        "38240",
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2519",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا معتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، قال جاء رجل يطلب نبي الله صلى الله عليه وسلم بدين أو بحق فتكلم ببعض الكلام فهم صحابة رسول الله صلى الله عليه وسلم به فقال رسول الله صلى الله عليه وسلم ‏\"‏ مه إن صاحب الدين له سلطان على صاحبه حتى يقضيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “A man came to ask the Prophet of Allah (ﷺ) for some debt or some right, and he spoke harshly to him, and the Companions of the Messenger of Allah (ﷺ) wanted to rebuke him. But the Messenger of Allah (ﷺ) said: 'Let him be, for the one who is owed something has authority over the debtor, until it is paid off.' ”",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2540",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، قال أصاب نبي الله صلى الله عليه وسلم خصاصة فبلغ ذلك عليا فخرج يلتمس عملا يصيب فيه شيئا ليغيث به رسول الله صلى الله عليه وسلم فأتى بستانا لرجل من اليهود فاستقى له سبعة عشر دلوا كل دلو بتمرة فخيره اليهودي من تمره سبع عشرة عجوة فجاء بها إلى نبي الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     “The Prophet (ﷺ) was in need of food, and news of that reached 'Ali. He went out seeking work so that he could earn something to give to the Messenger of Allah (ﷺ). He came to a garden belonging to a Jewish man, and he drew seventeen buckets of water for him, each bucket for a date. The Jew gave him the option to take seventeen of his 'Ajwah dates (a high quality of dates) and he brought them to the Prophet of Allah (ﷺ).”",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2762",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا معتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقتل مؤمن بكافر ولا ذو عهد في عهده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     ”A believer should not be killed in retaliation for the murder of a disbeliever, and a person who has a treaty should not be killed during the time of the treaty.”",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2785",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ المسلمون تتكافأ دماؤهم وهم يد على من سواهم يسعى بذمتهم أدناهم ويرد على أقصاهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     “The blood of every Muslims is equal, they are one hand against others. The asylum offered by the lowest of them in status applies to them (all), and the return is granted to the farthest of them.”",
      "chain": [
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 12
}