{
  "id": "15129",
  "name": "Da'ud bin Yazid bin Abd داود بن يزيد",
  "full_name": "Da'ud bin Yazid bin Abd داود بن يزيد",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "151",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ بخ  ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1335",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، عن داود بن يزيد الأودي، عن المغيرة بن شبيل، عن قيس بن أبي حازم، عن معاذ بن جبل، قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن فلما سرت أرسل في أثري فرددت فقال ‏\"‏ أتدري لم بعثت إليك لا تصيبن شيئا بغير إذني فإنه غلول ومن يغلل يأت بما غل يوم القيامة لهذا دعوتك فامض لعملك ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن عميرة وبريدة والمستورد بن شداد وأبي حميد وابن عمر ‏.‏ قال أبو عيسى حديث معاذ حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث أبي أسامة عن داود الأودي ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated:                      \"The Messenger of Allah (ﷺ) dispatched me to Yemen. When I had left, he sent a message after me, so I returned and he said: 'Do you know why I sent a message to you ? Do not take anything without my permission, for that will be Ghulul, and whoever commits Ghulul, he comes with what he took on the Day of Judgement. This is why I called you, so now go and do your job.'\"",
      "chain": [
        "30216",
        "20318",
        "15129",
        "19880",
        "11046",
        "32"
      ]
    },
    {
      "hadith_no": "3430",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن داود بن يزيد الزعافري، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ عسى أن يبعثك ربك مقاما محمودا ‏)‏ سئل عنها قال ‏\"‏ هي الشفاعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وداود الزعافري هو داود الأودي ابن يزيد بن عبد الرحمن وهو عم عبد الله بن إدريس ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     regarding Allah's saying: \"It may be that your Lord will raise you to a praised station (17:79)\" that the Messenger of Allah (ﷺ) was asked about it and he said: \"It is the intercession.\"",
      "chain": [
        "30216",
        "20032",
        "15129",
        "13"
      ]
    },
    {
      "hadith_no": "4022",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن الحسن الكوفي، حدثنا محبوب بن محرز القواريري، عن داود بن يزيد الأودي، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما لأحد عندنا يد إلا وقد كافيناه ما خلا أبا بكر فإن له عندنا يدا يكافئه الله بها يوم القيامة وما نفعني مال أحد قط ما نفعني مال أبي بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ألا وإن صاحبكم خليل الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"There is no favor due upon us from anyone, except that we have repaid him, with the exception of Abu Bakr. Verily upon us, there is a favor due to him, which Allah will repay him on the Day of Judgement. No one's wealth has benefited as Abu Bakr's wealth has benefited me. And if I were to take a Khalil, then I would have taken Abu Bakr as a Khalil, and indeed your companion is Allah's Khalil.",
      "chain": [
        "25293",
        "15129",
        "13"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان، ح وحدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، جميعا عن داود بن يزيد الزعافري، عن الشعبي، عن هرم بن خنبش، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ عمرة في رمضان تعدل حجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Harim bin Khanbash that the Messenger of Allah(ﷺ)said:                      ‘ ‘Umrah during Ramadan is equivalent to Hajj (i.e., inreward).’”",
      "chain": [
        "30269",
        "20005",
        "38409",
        "20032",
        "15129",
        "11052"
      ]
    }
  ],
  "total_hadiths": 4
}