{
  "id": "15173",
  "name": "Salm al-Brad Abu Abd سالم البراد أبو عبد الله",
  "full_name": "Salm al-Brad Abu Abd سالم البراد أبو عبد الله",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "402",
      "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11261",
      "name": "al-Qasim bin Abi Bzh القاسم بن أبي بزة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "863",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن عطاء بن السائب، عن سالم البراد، قال أتينا عقبة بن عمرو الأنصاري أبا مسعود فقلنا له حدثنا عن صلاة، رسول الله صلى الله عليه وسلم فقام بين أيدينا في المسجد فكبر فلما ركع وضع يديه على ركبتيه وجعل أصابعه أسفل من ذلك وجافى بين مرفقيه حتى استقر كل شىء منه ثم قال سمع الله لمن حمده فقام حتى استقر كل شىء منه ثم كبر وسجد ووضع كفيه على الأرض ثم جافى بين مرفقيه حتى استقر كل شىء منه ثم رفع رأسه فجلس حتى استقر كل شىء منه ففعل مثل ذلك أيضا ثم صلى أربع ركعات مثل هذه الركعة فصلى صلاته ثم قال هكذا رأينا رسول الله صلى الله عليه وسلم يصلي ‏.‏",
      "text_en": " Narrated Uqbah ibn Amr al-Ansari:                     Salim al-Barrad said: We came to AbuMas'ud Uqbah ibn Amr al-Ansari and said to him: Tell us about the prayer of the Messenger of Allah (ﷺ). He stood up before us in the mosque and said the takbir. When he bowed, he placed his hands upon his knees and put his fingers below, and kept his elbows (arms) away from his sides, so everything returned properly to its place. Then he said: \"Allah listens to him who praises Him\"; then he stood up so that everything returned properly to its place; then he said the takbir and prostrated and put the palms of his hands on the ground; he kept his elbow (arms) away from his sides, so that everything returned to its proper place. Then he raised his head and sat so that everything returned to its place; he then repeated it in a similar way. Then he offered four rak'ahs of prayer like this rak'ah and completed his prayer. Then he said: Thus we witnessed the Messenger of Allah (ﷺ) offering his prayer.",
      "chain": [
        "30022",
        "20028",
        "11068",
        "15173"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن ابن علية، عن عطاء بن السائب، عن سالم البراد، قال قال أبو مسعود ألا أريكم كيف كان رسول الله صلى الله عليه وسلم يصلي قلنا بلى ‏.‏ فقام فكبر فلما ركع جافى بين إبطيه حتى لما استقر كل شىء منه رفع رأسه فصلى أربع ركعات هكذا وقال هكذا رأيت رسول الله صلى الله عليه وسلم يصلي ‏.‏",
      "text_en": " It was narrated that Salim Al- Barrad said:                     \"Abu Mus'ad said: 'Shall I not show you how the Messenger of Allah (ﷺ) prayed?' We said: 'Yes.' So he stood up and said the takbir, and when he bowed, he held his arms out from his sides until, when every part of him settled, he raised his head. He prayed four rak'ahs like that, and said: 'This is how I saw the Messenger of Allah (ﷺ) praying.'\"",
      "chain": [
        "20184",
        "20208",
        "11068",
        "15173"
      ]
    }
  ],
  "total_hadiths": 2
}