{
  "id": "15184",
  "name": "Sa'id bin Hyan al-Tymy سعيد بن حيان التيمي",
  "full_name": "Sa'id bin Hyan al-Tymy سعيد بن حيان التيمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-'Ajli",
      "al-Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ د  ت  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ د  ت  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ د  ت  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "B.Taym",
        "ar": "B.Taym",
        "ckb": "B.Taym"
      },
      {
        "en": "al-'Ajli",
        "ar": "al-'Ajli",
        "ckb": "al-'Ajli"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-6478",
      "hadith_no": "6478",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد بن يعيش، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة، عن  أبي حيان، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا أبو حيان التيمي يحيى بن سعيد عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لبلال عند صلاة الغداة ‏\"‏ يا بلال حدثني بأرجى عمل عملته عندك في الإسلام منفعة فإني سمعت الليلة خشف نعليك بين يدى في الجنة ‏\"‏ ‏.‏ قال بلال ما عملت عملا في الإسلام أرجى عندي منفعة من أني لا أتطهر طهورا تاما في ساعة من ليل ولا نهار إلا صليت بذلك الطهور ما كتب الله لي أن أصلي ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said to Bilal:                      Bilal, narrate to me which act at the time of morning prayer you did in Islam for which you hope to receive good reward, for I heard during the night the sound of your steps before me in Paradise. Bilal said: I did not do any act in Islam for which I hope to get any benefit but this that when I perform complete ablution during the night or day I observe prayer with that purification what Allah has ordained for me to pray.",
      "usc_msa_ref": "",
      "chain": [
        "30469",
        "30216",
        "20318",
        "11404",
        "15184",
        "11404",
        "11406",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-3383",
      "hadith_no": "3383",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سليمان المصيصي، حدثنا محمد بن الزبرقان، عن أبي حيان التيمي، عن أبيه، عن أبي هريرة، رفعه قال ‏\"‏ إن الله يقول أنا ثالث الشريكين، ما لم يخن أحدهما صاحبه فإذا خانه خرجت من بينهما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) having said: Allah, Most High, says: \"I make a third with two partners as long as one of them does not cheat the other, but when he cheats him, I depart from them.\"",
      "usc_msa_ref": "",
      "chain": [
        "20457",
        "11404",
        "15184"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-4079",
      "hadith_no": "4079",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا أبو عتاب، سهل بن حماد حدثنا المختار بن نافع، حدثنا أبو حيان التيمي، عن أبيه، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رحم الله أبا بكر زوجني ابنته وحملني إلى دار الهجرة وأعتق بلالا من ماله رحم الله عمر يقول الحق وإن كان مرا تركه الحق وماله صديق رحم الله عثمان تستحييه الملائكة رحم الله عليا اللهم أدر الحق معه حيث دار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والمختار بن نافع شيخ بصري كثير الغرائب وأبو حيان التيمي اسمه يحيى بن سعيد بن حيان التيمي كوفي وهو ثقة ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     that the Messenger of Allah (ﷺ) said: \"May Allah have mercy upon Abu Bakr, he married me to his daughter, and he carried me to the land of Hijrah, and he freed Bilal with his wealth. May Allah have mercy upon 'Umar, he says the truth even if it is sour. The truth caused him to be left without a friend. May Allah have mercy upon 'Uthman, the angels are shy of him. May Allah have mercy upon 'Ali. O Allah! Place the truth with him wherever he turns.\"",
      "usc_msa_ref": "",
      "chain": [
        "15512",
        "11404",
        "15184",
        "5"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    }
  ],
  "total_hadiths": 3,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}