{
  "id": "15185",
  "name": "Sa'id bin Abi Khalid سعيد بن أبي خالد الأحمسي",
  "full_name": "Sa'id bin Abi Khalid سعيد بن أبي خالد الأحمسي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Ahmsi",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "19253",
      "name": "Abu Khalid al-Bajli,al-Ahamsi أبو خالد البجلي الأحمسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "13645",
      "name": "Ash'ath bin Abi Khalid أشعث بن أبي خالد",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4052",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، عن معمر، عن الزهري،‏.‏ حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن ابن عباس  رضى الله عنهما  قال أخبرني أبو طلحة  رضى الله عنه  صاحب رسول الله صلى الله عليه وسلم وكان قد شهد بدرا مع رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة ‏\"‏‏.‏ يريد التماثيل التي فيها الأرواح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Talha, a companion of Allah's Apostle and one of those who fought at Badr together with Allah's Apostle told me that Allah's Apostle said. \"Angels do not enter a house in which there is a dog or a picture\" He meant the images of creatures that have souls.",
      "chain": [
        "30309",
        "20295",
        "20115",
        "11013",
        "11418",
        "15185",
        "11005",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "7562",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم، عن ابن شهاب، عن أبي سلمة، والأعرج،‏.‏ وحدثنا إسماعيل، حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، وسعيد بن المسيب، أن أبا هريرة، قال استب رجل من المسلمين ورجل من اليهود فقال المسلم والذي اصطفى محمدا على العالمين في قسم يقسم به، فقال اليهودي والذي اصطفى موسى على العالمين، فرفع المسلم يده عند ذلك فلطم اليهودي، فذهب اليهودي إلى رسول الله صلى الله عليه وسلم فأخبره بالذي كان من أمره وأمر المسلم، فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروني على موسى، فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا موسى باطش بجانب العرش، فلا أدري أكان فيمن صعق فأفاق قبلي أو كان ممن استثنى الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     \"A man from the Muslims and a man from the Jews quarrelled, and the Muslim said, \"By Him Who gave superiority to Muhammad over all the people!\" The Jew said, \"By Him Who gave superiority to Moses over all the people!' On that the Muslim lifted his hand and slapped the Jew. The Jew went to Allah's Apostle and informed him of all that had happened between him and the Muslim. The Prophet said, \"Do not give me superiority over Moses, for the people will fall unconscious on the Day of Resurrection, I will be the first to regain consciousness and behold, Moses will be standing there, holding the side of the Throne. I will not know whether he has been one of those who have fallen unconscious and then regained consciousness before me, or if he has been one of those exempted by Allah (from falling unconscious).\" (See Hadith No. 524, Vol. 8)",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10567",
        "11418",
        "15185",
        "11005",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2930",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد، عن إسماعيل بن أبي خالد، عن أخيه، عن بشر بن قرة الكلبي، عن أبي بردة، عن أبي موسى، قال انطلقت مع رجلين إلى النبي صلى الله عليه وسلم فتشهد أحدهما ثم قال جئنا لتستعين بنا على عملك ‏.‏ وقال الآخر مثل قول صاحبه ‏.‏ فقال ‏\"‏ إن أخونكم عندنا من طلبه ‏\"‏ ‏.‏ فاعتذر أبو موسى إلى النبي صلى الله عليه وسلم وقال لم أعلم لما جاءا له ‏.‏ فلم يستعن بهما على شىء حتى مات ‏.‏",
      "text_en": " Narrated Abu Musa:                     I went along with two men to see the Prophet (ﷺ). One of them recited tashahhud and said: We have come to you so that you may employ us for your work. The other also said the same thing. He  (the Prophet) replied: The most faithless of you in our eyes is the one who asked for it (responsible post). Abu Musa then apologized to the Prophet (ﷺ) and said: I did not know why they came to you. He did not employ them for anything until he died.",
      "chain": [
        "30569",
        "20423",
        "11418",
        "15185",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1573",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن أبي زائدة، قال أخبرني إسماعيل بن أبي خالد، عن أخيه، عن أبي كاهل الأحمسي، قال رأيت النبي صلى الله عليه وسلم يخطب على ناقة وحبشي آخذ بخطام الناقة ‏.‏",
      "text_en": " It was narrated that Abu Khalil Al-Ahmasi said:                     \"I saw the Prophet (ﷺ) delivering the Khutbah atop a she-camel and an Ethiopian was holding on to the camel's reins.\"",
      "chain": [
        "20184",
        "20366",
        "11418",
        "15185"
      ]
    }
  ],
  "total_hadiths": 4
}