{
  "id": "15207",
  "name": "Salma bin Nabayt سلمة بن نبيط",
  "full_name": "Salma bin Nabayt سلمة بن نبيط",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  تم  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Ashja'i",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "5311",
      "name": "Nbyt bin Shryt al-'Ashj'y al-Kwfy ( نبيط بن شريط الأشجعي الكوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5311",
      "name": "Nbyt bin Shryt al-'Ashj'y al-Kwfy ( نبيط بن شريط الأشجعي الكوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1916",
      "hadith_no": "1916",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن سلمة بن نبيط، عن رجل، من الحى عن أبيه، نبيط أنه رأى النبي صلى الله عليه وسلم واقفا بعرفة على بعير أحمر يخطب ‏.‏",
      "text_en": " Narrated Nubayt:                     Nubayt had seen the Prophet (ﷺ) in Arafat.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20330",
        "15207"
      ]
    },
    {
      "id": "sunan-an-nasai-3007",
      "hadith_no": "3007",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان، عن سلمة بن نبيط، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يخطب على جمل أحمر بعرفة قبل الصلاة ‏.‏",
      "text_en": " It was narrated from Salamah bin Nubait, that his father said:                     \"I saw the Messenger of Allah delivering a Khutab atop a red camel in Arafat, before the Salah.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "15207",
        "5311"
      ]
    },
    {
      "id": "sunan-an-nasai-3008",
      "hadith_no": "3008",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن آدم، عن ابن المبارك، عن سلمة بن نبيط، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يخطب يوم عرفة على جمل أحمر ‏.‏",
      "text_en": " It was narrated from Salamah bin Nubait that his father said:                     \"I saw the Messenger of Allah delivering a Khutbah on the day of Arafat atop a red camel.\" (Hasan)Chpater 200. Delivering A Short Khutbah In 'Arafat",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "15207",
        "5311"
      ]
    },
    {
      "id": "sunan-ibn-majah-1292",
      "hadith_no": "1292",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، أنبأنا عبد الله بن داود، من كتابه في بيته قال سلمة بن نبيط أنبأنا عن نعيم بن أبي هند عن نبيط بن شريط عن سالم بن عبيد قال أغمي على رسول الله  صلى الله عليه وسلم  في مرضه ثم أفاق فقال ‏\"‏ أحضرت الصلاة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ مروا بلالا فليؤذن ومروا أبا بكر فليصل بالناس - أو للناس - ‏\"‏ ‏.‏ ثم أغمي عليه فأفاق فقال ‏\"‏ أحضرت الصلاة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ مروا بلالا فليؤذن ومروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ ثم أغمي عليه فأفاق فقال ‏\"‏ أحضرت الصلاة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ مروا بلالا فليؤذن ومروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة إن أبي رجل أسيف فإذا قام ذلك المقام يبكي لا يستطيع فلو أمرت غيره ‏.‏ ثم أغمي عليه فأفاق فقال ‏\"‏ مروا بلالا فليؤذن ومروا أبا بكر فليصل بالناس فإنكن صواحب يوسف أو صواحبات يوسف ‏\"‏ ‏.‏ قال فأمر بلال فأذن وأمر أبو بكر فصلى بالناس ثم إن رسول الله  صلى الله عليه وسلم  وجد خفة فقال ‏\"‏ انظروا لي من أتكئ عليه ‏\"‏ ‏.‏ فجاءت بريرة ورجل آخر فاتكأ عليهما فلما رآه أبو بكر ذهب لينكص فأومأ إليه أن اثبت مكانك ثم جاء رسول الله  صلى الله عليه وسلم  حتى جلس إلى جنب أبي بكر حتى قضى أبو بكر صلاته ثم إن رسول الله  صلى الله عليه وسلم  قبض ‏.‏ قال أبو عبد الله هذا حديث غريب لم يحدث به غير نصر بن علي ‏.‏",
      "text_en": " It wasnarrated that Salim bin ‘Ubaid said:                      “The Messenger of Allah(ﷺ) fainted when he was sick, then he woke up and said: ‘Has thetime for prayer come?’ They said: ‘Yes.’ He said: ‘Tell Bilalto callthe Adhan, and tell Abu Bakr to lead the people in prayer.’Then hefainted, then he woke up and said: ‘Has the time for prayercome?’They said: ‘Yes.’ He said: ‘Tell Bilal to call theAdhan, and tell AbuBakr to lead the people in prayer.’ Then hefainted, then he woke upand said: ‘Has the time for prayer come?’They said: ‘Yes.’ He said:‘Tell Bilal to call the Adhan, andtell Abu Bakr to lead the people inprayer.’ ‘Aishah said: ‘Myfather is a tender-hearted man, and if hestands in that place hewill weep and will not be able to do it. Ifyou told someone else todo it (that would be better).’ Then hefainted, then woke up andsaid: ‘Tell Bilal to call the Adhan, andtell Abu Bakr to lead thepeople in prayer. You are (like) the femalecompanions of Yusuf.’So Bilal was told to call the Adhan and he didso, and Abu Bakr wastold to lead the people in prayer. And he did sothen the Messengerof Allah (ﷺ) felt a little better, and he said:‘Fine me someoneI can lean on.’ Barirah and another man came, and heleaned onthem. When Abu Bakr saw him, he started to step back, but(theProphet (ﷺ)) gestured him to stay where he was. Then theMessengerof Allah (ﷺ) came and sat beside Abu Bakr, until Abu Bakrfinishedpraying. Then the Messenger of Allah (ﷺ) passed away.”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "15207",
        "10973",
        "5311",
        "5045"
      ]
    },
    {
      "id": "sunan-ibn-majah-1345",
      "hadith_no": "1345",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سلمة بن نبيط، عن أبيه، أنه حج فقال رأيت النبي  صلى الله عليه وسلم  يخطب على بعيره ‏.‏",
      "text_en": " It wasnarrated from Salamah bin Nubait that his father performedHajj andsaid:                      “I saw the Prophet (ﷺ) delivering the sermon atop hiscamel.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "15207",
        "5311"
      ]
    }
  ],
  "total_hadiths": 5
}