{
  "id": "15260",
  "name": "'Asim al-Dwy عاصم العدوي",
  "full_name": "'Asim al-Dwy عاصم العدوي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  س  -  ثقة ]"
    ],
    "tags": [
      "B.'Adi",
      "al-Kufa",
      "al-Nisa'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2259",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثني محمد بن عبد الوهاب، عن مسعر، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج إلينا رسول الله صلى الله عليه وسلم ونحن تسعة خمسة وأربعة أحد العددين من العرب والآخر من العجم فقال ‏\"‏ اسمعوا هل سمعتم أنه سيكون بعدي أمراء فمن دخل عليهم فصدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس بوارد على الحوض ومن لم يدخل عليهم ولم يعنهم على ظلمهم ولم يصدقهم بكذبهم فهو مني وأنا منه وهو وارد على الحوض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب لا نعرفه من حديث مسعر إلا من هذا الوجه ‏.‏ قال هارون فحدثني محمد بن عبد الوهاب، عن سفيان، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏قال هارون وحدثني محمد، عن سفيان، عن زبيد، عن إبراهيم، وليس، بالنخعي عن كعب بن عجرة، عن النبي صلى الله عليه وسلم نحو حديث مسعر ‏.‏ قال وفي الباب عن حذيفة ‏.‏",
      "text_en": " It was narrated from Ka'b bin 'Ujrah who said:                     \"The Messenger of Allah(s.a.w) came out to us, we were made up of nine; five and four. The first of the numbers for the Arabs, and the latter for the non-Arabs. He said: 'Listen, have you heard that after me there will leaders, whoever enters upon them and condones to their lies, and supports them in their oppression, then he is not from me and I am not from him, and he shall not drink with me from the Hawd. And whoever does not enter upon them, nor help them in their oppression, nor condones to their lies, then he is from me, and I am from him, and he shall drink with me at the Hawd.'\"",
      "chain": [
        "35158",
        "20359",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن تسعة فقال ‏\"‏ إنه ستكون بعدي أمراء من صدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس بوارد على الحوض ومن لم يصدقهم بكذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وهو وارد على الحوض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"The Messenger of Allah came out to us, and there were nine of us. He said; 'After me there will be rulers, whoever believes in their lies and helps them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern. Whoever does not believe their lies and does not help them in their wrongdoing, he is of me, and I am of hi, and he will come to me at the Cistern.\"'",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا محمد، - يعني ابن عبد الوهاب - قال حدثنا مسعر، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج إلينا رسول الله صلى الله عليه وسلم ونحن تسعة خمسة وأربعة أحد العددين من العرب والآخر من العجم فقال ‏\"‏ اسمعوا هل سمعتم أنه ستكون بعدي أمراء من دخل عليهم فصدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس يرد على الحوض ومن لم يدخل عليهم ولم يصدقهم بكذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وسيرد على الحوض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"The Messenger of Allah came out to us and we were nine, fie and four, some 'Arabs and some non- 'Arabs. He said: 'Listen. Have you heard that after me there will be rulers, whoever enters upon them and believes their lies and help them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern? Whoever does not enter upon them or belive their lies or help them in their wrongdoing is of me and I am of him, and he will come to me at the Cistern.\"'",
      "chain": [
        "35158",
        "20359",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    }
  ],
  "total_hadiths": 3
}