{
  "id": "15290",
  "name": "'Abdullah bin Asm عبد الله بن عصم",
  "full_name": "'Abdullah bin Asm عبد الله بن عصم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Yamama",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ د  ت  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Yemami",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "25029",
      "name": "Ayoub bin Jabir bin Syar أيوب بن جابر بن سيار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "247",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أيوب بن جابر، عن عبد الله بن عصم، عن عبد الله بن عمر، قال كانت الصلاة خمسين والغسل من الجنابة سبع مرار وغسل البول من الثوب سبع مرار فلم يزل رسول الله صلى الله عليه وسلم يسأل حتى جعلت الصلاة خمسا والغسل من الجنابة مرة وغسل البول من الثوب مرة ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     There were fifty prayers (obligatory in the beginning); and (in the beginning of Islam) washing seven times because of sexual defilement (was obligatory); and washing the urine from the cloth seven times (was obligatory).  The Apostle  of Allah (ﷺ) kept on praying to Allah until the number of prayers was reduced to five and washing because of sexual defilement was allowed only once and washing the urine from the clothe was also permitted only once.",
      "chain": [
        "30367",
        "25029",
        "15290",
        "18"
      ]
    },
    {
      "hadith_no": "2220",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن حجر، حدثنا الفضل بن موسى، عن شريك بن عبد الله، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏ قال أبو عيسى يقال الكذاب المختار بن أبي عبيد والمبير الحجاج بن يوسف ‏.‏ حدثنا أبو داود سليمان بن سلم البلخي أخبرنا النضر بن شميل عن هشام بن حسان قال أحصوا ما قتل الحجاج صبرا فبلغ مائة ألف وعشرين ألف قتيل ‏.‏\t قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر ‏.‏ حدثنا عبد الرحمن بن واقد، حدثنا شريك، نحوه بهذا الإسناد ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏ وشريك يقول عبد الله بن عصم وإسرائيل يقول عبد الله بن عصمة ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah(s.a.w) said:                     \"In Thaqif there will be a great liar and destroyer.\"",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    },
    {
      "hadith_no": "4324",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الفضل بن موسى، عن شريك، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"In Thaqif there is a liar and a destroyer.\"",
      "chain": [
        "20387",
        "20452",
        "20587",
        "15290",
        "18"
      ]
    }
  ],
  "total_hadiths": 3
}