{
  "id": "15317",
  "name": "'Abdur Rahman bin al-Akhns عبد الرحمن بن الأخنس",
  "full_name": "'Abdur Rahman bin al-Akhns عبد الرحمن بن الأخنس",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ د  ت  -  مستور ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "15085",
      "name": "al-Hur bin al-Sabah الحر بن الصباح النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4649",
      "hadith_no": "4649",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن الحر بن الصياح، عن عبد الرحمن بن الأخنس، أنه كان في المسجد فذكر رجل عليا عليه السلام فقام سعيد بن زيد فقال أشهد على رسول الله صلى الله عليه وسلم أني سمعته وهو يقول ‏\"‏ عشرة في الجنة النبي في الجنة وأبو بكر في الجنة وعمر في الجنة وعثمان في الجنة وعلي في الجنة وطلحة في الجنة والزبير بن العوام في الجنة وسعد بن مالك في الجنة وعبد الرحمن بن عوف في الجنة ‏\"‏ ‏.‏ ولو شئت لسميت العاشر ‏.‏ قال فقالوا من هو فسكت قال فقالوا من هو فقال هو سعيد بن زيد ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     AbdurRahman ibn al-Akhnas said that when he was in the mosque, a man mentioned Ali (may Allah be pleased with him). So Sa'id ibn Zayd got up and said: I bear witness to the Messenger of Allah (ﷺ) that I heard him say: Ten persons will go to Paradise: The Prophet (ﷺ) will go to Paradise, AbuBakr will go to Paradise, Umar will go to Paradise, Uthman will go to Paradise, Ali will go to Paradise, Talhah will go to Paradise: az-Zubayr ibn al-Awwam will go to paradise, Sa'd ibn Malik will go to Paradise, and AbdurRahman ibn Awf will go to Paradise. If I wish, I can mention the tenth. The People asked: Who is he: So he kept silence. The again asked: Who is he: He replied: He is Sa'id ibn Zayd.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "15317"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4124",
      "hadith_no": "4124",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحجاج بن محمد، حدثني شعبة، عن الحر بن الصباح، عن عبد الرحمن بن الأخنس، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال هذا حديث حسن ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20020",
        "15085",
        "15317",
        "11"
      ]
    }
  ],
  "total_hadiths": 2
}