{
  "id": "15313",
  "name": "'Abdullah bin Ysar عبد الله بن يسار",
  "full_name": "'Abdullah bin Ysar عبد الله بن يسار",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  عس  -  مجهول ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5202",
      "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10986",
      "name": "Ya'la bin 'Ata' يعلى بن عطاء العامري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4980",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، عن منصور، عن عبد الله بن يسار، عن حذيفة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا ما شاء الله وشاء فلان ولكن قولوا ما شاء الله ثم شاء فلان ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhayfah:                     The Prophet (ﷺ) said: Do not say: \"What Allah wills and so and so wills,\" but say: \"What Allah wills and afterwards so and so wills.",
      "chain": [
        "20296",
        "20020",
        "11067",
        "15313",
        "145"
      ]
    },
    {
      "hadith_no": "5004",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا ابن نمير، عن الأعمش، عن عبد الله بن يسار، عن عبد الرحمن بن أبي ليلى، قال حدثنا أصحاب، محمد صلى الله عليه وسلم أنهم كانوا يسيرون مع النبي صلى الله عليه وسلم فنام رجل منهم فانطلق بعضهم إلى حبل معه فأخذه ففزع فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لمسلم أن يروع مسلما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn AbuLayla:                     The Companions of the Prophet (ﷺ) told us that they were travelling with the Prophet (ﷺ). A man of them slept, and one of them went to the rope which he had with him. He took it, by which he was frightened. The Prophet (ﷺ) said: It is not lawful for a Muslim that he frightens a Muslim.",
      "chain": [
        "31160",
        "30212",
        "11060",
        "15313",
        "11196"
      ]
    },
    {
      "hadith_no": "2052",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، قال أخبرني جامع بن شداد، قال سمعت عبد الله بن يسار، قال كنت جالسا وسليمان بن صرد وخالد بن عرفطة فذكروا أن رجلا، توفي مات ببطنه فإذا هما يشتهيان أن يكونا شهداء جنازته فقال أحدهما للآخر ألم يقل رسول الله صلى الله عليه وسلم ‏\"‏ من يقتله بطنه فلن يعذب في قبره ‏\"‏ ‏.‏ فقال الآخر بلى ‏.‏",
      "text_en": " 'Abdullah bin Yasar said:                     \"I was sitting with sulaiman bin Sard and Khalid bin 'Urfutah, and they said that a man had died as a result of abdominal illness. They wanted to attend his funeral, and one of them said to the other: 'Didn't the Messenger of Allah say: Whoever is killed by an abdominal illness, he will not be punished in his grave? The other said: 'Yes.'''",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11328",
        "15313"
      ]
    },
    {
      "hadith_no": "2562",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يزيد بن زريع، قال حدثنا عمر بن محمد، عن عبد الله بن يسار، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا ينظر الله عز وجل إليهم يوم القيامة العاق لوالديه والمرأة المترجلة والديوث وثلاثة لا يدخلون الجنة العاق لوالديه والمدمن على الخمر والمنان بما أعطى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim bin 'Abdullah that his father said:                     \"The Messenger of Allah said: \"There are three at whom Allah will not look on the Day of Resurrection: The one who disobeys his parents, the woman who imitates men in her outward appearance, and the cuckold. And there are three who will not enter Paradise: The one who disobeys his parents, the drunkard, and the one who reminds people of what he has given them.\"'",
      "chain": [
        "30153",
        "20304",
        "11530",
        "15313",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يوسف بن عيسى، قال حدثنا الفضل بن موسى، قال حدثنا مسعر، عن معبد بن خالد، عن عبد الله بن يسار، عن قتيلة، - امرأة من جهينة - أن يهوديا، أتى النبي صلى الله عليه وسلم فقال إنكم تنددون وإنكم تشركون تقولون ما شاء الله وشئت وتقولون والكعبة ‏.‏ فأمرهم النبي صلى الله عليه وسلم إذا أرادوا أن يحلفوا أن يقولوا ‏\"‏ ورب الكعبة ‏\"‏ ‏.‏ ويقولون ‏\"‏ ما شاء الله ثم شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Yasar, from Qutailah, a woman from Juhainah, that a Jew came to the Prophet and said:                      \"You are setting up rivals (to Allah) and associating others (with Him). You say: 'Whatever Allah wills and you will,' and you say: 'By the Ka'bah.'\" So the Prophet commanded them, if they wanted to swear an oath, to say: \"By the Lord of the Ka'bah;\" and to say: \"Whatever Allah wills, then what you will.\"",
      "chain": [
        "30401",
        "20452",
        "20359",
        "11396",
        "15313"
      ]
    }
  ],
  "total_hadiths": 5
}