{
  "id": "15373",
  "name": "Atyh bin Sa'd bin Jnad'h عطية بن سعد بن جنادة",
  "full_name": "Atyh bin Sa'd bin Jnad'h عطية بن سعد بن جنادة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "111",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  د  ت  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3468",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو بدر، عن زياد بن خيثمة، عن سعد، - يعني الطائي - عن عطية بن سعد، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف في شىء فلا يصرفه إلى غيره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: If anyone pays in advance he must not transfer it to someone else before he receives it.",
      "chain": [
        "31167",
        "36577",
        "20585",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "3978",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا فضيل بن مرزوق، عن عطية بن سعد العوفي، قال قرأت على عبد الله بن عمر ‏{‏ الله الذي خلقكم من ضعف ‏}‏ فقال ‏{‏ من ضعف ‏}‏ قرأتها على رسول الله صلى الله عليه وسلم كما قرأتها على فأخذ على كما أخذت عليك ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Atiyyah ibn Sa'd al-Awfi said: I recited to Abdullah ibn Umar the verse: \"It is Allah Who created you in a state of (helplessness) weakness (min da'f).\"  He said: (Read) min du'f. I recited it to the Messenger of Allah (ﷺ) as you recited it to me, and he gripped me as I gripped you.",
      "chain": [
        "30352",
        "20321",
        "20598",
        "15373"
      ]
    },
    {
      "hadith_no": "3987",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن الفضل، حدثنا وهيب، - يعني ابن عمرو النمري - أخبرنا هارون، أخبرني أبان بن تغلب، عن عطية العوفي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الرجل من أهل عليين ليشرف على أهل الجنة فتضيء الجنة لوجهه كأنها كوكب دري ‏\"‏ ‏.‏ قال وهكذا جاء الحديث ‏\"‏ دري ‏\"‏ ‏.‏ مرفوعة الدال لا تهمز ‏\"‏ وإن أبا بكر وعمر لمنهم وأنعما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: A man from the Illiyyun will look downwards at the people of Paradise and Paradise will be glittering as if it were a brilliant star. He (the narrator) said: In this way the word durri (brilliant) occurs in this tradition, i.e. the letter dal (d) has short vowel u and it has no hamzah ('). AbuBakr and Umar will be of them and will have some additional blessings.",
      "chain": [
        "20577",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "3998",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد بن العلاء، أن محمد بن أبي عبيدة، حدثهم قال حدثنا أبي، عن الأعمش، عن سعد الطائي، عن عطية العوفي، عن أبي سعيد الخدري، قال حدث رسول الله صلى الله عليه وسلم حديثا ذكر فيه ‏\"‏ جبريل وميكال ‏\"‏ ‏.‏ فقرأ ‏{‏ جبرائل وميكائل ‏}‏ ‏.‏ قال أبو داود قال خلف منذ أربعين سنة لم أرفع القلم عن كتابة الحروف ما أعياني شىء ما أعياني جبرائل وميكائل ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) related a tradition in which he mentioned the words \"Jibril and Mikal\" and he pronounced them \"Jibra'ila wa Mika'ila.\"Abu Dawud said: Khalaf said: I did not put the pen aside from writing letters (huruf) for forty years: nothing tired me (or made me incapable of writing), even Jibril and Mika'il did not tire me.",
      "chain": [
        "30203",
        "30216",
        "11060",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "3999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا زيد بن أخزم، حدثنا بشر، - يعني ابن عمر - حدثنا محمد بن خازم، قال ذكر كيف قراءة جبرائل وميكائل عند الأعمش فحدثنا الأعمش عن سعد الطائي عن عطية العوفي عن أبي سعيد الخدري قال ذكر رسول الله صلى الله عليه وسلم صاحب الصور فقال ‏\"‏ عن يمينه جبرائل وعن يساره ميكائل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) mentioned the name of the one who will sound the trumpet (sahib as-sur) and said: On his right will be Jibra'il and on his left will be Mika'il.",
      "chain": [
        "30136",
        "20211",
        "20354",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد، - يعني ابن هارون - أخبرنا إسرائيل، حدثنا محمد بن جحادة، عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الجهاد كلمة عدل عند سلطان جائر ‏\"‏ ‏.‏ أو ‏\"‏ أمير جائر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: The best fighting (jihad) in the path of Allah is (to speak) a word of justice to an oppressive ruler.",
      "chain": [
        "30378",
        "20472",
        "20311",
        "18897",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا محمد بن ربيعة، عن فضيل بن مرزوق، عن عطية العوفي، عن أبي سعيد الخدري، قال كان نبي الله صلى الله عليه وسلم يصلي الضحى حتى نقول لا يدع ويدعها حتى نقول لا يصلي ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated:                     \"The Prophet would pray Ad-Duha until we would say: 'He will not leave it.' And he would leave it until we would say: 'He will not pray it.'\"",
      "chain": [
        "30249",
        "25262",
        "20598",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "2637",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا عمار بن محمد ابن أخت، سفيان الثوري حدثنا أبو الجارود الأعمى، واسمه، زياد بن المنذر الهمداني عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما مؤمن أطعم مؤمنا على جوع أطعمه الله يوم القيامة من ثمار الجنة وأيما مؤمن سقى مؤمنا على ظمإ سقاه الله يوم القيامة من الرحيق المختوم وأيما مؤمن كسا مؤمنا على عرى كساه الله من خضر الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وقد روي هذا عن عطية عن أبي سعيد موقوف وهو أصح عندنا وأشبه ‏.‏",
      "text_en": " 'Atiyyah Al-'Awfi narrated from Abu Sa'eed Al-Khudri,that The Messenger of Allah (s.a.w) said:                     \"Whichever believer feeds a hungry believer , Allah feeds him from the fruits of Paradise on the Day of Resurrection. Whichever believer gives drink to a thirsty believer, Allah gives him to drink from the 'sealed nectar' on the Day of Resurrection. Whichever believer clothes a naked believer, Allah clothes him from the green garments of Paradise.\"",
      "chain": [
        "38487",
        "20596",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "3187",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا نعيم بن ميسرة النحوي، عن فضيل بن مرزوق، عن عطية العوفي، عن ابن عمر، أنه قرأ على النبي صلى الله عليه وسلم ‏(‏خلقكم من ضعف ‏)‏ فقال من ضعف ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that he recited the following to the Prophet (ﷺ): \"Who created you in the weakness (Min Da'f)\" So he said: \"Min Du'f\"",
      "chain": [
        "38495",
        "25330",
        "20598",
        "15373",
        "18"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن مطرف، عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كيف أنعم وقد التقم صاحب القرن القرن وحنى جبهته وأصغى سمعه ينتظر أن يؤمر أن ينفخ فينفخ ‏\"‏ ‏.‏ قال المسلمون فكيف نقول يا رسول الله قال ‏\"‏ قولوا حسبنا الله ونعم الوكيل توكلنا على الله ربنا ‏\"‏ ‏.‏ وربما قال سفيان على الله توكلنا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه الأعمش أيضا عن عطية عن أبي سعيد ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that the Messenger of Allah (ﷺ) said: \"How can I be comfortable when the one with the horn is holding it in his lips and his forehead is leaning forward, waiting to be given permission to blow?\" The Muslims said: \"So what should we say, O Messenger of Allah?\" He said: \"Say: 'Allah is sufficient for us and what a good protector He is. We rely upon [our Lord] Allah'\" - and perhaps Sufyan (one of the narrators) said: \"upon Allah we rely.\"",
      "chain": [
        "30421",
        "20005",
        "11395",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "101",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا الأعمش، عن عطية بن سعد، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أهل الدرجات العلى يراهم من أسفل منهم كما يرى الكوكب الطالع في الأفق من آفاق السماء وإن أبا بكر وعمر منهم وأنعما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah said: 'The people of the highest degrees of Paradise will be seen by those beneath them as a rising star is seen on the horizon. Abu Bakr and 'Umar will be among them, and how blessed they are!'\"",
      "chain": [
        "38409",
        "20032",
        "11060",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "1183",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن عبد ربه، حدثنا بقية، عن مبشر بن عبيد، عن حجاج بن أرطاة، عن عطية العوفي، عن ابن عباس، قال كان النبي  صلى الله عليه وسلم  يركع من قبل الجمعة أربعا لا يفصل في شىء منهن ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) used toperformfour Rak’ah before Friday (prayer), and he did not separateany ofthem.”",
      "chain": [
        "11222",
        "30572",
        "20644",
        "20580",
        "15373",
        "17"
      ]
    },
    {
      "hadith_no": "1964",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو هشام الرفاعي، محمد بن يزيد حدثنا يحيى بن يمان، حدثنا الأغر الرقاشي، عن عطية العوفي، عن أبي سعيد الخدري، أن النبي  صلى الله عليه وسلم  تزوج عائشة على متاع بيت قيمته خمسون درهما ‏.‏",
      "text_en": " It was narrated that:                     Sahl bin Sa'd said: “A woman came to the Prophet and he said: 'Who will marry her ?' A man said: 'I will.' The Prophet said: 'Give her something, even if it is and iron ring.' He said: 'I do not have one.' He said: 'I marry her to you for what you know of the Quran.' ”",
      "chain": [
        "30478",
        "20617",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "3799",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا بكر بن عبد الرحمن، حدثنا عيسى بن المختار، عن محمد بن أبي ليلى، عن عطية العوفي، عن أبي سعيد، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من قال في دبر صلاة الغداة لا إله إلا الله وحده لا شريك له له الملك وله الحمد بيده الخير وهو على كل شىء قدير - كان كعتاق رقبة من ولد إسماعيل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed that :                     the Prophet(ﷺ) said: \"Whoever says, following the morning prayer: La ilaha illallahu wahdahu la sahrikalau, lahul mulku wa lahul hamdu, bi yadihil khair, wa huwa ala kulli shay'in qadir (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, in His Hand is all goodness, and He is Able to do all things), it will be as if he freed slave from among the sons of Isma'il.\"",
      "chain": [
        "30201",
        "25032",
        "25228",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "4147",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا القاسم بن زكريا بن دينار، حدثنا عبد الرحمن بن مصعب، ح وحدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، قالا حدثنا إسرائيل، أنبأنا محمد بن جحادة، عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أفضل الجهاد كلمة عدل عند سلطان جائر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed Al-Khudri that the Messenger ofAllah(ﷺ) said:                      “The best of jihad is a just word spoken to anunjustruler.”",
      "chain": [
        "30475",
        "30378",
        "20472",
        "20311",
        "18897",
        "15373",
        "38"
      ]
    }
  ],
  "total_hadiths": 15
}