{
  "id": "15398",
  "name": "'Umar bin Qays al-Masr عمر بن قيس الماصر",
  "full_name": "'Umar bin Qays al-Masr عمر بن قيس الماصر",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  د  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Ra'",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15413",
      "name": "'Amr bin Abi Qrh عمرو بن أبي قرة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3041",
      "name": "Muhmmad bin Ash'uth bin Qays ( محمد بن الأشعث بن قيس الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4659",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة بن قدامة الثقفي، حدثنا عمر بن قيس الماصر، عن عمرو بن أبي قرة، قال كان حذيفة بالمدائن فكان يذكر أشياء قالها رسول الله صلى الله عليه وسلم لأناس من أصحابه في الغضب فينطلق ناس ممن سمع ذلك من حذيفة فيأتون سلمان فيذكرون له قول حذيفة فيقول سلمان حذيفة أعلم بما يقول فيرجعون إلى حذيفة فيقولون له قد ذكرنا قولك لسلمان فما صدقك ولا كذبك ‏.‏ فأتى حذيفة سلمان وهو في مبقلة فقال يا سلمان ما يمنعك أن تصدقني بما سمعت من رسول الله صلى الله عليه وسلم فقال سلمان إن رسول الله صلى الله عليه وسلم كان يغضب فيقول في الغضب لناس من أصحابه ويرضى فيقول في الرضا لناس من أصحابه أما تنتهي حتى تورث رجالا حب رجال ورجالا بغض رجال وحتى توقع اختلافا وفرقة ولقد علمت أن رسول الله صلى الله عليه وسلم خطب فقال ‏\"‏ أيما رجل من أمتي سببته سبة أو لعنته لعنة في غضبي - فإنما أنا من ولد آدم أغضب كما يغضبون وإنما بعثني رحمة للعالمين - فاجعلها عليهم صلاة يوم القيامة ‏\"‏ ‏.‏ والله لتنتهين أو لأكتبن إلى عمر ‏.‏",
      "text_en": " ‘Amr b. Abl Qurrah said :                      Hudhaifah was in al-Mada’in. He used to mention things which the Messenger of Allah (May peace be upon him) said to some people from among his Companions in anger. The people who heard from Hudhaifah would go to Salman and tell him what Hudhaifah said. Salman would say: Hudhaifah knows best what he says. Then they would come to Hudhaifah and tell him: We mentioned Salman what you said, but he neither testified you nor falsified you. So Hudhaifah came to salman who was in his vegetable farm, and said : Salman, what prevents you from testifying me of what I heard from the Messenger of Allah (May peace be upon him) ? Salman said: The Messenger of Allah (May peace be upon him) sometimes would be angry, and said in anger something to some of his Companions; he would be sometimes pleased and said in pleasure something to some of his Companions. Would you not stop until you create love of some people in the hearts of some people, and hatred of some people in the hearts of some people, and until you generate disagreement and dissension? You know that the Messenger of Allah (May peace be upon him) addressed, saying : If I abused any person of my people, or cursed him in my anger. I am one of the children of Adam : I become angry as they become angry. He (Allah) has sent me as a mercy for all worlds. (O Allah!) make them (Abuse or curse) blessing for them on the day of judgment! I swear by Allah. You should stop (mentioning these traditions), otherwise I shall writ to ‘Umar.",
      "chain": [
        "30184",
        "20320",
        "15398"
      ]
    }
  ],
  "total_hadiths": 1
}