{
  "id": "15406",
  "name": "'Amr bin 'Amir al-Bajli عمرو بن عامر البجلي الكوفي",
  "full_name": "'Amr bin 'Amir al-Bajli عمرو بن عامر البجلي الكوفي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ تمييز  -  مقبول ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11102",
      "name": "Wahb bin Munabbih al-Abnavi وهب بن منبه الأبناوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17644",
      "name": "Muhammad bin Sdqh Shykh R'aa محمد بن صدقة",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26511",
      "name": "Zafr bin Suliaman al-Aayady Aw زافر بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28459",
      "name": "'Anbasa bin 'Abdur Rahman bin 'Uayna عنبسة بن عبد الرحمن بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22071",
      "name": "Slm bin Ja'far al-Bakrawy سلم بن جعفر البكراوي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "214",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عمرو بن عامر، قال سمعت أنسا، ح قال وحدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني عمرو بن عامر، عن أنس، قال كان النبي صلى الله عليه وسلم يتوضأ عند كل صلاة‏.‏ قلت كيف كنتم تصنعون قال يجزئ أحدنا الوضوء ما لم يحدث‏.‏",
      "text_en": " Narrated `Amr bin `Amir:                     Anas said, \"The Prophet used to perform ablution for every prayer.\" I asked Anas, \"What did you used to do?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"",
      "chain": [
        "30388",
        "20005",
        "15406",
        "19",
        "30175",
        "20031",
        "20012",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قبيصة، قال حدثنا سفيان، عن عمرو بن عامر، عن أنس، قال لقد رأيت كبار أصحاب النبي صلى الله عليه وسلم يبتدرون السواري عند المغرب‏.‏ وزاد شعبة عن عمرو عن أنس حتى يخرج النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     I saw the most famous people amongst the companions of the Prophet hurrying towards the pillars at the Maghrib prayer before the Prophet came for the prayer.",
      "chain": [
        "20351",
        "20012",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "625",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، قال سمعت عمرو بن عامر الأنصاري، عن أنس بن مالك، قال كان المؤذن إذا أذن قام ناس من أصحاب النبي صلى الله عليه وسلم يبتدرون السواري حتى يخرج النبي صلى الله عليه وسلم وهم كذلك يصلون الركعتين قبل المغرب، ولم يكن بين الأذان والإقامة شىء‏.‏ قال عثمان بن جبلة وأبو داود عن شعبة لم يكن بينهما إلا قليل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"When the Mu'adh-dhin pronounced the Adhan, some of the companions of the Prophet would proceed to the pillars of the mosque (for the prayer) till the Prophet arrived and in this way they used to pray two rak`at before the Maghrib prayer. There used to be a little time between the Adhan and the Iqama.\" Shu`ba said, \"There used to be a very short interval between the two (Adhan and Iqama).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "2280",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن عمرو بن عامر، قال سمعت أنسا  رضى الله عنه  يقول كان النبي صلى الله عليه وسلم يحتجم، ولم يكن يظلم أحدا أجره‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used to get cupped and would never withhold the wages of any person .",
      "chain": [
        "20348",
        "20359",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "5880",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وأبو كريب قال أبو بكر حدثنا وكيع، وقال، أبو كريب - واللفظ له - أخبرنا وكيع، عن مسعر، عن عمرو بن عامر الأنصاري، قال سمعت أنس بن مالك، يقول احتجم رسول الله صلى الله عليه وسلم وكان لا يظلم أحدا أجره ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) got himself cupped and never withheld the wages of anyone.",
      "chain": [
        "30201",
        "30216",
        "20436",
        "20032",
        "20032",
        "20359",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا شريك، عن عمرو بن عامر البجلي، - قال محمد هو أبو أسد بن عمرو - قال سألت أنس بن مالك عن الوضوء، فقال كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة وكنا نصلي الصلوات بوضوء واحد ‏.‏",
      "text_en": " Abu Asad b. ‘Amr said:                      I asked Anas b. Malik about ablution. He replied: The Prophet (ﷺ) performed ablution for each prayer and we offered (many) prayers with the same ablution.",
      "chain": [
        "31167",
        "20587",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "60",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن، هو ابن مهدي قالا حدثنا سفيان بن سعيد، عن عمرو بن عامر الأنصاري، قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم يتوضأ عند كل صلاة ‏.‏ قلت فأنتم ما كنتم تصنعون قال كنا نصلي الصلوات كلها بوضوء واحد ما لم نحدث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Amr bin Amir Al-Ansari narrated that he heard Anas bin Malik saying:                     \"The Prophet would perform Wudu for every Salat.\" I said, \"So what about you, what would you do?\" He said I wouId pray all of the prayers with one Wudu, as long as we had not committed Hadath (anything that invalidates Wudu).\"",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20012",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "132",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن عمرو بن عامر، عن أنس، أنه ذكر أن النبي صلى الله عليه وسلم أتي بإناء صغير فتوضأ ‏.‏ قلت أكان النبي صلى الله عليه وسلم يتوضأ لكل صلاة قال نعم ‏.‏ قال فأنتم قال كنا نصلي الصلوات ما لم نحدث قال وقد كنا نصلي الصلوات بوضوء ‏.‏",
      "text_en": " It was narrated from 'Amr bin 'Amir that Anas mentioned:                      \"The Messenger of Allah (ﷺ) was brought a small vessel (of water) and he performed Wudu'.\" I said: \"Did the Messenger of Allah (ﷺ) perform Wudu' for every prayer?\" He said: \"Yes.\" He said: \"What about you?\" He said: \"We used to pray all the prayers so long as we did not commit Hadath.\" He said: \"And we used to pray all the prayers with (one) Wudu'.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر، حدثنا شعبة، عن عمرو بن عامر الأنصاري، عن أنس بن مالك، قال كان المؤذن إذا أذن قام ناس من أصحاب النبي صلى الله عليه وسلم فيبتدرون السواري يصلون حتى يخرج النبي صلى الله عليه وسلم وهم كذلك ويصلون قبل المغرب ولم يكن بين الأذان والإقامة شىء ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Mu'adhdhin called the Adhan, some of the Companions of the Prophet (ﷺ) would get up and rush to the pillars (in the Masjid) and pray until the Prophet (ﷺ) came out and they were like that. They would pray before Maghrib and there was nothing between the Adhan and Iqamah.\"",
      "chain": [
        "30123",
        "20443",
        "20020",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "549",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا شريك، عن عمرو بن عامر، عن أنس بن مالك، قال كان رسول الله  صلى الله عليه وسلم  يتوضأ لكل صلاة وكنا نحن نصلي الصلوات كلها بوضوء واحد ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah used to perform ablution for every prayer, and we used to perform all of the prayers with one ablution.\"",
      "chain": [
        "30547",
        "20587",
        "15406",
        "19"
      ]
    }
  ],
  "total_hadiths": 10
}