{
  "id": "15516",
  "name": "Mrwan bin Jnah مروان بن جناح",
  "full_name": "Mrwan bin Jnah مروان بن جناح",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ق  -  لا بأس به ]"
    ],
    "tags": [
      "B.Umayya",
      "Client",
      "al-Damashqi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19201",
      "name": "Yonus bin Maysra bin Halbus يونس بن ميسرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12157",
      "name": "Sulaiman bin al-Jhm bin Aby سليمان بن الجهم بن أبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "19130",
      "name": "al-Walid bin Sulaiman bin Aby الوليد بن سليمان بن أبي السائب القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد، ح وحدثنا إبراهيم بن موسى الرازي، أخبرنا الوليد، - وحديث عبد الرحمن أتم - حدثنا مروان بن جناح، عن يونس بن ميسرة بن حلبس، عن واثلة بن الأسقع، قال صلى بنا رسول الله صلى الله عليه وسلم على رجل من المسلمين فسمعته يقول ‏\"‏ اللهم إن فلان بن فلان في ذمتك فقه فتنة القبر ‏\"‏ ‏.‏ قال عبد الرحمن ‏\"‏ في ذمتك وحبل جوارك فقه من فتنة القبر وعذاب النار وأنت أهل الوفاء والحمد اللهم فاغفر له وارحمه إنك أنت الغفور الرحيم ‏\"‏ ‏.‏ قال عبد الرحمن عن مروان بن جناح ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa':                     The Messenger of Allah (ﷺ) led us in prayer over bier of a Muslim and I heard him say: O Allah, so and so, son of so and so, is in Thy protection, so guard him from the trial in the grave. (AbdurRahman in his version said: \"In Thy protection and in Thy nearer presence, so guard him from the trial in the grave) and the punishment in Hell. Thou art faithful and worthy of praise. O Allah, forgive him and show him mercy. Thou art the forgiving and the merciful one.\" AbdurRahman said: \"On the authority of Marwan ibn Janah.\"",
      "chain": [
        "20733",
        "30309",
        "15516",
        "19201",
        "4049"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا مروان بن جناح، عن يونس بن ميسرة بن حلبس، أنه حدثه قال سمعت معاوية بن أبي سفيان، يحدث عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ الخير عادة والشر لجاجة ومن يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Yunus bin Maisarah bin Halbas said:                     \"I heard Mu'awiyah bin Abu Sufyan narrating that the Messenger of Allah said: \"Goodness is a (natural) habit while evil is a stubbornness (constant prodding from Satan). When Allah wills good for a person, He causes him to understand the religion.'\"",
      "chain": [
        "30288",
        "20733",
        "15516",
        "19201",
        "27"
      ]
    },
    {
      "hadith_no": "1566",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا مروان بن جناح، حدثني يونس بن ميسرة بن حلبس، عن واثلة بن الأسقع، قال صلى رسول الله  صلى الله عليه وسلم  على رجل من المسلمين فأسمعه يقول ‏\"‏ اللهم إن فلان بن فلان في ذمتك وحبل جوارك فقه من فتنة القبر وعذاب النار وأنت أهل الوفاء والحق فاغفر له وارحمه إنك أنت الغفور الرحيم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Wathilah bin Asqa’ said:                      “The Messenger of Allah(ﷺ) offered the funeral prayer for a man among the Muslims and Iheard him say: ‘O Allah, so-and-so the son of so-and-so is in Yourcase and under Your protection. Protect him from the trial of thegrave and the torment of the Fire, for You are the One Who keeps thepromise and You are the Truth. Forgive him and have mercy on him, forYou are the Oft-Forgiving, Most Merciful.”",
      "chain": [
        "30285",
        "20733",
        "15516",
        "19201",
        "4049"
      ]
    },
    {
      "hadith_no": "2717",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا مروان بن جناح، عن أبي الجهم الجوزجاني، عن البراء بن عازب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لزوال الدنيا أهون على الله من قتل مؤمن بغير حق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bara' bin Azib that the Messenger of Allah (ﷺ) said:                     “If this world were to be destroyed, that would be less significant before Allah (SWT) than the unlawful killing of a believer.”",
      "chain": [
        "30288",
        "20733",
        "15516",
        "400"
      ]
    }
  ],
  "total_hadiths": 4
}