{
  "id": "15594",
  "name": "Hilal bin Maymun al-Jhny هلال بن ميمون الجهني",
  "full_name": "Hilal bin Maymun al-Jhny هلال بن ميمون الجهني",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ramla",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Juhni",
      "al-Hadhli",
      "al-Ramli",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11206",
      "name": "Ata'a bin Yazid al-Laithi al-Junda'i عطاء بن يزيد الليثي الجندعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12606",
      "name": "Y'la bin Shdad bin Aws يعلى بن شداد بن أوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20565",
      "name": "Muhammad bin Swa'a محمد بن سواء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-185",
      "hadith_no": "185",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، وأيوب بن محمد الرقي، وعمرو بن عثمان الحمصي، - المعنى - قالوا حدثنا مروان بن معاوية، أخبرنا هلال بن ميمون الجهني، عن عطاء بن يزيد الليثي، - قال هلال لا أعلمه إلا عن أبي سعيد ‏.‏ وقال أيوب وعمرو أراه - عن أبي سعيد أن النبي صلى الله عليه وسلم مر بغلام وهو يسلخ شاة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ تنح حتى أريك فأدخل يده بين الجلد واللحم فدحس بها حتى توارت إلى الإبط ثم مضى فصلى للناس ولم يتوضأ ‏.‏ قال أبو داود زاد عمرو في حديثه - يعني - لم يمس ماء ‏.‏ وقال عن هلال بن ميمون الرملي ورواه عبد الواحد بن زياد وأبو معاوية عن هلال عن عطاء عن النبي صلى الله عليه وسلم مرسلا لم يذكرا أبا سعيد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) passed by a boy who was skinning a goat. The Messenger of Allah (ﷺ) said: Give it up until I show you. He (the Prophet) inserted his hand between the skin and the flesh until it reached the armpit. He then went away and led the people in prayer and he did not perform ablution. The version of Amr added that he did not touch water.Abu Dawud said: This tradition has been narrated though another chain of transmitters, making no mention of Abu Sa'id.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "38120",
        "10581",
        "20201",
        "15594",
        "11206",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-652",
      "hadith_no": "652",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا مروان بن معاوية الفزاري، عن هلال بن ميمون الرملي، عن يعلى بن شداد بن أوس، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خالفوا اليهود فإنهم لا يصلون في نعالهم ولا خفافهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Thabit al-Ansari:                     The Messenger of Allah (ﷺ) said: Act differently from the Jews, for they do not pray in their sandals or their shoes.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20201",
        "15594",
        "12606"
      ]
    },
    {
      "id": "sunan-abi-daud-2493",
      "hadith_no": "2493",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بكار العيشي، حدثنا مروان، ح حدثنا عبد الوهاب بن عبد الرحيم الجوبري الدمشقي، - المعنى - قال حدثنا مروان، أخبرنا هلال بن ميمون الرملي، عن يعلى بن شداد، عن أم حرام، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ المائد في البحر الذي يصيبه القىء له أجر شهيد والغرق له أجر شهيدين ‏\"‏ ‏.‏",
      "text_en": " Umm Haram reported the Prophet(ﷺ) as saying “He who becomes sick on a stormy sea and vomits will have the reward of a martyr. And he who is drowned will have a reward of two martyrs.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20201",
        "20201",
        "15594"
      ]
    },
    {
      "id": "sunan-ibn-majah-3300",
      "hadith_no": "3300",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا مروان بن معاوية، حدثنا هلال بن ميمون الجهني، عن عطاء بن يزيد الليثي، - قال عطاء لا أعلمه إلا عن أبي سعيد الخدري - أن رسول الله  صلى الله عليه وسلم  مر بغلام يسلخ شاة فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ تنح حتى أريك ‏\"‏ ‏.‏ فأدخل رسول الله  صلى الله عليه وسلم  يده بين الجلد واللحم فدحس بها حتى توارت إلى الإبط وقال ‏\"‏ يا غلام هكذا فاسلخ ‏\"‏ ‏.‏ ثم مضى وصلى للناس ولم يتوضأ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) passed by a boy who was skinning a sheep. The Messenger ofAllah(ﷺ) said to him:                      “Step aside and I will show you how.”The Messengerof Allah (ﷺ) put his hand between the skin and theflesh, and thrusthis arm in until it disappeared up to the armpit,and said: “O boy,this is how you skin it.” Then he went and ledthe people in prayerand did not perform Wudu’.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20201",
        "15594",
        "11206",
        "38"
      ]
    }
  ],
  "total_hadiths": 4
}