{
  "id": "156",
  "name": "Umm Fadl Lubaba bint al-Harith ( أم الفضل لبابة بنت الحارث ( رضي الله عنها",
  "full_name": "Umm Fadl Lubaba bint al-Harith ( أم الفضل لبابة بنت الحارث ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "34",
      "date_gregorian": "655",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Female",
      "Non-Quraish",
      "B.Hilal",
      "Early Muslim",
      "Emigrant"
    ]
  },
  "parents": [
    {
      "id": "73",
      "name": "Hind bint Awf ( هند / خولة بنت عوف بن زهير ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "100",
      "name": "al-'Abbas ibn 'Abd al-Muttalib ( العباس بن عبد المطلب بن هاشم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "61",
      "name": "Maymuna bint al-Harith ( ميمونة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "141",
      "name": "Lubaba bint al-Harith بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3010",
      "name": "Huzayla bint al-Harith ( هزيلة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3011",
      "name": "'Izza bint al-Harith ( عزة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3012",
      "name": "Umama bint al-Harith ( أمامة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3013",
      "name": "al-Saib bin al-Harith ( السائب بن الحارث بن حزن الهلالي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3014",
      "name": "Qatn bin al-Harith ( قطن بن الحارث بن حزن الهلالي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "69",
      "name": "Asma bint 'Umays ( أسماء بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "86",
      "name": "Salma bint 'Umays ( سلمى بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "135",
      "name": "Fadl ibn al-'Abbas ( الفضل بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "133",
      "name": "'Ubaydallah bin al-'Abbas ( عبيد الله بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "128",
      "name": "Qutham ibn al-'Abbas ( قثم بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "520",
      "name": "Ma'bad bin al-'Abbas ( معبد بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "521",
      "name": "'Abdur Rahman ibn al-'Abbas ( عبد الرحمن بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "522",
      "name": "Umm Habiba ibn al-'Abbas ( أم حبيب/ حبيبة بنت العباس بن عبد المطلب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "527",
      "name": "Tammam ibn al-'Abbas ( تمام بن العباس بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "11532",
      "name": "'Umayr bin 'Abdullah, Client Of Umm Fadl عمير بن عبد الله الهلالي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15453",
      "name": "Qabus bin Abi al-Makharq/al-Makharq قابوس بن أبي المخارق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1687",
      "hadith_no": "1687",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، عن عمير، مولى عبد الله بن العباس عن أم الفضل بنت الحارث، أن ناسا، اختلفوا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl bint Al Harith:                     On the day of `Arafat, some people who were with me, differed about the fasting of the Prophet (p.b.u.h) some said that he was fasting while others said that he was not fasting. So I sent a bowl full of milk to him while he was riding his camel, and he drank that milk.",
      "usc_msa_ref": "723",
      "chain": [
        "20164",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "id": "sahih-bukhari-1988",
      "hadith_no": "1988",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مالك، قال حدثني سالم، قال حدثني عمير، مولى أم الفضل أن أم، الفضل حدثته ح وحدثنا عبد الله بن يوسف أخبرنا مالك عن أبي النضر مولى عمر بن عبيد الله عن عمير مولى عبد الله بن العباس عن أم الفضل بنت الحارث أن ناسا تماروا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl bint Al-Harith:                     \"While the people were with me on the day of `Arafat they differed as to whether the Prophet was fasting or not; some said that he was fasting while others said that he was not fasting. So, I sent to him a bowl full of milk while he was riding over his camel and he drank it.\"",
      "usc_msa_ref": "209",
      "chain": [
        "30175",
        "20031",
        "20001",
        "11011",
        "11532",
        "30355",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "id": "sahih-bukhari-5678",
      "hadith_no": "5678",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا أبو النضر، عن عمير، مولى ابن عباس عن أم الفضل بنت الحارث، أنها أرسلت إلى النبي صلى الله عليه وسلم بقدح لبن، وهو واقف عشية عرفة، فأخذ بيده فشربه‏.‏ زاد مالك عن أبي النضر على بعيره‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     (daughter of Al-Harith) that she sent a bowl of milk to the Prophet while he was standing (at `Arafat) in the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The Prophet was on the back of his camel.",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "32017",
        "20390",
        "11532",
        "156"
      ]
    },
    {
      "id": "sahih-muslim-2688",
      "hadith_no": "2688",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، عن عمير، مولى عبد الله بن عباس عن أم الفضل بنت الحارث، أن ناسا، تماروا عندها يوم عرفة في صيام رسول الله صلى الله عليه وسلم فقال بعضهم هو صائم وقال بعضهم ليس بصائم ‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره بعرفة فشربه ‏.‏",
      "text_en": " Umm al-Fadl bint- al-Harith reported that some people argued about the fasting of the Messenger of Allah (may peace be upon him) on the day of 'Arafa. Some of them said that he had been fasting, whereas the others said that he had not been fasting. I sent a cup of milk to him while he was riding his camel at 'Arafa, and he drank it.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11164",
        "156"
      ]
    },
    {
      "id": "sunan-abi-daud-2441",
      "hadith_no": "2441",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا القعنبي، عن مالك، عن أبي النضر، عن عمير، مولى عبد الله بن عباس عن أم الفضل بنت الحارث، أن ناسا، تماروا عندها يوم عرفة في صوم رسول الله صلى الله عليه وسلم فقال بعضهم هو صائم ‏.‏ وقال بعضهم ليس بصائم ‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره بعرفة فشرب ‏.‏",
      "text_en": " Umm al-Fadl, daughter of al-Harith, said:                      On the day of 'Arafah some people near her argued whether the Messenger of Allah (ﷺ) was fasting, some saying that he was, and others saying that he was not. I, therefore, sent him a cup of milk while he was observing the halt at 'Arafah on his camel, and he drank it.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "id": "jami-al-tirmidhi-308",
      "hadith_no": "308",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن محمد بن إسحاق، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، عن أمه أم الفضل، قالت خرج إلينا رسول الله صلى الله عليه وسلم وهو عاصب رأسه في مرضه فصلى المغرب فقرأ بالمرسلات قالت فما صلاها بعد حتى لقي الله ‏.‏ قال وفي الباب عن جبير بن مطعم وابن عمر وأبي أيوب وزيد بن ثابت ‏.‏ قال أبو عيسى حديث أم الفضل حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قرأ في المغرب بالأعراف في الركعتين كلتيهما ‏.‏ وروي عن النبي صلى الله عليه وسلم أنه قرأ في المغرب بالطور ‏.‏ وروي عن عمر أنه كتب إلى أبي موسى أن اقرأ في المغرب بقصار المفصل ‏.‏ وروي عن أبي بكر الصديق أنه قرأ في المغرب بقصار المفصل ‏.‏ قال وعلى هذا العمل عند أهل العلم وبه يقول ابن المبارك وأحمد وإسحاق ‏.‏ وقال الشافعي وذكر عن مالك أنه كره أن يقرأ في صلاة المغرب بالسور الطول نحو الطور والمرسلات قال الشافعي لا أكره ذلك بل أستحب أن يقرأ بهذه السور في صلاة المغرب ‏.‏",
      "text_en": " Umm Al-Fadl narrated:                     \"Allah's Messenger came out to us with his head bandaged from his illness. He prayed Maghrib, reciting (Surat) Al-Mursalat.\" [She said:] \"He did not pray it again until he met Allah the Might and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11013",
        "11004",
        "17",
        "156"
      ]
    },
    {
      "id": "sunan-an-nasai-985",
      "hadith_no": "985",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا موسى بن داود، قال حدثنا عبد العزيز بن أبي سلمة الماجشون، عن حميد، عن أنس، عن أم الفضل بنت الحارث، قالت صلى بنا رسول الله صلى الله عليه وسلم في بيته المغرب فقرأ المرسلات ما صلى بعدها صلاة حتى قبض صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Anas that Umm Al-Fadl bint Al-Harith said:                     \" The Messenger of Allah (ﷺ) led us in praying maghrib in his house and he recited Al-Mursalat, then after that, he never offered any prayer until he died.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20636",
        "20026",
        "11279",
        "19",
        "156"
      ]
    },
    {
      "id": "sunan-an-nasai-986",
      "hadith_no": "986",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن عبيد الله، عن ابن عباس، عن أمه، أنها سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالمرسلات ‏.‏",
      "text_en": " It was narrated from Ibn Abbas from his mother that:                     She heard the Prophet (ﷺ) recite Al-Mursalat in Maghrib.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11201",
        "17",
        "156"
      ]
    },
    {
      "id": "sunan-ibn-majah-880",
      "hadith_no": "880",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهشام بن عمار، قالا حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن أمه، - قال أبو بكر بن أبي شيبة هي لبابة - أنها سمعت رسول الله  صلى الله عليه وسلم  يقرأ في المغرب بالمرسلات عرفا ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said, narrating from his mother (oneofthe narrators) Abu Bakr bin Abu Shaibah said:                      “(She was) Lubabah”that she heard the Messenger of Allah (ﷺ) reciting ‘By the windssent forth one after another...’[Al-Mursalat (77)] in the Maghrib.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30288",
        "20005",
        "11013",
        "11004",
        "17",
        "156"
      ]
    }
  ],
  "total_hadiths": 9
}