{
  "id": "15634",
  "name": "Yazid bin Aws يزيد بن أوس",
  "full_name": "Yazid bin Aws يزيد بن أوس",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  -  مقبول ]"
    ],
    "tags": [
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15056",
      "name": "Thabit bin Qays al-Nakha'i ثابت بن قيس بن منقع النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن يزيد بن أوس، قال دخلت على أبي موسى وهو ثقيل فذهبت امرأته لتبكي أو تهم به فقال لها أبو موسى أما سمعت ما قال رسول الله صلى الله عليه وسلم قالت بلى ‏.‏ قال فسكتت فلما مات أبو موسى - قال يزيد - لقيت المرأة فقلت لها ما قول أبي موسى لك أما سمعت ما قال رسول الله صلى الله عليه وسلم ثم سكت قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من حلق ومن سلق ومن خرق ‏\"‏ ‏.‏",
      "text_en": " Yazid ibn Aws said:                      I entered upon AbuMusa while he was at the point of death. His wife began to weep or was going to weep. AbuMusa said to her: Did you not hear what the Messenger of Allah (ﷺ) said? She said: Yes. The narrator said: She then kept silence. When AbuMusa died, Yazid said: I met the woman and asked her: What did AbuMusa mean when he said to you: Did you not hear what the Messenger of Allah (ﷺ) and the you kept silence? She replied: The Messenger of Allah (ﷺ) said: He who shaves (his head), shouts and tears his clothing does not belong to us.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "15634"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عمر بن حفص، قال حدثنا أبي ح، وأنبأنا إبراهيم بن يعقوب، قال حدثنا يحيى بن معين، قال حدثنا حفص، ح وأنبأنا عمرو بن منصور، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن الحسن بن عبيد الله، عن إبراهيم، عن يزيد بن أوس، عن ثابت بن قيس، عن أبي موسى، يرفعه قال ‏\"‏ أبردوا بالظهر فإن الذي تجدون من الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa in a Marfu' [1] report:                      \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"[1] Meaning he attributed it to the Prophet (ﷺ).",
      "chain": [
        "38088",
        "30204",
        "20317",
        "38088",
        "30020",
        "20317",
        "38433",
        "30204",
        "20317",
        "10755",
        "11051",
        "15634",
        "239"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، عن إبراهيم، عن يزيد بن أوس، عن أبي موسى، أنه أغمي عليه فبكت أم ولد له فلما أفاق قال لها أما بلغك ما قال رسول الله صلى الله عليه وسلم فسألناها فقالت قال ‏\"‏ ليس منا من سلق وحلق وخرق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Yazid bin Aws, that:                     Abu Musa said he fell unconscious and an Umm Walad of his wept. When he woke up, he asked her: \"Have you not heard what the Messenger of Allah said?\" She said: \"He said: 'He is not one of us who raises his voice in lamentation, shaves his head, or rends his garments.\"\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11067",
        "11051",
        "15634",
        "41"
      ]
    },
    {
      "hadith_no": "1866",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال حدثنا يحيى بن آدم، قال حدثنا إسرائيل، عن منصور، عن إبراهيم، عن يزيد بن أوس، عن أم عبد الله، امرأة أبي موسى عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm 'Abdullah, the wife of Abu Musa, that Abu Musa said:                     \"The Messenger of Allah said: 'He is not one of us who shaves his head, raises his voice in lamentation or rends his garments.\"'",
      "chain": [
        "30149",
        "20364",
        "20311",
        "11067",
        "11051",
        "15634",
        "5392",
        "41"
      ]
    }
  ],
  "total_hadiths": 4
}