{
  "id": "15646",
  "name": "Yazid bin al-Mqdam bin Shryh يزيد بن المقدام بن شريح",
  "full_name": "Yazid bin al-Mqdam bin Shryh يزيد بن المقدام بن شريح",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "B.Haritha",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4955",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الربيع بن نافع، عن يزيد، - يعني ابن المقدام بن شريح - عن أبيه، عن جده، شريح عن أبيه، هانئ أنه لما وفد إلى رسول الله صلى الله عليه وسلم مع قومه سمعهم يكنونه بأبي الحكم فدعاه رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله هو الحكم وإليه الحكم فلم تكنى أبا الحكم ‏\"‏ ‏.‏ فقال إن قومي إذا اختلفوا في شىء أتوني فحكمت بينهم فرضي كلا الفريقين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحسن هذا فما لك من الولد ‏\"‏ ‏.‏ قال لي شريح ومسلم وعبد الله ‏.‏ قال ‏\"‏ فمن أكبرهم ‏\"‏ ‏.‏ قلت شريح قال ‏\"‏ فأنت أبو شريح ‏\"‏ ‏.‏ قال أبو داود شريح هذا هو الذي كسر السلسلة وهو ممن دخل تستر ‏.‏ قال أبو داود وبلغني أن شريحا كسر باب تستر وذلك أنه دخل من سرب ‏.‏",
      "text_en": " Narrated Hani ibn Yazid:                     When Hani went with his people in a deputation to the Messenger of Allah (ﷺ), he heard them calling him by his kunyah (surname), AbulHakam.  So the Messenger of Allah (ﷺ) called him and said: Allah is the judge (al-Hakam), and to Him judgment belongs. Why are you given the kunyah AbulHakam?  He replied: When my people disagree about a matter, they come to me, and I decide between them, and both parties are satisfied with my decision.  He said: How good this is! What children have you?  He replied: I have Shurayh, Muslim and Abdullah.  He asked; Who is the oldest of them?  I replied: Shurayh.  He said: Then you are AbuShurayh.Abu Dawud said: This is Shuraib who broke the chain, and who entered Tustar.Abu Dawud said: I have been told that Shuraib broke the gate of Tustar, and he entered it through tunnel.",
      "chain": [
        "30335",
        "15646"
      ]
    },
    {
      "hadith_no": "281",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا يزيد، - وهو ابن المقدام بن شريح بن هانئ - عن أبيه، عن شريح، عن عائشة، رضى الله عنها سألتها هل تأكل المرأة مع زوجها وهي طامث قالت نعم كان رسول الله صلى الله عليه وسلم يدعوني فآكل معه وأنا عارك وكان يأخذ العرق فيقسم على فيه فأعترق منه ثم أضعه فيأخذه فيعترق منه ويضع فمه حيث وضعت فمي من العرق ويدعو بالشراب فيقسم على فيه قبل أن يشرب منه فآخذه فأشرب منه ثم أضعه فيأخذه فيشرب منه ويضع فمه حيث وضعت فمي من القدح ‏.‏",
      "text_en": " It was narrated from Shuraih that he asked 'Aishah:                      \"Can a woman eat with her husband while she is menstruating? She said: 'Yes. The Messenger of Allah (ﷺ) would call me to eat with him while I was menstruating. He would take a piece of bone on which some bits of meat were left and insist that I take it first, so I would nibble a little from it, then put it down. Then he would take it and nibble from it, and he would put his mouth where mine had been on the bone. Then he would ask for a drink and insist that I take it first before he drank from it. So I would take it and drink from it, then put it down, then he would take it and drink from it, putting his mouth where mine had been on the cup.'\"",
      "chain": [
        "30367",
        "15646",
        "53"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا قتيبة بن سعيد بن جميل بن طريف، قال أنبأنا يزيد بن المقدام بن شريح بن هانئ، عن أبيه، عن شريح، أنه سأل عائشة هل تأكل المرأة مع زوجها وهي طامث قالت نعم كان رسول الله صلى الله عليه وسلم يدعوني فآكل معه وأنا عارك كان يأخذ العرق فيقسم على فيه فأعترق منه ثم أضعه فيأخذه فيعترق منه ويضع فمه حيث وضعت فمي من العرق ويدعو بالشراب فيقسم على فيه من قبل أن يشرب منه فآخذه فأشرب منه ثم أضعه فيأخذه فيشرب منه ويضع فمه حيث وضعت فمي من القدح ‏.‏",
      "text_en": " It was narrated from Shuraih that he asked 'Aishah:                      \"Can a woman eat with her husband while she is menstruating?' She said: 'Yes. The Messenger of Allah (ﷺ) would call me to eat with him while I was menstruating. He would take a piece of bone on which some bits of meat were left and insist that I take it first, so I would nibble a little from it, then put it down. Then he would take it and nibble from it, and he would put his mouth where mine had been on the bone. Then he would call for a drink and insist that I take it first before he drank from it. So I would take it and drink from it, then put it down, then he would take it and drink from it, putting his mouth where mine had been on the cup.'\"",
      "chain": [
        "30367",
        "15646"
      ]
    },
    {
      "hadith_no": "3889",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن المقدام بن شريح، عن أبيه المقدام، عن أبيه، أن عائشة، أخبرته أن النبي  صلى الله عليه وسلم  كان إذا رأى سحابا مقبلا من أفق من الآفاق ترك ما هو فيه وإن كان في صلاته حتى يستقبله فيقول ‏\"‏ اللهم إنا نعوذ بك من شر ما أرسل به ‏\"‏ ‏.‏ فإن أمطر قال ‏\"‏ اللهم سيبا نافعا ‏\"‏ ‏.‏ مرتين أو ثلاثة وإن كشفه الله عز وجل ولم يمطر حمد الله على ذلك ‏.‏",
      "text_en": " ‘Aishah narrated that when the Prophet (ﷺ) saw a cloud approaching from any horizon, he would stop what he was doing, even if he was praying, and turn to face it, then he would say:                      “Allahumma inna na’udhu bika min sharri ma ursila bihi (O Allah, we seek refuge with You from the evil of that with which it is sent).” Then if it rained he would say: “Allahumma sayyiban nafi’an (O Allah, a beneficial rain),” two or three times. And if Allah dispelled it and it did not rain, he would praise Allah for that.",
      "chain": [
        "30201",
        "15646",
        "53"
      ]
    }
  ],
  "total_hadiths": 4
}