{
  "id": "15659",
  "name": "Abu Umamah Or Abu Umayya أبو أمامة / أبو أميمة التميمي",
  "full_name": "Abu Umamah Or Abu Umayya أبو أمامة / أبو أميمة التميمي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  مقبول ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11624",
      "name": "al-Hasan bin 'Amr al-Fqymy الحسن بن عمرو الفقيمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7094",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم، حدثني أبي، عن صالح، عن ابن شهاب، قال حدثني أبو أمامة بن سهل، أنه سمع أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ بينما أنا نائم رأيت الناس يعرضون على، وعليهم قمص، منها ما يبلغ الثدى، ومنها ما يبلغ دون ذلك، ومر على عمر بن الخطاب وعليه قميص يجره ‏\"‏‏.‏ قالوا ما أولت يا رسول الله قال ‏\"‏ الدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"While I was sleeping, some people were displayed before me (in a dream). They were wearing shirts, some of which were merely covering their breasts, and some a bit longer. Then there passed before me, `Umar bin Al-Khattab wearing a shirt he was dragging it (on the ground behind him.)\" They (the people) asked, \"What have you interpreted (about the dream) O Allah's Apostle?\" He said, \"The Religion.\"",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "15659",
        "38"
      ]
    },
    {
      "hadith_no": "7095",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن عفير، حدثني الليث، حدثني عقيل، عن ابن شهاب، أخبرني أبو أمامة بن سهل، عن أبي سعيد الخدري  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينا أنا نائم رأيت الناس عرضوا على، وعليهم قمص، فمنها ما يبلغ الثدى، ومنها ما يبلغ دون ذلك، وعرض على عمر بن الخطاب وعليه قميص يجتره ‏\"‏‏.‏ قالوا فما أولته يا رسول الله قال ‏\"‏ الدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"While I was sleeping, I saw (in a dream) the people being displayed before me, wearing shirts, some of which (were so short that it) reached as far as their breasts and some reached below that. Then `Umar bin Al-Khattab was shown to me and he was wearing a shirt which he was dragging (behind him).\" They asked. What have you interpreted (about the dream)? O Allah's Apostle?\" He said, \"The religion.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "15659",
        "38"
      ]
    },
    {
      "hadith_no": "1444",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا منصور بن أبي مزاحم، حدثنا عبد الله بن المبارك، عن أبي بكر بن عثمان بن سهل بن حنيف، قال سمعت أبا أمامة بن سهل، يقول صلينا مع عمر بن عبد العزيز الظهر ثم خرجنا حتى دخلنا على أنس بن مالك فوجدناه يصلي العصر فقلت يا عم ما هذه الصلاة التي صليت قال العصر وهذه صلاة رسول الله صلى الله تعالى عليه وسلم التي كنا نصلي معه ‏.‏",
      "text_en": " Abu Umama b. Sahl reported:                      We offered the noon prayer with Umar b. 'Abd al-'Aziz. We then set out till we came to Anas b. Malik and found him busy in saying the afternoon prayer. I said to him: O uncle! which is this prayer that you are offering? He said: It is the afternoon prayer and this is the prayer of the Messenger of Allah (may peace be upon him) that we offered along with him.",
      "chain": [
        "30523",
        "20025",
        "11548",
        "15659"
      ]
    },
    {
      "hadith_no": "5150",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثنا أبي، عن جدي، حدثني خالد بن، يزيد حدثني سعيد بن أبي هلال، عن ابن المنكدر، أن أبا أمامة بن سهل، أخبره عن ابن، عباس قال أتي رسول الله صلى الله عليه وسلم وهو في بيت ميمونة وعنده خالد بن الوليد بلحم ضب ‏.‏ فذكر بمعنى حديث الزهري ‏.‏",
      "text_en": " Ibn 'Abbas reported that there had been brought to Allah's Messenger (may peace be upon him) the flesh of a lizard and Khalid b. Walid was also present there. The rest of the hadith is the same.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11048",
        "15659",
        "17"
      ]
    },
    {
      "hadith_no": "6340",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، ح وحدثنا زهير بن حرب، والحسن بن علي الحلواني، وعبد بن حميد، - واللفظ لهم - قالوا حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني أبو أمامة، بن سهل أنه سمع أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم رأيت الناس يعرضون وعليهم قمص منها ما يبلغ الثدي ومنها ما يبلغ دون ذلك ومر عمر بن الخطاب وعليه قميص يجره ‏\"‏ ‏.‏ قالوا ماذا أولت ذلك يا رسول الله قال ‏\"‏ الدين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported Allah's Messenger (may peace be upon him) as say ing:                      While I was asleep I saw people being presented to me (in a dream) and they wore shirts and some of these reached up to the breasts and some even beyond them. Then there happened to pass 'Umar b. Khattab and his shirt had been trailing. They said: Allah's Messeneer, how do you interpret the dream? He said: (As strength of) faith.",
      "chain": [
        "30523",
        "20150",
        "11176",
        "30022",
        "30115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "15659",
        "38"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبي بكر بن عثمان بن سهل بن حنيف، قال سمعت أبا أمامة بن سهل، يقول صلينا مع عمر بن عبد العزيز الظهر ثم خرجنا حتى دخلنا على أنس بن مالك فوجدناه يصلي العصر قلت يا عم ما هذه الصلاة التي صليت قال العصر وهذه صلاة رسول الله صلى الله عليه وسلم التي كنا نصلي ‏.‏",
      "text_en": " It was narrated that Abu Bakr bin 'Uthman bin Sahl bin Hunaif said:                      \"I heard Abu Umamah bin Sahl say: 'We prayed Zuhr with 'Umar bin 'Abdul-'Aziz, then we went out and entered upon Anas bin Malik, and we found him praying 'Asr.'\" I said: \"O uncle, what is this prayer that you prayed?\" He said: \"'Asr; this is the prayer of the Messenger of Allah (ﷺ) that we used to pray with him.\"",
      "chain": [
        "38265",
        "20025",
        "11548",
        "15659"
      ]
    },
    {
      "hadith_no": "1911",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد، قال حدثنا عبد الله، عن يونس، عن الزهري، قال حدثني أبو أمامة بن سهل، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرعوا بالجنازة فإن كانت صالحة قدمتموها إلى الخير وإن كانت غير ذلك كانت شرا تضعونه عن رقابكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"I heard the Messenger of Allah say: ,Hsten with the Janazah, for if it was righteous then you are taking it toward something good, and if it was otherwise, then it is an evil of which you are relieving yourselves.\"'",
      "chain": [
        "18",
        "20475",
        "11013",
        "15659",
        "13"
      ]
    },
    {
      "hadith_no": "4019",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا محمد بن عيسى، قال حدثنا حماد بن زيد، قال حدثنا يحيى بن سعيد، قال حدثني أبو أمامة بن سهل، وعبد الله بن عامر بن ربيعة، قالا كنا مع عثمان وهو محصور - وكنا إذا دخلنا مدخلا نسمع كلام من بالبلاط - فدخل عثمان يوما ثم خرج فقال إنهم ليتواعدوني بالقتل ‏.‏ قلنا يكفيكهم الله ‏.‏ قال فلم يقتلوني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث رجل كفر بعد إسلامه أو زنى بعد إحصانه أو قتل نفسا بغير نفس ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا إسلام ولا تمنيت أن لي بديني بدلا منذ هداني الله ولا قتلت نفسا فلم يقتلونني",
      "text_en": " Abu Umamah bin Sahl and 'Abdullah bin 'Amir bin Rabi'ah said:                     \"We were with 'Uthman when he was under siege and we could hear what was said from Al-Balat. 'Uthman came in one day, then he came out, and said: 'They are threatening to kill me.' We said: 'Allah will suffice you against them.' He said: 'Why would they kill me? I heard the Messenger of Allah [SAW] say: It is not permissible to shed the blood of a Muslim except in one of three cases: A man who reverts to Kufr after becoming Muslim, or commits adultery after being married, or one who kills a soul unlawfully. By Allah, I did not commit adultery during Jahiliyyah or in Islam, I never wished to follow any other religion since Allah guided me, and I have never killed anyone, so why do they want to kill me?'\"",
      "chain": [
        "38088",
        "31167",
        "20022",
        "11062",
        "15659",
        "709"
      ]
    },
    {
      "hadith_no": "5011",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله قال حدثنا يعقوب بن إبراهيم بن سعد قال حدثنا أبي عن صالح بن كيسان عن ابن شهاب قال حدثني أبو أمامة بن سهل أنه سمع أبا سعيد الخدري قال  قال رسول الله صلى الله عليه وسلم بينا أنا نائم رأيت الناس يعرضون علي وعليهم قمص منها ما يبلغ الثدي ومنها ما يبلغ دون ذلك  وعرض علي عمر بن الخطاب وعليه قميص يجره قال فماذا أولت ذلك يا رسول الله قال الدين",
      "text_en": " Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] said: 'While I was sleeping, I saw the people being shown to me, and they were wearing shirts. Some reached the breast and some reached lower than that. And 'Umar bin Al-Khattab was shown to me, and he was wearing a shirt that he was dragging;' They said: 'How do you interpret that, O Messenger of Allah?' He said: 'The religion.'\"",
      "chain": [
        "11222",
        "20184",
        "20150",
        "11176",
        "11013",
        "15659",
        "38"
      ]
    }
  ],
  "total_hadiths": 9
}