{
  "id": "15694",
  "name": "Abu al-Mukhtar al-Ta'iy Qyl أبو المختار الطائي قيل",
  "full_name": "Abu al-Mukhtar al-Ta'iy Qyl أبو المختار الطائي قيل",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ ت  عس  -  مجهول ]"
    ],
    "tags": [
      "al-Tai'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11347",
      "name": "Sa'id bin Fyrwz Abu al-Bakhtari al-Tai'i سعيد بن فيروز أبو البختري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3153",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، قال سمعت حمزة الزيات، عن أبي المختار الطائي، عن ابن أخي الحارث الأعور، عن الحارث، قال مررت في المسجد فإذا الناس يخوضون في الأحاديث فدخلت على علي فقلت يا أمير المؤمنين ألا ترى أن الناس قد خاضوا في الأحاديث ‏.‏ قال وقد فعلوها قلت نعم ‏.‏ قال أما إني قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ألا إنها ستكون فتنة ‏\"‏ ‏.‏ فقلت ما المخرج منها يا رسول الله قال ‏\"‏ كتاب الله فيه نبأ ما كان قبلكم وخبر ما بعدكم وحكم ما بينكم هو الفصل ليس بالهزل من تركه من جبار قصمه الله ومن ابتغى الهدى في غيره أضله الله وهو حبل الله المتين وهو الذكر الحكيم وهو الصراط المستقيم هو الذي لا تزيغ به الأهواء ولا تلتبس به الألسنة ولا يشبع منه العلماء ولا يخلق على كثرة الرد ولا تنقضي عجائبه هو الذي لم تنته الجن إذ سمعته حتى قالوا ‏(‏إنا سمعنا قرآنا عجبا * يهدي إلى الرشد ‏)‏ من قال به صدق ومن عمل به أجر ومن حكم به عدل ومن دعا إليه هدي إلى صراط مستقيم ‏\"‏ ‏.‏ خذها إليك يا أعور ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من هذا الوجه وإسناده مجهول ‏.‏ وفي الحارث مقال ‏.‏",
      "text_en": " Narrated Al-Harith Al-A'war:                     \"I passed by the Masjid when the people were absorbed in story-telling. So I entered upon 'Ali and said: 'O Commander of the believers! Do you not see the people are becoming engrossed in story-telling?' He said: 'They have been consumed with it?' I said: \"Yes.' He said: 'As for me, I heard the Messenger of Allah (ﷺ) saying: \"Indeed there comes a Fitnah\" So I said: \"What is the way out from it O Messenger of Allah?\" He said: \"Allah's book. In it is news for what happened before you, and information about what comes after you, and judgement for what happens between you. It is the Criterion (between right and wrong) without jest. Whoever among the oppressive abandons it, Allah crushes him, and whoever seeks guidance from other than it, then Allah leaves him to stray. It is the firm rope of Allah, it is the wise remembrance, it is the straight path, and it is the one that the desires can not distort, nor can the tongues twist it, nor can the scholars ever have enough of it, and it shall not become dull from reciting it much, and the amazement of it does not diminish. It is the one that when the Jinns hear it, they did not hesitate to say about it: 'Verily, we have heard a wonderful Recitation (this Qur'an)! 'It guides to the Right Path, and we have believed therein.' Whoever speaks according to it then he has said the truth, and whoever acts according to it he is rewarded, and whoever judges by it he has judged justly, and whoever invites to it then he guides to the straight path.\" Take this O A'war!'.\"",
      "chain": [
        "30553",
        "20315",
        "20583",
        "15694"
      ]
    }
  ],
  "total_hadiths": 1
}