{
  "id": "16",
  "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
  "full_name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "32",
      "date_gregorian": "652",
      "date_display": null,
      "place": "Medina/Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Abyssinia",
      "Medina",
      "kufah"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "al-Hadhli",
      "Ally B.Zurah",
      "Early Muslim",
      "Abyssinia 1",
      "Abyssinia 2",
      "Emigrant",
      "Badr",
      "Uhud",
      "Khandaq",
      "Servant",
      "Baqi'"
    ]
  },
  "parents": [
    {
      "id": "499",
      "name": "Umm 'Abdullah bin Mas'ud ( أم عبد الله بن مسعود ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "497",
      "name": "Rayta bint 'Abdullah ( ريطة بنت عبد الله بن معاوية الثقفية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "498",
      "name": "Zaynab bint. Abi Mu'awiya ( زينب بنت أبي معاوية الثقفية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "765",
      "name": "'Utba ibn Mas'ud ( عتبة بن مسعود بن غافل ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11363",
      "name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "46",
      "name": "Sa'd ibn Mua'dh ( سعد بن معاذ بن النعمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4143",
      "name": "Safwan bin 'Assal ( صفوان بن عسال ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11363",
      "name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4145",
      "name": "'Abdullah bin 'Utba ( عبد الله بن عتبة بن مسعود الهذلي ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4113",
      "name": "al-Hajjaj bin Malik al-Aslami ( حجاج بن مالك الأسلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4047",
      "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "479",
      "name": "Abu Rafi' ( أسلم أبو رافع مولى رسول الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10780",
      "name": "'Abdullah bin al-Harith عبد الله بن الحارث الزبيدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5201",
      "name": "'Amr bin al-Harith bin Abi Darar ( عمرو بن الحارث بن أبي ضرار المصطلقي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5238",
      "name": "Qurrah bin Iyas ( قرة بن إياس بن هلال ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18881",
      "name": "Khultum bin al-Mstlq Whw Khultum كلثوم بن المصطلق",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "5355",
      "name": "Abu Sharih al-Khuza'i,al-Ka'bi ( أبو شريح الخزاعي خويلد بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "498",
      "name": "Zaynab bint. Abi Mu'awiya ( زينب بنت أبي معاوية الثقفية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11363",
      "name": "'Abdur Rahman bin 'Abdullah عبد الرحمن بن عبد الله بن مسعود الهذلي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10760",
      "name": "al-Rabi' bin Khathaym الربيع بن خثيم الثوري",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15229",
      "name": "Sharih bin al-Harith bin Qays شريح بن الحارث بن قيس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11330",
      "name": "al-Harith bin Suwayd al-Tymy الحارث بن سويد التيمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11337",
      "name": "Zar bin Habaysh bin Habasha زر بن حبيش بن حباشة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15580",
      "name": "Harun bin 'Antra هارون بن عنترة بن عبد الرحمن الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "169",
      "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10786",
      "name": "'Abdullah bin 'Akaym عبد الله بن عكيم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11370",
      "name": "'Ubaida bin 'Amr al-Salamani عبيدة بن عمرو",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11644",
      "name": "'Amr bin Sharhbayl, Abu Maysara عمرو بن شرحبيل الهمداني أبو ميسرة الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11731",
      "name": "Abu 'Atiya al-Wada'i al-Hamadani أبو عطية الوادعي الهمداني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10824",
      "name": "al-Mstwrd bin al-Ahnf al-Kwfy المستورد بن الأحنف الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11659",
      "name": "al-Nazal bin Sabra النزال بن سبرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11114",
      "name": "Abu al-Aswad al-Du'ali أبو الأسود الديلي/الدؤلي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11397",
      "name": "al-Ma'rur bin Suwayd al-Asadi المعرور بن سويد الأسدي أبو أمية الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "32",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، ح‏.‏ قال وحدثني بشر، قال حدثنا محمد، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب رسول الله صلى الله عليه وسلم أينا لم يظلم فأنزل الله ‏{‏إن الشرك لظلم عظيم‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)",
      "chain": [
        "20296",
        "20020",
        "20212",
        "20278",
        "20020",
        "11005",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "48",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن زبيد، قال سألت أبا وائل عن المرجئة،، فقال حدثني عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ سباب المسلم فسوق، وقتاله كفر ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          The Prophet said, \"Abusing a Muslim is Fusuq (an evil doing) and      killing him is Kufr (disbelief).\"",
      "chain": [
        "20282",
        "20020",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "68",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن يوسف، قال أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن ابن مسعود، قال كان النبي صلى الله عليه وسلم يتخولنا بالموعظة في الأيام، كراهة السآمة علينا‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     The Prophet used to take care of us in preaching by selecting a suitable time, so that we might not get bored. (He abstained from pestering us with sermons and knowledge all the time).",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "70",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي وائل، قال كان عبد الله يذكر الناس في كل خميس، فقال له رجل يا أبا عبد الرحمن لوددت أنك ذكرتنا كل يوم‏.‏ قال أما إنه يمنعني من ذلك أني أكره أن أملكم، وإني أتخولكم بالموعظة كما كان النبي صلى الله عليه وسلم يتخولنا بها، مخافة السآمة علينا‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba `Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which prevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by selecting a suitable time just as the Prophet used to do with us, for fear of making us bored.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "73",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثني إسماعيل بن أبي خالد، على غير ما حدثناه الزهري، قال سمعت قيس بن أبي حازم، قال سمعت عبد الله بن مسعود، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلط على هلكته في الحق، ورجل آتاه الله الحكمة، فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom Allah has given wealth and he spends it righteously; (the second is) the one whom Allah has given wisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 Vol. 1)",
      "chain": [
        "30418",
        "20005",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا قيس بن حفص، قال حدثنا عبد الواحد، قال حدثنا الأعمش، سليمان عن إبراهيم، عن علقمة، عن عبد الله، قال بينا أنا أمشي، مع النبي صلى الله عليه وسلم في خرب المدينة، وهو يتوكأ على عسيب معه، فمر بنفر من اليهود، فقال بعضهم لبعض سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه لا يجيء فيه بشىء تكرهونه‏.‏ فقال بعضهم لنسألنه‏.‏ فقام رجل منهم فقال يا أبا القاسم، ما الروح فسكت‏.‏ فقلت إنه يوحى إليه‏.‏ فقمت، فلما انجلى عنه، قال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏‏.‏ قال الأعمش هكذا في قراءتنا‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was going with the Prophet through the ruins of Medina and he was reclining on a date-palm leaf stalk, some Jews passed by. Some of them said to the others: Ask him (the Prophet) about the spirit. Some of them said that they should not ask him that question as he might give a reply which would displease them. But some of them insisted on asking, and so one of them stood up and asked, \"O Abul-Qasim ! What is the spirit?\" The Prophet remained quiet. I thought he was being inspired Divinely. So I stayed till that state of the Prophet (while being inspired) was over. The Prophet then said, \"And they ask you (O Muhammad) concerning the spirit --Say: The spirit -- its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little).\" (17.85)",
      "chain": [
        "30158",
        "20256",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، قال ليس أبو عبيدة ذكره ولكن عبد الرحمن بن الأسود عن أبيه، أنه سمع عبد الله، يقول أتى النبي صلى الله عليه وسلم الغائط، فأمرني أن آتيه بثلاثة أحجار، فوجدت حجرين، والتمست الثالث فلم أجده، فأخذت روثة، فأتيته بها، فأخذ الحجرين وألقى الروثة وقال ‏\"‏ هذا ركس ‏\"‏‏.‏ وقال إبراهيم بن يوسف عن أبيه عن أبي إسحاق حدثني عبد الرحمن‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet went out to answer the call of nature and asked me to bring three stones. I found two stones and searched for the third but could not find it. So took a dried piece of dung and brought it to him. He took the two stones and threw away the dung and said, \"This is a filthy thing.\"",
      "chain": [
        "20348",
        "20321",
        "11049",
        "16"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينا رسول الله صلى الله عليه وسلم ساجد ح قال وحدثني أحمد بن عثمان قال حدثنا شريح بن مسلمة قال حدثنا إبراهيم بن يوسف عن أبيه عن أبي إسحاق قال حدثني عمرو بن ميمون أن عبد الله بن مسعود حدثه أن النبي صلى الله عليه وسلم كان يصلي عند البيت، وأبو جهل وأصحاب له جلوس، إذ قال بعضهم لبعض أيكم يجيء بسلى جزور بني فلان فيضعه على ظهر محمد إذا سجد فانبعث أشقى القوم فجاء به، فنظر حتى إذا سجد النبي صلى الله عليه وسلم وضعه على ظهره بين كتفيه وأنا أنظر، لا أغير شيئا، لو كان لي منعة‏.‏ قال فجعلوا يضحكون ويحيل بعضهم على بعض، ورسول الله صلى الله عليه وسلم ساجد لا يرفع رأسه، حتى جاءته فاطمة، فطرحت عن ظهره، فرفع رأسه ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏‏.‏ ثلاث مرات، فشق عليهم إذ دعا عليهم  قال وكانوا يرون أن الدعوة في ذلك البلد مستجابة  ثم سمى ‏\"‏ اللهم عليك بأبي جهل، وعليك بعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط ‏\"‏‏.‏ وعد السابع فلم يحفظه قال فوالذي نفسي بيده، لقد رأيت الذين عد رسول الله صلى الله عليه وسلم صرعى في القليب قليب بدر‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Once the Prophet was offering prayers at the Ka`ba. Abu Jahl was sitting with some of his companions. One of them said to the others, \"Who amongst you will bring the Abdominal contents (intestines, etc.) of a camel of Bani so and so and put it on the back of Muhammad, when he prostrates?\" The most unfortunate of them got up and brought it. He waited till the Prophet prostrated and then placed it on his back between his shoulders. I was watching but could not do any thing. I wish I had some people with me to hold out against them. They started laughing and falling on one another. Allah's Apostle was in prostration and he did not lift his head up till Fatima (Prophet's daughter) came and threw that (camel's Abdominal contents) away from his back. He raised his head and said thrice, \"O Allah! Punish Quraish.\" So it was hard for Abu Jahl and his companions when the Prophet invoked Allah against them as they had a conviction that the prayers and invocations were accepted in this city (Mecca). The Prophet said, \"O Allah! Punish Abu Jahl, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, and `Uqba bin Al Mu'it [??] (and he mentioned the seventh whose name I cannot recall). By Allah in Whose Hands my life is, I saw the dead bodies of those persons who were counted by Allah's Apostle in the Qalib (one of the wells) of Badr.",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "345",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا بشر بن خالد، قال حدثنا محمد  هو غندر  عن شعبة، عن سليمان، عن أبي وائل، قال قال أبو موسى لعبد الله بن مسعود إذا لم يجد الماء لا يصلي‏.‏ قال عبد الله لو رخصت لهم في هذا، كان إذا وجد أحدهم البرد قال هكذا  يعني تيمم وصلى  قال قلت فأين قول عمار لعمر قال إني لم أر عمر قنع بقول عمار‏.‏",
      "text_en": " Narrated Abu Wail:                     Abu Musa said to `Abdullah bin Mas`ud, \"If one does not find water (for ablution) can he give up the prayer?\" `Abdullah replied, \"If you give the permission to perform Tayammum they will perform Tayammum even if water was available if one of them found it cold.\" Abu Musa said, \"What about the statement of `Ammar to `Umar?\" `Abdullah replied, \"`Umar was not satisfied by his statement.\"",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "404",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى النبي صلى الله عليه وسلم الظهر خمسا فقالوا أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت خمسا‏.‏ فثنى رجليه وسجد سجدتين‏.‏",
      "text_en": " Narrated `Abdullah:                     \"Once the Prophet offered five rak`at in Zuhr prayer. He was asked, \"Is there an increase in the prayer?\" The Prophet said, \"And what is it?\" They said, \"You have prayed five rak`at.' So he bent his legs and performed two prostrations (of Sahu).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وقال عاصم بن علي حدثنا عاصم بن محمد، سمعت هذا الحديث، من أبي فلم أحفظه، فقومه لي واقد عن أبيه، قال سمعت أبي وهو، يقول قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو، كيف بك إذا بقيت في حثالة من الناس بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That Allah's Apostle said, \"O `Abdullah bin `Amr! What will be your condition when you will be left with the sediments of (worst) people?\" (They will be in conflict with each other).",
      "chain": [
        "20430",
        "20163",
        "19124",
        "16"
      ]
    },
    {
      "hadith_no": "520",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن إسحاق السرماري، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال بينما رسول الله صلى الله عليه وسلم قائم يصلي عند الكعبة، وجمع قريش في مجالسهم إذ قال قائل منهم ألا تنظرون إلى هذا المرائي أيكم يقوم إلى جزور آل فلان، فيعمد إلى فرثها ودمها وسلاها فيجيء به، ثم يمهله حتى إذا سجد وضعه بين كتفيه فانبعث أشقاهم، فلما سجد رسول الله صلى الله عليه وسلم وضعه بين كتفيه، وثبت النبي صلى الله عليه وسلم ساجدا، فضحكوا حتى مال بعضهم إلى بعض من الضحك، فانطلق منطلق إلى فاطمة  عليها السلام  وهى جويرية، فأقبلت تسعى وثبت النبي صلى الله عليه وسلم ساجدا حتى ألقته عنه، وأقبلت عليهم تسبهم، فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش  ثم سمى  اللهم عليك بعمرو بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأمية بن خلف، وعقبة بن أبي معيط، وعمارة بن الوليد ‏\"‏‏.‏ قال عبد الله فوالله لقد رأيتهم صرعى يوم بدر، ثم سحبوا إلى القليب قليب بدر، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ وأتبع أصحاب القليب لعنة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Maimun [??]:                     `Abdullah bin Mas`ud said, \"While Allah's Apostle was praying beside the Ka`ba, there were some Quraish people sitting in a gathering. One of them said, 'Don't you see this (who does deeds just to show off)? Who amongst you can go and bring the dung, blood and the Abdominal contents (intestines, etc.) of the slaughtered camels of the family of so and so and then wait till he prostrates and put that in between his shoulders?' The most unfortunate amongst them (`Uqba bin Abi Mu'ait) went (and brought them) and when Allah's Apostle prostrated, he put them between his shoulders. The Prophet remained in prostration and they laughed so much so that they fell on each other. A passerby went to Fatima, who was a young girl in those days. She came running and the Prophet was still in prostration. She removed them and cursed upon the Quraish on their faces. When Allah's Apostle completed his prayer, he said, 'O Allah! Take revenge on Quraish.' He said so thrice and added, 'O Allah! take revenge on `Amr bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al-Walid bin `Utba, Umaiya bin Khalaf, `Uqba bin Abi Mu'ait and `Umar a bin Al-Walid.\" `Abdullah added, \"By Allah! I saw all of them dead in the battle field on the day of Badr and they were dragged and thrown in the Qalib (a well) at Badr: Allah's Apostle then said, 'Allah's curse has descended upon the people of the Qalib (well).",
      "chain": [
        "30289",
        "20340",
        "20311",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "526",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد بن زريع، عن سليمان التيمي، عن أبي عثمان النهدي، عن ابن مسعود، أن رجلا، أصاب من امرأة قبلة، فأتى النبي صلى الله عليه وسلم فأخبره، فأنزل الله ‏{‏أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات‏}‏‏.‏ فقال الرجل يا رسول الله ألي هذا قال ‏\"‏ لجميع أمتي كلهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     A man kissed a woman (unlawfully) and then went to the Prophet and informed him. Allah revealed: And offer prayers perfectly At the two ends of the day And in some hours of the night (i.e. the five compulsory prayers). Verily! good deeds remove (annul) the evil deeds (small sins) (11.114). The man asked Allah's Apostle, \"Is it for me?\" He said, \"It is for all my followers.\"",
      "chain": [
        "30367",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "621",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا سليمان التيمي، عن أبي عثمان النهدي، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يمنعن أحدكم  أو أحدا منكم  أذان بلال من سحوره، فإنه يؤذن  أو ينادي  بليل، ليرجع قائمكم ولينبه نائمكم، وليس أن يقول الفجر أو الصبح ‏\"‏‏.‏ وقال بأصابعه ورفعها إلى فوق وطأطأ إلى أسفل حتى يقول هكذا‏.‏ وقال زهير بسبابتيه إحداهما فوق الأخرى ثم مدها عن يمينه وشماله‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"The Adhan pronounced by Bilal should not stop you from taking Suhur, for he pronounces the Adhan at night, so that the one offering the late night prayer (Tahajjud) from among you might hurry up and the sleeping from among you might wake up. It does not mean that dawn or morning has started.\" Then he (the Prophet) pointed with his fingers and raised them up (towards the sky) and then lowered them (towards the earth) like this (Ibn Mas`ud imitated the gesture of the Prophet). Az-Zuhri gestured with his two index fingers which he put on each other and then stretched them to the right and left. These gestures illustrate the way real dawn appears. It spreads left and right horizontally. The dawn that appears in the high sky and lowers down is not the real dawn) .",
      "chain": [
        "30184",
        "20321",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "835",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن الأعمش، حدثني شقيق، عن عبد الله، قال كنا إذا كنا مع النبي صلى الله عليه وسلم في الصلاة قلنا السلام على الله من عباده، السلام على فلان وفلان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تقولوا السلام على الله‏.‏ فإن الله هو السلام، ولكن قولوا التحيات لله، والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين‏.‏ فإنكم إذا قلتم أصاب كل عبد في السماء أو بين السماء والأرض، أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله، ثم يتخير من الدعاء أعجبه إليه فيدعو ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When we prayed with the Prophet we used to say, \"Peace be on Allah from His slaves and peace be on so and so.\" The Prophet said, \"Don't say As-Salam be on Allah, for He Himself is As-Salam, but say, at-tahiyatu li l-lahi wa s-salawatu wa t-taiyibat. As-salamu `alaika aiyuha n-Nabiyu wa rahmatu l-lahi wa barakatuh. As-salamu `alaina wa `ala `ibadi l-lahi s-salihin. (If you say this then it will reach all the slaves in heaven or between heaven and earth). Ash-hadu al la-ilaha illa l-lah, wa ash-hadu anna Muhammadan `Abduhu wa Rasuluh.' Then select the invocation you like best and recite it.\" (See Hadith No. 794, 795 & 796).",
      "chain": [
        "30175",
        "20031",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "852",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن الأسود، قال قال عبد الله لا يجعل أحدكم للشيطان شيئا من صلاته، يرى أن حقا عليه أن لا ينصرف إلا عن يمينه، لقد رأيت النبي صلى الله عليه وسلم كثيرا ينصرف عن يساره‏.‏",
      "text_en": " Narrated `Abdullah:                     You should not give away a part of your prayer to Satan by thinking that it is necessary to depart (after finishing the prayer) from one's right side only; I have seen the Prophet often leave from the left side.",
      "chain": [
        "20296",
        "20020",
        "20160",
        "11378",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي إسحاق، قال سمعت الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم النجم بمكة فسجد فيها، وسجد من معه، غير شيخ أخذ كفا من حصى أو تراب فرفعه إلى جبهته وقال يكفيني هذا‏.‏ فرأيته بعد ذلك قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1070",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم قرأ سورة النجم فسجد بها، فما بقي أحد من القوم إلا سجد، فأخذ رجل من القوم كفا من حصى أو تراب، فرفعه إلى وجهه وقال يكفيني هذا، فلقد رأيته بعد قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Surat-an-Najm (53) and prostrated while reciting it and all the people prostrated and a man amongst the people took a handful of stones or earth and raised it to his face and said, \"This is sufficient for me. Later on I saw him killed as a non-believer.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأعمش، عن أبي وائل، عن عبد الله  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم ليلة، فلم يزل قائما حتى هممت بأمر سوء‏.‏ قلنا وما هممت قال هممت أن أقعد وأذر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu-Wail:                     `Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet and he kept on standing till an ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and leave the Prophet (standing).\"",
      "chain": [
        "20193",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1144",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال ذكر عند النبي صلى الله عليه وسلم رجل فقيل ما زال نائما حتى أصبح ما قام إلى الصلاة‏.‏ فقال ‏\"‏ بال الشيطان في أذنه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     A person was mentioned before the Prophet (p.b.u.h) and he was told that he had kept on sleeping till morning and had not got up for the prayer. The Prophet said, \"Satan urinated in his ears.\"",
      "chain": [
        "30175",
        "20327",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نمير، حدثنا ابن فضيل، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال كنا نسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد علينا، فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to greet the Prophet while he was praying and he used to answer our greetings. When we returned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the prayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30212",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نمير، حدثنا إسحاق بن منصور، حدثنا هريم بن سفيان، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated `Abdullah:                     The same as No. 290. from the Prophet.",
      "chain": [
        "30212",
        "30313",
        "20362",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1202",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عمرو بن عيسى، حدثنا أبو عبد الصمد عبد العزيز بن عبد الصمد، حدثنا حصين بن عبد الرحمن، عن أبي وائل، عن عبد الله بن مسعود  رضى الله عنه  قال كنا نقول التحية في الصلاة ونسمي، ويسلم بعضنا على بعض، فسمعه رسول الله صلى الله عليه وسلم فقال ‏\"‏ قولوا التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله، فإنكم إذا فعلتم ذلك فقد سلمتم على كل عبد لله صالح في السماء والأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     We used to say the greeting, name and greet each other in the prayer. Allah's Apostle heard it and said:--\"Say, 'at-tahiyyatu lil-lahi was-salawatu wat-taiyibatu . Assalamu 'Alaika aiyuha-n-Nabiyu warahmatu- l-lahi wa-barakatuhu. _ Assalamu alaina wa-'ala 'ibadi-l-lahi as-salihin.. Ashhadu an la ilaha illa-l-lah wa ashhadu anna Muhammadan `Abdu hu wa Rasuluh. (All the compliments are for Allah and all the prayers and all the good things (are for Allah). Peace be on you, O Prophet, and Allah's mercy and blessings (are on you). And peace be on us and on the good (pious) worshipers of Allah. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and Apostle.) So, when you have said this, then you have surely sent the greetings to every good (pious) worshipper of Allah, whether he be in the Heaven or on the Earth . \"",
      "chain": [
        "30155",
        "20251",
        "15097",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا ابن فضيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد على، فلما رجعنا سلمت عليه فلم يرد على وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I used to greet the Prophet while he was in prayer and he would return my greeting, but when we returned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the greeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30201",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  أن رسول الله صلى الله عليه وسلم صلى الظهر خمسا فقيل له أزيد في الصلاة فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال صليت خمسا‏.‏ فسجد سجدتين بعد ما سلم‏.‏",
      "text_en": " Narrated' `Abdullah:                     Once Allah's Apostle offered five rak`at in the Zuhr prayer, and somebody asked him whether there was some increase in the prayer. Allah's Apostle said, \"What is that?\" He said, \"You have offered five rak`at.\" So Allah's Apostle performed two prostrations of Sahu after Taslim.",
      "chain": [
        "20296",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات يشرك بالله شيئا دخل النار ‏\"‏‏.‏ وقلت أنا من مات لا يشرك بالله شيئا دخل الجنة‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"Anyone who dies worshipping others along with Allah will definitely enter the Fire.\" I said, \"Anyone who dies worshipping none along with Allah will definitely enter Paradise.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1294",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، حدثنا زبيد اليامي، عن إبراهيم، عن مسروق، عن عبد الله  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس منا من لطم الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     the Prophet said, \"He who slaps his cheeks, tears his clothes and follows the ways and traditions of the Days of Ignorance is not one of us.\"",
      "chain": [
        "20348",
        "20012",
        "11335",
        "11051",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1297",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"He who slaps the cheeks, tears the clothes and follows the tradition of the Days of Ignorance is not from us.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1298",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"He who slaps the cheeks, tears the clothes and follows the traditions of the Days of Ignorance is not from us.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1429",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن ابن مسعود  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق، ورجل آتاه الله حكمة فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     I heard the Prophet saying, \"There is no envy except in two: a person whom Allah has given wealth and he spends it in the right way, and a person whom Allah has given wisdom (i.e. religious knowledge) and he gives his decisions accordingly and teaches it to the others.\"",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "hadith_no": "1683",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قبيصة بن عقبة، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم ركعتين، ومع أبي بكر  رضى الله عنه  ركعتين ومع عمر  رضى الله عنه  ركعتين، ثم تفرقت بكم الطرق، فيا ليت حظي من أربع ركعتان متقبلتان‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     I offered (only a) two rak`at prayer with the Prophet (at Mina), and similarly with Abu Bakr and with `Umar, and then you d offered in opinions. Wish that I would be lucky enough to have two of the four rak`at accepted (by Allah).",
      "chain": [
        "20351",
        "20012",
        "11060",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن، عن عبد الله  رضى الله عنه  قال ما رأيت النبي صلى الله عليه وسلم صلى صلاة بغير ميقاتها إلا صلاتين جمع بين المغرب والعشاء، وصلى الفجر قبل ميقاتها‏.‏",
      "text_en": " Narrated `Abdullah:                     I never saw the Prophet offering any prayer not at its stated time except two; he prayed the Maghrib and the `Isha' together and he offered the morning prayer before its usual time.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال رمى عبد الله من بطن الوادي، فقلت يا أبا عبد الرحمن، إن ناسا يرمونها من فوقها، فقال والذي لا إله غيره هذا مقام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏ وقال عبد الله بن الوليد حدثنا سفيان حدثنا الأعمش بهذا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     `Abdullah, did the Rami from the middle of the valley. So, I said, \"O, Abu `Abdur-Rahman! Some people do the Rami (of the Jamra) from above it (i.e. from the top of the valley).\" He said, \"By Him except whom none has the right to be worshipped, this is the place from where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Apostle) did the Rami.\"",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله  رضى الله عنه  أنه انتهى إلى الجمرة الكبرى جعل البيت عن يساره، ومنى عن يمينه، ورمى بسبع، وقال هكذا رمى الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     When `Abdullah, reached the big Jamra (i.e. Jamrat-ul-Aqaba) he kept the Ka`ba on the left side and Mina on his right side and threw seven pebbles (at the Jamra) and said, \"The one on whom Surat-al- Baqara was revealed (i.e. the Prophet) had done the Rami similarly.\"",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1842",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا أبو بدر، شجاع بن الوليد عن عمر بن محمد العمري، قال وحدث نافع، أن عبد الله، وسالما، كلما عبد الله بن عمر  رضى الله عنهما  فقال خرجنا مع النبي صلى الله عليه وسلم معتمرين، فحال كفار قريش دون البيت، فنحر رسول الله صلى الله عليه وسلم بدنه، وحلق رأسه‏.‏",
      "text_en": " Narrated Nafi`:                     That `Abdullah and Salim said to `Abdullah bin `Umar, \"(You should not go for Hajj this year).\" `Abdullah bin `Umar replied, \"We set out with the Prophet (to Mecca for performing `Umra) and e infidels of Quraish prevented us from reaching the Ka`ba. Allah's Apostle slaughtered his Budn (camels for sacrifice) and got his head shaved.\"",
      "chain": [
        "30272",
        "20328",
        "11530",
        "16"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن الأسود، عن عبد الله  رضى الله عنه  قال بينما نحن مع النبي صلى الله عليه وسلم في غار بمنى، إذ نزل عليه ‏{‏والمرسلات‏}‏ وإنه ليتلوها، وإني لأتلقاها من فيه، وإن فاه لرطب بها، إذ وثبت علينا حية فقال النبي صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏‏.‏ فابتدرناها، فذهبت، فقال النبي صلى الله عليه وسلم ‏\"‏ وقيت شركم كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were in the company of the Prophet in a cave at Mina, when Surat-wal-Mursalat were revealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. Suddenly a snake sprang at us and the Prophet said (ordered us): \"Kill it.\" We ran to kill it but it escaped quickly. The Prophet said, \"It has escaped your evil and you too have escaped its evil.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو عثمان، عن عبد الله بن مسعود  رضى الله عنه  قال من اشترى شاة محفلة، فردها فليرد معها صاعا‏.‏ ونهى النبي صلى الله عليه وسلم أن تلقى البيوع‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Whoever buys a sheep which has not been milked for a long time, has the option of returning it along with one Sa of dates; and the Prophet forbade going to meet the seller on the way (as he has no knowledge of the market price and he may sell his goods at a low price).",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، قال حدثني التيمي، عن أبي عثمان، عن عبد الله  رضى الله عنه  قال من اشترى محفلة فليرد معها صاعا‏.‏ قال ونهى النبي صلى الله عليه وسلم عن تلقي البيوع‏.‏",
      "text_en": " Narrated `Abdullah:                     Whoever buys an animal which has been kept unmilked for a long time, could return it, but has to pay a Sa of dates along with it. And the Prophet forbade meeting the owners of goods on the way away from the market.",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2356",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن شقيق، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين يقتطع بها مال امرئ، هو عليها فاجر، لقي الله وهو عليه غضبان‏\"‏ فأنزل الله تعالى ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ الآية‏.‏ فجاء الأشعث فقال ما حدثكم أبو عبد الرحمن، في أنزلت هذه الآية، كانت لي بئر في أرض ابن عم لي فقال لي ‏\"‏ شهودك ‏\"‏‏.‏ قلت ما لي شهود‏.‏ قال ‏\"‏ فيمينه ‏\"‏‏.‏ قلت يا رسول الله إذا يحلف‏.‏ فذكر النبي صلى الله عليه وسلم هذا الحديث، فأنزل الله ذلك تصديقا له‏.‏",
      "text_en": " Narrated `Abdullah (bin Mas`ud):                     The Prophet said, \"Whoever takes a false oath to deprive somebody of his property will meet Allah while He will be angry with him.\" Allah revealed: 'Verily those who purchase a little gain at the cost of Allah's covenant, and their oaths.' ........(3.77) Al-Ashath came (to the place where `Abdullah was narrating) and said, \"What has Abu `Abdur- Rahman (i.e. `Abdullah) been telling you? This verse was revealed concerning me. I had a well in the land of a cousin of mine. The Prophet asked me to bring witnesses (to confirm my claim). I said, 'I don't have witnesses.' He said, 'Let the defendant take an oath then.' I said, 'O Allah's Apostle! He will take a (false) oath immediately.' Then the Prophet mentioned the above narration and Allah revealed the verse to confirm what he had said.\" (See Hadith No. 692)",
      "chain": [
        "30349",
        "20458",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2416",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد، أخبرنا أبو معاوية، عن الأعمش، عن شقيق، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين وهو فيها فاجر ليقتطع بها مال امرئ مسلم لقي الله وهو عليه غضبان ‏\"‏‏.‏ قال فقال الأشعث في والله كان ذلك، كان بيني وبين رجل من اليهود أرض فجحدني، فقدمته إلى النبي صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألك بينة ‏\"‏‏.‏ قلت لا‏.‏ قال فقال لليهودي ‏\"‏ احلف ‏\"‏‏.‏ قال قلت يا رسول الله إذا يحلف، ويذهب بمالي، فأنزل الله تعالى ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Allah's Apostle said, \"Whoever takes a false oath so as to take the property of a Muslim (illegally) will meet Allah while He will be angry with him.\" Al-Ash'ath said: By Allah, that saying concerned me. I had common land with a Jew, and the Jew later on denied my ownership, so I took him to the Prophet who asked me whether I had a proof of my ownership. When I replied in the negative, the Prophet asked the Jew to take an oath. I said, \"O Allah's Apostle! He will take an oath and deprive me of my property.\" So, Allah revealed the following verse: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths.\" (3.77)",
      "chain": [
        "30213",
        "20354",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة، وحول الكعبة ثلاثمائة وستون نصبا فجعل يطعنها بعود في يده وجعل يقول ‏{‏جاء الحق وزهق الباطل‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet entered Mecca and (at that time) there were three hundred-and-sixty idols around the Ka`ba. He started stabbing the idols with a stick he had in his hand and reciting: \"Truth (Islam) has come and Falsehood (disbelief) has vanished.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله  رضى الله عنه من حلف على يمين، يستحق بها مالا وهو فيها فاجر، لقي الله وهو عليه غضبان، فأنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ فقرأ إلى ‏{‏عذاب أليم‏}‏‏.‏ثم إن الأشعث بن قيس خرج إلينا فقال ما يحدثكم أبو عبد الرحمن قال فحدثناه قال فقال صدق لفي والله أنزلت، كانت بيني وبين رجل خصومة في بئر فاختصمنا إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ شاهدك أو يمينه ‏\"‏‏.‏ قلت إنه إذا يحلف ولا يبالي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين يستحق بها مالا هو فيها فاجر، لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك، ثم اقترأ هذه الآية ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى ‏{‏ولهم عذاب أليم‏}‏‏.‏",
      "text_en": "  Narrated Abu Wail:                       Abdullah (bin Mas'ud) said, \"Whoever took a false oath in order to grab somebody's property will meet Allah while Allah will be angry with him.\" Allah revealed the following verse to confirm that:--\"Verily! Those who purchase a small gain at the cost of Allah's covenant And their oaths...a painful torment.\" (3.77)   Al-Ash'ath bin Qais came to us and asked as to what Abu Abdur-Rehman (i.e. Ibn Mas'ud) was telling you.\" We related the story to him. On that he said, \"He has told the truth. This verse was revealed about me. I had some dispute with another man regarding a well and we took the case before Allah's Apostle. Allah's Apostle said (to me), \"Produce two witnesses (to support your claim); otherwise the defendant has the right to take an oath (to refute your claim).' I said, 'The defendant would not mind to take a false oath.\" Allah's Apostle then said, 'Whoever took a false oath in order to grab someone else's property will meet Allah, Allah will be angry with him.' Allah then revealed what Confirmed it.\" Al-Ash'ath then recited the following Verse:--\"Verily! Those who purchase a small gain at the cost of Allah's covenant, And their oaths . . . (to) . . . they shall have a painful torment!' (3.77) (See Hadith No. 546)",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2652",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خير الناس قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء أقوام تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكانوا يضربوننا على الشهادة والعهد‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"The people of my generation are the best, then those who follow them, and then whose who follow the latter. After that there will come some people whose witness will go ahead of their oaths, and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"We used to be beaten for taking oaths by saying, 'I bear witness by the Name of Allah or by the Covenant of Allah.\"",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "2666",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد، أخبرنا أبو معاوية، عن الأعمش، عن شقيق، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين وهو فيها فاجر، ليقتطع بها مال امرئ مسلم، لقي الله وهو عليه غضبان ‏\"‏‏.‏   قال فقال الأشعث بن قيس في والله كان ذلك، كان بيني وبين رجل من اليهود أرض فجحدني، فقدمته إلى النبي صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألك بينة ‏\"‏‏.‏ قال قلت لا‏.‏ قال فقال لليهودي ‏\"‏ احلف ‏\"‏‏.‏ قال قلت يا رسول الله إذا يحلف ويذهب بمالي‏.‏ قال فأنزل الله تعالى ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"If somebody takes a false oath in order to get the property of a Muslim (unjustly) by that oath, then Allah will be angry with him when he will meet Him.\" Al-Ash'ath informed me, \"By Allah! This was said regarding me. There was a dispute about a piece of land between me and a man from the Jews who denied my right. I took him to the Prophet. Allah's Apostle asked me, 'Do you have an evidence?' I replied in the negative. He said to the Jew, 'Take an oath.' I said, 'O Allah's Apostle! He will surely take an oath and take my property unjustly.\" So, Allah revealed: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . \" (3.77)",
      "chain": [
        "30213",
        "20354",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2673",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، عن الأعمش، عن أبي وائل، عن ابن مسعود  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين ليقتطع بها مالا لقي الله وهو عليه غضبان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     The Prophet said, \"Whoever takes a (false) oath in order to grab (others) property, then Allah will be angry with him when he will meet Him.\"",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2676",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا بشر بن خالد، حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي وائل، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين كاذبا ليقتطع مال رجل  أو قال أخيه  لقي الله وهو عليه غضبان ‏\"‏‏.‏ وأنزل الله تصديق ذلك في القرآن ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ الآية‏.‏   فلقيني الأشعث فقال ما حدثكم عبد الله اليوم، قلت كذا وكذا‏.‏ قال في أنزلت‏.‏",
      "text_en": " Narrated Abu Wail from `Abdullah:                     The Prophet said, \"Whoever takes a false oath in order to grab another man's (or his brother's) property, then Allah will be angry with him when he will meet him.\" Then Allah confirmed this by revealing the Divine Verse: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and their oaths . . . Will get painful punishment.\" (3.77) Al-Ash'ath met me and asked, \"What did `Abdullah tell you today?\" I said, \"So and so.\" He said, \"The Verse was revealed regarding my case.\"",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2782",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحسن بن صباح، حدثنا محمد بن سابق، حدثنا مالك بن مغول، قال سمعت الوليد بن العيزار، ذكر عن أبي عمرو الشيباني، قال قال عبد الله بن مسعود  رضى الله عنه  سألت رسول الله صلى الله عليه وسلم قلت يا رسول الله أى العمل أفضل قال ‏\"‏ الصلاة على ميقاتها ‏\"‏‏.‏ قلت ثم أى‏.‏ قال ‏\"‏ ثم بر الوالدين ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ الجهاد في سبيل الله ‏\"‏‏.‏ فسكت عن رسول الله صلى الله عليه وسلم ولو استزدته لزادني‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     I asked Allah's Apostle, \"O Allah's Apostle! What is the best deed?\" He replied, \"To offer the prayers at their early stated fixed times.\" I asked, \"What is next in goodness?\" He replied, \"To be good and dutiful to your parents.\" I further asked, what is next in goodness?\" He replied, \"To participate in Jihad in Allah's Cause.\" I did not ask Allah's Apostle anymore and if I had asked him more, he would have told me more.",
      "chain": [
        "30244",
        "30209",
        "20358",
        "11663",
        "11343",
        "16"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا جعفر بن عون، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يصلي في ظل الكعبة، فقال أبو جهل وناس من قريش، ونحرت جزور بناحية مكة، فأرسلوا فجاءوا من سلاها، وطرحوه عليه، فجاءت فاطمة فألقته عنه، فقال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش ‏\"‏‏.‏ لأبي جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأبى بن خلف، وعقبة بن أبي معيط‏.‏ قال عبد الله فلقد رأيتهم في قليب بدر قتلى‏.‏ قال أبو إسحاق ونسيت السابع‏.‏ وقال يوسف بن إسحاق عن أبي إسحاق أمية بن خلف‏.‏ وقال شعبة أمية أو أبى‏.‏ والصحيح أمية‏.‏",
      "text_en": " Narrated `Abdullah:                     Once the Prophet was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet Then Fatima (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).",
      "chain": [
        "30201",
        "20416",
        "20012",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2964",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله  رضى الله عنه  لقد أتاني اليوم رجل فسألني عن أمر ما دريت ما أرد عليه، فقال أرأيت رجلا مؤديا نشيطا، يخرج مع أمرائنا في المغازي، فيعزم علينا في أشياء لا نحصيها‏.‏ فقلت له والله ما أدري ما أقول لك إلا أنا كنا مع النبي صلى الله عليه وسلم فعسى أن لا يعزم علينا في أمر إلا مرة حتى نفعله، وإن أحدكم لن يزال بخير ما اتقى الله، وإذا شك في نفسه شىء سأل رجلا فشفاه منه، وأوشك أن لا تجدوه، والذي لا إله إلا هو ما أذكر ما غبر من الدنيا إلا كالثغب شرب صفوه وبقي كدره‏.‏",
      "text_en": " Narrated `Abdullah:                     Today a man came to me and asked me a question which I did not know how to answer. He said, \"Tell me, if a wealthy active man, well-equipped with arms, goes out on military expeditions with our chiefs, and orders us to do such things as we cannot do (should we obey him?)\" I replied, \"By Allah, I do not know what to reply you, except that we, were in the company of the Prophet and he used to order us to do a thing once only till we finished it. And no doubt, everyone among you will remain in a good state as long as he obeys Allah. If one is in doubt as to the legality of something, he should ask somebody who would satisfy him, but soon will come a time when you will not find such a man. By Him, except Whom none has the right to be worshipped. I see that the example of what has passed of this life (to what remains thereof) is like a pond whose fresh water has been used up and nothing remains but muddy water.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3150",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال لما كان يوم حنين آثر النبي صلى الله عليه وسلم أناسا في القسمة، فأعطى الأقرع بن حابس مائة من الإبل، وأعطى عيينة مثل ذلك، وأعطى أناسا من أشراف العرب، فآثرهم يومئذ في القسمة‏.‏ قال رجل والله إن هذه القسمة ما عدل فيها، وما أريد بها وجه الله‏.‏ فقلت والله لأخبرن النبي صلى الله عليه وسلم‏.‏ فأتيته فأخبرته فقال ‏\"‏ فمن يعدل إذا لم يعدل الله ورسوله رحم الله موسى قد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     On the day (of the battle) of Hunain, Allah's Apostle favored some people in the distribution of the booty (to the exclusion of others); he gave Al-Aqra' bin H`Abis one-hundred camels and he gave 'Uyaina the same amount, and also gave to some of the eminent Arabs, giving them preference in this regard. Then a person came and said, \"By Allah, in this distribution justice has not been observed, nor has Allah's Pleasure been aimed at.\" I said (to him), \"By Allah, I will inform the Prophet (of what you have said), \"I went and informed him, and he said, \"If Allah and His Apostle did not act justly, who else would act justly. May Allah be merciful to Moses, for he was harmed with more than this, yet he kept patient.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    }
  ],
  "total_hadiths": 779
}