{
  "id": "16029",
  "name": "Dwyd bin Naf' al-Amwy دويد بن نافع الأموي مولاهم",
  "full_name": "Dwyd bin Naf' al-Amwy دويد بن نافع الأموي مولاهم",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "B.Umayya",
      "Client",
      "al-Shami",
      "Egypt"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا بقية، حدثنا ضبارة بن عبد الله بن أبي السليك، عن دويد بن نافع، حدثنا أبو صالح السمان، قال قال أبو هريرة إن رسول الله صلى الله عليه وسلم كان يدعو يقول ‏\"‏ اللهم إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to supplicate by saying: \"O Allah, I seek refuge in Thee from divisiveness, hypocrisy, and evil character.\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثني ضبارة بن أبي السليل، قال حدثني دويد بن نافع، قال أخبرني ابن شهاب، قال حدثني عطاء بن يزيد، عن أبي أيوب، أن النبي صلى الله عليه وسلم قال ‏\"‏ الوتر حق فمن شاء أوتر بسبع ومن شاء أوتر بخمس ومن شاء أوتر بثلاث ومن شاء أوتر بواحدة ‏\"‏ ‏.‏",
      "text_en": " Duwaid bin Nafi' said:                     \" Ibn Shihab informed me, saying: 'Ata bin Yazid narrated to me from Abu Ayyub:That the Prophet (ﷺ) said: 'Witr is a duty, and whoever wants to pray witr with seven (rak'ahs), let him do so; whoever wants to pray witr with five, let him do so, whoever wants to pray witr with three, let him do so; and whoever wants to pray witr with one, let him do so.'\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "11013",
        "11206",
        "33"
      ]
    },
    {
      "hadith_no": "5471",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا ضبارة، عن دويد بن نافع، قال قال أبو صالح قال أبو هريرة إن رسول الله صلى الله عليه وسلم كان يدعو ‏\"‏ اللهم إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] used to say in his supplication: 'Allahumma inni a'udhu bika minash-shiqaqi wan-nifaqi, wa suw'il-akhlaq (O Allah, I seek refuge with You from opposing the truth, hypocrisy and bad manners.)'\"",
      "chain": [
        "10581",
        "20644",
        "16029",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "1467",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا بقية بن الوليد، حدثنا ضبارة بن عبد الله بن أبي السليل، أخبرني دويد بن نافع، عن الزهري، قال قال سعيد بن المسيب إن أبا قتادة بن ربعي أخبره أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ قال الله عز وجل افترضت على أمتك خمس صلوات وعهدت عندي عهدا أنه من حافظ عليهن لوقتهن أدخلته الجنة ومن لم يحافظ عليهن فلا عهد له عندي ‏\"‏ ‏.‏",
      "text_en": " Sa’eedbin Musayyab said that Abu Qatadah bin Rib’i told him that theMessenger of Allah (ﷺ) said:                      “Allah said: ‘I have enjoined onyournation five prayers, and I have made a covenant with Myself thatwhoever maintains them, I will admit them to Paradise, and whoeverdoes not maintain them, has no such covenant with Me.’”",
      "chain": [
        "38705",
        "20644",
        "16029",
        "11013",
        "11002"
      ]
    }
  ],
  "total_hadiths": 4
}