{
  "id": "16032",
  "name": "Ziyad bin Rabi'a bin Na'eem زياد بن ربيعة بن نعيم",
  "full_name": "Ziyad bin Rabi'a bin Na'eem زياد بن ربيعة بن نعيم",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "95",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Hadrami",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5042",
      "name": "Ziyad bin al-Harith al-Sda'iy Bdm ( زياد بن الحارث الصدائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28326",
      "name": "'Abdur Rahman bin Ziyad عبد الرحمن بن زياد بن أنعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10849",
      "name": "Bakr bin Swad'h bin Thmamh بكر بن سوادة بن ثمامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10853",
      "name": "al-Harith bin Yazid al-Hdrmy الحارث بن يزيد الحضرمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "16117",
      "name": "Yazid bin 'Amr al-Ma'afry يزيد بن عمرو المعافري المصري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-514",
      "hadith_no": "514",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد الله بن عمر بن غانم، عن عبد الرحمن بن زياد، - يعني الإفريقي - أنه سمع زياد بن نعيم الحضرمي، أنه سمع زياد بن الحارث الصدائي، قال لما كان أول أذان الصبح أمرني - يعني النبي صلى الله عليه وسلم - فأذنت فجعلت أقول أقيم يا رسول الله فجعل ينظر إلى ناحية المشرق إلى الفجر فيقول ‏\"‏ لا ‏\"‏ ‏.‏ حتى إذا طلع الفجر نزل فبرز ثم انصرف إلى وقد تلاحق أصحابه - يعني فتوضأ - فأراد بلال أن يقيم فقال له نبي الله صلى الله عليه وسلم ‏\"‏ إن أخا صداء هو أذن ومن أذن فهو يقيم ‏\"‏ ‏.‏ قال فأقمت ‏.‏",
      "text_en": " Narrated Ziyad ibn al-Harith as-Suda'i:                     When the adhan for the dawn prayer was initially introduced, the Prophet (ﷺ) commanded me to call the adhan and I did so. Then I began to ask: Should I utter iqamah, Messenger of Allah? But he began to look at the direction of the east, (waiting) for the break of dawn, and said: No. When the dawn broke, he came down and performed ablution and he then turned to me. In the meantime his Companions joined him. Then Bilal wanted to utter the iqamah, but the Prophet (ﷺ) said to him: The man of Suda' has called the adhan, and he who calls the adhan utters the iqamah.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "28296",
        "16032",
        "5042"
      ]
    },
    {
      "id": "sunan-abi-daud-1630",
      "hadith_no": "1630",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد الله، - يعني ابن عمر بن غانم - عن عبد الرحمن بن زياد، أنه سمع زياد بن نعيم الحضرمي، أنه سمع زياد بن الحارث الصدائي، قال أتيت رسول الله صلى الله عليه وسلم فبايعته فذكر حديثا طويلا قال فأتاه رجل فقال أعطني من الصدقة ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ إن الله تعالى لم يرض بحكم نبي ولا غيره في الصدقات حتى حكم فيها هو فجزأها ثمانية أجزاء فإن كنت من تلك الأجزاء أعطيتك حقك ‏\"‏ ‏.‏",
      "text_en": " Narrated Ziyad ibn al-Harith as-Suda'i:                     I came to the Messenger of Allah (ﷺ) and swore allegiance to him, and after telling a long story he said: Then a man came to him and said: Give me some of the sadaqah (alms). The Messenger of Allah (ﷺ) said: Allah is not pleased with a Prophet's or anyone else's decision about sadaqat till He has given a decision about them Himself. He has divided those entitled to them into eight categories, so if you come within those categories, I shall give you what you desire.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "28296",
        "28326",
        "16032",
        "5042"
      ]
    },
    {
      "id": "jami-al-tirmidhi-199",
      "hadith_no": "199",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة، ويعلى بن عبيد، عن عبد الرحمن بن زياد بن أنعم الإفريقي، عن زياد بن نعيم الحضرمي، عن زياد بن الحارث الصدائي، قال أمرني رسول الله صلى الله عليه وسلم أن أؤذن في صلاة الفجر فأذنت فأراد بلال أن يقيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أخا صداء قد أذن ومن أذن فهو يقيم ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى وحديث زياد إنما نعرفه من حديث الإفريقي والإفريقي هو ضعيف عند أهل الحديث ضعفه يحيى بن سعيد القطان وغيره قال أحمد لا أكتب حديث الإفريقي ‏.‏ قال ورأيت محمد بن إسماعيل يقوي أمره ويقول هو مقارب الحديث ‏.‏ والعمل على هذا عند أكثر أهل العلم أن من أذن فهو يقيم ‏.‏",
      "text_en": " Ziyad bin Al-Harith As-Suda'i narrated:                     \"Allah's Messenger ordered me to call the Adhan for the Fajr prayer. I called the Adhan, then Bilal wanted to call the lqamah. Allah's Messenger said: 'Indeed the brother from Suda' has called the Adhan, and whoever calls the Adhan he calls the Iqamah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "20372",
        "28326",
        "16032",
        "5042"
      ]
    },
    {
      "id": "sunan-ibn-majah-717",
      "hadith_no": "717",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يعلى بن عبيد، حدثنا الإفريقي، عن زياد بن نعيم، عن زياد بن الحارث الصدائي، قال كنت مع رسول الله  صلى الله عليه وسلم  في سفر فأمرني فأذنت فأراد بلال أن يقيم فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أخا صداء قد أذن ومن أذن فهو يقيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ziyad bin Harith As-Suda'i said:                     \"I was with the Messenger of Allah on a journey, and he commanded me to call the Adhan. Bilal wanted to call the Iqamah, but the Messenger of Allah said: 'The brother of Suda' called the Adhan, and the one who calls the Adhan is the one who calls the Iqamah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20372",
        "16032",
        "5042"
      ]
    }
  ],
  "total_hadiths": 4
}