{
  "id": "16050",
  "name": "Shyym bin Bytan al-Qtbany al-Blwy شييم بن بيتان",
  "full_name": "Shyym bin Bytan al-Qtbany al-Blwy شييم بن بيتان",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3205",
      "name": "Junadah bin Abi Umayya ( جنادة بن أبي أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1225",
      "name": "Ruwayfi' bin Thabit al-Ansari ( رويفع بن ثابت الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10858",
      "name": "Sufyan bin Han'i, Abu Salam al-Jayshani سفيان بن هانئ أبو سالم الجيشاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "16049",
      "name": "Shyban bin Umayya شيبان بن أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "10871",
      "name": "'Ayyash bin 'Abbas al-Qanabi عياش بن عباس القتباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10857",
      "name": "Khayr bin Na'eem خير بن نعيم",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "36",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا المفضل، - يعني ابن فضالة المصري - عن عياش بن عباس القتباني، أن شييم بن بيتان، أخبره عن شيبان القتباني، قال إن مسلمة بن مخلد استعمل رويفع بن ثابت، على أسفل الأرض ‏.‏ قال شيبان فسرنا معه من كوم شريك إلى علقماء أو من علقماء إلى كوم شريك - يريد علقام - فقال رويفع إن كان أحدنا في زمن رسول الله صلى الله عليه وسلم ليأخذ نضو أخيه على أن له النصف مما يغنم ولنا النصف وإن كان أحدنا ليطير له النصل والريش وللآخر القدح ‏.‏ ثم قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا رويفع لعل الحياة ستطول بك بعدي فأخبر الناس أنه من عقد لحيته أو تقلد وترا أو استنجى برجيع دابة أو عظم فإن محمدا صلى الله عليه وسلم منه بريء ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit:                     Shayban al-Qatbani reported that Maslamah ibn Mukhallad made Ruwayfi' ibn Thabit the governor of the lower parts (of Egypt). He added: We travelled with him from Kum Sharik to Alqamah or from Alqamah to Kum Sharik (the narrator doubts) for Alqam. Ruwayfi' said: Any one of us would borrow a camel during the lifetime of the Prophet (ﷺ) from the other, on condition that he would give him half the booty, and the other half he would retain himself. Further, one of us received an arrowhead and a feather, and the other an arrow-shaft as a share from the booty. He then reported: The Messenger of Allah (ﷺ) said: You may live for a long time after I am gone, Ruwayfi', so, tell people that if anyone ties his beard or wears round his neck a string to ward off the evil eye, or cleanses himself with animal dung or bone, Muhammad has nothing to do with him.",
      "chain": [
        "38715",
        "20378",
        "10871",
        "16050",
        "1455"
      ]
    },
    {
      "hadith_no": "37",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد، حدثنا مفضل، عن عياش، أن شييم بن بيتان، أخبره بهذا الحديث، أيضا عن أبي سالم الجيشاني، عن عبد الله بن عمرو، يذكر ذلك وهو معه مرابط بحصن باب أليون ‏.‏ قال أبو داود حصن أليون على جبل بالفسطاط ‏.‏ قال أبو داود وهو شيبان بن أمية يكنى أبا حذيفة ‏.‏",
      "text_en": " This tradition has also been narrated by Abu Salim al-Jaishani on the authority of 'Abd Allaah b. 'Amr. He narrated this tradition at the time when he besieged the fort  at the gate of Alyun.Abu Dawud said:                      The fort of Alyun lies at the mountain in Fustat. Abu Dawud said: The kunyah (surname) of Shaiban b. Umayyah is Abu Hudhaifah.",
      "chain": [
        "38715",
        "20378",
        "30157",
        "16050",
        "10858"
      ]
    },
    {
      "hadith_no": "4408",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني حيوة بن شريح، عن عياش بن عباس القتباني، عن شييم بن بيتان، ويزيد بن صبح الأصبحي، عن جنادة بن أبي أمية، قال كنا مع بسر بن أرطاة في البحر فأتي بسارق يقال له مصدر قد سرق بختية فقال قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏ ولولا ذلك لقطعته ‏.‏",
      "text_en": " Narrated Busr ibn Artat:                     Junadah ibn AbuUmayyah said: We were with Busr ibn Artat on the sea (on an expedition). A thief called Misdar who had stolen a bukhti she-camel was brought. He said: I heard the Messenger of Allah (ﷺ) say: Hands are not to be cut off during a warlike expedition. Had it not been so, I would have cut it off.",
      "chain": [
        "30226",
        "20029",
        "26010",
        "10871",
        "16050",
        "16115",
        "3205"
      ]
    },
    {
      "hadith_no": "1450",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عياش بن عباس المصري، عن شييم بن بيتان، عن جنادة بن أبي أمية، عن بسر بن أرطاة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في الغزو ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روى غير ابن لهيعة بهذا الإسناد نحو هذا ‏.‏ ويقال بسر بن أبي أرطاة أيضا ‏.‏ والعمل على هذا عند بعض أهل العلم منهم الأوزاعي لا يرون أن يقام الحد في الغزو بحضرة العدو مخافة أن يلحق من يقام عليه الحد بالعدو فإذا خرج الإمام من أرض الحرب ورجع إلى دار الإسلام أقام الحد على من أصابه ‏.‏ كذلك قال الأوزاعي ‏.‏",
      "text_en": " Narrated Busr Bin Artah:                     That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"",
      "chain": [
        "30367",
        "20624",
        "10871",
        "16050",
        "3205"
      ]
    },
    {
      "hadith_no": "5067",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن حيوة بن شريح، وذكر، آخر قبله عن عياش بن عباس القتباني، أن شييم بن بيتان، حدثه أنه، سمع رويفع بن ثابت، يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا رويفع لعل الحياة ستطول بك بعدي فأخبر الناس أنه من عقد لحيته أو تقلد وترا أو استنجى برجيع دابة أو عظم فإن محمدا بريء منه ‏\"‏ ‏.‏",
      "text_en": " Ruwaifi' bin Thabit said:                     \"The Messenger of Allah [SAW] said: 'O Ruwaifi', you may live for a long time after me, so tell the people that whoever ties up his beard, or twists it, or hangs an amulet, or cleans himself (after relieving himself) with animal dung or bones, Muhammad has nothing to do with him.'\"",
      "chain": [
        "20672",
        "20029",
        "26010",
        "10871",
        "16050"
      ]
    }
  ],
  "total_hadiths": 5
}