{
  "id": "16076",
  "name": "'Uqba bin Muslim al-Tajaybi عقبة بن مسلم التجيبي",
  "full_name": "'Uqba bin Muslim al-Tajaybi عقبة بن مسلم التجيبي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "120",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "189",
      "name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4050",
      "name": "'Abdullah bin al-Harith al-Zubaidi ( عبد الله بن الحارث بن جزء الزبيدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16067",
      "name": "'Abdur Rahman bin Mua'wiya عبد الرحمن بن معاوية بن حديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10938",
      "name": "Abu 'Abdur Rahman al-Habli عبد الله بن يزيد أبو عبد الرحمن الحبلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18421",
      "name": "Shfa bin Mat' شفي بن ماتع",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10623",
      "name": "al-Walid bin Abi al-Walid الوليد بن أبي الوليد عثمان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11407",
      "name": "Ja'far bin Rabi'ya bin Shrhbyl جعفر بن ربيعة بن شرحبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20622",
      "name": "Hrmlh bin 'Imran bin Qrad حرملة بن عمران بن قراد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10925",
      "name": "'Amir bin Yahya bin Habib عامر بن يحيى بن حبيب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1522",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة بن شريح، قال سمعت عقبة بن مسلم، يقول حدثني أبو عبد الرحمن الحبلي، عن الصنابحي، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم أخذ بيده وقال ‏\"‏ يا معاذ والله إني لأحبك والله إني لأحبك ‏\"‏ ‏.‏ فقال ‏\"‏ أوصيك يا معاذ لا تدعن في دبر كل صلاة تقول اللهم أعني على ذكرك وشكرك وحسن عبادتك ‏\"‏ ‏.‏ وأوصى بذلك معاذ الصنابحي وأوصى به الصنابحي أبا عبد الرحمن ‏.‏",
      "text_en": " Mu'adh b. Jabal reported that the Messenger of Allah (ﷺ) caught his hand and said:                      By Allah, I love you, Mu'adh. I give some instruction to you. Never leave to recite this supplication after every (prescribed) prayer: \"O Allah, help me in remembering You, in giving You thanks, and worshipping You well.\"Mu'adh willed this supplication to the narrator al-Sunabihi and al-Sunabihi to 'Abu Abd al-Rahman.",
      "chain": [
        "30024",
        "23033",
        "26010",
        "16076",
        "10938",
        "5144",
        "32"
      ]
    },
    {
      "hadith_no": "2382",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا حيوة بن شريح، أخبرني الوليد بن أبي الوليد أبو عثمان المدني، أن عقبة بن مسلم، حدثه أن شفيا الأصبحي حدثه أنه، دخل المدينة فإذا هو برجل قد اجتمع عليه الناس فقال من هذا فقالوا أبو هريرة ‏.‏ فدنوت منه حتى قعدت بين يديه وهو يحدث الناس فلما سكت وخلا قلت له أنشدك بحق وبحق لما حدثتني حديثا سمعته من رسول الله صلى الله عليه وسلم عقلته وعلمته ‏.‏ فقال أبو هريرة أفعل لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم عقلته وعلمته ‏.‏ ثم نشغ أبو هريرة نشغة فمكث قليلا ثم أفاق فقال لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم في هذا البيت ما معنا أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة أخرى ثم أفاق فمسح وجهه فقال لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم وأنا وهو في هذا البيت ما معنا أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة أخرى ثم أفاق ومسح وجهه فقال أفعل لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم وأنا معه في هذا البيت ما معه أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة شديدة ثم مال خارا على وجهه فأسندته على طويلا ثم أفاق فقال حدثني رسول الله صلى الله عليه وسلم أن الله تبارك وتعالى إذا كان يوم القيامة ينزل إلى العباد ليقضي بينهم وكل أمة جاثية فأول من يدعو به رجل جمع القرآن ورجل قتل في سبيل الله ورجل كثير المال فيقول الله للقارئ ألم أعلمك ما أنزلت على رسولي قال بلى يا رب ‏.‏ قال فماذا عملت فيما علمت قال كنت أقوم به آناء الليل وآناء النهار ‏.‏ فيقول الله له كذبت وتقول له الملائكة كذبت ويقول الله له بل أردت أن يقال إن فلانا قارئ فقد قيل ذاك ‏.‏ ويؤتى بصاحب المال فيقول الله له ألم أوسع عليك حتى لم أدعك تحتاج إلى أحد قال بلى يا رب ‏.‏ قال فماذا عملت فيما آتيتك قال كنت أصل الرحم وأتصدق ‏.‏ فيقول الله له كذبت وتقول له الملائكة كذبت ويقول الله تعالى بل أردت أن يقال فلان جواد فقد قيل ذاك ‏.‏ ويؤتى بالذي قتل في سبيل الله فيقول الله له في ماذا قتلت فيقول أمرت بالجهاد في سبيلك فقاتلت حتى قتلت ‏.‏ فيقول الله تعالى له كذبت وتقول له الملائكة كذبت ويقول الله بل أردت أن يقال فلان جريء فقد قيل ذاك ‏\"‏ ‏.‏ ثم ضرب رسول الله صلى الله عليه وسلم على ركبتي فقال ‏\"‏ يا أبا هريرة أولئك الثلاثة أول خلق الله تسعر بهم النار يوم القيامة ‏\"‏ ‏.‏ وقال الوليد أبو عثمان فأخبرني عقبة بن مسلم أن شفيا هو الذي دخل على معاوية فأخبره بهذا ‏.‏ قال أبو عثمان وحدثني العلاء بن أبي حكيم أنه كان سيافا لمعاوية فدخل عليه رجل فأخبره بهذا عن أبي هريرة فقال معاوية قد فعل بهؤلاء هذا فكيف بمن بقي من الناس ثم بكى معاوية بكاء شديدا حتى ظننا أنه هالك وقلنا قد جاءنا هذا الرجل بشر ثم أفاق معاوية ومسح عن وجهه وقال صدق الله ورسوله ‏:‏ ‏(‏من كان يريد الحياة الدنيا وزينتها نوف إليهم أعمالهم فيها وهم فيها لا يبخسون * أولئك الذين ليس لهم في الآخرة إلا النار وحبط ما صنعوا فيها وباطل ما كانوا يعملون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Al-Walid bin Abi Al-Wald abu 'Utthman Al-Mada'ini narrated that 'Uqbah bin Muslim narrated to him, that shufaiy Al-Asbahi narrated that he entered Al-Madinah and saw a man around whom the people had gathered. He asked:                     \" Who is this?\" They said: \"Abu Hurairah.\"  (He said):So I got close to him until I was sitting in front of him as he was narrating to the people. When he was silent and alone, I said to him: \" I ask youabsolute truth if you would narrate to me a Hadith which you heard from the Messenger of Allah (s.a.w), That you understand and know.\"So Abu Hurairah said: \"You want me to narrate a Hadith to you which the Messenger of Allah (s.a.w) narrated to me that I understand and know.\" Then Abu Hurairah began sobbing profusely. We sat for a while, then he recovered and said: \"I shall narrate to you a Hadith which the Messenger of Allah (s.a.w) narrated in this House, while there was no one with us other than he and I.\" Then, again, Abu Hurairah began sobbing severely. Then he recovered, and wiped his face, and said: \"you want me to narrate to you a Hadith which the Messenger of Allah (s.a.w) narrated while he and I were sitting in this House, and no one was with us but he and I.\" Then Abu Hurairah began sobbing severely. Then he bent, falling on his face, so I supported him for a long time. Then he recovered and said: \"The Messenger of Allah narrated to me that on the Day of Judgement, Allah, Most High, will descend to His slaves t judge between them. Every nation shall be kneeling. The first of those who will be called before him will be a man who memorized the Qur'an, and a man who was killed in Allah's cause, and a wealthy man. Allah will say to the reciter: 'Did I not teach you what I revealed to My Messenger?\" He says: 'Of course O Lord!' He says: 'Then what did you do with what you learned?' He said: 'I would stand (in prayer reciting) with it during all hours of the night and all hours of the day.' Then Allah would say to him: 'You have lied.' And the angels will say: 'You have lied.'Allah will say to him: 'Rather, you wanted it to be said that so-and-so is a reciter. And that was said.' The person with the wealth will be brought, and Allah will say to him: 'Was I not so generous with you, such that I did not leave you having any need from anyone?' He will say: 'Of course O Lord!' He says: 'Then what did you do with what I gave to you?' He says: 'I would nurture the ties of kinship and give charity.' Then Allah will say to him: 'You have lied.' And the angels will say to him: 'You have lied.' Allah, Most High, will say: 'Rather, you wanted it to be said that so-and-so is so generous, and that was said.' Then the one who was killed in Allah's cause shall be brought, and Allah will say to him : 'For what were you killed?' So he says: 'I was commanded to fight in Your cause ,so I fought until I was killed.' Allah [Most High] will say to him: 'You have lied.' And the angels will say to him: 'You have lied.' Allah [Most High] will say: 'Rather, you wanted it be said that so-and-so is brave, and that was said.' \"Then the Messenger of Allah (s.a.w)hit me on my knees and said: 'O Abu Hurairah! These first three are the creatures of Allah with whom the fire will be enflamed on the Day of Judgement.'\"Al-Walid Abu 'Uthman Al-Mada'ini said: \"So 'Uqbah bin Muslim informed me that Shaufaiy, is the one who entered upon Mu'awiyah to inform him about this.\" Abu Uthman said: 'This has been done with these people, then how about with those who remain among the people?\" Then Mu'awiyah begin weeping so intensely, that we thought that he will kill himself with excessive weeping. We said: \"This man came to us to cause evil.\" Then Mu'awiyah recovered, wiped off his face and said: \"Allah and His Messenger told the truth: Whosoever desires the life of the world and its glitter, then we shall pay in full (the wages of) their deeds therein, and they shall have no diminution therein. They are those for whom there is nothing in the Hereafter Fire, and vain are the deeds they did therein. And of no effect is that which they used to do.\"",
      "chain": [
        "38265",
        "20025",
        "26010",
        "16076"
      ]
    },
    {
      "hadith_no": "1303",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال سمعت حيوة، يحدث عن عقبة بن مسلم، عن أبي عبد الرحمن الحبلي، عن الصنابحي، عن معاذ بن جبل، قال أخذ بيدي رسول الله صلى الله عليه وسلم فقال ‏\"‏ إني لأحبك يا معاذ ‏\"‏ ‏.‏ فقلت وأنا أحبك يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تدع أن تقول في كل صلاة رب أعني على ذكرك وشكرك وحسن عبادتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'adhbin Jabal said:                     \"The Messenger of Allah (ﷺ) took my hand and said: 'I love you, O Mu'adh!' I said: 'And I love you, O Messenger of Allah (ﷺ).' Then the Messenger of Allah (ﷺ) said: 'Never forget to say in every prayer: Rabbi a'inni 'ala dhikrika wa shukrika wa husni 'ibadatik (My Lord, help me to remember You, give thanks to You and worship You well.)\"",
      "chain": [
        "30493",
        "20029",
        "26010",
        "16076",
        "10938",
        "5144",
        "32"
      ]
    }
  ],
  "total_hadiths": 3
}