{
  "id": "16081",
  "name": "'Imran bin Abd عمران بن عبد",
  "full_name": "'Imran bin Abd عمران بن عبد",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Ma'fari",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28326",
      "name": "'Abdur Rahman bin Ziyad عبد الرحمن بن زياد بن أنعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "593",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، حدثنا عبد الله بن عمر بن غانم، عن عبد الرحمن بن زياد، عن عمران بن عبد المعافري، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ ثلاثة لا يقبل الله منهم صلاة من تقدم قوما وهم له كارهون ورجل أتى الصلاة دبارا ‏\"‏ ‏.‏ والدبار أن يأتيها بعد أن تفوته ‏\"‏ ورجل اعتبد محرره ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: There are three types of people whose prayer is not accepted by Allah: One who goes in front of people when they do not like him; a man who comes dibaran, which means that he comes to it too late; and a man who takes into slavery an emancipated male or female slave.",
      "chain": [
        "20164",
        "28296",
        "28326",
        "16081",
        "29"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو كريب، حدثنا رشدين بن سعد، وعبد الرحمن المحاربي، وأبو أسامة وجعفر بن عون عن ابن أنعم، قال أبو كريب وحدثنا وكيع، عن سفيان، عن ابن أنعم، عن عمران بن عبد المعافري، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الدين يقضى من صاحبه يوم القيامة إذا مات إلا من يدين في ثلاث خلال الرجل تضعف قوته في سبيل الله فيستدين يتقوى به لعدو الله وعدوه ورجل يموت عنده مسلم لا يجد ما يكفنه ويواريه إلا بدين ورجل خاف الله على نفسه العزبة فينكح خشية على دينه فإن الله يقضي عن هؤلاء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                     “A debt will be settled on the Day of Resurrection if the one who owes it dies, apart from three: A man who lost his strength fighting in the cause of Allah (SWT), so he borrows in order to become strong again to fighting in the cause of Allah (SWT), so he borrows in order to become strong again to fight the enemy of Allah (SWT) and his enemy. A man who sees a Muslims die and he cannot find anything with which to shroud him except by taking a loan. A man who sees a Muslim die and he cannot find anything with which to shroud him except, by taking a loan. A man who fears Allah (SWT) if he stays single, so he gets married for fear of (losing) his religious commitment. Allah will pay off the debt for these people on the Day of Resurrection.”",
      "chain": [
        "30216",
        "26012",
        "20333",
        "30216",
        "20032",
        "20012",
        "16081",
        "29"
      ]
    }
  ],
  "total_hadiths": 2
}