{
  "id": "16083",
  "name": "'Isa bin Hilal عيسى بن هلال",
  "full_name": "'Isa bin Hilal عيسى بن هلال",
  "grade": "Follower(Tabi')",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1399",
      "hadith_no": "1399",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى البلخي، وهارون بن عبد الله، قالا أخبرنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال أقرئني يا رسول الله ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من ذوات الراء ‏\"‏ ‏.‏ فقال كبرت سني واشتد قلبي وغلظ لساني ‏.‏ قال ‏\"‏ فاقرأ ثلاثا من ذوات حم ‏\"‏ ‏.‏ فقال مثل مقالته ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من المسبحات ‏\"‏ ‏.‏ فقال مثل مقالته فقال الرجل يا رسول الله أقرئني سورة جامعة ‏.‏ فأقرأه النبي صلى الله عليه وسلم ‏{‏ إذا زلزلت الأرض ‏}‏ حتى فرغ منها ‏.‏ فقال الرجل والذي بعثك بالحق لا أزيد عليها أبدا ثم أدبر الرجل فقال النبي صلى الله عليه وسلم ‏\"‏ أفلح الرويجل ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     A man came to the Messenger of Allah (ﷺ) and said: Teach me to read the Qur'an, Messenger of Allah.  He said: Read three surahs which begin with A.L.R.  He said: My age is advanced, my mind has become dull (i.e. memory has grown weak), and my tongue has grown heavy). So he said: Then read three surahs which begin with H.M. He repeated the same words.  So he said: Read three surahs which begin with the \"Glorification of Allah\". But he repeated the same excuse.  The man then said: Teach me a comprehensive surah, Messenger of Allah. The Prophet (ﷺ) taught him Surah (99). \"When the Earth is shaken with her earthquake\". When he finished it, the man said: By Him Who sent you with truth, I shall never add anything to it. Then man then went away.  The Prophet (ﷺ) said twice:  The man received salvation.",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30524",
        "23033",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2789",
      "hadith_no": "2789",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد، حدثني سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ قال الرجل أرأيت إن لم أجد إلا أضحية أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وأظفارك وتقص شاربك وتحلق عانتك فتلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: I have been commanded to celebrate festival ('Id) on the day of sacrifice, which Allah, Most High, has appointed for this community. A man said: If I do not find except a she-goat or a she-camel borrowed for milk or other benefits, should I sacrifice it? He said: No, but you should clip your hair , and nails, trim your moustaches, and shave your pubes. This is all your sacrifice in the eyes of Allah, Most High.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "1945",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2791",
      "hadith_no": "2791",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله، أخبرنا سعيد بن يزيد، عن أبي السمح، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاصي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أن رصاصة مثل هذه وأشار إلى مثل الجمجمة أرسلت من السماء إلى الأرض وهي مسيرة خمسمائة سنة لبلغت الأرض قبل الليل ولو أنها أرسلت من رأس السلسلة لصارت أربعين خريفا الليل والنهار قبل أن تبلغ أصلها أو قعرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إسناده حسن صحيح ‏.‏ وسعيد بن يزيد هو مصري وقد روى عنه الليث بن سعد وغير واحد من الأئمة ‏.‏",
      "text_en": " 'Abdullah bin 'Amr bin Al-'As narrated that the Messenger of Allah said:                     \"If a pellet like this one, and he pointed to one like Al-jumjumah were to be dropped from the heavens to the earth",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "16083"
      ]
    },
    {
      "id": "sunan-an-nasai-3140",
      "hadith_no": "3140",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عيسى بن هلال الحمصي، قال حدثنا محمد بن حمير، قال حدثنا معاوية بن سلام، عن عكرمة بن عمار، عن شداد أبي عمار، عن أبي أمامة الباهلي، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال أرأيت رجلا غزا يلتمس الأجر والذكر ما له فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا شىء له ‏\"‏ ‏.‏ فأعادها ثلاث مرات يقول له رسول الله صلى الله عليه وسلم ‏\"‏ لا شىء له ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن الله لا يقبل من العمل إلا ما كان له خالصا وابتغي به وجهه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu 'Umamah Al-Bahili said:                      \"A man came to the Prophet (ﷺ) and said: 'What do you think of a man who fights seeking reward and fame - what will he have?' The Messenger of Allah (ﷺ) said: 'He will not have anything.' He repeated it three times, and the Prophet (ﷺ) said to him: 'He will not have anything.' Then he said: 'Allah does not accept any deed, except that which is purely for Him, and seeking His Face.'\"",
      "usc_msa_ref": "",
      "chain": [
        "16083",
        "20456",
        "20401",
        "10704",
        "4048"
      ]
    },
    {
      "id": "sunan-an-nasai-4365",
      "hadith_no": "4365",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني سعيد بن أبي أيوب، وذكر، آخرين عن عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال لرجل ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ فقال الرجل أرأيت إن لم أجد إلا منيحة أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وتقلم أظفارك وتقص شاربك وتحلق عانتك فذلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin al-As that the Messenger of Allah said to a man:                     \"I have been instructed to take the Day of Sacrifice as an 'Id which Allah, the Might and Sublime, has ordained for this Ummah.\" The man said: \"What do you think if I cannot find anything but a female sheep that has been loaned to me so that I may benefit from its milk - should I sacrifice it?\" He said: \"No. Rather cut something from your hair and your nails, trim your mustache and shave your pubic hairs, and you will have a complete reward with Allah, the Might and Sublime, as if you had offered the sacrifice.\"",
      "usc_msa_ref": "",
      "chain": [
        "30493",
        "20029",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    }
  ],
  "total_hadiths": 5
}