{
  "id": "16090",
  "name": "Klyb bin Dhhl al-Hdrmy كليب بن ذهل الحضرمي المصري",
  "full_name": "Klyb bin Dhhl al-Hdrmy كليب بن ذهل الحضرمي المصري",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  مقبول ]"
    ],
    "tags": [
      "al-Hadrami",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5163",
      "name": "'Ubaid bin Jbr ( عبيد بن جبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2412",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثني عبد الله بن يزيد، ح وحدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى، - المعنى - حدثني سعيد بن أبي أيوب، وزاد، جعفر والليث حدثني يزيد بن أبي حبيب، أن كليب بن ذهل الحضرمي، أخبره عن عبيد، - قال جعفر ابن جبر - قال كنت مع أبي بصرة الغفاري صاحب النبي صلى الله عليه وسلم في سفينة من الفسطاط في رمضان فرفع ثم قرب غداه - قال جعفر في حديثه - فلم يجاوز البيوت حتى دعا بالسفرة قال اقترب ‏.‏ قلت ألست ترى البيوت قال أبو بصرة أترغب عن سنة رسول الله صلى الله عليه وسلم قال جعفر في حديثه فأكل ‏.‏",
      "text_en": " Narrated AbuBusrah al-Ghifari,:                     Ja'far ibn Jubayr said: I accompanied AbuBusrah al-Ghifari, a Companion of the Messenger of Allah (ﷺ), in a boat proceeding from al-Fustat (Cairo) during Ramadan. He was lifted (to the boat), then his meal was brought to him. The narrator Ja'far said in his version: He did not go beyond the houses (of the city) but he called for the dining sheet. He said (to me): Come near. I said: Do you not see the houses? AbuBusrah said: Do you detest the sunnah (practice) of the Messenger of Allah (ﷺ)? The narrator Ja'far said in his version: He then ate (it).",
      "chain": [
        "11201",
        "1945",
        "38132",
        "20375",
        "11411",
        "16090"
      ]
    }
  ],
  "total_hadiths": 1
}