{
  "id": "16128",
  "name": "Abu Marzuq al-Tajaybi أبو مرزوق التجيبي",
  "full_name": "Abu Marzuq al-Tajaybi أبو مرزوق التجيبي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "109",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt",
      " Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Tajaybi",
      "Client",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1935",
      "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19946",
      "name": "al-Mughira bin Abi Burda المغيرة بن أبي بردة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11407",
      "name": "Ja'far bin Rabi'ya bin Shrhbyl جعفر بن ربيعة بن شرحبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "26013",
      "name": "Salm bin Ghylan al-Tjyby al-Msry سالم بن غيلان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2158",
      "hadith_no": "2158",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، حدثني يزيد بن أبي حبيب، عن أبي مرزوق، عن حنش الصنعاني، عن رويفع بن ثابت الأنصاري، قال قام فينا خطيبا قال أما إني لا أقول لكم إلا ما سمعت رسول الله صلى الله عليه وسلم يقول يوم حنين قال ‏\"‏ لا يحل لامرئ يؤمن بالله واليوم الآخر أن يسقي ماءه زرع غيره ‏\"‏ ‏.‏ يعني إتيان الحبالى ‏\"‏ ولا يحل لامرئ يؤمن بالله واليوم الآخر أن يقع على امرأة من السبى حتى يستبرئها ولا يحل لامرئ يؤمن بالله واليوم الآخر أن يبيع مغنما حتى يقسم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit al-Ansari:                     Should I tell you what I heard the Messenger of Allah (ﷺ) say on the day of Hunayn: It is not lawful for a man who believes in Allah and the last day to water what another has sown with his water (meaning intercourse with women who are pregnant); it is not lawful for a man who believes in Allah and the Last Day to have intercourse with a captive woman till she is free from a menstrual course; and it is not lawful for a man who believes in Allah and the Last Day to sell spoil till it is divided.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11411",
        "16128",
        "10905"
      ]
    },
    {
      "id": "sunan-abi-daud-5230",
      "hadith_no": "5230",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن مسعر، عن أبي العنبس، عن أبي العدبس، عن أبي مرزوق، عن أبي غالب، عن أبي أمامة، قال خرج علينا رسول الله صلى الله عليه وسلم متوكئا على عصا فقمنا إليه فقال ‏\"‏ لا تقوموا كما تقوم الأعاجم يعظم بعضها بعضا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Messenger of Allah (ﷺ) came out to us leaning on a stick. We stood up to show respect to him. He said: Do not stand up as foreigners do for showing respect to one another.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20359",
        "16128",
        "405"
      ]
    },
    {
      "id": "sunan-ibn-majah-1745",
      "hadith_no": "1745",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يعلى، ومحمد، ابنا عبيد الطنافسي قالا حدثنا محمد بن إسحاق، عن يزيد بن أبي حبيب، عن أبي مرزوق، قال سمعت فضالة بن عبيد الأنصاري، يحدث أن النبي  صلى الله عليه وسلم  خرج عليهم في يوم كان يصومه فدعا بإناء فشرب فقلنا يا رسول الله إن هذا يوم كنت تصومه ‏.‏ قال ‏\"‏ أجل ولكني قئت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Masruq said:                      “I heard Fadalah bin ‘UbaidAl-Ansari narrating that the Prophet (ﷺ) came out to them on a daywhenhe was fasting. He called for a vessel and drank. We said: ‘OMessenger of Allah, you were fasting today.’ He said: ‘Yes, but Ivomited.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20372",
        "11107",
        "11411",
        "16128",
        "1935"
      ]
    },
    {
      "id": "sunan-ibn-majah-3836",
      "hadith_no": "3836",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن مسعر، عن أبي مرزوق، عن أبي العدبس، عن أبي أمامة الباهلي، قال خرج علينا رسول الله  صلى الله عليه وسلم  وهو متكئ على عصا فلما رأيناه قمنا فقال ‏\"‏ لا تفعلوا كما يفعل أهل فارس بعظمائها ‏\"‏ ‏.‏ قلنا يا رسول الله لو دعوت الله لنا ‏.‏ قال ‏\"‏ اللهم اغفر لنا وارحمنا وارض عنا وتقبل منا وأدخلنا الجنة ونجنا من النار وأصلح لنا شأننا كله ‏\"‏ ‏.‏ قال فكأنما أحببنا أن يزيدنا فقال ‏\"‏ أوليس قد جمعت لكم الأمر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah Al Bahili said:                     \"The Messenger of Allah (saas) came out to us, leaning on a stick, and when we saw him we stood up. He said: 'Do not do what the Persians do for their leaders.' We said: 'O Messenger of Allah, why don't you pray to Allah for us?' He said: 'Allahummaghfirlana, warhamna, warda 'anna, wa taqabbal minna, wa adkhilnal-jannah, wa najjina minan-nar, wa aslih lana sha'nana kullah. [O Allah, forgive us and have mercy on us, be pleased with us and accept (our good deeds) from us, admit us to Paradise and save us from Hell, and rectify all our affairs].' It was as if we wanted him to say more, but he said: 'Have I not summed everything for you?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20359",
        "16128",
        "4048"
      ]
    }
  ],
  "total_hadiths": 4
}