{
  "id": "16165",
  "name": "Suwayd bin Qays al-Tajibi سويد بن قيس التجيبي",
  "full_name": "Suwayd bin Qays al-Tajibi سويد بن قيس التجيبي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Egypt"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "398",
      "name": "Mu'awiya bin Hadeej ( معاوية بن حديج ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16067",
      "name": "'Abdur Rahman bin Mua'wiya عبد الرحمن بن معاوية بن حديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "366",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عيسى بن حماد المصري، أخبرنا الليث، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، أنه سأل أخته أم حبيبة زوج النبي صلى الله عليه وسلم هل كان رسول الله صلى الله عليه وسلم يصلي في الثوب الذي يجامعها فيه فقالت نعم إذا لم ير فيه أذى ‏.‏",
      "text_en": " Narrated Umm Habibah:                     Mu'awiyah ibn AbuSufyan asked his sister Umm Habibah, the wife of the Prophet (ﷺ): Would the apostle of Allah (ﷺ) pray in the clothe in which he had an intercourse? She said: Yes, when he would not see any impurity in it.",
      "chain": [
        "30412",
        "20023",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "hadith_no": "1023",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، - يعني ابن سعد - عن يزيد بن أبي حبيب، أن سويد بن قيس، أخبره عن معاوية بن حديج، أن رسول الله صلى الله عليه وسلم صلى يوما فسلم وقد بقيت من الصلاة ركعة فأدركه رجل فقال نسيت من الصلاة ركعة فرجع فدخل المسجد وأمر بلالا فأقام الصلاة فصلى للناس ركعة فأخبرت بذلك الناس ‏.‏ فقالوا لي أتعرف الرجل قلت لا إلا أن أراه فمر بي فقلت هذا هو ‏.‏ فقالوا هذا طلحة بن عبيد الله ‏.‏",
      "text_en": " Narrated Mu'awiyah ibn Khudayj:                     One day the Messenger of Allah (ﷺ) prayed and gave the salutation while a rak'ah of the prayer remained to be offered. A man went to him and said: You forgot to offer one rak'ah of prayer. Then he returned and entered the mosque and ordered Bilal (to utter the Iqamah). He uttered the Iqamah for prayer. He then led the people in one rak'ah of prayer. I stated it to the people. They asked me: Do you know who he was? I said: No, but I can recognise him if I see him. Then the man passed by me, I said: It is he. The people said: This is Talhah ibn Ubaydullah.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "16165",
        "398"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا سفيان، عن سماك بن حرب، حدثني سويد بن قيس، قال جلبت أنا ومخرمة العبدي، بزا من هجر فأتينا به مكة فجاءنا رسول الله صلى الله عليه وسلم يمشي فساومنا بسراويل فبعناه وثم رجل يزن بالأجر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ زن وأرجح ‏\"‏ ‏.‏",
      "text_en": " Narrated Suwayd ibn Qays:                     I and Makhrafah al-Abdi imported some garments from Hajar, and brought them to Mecca. The Messenger of Allah (ﷺ) came to us walking, and after he had bargained with us for some trousers, we sold them to him. There was a man who was weighing for payment. The Messenger of Allah (ﷺ) said to him: Weigh out and give overweight.",
      "chain": [
        "30150",
        "20286",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "hadith_no": "1305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، ومحمود بن غيلان، قالا حدثنا وكيع، عن سفيان، عن سماك بن حرب، عن سويد بن قيس، قال جلبت أنا ومخرفة العبدي، بزا من هجر فجاءنا النبي صلى الله عليه وسلم فساومنا بسراويل وعندي وزان يزن بالأجر فقال النبي صلى الله عليه وسلم للوزان ‏\"‏ زن وأرجح ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي هريرة ‏.‏ قال أبو عيسى حديث سويد حديث حسن صحيح ‏.‏ وأهل العلم يستحبون الرجحان في الوزن ‏.‏ وروى شعبة هذا الحديث عن سماك فقال عن أبي صفوان وذكر الحديث ‏.‏",
      "text_en": " Narrated Suwaid bin Qais:                     \"Makhrafah Al-'Abdi and I brought linens from Hajar. The Prophet (ﷺ) came to us in bargain with us with some pants. There was someone with me who weighed (the goods) to determine the value. So the the Prophet (ﷺ) said to the one weighing: 'Weigh and add more.'\"[He said:] There are narrations on this topic from Jabir and Abu Hurairah.[Abu 'Eisa said:] The Hadith of Suwaid is a Hasan Sahih Hadith. The people of knowledge consider it recommended to add more when weighing.Shu'bah reported this Hadith from Simak, so he said: \"From Abu Safwan\" and he mentioned the narration.",
      "chain": [
        "30480",
        "30277",
        "20032",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عيسى بن حماد، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، أنه سأل أم حبيبة زوج النبي صلى الله عليه وسلم هل كان رسول الله صلى الله عليه وسلم يصلي في الثوب الذي كان يجامع فيه قالت نعم إذا لم ير فيه أذى ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Abi Sufyan that he asked Umm Habibah, the wife of the Prophet (ﷺ):                      \"Did the Messenger of Allah (ﷺ) pray in a garment in which he had had intercourse?\" She said: \"Yes, so long as he saw no filth on it.\"",
      "chain": [
        "30412",
        "20023",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "hadith_no": "671",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، أن سويد بن قيس، حدثه عن معاوية بن حديج، أن رسول الله صلى الله عليه وسلم صلى يوما فسلم وقد بقيت من الصلاة ركعة فأدركه رجل فقال نسيت من الصلاة ركعة فدخل المسجد وأمر بلالا فأقام الصلاة فصلى للناس ركعة فأخبرت بذلك الناس فقالوا لي أتعرف الرجل قلت لا إلا أن أراه فمر بي فقلت هذا هو ‏.‏ قالوا هذا طلحة بن عبيد الله ‏.‏",
      "text_en": " It was narrated that Mu'awiyah bin Hudaij that the Meseenger of Allah (ﷺ) prayed one day and said the Taslim when there was still a Rak'ah left of the prayer. A man caught up with him and said:                      'You forgot a Rak'ah of the prayer!' So he came back into the Masjid and told Bilal to call the Iqamah for prayer, then he led the people in praying one Rak'ah. I told the people about that and they said to me: 'Do you know who that man was?' I said: 'No, not unless I see him.'. Then he paased by me and I said: 'This is he.' They said: 'This is Talha bin 'Ubaidullah.'\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "16165",
        "398"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يحيى، قال حدثنا عبد الحميد بن جعفر، قال حدثني يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من فرس عربي إلا يؤذن له عند كل سحر بدعوتين اللهم خولتني من خولتني من بني آدم وجعلتني له فاجعلني أحب أهله وماله إليه أو من أحب ماله وأهله إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said: 'There is no Arabian horse but it is allowed to offer two supplications every Sahar (end of the night): O Allah, You have caused me to be owned by whoever You wanted among the sons of Adam, and you have made me belong to him. Make me the dearest of his family and wealth to him, or among the dearest of his family and wealth to him.'\"",
      "chain": [
        "30153",
        "20031",
        "11875",
        "11411",
        "16165",
        "398",
        "23"
      ]
    },
    {
      "hadith_no": "4592",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا عبد الرحمن، عن سفيان، عن سماك، عن سويد بن قيس، قال جلبت أنا ومخرفة العبدي، بزا من هجر فأتانا رسول الله صلى الله عليه وسلم ونحن بمنى ووزان يزن بالأجر فاشترى منا سراويل فقال للوزان ‏\"‏ زن وأرجح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Suwaid bin Qais said:                     \"Makhrafah Al-Abdi and I brought some cloth from Hajar, and the Messenger of Allah came to us while we were in Mina where there w a man who weighed (goods) in return for payment. He bought some trousers from us, and said to the man who weighed: 'Weigh it, and allow more.\"'",
      "chain": [
        "20184",
        "20033",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "hadith_no": "583",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، أنه سأل أخته أم حبيبة زوج النبي  صلى الله عليه وسلم  هل كان رسول الله  صلى الله عليه وسلم  يصلي في الثوب الذي يجامع فيه قالت نعم إذا لم يكن فيه أذى ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Abu Sufyan that:                     He asked his sister Umm Habibah, the wife of the Prophet: \"Did the Messenger of Allah ever offered prayer in a garment in which he had sexual intercourse?\" She said: \"Yes, if there was nothing noxious on it.\"",
      "chain": [
        "30490",
        "20023",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "hadith_no": "681",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا الخليل بن عمرو، حدثنا ابن سلمة، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن سويد بن قيس، عن معاوية بن حديج، عن معاوية بن أبي سفيان، عن أم حبيبة، زوج النبي  صلى الله عليه وسلم  قال سألتها كيف كنت تصنعين مع رسول الله  صلى الله عليه وسلم  في الحيضة قالت كانت إحدانا في فورها أول ما تحيض تشد عليها إزارا إلى أنصاف فخذيها ثم تضطجع مع رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from Mu'awiyah bin Abu Sufyan that :                     He asked Umm Habibah, the wife of the Prophet: \"What did you used to do with the Messenger of Allah when you were menstruating?\" She said: \"If it was at the beginning of the period when the bleeding is heavy, we would tie the waist-wrapper tightly around our thighs, then lie down with the Messenger of Allah.\"",
      "chain": [
        "36552",
        "11107",
        "11411",
        "16165",
        "398",
        "27"
      ]
    },
    {
      "hadith_no": "2305",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، ومحمد بن إسماعيل، قالوا حدثنا وكيع، حدثنا سفيان، عن سماك بن حرب، عن سويد بن قيس، قال جلبت أنا ومخرفة العبدي، بزا من هجر فجاءنا رسول الله  صلى الله عليه وسلم  فساومنا سراويل وعندنا وزان يزن بالأجر فقال له النبي  صلى الله عليه وسلم  ‏\"‏ يا وزان زن وأرجح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Suwaid bin Qais said:                     \"Makhrafah Al' Abdi and I brought linens from Hajar[1] The Messenger of Allah (ﷺ) came to us to bargain with us with some trousers. There was someone with me who weighed (the goods) in exchange for a wage. So the Prophet (ﷺ) said to the one weighing: 'Weigh and add more.'\"",
      "chain": [
        "30201",
        "38409",
        "34188",
        "20032",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "hadith_no": "3710",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا يحيى، وعبد الرحمن، قالوا حدثنا سفيان، عن سماك بن حرب، عن سويد بن قيس، قال أتانا النبي  صلى الله عليه وسلم  فساومنا سراويل ‏.‏",
      "text_en": " It wasnarrated that Suwaid bin Qais said:                      “The Prophet (ﷺ) came tousand haggled with us over the price of trousers.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "30160",
        "20031",
        "10530",
        "20012",
        "10770",
        "16165"
      ]
    }
  ],
  "total_hadiths": 12
}