{
  "id": "166",
  "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
  "full_name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "al-Ta'if"
    },
    "death": {
      "date_hijri": "50",
      "date_gregorian": "670",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Governor",
      "Commander"
    ],
    "tags": [
      "al-Thaqafi",
      "Ridwan",
      "Scribe"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "850",
      "name": "Zaynab/Maymuna bint Abi Sufyan ( زينب/ميمونة بنت أبي سفيان بن حرب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "443",
      "name": "Zaynab bint Uthman bin Maz'un ( زينب بنت عثمان بن مظعون الجمحية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "11373",
      "name": "'Urwa bin al-Mughira bin Shu'ba عروة بن المغيرة بن شعبة الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10903",
      "name": "Hamza bin al-Mughira bin Shu'ba حمزة بن المغيرة بن شعبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13371",
      "name": "Ya'fur bin al-Mughira bin Shu'ba يعفور بن المغيرة بن شعبة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "15374",
      "name": "'Aqqar bin al-Mughira bin Shu'ba عقار بن المغيرة بن شعبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11373",
      "name": "'Urwa bin al-Mughira bin Shu'ba عروة بن المغيرة بن شعبة الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10903",
      "name": "Hamza bin al-Mughira bin Shu'ba حمزة بن المغيرة بن شعبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15374",
      "name": "'Aqqar bin al-Mughira bin Shu'ba عقار بن المغيرة بن شعبة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11402",
      "name": "Wrad al-Thqfy Abu Sa'id وراد الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3225",
      "name": "Jubayr bin Hayya al-Thaqafi ( جبير بن حية الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "2201",
      "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18813",
      "name": "'Amr bin Wahb al-Thqfy عمرو بن وهب الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5232",
      "name": "Qubaysa bin Zuwayb ( قبيصة بن ذؤيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10798",
      "name": "'Ubaid bin Ndlh عبيد بن نضلة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11620",
      "name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15051",
      "name": "Tmym bin Hdhlm تميم بن حذلم",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10801",
      "name": "'Alqama bin Wa'il bin Hjr علقمة بن وائل بن حجر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11376",
      "name": "'Ali bin Rabi'a bin Nadla al-Walbi علي بن ربيعة بن نضلة الوالبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11660",
      "name": "Hzyl bin Shrhbyl al-Awdy al-Kwfy هزيل بن شرحبيل",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11284",
      "name": "Zararah bin Awfa al-'Amiri al-Harshi زرارة بن أوفى العامري الحرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "182",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني سعد بن إبراهيم، أن نافع بن جبير بن مطعم، أخبره أنه، سمع عروة بن المغيرة بن شعبة، يحدث عن المغيرة بن شعبة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر، وأنه ذهب لحاجة له، وأن مغيرة جعل يصب الماء عليه، وهو يتوضأ، فغسل وجهه ويديه ومسح برأسه ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I was in the company of Allah's Apostle on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
      "chain": [
        "30153",
        "20259",
        "11062",
        "11063",
        "11059",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم في سفر، فأهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين ‏\"‏‏.‏ فمسح عليهما‏.‏",
      "text_en": " Narrated `Urwa bin Al-Mughira:                     My father said, \"Once I was in the company of the Prophet on a journey and I dashed to take off his Khuffs (socks made from thick fabric or leather). He ordered me to leave them as he had put them after performing ablution. So he passed wet hands over them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا أبو أسامة، عن الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال وضأت النبي صلى الله عليه وسلم فمسح على خفيه وصلى‏.‏",
      "text_en": "      Narrated Al-Mughira bin Shu'ba:                          I helped the Prophet in performing ablution and he passed his wet      hands over his Khuffs and prayed.",
      "chain": [
        "30311",
        "20318",
        "11060",
        "20285",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "522",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك عن ابن شهاب، أن عمر بن عبد العزيز، أخر الصلاة يوما، فدخل عليه عروة بن الزبير، فأخبره أن المغيرة بن شعبة أخر الصلاة يوما وهو بالعراق، فدخل عليه أبو مسعود الأنصاري فقال ما هذا يا مغيرة أليس قد علمت أن جبريل نزل فصلى، فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ بهذا أمرت ‏\"‏‏.‏ فقال عمر لعروة اعلم ما تحدث أوإن جبريل هو أقام لرسول الله صلى الله عليه وسلم وقت الصلاة‏.‏ قال عروة كذلك كان بشير بن أبي مسعود يحدث عن أبيه‏.‏ قال عروة ولقد حدثتني عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي العصر، والشمس في حجرتها قبل أن تظهر‏.‏",
      "text_en": " Narrated Ibn Shihab:                     Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair went to him and said, \"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him and said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer (Fajr prayer) and Allah's Apostle prayed too, then he prayed again (Zuhr prayer) and so did Allah's Apostle and again he prayed (`Asr prayers and Allah's Apostle did the same; again he prayed (Maghrib-prayer) and so did Allah's Apostle and again prayed (`Isha prayer) and so did Allah's Apostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" `Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Apostle at the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud narrated like this on the authority of his father.\" `Urwa added, \"Aisha told me that Allah's Apostle used to pray `Asr prayer when the sunshine was still inside her residence (during the early time of `Asr).",
      "chain": [
        "20164",
        "11013",
        "166"
      ]
    },
    {
      "hadith_no": "1043",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا شيبان أبو معاوية، عن زياد بن علاقة، عن المغيرة بن شعبة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم، فقال الناس كسفت الشمس لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتم فصلوا وادعوا الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     \"The sun eclipsed in the lifetime of Allah's Apostle on the day when (his son) Ibrahim died. So the people said that the sun had eclipsed because of the death of Ibrahim. Allah's Apostle said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"",
      "chain": [
        "30351",
        "20390",
        "20240",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1060",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، قال حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول انكسفت الشمس يوم مات إبراهيم، فقال الناس انكسفت لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتموهما فادعوا الله وصلوا حتى ينجلي ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the death of Ibrahim (the son of the Prophet). Allah's Apostle said, \"The sun and the moon are two signs amongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see them, invoke Allah and pray till the eclipse is clear.\"",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1130",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا مسعر، عن زياد، قال سمعت المغيرة  رضى الله عنه  يقول إن كان النبي صلى الله عليه وسلم ليقوم ليصلي حتى ترم قدماه أو ساقاه، فيقال له فيقول ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet used to stand (in the prayer) or pray till both his feet or legs swelled. He was asked why (he offered such an unbearable prayer) and he said, \"should I not be a thankful slave.\"",
      "chain": [
        "20348",
        "20359",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1291",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو نعيم، حدثنا سعيد بن عبيد، عن علي بن ربيعة، عن المغيرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن كذبا على ليس ككذب على أحد، من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏ سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من نيح عليه يعذب بما نيح عليه ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     I heard the Prophet saying, \"Ascribing false things to me is not like ascribing false things to anyone else. Whosoever tells a lie against me intentionally then surely let him occupy his seat in Hell-Fire.\" I heard the Prophet saying, \"The deceased who is wailed over is tortured for that wailing.\"",
      "chain": [
        "20348",
        "11629",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "2385",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد، أخبرنا جرير، عن المغيرة، عن الشعبي، عن جابر بن عبد الله  رضى الله عنهما  قال غزوت مع النبي صلى الله عليه وسلم قال ‏\"‏ كيف ترى بعيرك أتبيعنيه ‏\"‏‏.‏ قلت نعم‏.‏ فبعته إياه، فلما قدم المدينة غدوت إليه بالبعير، فأعطاني ثمنه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While I was in the company of the Prophet in one of his Ghazawat, he asked, \"What is wrong with your camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, I took the camel to him in the morning and he paid me its price.",
      "chain": [
        "30213",
        "20028",
        "166",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2408",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن الشعبي، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ووأد البنات، ومنع وهات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your daughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men (begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, (2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by extravagance).",
      "chain": [
        "4",
        "20028",
        "11067",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "2918",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، عن أبي الضحى، مسلم  هو ابن صبيح  عن مسروق، قال حدثني المغيرة بن شعبة، قال انطلق رسول الله صلى الله عليه وسلم لحاجته ثم أقبل، فلقيته بماء، وعليه جبة شأمية، فمضمض واستنشق وغسل وجهه، فذهب يخرج يديه من كميه فكانا ضيقين، فأخرجهما من تحت، فغسلهما ومسح برأسه وعلى خفيه‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Allah's Apostle went out to answer the call of nature and on his return I brought some water to him. He performed the ablution while he was wearing a Sha'mi cloak. He rinsed his mouth and washed his nose by putting water in it and then blowing it out, and washed his face. Then he tried to take out his hands through his sleeves but they were tight, so he took them out from underneath, washed them and passed wet hands over his head and over his leather socks.",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "2967",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن المغيرة، عن الشعبي، عن جابر بن عبد الله  رضى الله عنهما  قال غزوت مع رسول الله صلى الله عليه وسلم قال فتلاحق بي النبي صلى الله عليه وسلم وأنا على ناضح لنا قد أعيا فلا يكاد يسير فقال لي ‏\"‏ ما لبعيرك ‏\"‏‏.‏ قال قلت عيي‏.‏ قال فتخلف رسول الله صلى الله عليه وسلم فزجره ودعا له، فما زال بين يدى الإبل قدامها يسير‏.‏ فقال لي ‏\"‏ كيف ترى بعيرك ‏\"‏‏.‏ قال قلت بخير قد أصابته بركتك‏.‏ قال ‏\"‏ أفتبيعنيه ‏\"‏‏.‏ قال فاستحييت، ولم يكن لنا ناضح غيره، قال فقلت نعم‏.‏ قال ‏\"‏ فبعنيه ‏\"‏‏.‏ فبعته إياه على أن لي فقار ظهره حتى أبلغ المدينة‏.‏ قال فقلت يا رسول الله إني عروس، فاستأذنته فأذن لي، فتقدمت الناس إلى المدينة حتى أتيت المدينة، فلقيني خالي فسألني عن البعير، فأخبرته بما صنعت فيه فلامني، قال وقد كان رسول الله صلى الله عليه وسلم قال لي حين استأذنته ‏\"‏ هل تزوجت بكرا أم ثيبا ‏\"‏‏.‏ فقلت تزوجت ثيبا‏.‏ فقال ‏\"‏ هلا تزوجت بكرا تلاعبها وتلاعبك ‏\"‏‏.‏ قلت يا رسول الله توفي والدي  أو استشهد  ولي أخوات صغار، فكرهت أن أتزوج مثلهن، فلا تؤدبهن، ولا تقوم عليهن، فتزوجت ثيبا لتقوم عليهن وتؤدبهن‏.‏ قال فلما قدم رسول الله صلى الله عليه وسلم المدينة غدوت عليه بالبعير، فأعطاني ثمنه، ورده على‏.‏ قال المغيرة هذا في قضائنا حسن لا نرى به بأسا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I participated in a Ghazwa along with Allah's Apostle The Prophet met me (on the way) while I was riding a camel of ours used for irrigation and it had got so tired that it could hardly walk. The Prophet asked me, \"What is wrong with the camel?\" I replied, \"It has got tired.\" So. Allah's Apostle came from behind it and rebuked it and prayed for it so it started surpassing the other camels and going ahead of them. Then he asked me, \"How do you find your camel (now)?\" I replied, \"I find it quite well, now as it has received your blessings.\" He said, \"Will you sell it to me?\" I felt shy (to refuse his offer) though it was the only camel for irrigation we had. So, I said, \"Yes.\" He said, \"Sell it to me then.\" I sold it to him on the condition that I should keep on riding it till I reached Medina. Then I said, \"O Allah's Apostle! I am a bridegroom,\" and requested him to allow me to go home. He allowed me, and I set out for Medina before the people till I reached Medina, where I met my uncle, who asked me about the camel and I informed him all about it and he blamed me for that. When I took the permission of Allah's Apostle he asked me whether I had married a virgin or a matron and I replied that I had married a matron. He said, \"Why hadn't you married a virgin who would have played with you, and you would have played with her?\" I replied, \"O Allah's Apostle! My father died (or was martyred) and I have some young sisters, so I felt it not proper that I should marry a young girl like them who would neither teach them manners nor serve them. So, I have married a matron so that she may serve them and teach them manners.\" When Allah's Apostle arrived in Medina, I took the camel to him the next morning and he gave me its price and gave me the camel itself as well.",
      "chain": [
        "30123",
        "20028",
        "166",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "3287",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن المغيرة، عن إبراهيم، عن علقمة، قال قدمت الشأم ‏{‏فقلت من ها هنا‏}‏ قالوا أبو الدرداء قال أفيكم الذي أجاره الله من الشيطان على لسان نبيه صلى الله عليه وسلم حدثنا سليمان بن حرب حدثنا شعبة عن مغيرة وقال الذي أجاره الله على لسان نبيه صلى الله عليه وسلم يعني عمارا‏.‏",
      "text_en": " Narrated Alqama:                     I went to Sham (and asked. \"Who is here?\"), The people said, \"Abu Ad-Darda.\" Abu Darda said, \"Is the person whom Allah has protected against Satan, (as Allah's Apostle said) amongst you\". The subnarrator, Mughira said that the person who was given Allah's Refuge through the tongue of the Prophet was `Ammar (bin Yasir).",
      "chain": [
        "20357",
        "20311",
        "166",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ الناس تبع لقريش في هذا الشأن، مسلمهم تبع لمسلمهم، وكافرهم تبع لكافرهم ‏\"‏‏.‏   \"والناس معادن، خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا، تجدون من خير الناس أشد الناس كراهية لهذا الشأن حتى يقع فيه.\"",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The tribe of Quraish has precedence over the people in this connection (i.e the right of ruling). The Muslims follow the Muslims amongst them, and the infidels follow the infidels amongst them. People are of different natures: The best amongst them in the pre-lslamic period are the best in Islam provided they comprehend the religious knowledge. You will find that the best amongst the people in this respect (i.e. of ruling) is he who hates it (i.e. the idea of ruling) most, till he is given the pledge of allegiance.\"",
      "chain": [
        "30367",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3683",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا يحيى، عن إسماعيل، حدثنا قيس، سمعت المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال ناس من أمتي ظاهرين حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"Some of my followers will remain victorious (and on the right path) till the Last Day comes, and they will still be victorious.\"",
      "chain": [
        "30145",
        "20031",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن المغيرة، عن إبراهيم، عن علقمة،، قال قدمت الشأم فصليت ركعتين، ثم قلت اللهم يسر لي جليسا صالحا، فأتيت قوما فجلست إليهم، فإذا شيخ قد جاء حتى جلس إلى جنبي، قلت من هذا قالوا أبو الدرداء‏.‏ فقلت إني دعوت الله أن ييسر لي جليسا صالحا فيسرك لي، قال ممن أنت قلت من أهل الكوفة‏.‏ قال أوليس عندكم ابن أم عبد صاحب النعلين والوساد والمطهرة وفيكم الذي أجاره الله من الشيطان على لسان نبيه صلى الله عليه وسلم أوليس فيكم صاحب سر النبي صلى الله عليه وسلم الذي لا يعلم أحد غيره ثم قال كيف يقرأ عبد الله ‏{‏والليل إذا يغشى‏}‏، فقرأت عليه ‏{‏والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏‏.‏ قال والله لقد أقرأنيها رسول الله صلى الله عليه وسلم من فيه إلى في‏.‏",
      "text_en": " Narrated 'Alqama:                     I went to Sham and offered a two-rak`at prayer and then said, \"O Allah! Bless me with a good pious companion.\" So I went to some people and sat with them. An old man came and sat by my side. I asked, \"Who is he?\" They replied, \"(He is) Abu-Ad-Darda.' I said (to him), \"I prayed to Allah to bless me with a pious companion and He sent you to me.\" He asked me, \"From where are you?\" I replied, \"From the people of Al-Kufa.\" He said, \"Isn't there amongst you Ibn Um `Abd, the one who used to carry the shoes, the cushion(or pillow) and the water for ablution? Is there amongst you the one whom Allah gave Refuge from Satan through the request of His Prophet. Is there amongst you the one who keeps the secrets of the Prophet which nobody knows except him?\" Abu Darda further asked, \"How does `Abdullah (bin Mas`ud) recite the Sura starting with, 'By the Night as it conceals (the light).\" (92.1) Then I recited before him: 'By the Night as it envelops: And by the Day as it appears in brightness; And by male and female.' (91.1-3) On this Abu Ad-Darda' said, \"By Allah, the Prophet made me recite the Sura in this way while I was listening to him (reciting it).",
      "chain": [
        "20357",
        "20311",
        "166",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "4776",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا سعيد بن أبي مريم، أخبرنا المغيرة، قال حدثني أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنه ليأتي الرجل العظيم السمين يوم القيامة لا يزن عند الله جناح بعوضة وقال اقرءوا ‏{‏فلا نقيم لهم يوم القيامة وزنا‏}‏ ‏\"‏‏.‏ وعن يحيى بن بكير عن المغيرة بن عبد الرحمن عن أبي الزناد مثله‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"On the Day of Resurrection, a huge fat man will come who will not weigh, the weight of the wing of a mosquito in Allah's Sight.\" and then the Prophet added, 'We shall not give them any weight on the Day of Resurrection ' (18.105)",
      "chain": [
        "30561",
        "30232",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4885",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا زياد، أنه سمع المغيرة، يقول قام النبي صلى الله عليه وسلم حتى تورمت قدماه فقيل له غفر الله لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet used to offer night prayers till his feet became swollen. Somebody said, to him,\" \"Allah has forgiven you, your faults of the past and those to follow.\" On that, he said, \"Shouldn't I be a thankful slave of Allah)?\"",
      "chain": [
        "30343",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "5858",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قيس بن حفص، حدثنا عبد الواحد، حدثنا الأعمش، قال حدثني أبو الضحى، قال حدثني مسروق، قال حدثني المغيرة بن شعبة، قال انطلق النبي صلى الله عليه وسلم لحاجته ثم أقبل، فتلقيته بماء، فتوضأ وعليه جبة شأمية، فمضمض واستنشق وغسل وجهه، فذهب يخرج يديه من كميه فكانا ضيقين، فأخرج يديه من تحت الجبة، فغسلهما ومسح برأسه وعلى خفيه‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet went to answer the call of nature, and when he returned, I met him with water and he performed the ablution while he was wearing a Sham, cloak. He rinsed his mouth, put the water in his nose and blew it out, washed his face and tried to take his hands out of his sleeves, but they were too narrow, so he took out his hands from under his chest and washed them and then passed his wet hands over his head and Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30158",
        "20256",
        "11060",
        "11392",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "5859",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا زكرياء، عن عامر، عن عروة بن المغيرة، عن أبيه  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في سفر فقال ‏\"‏ أمعك ماء ‏\"‏‏.‏ قلت نعم‏.‏ فنزل عن راحلته، فمشى حتى توارى عني في سواد الليل، ثم جاء فأفرغت عليه الإداوة، فغسل وجهه ويديه، وعليه جبة من صوف، فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة، فغسل ذراعيه، ثم مسح برأسه، ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما، فإني أدخلتهما طاهرتين، فمسح عليهما ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     One night I was with the Prophet on a journey. He asked (me), \"Have you got water with you?\" I replied, \"Yes\" So he got down from his she-camel and went away till he disappeared in the darkness of the night. Then he came back and I poured water for him from the pot (for the ablution). He washed his face and hands while he was wearing a woollen cloak (the sleeves of which were narrow), so he could not take his arms out of it. So he took them out from underneath the cloak. Then he washed his forearms and passed his wet hands over his head. Then I tried to take off his Khuffs (socks made from thick fabric or leather), but he said, \"Leave them, for I have performed ablution before putting them on.\" And so he passed his wet hands over them.",
      "chain": [
        "20348",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "6041",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن المسيب، عن وراد، عن المغيرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ومنع وهات، ووأد البنات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet said, \"Allah has forbidden you ( 1 ) to be undutiful to your mothers (2) to withhold (what you should give) or (3) demand (what you do not deserve), and (4) to bury your daughters alive. And Allah has disliked that (A) you talk too much about others ( B), ask too many questions (in religion), or (C) waste your property.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "6270",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا زائدة، حدثنا زياد بن علاقة، سمعت المغيرة بن شعبة، قال انكسفت الشمس يوم مات إبراهيم‏.‏ رواه أبو بكرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-Mughira bin Shuba:                     Solar eclipse occurred on the day of Ibrahim's death (the Prophet's son).",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166",
        "3229"
      ]
    },
    {
      "hadith_no": "6549",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مسعر، حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول كان النبي صلى الله عليه وسلم يصلي حتى ترم  أو تنتفخ  قدماه فيقال له، فيقول ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet used to pray so much that his feet used to become edematous or swollen, and when he was asked as to why he prays so much, he would say, \"Shall I not be a thankful slave (to Allah)?\"",
      "chain": [
        "20191",
        "20359",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "6656",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وحدثني عمرو بن علي، حدثنا محمد بن جعفر، حدثنا شعبة، عن المغيرة، قال سمعت أبا وائل، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏أنا فرطكم، على الحوض، وليرفعن رجال منكم ثم ليختلجن دوني فأقول يا رب أصحابي‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك‏\"‏.‏ تابعه عاصم عن أبي وائل‏.‏ وقال حصين عن أبي وائل عن حذيفة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"I am your predecessor at the Lake-Fount.\" `Abdullah added: The Prophet said, \"I am your predecessor at the Lake-Fount, and some of you will be brought in front of me till I will see them and then they will be taken away from me and I will say, 'O Lord, my companions!' It will be said, 'You do not know what they did after you had left.'",
      "chain": [
        "30153",
        "20173",
        "20020",
        "166",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6931",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، حدثنا عبد الملك، عن وراد، كاتب المغيرة عن المغيرة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح‏.‏ فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ أتعجبون من غيرة سعد، لأنا أغير منه، والله أغير مني ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Sa`d bin Ubada said, \"If I found a man with my wife, I would kill him with the sharp side of my sword.\" When the Prophet heard that he said, \"Do you wonder at Sa`d's sense of ghira (self-respect)? Verily, I have more sense of ghira than Sa`d, and Allah has more sense of ghira than I.\"",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "6990",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا هشام، عن أبيه، عن المغيرة بن شعبة، عن عمر  رضى الله عنه  أنه استشارهم في إملاص المرأة فقال المغيرة قضى النبي صلى الله عليه وسلم بالغرة عبد أو أمة‏.‏   فقال ائت من يشهد معك، فشهد محمد بن مسلمة أنه شهد النبي صلى الله عليه وسلم قضى به‏.‏",
      "text_en": "      Narrated Hisham's father from Al-Mughira bin Shu'ba:                          'Umar consulted the companions about the case of a woman's abortion      (caused by somebody else). Al-Mughira said: The Prophet gave the      verdict that a male or female slave should be given (as a Diya). Then      Muhammad bin Maslama testified that he had witnessed the Prophet      giving such a verdict.",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "166",
        "3"
      ]
    },
    {
      "hadith_no": "6994",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا محمد بن سابق، حدثنا زائدة، حدثنا هشام بن عروة، عن أبيه، أنه سمع المغيرة بن شعبة، يحدث عن عمر، أنه استشارهم في إملاص المرأة مثله‏.‏",
      "text_en": " Narrated `Urwa:                     I heard Al-Maghira bin Shu`ba narrating that `Umar had consulted them about the case of abortion (similarly as narrated in No. 42).",
      "chain": [
        "30561",
        "30209",
        "20320",
        "11065",
        "10511",
        "166",
        "3"
      ]
    },
    {
      "hadith_no": "7208",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، حدثنا إسماعيل، حدثني قيس، قال قال لي المغيرة بن شعبة ما سأل أحد النبي صلى الله عليه وسلم عن الدجال ما سألته وإنه قال لي ‏\"‏ ما يضرك منه ‏\"‏‏.‏ قلت لأنهم يقولون إن معه جبل خبز ونهر ماء‏.‏ قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Nobody asked the Prophet as many questions as I asked regarding Ad-Dajjal. The Prophet said to me, \"What worries you about him?\" I said, \"Because the people say that he will have a mountain of bread and a river of water with him (i.e. he will have abundance of food and water)\" The Prophet said, \"Nay, he is too mean to be allowed such a thing by Allah\"' (but it is only to test mankind whether they believe in Allah or in Ad-Dajjal.)",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "7397",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسماعيل، عن قيس، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال طائفة من أمتي ظاهرين حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"A group of my follower swill remain predominant (victorious) till Allah's Order (the Hour) comes upon them while they are still predominant (victorious).",
      "chain": [
        "20340",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "7403",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد، أخبرنا أبو معاوية، حدثنا هشام، عن أبيه، عن المغيرة بن شعبة، قال سأل عمر بن الخطاب عن إملاص المرأة  هي التي يضرب بطنها فتلقي جنينا  فقال أيكم سمع من النبي صلى الله عليه وسلم فيه شيئا فقلت أنا‏.‏ فقال ما هو قلت سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ فيه غرة عبد أو أمة ‏\"‏‏.‏ فقال لا تبرح حتى تجيئني بالمخرج فيما قلت‏.فخرجت فوجدت محمد بن مسلمة فجئت به، فشهد معي أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ فيه غرة عبد أو أمة ‏\"‏‏.‏ تابعه ابن أبي الزناد عن أبيه عن عروة عن المغيرة‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     `Umar bin Al-Khattab asked (the people) about the Imlas of a woman, i.e., a woman who has an abortion because of having been beaten on her `Abdomen, saying, \"Who among you has heard anything about it from the Prophet?\" I said, \"I did.'' He said, \"What is that?\" I said, \"I heard the Prophet saying, \"Its Diya (blood money) is either a male or a female slave.' \" `Umar said, \"Do not leave till you present witness in support of your statement.\" So I went out, and found Muhammad bin Maslama. I brought him, and he bore witness with me that he had heard the Prophet saying, \"Its Diya (blood money) is either a male slave or a female slave.\"",
      "chain": [
        "30213",
        "20354",
        "20295",
        "166",
        "3"
      ]
    },
    {
      "hadith_no": "7505",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن وراد، كاتب المغيرة عن المغيرة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ تعجبون من غيرة سعد، والله لأنا أغير منه، والله أغير مني، ومن أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن، ولا أحد أحب إليه العذر من الله، ومن أجل ذلك بعث المبشرين والمنذرين ولا أحد أحب إليه المدحة من الله ومن أجل ذلك وعد الله الجنة ‏\"‏‏.‏ وقال عبيد الله بن عمرو عن عبد الملك ‏\"‏ لا شخص أغير من الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Sa`d bin 'Ubada said, \"If I saw a man with my wife, I would strike him (behead him) with the blade of my sword.\" This news reached Allah's Apostle who then said, \"You people are astonished at Sa`d's Ghira. By Allah, I have more Ghira than he, and Allah has more Ghira than I, and because of Allah's Ghira, He has made unlawful Shameful deeds and sins (illegal sexual intercourse etc.) done in open and in secret. And there is none who likes that the people should repent to Him and beg His pardon than Allah, and for this reason He sent the warners and the givers of good news. And there is none who likes to be praised more than Allah does, and for this reason, Allah promised to grant Paradise (to the doers of good).\" `Abdul Malik said, \"No person has more Ghira than Allah.\"",
      "chain": [
        "20040",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "7549",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، عن المغيرة بن شعبة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي قوم ظاهرين على الناس، حتى يأتيهم أمر الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I heard the Prophet saying, \"Some people from my followers will continue to be victorious over others till Allah's Order (The Hour) is established.\" (See Hadith No. 414)",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "7624",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير بن حية، عن جبير بن حية، قال المغيرة أخبرنا نبينا، صلى الله عليه وسلم عن رسالة، ربنا ‏\"‏ أنه من قتل منا صار إلى الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     Our Prophet has informed us our Lord's Message that whoever of us is martyred, will go to Paradise.",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "6",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس الأسدي، عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم بمثله ولم يذكر ‏\"‏ إن كذبا على ليس ككذب على أحد ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20345",
        "20605",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "25",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا أبو بكر، - يعني ابن عياش - قال سمعت المغيرة، يقول لم يكن يصدق على علي - رضى الله عنه - في الحديث عنه إلا من أصحاب عبد الله بن مسعود ‏.‏",
      "text_en": "",
      "chain": [
        "30556",
        "20373",
        "166"
      ]
    },
    {
      "hadith_no": "55",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج، قال حدثني أحمد، - وهو ابن يونس - حدثنا زائدة، عن منصور، والمغيرة، عن إبراهيم، أن الحارث، اتهم ‏.‏",
      "text_en": "",
      "chain": [
        "20219",
        "30184",
        "20320",
        "11067",
        "166",
        "20150"
      ]
    },
    {
      "hadith_no": "483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا سفيان بن عيينة، عن مطرف، وابن، أبجر عن الشعبي، قال سمعت المغيرة بن شعبة، رواية إن شاء الله ح",
      "text_en": "",
      "chain": [
        "30465",
        "20005",
        "11395",
        "10792",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، حدثنا مطرف بن طريف، وعبد الملك بن سعيد، سمعا الشعبي، يخبر عن المغيرة بن شعبة، قال سمعته على المنبر، يرفعه إلى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30421",
        "20005",
        "11395",
        "166"
      ]
    },
    {
      "hadith_no": "485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "قال وحدثني بشر بن الحكم، - واللفظ له - حدثنا سفيان بن عيينة، حدثنا مطرف، وابن، أبجر سمعا الشعبي، يقول سمعت المغيرة بن شعبة، يخبر به الناس على المنبر قال سفيان رفعه أحدهما - أراه ابن أبجر - قال ‏\"‏ سأل موسى ربه ما أدنى أهل الجنة منزلة قال هو رجل يجيء بعد ما أدخل أهل الجنة الجنة فيقال له ادخل الجنة ‏.‏ فيقول أى رب كيف وقد نزل الناس منازلهم وأخذوا أخذاتهم فيقال له أترضى أن يكون لك مثل ملك ملك من ملوك الدنيا فيقول رضيت رب ‏.‏ فيقول لك ذلك ومثله ومثله ومثله ومثله ‏.‏ فقال في الخامسة رضيت رب ‏.‏ فيقول هذا لك وعشرة أمثاله ولك ما اشتهت نفسك ولذت عينك ‏.‏ فيقول رضيت رب ‏.‏ قال رب فأعلاهم منزلة قال أولئك الذين أردت غرست كرامتهم بيدي وختمت عليها فلم تر عين ولم تسمع أذن ولم يخطر على قلب بشر ‏\"‏ ‏.‏ قال ومصداقه في كتاب الله عز وجل ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين‏}‏ الآية ‏.‏",
      "text_en": " It is reported on the authority of al-Mughira b. Shu'ba that the Messenger of Allah (may peace be upon him) said:                      Moses asked his Lord: Who amongst the inhabitants of Paradise is the lowest to rank? He (Allah) said: The person who would be admitted into Paradise last of all among those deserving of Paradise who are admitted to it. I would be said to him: Enter Paradise. He would gay: O my Lord! how (should I enter) while the people have settled in their apartments and taken the shares (portions)? It would be said to him: Would you be pleased if there be for you like the kingdom of a king amongst the kings of the world? He would say: I am pleased my Lord. He (Allah) would say: For you is that, and like that, and like that, and like that, and that. He would say at the fifth (point): I am well pleased. My Lord. He (Allah) would say: It is for you and, ten times like it, and for you is what your self desires and your eye enjoys. He would say: I am well pleased, my Lord. He (Moses) said: (Which is) the highest of their (inhabitants of Paradise) ranks? He (Allah) said: They are those whom I choose. I establish their honour with My own hand and then set a seal over it (and they would be blessed with Bounties) which no eye has seen, no ear has heard and no human mind has perceived: and this is sub- stantiated by the Book of Allah, Exalted and Great:\" So no soul knows what delight of the eye is hidden for them; a reward for what they did\" (xxxii. 17).",
      "chain": [
        "30316",
        "20005",
        "11395",
        "10792",
        "11052",
        "166",
        "10792"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا عبيد الله الأشجعي، عن عبد الملك بن أبجر، قال سمعت الشعبي، يقول سمعت المغيرة بن شعبة، يقول على المنبر إن موسى - عليه السلام - سأل الله عز وجل عن أخس أهل الجنة منها حظا ‏.‏ وساق الحديث بنحوه ‏.‏",
      "text_en": " Sha'bi reported he had heard al-Mughira b. Shu'ba say on the pulpit that Moses (peace be upon him) had asked Allah, Exalted and Great, about the reward of the lowest of the inhabitants of Paradise, and the remaining part of hadith is the same (as narrated) above.",
      "chain": [
        "30216",
        "20338",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، عن أشعث، عن الأسود بن هلال، عن المغيرة بن شعبة، قال بينا أنا مع، رسول الله صلى الله عليه وسلم ذات ليلة إذ نزل فقضى حاجته ثم جاء فصببت عليه من إداوة كانت معي فتوضأ ومسح على خفيه ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      I was with the Messenger of Allah (may peace be upon him) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.",
      "chain": [
        "30399",
        "20327",
        "11324",
        "11620",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قال أبو بكر حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال كنت مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ يا مغيرة خذ الإداوة ‏\"‏ ‏.‏ فأخذتها ثم خرجت معه فانطلق رسول الله صلى الله عليه وسلم حتى توارى عني فقضى حاجته ثم جاء وعليه جبة شامية ضيقة الكمين فذهب يخرج يده من كمها فضاقت عليه فأخرج يده من أسفلها فصببت عليه فتوضأ وضوءه للصلاة ثم مسح على خفيه ثم صلى ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      I was in the company of the Messenger of Allah (may peace be upon him) on a journey when he said: Mughira take hold of this jar (of water). I took hold of it and I went out with him. (I stopped but) the Messenger of Allah (may peace be upon him) proceeded on till he was out of my sight. He relieved himself and then came back and he was wearing a tight-sleeved Syrian gown. He tried to get his forearms out. but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I poured water over (his hands) and he performed ablution for prayer, then wiped over his socks and prayed.",
      "chain": [
        "30201",
        "30216",
        "20436",
        "20354",
        "11060",
        "20285",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، جميعا عن عيسى بن يونس، - قال إسحاق أخبرنا عيسى، - حدثنا الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال خرج رسول الله صلى الله عليه وسلم ليقضي حاجته فلما رجع تلقيته بالإداوة فصببت عليه فغسل يديه ثم غسل وجهه ثم ذهب ليغسل ذراعيه فضاقت الجبة فأخرجهما من تحت الجبة فغسلهما ومسح رأسه ومسح على خفيه ثم صلى بنا ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      The Messenger of Allah (may peace be upon him) went out for relieving himself. When he came back I brought for him a jar (of water) and poured water upon his hands and He washed his face. He tried to wash his forearms, but as the (sleeves of the) gown were tight. He, therefore, brought them out from under the gown. He then washed them, wiped his head, and wiped his socks and then prayed.",
      "chain": [
        "30123",
        "30556",
        "20347",
        "30312",
        "20347",
        "11060",
        "20285",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، قال أخبرني عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في مسير فقال لي ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ قلت نعم ‏.‏ فنزل عن راحلته فمشى حتى توارى في سواد الليل ثم جاء فأفرغت عليه من الإداوة فغسل وجهه وعليه جبة من صوف فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة فغسل ذراعيه ومسح برأسه ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما فإني أدخلتهما طاهرتين ‏\"‏ ‏.‏ ومسح عليهما ‏.‏",
      "text_en": " 'Urwa b. Mughira reported his father having said:                      I was one night with the Apostle of Allah (may peace be upon him) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا عمر بن أبي زائدة، عن الشعبي، عن عروة بن المغيرة، عن أبيه، أنه وضأ النبي صلى الله عليه وسلم فتوضأ ومسح على خفيه فقال له فقال ‏\"‏ إني أدخلتهما طاهرتين ‏\"‏ ‏.‏",
      "text_en": " 'Urwah al Mughira reported it from his father:                      He (Mughira) helped the Apostle (may peace be upon him) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.",
      "chain": [
        "30514",
        "30313",
        "11643",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن عبد الله بن بزيع، حدثنا يزيد، - يعني ابن زريع - حدثنا حميد الطويل، حدثنا بكر بن عبد الله المزني، عن عروة بن المغيرة بن شعبة، عن أبيه، قال تخلف رسول الله صلى الله عليه وسلم وتخلفت معه فلما قضى حاجته قال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ فأتيته بمطهرة فغسل كفيه ووجهه ثم ذهب يحسر عن ذراعيه فضاق كم الجبة فأخرج يده من تحت الجبة وألقى الجبة على منكبيه وغسل ذراعيه ومسح بناصيته وعلى العمامة وعلى خفيه ثم ركب وركبت فانتهينا إلى القوم وقد قاموا في الصلاة يصلي بهم عبد الرحمن بن عوف وقد ركع بهم ركعة فلما أحس بالنبي صلى الله عليه وسلم ذهب يتأخر فأومأ إليه فصلى بهم فلما سلم قام النبي صلى الله عليه وسلم وقمت فركعنا الركعة التي سبقتنا ‏.‏",
      "text_en": " 'Urwa b. al Mughira b. Shu'ba reported it on the authority of his father that he said:                      The Messenger of Allah (may peace be upon him) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin b. 'Anf leading them and had completed a rak'a. When he perceived the presence of the Apostle of Allah (may peace be upon him) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle (may peace be upon him) got up and I also got up with him, and we offered the rak'a which had been finished before we came.",
      "chain": [
        "30448",
        "20304",
        "11279",
        "11267",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن بشار، ومحمد بن حاتم، جميعا عن يحيى القطان، قال ابن حاتم حدثنا يحيى بن سعيد، عن التيمي، عن بكر بن عبد الله، عن الحسن، عن ابن المغيرة بن شعبة، عن أبيه، قال بكر وقد سمعت من ابن المغيرة، أن النبي صلى الله عليه وسلم توضأ فمسح بناصيته وعلى العمامة وعلى الخفين ‏.‏",
      "text_en": " Bakr reported that he had heard from the son of Mughira that verily the Apostle of Allah (may peace be upon him) performed ablution and wiped over his forehead and wiped over his turban and over his socks.",
      "chain": [
        "30160",
        "38487",
        "20031",
        "11289",
        "11267",
        "11016",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قال أحدكم آمين ‏.‏ والملائكة في السماء آمين ‏.‏ فوافقت إحداهما الأخرى غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Abu Harare reported:                      The Messenger of Allah (may peace be upon him) said: When anyone amongst you utters Amin and the angels In the heaven also utter Amin and (the Amin) of the one synchronises with (that of) the other, all his previous sins are pardoned.",
      "chain": [
        "20164",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، وحسن بن علي الحلواني، جميعا عن عبد الرزاق، قال ابن رافع حدثنا عبد الرزاق، أخبرنا ابن جريج، حدثني ابن شهاب، عن حديث، عباد بن زياد أن عروة بن المغيرة بن شعبة، أخبره أن المغيرة بن شعبة أخبره أنه، غزا مع رسول الله صلى الله عليه وسلم تبوك - قال المغيرة - فتبرز رسول الله صلى الله عليه وسلم قبل الغائط فحملت معه إداوة قبل صلاة الفجر فلما رجع رسول الله صلى الله عليه وسلم إلى أخذت أهريق على يديه من الإداوة وغسل يديه ثلاث مرات ثم غسل وجهه ثم ذهب يخرج جبته عن ذراعيه فضاق كما جبته فأدخل يديه في الجبة حتى أخرج ذراعيه من أسفل الجبة ‏.‏ وغسل ذراعيه إلى المرفقين ثم توضأ على خفيه ثم أقبل - قال المغيرة - فأقبلت معه حتى نجد الناس قد قدموا عبد الرحمن بن عوف فصلى لهم فأدرك رسول الله صلى الله عليه وسلم إحدى الركعتين فصلى مع الناس الركعة الآخرة فلما سلم عبد الرحمن بن عوف قام رسول الله صلى الله عليه وسلم يتم صلاته فأفزع ذلك المسلمين فأكثروا التسبيح فلما قضى النبي صلى الله عليه وسلم صلاته أقبل عليهم ثم قال ‏\"‏ أحسنتم ‏\"‏ ‏.‏ أو قال ‏\"‏ قد أصبتم ‏\"‏ ‏.‏ يغبطهم أن صلوا الصلاة لوقتها ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that he participated In the expedition of Tabuk along with the Messenger of Allah (may peace be upon him). The Messenger of Allah (may peace be upon him) went out to answer the call of nature before the morning prayer. and I carried along with him a jar (full of water). When the Messenger of Allah (may peace be upon him) came back to me (after relieving himself). I began to pour water upon his hands out of the jar and he washed his hands three times, then washed his face three times. He then tried to tuck up the sleeves of his cloak upon his forearms but since the sleeves were tight he inserted his hands in the cloak and then brought out his forearms up to the elbow below the cloak, and then wiped over his shoes and then moved on. Mughira said:                      I also moved along with him till he came to the people and (he found) that they had been saying their prayer under the Imamah of 'Abd al-Rahman b. 'Auf. The Messenger of Allah (may peace be upon him) could get one rak ah out of two and said (this) last rak'ah along with the people. When Abd al-Rahman b. 'Auf pronounced the salutation, the Messenger of Allah (may peace be upon him) got up to complete the prayer. This made the Muslims terrified and most of them began to recite the glory of the Lord. When the Apostle of Allah (may peace be upon him) finished his prayer, he turned towards them and then said: You did well, or said with a sense of joy: You did the right thing that you said prayer at the appointed hour.",
      "chain": [
        "30375",
        "20121",
        "20121",
        "11070",
        "11013",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "1367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وأبو كريب وأحمد بن سنان قالوا حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة عن المغيرة، عن النبي صلى الله عليه وسلم ‏.‏ مثله قال أبو بكر وأبو كريب في روايتهما قال فأملاها على المغيرة وكتبت بها إلى معاوية ‏.‏",
      "text_en": " A hadith like this has been narrated by Mughira b. Shu'ba with another chain of transmitters. Abu Bakr and Abu Kuraib narrated in their narration (that Warrad reported):                      Mughira gave me dictation of it and 1 wrote it to Mu'awiya.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11394",
        "166"
      ]
    },
    {
      "hadith_no": "1411",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "أخبرنا يحيى بن يحيى التميمي، قال قرأت على مالك عن ابن شهاب، أن عمر بن عبد العزيز، أخر الصلاة يوما فدخل عليه عروة بن الزبير فأخبره أن المغيرة بن شعبة أخر الصلاة يوما وهو بالكوفة فدخل عليه أبو مسعود الأنصاري فقال ما هذا يا مغيرة أليس قد علمت أن جبريل نزل فصلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ بهذا أمرت ‏\"‏ ‏.‏ فقال عمر لعروة انظر ما تحدث يا عروة أوإن جبريل عليه السلام هو أقام لرسول الله صلى الله عليه وسلم وقت الصلاة فقال عروة كذلك كان بشير بن أبي مسعود يحدث عن أبيه ‏.‏  قال عروة ولقد حدثتني عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يصلي العصر والشمس في حجرتها قبل أن تظهر ‏.‏",
      "text_en": " Ibn Shihab reported:                      Umar b. 'Abd al-'Aziz one day deferred the prayer. 'Urwa b. Zubair came to him and informed him that one day as Mughira b. Shu'ba was in Kufa (as its governor), he deferred the prayer, Abu Mas'ud al-Ansari came to him and said: What is this, O Mughira? Did you know that it was Gabriel who came and said prayer and (then) the Messenger of Allah (may peace be upon him) said the prayer (along with him), then (Gabriel) prayed and the Messenger of Allah (may peace be upon him) also prayed, then (Gabriel) prayed and the Messenger of Allah (may peace be upon him) also prayed, then (Gabriel) prayed and the Messenger of Allah (may peace be upon him) prayed (along with him). then Gabriel prayed and the Messenger of Allah (may peace be upon him) also prayed (along with him) and then said: This is how I have been ordered to do. 'Umar (b. 'Abd al-'Aziz) said. O 'Urwa be mindful of what you are saying that Gabriel (peace be upon him) taught the Messenger of Allah (may peace be upon him) the times of prayer. Upon this 'Urwa said: This is how Bashir b. Abu Mas'ud narrated on the authority of his father and (also said): 'A'isha?, the wife of the Apostle (may peace be upon him). narrated it to me that the Messenger of Allah (may peace be upon him) used to say the afternoon prayer, when the light of the sun was there in her apartment before it went out (of it).",
      "chain": [
        "30399",
        "11013",
        "166"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا مصعب، - وهو ابن المقدام - حدثنا زائدة، حدثنا زياد بن علاقة، - وفي رواية أبي بكر قال قال زياد بن علاقة - سمعت المغيرة بن شعبة، يقول انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا ينكسفان لموت أحد ولا لحياته فإذا رأيتموهما فادعوا الله وصلوا حتى ينكشف ‏\"‏ ‏.‏",
      "text_en": "  Ziyad b. 'Ilaqa reported:                      I heard Mughira b. Shu'ba saying that the sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him) on the day when Ibrahim died. Upon this the Messenger of Allah (may peace be upon him) said: Verily the sun and the moon are the two signs among the signs of Allah. They do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see them, supplicate Allah, and observe prayer till it is over.",
      "chain": [
        "30201",
        "30212",
        "20608",
        "20320",
        "11339",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس، الأسدي عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Mughira b. Shu'ba from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "20387",
        "20345",
        "20605",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "2202",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا مروان، - يعني الفزاري - حدثنا سعيد بن عبيد، الطائي عن علي بن ربيعة، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " This hadith has been narrated from the Apostle of Allah (may peace be upon him) through another chain of transmitters.",
      "chain": [
        "30421",
        "11629",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "2623",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي، هريرة - رضى الله عنه - عن النبي صلى الله عليه وسلم بمثله غير أنه قال ‏\"‏ فاكلفوا ما لكم به طاقة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying (the words as said in the previous hadith) but with this alteration (of words):                     \" Take upon yourselves (the burden of the deeds) for which you have the strength to bear.\"",
      "chain": [
        "30367",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3837",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا أبو عوانة، عن عبد الملك بن عمير، عن وراد، - كاتب المغيرة - عن المغيرة بن شعبة، قال قال سعد بن عبادة لو رأيت رجلا مع امرأتي لضربته بالسيف غير مصفح عنه ‏.‏ فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ أتعجبون من غيرة سعد فوالله لأنا أغير منه والله أغير مني من أجل غيرة الله حرم الفواحش ما ظهر منها وما بطن ولا شخص أغير من الله ولا شخص أحب إليه العذر من الله من أجل ذلك بعث الله المرسلين مبشرين ومنذرين ولا شخص أحب إليه المدحة من الله من أجل ذلك وعد الله الجنة ‏\"‏ ‏.‏",
      "text_en": " AI-Mughira b. Shu'ba (Allah be pleased with him) reported that Sa'd b. 'Ubada (Allah be pleased with him) said:                      If I were to see a man with my wife, I would have struck him with the sword, and not with the flat part (side) of it. When Allah's Messenger (may peace be upon him) heard of that, he said: Are you surprised at Sa'd's jealousy of his honour? By Allah, I am more jealous of my honour than he, and Allah is more jealous than I. Because of His jealousy Allah has prohibited abomination, both open and secret And no person is more jealous of his honour than Allah, and no persons, is more fond of accepting an excuse than Allah, on account of which He has sent messengers, announcers of glad tidings and warners; and no one is more fond of praise than Allah on account of which Allah has promised Paradise.",
      "chain": [
        "30024",
        "20469",
        "11368",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "4077",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن حجر، وإسحاق بن إبراهيم، - واللفظ لابن حجر - قالا حدثنا جرير، عن المغيرة، عن نعيم بن أبي هند، عن ربعي بن حراش، قال اجتمع حذيفة وأبو مسعود فقال حذيفة ‏\"‏ رجل لقي ربه فقال ما عملت قال ما عملت من الخير إلا أني كنت رجلا ذا مال فكنت أطالب به الناس فكنت أقبل الميسور وأتجاوز عن المعسور ‏.‏ فقال تجاوزوا عن عبدي ‏\"‏ ‏.‏ قال أبو مسعود هكذا سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏",
      "text_en": " Hudhaifa reported:                      A person met his Lord (after death) and He said: What (good) did you do? He said: I did no good except this that I was a rich man, and I demanded from the people (the repayment of debt that I advanced to them). I, however, accepted that which the solvent gave and remitted (the debt) of the insolvent, whereupon He (the Lord) said: You should ignore (the faults) of My servant. Abu Mas'ud (Allah be pleased with him) said: This is what I heard Allah's Messenger (may peace be upon him) as saying.",
      "chain": [
        "20387",
        "30123",
        "20028",
        "166",
        "10973",
        "11334"
      ]
    },
    {
      "hadith_no": "4487",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن إبراهيم، عن عبيد بن نضيلة الخزاعي، عن المغيرة بن شعبة، قال ضربت امرأة ضرتها بعمود فسطاط وهي حبلى فقتلتها - قال - وإحداهما لحيانية - قال - فجعل رسول الله صلى الله عليه وسلم دية المقتولة على عصبة القاتلة وغرة لما في بطنها ‏.‏ فقال رجل من عصبة القاتلة أنغرم دية من لا أكل ولا شرب ولا استهل فمثل ذلك يطل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ قال وجعل عليهم الدية ‏.‏",
      "text_en": " Al-Mughira b. Shu'ba reported that a woman struck her co-wife with a tent-pole and she was pregnant and she killed her. One of them belonged to the tribe of Lihyan. Allah's Messenger (may peace be upon him) made the relatives of the murderer responsible for the payment of blood-wit on her behalf, and fixed a slave or a female slave as the indemnity for what was in her womb. One of the persons amongst the relatives of the murderer said:                      Should we pay indemnity for one who, neither ate, nor drank, nor made any noise, who was just like a nonentity? Thereupon Allah's Messenger (may peace be upon him) remarked: He speaks rhymed phrases like the people of the desert. He did impose indemnity upon them.",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4488",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مفضل، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، ‏.‏ أن امرأة، قتلت ضرتها بعمود فسطاط فأتي فيه رسول الله صلى الله عليه وسلم فقضى على عاقلتها بالدية وكانت حاملا فقضى في الجنين بغرة ‏.‏ فقال بعض عصبتها أندي من لا طعم ولا شرب ولا صاح فاستهل ومثل ذلك يطل قال فقال ‏\"‏ سجع كسجع الأعراب ‏\"‏ ‏.‏",
      "text_en": " Al-Mughira b. Shu'ba reported:                      A woman killed her fellow-wife with a tent-pole. Her case was brought to Allah's Messenger (may peace be upon him), and he gave judgment that blood-wit should be paid by the relatives (of the offender) on the father's side. And as she was pregnant, he decided regarding her unborn child that a male or a female slave of good quality be given. Some of her offender's) relatives said: Should we make compensation for one who never ate, nor drank, nor made any noise, who was like a nonentity? Thereupon Allah's Messenger (may peace be upon him) said: He was talking rhymed phrases like the rhymed phrases of desert Arabs.",
      "chain": [
        "30375",
        "20364",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4580",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن منصور، عن الشعبي، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل حرم عليكم عقوق الأمهات ووأد البنات ومنعا وهات وكره لكم ثلاثا قيل وقال وكثرة السؤال وإضاعة المال ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported Allah's Messenger (may peace be upon him) as saying:                      Verity Allah, the Glorious and Majestic, has forbidden for you: disobedience to mothers, and burying alive daughters, withholding the right of others in spite of having the power to return that to them and demanding that (which is not one's legitimate right). And He disapproved three things for you; irrelevant talk, persistent questioning and wasting of wealth.",
      "chain": [
        "30021",
        "20028",
        "11067",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "5060",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا وكيع، وعبدة كلاهما عن إسماعيل بن أبي خالد، ح وحدثنا ابن أبي عمر، - واللفظ له - حدثنا  مروان، - يعني الفزاري - عن إسماعيل، عن قيس، عن المغيرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لن يزال قوم من أمتي ظاهرين على الناس حتى يأتيهم أمر الله وهم ظاهرون ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Mughira who said:                      I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to be triumphant over the people until the Command of Allah overtakes them while they are still triumphant. The same tradition has been narrated through another chain of transmitters on the same authority.",
      "chain": [
        "30201",
        "20032",
        "30212",
        "11418",
        "30421",
        "20208",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "5061",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه محمد بن رافع، حدثنا أبو أسامة، حدثني إسماعيل، عن قيس، قال سمعت المغيرة بن شعبة، يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديث مروان سواء ‏.‏",
      "text_en": "",
      "chain": [
        "20318",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "5721",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو سعيد الأشج ومحمد بن المثنى العنزي - واللفظ لابن نمير - قالوا حدثنا ابن إدريس، عن أبيه، عن  سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال لما قدمت نجران سألوني فقالوا إنكم تقرءون يا أخت هارون وموسى قبل عيسى بكذا وكذا ‏.‏ فلما قدمت على رسول الله صلى الله عليه وسلم سألته عن ذلك فقال ‏\"‏ إنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      When I came to Najran, they (the Christians of Najran) asked me: You read\" O sister of Harun\" (i. e. Hadrat Maryam) in the Qur'an, whereas Moses was born much before Jesus. When I came back to Allah's Messenger (may peace be upon him) I asked him about that, whereupon he said: The (people of the old age) used to give names (to their persons) after the names of Apostles and pious persons who had gone before them.",
      "chain": [
        "30201",
        "30212",
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "5749",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، - واللفظ لابن أبي عمر - قالا حدثنا يزيد بن هارون، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن المغيرة، بن شعبة قال ما سأل رسول الله صلى الله عليه وسلم أحد عن الدجال أكثر مما سألته عنه فقال لي ‏\"‏ أى بنى وما ينصبك منه إنه لن يضرك ‏\"‏ ‏.‏ قال قلت إنهم يزعمون أن معه أنهار الماء وجبال الخبز ‏.‏ قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that none else had asked more questions from Allah's Messenger (may peace be upon him) about the Dajjal than I, but he simply said in a slight mood):                      O, myson, why are you worried because of him? He will not harm you. I said: The people think that he would have with him rivers of water and mountains of bread, whereupon he said: He would be more insignificant in the sight of Allah than all these things (belonging to him).",
      "chain": [
        "30201",
        "30421",
        "20472",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "7302",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن زياد بن علاقة، عن المغيرة بن، شعبة أن النبي صلى الله عليه وسلم صلى حتى انتفخت قدماه فقيل له أتكلف هذا وقد غفر الله لك ما تقدم من ذنبك وما تأخر فقال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that Allah's Apostle (may peace be upon him) worshipped so much that his feet were swollen. It was said to him:                      (Why do you undergo so much hardship despite the fact that) Allah has pardoned for you your earlier and later sins? Thereupon he said: May I not (prove myself) to be a grateful servant (of Allah)?",
      "chain": [
        "30367",
        "20469",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "7303",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا سفيان، عن زياد بن علاقة، سمع المغيرة بن شعبة، يقول قام النبي صلى الله عليه وسلم حتى ورمت قدماه قالوا قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Mughira b. Shu'ba and the words are:                      Allah's Apostle (may peace be upon him) kept standing in prayer (for such long hours) that his feet were swollen. They (his Companions) said: Verily, Allah has pardoned for thee the earlier and the later of thine sins. Thereupon he said: Should I not prove myself to be a grateful servant (of Allah)?",
      "chain": [
        "30201",
        "30212",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "7565",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا شهاب بن عباد العبدي، حدثنا إبراهيم بن حميد الرؤاسي، عن إسماعيل، بن أبي خالد عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال ما سأل أحد النبي صلى الله عليه وسلم عن الدجال أكثر مما سألت قال ‏\"‏ وما ينصبك منه إنه لا يضرك ‏\"‏ ‏.‏ قال قلت يا رسول الله إنهم يقولون إن معه الطعام والأنهار قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      No one asked Allah's Messenger (may peace be upon him) more about Dajjil than I asked him. He said: He should not be a source of worry to you for he would not be able to do any harm to you. I said: Allah's Messenger, it is alleged that he would have along with him (abundance of) food and water. Thereupon he said: He would be very insignificant in the eye of Allah (even) with all this.",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "7566",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا سريج بن يونس، حدثنا هشيم، عن إسماعيل، عن قيس، عن المغيرة، بن شعبة قال ما سأل أحد النبي صلى الله عليه وسلم عن الدجال أكثر مما سألته قال ‏\"‏ وما سؤالك ‏\"‏ ‏.‏ قال قلت إنهم يقولون معه جبال من خبز ولحم ونهر من ماء ‏.‏ قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that none asked Allah's Apostle (may peace be upon him) about Dajjal more than I asked him. I (one of the narrators other than Mughlra b. Shu'ba) said:                      What'did you ask? Mughira replied: I said that the people alleged that he would have a mountain load of bread and mutton and rivers of water. Thereupon he said: He would be more insignificant in the eye of Allah compared with all this.",
      "chain": [
        "30251",
        "20468",
        "11418",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "1",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب القعنبي، حدثنا عبد العزيز، - يعني ابن محمد - عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم كان إذا ذهب المذهب أبعد ‏.‏",
      "text_en": " Narrated Mughirah ibn Shu'bah:                     When the Prophet (ﷺ) went (outside) to relieve himself, he went to a far-off place.",
      "chain": [
        "20164",
        "20167",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا أسود بن عامر، حدثنا شريك، وهذا، لفظه ح وحدثنا محمد بن عبد الله، - يعني المخرمي - حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن المغيرة، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا أتى الخلاء أتيته بماء في تور أو ركوة فاستنجى ‏.‏ قال أبو داود في حديث وكيع ثم مسح يده على الأرض ثم أتيته بإناء آخر فتوضأ ‏.‏ قال أبو داود وحديث الأسود بن عامر أتم ‏.‏",
      "text_en": " Narrated Abu Hurayrah :                     When the Prophet (sal Allaahu alayhi wa sallam ) went to the privy, I took to him water in a small vessel  or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel  and he performed ablution.Abu Dawud said : The tradition is transmitted by al-Aswad b. 'Amir is more perfect.",
      "chain": [
        "38072",
        "20380",
        "20587",
        "30271",
        "20032",
        "11858",
        "18002",
        "166",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى يعني ابن سعيد، ح حدثنا مسدد، حدثنا المعتمر، عن التيمي، حدثنا بكر، عن الحسن، عن ابن المغيرة بن شعبة، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم توضأ ومسح ناصيته ‏.‏ وذكر فوق العمامة - قال عن المعتمر - سمعت أبي يحدث عن بكر بن عبد الله عن الحسن عن ابن المغيرة بن شعبة عن المغيرة أن رسول الله صلى الله عليه وسلم كان يمسح على الخفين وعلى ناصيته وعلى عمامته ‏.‏ قال بكر وقد سمعته من ابن المغيرة ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah said:                      The Messenger of Allah (ﷺ) performed ablution and wiped his forelock and turban. Another version says : The Messenger of Allah (ﷺ) wiped his socks and his forelock and his turban. Bakr said: I heard it from Ibn al-Mughirah.",
      "chain": [
        "30175",
        "20031",
        "30175",
        "20288",
        "11289",
        "11267",
        "11016",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثني أبي، عن الشعبي، قال سمعت عروة بن المغيرة بن شعبة، يذكر عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في ركبه ومعي إداوة فخرج لحاجته ثم أقبل فتلقيته بالإداوة فأفرغت عليه فغسل كفيه ووجهه ثم أراد أن يخرج ذراعيه وعليه جبة من صوف من جباب الروم ضيقة الكمين فضاقت فادرعهما ادراعا ثم أهويت إلى الخفين لأنزعهما فقال لي ‏\"‏ دع الخفين فإني أدخلت القدمين الخفين وهما طاهرتان ‏\"‏ ‏.‏ فمسح عليهما ‏.‏ قال أبي قال الشعبي شهد لي عروة على أبيه وشهد أبوه على رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " ‘Urwah b. al-Mughirah reported his father as saying :                      We accompanied the Messenger of Allah (ﷺ) to a caravan, and I had a jug of water. He went to relieve himself and came back. I came to him with the jug of water and poured upon him. He washed his hands and face. He had a tight-sleeved Syrian woolen gown. He tried to get his forearms out, but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I then bent down to take off his socks. But he said to me : Leave them, for my feet were clean when I put them in, and he only wiped over them. Yunus said on the authority of al-Sha’bi that ‘Urwah narrated his tradition from his father before him, and his father reported it from the Messenger of Allah (ﷺ).",
      "chain": [
        "30175",
        "20347",
        "10846",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هدبة بن خالد، حدثنا همام، عن قتادة، عن الحسن، وعن زرارة بن أوفى، أن المغيرة بن شعبة، قال تخلف رسول الله صلى الله عليه وسلم فذكر هذه القصة ‏.‏ قال فأتينا الناس وعبد الرحمن بن عوف يصلي بهم الصبح فلما رأى النبي صلى الله عليه وسلم أراد أن يتأخر فأومأ إليه أن يمضي - قال - فصليت أنا والنبي صلى الله عليه وسلم خلفه ركعة فلما سلم قام النبي صلى الله عليه وسلم فصلى الركعة التي سبق بها ولم يزد عليها شيئا ‏.‏ قال أبو داود أبو سعيد الخدري وابن الزبير وابن عمر يقولون من أدرك الفرد من الصلاة عليه سجدتا السهو ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah said :                      The Messenger of Allah (ﷺ) lagged behind (in a journey). He then narrated this story saying : Then we came to people. ‘Abd al-Rahman was leading them in the dawn prayer. When he perceived the presence of the Prophet (ﷺ), he intended to retire. The Prophet (ﷺ) asked him to continue and I and the Prophet (ﷺ)offered one rak’ah of prayer behind him. When he had pronounced the salutation, the Prophet(ﷺ) got up and offered the rak’ah which had been finished before, and he made no addition to it. Abu Dawud said: Abu Sa’id al-Khudri, Ibn al-Zubair and Ibn ‘Umar hold the opinion that whoever gets an odd number of the rak’ahs of prayer, he should perform two prostrations on account of forgetfulness.",
      "chain": [
        "20294",
        "20297",
        "11019",
        "11016",
        "11284",
        "166"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن حى، - هو الحسن بن صالح - عن بكير بن عامر البجلي، عن عبد الرحمن بن أبي نعم، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم مسح على الخفين ‏.‏ فقلت يا رسول الله أنسيت قال ‏\"‏ بل أنت نسيت بهذا أمرني ربي عز وجل ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu’bah said:                      The Messenger of Allah (ﷺ) wiped over the socks and I said: Messenger of Allah, have you forgotten ? He said: My Lord has commanded me to do this.",
      "chain": [
        "30184",
        "11366",
        "166"
      ]
    },
    {
      "hadith_no": "159",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، عن وكيع، عن سفيان الثوري، عن أبي قيس الأودي، - هو عبد الرحمن بن ثروان - عن هزيل بن شرحبيل، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم توضأ ومسح على الجوربين والنعلين ‏.‏ قال أبو داود كان عبد الرحمن بن مهدي لا يحدث بهذا الحديث لأن المعروف عن المغيرة أن النبي صلى الله عليه وسلم مسح على الخفين ‏.‏ قال أبو داود وروي هذا أيضا عن أبي موسى الأشعري عن النبي صلى الله عليه وسلم أنه مسح على الجوربين ‏.‏ وليس بالمتصل ولا بالقوي ‏.‏ قال أبو داود ومسح على الجوربين علي بن أبي طالب وابن مسعود والبراء بن عازب وأنس بن مالك وأبو أمامة وسهل بن سعد وعمرو بن حريث وروي ذلك عن عمر بن الخطاب وابن عباس ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Messenger of Allah (ﷺ) performed ablution and wiped over the stockings and shoes.Abu Dawud said: 'Abd al-Rahman b. Mahdi did not narrate this tradition because the familiar version from al-Mughirah says that the Prophet (ﷺ) wiped over the socks.Abu Musa al-Ash'ari has also reported: The Prophet (ﷺ) wiped over stockings. But the chain of narrators of this tradition is neither continous nor strong.'Ali b. Abi Talib, Ibn Mas'ud, al-Bara' b. 'Aziz, Anas b. Malik, Abu Umamah, Sahl b. Sa'd and 'Amr b. Huriath also wiped over the stockings.",
      "chain": [
        "30203",
        "20032",
        "20012",
        "11660",
        "166"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا عبد الرحمن بن أبي الزناد، قال ذكره أبي عن عروة بن الزبير، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم كان يمسح على الخفين ‏.‏ وقال غير محمد على ظهر الخفين ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Messenger of Allah (ﷺ) wiped over the socks.Another version adds: \"On the back (upper part) of the socks.\"",
      "chain": [
        "30269",
        "20509",
        "10511",
        "166"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن مروان، ومحمود بن خالد الدمشقي، - المعنى - قالا حدثنا الوليد، - قال محمود - أخبرنا ثور بن يزيد، عن رجاء بن حيوة، عن كاتب المغيرة بن شعبة، عن المغيرة بن شعبة، قال وضأت النبي صلى الله عليه وسلم في غزوة تبوك فمسح أعلى الخفين وأسفلهما ‏.‏ قال أبو داود وبلغني أنه لم يسمع ثور هذا الحديث من رجاء ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     I poured water while the Prophet (ﷺ)  performed ablution in the battle of Tabuk. He wiped over the upper part of the socks and their lower part.Abu Dawud said: I have been told that Thawr did not hear this tradition from Raja'.",
      "chain": [
        "35154",
        "37534",
        "20733",
        "30277",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "hadith_no": "188",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد بن سليمان الأنباري، - المعنى - قالا حدثنا وكيع، عن مسعر، عن أبي صخرة، جامع بن شداد عن المغيرة بن عبد الله، عن المغيرة بن شعبة، قال ضفت النبي صلى الله عليه وسلم ذات ليلة فأمر بجنب فشوي وأخذ الشفرة فجعل يحز لي بها منه - قال - فجاء بلال فآذنه بالصلاة - قال - فألقى الشفرة وقال ‏\"‏ ما له تربت يداه ‏\"‏ ‏.‏ وقام يصلي ‏.‏ زاد الأنباري وكان شاربي وفى فقصه لي على سواك ‏.‏ أو قال أقصه لك على سواك ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     One night I became the guest of the Prophet (ﷺ). He ordered that a piece of mutton be roasted, and it was roasted. He then took a knife and began to cut the meat with it for me. In the meantime Bilal came and called him for prayer. He threw the knife and said: What happened! may his hands be smeared with earth! He then stood for offering prayer. Al-Anbari added: My moustaches became lengthy. He trimmed them by placing a took-stick; or he said: I shall trim your moustaches by placing the tooth-stick there.Al-Anbari said: My moustaches became lengthy. He trimmed them by placing a tooth-stick ; or he said: I shall trim your moustaches by placing the tooth-stick there.",
      "chain": [
        "30203",
        "20032",
        "20359",
        "11328",
        "166"
      ]
    },
    {
      "hadith_no": "616",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا عبد العزيز بن عبد الملك القرشي، حدثنا عطاء الخراساني، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصلي الإمام في الموضع الذي صلى فيه حتى يتحول ‏\"‏ ‏.‏ قال أبو داود عطاء الخراساني لم يدرك المغيرة بن شعبة ‏.‏",
      "text_en": " Narrated Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: The Imam should not pray at the place where he led the prayer until he removes  (from there).Abu Dawud said: 'Ata' al-Khurasani did not see Mughirah b. Shu'bah (This tradition is, therefore munqati', i.e. a link is missing in the chain).",
      "chain": [
        "30335",
        "10947",
        "166"
      ]
    },
    {
      "hadith_no": "659",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وعثمان بن أبي شيبة، - بمعنى الإسناد والحديث - قالا حدثنا أبو أحمد الزبيري، عن يونس بن الحارث، عن أبي عون، عن أبيه، عن المغيرة بن شعبة، قال كان رسول الله صلى الله عليه وسلم يصلي على الحصير والفروة المدبوغة ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Messenger of Allah (ﷺ) used to pray on a mat and on a tanned skin.",
      "chain": [
        "30024",
        "20355",
        "11649",
        "15346",
        "166"
      ]
    },
    {
      "hadith_no": "1036",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن عمرو، عن عبد الله بن الوليد، عن سفيان، عن جابر، - يعني الجعفي - قال حدثنا المغيرة بن شبيل الأحمسي، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام الإمام في الركعتين فإن ذكر قبل أن يستوي قائما فليجلس فإن استوى قائما فلا يجلس ويسجد سجدتى السهو ‏\"‏ ‏.‏ قال أبو داود وليس في كتابي عن جابر الجعفي إلا هذا الحديث ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: When an imam stands up at the end of two rak'ahs , if he remembers before standing straight up, he should sit down, but if he stands straight up, he must not sit down, but perform the two prostrations of forgetfulness.Abu Dawud said: I have not narrated in this book of mine any hadith from Jabir Al-Ju'fi (one of the narrators) except this one.",
      "chain": [
        "11624",
        "20005",
        "15060",
        "19880",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، كتب معاوية إلى المغيرة بن شعبة أى شىء كان رسول الله صلى الله عليه وسلم يقول إذا سلم من الصلاة فأملاها المغيرة عليه وكتب إلى معاوية كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah b. Shu'bah reported:                      \"Mu'awiyah wrote to al-Mughirah b. Shu'bah: 'What would the the Messenger of Allah (ﷺ) recite when he gave Taslim (salutation) in the prayer ?' Al-Mughirah dictated and wrote to Mu'awiyah: 'The Messenger of Allah (ﷺ) used to say (at the end of the prayer after taslim): 'There is no God but Allah, Alone, Who has no partner, to Him belongs the dominion, to Him praise is due, and He is Omnipotent. O Allah no one cane withhold what You give and give what You withhold, and none benefits the fortunate person, for from You is the fortune.\t'\"",
      "chain": [
        "30175",
        "20354",
        "11060",
        "11394",
        "166"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن المغيرة، عن إبراهيم، قال الوسق ستون صاعا مختوما بالحجاجي ‏.‏",
      "text_en": " Ibrahim said The wasq contained sixty sa’s stamped with the stamp of Al Hajjaj.",
      "chain": [
        "38573",
        "20028",
        "166",
        "11051"
      ]
    },
    {
      "hadith_no": "1962",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن المغيرة، عن إبراهيم، قال إن عثمان صلى أربعا لأنه اتخذها وطنا ‏.‏",
      "text_en": " Narrated Ibrahim:                     Uthman prayed four rak'ahs (at Mina) for he made it his home (for settlement).",
      "chain": [
        "30480",
        "20327",
        "166",
        "11051"
      ]
    },
    {
      "hadith_no": "2972",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا جرير، عن المغيرة، قال جمع عمر بن عبد العزيز بني مروان حين استخلف فقال إن رسول الله صلى الله عليه وسلم كانت له فدك فكان ينفق منها ويعود منها على صغير بني هاشم ويزوج منها أيمهم وإن فاطمة سألته أن يجعلها لها فأبى فكانت كذلك في حياة رسول الله صلى الله عليه وسلم حتى مضى لسبيله فلما أن ولي أبو بكر رضى الله عنه عمل فيها بما عمل النبي صلى الله عليه وسلم في حياته حتى مضى لسبيله فلما أن ولي عمر عمل فيها بمثل ما عملا حتى مضى لسبيله ثم أقطعها مروان ثم صارت لعمر بن عبد العزيز قال - يعني عمر بن عبد العزيز - فرأيت أمرا منعه رسول الله صلى الله عليه وسلم فاطمة عليها السلام ليس لي بحق وأنا أشهدكم أني قد رددتها على ما كانت يعني على عهد رسول الله صلى الله عليه وسلم ‏.‏ قال أبو داود ولي عمر بن عبد العزيز الخلافة وغلته أربعون ألف دينار وتوفي وغلته أربعمائة دينار ولو بقي لكان أقل ‏.‏",
      "text_en": " Narrated Umar ibn AbdulAziz:                     Al-Mughirah (ibn Shu'bah) said: Umar ibn AbdulAziz gathered the family of Marwan when he was made caliph, and he said: Fadak belonged to the Messenger of Allah (ﷺ), and he made contributions from it, showing repeated kindness to the poor of the Banu Hashim from it, and supplying from it the cost of marriage for those who were unmarried. Fatimah asked him to give it to her, but he refused. That is how matters stood during the lifetime of the Messenger of Allah (ﷺ) till he passed on (i.e. died).  When AbuBakr was made ruler he administered it as the Prophet (ﷺ) had done in his lifetime till he passed on. Then when Umar ibn al-Khattab was made ruler he administered it as they had done till he passed on. Then it was given to Marwan as a fief, and it afterwards came to Umar ibn AbdulAziz.  Umar ibn AbdulAziz said: I consider I have no right to something which the Messenger of Allah (ﷺ) refused to Fatimah, and I call you to witness that I have restored it to its former condition; meaning in the time of the Messenger of Allah (ﷺ).Abu Dawud said: When 'Umar b. 'Abd al-'Aziz was made caliph its revenue was forty thousand dinars, and when he died its revenue was four hundred dinars. Had he remained alive, it would have been less than it.",
      "chain": [
        "20028",
        "166"
      ]
    },
    {
      "hadith_no": "3180",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن يونس، عن زياد بن جبير، عن أبيه، عن المغيرة بن شعبة، - وأحسب أن أهل، زياد أخبروني أنه، رفعه إلى النبي صلى الله عليه وسلم - قال ‏\"‏ الراكب يسير خلف الجنازة والماشي يمشي خلفها وأمامها وعن يمينها وعن يسارها قريبا منها والسقط يصلى عليه ويدعى لوالديه بالمغفرة والرحمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     (I think that the people of Ziyad informed me that he reported on the authority of the Prophet (ﷺ): A rider should go behind the bier, and those on foot should walk behind it, in front of it, on its right and on its left keeping near it. Prayer should be offered over an abortion and forgiveness and mercy supplicated for its parents.",
      "chain": [
        "30569",
        "20423",
        "20475",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "3489",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا ابن إدريس، ووكيع، عن طعمة بن عمرو الجعفري، عن عمر بن بيان التغلبي، عن عروة بن المغيرة بن شعبة، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من باع الخمر فليشقص الخنازير ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Prophet (ﷺ) said: He who sold wine should shear the flesh of swine.",
      "chain": [
        "30203",
        "20102",
        "20032",
        "25132",
        "15394",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "3826",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا أبو هلال، حدثنا حميد بن هلال، عن أبي بردة، عن المغيرة بن شعبة، قال أكلت ثوما فأتيت مصلى النبي صلى الله عليه وسلم وقد سبقت بركعة فلما دخلت المسجد وجد النبي صلى الله عليه وسلم ريح الثوم فلما قضى رسول الله صلى الله عليه وسلم صلاته قال ‏\"‏ من أكل من هذه الشجرة فلا يقربنا حتى يذهب ريحها ‏\"‏ ‏.‏ أو ‏\"‏ ريحه ‏\"‏ ‏.‏ فلما قضيت الصلاة جئت إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله والله لتعطيني يدك ‏.‏ قال فأدخلت يده في كم قميصي إلى صدري فإذا أنا معصوب الصدر قال ‏\"‏ إن لك عذرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     I ate garlic and came to the place where the Prophet (ﷺ) was praying; one rak'ah of prayer had been performed when I joined. When I entered the mosque, the Prophet (ﷺ) noticed the odour of garlic.  When the Messenger of Allah (ﷺ) finished his prayer, he said: He who eats from this plant should not come near us until its odour has gone away.  When I finished the prayer, I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, do give me your hand. Then I put his hand in the sleeve of my shirt, carrying it to my chest to show that my chest was fastened with a belt.  He said: You have a (valid) excuse.",
      "chain": [
        "20656",
        "19857",
        "11281",
        "11901",
        "166"
      ]
    },
    {
      "hadith_no": "4290",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "المغيرة، قال حدثنا عمرو بن أبي قيس، عن شعيب بن خالد، عن أبي إسحاق، قال قال علي - رضى الله عنه - ونظر إلى ابنه الحسن فقال إن ابني هذا سيد كما سماه النبي صلى الله عليه وسلم وسيخرج من صلبه رجل يسمى باسم نبيكم يشبهه في الخلق ولا يشبهه في الخلق ثم ذكر قصة يملأ الأرض عدلا ‏.‏",
      "text_en": " Abu Dawud said:                      Abu Ishaq told that Ali looked at his son al-Hasan and said: This son of mine is a sayyid (chief) as named by the Prophet (ﷺ), and from his loins will come forth a man who will be called by the name of your Prophet (ﷺ) and resemble him in conduct but not in appearance. He then mentioned the story about his filling the earth with justice.",
      "chain": [
        "166",
        "20726",
        "28240",
        "11049",
        "5"
      ]
    },
    {
      "hadith_no": "4568",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، أن امرأتين، كانتا تحت رجل من هذيل فضربت إحداهما الأخرى بعمود فقتلتها وجنينها فاختصموا إلى النبي صلى الله عليه وسلم فقال أحد الرجلين كيف ندي من لا صاح ولا أكل ولا شرب ولا استهل ‏.‏ فقال ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ وقضى فيه بغرة وجعله على عاقلة المرأة ‏.‏",
      "text_en": " Narrated Al-Mughirah b. Shu'bah:                     A man of Hudhail has two wives. One of them struck her fellow-wife with a tent-pole and killed her and her unborn child. They brought the dispute to the Prophet (ﷺ). One of two men said: How can we pay bloodwit for the one who did not make a noise, or ate, nor drank, nor raised his voice ? He (the Prophet) asked: Is it rhymed prose like that of bedouin? He gave judgement that a male or female slave of the best quality should be paid in compensation, and he fixed it to be paid by woman's relatives on her father's side.",
      "chain": [
        "30329",
        "20020",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    },
    {
      "hadith_no": "4571",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن هشام، عن أبيه، عن المغيرة، عن عمر، بمعناه ‏.‏ قال أبو داود رواه حماد بن زيد وحماد بن سلمة عن هشام بن عروة، عن أبيه، أن عمر، قال ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Umar through a different chain of narrators to the same effect.Abu Dawud said:                      Hammad b. Zaid and Hammad b. Salamah transmitted it from Hisham b. 'Arubah on his father's authority who said that 'Umar said...",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "166",
        "30002",
        "20022",
        "11065",
        "10511",
        "3"
      ]
    },
    {
      "hadith_no": "4642",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسحاق بن إسماعيل الطالقاني، حدثنا جرير، ح وحدثنا زهير بن حرب، حدثنا جرير، عن المغيرة، عن الربيع بن خالد الضبي، قال سمعت الحجاج، يخطب فقال في خطبته رسول أحدكم في حاجته أكرم عليه أم خليفته في أهله فقلت في نفسي لله على ألا أصلي خلفك صلاة أبدا وإن وجدت قوما يجاهدونك لأجاهدنك معهم ‏.‏ زاد إسحاق في حديثه قال فقاتل في الجماجم حتى قتل ‏.‏",
      "text_en": " Al-Rabi’ b. Khalid al-Dabbi said:                      I heard al-Hajjaj say in his address: Is the messenger of one of you sent for some need is more respectable with him or his successor among his people? I thought in my mind: I make a vow for Allah that I shall never pray behind you. If I find people who fight against you, I shall fight against you along with them. Ishaq added in his version: He fought in the battle of al-Jamajim until he was killed.",
      "chain": [
        "20028",
        "30022",
        "20028",
        "166"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، عن محمد بن عمرو، عن أبي سلمة، عن المغيرة بن شعبة، قال كنت مع النبي صلى الله عليه وسلم في سفر فأتى النبي صلى الله عليه وسلم حاجته فأبعد في المذهب ‏.‏ قال وفي الباب عن عبد الرحمن بن أبي قراد وأبي قتادة وجابر ويحيى بن عبيد عن أبيه وأبي موسى وابن عباس وبلال بن الحارث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويروى عن النبي صلى الله عليه وسلم أنه كان يرتاد لبوله مكانا كما يرتاد منزلا ‏.‏ وأبو سلمة اسمه عبد الله بن عبد الرحمن بن عوف الزهري ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah said:                     I was with the Prophet on a journey. The Prophet had to relieve himself, so he went far away.\"",
      "chain": [
        "30160",
        "20259",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو الوليد الدمشقي، حدثنا الوليد بن مسلم، أخبرني ثور بن يزيد، عن رجاء بن حيوة، عن كاتب المغيرة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم مسح أعلى الخف وأسفله ‏.‏ قال أبو عيسى وهذا قول غير واحد من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم من الفقهاء وبه يقول مالك والشافعي وإسحاق ‏.‏ وهذا حديث معلول لم يسنده عن ثور بن يزيد غير الوليد بن مسلم ‏.‏ قال أبو عيسى وسألت أبا زرعة ومحمد بن إسماعيل عن هذا الحديث فقالا ليس بصحيح لأن ابن المبارك روى هذا عن ثور عن رجاء بن حيوة قال حدثت عن كاتب المغيرة مرسل عن النبي صلى الله عليه وسلم ولم يذكر فيه المغيرة ‏.‏",
      "text_en": " AI-Mughirah bin Shu'bah narrated:                     \"The Prophet wiped over the Khuff and its bottom.\"",
      "chain": [
        "20733",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، قال حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن عروة بن الزبير، عن المغيرة بن شعبة، قال رأيت النبي صلى الله عليه وسلم يمسح على الخفين على ظاهرهما ‏.‏ قال أبو عيسى حديث المغيرة حديث حسن وهو حديث عبد الرحمن بن أبي الزناد عن أبيه عن عروة عن المغيرة ولا نعلم أحدا يذكر عن عروة عن المغيرة ‏\"‏ على ظاهرهما ‏\"‏ ‏.‏ غيره ‏.‏ وهو قول غير واحد من أهل العلم وبه يقول سفيان الثوري وأحمد ‏.‏ قال محمد وكان مالك بن أنس يشير بعبد الرحمن بن أبي الزناد ‏.‏",
      "text_en": " AI-Mughirah bin Shu'bah narrated:                     \"I saw the Prophet wiping over the Khuff: on the tops of them.\"",
      "chain": [
        "20387",
        "20509",
        "11061",
        "10511",
        "166"
      ]
    },
    {
      "hadith_no": "99",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، ومحمود بن غيلان، قالا حدثنا وكيع، عن سفيان، عن أبي قيس، عن هزيل بن شرحبيل، عن المغيرة بن شعبة، قال توضأ النبي صلى الله عليه وسلم ومسح على الجوربين والنعلين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول غير واحد من أهل العلم وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق قالوا يمسح على الجوربين وإن لم تكن نعلين إذا كانا ثخينين ‏.‏ قال وفي الباب عن أبي موسى ‏.‏ قال أبو عيسى سمعت صالح بن محمد الترمذي قال سمعت أبا مقاتل السمرقندي يقول دخلت على أبي حنيفة في مرضه الذي مات فيه فدعا بماء فتوضأ وعليه جوربان فمسح عليهما ثم قال فعلت اليوم شيئا لم أكن أفعله مسحت على الجوربين وهما غير منعلين ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated:                     \"The Prophet performed Wudu and wiped over is socks and sandals.\"",
      "chain": [
        "30480",
        "30277",
        "20032",
        "20012",
        "11660",
        "166"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، وبشر بن معاذ العقدي، قالا حدثنا أبو عوانة، عن زياد بن علاقة، عن المغيرة بن شعبة، قال صلى رسول الله صلى الله عليه وسلم حتى انتفخت قدماه فقيل له أتتكلف هذا وقد غفر لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث المغيرة بن شعبة حديث حسن صحيح ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated:                     \"Allah's Messenger (S) performed Salat until his feet were swollen, so it was said to him: 'You burden yourself like this, while your past and future sins have been forgiven?' He said: 'Shouldn't I be a grateful worshipper?'\"",
      "chain": [
        "30367",
        "34041",
        "20469",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1031",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا بشر بن آدم ابن بنت أزهر السمان البصري، حدثنا إسماعيل بن سعيد بن عبيد الله، حدثنا أبي، عن زياد بن جبير بن حية، عن أبيه، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح رواه إسرائيل وغير واحد عن سعيد بن عبيد الله ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا يصلى على الطفل وإن لم يستهل بعد أن يعلم أنه خلق ‏.‏ وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated that:                     The Prophet said: \"The rider is to be behind the funeral (procession), and the walker where he wishes, and the child should be prayed over.\"",
      "chain": [
        "30125",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "1087",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا ابن أبي زائدة، قال حدثني عاصم بن سليمان، هو الأحول عن بكر بن عبد الله المزني، عن المغيرة بن شعبة، أنه خطب امرأة فقال النبي صلى الله عليه وسلم ‏\"‏ انظر إليها فإنه أحرى أن يؤدم بينكما ‏\"‏ ‏.‏ وفي الباب عن محمد بن مسلمة وجابر وأنس وأبي حميد وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا لا بأس أن ينظر إليها ما لم ير منها محرما ‏.‏ وهو قول أحمد وإسحاق ‏.‏ ومعنى قوله ‏\"‏ أحرى أن يؤدم بينكما ‏\"‏ قال أحرى أن تدوم المودة بينكما ‏.‏",
      "text_en": " Bakr bin Abdullah Al-Muzani narrated that :                     Al-Mughirah bin Shu'bah proposed to a woman, so the Prophet said: \"Look at her, for indeed that is more likely to make things better between the two of you.\"",
      "chain": [
        "30242",
        "20366",
        "11080",
        "11267",
        "166"
      ]
    },
    {
      "hadith_no": "1411",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا وهب بن جرير، حدثنا شعبة، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، أن امرأتين، كانتا ضرتين فرمت إحداهما الأخرى بحجر أو عمود فسطاط فألقت جنينها فقضى رسول الله صلى الله عليه وسلم في الجنين غرة عبد أو أمة وجعله على عصبة المرأة ‏.‏  قال الحسن وأخبرنا زيد بن حباب، عن سفيان، عن منصور، بهذا الحديث نحوه ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     \"Two women co-wives, (were fighting), and one of them hit the other with a stone or a tent post, causing her to have a miscarriage. The Messenger of Allah (ﷺ) judged that a Ghurrah male or female slave should be given for fetus, and he required it from the Asabah of the woman.\"(Another Chain) for this Hadith [and it is similar to this].",
      "chain": [
        "30115",
        "20298",
        "20020",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا يونس بن أبي إسحاق، عن الشعبي، عن عروة بن المغيرة بن شعبة، عن أبيه، أن النبي صلى الله عليه وسلم لبس جبة رومية ضيقة الكمين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Urwah bin Al-Mugirah bin Shu'bah:                     From this father: \"The Prophet (ﷺ) wore a Roman Jubbah with tight sleeves.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30401",
        "20032",
        "10846",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان، عن زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات فتؤذوا الأحياء ‏\"‏ ‏.‏ قال أبو عيسى وقد اختلف أصحاب سفيان في هذا الحديث فروى بعضهم مثل رواية الحفري وروى بعضهم عن سفيان عن زياد بن علاقة قال سمعت رجلا يحدث عند المغيرة بن شعبة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " ' Al-Mughirah bin Shu'bah narrated that the Messenger of Allah said:                     \"Do not vilify the dead (and) by that harm the living.\"",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2619",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شعار المؤمن على الصراط رب سلم سلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث المغيرة بن شعبة لا نعرفه إلا من حديث عبد الرحمن بن إسحاق ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated that The Messenger of Allah (s.a.w) said:                     \"The sign of the  believers upon the Sirat is: O lord, protect (us), protect (us).'\"",
      "chain": [
        "20387",
        "20345",
        "11876",
        "166"
      ]
    },
    {
      "hadith_no": "2662",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حدث عني حديثا وهو يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ وفي الباب عن علي بن أبي طالب وسمرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى شعبة عن الحكم عن عبد الرحمن بن أبي ليلى عن سمرة عن النبي صلى الله عليه وسلم هذا الحديث وروى الأعمش وابن أبي ليلى عن الحكم عن عبد الرحمن بن أبي ليلى عن علي عن النبي صلى الله عليه وسلم وكأن حديث عبد الرحمن بن أبي ليلى عن سمرة عند أهل الحديث أصح ‏.‏ قال سألت أبا محمد عبد الله بن عبد الرحمن عن حديث النبي صلى الله عليه وسلم ‏\"‏ من حدث عني حديثا وهو يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ قلت له من روى حديثا وهو يعلم أن إسناده خطأ أيخاف أن يكون قد دخل في حديث النبي صلى الله عليه وسلم أو إذا روى الناس حديثا مرسلا فأسنده بعضهم أو قلب إسناده يكون قد دخل في هذا الحديث ‏.‏ فقال لا إنما معنى هذا الحديث إذا روى الرجل حديثا ولا يعرف لذلك الحديث عن النبي صلى الله عليه وسلم أصل فحدث به فأخاف أن يكون قد دخل في هذا الحديث ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     that the Prophet (ﷺ) said: \"Whoever narrates a Hadith from me which he knows is a lie, then he is one of the liars.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11331",
        "10834",
        "166"
      ]
    },
    {
      "hadith_no": "3449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو سعيد الأشج، وأبو موسى محمد بن المثنى قالا حدثنا ابن إدريس، عن أبيه، عن سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال بعثني رسول الله صلى الله عليه وسلم إلى نجران فقالوا لي ألستم تقرءون ‏:‏ ‏(‏ يا أخت هارون ‏)‏ وقد كان بين عيسى وموسى ما كان فلم أدر ما أجيبهم ‏.‏ فرجعت إلى رسول الله صلى الله عليه وسلم فأخبرته فقال ‏\"‏ ألا أخبرتهم أنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث ابن إدريس ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     \"The Messenger of Allah (ﷺ) sent me to Najran. They said to me: 'Do you people not recite: O sister of Harun (19:28) - while between Musa and 'Eisa there is such (gap) as there is?' I did not know how to respond to them. So when I returned to the Prophet (ﷺ), I told him about that, and he said: 'Why didn't you tell them that they were named after their Prophets and righteous people before them.'\"",
      "chain": [
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "17",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، عن محمد بن عمرو، عن أبي سلمة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم كان إذا ذهب المذهب أبعد قال فذهب لحاجته - وهو في بعض أسفاره - فقال ‏\"‏ ائتني بوضوء ‏\"‏ ‏.‏ فأتيته بوضوء فتوضأ ومسح على الخفين ‏.‏ قال الشيخ إسماعيل هو ابن جعفر بن أبي كثير القارئ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that when the Prophet (ﷺ) would go away (to relieve himself) he would go far away. He went to relieve himself when he was on one of his journeys, and said:                      \"Bring me (water for) Wudu'.\" So I brought him (water for) Wudu', and he performed Wudu' and wiped over his Khuffs.The Shaikh [1] said: \"Isma'il (one of the narrators) is Ibn Ja'far bin Abi Kathir Al-Qari.[1] Meaning the author, and it appears that Ibn As-Sunni who heard the text, said this.",
      "chain": [
        "20387",
        "20208",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن مالك، ويونس، وعمرو بن الحارث، أن ابن شهاب، أخبرهم عن عباد بن زياد، عن عروة بن المغيرة، أنه سمع أباه، يقول سكبت على رسول الله صلى الله عليه وسلم حين توضأ في غزوة تبوك فمسح على الخفين ‏.‏ قال أبو عبد الرحمن لم يذكر مالك عروة بن المغيرة ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Al-Mughirah that he heard his father say:                      \"I poured water for the Messenger of Allah (ﷺ) when he performed Wudu' during the battle of Tabuk, and he wiped over his Khuff.\"",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20001",
        "20475",
        "20377",
        "11013",
        "10927",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، عن بشر بن المفضل، عن ابن عون، عن عامر الشعبي، عن عروة بن المغيرة، عن المغيرة، وعن محمد بن سيرين، عن رجل، حتى رده إلى المغيرة - قال ابن عون ولا أحفظ حديث ذا من حديث ذا - أن المغيرة قال كنا مع رسول الله صلى الله عليه وسلم في سفر فقرع ظهري بعصا كانت معه فعدل وعدلت معه حتى أتى كذا وكذا من الأرض فأناخ ثم انطلق ‏.‏ قال فذهب حتى توارى عني ثم جاء فقال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ ومعي سطيحة لي فأتيته بها فأفرغت عليه فغسل يديه ووجهه وذهب ليغسل ذراعيه وعليه جبة شامية ضيقة الكمين فأخرج يده من تحت الجبة فغسل وجهه وذراعيه وذكر من ناصيته شيئا وعمامته شيئا - قال ابن عون لا أحفظ كما أريد ثم مسح على خفيه - ثم قال ‏\"‏ حاجتك ‏\"‏ ‏.‏ قلت يا رسول الله ليست لي حاجة فجئنا وقد أم الناس عبد الرحمن بن عوف وقد صلى بهم ركعة من صلاة الصبح فذهبت لأوذنه فنهاني فصلينا ما أدركنا وقضينا ما سبقنا ‏.‏",
      "text_en": " Al-Mughirah said:                      \"We were with the Prophet (ﷺ) on a journey, and he tapped me on the back with a stick he had with him, then he turned off (route) and I turned off with him until he came to such and such an area. Then he made his camel stop and went away until he disappeared from me, then he came back and said: 'Do you have water with you?' I had a water skin with me, so I brought it out and poured it for him. He washed his hands and face and began to wash his arms, but he was wearing a Syrian Jubbah[1] that had narrow sleeves, so he brought his arms out from beneath the Jubbah and washed his hands and arms, and wiped his forelock a little and his turban a little.\" - Ibn 'Awn said: \"I cannot remember it well - then he wiped over his Khuffs.\" Then he said: 'What do you need?' I said: 'O Messenger of Allah, I do not need anything.' Then we came and 'Abdur-Rahman bin 'Awf was leading the people in Salah, and he had led them in one Rak'ah of the Subh (Fajr) prayer. I wanted to tell him that the Prophet (ﷺ) had arrived but he did not let me, so we prayed what we had caught up with and made up what we had missed.'\"[1] It is a type of cloak.",
      "chain": [
        "11213",
        "20212",
        "11071",
        "11052",
        "11373",
        "166",
        "11035",
        "166"
      ]
    },
    {
      "hadith_no": "107",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثني يحيى بن سعيد، قال حدثنا سليمان التيمي، قال حدثنا بكر بن عبد الله المزني، عن الحسن، عن ابن المغيرة بن شعبة، عن المغيرة، أن رسول الله صلى الله عليه وسلم توضأ فمسح ناصيته وعمامته وعلى الخفين ‏.‏ قال بكر وقد سمعته من ابن المغيرة بن شعبة عن أبيه ‏.‏",
      "text_en": " It was narrated from Al-Mughirah that the Prophet (ﷺ) performed Wudu', and he wiped the forehead, the 'Imamah, and over the Khuff.(Another chain)",
      "chain": [
        "30153",
        "20031",
        "11289",
        "11267",
        "11016",
        "166"
      ]
    },
    {
      "hadith_no": "109",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أخبرنا يونس بن عبيد، عن ابن سيرين، قال أخبرني عمرو بن وهب الثقفي، قال سمعت المغيرة بن شعبة، قال خصلتان لا أسأل عنهما أحدا بعد ما شهدت من رسول الله صلى الله عليه وسلم - قال - كنا معه في سفر فبرز لحاجته ثم جاء فتوضأ ومسح بناصيته وجانبى عمامته ومسح على خفيه قال وصلاة الإمام خلف الرجل من رعيته فشهدت من رسول الله صلى الله عليه وسلم أنه كان في سفر فحضرت الصلاة فاحتبس عليهم النبي صلى الله عليه وسلم فأقاموا الصلاة وقدموا ابن عوف فصلى بهم فجاء رسول الله صلى الله عليه وسلم فصلى خلف ابن عوف ما بقي من الصلاة فلما سلم ابن عوف قام النبي صلى الله عليه وسلم فقضى ما سبق به ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah said:                      \"There are two things which I never asked anyone about after I saw the Messenger of Allah (ﷺ). He was with us on a journey and he went away to relieve himself, then he came and performed Wudu', and he wiped over his forehead and two sides of his 'Imamah, and he wiped over his Khuffs.\" He said: \"And (the other issue) the Imam's Salah behind one of his followers. I saw the Messenger of Allah (ﷺ) when he was on a journey and time for prayer came. The Prophet (ﷺ) could not join them, so they called the Iqamah and they asked Ibn 'Awf to lead them in prayer. Then the Messenger of Allah (ﷺ) came and offered the remainder of the prayer behinf Ibn 'Awf, then when Ibn 'Awf said the Salah, the Prophet (ﷺ) stood up and completed what he had missed (of the prayer).\"",
      "chain": [
        "20184",
        "20468",
        "11075",
        "11035",
        "18813",
        "166"
      ]
    },
    {
      "hadith_no": "123",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن خشرم، قال حدثنا عيسى، عن الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال خرج النبي صلى الله عليه وسلم لحاجته فلما رجع تلقيته بإداوة فصببت عليه فغسل يديه ثم غسل وجهه ثم ذهب ليغسل ذراعيه فضاقت به الجبة فأخرجهما من أسفل الجبة فغسلهما ومسح على خفيه ثم صلى بنا ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu'bah said:                      \"The Prophet (ﷺ) went out to relieve himself, and when he came back, I met him with a vessel (of water). I poured some for him and he washed his hands, then he washed his face. Then he wanted to wash his forearms but his Jubbah was too tight, so he brought them out from beneath the Jubbah to wash them, and he wiped over his Khuffs, then he led us in prayer.\"",
      "chain": [
        "30556",
        "20347",
        "11060",
        "11392",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، حدثنا وكيع، أنبأنا سفيان، عن أبي قيس، عن هزيل بن شرحبيل، عن المغيرة بن شعبة، أن رسول الله صلى الله عليه وسلم مسح على الجوربين والنعلين ‏.‏ قال أبو عبد الرحمن ما نعلم أحدا تابع أبا قيس على هذه الرواية والصحيح عن المغيرة أن النبي صلى الله عليه وسلم مسح على الخفين ‏.‏",
      "text_en": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "11660",
        "166"
      ]
    },
    {
      "hadith_no": "1211",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن المغيرة، عن الحارث العكلي، عن أبي زرعة بن عمرو بن جرير، قال حدثنا عبد الله بن نجى، عن علي، قال كان لي من رسول الله صلى الله عليه وسلم ساعة آتيه فيها فإذا أتيته استأذنت إن وجدته يصلي فتنحنح دخلت وإن وجدته فارغا أذن لي ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"I had certain times when I used to come to the Messenger of Allah (ﷺ). When I came to him I would ask for permission to enter. If I found him praying he would clear his throat and I would enter, and if I found him free he would give me permission (to enter).\"",
      "chain": [
        "20028",
        "166",
        "11622",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "1343",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا الحسن بن إسماعيل المجالدي، قال أنبأنا هشيم، قال أنبأنا المغيرة، وذكر، آخر ح وأنبأنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أنبأنا غير، واحد، منهم المغيرة عن الشعبي، عن وراد، كاتب المغيرة أن معاوية، كتب إلى المغيرة أن اكتب إلى بحديث سمعته من رسول الله صلى الله عليه وسلم ‏.‏ فكتب إليه المغيرة إني سمعته يقول عند انصرافه من الصلاة ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " It was narrated from Warrad that:                     Mu'awiyah wrote to Al-Mughirah asking him to write him a hadith that he had heard from the Messenger of Allah (ﷺ). Al-Mughirah wrote to him (Saying): \"I heard him say, when he finished the prayer: 'La Ilaha Illallah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir (There is none worthy of worship except Allah (ﷺ) alone with no partner or associate. He is the Dominion and to Him be all praise, and He is able to do all things) three times.\"",
      "chain": [
        "38146",
        "20468",
        "166",
        "20184",
        "20468",
        "11052"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، ومحمد بن منصور، - واللفظ له - عن سفيان، عن زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول قام النبي صلى الله عليه وسلم حتى تورمت قدماه فقيل له قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ziyad bin Ilaqah said:                     \"I heard Al-Mughirah bin Shu'bah say: 'The Prophet (ﷺ) stood (in prayer at night) until his feet swelled up, and it was said to him: Allah has forgiven your past and future sins. He said: \"Should I not be a thankful slave?'\"",
      "chain": [
        "30367",
        "36658",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1835",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأنبأنا قتيبة، قال حدثنا المغيرة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله تعالى إذا أحب عبدي لقائي أحببت لقاءه وإذا كره لقائي كرهت لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: Allah, the Most High, said: If My slave loves to meet Me, I love to meet him, and if he hates to meet Me, I hate to meet him.\"'",
      "chain": [
        "36017",
        "30234",
        "20001",
        "30367",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1942",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا عبد الواحد بن واصل، قال حدثنا سعيد بن عبيد الله، وأخوه المغيرة، جميعا عن زياد بن جبير، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu,bah said:                     \"The Messenger of Allah said: The riders should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"'",
      "chain": [
        "30249",
        "11629",
        "11285",
        "166"
      ]
    },
    {
      "hadith_no": "1943",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني أحمد بن بكار الحراني، قال حدثنا بشر بن السري، عن سعيد الثقفي، عن عمه، زياد بن جبير بن حية عن أبيه، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu'bah said:                     \"The Messenger of Allah said: \"The rider should travel behind the Janazah and the pedestrian may travel wherever he wishes, and the (funeral) prayer should be offered for a child.\"'",
      "chain": [
        "38007",
        "20190",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "1948",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا سعيد بن عبيد الله، قال سمعت زياد بن جبير، يحدث عن أبيه، عن المغيرة بن شعبة، أنه ذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that:                     the Messenger of Allah said: \"The rider should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"",
      "chain": [
        "34033",
        "20423",
        "11629",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "2232",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا أبو مصعب، عن المغيرة، عن عبد الله بن سعيد بن أبي هند، عن محمد بن إسحاق، عن سعيد بن أبي هند، قال دخل مطرف على عثمان نحوه مرسل ‏.‏",
      "text_en": " It was narrated that Saeed bin Abi Hind said:                     \"Mutarrif entered upon 'Uthman\" and he narrated something similar in Mursal from. Abu Hurairah said: \"The Messenger of Allah said: 'Fasting is a shield.\"' (Sahih",
      "chain": [
        "30100",
        "166",
        "11184",
        "11107",
        "11427"
      ]
    },
    {
      "hadith_no": "2958",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، وعثمان بن عمر، قالا حدثنا شعبة، عن المغيرة، عن الشعبي، عن المحرر بن أبي هريرة، عن أبيه، قال جئت مع علي بن أبي طالب حين بعثه رسول الله صلى الله عليه وسلم إلى أهل مكة ببراءة قال ‏\"‏ ما كنتم تنادون ‏\"‏ ‏.‏ قال كنا ننادي ‏\"‏ إنه لا يدخل الجنة إلا نفس مؤمنة ولا يطوف بالبيت عريان ومن كان بينه وبين رسول الله صلى الله عليه وسلم عهد فأجله أو أمده إلى أربعة أشهر فإذا مضت الأربعة أشهر فإن الله بريء من المشركين ورسوله ولا يحج بعد العام مشرك ‏\"‏ ‏.‏ فكنت أنادي حتى صحل صوتي ‏.‏",
      "text_en": " It was narrated from Muharrar bin Abi Hurairah that his father said:                     \"I came with Ali bin Abi Talib when the Messenger of Allah sent him to the people of Makkah with news of the dissolution of treaty obligations.\" He said: \"How did you announced that no one would enter Paradise but a believing soul, no one was to circumambulate the House naked: whoever had a treaty with the Messenger of Allah, then for its period, or, it extended to four months, and when four months had passed, and that Allah is free from (all) obligations to the idolaters and so is His Messenger. No idolater was to perform Hajj after this year. I kept on announcing it until my vice grew hoarse.\"",
      "chain": [
        "30160",
        "20278",
        "20262",
        "20020",
        "166",
        "11052",
        "12496",
        "13"
      ]
    },
    {
      "hadith_no": "3235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن أبي رزمة، قال حدثنا حفص بن غياث، قال حدثنا عاصم، عن بكر بن عبد الله المزني، عن المغيرة بن شعبة، قال خطبت امرأة على عهد رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أنظرت إليها ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ فانظر إليها فإنه أجدر أن يؤدم بينكما ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     It was narrated that Al-Mughirah bin Shu'bah said: \"I proposed marriage to a woman during the time of the Messenger of Allah, and the Prophet said: 'Have you seen her?' I said: 'No.' He said: 'Look at her, for that is more likely to create love between you.'\"",
      "chain": [
        "30379",
        "20317",
        "11080",
        "11267",
        "166"
      ]
    },
    {
      "hadith_no": "4673",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن المغيرة، قال سمعت ابن أبي نعم، قال سمعت أبا هريرة، يقول نهى رسول الله صلى الله عليه وسلم عن كسب الحجام وعن ثمن الكلب وعن عسب الفحل ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah forbade the earnings of a cupper, the price of a dog and stud fees for a stallion.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "166",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4821",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا علي بن محمد بن علي، قال حدثنا خلف، - وهو ابن تميم - قال حدثنا زائدة، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، أن امرأة، ضربت ضرتها بعمود فسطاط فقتلتها وهي حبلى فأتي فيها النبي صلى الله عليه وسلم فقضى رسول الله صلى الله عليه وسلم على عصبة القاتلة بالدية وفي الجنين غرة ‏.‏ فقال عصبتها أدي من لا طعم ولا شرب ولا صاح فاستهل فمثل هذا يطل فقال النبي صلى الله عليه وسلم ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that:                     a woman struck her co-wife with a tent pole and killed her, and she (the slain woman) was pregnant. She was brought to the Prophet, and the Messenger of Allah ruled that the 'Asabah of the killer should pay the Diyah , and a slavae (should be paid) for the fetus. Her 'Asabah said: \"Should Diyah be paid for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The prophet said: \"Rhyming verse like the verse of the Bedouins.\"",
      "chain": [
        "38409",
        "25082",
        "20320",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4822",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن منصور، عن إبراهيم، عن عبيد بن نضيلة الخزاعي، عن المغيرة بن شعبة، قال ضربت امرأة ضرتها بعمود الفسطاط وهي حبلى فقتلتها فجعل رسول الله صلى الله عليه وسلم دية المقتولة على عصبة القاتلة وغرة لما في بطنها ‏.‏ فقال رجل من عصبة القاتلة أنغرم دية من لا أكل ولا شرب ولا استهل فمثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ فجعل عليهم الدية ‏.‏",
      "text_en": " It was narrated that Al-Mughirah bin Shu'bah said:                     \"A woman struck her co-wife, who was pregnant, with a tent pole and Killed her, The Messenger of Allah ruled that the 'Asahab of the Killer was to pay the Diyah and to give a slave (as Diyah for ) the child in her womb. One of the'Asabah of the killer said: 'Am I to pay blood money for one whom neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked. The Messenger of Allah said: 'Rhyming verse like the verse of the Bedouin?' and he made them pay the Diyah",
      "chain": [
        "20028",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4823",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، أن ضرتين، ضربت إحداهما الأخرى بعمود فسطاط فقتلتها فقضى رسول الله صلى الله عليه وسلم بالدية على عصبة القاتلة وقضى لما في بطنها بغرة ‏.‏ فقال الأعرابي تغرمني من لا أكل ولا شرب ولا صاح فاستهل فمثل ذلك يطل فقال ‏\"‏ سجع كسجع الجاهلية ‏\"‏ ‏.‏ وقضى لما في بطنها بغرة ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin shu'bah that:                     there were two co-wives, one of whom struck the other with a tent people and killed her. The Messenger of Allah ruled that the Diyah was to be paid by the 'Asabah of the killer, and that a slave should be given (as diyah) for the child in her womb. The Bedouin Said: \"Are you penalizing me for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked/\" He said: \"Rhyming verse like the verse of the Jahiliyyah,\" and he ruled that a slave should e given (as Diyah) for the child in her womb.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4824",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا يحيى بن أبي زائدة، عن إسرائيل، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، قال ضربت امرأة من بني لحيان ضرتها بعمود الفسطاط فقتلتها وكان بالمقتولة حمل فقضى رسول الله صلى الله عليه وسلم على عصبة القاتلة بالدية ولما في بطنها بغرة ‏.‏",
      "text_en": " It was narrated that Al-Muhgirah bin Shu'bah said:                     \"A woman of Banu Lihyan struck her co-wife with a tent pole and killed her, and the slain woman was pregnant. The Messenger of Allah ruled that the Diyah was to be paid by the'Asbah of the killer, and that a slave should be given (as Diyah) for the child in her womb\".",
      "chain": [
        "35093",
        "20366",
        "20311",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4825",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن شعبة، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، أن امرأتين، كانتا تحت رجل من هذيل فرمت إحداهما الأخرى بعمود فسطاط فأسقطت فاختصما إلى النبي صلى الله عليه وسلم فقالوا كيف ندي من لا صاح ولا استهل ولا شرب ولا أكل فقال النبي صلى الله عليه وسلم ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ فقضى بالغرة على عاقلة المرأة ‏.‏",
      "text_en": " It was narrated from Al-Muhgirah b in Shu'bad that:                     two woman were married to a man of Hudhail, and one of them threw tent pole at the other and caused her to miscarry. They referred the dispute to the Prophet and they said: \"how can we pay the Diyah for one who neither shouted nor cried (at the moment of birth), or ate or drank? Such a one should be overlooked.\" He said: \"Rhyming verse like the verse of the Bedouins?\" And the ruled that the 'Aqilah of the women should give a slave 9asdiyah).",
      "chain": [
        "38265",
        "20025",
        "20020",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال حدثنا شعبة، عن منصور، قال سمعت إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، أن رجلا، من هذيل كان له امرأتان فرمت إحداهما الأخرى بعمود الفسطاط فأسقطت فقيل أرأيت من لا أكل ولا شرب ولا صاح فاستهل ‏.‏ فقال ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ فقضى فيه رسول الله صلى الله عليه وسلم بغرة عبد أو أمة وجعلت على عاقلة المرأة ‏.‏ أرسله الأعمش ‏.‏",
      "text_en": " It was narrated form Al-Mughirahbin shu'bah that:                     a man of Hudhail had two wives, and one of them threw a  tent pole at the o0ther and caused her to miscarry. It was said: \"What do you think of one who neither ate nor drank, or shouted nor cried (at the moment of birth)?\" he said: (Rhyming verse like the verse of the Bedouins. \"And the Messenger of Allah ruled that a make or female slave shouted be given (as dihahj) for him (the unborn child), to be paid but the'Aqila h of the woman.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن حبيب بن أبي ثابت، عن ميمون بن أبي شبيب، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من حدث عني بحديث وهو يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     The Messenger of Allah (ﷺ) said: '\"Whoever narrates a Hadith from me thinking it to be false, then he is one of the two liars.\"",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11331",
        "10834",
        "166"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا أبو داود، حدثنا شعبة، عن عاصم، عن أبي وائل، عن المغيرة بن شعبة، أن رسول الله  صلى الله عليه وسلم  أتى سباطة قوم فبال قائما ‏.‏",
      "text_en": " Shu'bah narrated from 'Asim from Abu Wa'il from Mughirah bin Shu'bah that:                     The Messenger of Allah came to the garbage dump of some people and urinated while standing up. (Hasan)Shu'bah said: \"That day, 'Asim said: 'Amash reported this from Abu Wa'il, from Hudhaifah, but he did not remember it (correctly). So I asked Mansur about it, and he narrated it to me from Abu Wa'il, from Hudhaifah, that the Prophet came to a dump of some people and urinated while standing.'\"",
      "chain": [
        "30313",
        "20547",
        "20020",
        "11080",
        "11353",
        "166"
      ]
    },
    {
      "hadith_no": "355",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن محمد بن عمرو، عن أبي سلمة، عن المغيرة بن شعبة، قال كان النبي  صلى الله عليه وسلم  إذا ذهب المذهب أبعد ‏.‏",
      "text_en": " It was narrated that Mugirah bin Shu'bah said:                     \"Whenever the Prophet went to relieve himself, he would go far away.\"",
      "chain": [
        "30201",
        "20208",
        "11220",
        "10567",
        "166"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، حدثنا الأعمش، عن مسلم بن صبيح، عن مسروق، عن المغيرة بن شعبة، قال خرج النبي  صلى الله عليه وسلم  لبعض حاجته فلما رجع تلقيته بالإداوة فصببت عليه فغسل يديه ثم غسل وجهه ثم ذهب يغسل ذراعيه فضاقت الجبة فأخرجهما من تحت الجبة فغسلهما ومسح على خفيه ثم صلى بنا ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     \"The Prophet went out to relieve himself and when he came back, I met him with a water skin and poured water for him. He washed his hands and his face, then he went to wash his forearms but his garment was too tight, so he brought his arms out from underneath his garment and washed them, then he wiped over his leather socks, then he led us in prayer.\"",
      "chain": [
        "30288",
        "20347",
        "11060",
        "11392",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "593",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا ثور بن يزيد، عن رجاء بن حيوة، عن وراد، كاتب المغيرة بن شعبة عن المغيرة بن شعبة، أن رسول الله  صلى الله عليه وسلم  مسح أعلى الخف وأسفله ‏.‏",
      "text_en": " It was narrated from Mughirah bin Shu'bah that:                     The Messenger of Allah wiped over the top and the bottom of the leather socks.",
      "chain": [
        "30288",
        "20733",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "hadith_no": "602",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبي قيس الأودي، عن الهزيل بن شرحبيل، عن المغيرة بن شعبة، أن رسول الله  صلى الله عليه وسلم  توضأ ومسح على الجوربين والنعلين ‏.‏",
      "text_en": " It was narrated from Mughirah bin Shu'bah that:                     The Messenger of Allah performed ablution and wiped over his socks and his sandals.",
      "chain": [
        "38409",
        "20032",
        "20012",
        "166"
      ]
    },
    {
      "hadith_no": "680",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن بيان، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال كنا نصلي مع رسول الله  صلى الله عليه وسلم  صلاة الظهر بالهاجرة فقال لنا ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     We were praying Zuhr with the Messenger of Allah at the time of intense heat (i.e., midday when the sun has just passed its zenith) and he said to us, \"Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.\"",
      "chain": [
        "20411",
        "20587",
        "11326",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن جابر، عن المغيرة بن شبيل، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قام أحدكم من الركعتين فلم يستتم قائما فليجلس فإذا استتم قائما فلا يجلس ويسجد سجدتى السهو ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mughirah bin Shu’bah said:                      “The Messenger ofAllah(ﷺ) said: ‘If anyone of you stands after two Rak’ah, if he hasnot yet stood up fully, let him sit down again, but if he has stoodupfully, then let him not sit down, and let him perform twoprostrationsfor forgetfulness (Sahw).’”",
      "chain": [
        "11222",
        "30388",
        "20005",
        "34",
        "19880",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "1484",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن زياد بن علاقة، سمع المغيرة، يقول قام رسول الله  صلى الله عليه وسلم  حتى تورمت قدماه ‏.‏ فقيل يا رسول الله قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ziyad bin ‘Ilaqah that he heard Mughirah say:                      “TheMessenger of Allah (ﷺ) stood (in prayer) until his feet becameswollen. It was said: ‘O Messenger of Allah, Allah has forgiven youyour past and future sins.’ He said: ‘Should I not be a thankfulslave?’”",
      "chain": [
        "30288",
        "20005",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1494",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا قتيبة، حدثنا ابن وهب، عن عثمان بن عطاء، عن أبيه، عن المغيرة بن شعبة، ‏.‏ أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يصلي الإمام في مقامه الذي صلى فيه المكتوبة حتى يتنحى عنه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Al-Mughirah bin Shu’bah that the Messenger ofAllah(ﷺ) said:                      “The Imam should not pray in the place where heofferedthe obligatory prayer, until he moves aside.”",
      "chain": [
        "11222",
        "30367",
        "20029",
        "166"
      ]
    },
    {
      "hadith_no": "1495",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية، عن أبي عبد الرحمن التميمي، عن عثمان بن عطاء، عن أبيه، عن المغيرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "38462",
        "20644",
        "11359",
        "3690",
        "166"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا روح بن عبادة، حدثنا سعيد بن عبيد الله بن جبير بن حية، حدثني زياد بن جبير بن حية، سمع المغيرة بن شعبة، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الراكب خلف الجنازة والماشي منها حيث شاء ‏\"‏ ‏.‏",
      "text_en": " Al-Mughirah bin Shu’bah said:                      “I heard the Messenger of Allah(ﷺ)say: ‘The rider should travel behind the funeral (procession)but theone who is walking may walk wherever he wants.”",
      "chain": [
        "30160",
        "20229",
        "11629",
        "11285",
        "166"
      ]
    },
    {
      "hadith_no": "1574",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا روح بن عبادة، قال حدثنا سعيد بن عبيد الله بن جبير بن حية، حدثني عمي، زياد بن جبير حدثني أبي جبير بن حية، أنه سمع المغيرة بن شعبة، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " AbuJubair bin Hayyah narrated that he heard Mughirah bin Shu’bahsay:                     “I heard the Messenger of Allah (ﷺ) say: ‘The (funeral) prayershould be offered for a child.’”",
      "chain": [
        "30160",
        "20229",
        "11629",
        "166"
      ]
    },
    {
      "hadith_no": "1938",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي الخلال، وزهير بن محمد، ومحمد بن عبد الملك، قالوا حدثنا عبد الرزاق، عن معمر، عن ثابت، عن أنس بن مالك، أن المغيرة بن شعبة، أراد أن يتزوج، امرأة فقال له النبي  صلى الله عليه وسلم  ‏\"‏ اذهب فانظر إليها فإنه أحرى أن يؤدم بينكما ‏\"‏ ‏.‏ ففعل فتزوجها فذكر من موافقتها ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     Mughirah bin Shubah wanted to marry a woman. The Prophet (ﷺ) said to him: “Go and look at her, for that is more likely to create love between you.” So he did that, and married her, and mentioned how well he got along with her.",
      "chain": [
        "30115",
        "20394",
        "20121",
        "20115",
        "11269",
        "19",
        "166"
      ]
    },
    {
      "hadith_no": "1939",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن أبي الربيع، أنبأنا عبد الرزاق، عن معمر، عن ثابت البناني، عن بكر بن عبد الله المزني، عن المغيرة بن شعبة، قال أتيت النبي  صلى الله عليه وسلم  فذكرت له امرأة أخطبها فقال ‏\"‏ اذهب فانظر إليها فإنه أجدر أن يؤدم بينكما ‏\"‏ ‏.‏ فأتيت امرأة من الأنصار فخطبتها إلى أبويها وأخبرتهما بقول النبي  صلى الله عليه وسلم  ‏.‏ فكأنهما كرها ذلك ‏.‏ قال فسمعت ذلك المرأة وهي في خدرها فقالت إن كان رسول الله  صلى الله عليه وسلم  أمرك أن تنظر فانظر ‏.‏ وإلا فإني أنشدك كأنها أعظمت ذلك ‏.‏ قال فنظرت إليها فتزوجتها ‏.‏ فذكر من موافقتها ‏.‏",
      "text_en": " It was narrated that:                     Mughirah bin Shubah said: “I came to the Prophet and told him of a woman to whom I had to propose marriage. He said: 'Go and look at her, for that is more likely to create love between you.' So I went to a woman among the Ansar and proposed marriage through her parents. I told them what the Prophet had said, and it was as if they did not like that. Then I heard that woman, behind her curtain, say: 'If the Messenger of Allah has told you to do that, then do it, otherwise I adjure you by Allah (not to do so)'. And it was as if she regarded that as a serious matter. So I looked at her and married her.” And he mentioned how well he got along with her.",
      "chain": [
        "20121",
        "20115",
        "11269",
        "11267",
        "166"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا أبي، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، قال قضى رسول الله صلى الله عليه وسلم بالدية على العاقلة ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     “The Messenger of Allah (ﷺ) ruled that the blood money must be paid by the 'Aqilah.”",
      "chain": [
        "38409",
        "20032",
        "20645",
        "11067",
        "11051",
        "10798",
        "166"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا شريك، عن عبد الملك بن عمير، عن حصين بن قبيصة، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا سفيان بن سهل لا تسبل فإن الله لا يحب المسبلين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Mughirah bin Shu’bah that the Messenger of Allah(ﷺ) said:                      “O Sufyan bin Sahl, do not let your garment hang, forAllah does not like those who let their garments hang below theankles.’”",
      "chain": [
        "30201",
        "20472",
        "20587",
        "11368",
        "15100",
        "166"
      ]
    },
    {
      "hadith_no": "4211",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا وكيع، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال ما سأل أحد النبي  صلى الله عليه وسلم  عن الدجال أكثر مما سألته - وقال ابن نمير أشد سؤالا مني - فقال لي ‏\"‏ ما تسأل عنه ‏\"‏ ‏.‏ قلت إنهم يقولون إن معه الطعام والشراب قال ‏\"‏ هو أهون على الله من ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                      \"No one askedtheProphet (ﷺ) about Dajjal more than I did.\" (One of thenarrators)Ibn Numair said (in his version): \"(No one asked)more difficultquestions than I did.\" - \"He said to me:'What are you asking abouthim?' I said: 'They say he will have foodand drink with him.' Hesaid: 'He is too insignificant before Allahfor that.'\"",
      "chain": [
        "30212",
        "38409",
        "20032",
        "11418",
        "11046",
        "166"
      ]
    }
  ],
  "total_hadiths": 147
}