{
  "id": "167",
  "name": "Muhammad Ibn Maslama ( محمد بن مسلمة بن سلمة ( رضي الله عنه",
  "full_name": "Muhammad Ibn Maslama ( محمد بن مسلمة بن سلمة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "46",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "Ally B.'Abdul Ashhal",
      "B.Haritha",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1860",
      "name": "Umm 'Amr bint Salaama bin Waqash ( أم عمرو بنت سلامة بن وقش ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "622",
      "name": "'Amra bint Mas'ud bin Aws ( عمرة بنت مسعود بن أوس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "1810",
      "name": "Mahmud ibn Maslama ( محمود بن مسلمة بن سلمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1953",
      "name": "Umm 'Abs bint Maslama ( أم عبيس بنت مسلمة الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "1825",
      "name": "'Abdur Rahman bin Muhammad Ibn Maslama ( عبد الرحمن بن محمد بن مسلمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1826",
      "name": "'Abdullah bin Muhammad Ibn Maslama ( عبد الله بن محمد بن مسلمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1827",
      "name": "Jafar bin Muhammad Ibn Maslama ( جعفر بن محمد بن مسلمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1828",
      "name": "Sa'd bin Muhammad Ibn Maslama ( سعد بن محمد بن مسلمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1829",
      "name": "Zayd bin Muhammad Ibn Maslama ( زيد بن محمد بن مسلمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "2201",
      "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1822",
      "name": "Sahl bin Abi Hathma ( سهل بن أبى حثمة الحارثى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5232",
      "name": "Qubaysa bin Zuwayb ( قبيصة بن ذؤيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11197",
      "name": "'Abdur Rahman bin Harmaz al-A'araj عبد الرحمن بن هرمز الأعرج أبو داود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18448",
      "name": "Dabay'a bin Husain ضبيعة بن حصين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7326",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "وقال إبراهيم بن المنذر حدثنا معن، حدثني محمد بن مسلم، عن عمرو، عن عطاء، عن ابن عباس، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "30308",
        "30112",
        "167",
        "11439",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2652",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن منصور، عن محمد بن مسلم الزهري، بهذا الإسناد ‏.‏ مثل رواية ابن عيينة وقال بعرق فيه تمر - وهو الزنبيل - ولم يذكر فضحك النبي صلى الله عليه وسلم حتى بدت أنيابه ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Mubammad b. Muslim al-Zuhri with the same chain of transmitters, and he said:                      There was brought an 'araq containing dates, an 'araq being a huge basket. But in this hadith no men- tion has been made of (the fact) that the Apostle of Allah (may peace be upon him) laughed till his molar teeth became visible.",
      "chain": [
        "30123",
        "20028",
        "11067",
        "167"
      ]
    },
    {
      "hadith_no": "3658",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت عبد الله بن مسلم، يقول سمعت محمد بن مسلم، يقول سمعت حميد بن عبد الرحمن، يقول سمعت أم سلمة، زوج النبي صلى الله عليه وسلم تقول قيل لرسول الله صلى الله عليه وسلم أين أنت يا رسول الله عن ابنة حمزة ‏.‏ أو قيل ألا تخطب بنت حمزة بن عبد المطلب قال ‏\"‏ إن حمزة أخي من الرضاعة ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with her), the wife of Allah's Apostle (may peace be upon him), said:                      It was said to the Messenger of Allah (may peace be upon him): Is not the daughter of Hamza a suitable match for you? Or it was said: Why don't you propose to marry the daughter of Hamza, the son of Abd al-Muttalib? Thereupon he said: Hamza is my brother by reason of fosterage.",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "11872",
        "167",
        "10561"
      ]
    },
    {
      "hadith_no": "6800",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عمرو الناقد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، حدثنا محمد بن مسلم بن عبيد الله بن عبد الله بن شهاب، بهذا الإسناد ‏.‏ مثله غير أنفي حديث صالح وقالت ولم أسمعه يرخص في شىء مما يقول الناس إلا في ثلاث ‏.‏ بمثل ما جعله يونس من قول ابن شهاب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30263",
        "20184",
        "20150",
        "11176",
        "167"
      ]
    },
    {
      "hadith_no": "669",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن مصعب بن ثابت بن عبد الله بن الزبير، عن محمد بن مسلم بن السائب، صاحب المقصورة قال صليت إلى جنب أنس بن مالك يوما فقال هل تدري لم صنع هذا العود فقلت لا والله ‏.‏ قال كان رسول الله صلى الله عليه وسلم يضع يده عليه فيقول ‏\"‏ استووا وعدلوا صفوفكم ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Muslim b. al-Sa’ib said:                      one day I prayed by the side of Anas b. Malik. He said ; Do you know why this stick is placed here ? I said : No, by Allah. He said; The Messenger of Allah (ﷺ) used to put his hand upon it and say: Keep straight and straighten your rows.",
      "chain": [
        "30367",
        "20159",
        "28564",
        "167"
      ]
    },
    {
      "hadith_no": "670",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا حميد بن الأسود، حدثنا مصعب بن ثابت، عن محمد بن مسلم، عن أنس، بهذا الحديث قال إن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة أخذه بيمينه ثم التفت فقال ‏\"‏ اعتدلوا سووا صفوفكم ‏\"‏ ‏.‏ ثم أخذه بيساره فقال ‏\"‏ اعتدلوا سووا صفوفكم ‏\"‏ ‏.‏",
      "text_en": " This tradition has also ben transmitted by Anas through a different chain of transmitters. This version goes:                      when the Messenger of Allah (ﷺ) stood for prayer, he took it (the stick) in his right hand and turning (to the right side) said; keep straight and straighten your rows. He then took it in his left hand and said; keep straight and straighten your rows.",
      "chain": [
        "30175",
        "20225",
        "28564",
        "167",
        "19"
      ]
    },
    {
      "hadith_no": "1031",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا يعقوب، حدثنا ابن أخي الزهري، عن محمد بن مسلم، بهذا الحديث بإسناده زاد ‏\"‏ وهو جالس قبل التسليم ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by Muhammad b. Muslim through a different chain of narrators. This version adds; “While he is sitting before he gives the salutation.”",
      "chain": [
        "20184",
        "167"
      ]
    },
    {
      "hadith_no": "1032",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حجاج، حدثنا يعقوب، أخبرنا أبي، عن ابن إسحاق، حدثني محمد بن مسلم الزهري، بإسناده ومعناه قال ‏\"‏ فليسجد سجدتين قبل أن يسلم ثم ليسلم ‏\"‏ ‏.‏",
      "text_en": " This traditions has also been narrated by Muhammad b. Muslim al-Zuhr through a different chain of transmitters and to the same effect. This version adds; He should perform two prostrations before giving the salutation.",
      "chain": [
        "20219",
        "20184",
        "20150",
        "11107",
        "167"
      ]
    },
    {
      "hadith_no": "2272",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثني يونس بن يزيد، قال قال محمد بن مسلم بن شهاب أخبرني عروة بن الزبير، أن عائشة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم أخبرته أن النكاح كان في الجاهلية على أربعة أنحاء فنكاح منها نكاح الناس اليوم يخطب الرجل إلى الرجل وليته فيصدقها ثم ينكحها ونكاح آخر كان الرجل يقول لامرأته إذا طهرت من طمثها أرسلي إلى فلان فاستبضعي منه ويعتزلها زوجها ولا يمسها أبدا حتى يتبين حملها من ذلك الرجل الذي تستبضع منه فإذا تبين حملها أصابها زوجها إن أحب وإنما يفعل ذلك رغبة في نجابة الولد فكان هذا النكاح يسمى نكاح الاستبضاع ونكاح آخر يجتمع الرهط دون العشرة فيدخلون على المرأة كلهم يصيبها فإذا حملت ووضعت ومر ليال بعد أن تضع حملها أرسلت إليهم فلم يستطع رجل منهم أن يمتنع حتى يجتمعوا عندها فتقول لهم قد عرفتم الذي كان من أمركم وقد ولدت وهو ابنك يا فلان فتسمي من أحبت منهم باسمه فيلحق به ولدها ونكاح رابع يجتمع الناس الكثير فيدخلون على المرأة لا تمتنع ممن جاءها وهن البغايا كن ينصبن على أبوابهن رايات يكن علما لمن أرادهن دخل عليهن فإذا حملت فوضعت حملها جمعوا لها ودعوا لهم القافة ثم ألحقوا ولدها بالذي يرون فالتاطه ودعي ابنه لا يمتنع من ذلك فلما بعث الله محمدا صلى الله عليه وسلم هدم نكاح أهل الجاهلية كله إلا نكاح أهل الإسلام اليوم ‏.‏",
      "text_en": " A’ishah wife of the Prophet (ﷺ) said “Marriage in pre Islamic times was of four kinds.” One of them was the marriage contracted by the people today. A man asked another man to marry his relative (sister or daughter) to him. He fixed the dower and married her to him. Another kind of marriage was that a man asked his wife when she became pure from menstruation to send fro so and so and have sexual intercourse with him. Her husband kept himself aloof and did not have intercourse with her till It became apparent that she was pregnant from the man who had intercourse with her. When it was manifest that she was pregnant, her husband approached her if he liked. This marriage was called istibda’(to utilize man for intercourse for a noble birth). A third kind of marriage was that a group of people less than ten in number entered upon a woman and had intercourse with her. When she conceived gave birth to a child and a number of days passed after her delivery, she sent for them. No one of them could refuse to attend and they gathered before her. She said to them “You have realized your affair. I have now given birth to a child. And this is your son.  O so and so. She called the name of anyone of them she liked and the child was attributed to him. A fourth kind of marriage was that many people gathered together and entered upon a woman who did not prevent anyone who came to her. They were prostitutes. They hoisted flags at their doors which served as a sign for the one who intended to enter upon them. When she became pregnant and delivered the child , they got together before her and called for the experts of tracing relationship from physical features. They attributed the child to whom they considered and it was given to him. The child was called his son and he could not deny. When Allah sent Muhammad (ﷺ) as a Prophet, he abolished all kinds of marriages prevalent among the people of the pre Islamic times except of the Muslims practiced today.",
      "chain": [
        "30226",
        "20451",
        "20475",
        "167",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2914",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا موسى بن داود، حدثنا محمد بن مسلم، عن عمرو بن دينار، عن أبي الشعثاء، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ كل قسم قسم في الجاهلية فهو على ما قسم له وكل قسم أدركه الإسلام فهو على قسم الإسلام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: An estate which was divided in pre-Islamic period may follow the division in force then, but any estate in Islamic times must follow the division laid down by Islam.",
      "chain": [
        "20636",
        "167",
        "11081",
        "11351",
        "17"
      ]
    },
    {
      "hadith_no": "3164",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا أبو نعيم، عن محمد بن مسلم، عن عمرو بن دينار، أخبرني جابر بن عبد الله، - أو سمعت جابر بن عبد الله، - قال رأى ناس نارا في المقبرة فأتوها فإذا رسول الله صلى الله عليه وسلم في القبر وإذا هو يقول ‏\"‏ ناولوني صاحبكم ‏\"‏ ‏.‏ فإذا هو الرجل الذي كان يرفع صوته بالذكر ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The people saw fire (light) in the graveyard and they went there. They found that the Messenger of Allah (ﷺ) was in a grave and he was saying: Give me your companion. This was a man who used to raise his voice while mentioning the name of Allah.",
      "chain": [
        "30163",
        "20348",
        "167",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، وسلمة بن شبيب، قالا حدثنا عبد الرزاق، أخبرنا محمد بن مسلم، عن عمرو بن دينار، بإسناده ومعناه ‏.‏ قال سلمة في حديثه قال عمرو في الحقوق ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Amr bin Dinar through a different chain of narrators and to the same effect. Salamah has in his version:                      'Amr said: In the rights (of the people).",
      "chain": [
        "11222",
        "30417",
        "20121",
        "167",
        "11081"
      ]
    },
    {
      "hadith_no": "4450",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال حدثنا رجل، من مزينة ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، قال قال محمد بن مسلم سمعت رجلا، من مزينة ممن يتبع العلم ويعيه - ثم اتفقا - ونحن عند سعيد بن المسيب فحدثنا عن أبي هريرة - وهذا حديث معمر وهو أتم - قال زنى رجل من اليهود وامرأة فقال بعضهم لبعض اذهبوا بنا إلى هذا النبي فإنه نبي بعث بالتخفيف فإن أفتانا بفتيا دون الرجم قبلناها واحتججنا بها عند الله قلنا فتيا نبي من أنبيائك - قال - فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه فقالوا يا أبا القاسم ما ترى في رجل وامرأة زنيا فلم يكلمهم كلمة حتى أتى بيت مدراسهم فقام على الباب فقال ‏\"‏ أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن ‏\"‏ ‏.‏ قالوا يحمم ويجبه ويجلد - والتجبية أن يحمل الزانيان على حمار وتقابل أقفيتهما ويطاف بهما - قال وسكت شاب منهم فلما رآه النبي صلى الله عليه وسلم سكت ألظ به النشدة فقال اللهم إذ نشدتنا فإنا نجد في التوراة الرجم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فما أول ما ارتخصتم أمر الله ‏\"‏ ‏.‏ قال زنى ذو قرابة مع ملك من ملوكنا فأخر عنه الرجم ثم زنى رجل في أسرة من الناس فأراد رجمه فحال قومه دونه وقالوا لا يرجم صاحبنا حتى تجيء بصاحبك فترجمه فاصطلحوا على هذه العقوبة بينهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فإني أحكم بما في التوراة ‏\"‏ ‏.‏ فأمر بهما فرجما ‏.‏ قال الزهري فبلغنا أن هذه الآية نزلت فيهم ‏{‏ إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا ‏}‏ كان النبي صلى الله عليه وسلم منهم ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     (This is Ma'mar's version which is more accurate.) A man and a woman of the Jews committed fornication.  Some of them said to the others: Let us go to this Prophet, for he has been sent with an easy law. If he gives a judgment lighter than stoning, we shall accept it, and argue about it with Allah, saying: It is a judgment of one of your prophets. So they came to the Prophet (ﷺ) who was sitting in the mosque among his companions.  They said: AbulQasim, what do you think about a man and a woman who committed fornication? He did not speak to them a word till he went to their school.  He stood at the gate and said: I adjure you by Allah Who revealed the Torah to Moses, what (punishment) do you find in the Torah for a person who commits fornication, if he is married?  They said: He shall be blackened with charcoal, taken round a donkey among the people, and flogged. A young man among them kept silent.  When the Prophet (ﷺ) emphatically adjured him, he said: By Allah, since you have adjured us (we inform you that) we find stoning in the Torah (is the punishment for fornication).  The Prophet (ﷺ) said: So when did you lessen the severity of Allah's command? He said:  A relative of one of our kings had committed fornication, but his stoning was suspended. Then a man of a family of common people committed fornication. He was to have been stoned, but his people intervened and said: Our man shall not be stoned until you bring your man and stone him. So they made a compromise on this punishment between them.  The Prophet (ﷺ) said: So I decide in accordance with what the Torah says. He then commanded regarding them and they were stoned to death.  Az-Zuhri said: We have been informed that this verse was revealed about them: \"It was We Who revealed the Law (to Moses): therein was guidance and light. By its standard have been judged the Jews, by the Prophet who bowed (as in Islam) to Allah's will.",
      "chain": [
        "11222",
        "20121",
        "20115",
        "11013",
        "30226",
        "11716",
        "20475",
        "167",
        "13"
      ]
    },
    {
      "hadith_no": "4546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا زيد بن الحباب، عن محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، من بني عدي قتل فجعل النبي صلى الله عليه وسلم ديته اثنى عشر ألفا ‏.‏ قال أبو داود رواه ابن عيينة عن عمرو عن عكرمة عن النبي صلى الله عليه وسلم لم يذكر ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man of Banu Adi was killed. The Prophet (ﷺ) fixed his blood-wit at the rate of twelve thousand (dirhams).Abu Dawud said: Ibn 'Uyainah transmitted it from 'Amr, from 'Ikrimah, from the Prophet (ﷺ), and he did not mention Ibn 'Abbas.",
      "chain": [
        "31160",
        "20650",
        "167",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، ومحمود بن غيلان، وأحمد بن إبراهيم الدورقي، وغير، واحد، قالوا حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن مهران، سمع جده، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ رحم الله امرأ صلى قبل العصر أربعا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب حسن ‏.‏",
      "text_en": " Ibn Umar narrated that :                     The Prophet (S) said: \"May Allah have mercy upon a man who prays four before Al-Asr.\"",
      "chain": [
        "30221",
        "30277",
        "30494",
        "20547",
        "167",
        "18"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن أبي الوضاح، هو أبو سعيد المؤدب عن عبد الكريم الجزري، عن مجاهد، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم كان يصلي أربعا بعد أن تزول الشمس قبل الظهر وقال ‏\"‏ إنها ساعة تفتح فيها أبواب السماء وأحب أن يصعد لي فيها عمل صالح ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي أيوب ‏.‏ قال أبو عيسى حديث عبد الله بن السائب حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي أربع ركعات بعد الزوال لا يسلم إلا في آخرهن ‏.‏",
      "text_en": " Abdullah bin As-Sa'ib narrated:                     \"Allah's Messenger would pray four (Rak'ah) after the Zawal of the sun before Az-Zuhr. He said: 'It is an hour in which the gates of the heavens are opened, and I love that a righteous deed should be raised up for me in it.'\"",
      "chain": [
        "20547",
        "167",
        "18655",
        "11028",
        "2065"
      ]
    },
    {
      "hadith_no": "174",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا إسحاق بن بكر، - وهو ابن مضر - قال حدثني أبي، عن جعفر بن ربيعة، عن بكر بن سوادة، عن محمد بن مسلم، عن عمر بن عبد العزيز، عن عبد الله بن إبراهيم بن قارظ، قال رأيت أبا هريرة يتوضأ على ظهر المسجد فقال أكلت أثوار أقط فتوضأت منها إني سمعت رسول الله صلى الله عليه وسلم يأمر بالوضوء مما مست النار ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ibrahim bin Qariz said:                      \"I saw Abu Hurairah performing Wudu' on the roof of the Masjid ans he said: 'I ate some tough cheese, so I performed Wudu' because of that. I heard the Messenger of Allah (ﷺ) commanding us to do Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11407",
        "10849",
        "167",
        "11010",
        "10888"
      ]
    },
    {
      "hadith_no": "182",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر بن مضر، قال حدثني بكر بن مضر، عن جعفر بن ربيعة، عن بكر بن سوادة، عن محمد بن مسلم بن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي سفيان بن سعيد بن الأخنس، أن أم حبيبة، زوج النبي صلى الله عليه وسلم قالت له وشرب سويقا يا ابن أختي توضأ فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sufyan bin Sa'eed bin Al-Akhnas that Umm Habibah, the wife of the Prophet (ﷺ), said to him, when he had drunk some Sawiq:                      \"O son of my sister, perform Wudu', for I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11407",
        "10849",
        "167",
        "10567"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يحيى بن عثمان الحمصي، قال حدثنا ابن حمير، قال حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، وذكر، آخر قبله عن عبد الرحمن بن هرمز الأعرج، عن محمد بن مسلمة، أن رسول الله صلى الله عليه وسلم كان إذا قام يصلي تطوعا قال ‏\"‏ الله أكبر وجهت وجهي للذي فطر السموات والأرض حنيفا مسلما وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين اللهم أنت الملك لا إله إلا أنت سبحانك وبحمدك ‏\"‏ ‏.‏ ثم يقرأ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Maslamah that:                     When the Messenger of Allah (ﷺ) stood to offer a voluntary prayer he would say: \" Allahu Akbar Wajahtu wajhi lilladhi fataras-samawatiwal-arda hanifan musliman wa ma ana minal-mushrikin. Inna salati wa nusuki wa mahyaya wa mamati lillahi rabbil-alamin, la sharika lahu, wa bidhalika umirtu wa ana awwalul-muslimin. Allahumma antal-maliku la ilaha illa anta subhanaka wa bihamdik (Allah is Most Great. Verily, I have turned my face toward Him who created the Heavens and the Earth hanifa (worhsipping none but Allah Alone), as a Muslim, and I am not of the idolaters. Verily, my Salah, my sacrifice, my living, and my dying are for Allah, the Lord of the all that exists. He has no partner. And of this I have been commanded, and I am the first of the Muslims. O Allah, You are the Sovereign and there is none worthy of worship but You, glory and praise be to You.)\" Then he would recite.",
      "chain": [
        "20428",
        "11048",
        "11197",
        "167"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يحيى بن عثمان، قال حدثنا ابن حمير، قال حدثنا شعيب، عن محمد بن المنكدر، وذكر، آخر قبله عن عبد الرحمن الأعرج، عن محمد بن مسلمة، أن رسول الله صلى الله عليه وسلم كان إذا قام يصلي تطوعا يقول إذا ركع ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت وعليك توكلت أنت ربي خشع سمعي وبصري ولحمي ودمي ومخي وعصبي لله رب العالمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Maslamah that:                     When the Messenger of Allah (ﷺ) stood to offer a voluntary prayer, he would say when he bowed: \"Allahumma laka rak'atu wa bika amantu wa laka aslamtu wa alayka tawwakaltu, anta Rabbi, khasha'a sam'i wa basri wa lahmi wa dammi wa mukhi wa 'asabi Lillahi Rabbil-'Alamin ( O Allah, to You I have bowed, in You I believe, to You I have submitted and in You I put my trust. You are my Lord. My hearing, my sight, my flesh, my blood,  my brain and my sinews are humbled before Allah, the Lord of the Worlds).\"",
      "chain": [
        "20428",
        "11048",
        "11197",
        "167"
      ]
    },
    {
      "hadith_no": "1128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يحيى بن عثمان، قال أنبأنا ابن حمير، قال حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، وذكر، آخر قبله عن عبد الرحمن بن هرمز الأعرج، عن محمد بن مسلمة، أن رسول الله صلى الله عليه وسلم كان إذا قام من الليل يصلي تطوعا قال إذا سجد ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت اللهم أنت ربي سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Maslamah that:                     When the Messenger of Allah (ﷺ) got up to offer voluntary prayers at night, he would say when he prostrated: \"Allahumma laka sajadtu wa bika amantu wa laka aslamtu, Allahumma anta Rabbi, sajada wajhi lilladhi khalaqahu wa sawwarahu wa shaqqa sam'ahu wa basarahu, tabarak Allahu ahsanul-khaliqin ( O Allah, to You I have prostrated and in You I have believed and to You I have submitted. O Allah, You are my Lord. My face has prostrated to the One Who created it and formed it, and brought forth its hearing and sight. Blessed be Allah the best of Creators.)\"",
      "chain": [
        "20428",
        "11048",
        "11197",
        "167"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني حكيم بن حكيم بن عباد بن حنيف، عن محمد بن مسلم بن شهاب، عن علي بن حسين، عن أبيه، عن جده، علي بن أبي طالب قال دخل على رسول الله صلى الله عليه وسلم وعلى فاطمة من الليل فأيقظنا للصلاة ثم رجع إلى بيته فصلى هويا من الليل فلم يسمع لنا حسا فرجع إلينا فأيقظنا فقال ‏\"‏ قوما فصليا ‏\"‏ ‏.‏ قال فجلست وأنا أعرك عيني وأقول إنا والله ما نصلي إلا ما كتب الله لنا إنما أنفسنا بيد الله ‏.‏ فإن شاء أن يبعثنا بعثنا - قال - فولى رسول الله صلى الله عليه وسلم وهو يقول ويضرب بيده على فخذه ‏\"‏ ما نصلي إلا ما كتب الله لنا ‏{‏ وكان الإنسان أكثر شىء جدلا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali bin Husain, from his father, that:                     Hs grandfather Ali bin Abi Talib said: \"The Messenger of Allah (ﷺ) came in to Fatimah and I, one night and woke us up to pray, then he went back to his house and prayed for part of the night, and he did not hear any movement from us. He came back to us and woke us up, and said: 'Get up and pray.' I sat up, rubbing my eyes, and said: 'By Allah, we will only pray that which has decreed for us; our souls are in the hand of Allah (SWT) and if He wants to make us get up, He will make us get up.' The Messenger of Allah (ﷺ) turned away, striking his hand on his thigh, saying: 'We will only pray that which Allah (SWT) has decreed for us! But man is ever more quarrelsome than anything.'\"",
      "chain": [
        "11107",
        "19803",
        "167",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "2103",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال وذكر محمد بن مسلم عن أويس بن أبي أويس، عديد بني تيم عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هذا رمضان قد جاءكم تفتح فيه أبواب الجنة وتغلق فيه أبواب النار وتسلسل فيه الشياطين ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الحديث خطأ ‏.‏",
      "text_en": " It was narrated form Anas bin Malik that the Messenger of Allah said:                     \" There has come to you Ramadan in which the gates of Paradise are opened, the gates of the fire are closed and the devils are chained up.\" (Sahih)Abu 'Abdur-Rahman said: this narration is a mistake.",
      "chain": [
        "30258",
        "20385",
        "11107",
        "167",
        "19"
      ]
    },
    {
      "hadith_no": "2119",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله النيسابوري، قال حدثنا سليمان بن داود، قال حدثنا إبراهيم، عن محمد بن مسلم، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فصوموا ثلاثين يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of allah sadi:                     \"When you see the crescent then fast, and when you crescent then fast, and when you see it, stop fasting. If it is obscured from you (too cloudy), then fast thirty days.\"",
      "chain": [
        "11222",
        "30584",
        "20150",
        "167",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3920",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن عامر، قال حدثنا سريج، قال حدثنا محمد بن مسلم، عن عمرو بن دينار، عن جابر، قال نهاني رسول الله صلى الله عليه وسلم عن المخابرة والمحاقلة والمزابنة‏.‏‏ جمع سفيان بن عيينة الحديثين فقال عن ابن عمر وجابر‏.‏‏",
      "text_en": " It was narrated that Jabir said:                      \"The Messenger of Allah forbade Al-Mukhabarah, Al-Muhaqalah and Al-Muzabanah.\"",
      "chain": [
        "38522",
        "167",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4236",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث بن سعد، قال حدثني أبي، عن جدي، عن ابن أبي حبيب، - يعني يزيد - عن حفص بن الوليد، عن محمد بن مسلم، عن عبيد الله بن عبد الله، حدثه أن ابن عباس حدثه قال أبصر رسول الله صلى الله عليه وسلم شاة ميتة لمولاة لميمونة وكانت من الصدقة فقال ‏\"‏ لو نزعوا جلدها فانتفعوا به ‏\"‏ ‏.‏ قالوا إنها ميتة ‏.‏ قال ‏\"‏ إنما حرم أكلها ‏\"‏ ‏.‏",
      "text_en": " Ibn'Abbas said:                     \"The Messenger of Allah saw a dead sheep that belonged to the freed slave woman of Maimunah, and had come from the Sadaqah.\" He said: \"Why don't you take off its hide and make use of it?\" They said: \"It is dead meat.\" He said: \"It is only unlawful to eat it.\"",
      "chain": [
        "167",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4772",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني أبو بكر بن إسحاق، قال حدثنا أبو الجواب، قال حدثنا عمار، عن محمد بن عبد الرحمن بن أبي ليلى، عن الحكم، عن محمد بن مسلم، عن صفوان بن يعلى، أن أباه، غزا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فاستأجر أجيرا فقاتل رجلا فعض الرجل ذراعه فلما أوجعه نترها فأندر ثنيته فرفع ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ يعمد أحدكم فيعض أخاه كما يعض الفحل ‏\"‏ ‏.‏ فأبطل ثنيته ‏.‏",
      "text_en": " It was narrated from Safwan bin Ya'la that:                     his father wen on the campaign of Tabuk with the Messenger of Allah, and he hired a man who fought with another man. The man bit his forearm, and when it hurt him, he pulled it away, and the man's front tooth fell out. The matter was referred to the Messenger of Allah who said: \"Would one of you deliberately bit his brother as a stallion bites?\" And he judged it to be invalid.",
      "chain": [
        "30511",
        "20578",
        "25",
        "11069",
        "167",
        "11248"
      ]
    },
    {
      "hadith_no": "4803",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن المثنى، عن معاذ بن هانئ، قال حدثني محمد بن مسلم، قال حدثنا عمرو بن دينار، ح وأخبرنا أبو داود، قال حدثنا معاذ بن هانئ، قال حدثنا محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، قال قتل رجل رجلا على عهد رسول الله صلى الله عليه وسلم فجعل النبي صلى الله عليه وسلم ديته اثنى عشر ألفا وذكر قوله إلا أن أغناهم الله ورسوله من فضله في أخذهم الدية ‏.‏ واللفظ لأبي داود ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A man killed another man during the time of the Messenger of Allah, and the Prophet set the Diyah at twelve thousand. And he mentioned His saying: And they could not find any cause to do so except that Allah and His Messenger had enriched them of His Bounty. concerning them taking the Dyah.\" (Hasan)This is the wording of Abu Dawud.",
      "chain": [
        "30170",
        "30178",
        "167",
        "11081",
        "30002",
        "30178",
        "167",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4900",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا أبو الجواب، قال حدثنا عمار بن رزيق، عن محمد بن عبد الرحمن بن أبي ليلى، عن إسماعيل بن أمية، عن محمد بن مسلم، عن عروة، عن عائشة، قالت سرقت امرأة من قريش من بني مخزوم فأتي بها النبي صلى الله عليه وسلم فقالوا من يكلمه فيها قالوا أسامة بن زيد ‏.‏ فأتاه فكلمه فزبره وقال ‏\"‏ إن بني إسرائيل كانوا إذا سرق فيهم الشريف تركوه وإذا سرق الوضيع قطعوه والذي نفسي بيده لو أن فاطمة بنت محمد سرقت لقطعتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"A woman of Quraish, from banu Makhzum, stole, and she was brought to the Prophet. They said: 'Who will speak to him concerning her?' They said: 'Usamah bin Zaid.' So he came to the Prophet and spoke to him. But he rebuked him, and he said; 'Among the Children of Israel, if a noble person stole, they would let him go. But if a low-class person stole, they would cut off his hand. By the One in whose hand is the soul of Muhammad, if Fatimah bint Muhammad were to steal, I would cut off her hand.\"\"",
      "chain": [
        "30511",
        "20578",
        "20595",
        "11417",
        "167",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5077",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن مسلم، قال حدثنا يحيى بن يعلى، قال حدثنا به أبي، عن غيلان، عن أبي إسحاق، عن ابن أبي ليلى، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفضل ما غيرتم به الشمط الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that:                     The Prophet [SAW] said: \"The best things with which you can change gray hair are Henna and Katam.\"",
      "chain": [
        "167",
        "11300",
        "11049",
        "11196",
        "23"
      ]
    },
    {
      "hadith_no": "1866",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن محمد بن مسلم، عن عمرو بن دينار، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة وليس فيما دون خمسة أوساق صدقة ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "38409",
        "20032",
        "167",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا سعيد بن سليمان، حدثنا محمد بن مسلم، حدثنا إبراهيم بن ميسرة، عن طاوس، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لم نر للمتحابين مثل النكاح ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     the Messenger of Allah said: “There is nothing like marriage, for two who love one another.”",
      "chain": [
        "11222",
        "30252",
        "167",
        "11240",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1937",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن حجاج، عن محمد بن سليمان، عن عمه، سهل بن أبي حثمة عن محمد بن مسلمة، قال خطبت امرأة فجعلت أتخبأ لها حتى نظرت إليها في نخل لها فقيل له أتفعل هذا وأنت صاحب رسول الله  صلى الله عليه وسلم  فقال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا ألقى الله في قلب امرئ خطبة امرأة فلا بأس أن ينظر إليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Muhammad bin Salamah said: “I proposed marriage to a woman, then I hid and waited to see her until I saw her among some date palm trees that belonged to her.” It was said to him: “Do you do such a thing when you are a companion of the Messenger of Allah?” He said: “I heard the Messenger of Allah saying: 'When Allah causes a man to propose to a woman, there is nothing wrong with him looking at her.' ”",
      "chain": [
        "30201",
        "20317",
        "20219",
        "1822",
        "167"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن رمح، قال أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن عمار بن أبي فروة، أن محمد بن مسلم، حدثه أن عروة حدثه أن عمرة بنت عبد الرحمن حدثته أن عائشة حدثتها أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا زنت الأمة فاجلدوها فإن زنت فاجلدوها فإن زنت فاجلدوها فإن زنت فاجلدوها ثم بيعوها ولو بضفير ‏\"‏ ‏.‏ والضفير الحبل ‏.‏",
      "text_en": " 'Aishah narrated that the Messenger of Allah(ﷺ) said:                     “If a slave woman commits fornication then whip her, and if she commits fornication then whip her, and if she commits fornication then whip her, then sell her even if that is for a rope.”",
      "chain": [
        "30490",
        "20023",
        "11411",
        "167",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2731",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هانئ، حدثنا محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه جعل الدية اثنى عشر ألفا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Messenger of Allah (ﷺ) set the blood money at twelve thousand (Dirham).",
      "chain": [
        "30160",
        "30178",
        "167",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2734",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا العباس بن جعفر، حدثنا محمد بن سنان، حدثنا محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم جعل الدية اثنى عشر ألفا قال ذلك قوله ‏{وما نقموا إلا أن أغناهم الله ورسوله من فضله}‏ قال بأخذهم الدية ‏.‏",
      "text_en": " It was narrated from 'Ikrimah, from Ibn 'Abbas, that :                     the Prophet (ﷺ) set the blood money at twelve thousand (Dirham). He said: “This is what Allah says: 'And they could not find any cause to do so except that Allah and his Messenger (ﷺ) had enriched them of His bounty.'” He said: “By their taking the blood money.”",
      "chain": [
        "34207",
        "167",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3227",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا عيسى بن حماد المصري، أنبأنا الليث بن سعد، أخبرني عقيل، عن محمد بن مسلم، أنه قال إن أبا سلمة بن عبد الرحمن بن عوف أخبره أن عبد الله بن عدي بن الحمراء قال له رأيت رسول الله  صلى الله عليه وسلم  وهو على راحلته واقف بالحزورة يقول ‏\"‏ والله إنك لخير أرض الله وأحب أرض الله إلى الله ولولا أني أخرجت منك ما خرجت ‏\"‏ ‏.‏",
      "text_en": " AbuSalamah bin ‘Abdur-Rahman bin ‘Awf narrated that ‘Abdullah bin‘Adiy bin Hamra’ said to him:                      “I saw the Messenger of Allah(ﷺ),when he was on his she-camel, standing in Al-Hazwarah* saying:‘ByAllah, you are the best land of Allah, and the dearest of theland ofAllah to me. By Allah, had i not been expelled from you Iwould neverhave left.’”",
      "chain": [
        "30412",
        "20023",
        "11207",
        "167",
        "10567",
        "5131"
      ]
    }
  ],
  "total_hadiths": 37
}