{
  "id": "169",
  "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
  "full_name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "81",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Laith",
      "B.Kinan",
      "Non-Quraish",
      "Child",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "151",
      "name": "Shaddad ibn al-Haad ( شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "86",
      "name": "Salma bint 'Umays ( سلمى بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "127",
      "name": "'Abdur Rahman ibn Shaddad ( عبد الرحمن بن شداد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "151",
      "name": "Shaddad ibn al-Haad ( شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "213",
      "name": "Ibn Umm Maktum ( عبد الله بن أم مكتوم الأعمى القرشي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "100",
      "name": "al-'Abbas ibn 'Abd al-Muttalib ( العباس بن عبد المطلب بن هاشم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "61",
      "name": "Maymuna bint al-Harith ( ميمونة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "69",
      "name": "Asma bint 'Umays ( أسماء بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11396",
      "name": "Ma'bad bin Khalid al-Jadli معبد بن خالد الجدلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11423",
      "name": "Dhar bin 'Abdullah al-Marhabi ذر بن عبد الله المرهبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15664",
      "name": "Abu Ja'far al-Fra'a al-Kwfy أبو جعفر الفراء الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11076",
      "name": "Muhammad bin 'Abdullah bin Abi Ya'qub محمد بن عبد الله بن أبي يعقوب التميمي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "303",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الله بن شداد، قال سمعت ميمونة، كان رسول الله صلى الله عليه وسلم إذا أراد أن يباشر امرأة من نسائه أمرها فاتزرت وهى حائض‏.‏ ورواه سفيان عن الشيباني‏.‏",
      "text_en": " Narrated Maimuna:                     When ever Allah's Apostle wanted to fondle any of his wives during the periods (menses), he used to ask her to wear an Izar.",
      "chain": [
        "20283",
        "20256",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "333",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا الحسن بن مدرك، قال حدثنا يحيى بن حماد، قال أخبرنا أبو عوانة  اسمه الوضاح  من كتابه قال أخبرنا سليمان الشيباني، عن عبد الله بن شداد، قال سمعت خالتي، ميمونة  زوج النبي صلى الله عليه وسلم أنها كانت تكون حائضا لا تصلي، وهى مفترشة بحذاء مسجد رسول الله صلى الله عليه وسلم وهو يصلي على خمرته، إذا سجد أصابني بعض ثوبه‏.‏",
      "text_en": " Narrated Maimuna:                     (the wife of the Prophet) During my menses, I never prayed, but used to sit on the mat beside the mosque of Allah's Apostle. He used to offer the prayer on his sheet and in prostration some of his clothes used to touch me.\"",
      "chain": [
        "30131",
        "20574",
        "20469",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "379",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، عن خالد، قال حدثنا سليمان الشيباني، عن عبد الله بن شداد، عن ميمونة، قالت كان رسول الله صلى الله عليه وسلم يصلي وأنا حذاءه وأنا حائض وربما أصابني ثوبه إذا سجد‏.‏ قالت وكان يصلي على الخمرة‏.‏",
      "text_en": " Narrates `Abdullah bin Shaddad:                     Maimuna said, \"Allah's Apostle was praying while I was in my menses, sitting beside him and sometimes his clothes would touch me during his prostration.\" Maimuna added, \"He prayed on a Khumra (a small mat sufficient just for the face and the hands while prostrating during prayers).",
      "chain": [
        "30175",
        "20423",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "381",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، قال حدثنا سليمان الشيباني، عن عبد الله بن شداد، عن ميمونة، قالت كان النبي صلى الله عليه وسلم يصلي على الخمرة‏.‏",
      "text_en": " Narrated Maimuna:                     Allah's Apostle used to pray on Khumra.",
      "chain": [
        "20296",
        "20020",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "517",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن زرارة، قال أخبرنا هشيم، عن الشيباني، عن عبد الله بن شداد بن الهاد، قال أخبرتني خالتي، ميمونة بنت الحارث قالت كان فراشي حيال مصلى النبي صلى الله عليه وسلم فربما وقع ثوبه على وأنا على فراشي‏.‏",
      "text_en": " Narrated Maimuna bint Al-Harith:                     My bed was beside the praying place (Musalla) of the Prophet and sometimes his garment fell on me while I used to lie in my bed.",
      "chain": [
        "30365",
        "20468",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا عبد الواحد بن زياد، قال حدثنا الشيباني، سليمان حدثنا عبد الله بن شداد، قال سمعت ميمونة، تقول كان النبي صلى الله عليه وسلم يصلي وأنا إلى جنبه نائمة، فإذا سجد أصابني ثوبه، وأنا حائض‏.‏ وزاد مسدد عن خالد قال حدثنا سليمان الشيباني، وأنا حائض‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet used to pray while I used to sleep beside him during my periods (menses) and in prostration his garment used to touch me.",
      "chain": [
        "20283",
        "20256",
        "169"
      ]
    },
    {
      "hadith_no": "2905",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، حدثنا قبيصة، حدثنا سفيان، عن سعد بن إبراهيم، قال حدثني عبد الله بن شداد، قال سمعت عليا  رضى الله عنه  يقول ما رأيت النبي صلى الله عليه وسلم يفدي رجلا بعد سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I never saw the Prophet saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d. I heard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you.\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5",
        "20351",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "4109",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن أبيه، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت النبي صلى الله عليه وسلم جمع أبويه لأحد إلا لسعد بن مالك، فإني سمعته يقول يوم أحد ‏\"‏ يا سعد ارم، فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning his father and mother for anybody other than Sa`d bin Malik. I heard him saying on the day of Uhud, \"O Sa`d throw (arrows)! Let my father and mother be sacrificed for you !\"",
      "chain": [
        "27558",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "5797",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال حدثني معبد بن خالد، قال سمعت عبد الله بن شداد، عن عائشة  رضى الله عنها  قالت أمرني رسول الله صلى الله عليه وسلم أو أمر أن يسترقى من العين‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet ordered me or somebody else to do Ruqya (if there was danger) from an evil eye.",
      "chain": [
        "28531",
        "20012",
        "11396",
        "169",
        "53"
      ]
    },
    {
      "hadith_no": "6254",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت رسول الله صلى الله عليه وسلم يفدي أحدا غير سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏ أظنه يوم أحد‏.‏",
      "text_en": " Narrated `Ali:                     I never heard Allah's Apostle saying, \"Let my father and mother be sacrificed for you,\" except for Sa`d (bin Abi Waqqas). I heard him saying, \"Throw! (arrows), Let my father and mother be sacrificed for you !\" (The sub-narrator added, \"I think that was in the battle of Uhud.\")",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن الشيباني، عن عبد الله بن شداد، عن ميمونة، قالت كان رسول الله صلى الله عليه وسلم يباشر نساءه فوق الإزار وهن حيض ‏.‏",
      "text_en": " Maimuna (the wife of the Holy Prophet) reported:                      The Messenger of Allah (may peace be upon him) contacted and embraced his wives over the waist-wrapper when they were menstruating.",
      "chain": [
        "30399",
        "20423",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "513",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، جميعا عن الشيباني، عن عبد الله بن شداد بن الهاد، قال حدثتني ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم يصلي وأنا حذاءه وأنا حائض وربما أصابني ثوبه إذا سجد ‏.‏",
      "text_en": " Maimuna, the wife of the Apostle (may peace be upon him), reported:                      The Messenger of Allah (may peace be upon him) said prayer and I (lay) opposite to him while I was in menses. Sometimes his clothes touched me when he prostrated.",
      "chain": [
        "30399",
        "20423",
        "30201",
        "20431",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "1536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا خالد بن عبد الله، ح وحدثنا أبو بكر بن أبي شيبة، قال حدثنا عباد بن العوام، كلاهما عن الشيباني، عن عبد الله بن شداد، قال حدثتني ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم يصلي وأنا حذاءه وربما أصابني ثوبه إذا سجد وكان يصلي على خمرة ‏.‏",
      "text_en": " Maimuna, the wife of the Apostle of Allah (may peace be upon him), reported:                      The Messenger of Allah (may peace be upon him) said prayer while I was by his side, and at times when he prostrated his cloth touched me, and he prayed on a small mat.",
      "chain": [
        "30399",
        "20423",
        "30201",
        "20431",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "5851",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سفيان، عن معبد بن خالد، عن عبد الله بن، شداد عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يأمرني أن أسترقي من العين ‏.‏",
      "text_en": " 'A'isha reported:                      Allah's Messenger (may peace he upon him) commanded me that I should make use of incantation for curing the influence of an evil eye.",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11396",
        "169",
        "53"
      ]
    },
    {
      "hadith_no": "6386",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم، - يعني ابن سعد - عن أبيه، عن  عبد الله بن شداد، قال سمعت عليا، يقول ما جمع رسول الله صلى الله عليه وسلم أبويه لأحد غير سعد بن مالك فإنه جعل يقول له يوم أحد ‏\"‏ ارم فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Shaddad reported that he heard 'Allahs saying:                      Allah's Messenger (may peace be upon him) did not gather his parents except in case of Sa'd b. Malik that he said to him on the Day of Ubud: Shoot an arrow, may my father and mother be taken as ransom for you.",
      "chain": [
        "30523",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "6387",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، ح حدثنا وكيع، ح وحدثنا أبو كريب، وإسحاق الحنظلي، عن محمد بن بشر، عن مسعر، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن مسعر، كلهم عن  سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ali through another chain of transmitters.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20032",
        "30216",
        "20352",
        "20359",
        "30421",
        "20005",
        "11063",
        "169"
      ]
    },
    {
      "hadith_no": "656",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، عن الشيباني، عن عبد الله بن شداد، حدثتني ميمونة بنت الحارث، قالت كان رسول الله صلى الله عليه وسلم يصلي وأنا حذاءه وأنا حائض وربما أصابني ثوبه إذا سجد وكان يصلي على الخمرة ‏.‏",
      "text_en": " Maimunah bint al-Harith reported :                      the Messenger of Allah (ﷺ) used to pray while. I was by his side in the state of menstruation. Sometime his cloth would touch me when he prostrated. He would pray on a small mat.",
      "chain": [
        "30154",
        "20423",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إدريس الرازي، حدثنا عمرو بن الربيع بن طارق، حدثنا يحيى بن أيوب، عن عبيد الله بن أبي جعفر، أن محمد بن عمرو بن عطاء، أخبره عن عبد الله بن شداد بن الهاد، أنه قال دخلنا على عائشة زوج النبي صلى الله عليه وسلم فقالت دخل على رسول الله صلى الله عليه وسلم فرأى في يدي فتخات من ورق فقال ‏\"‏ ما هذا يا عائشة ‏\"‏ ‏.‏ فقلت صنعتهن أتزين لك يا رسول الله ‏.‏ قال ‏\"‏ أتؤدين زكاتهن ‏\"‏ ‏.‏ قلت لا أو ما شاء الله ‏.‏ قال ‏\"‏ هو حسبك من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated ‘Abdallah bin Shaddad bin Al Had :                     We entered upon A’ishah, wife of the Prophet (ﷺ). She said The Apostle of Allaah (ﷺ) entered upon me and saw two silver rings in my hand. He asked What is this, Aishah? I said I have made two ornaments myself for you, Messenger of Allah (ﷺ). He asked Do you pay zakat on them? I said No or I said Whatever Allah willed. He said this is sufficient for you (to take you) to the Hell fire.",
      "chain": [
        "20002",
        "30206",
        "20379",
        "11409",
        "11220",
        "169"
      ]
    },
    {
      "hadith_no": "2167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن العلاء، ومسدد، قالا حدثنا حفص، عن الشيباني، عن عبد الله بن شداد، عن خالته، ميمونة بنت الحارث أن رسول الله صلى الله عليه وسلم كان إذا أراد أن يباشر امرأة من نسائه وهي حائض أمرها أن تتزر ثم يباشرها ‏.‏",
      "text_en": " Maimunah daughter of Al Harith said “When the Apostle of Allaah(ﷺ) intended to associate and lie with any of his wives who was menstruating, he ordered her to wrap up the lower garment(loin-cloth) and then he had association with her.",
      "chain": [
        "30216",
        "30175",
        "20317",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "4009",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عبد الله بن شداد، عن أبي عذرة، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم نهى عن دخول الحمامات ثم رخص للرجال أن يدخلوها في الميازر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) forbade to enter the hot baths. He then permitted men to enter them in lower garments.",
      "chain": [
        "20040",
        "20022",
        "169",
        "53"
      ]
    },
    {
      "hadith_no": "5112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وابن، قدامة بن أعين قالا حدثنا جرير، عن منصور، عن ذر، عن عبد الله بن شداد، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أحدنا يجد في نفسه - يعرض بالشىء - لأن يكون حممة أحب إليه من أن يتكلم به فقال ‏\"‏ الله أكبر الله أكبر الله أكبر الحمد لله الذي رد كيده إلى الوسوسة ‏\"‏ ‏.‏ قال ابن قدامة ‏\"‏ رد أمره ‏\"‏ ‏.‏ مكان ‏\"‏ رد كيده ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah! one of us has thoughts of such nature that he would rather be reduced to charcoal than speak about them. He said: Allah is Most Great, Allah is Most Great, Allah is Most Great. Praise be to Allah Who has reduced the guile of the devil to evil  prompting. Ibn Qudamah said \"reduced his matter\" instead of \"reduced his guile\".Ibn Qudamah said \"reduced his matter\" instead of \"reduced his guile\".",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11423",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا محمد بن خالد ابن عثمة، حدثني موسى بن يعقوب الزمعي، حدثني عبد الله بن كيسان، أن عبد الله بن شداد، أخبره عن عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أولى الناس بي يوم القيامة أكثرهم على صلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من صلى على صلاة صلى الله عليه بها عشرا وكتب له بها عشر حسنات ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     Allah's Messenger said: \"The person closest to me on the Day of Judgement is the one who sent the most Salat upon me.\"",
      "chain": [
        "30160",
        "30581",
        "20706",
        "18570",
        "169",
        "16"
      ]
    },
    {
      "hadith_no": "4121",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "وقد روي هذا الحديث، عن عبد الله بن شداد بن الهاد، عن علي بن أبي طالب، عن النبي صلى الله عليه وسلم ‏.‏ حدثنا بذلك، محمود بن غيلان حدثنا وكيع، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الله بن شداد، عن علي بن أبي طالب، قال ما سمعت النبي صلى الله عليه وسلم يفدي أحدا بأبويه إلا لسعد فإني سمعته يقول يوم أحد ‏\"‏ ارم سعد فداك أبي وأمي ‏\"‏ ‏.‏ قال هذا حديث صحيح ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib:                     \"I never heard the Prophet (ﷺ) mentioning both of his parents being ransomed for anyone except for Sa'd. On the Day of Uhud, I heard him saying: 'Shoot, Sa'd, may my father and mother be ransomed for you.\"",
      "chain": [
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "738",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سليمان، - يعني الشيباني - عن عبد الله بن شداد، عن ميمونة، أن رسول الله صلى الله عليه وسلم كان يصلي على الخمرة ‏.‏",
      "text_en": " It was narrated from Maimunah that the Messenger of Allah (ﷺ) used to pray on a mat.",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "1141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا يزيد بن هارون، قال أنبأنا جرير بن حازم، قال حدثنا محمد بن أبي يعقوب البصري، عن عبد الله بن شداد، عن أبيه، قال خرج علينا رسول الله صلى الله عليه وسلم في إحدى صلاتى العشاء وهو حامل حسنا أو حسينا فتقدم رسول الله صلى الله عليه وسلم فوضعه ثم كبر للصلاة فصلى فسجد بين ظهرانى صلاته سجدة أطالها ‏.‏ قال أبي فرفعت رأسي وإذا الصبي على ظهر رسول الله صلى الله عليه وسلم وهو ساجد فرجعت إلى سجودي فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال الناس يا رسول الله إنك سجدت بين ظهرانى صلاتك سجدة أطلتها حتى ظننا أنه قد حدث أمر أو أنه يوحى إليك ‏.‏ قال ‏\"‏ كل ذلك لم يكن ولكن ابني ارتحلني فكرهت أن أعجله حتى يقضي حاجته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Shaddad, this his father said:                     \"The Messenger of Allah (ﷺ) came out to us for one of the nighttime prayers, and he was carrying Hasan or Husain. The Messenger of Allah (ﷺ) came forward and put him down, then he said the Takbir and started to pray. He prostrated during his prayer, and made the prostration lengthy.\" My father said: \"I raised my head and saw the child on the back of the Messenger of Allah (ﷺ) while he was prostrating so I went back to my prostration. When the Messenger of Allah (ﷺ) finished praying, the people said: \"O Messenger of Allah (ﷺ), you prostrated during the prayer for so long that we thought that something had happened or that you were receiving a revelation.' He said: 'No such thing happened. But my son was riding on my back and I did not like to disturb him until he had enough.'\"",
      "chain": [
        "36587",
        "20472",
        "11272",
        "169",
        "151"
      ]
    },
    {
      "hadith_no": "5683",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال أنبأنا القواريري، قال حدثنا عبد الوارث، قال سمعت ابن شبرمة، يذكره عن عبد الله بن شداد بن الهاد، عن ابن عباس، قال حرمت الخمر قليلها وكثيرها والسكر من كل شراب ‏.‏ ابن شبرمة لم يسمعه من عبد الله بن شداد ‏.‏",
      "text_en": " It was narrated from Ibn Shubrumah who mentioned it from 'Abdullah bin Shaddad bin Al-Had, from Ibn 'Abbas, who said:                     \"Khamr was forbidden in small or large amounts, as was every kind of intoxicating drink.\"",
      "chain": [
        "30024",
        "20258",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "5684",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا سريج بن يونس، قال حدثنا هشيم، عن ابن شبرمة، قال حدثني الثقة، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر بعينها قليلها وكثيرها والسكر من كل شراب ‏.‏ خالفه أبو عون محمد بن عبيد الله الثقفي ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in and of itself in small or large amounts, as was every kind of intoxicating drink.\"",
      "chain": [
        "30251",
        "20468",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "5685",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد، ح وأنبأنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن مسعر، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر بعينها قليلها وكثيرها والسكر من كل شراب ‏.‏ لم يذكر ابن الحكم قليلها وكثيرها ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in and of itself, in small or large amounts, as was every kind of intoxicating drink.\"",
      "chain": [
        "30213",
        "38181",
        "30007",
        "20173",
        "20020",
        "20359",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "5686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا إبراهيم بن أبي العباس، قال حدثنا شريك، عن عباس بن ذريح، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر قليلها وكثيرها وما أسكر من كل شراب ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من حديث ابن شبرمة وهشيم بن بشير كان يدلس وليس في حديثه ذكر السماع من ابن شبرمة ورواية أبي عون أشبه بما رواه الثقات عن ابن عباس ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in small or large amounts, as was every kind of drink that intoxicates.\"",
      "chain": [
        "38181",
        "30007",
        "11858",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، قال ما رأيت رسول الله  صلى الله عليه وسلم  جمع أبويه لأحد غير سعد بن مالك فإنه قال له يوم أحد ‏\"‏ ارم سعد فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"I never saw the Messenger of Allah mention his parents together for anyone except Sa'd bin Malik. He said to him on the Day of Uhud: 'Shoot, Sa'd!  May my father and mother be sacrificed for you!'\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "697",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سهل بن أبي سهل، حدثنا سفيان بن عيينة، حدثنا الشيباني، عن عبد الله بن شداد، عن ميمونة، أن رسول الله  صلى الله عليه وسلم  صلى وعليه مرط عليه بعضه وعليها بعضه وهي حائض ‏.‏",
      "text_en": " It was narrated from Maimunah that:                     The Messenger of Allah performed prayer wearing a wool cloak. Part of it was over him and part was over her, and she was menstruating.",
      "chain": [
        "38259",
        "20005",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "1011",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، عن الشيباني، عن عبد الله بن شداد، قال حدثتني ميمونة، زوج النبي  صلى الله عليه وسلم  قالت كان النبي  صلى الله عليه وسلم  يصلي وأنا بحذائه وربما أصابني ثوبه إذا سجد ‏.‏",
      "text_en": " Maimunah,the wife of the Prophet (ﷺ), said:                      “The Prophet (ﷺ)used toperform prayer when I was opposite to him, and his garmentwouldsometimes touch me when he prostrated.”",
      "chain": [
        "30201",
        "20431",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "1081",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، عن الشيباني، عن عبد الله بن شداد، حدثتني ميمونة، زوج النبي  صلى الله عليه وسلم  قالت كان رسول الله  صلى الله عليه وسلم  يصلي على الخمرة ‏.‏",
      "text_en": " Maimunahthe wife of the Prophet (ﷺ) said:                      “The Messenger of Allah(ﷺ)used to perform prayer on a Khumrah.”",
      "chain": [
        "30201",
        "20431",
        "11352",
        "169"
      ]
    },
    {
      "hadith_no": "2839",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن محمد بن عبد الرحمن بن أبي ليلى، عن الحكم، عن عبد الله بن شداد، عن بنت حمزة، - قال محمد يعني ابن أبي ليلى وهي أخت ابن شداد لأمه - قالت مات مولاى وترك ابنة فقسم رسول الله صلى الله عليه وسلم ماله بيني وبين ابنته فجعل لي النصف ولها النصف ‏.‏",
      "text_en": " It wasnarrated that the daughter of Hamzah said:                      “My freed slavedied,leaving behind a daughter. The Messenger of Allah (ﷺ) dividedhiswealth between myself and his daughter, giving me half and herhalf.”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11069",
        "169"
      ]
    },
    {
      "hadith_no": "3641",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن أبي الخصيب، حدثنا وكيع، عن سفيان، ومسعر، عن معبد بن خالد، عن عبد الله بن شداد، عن عائشة، أن النبي  صلى الله عليه وسلم  أمرها أن تسترقي من العين ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) commanded her torecite Ruqyah to treat the evil eye.",
      "chain": [
        "20032",
        "20012",
        "20359",
        "11396",
        "169",
        "53"
      ]
    },
    {
      "hadith_no": "3749",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، قالا حدثنا حماد بن سلمة، أنبأنا عبد الله بن شداد، عن أبي عذرة، - قال وكان قد أدرك النبي  صلى الله عليه وسلم  - عن عائشة أن النبي  صلى الله عليه وسلم  نهى الرجال والنساء من الحمامات ثم رخص للرجال أن يدخلوها في الميازر ولم يرخص للنساء ‏.‏",
      "text_en": " It was narrated from Aisha that the Prophet(ﷺ):                     forbade men and women to enter bathhouses, then he allowed men to enter them wearing a waist wrap, but he did not make the same allowance for women.",
      "chain": [
        "38409",
        "20032",
        "30201",
        "30106",
        "20021",
        "169"
      ]
    },
    {
      "hadith_no": "4086",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وعلي بن محمد، قالا حدثنا أبو معاوية، عن الأعمش، عن رجاء الأنصاري، عن عبد الله بن شداد بن الهاد، عن معاذ بن جبل، قال صلى رسول الله  صلى الله عليه وسلم  يوما صلاة فأطال فيها فلما انصرف قلنا - أو قالوا - يا رسول الله أطلت اليوم الصلاة قال ‏\"‏ إني صليت صلاة رغبة ورهبة سألت الله عز وجل لأمتي ثلاثا فأعطاني اثنتين ورد على واحدة سألته أن لا يسلط عليهم عدوا من غيرهم فأعطانيها وسألته أن لا يهلكهم غرقا فأعطانيها وسألته أن لا يجعل بأسهم بينهم فردها على ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu’adh bin Jabal said:                      “The Messenger ofAllah(ﷺ) prayed one day, and made the prayer lengthy. When hefinished wesaid (or they said): ‘O Messenger of Allah, you madethe prayerlengthy today.’ He said: ‘I offered a prayer of hopeand fear. I askedAllah for three things for my nation, and Hegranted me two andrefused one. I asked Him not to let my nation bedestroyed by enemiesfrom without, and He granted me that. And Iasked Him not to let thembe destroyed by drowning, and He granted methat. And I asked Him notto let them be destroyed by fighting amongthemselves, but He refusedthat.’”",
      "chain": [
        "30212",
        "38409",
        "20354",
        "11060",
        "15145",
        "169",
        "32"
      ]
    }
  ],
  "total_hadiths": 37
}