{
  "id": "17002",
  "name": "al-Aswad bin Tha'lbah al-Kndy الأسود بن ثعلبة الكندي الشامي",
  "full_name": "al-Aswad bin Tha'lbah al-Kndy الأسود بن ثعلبة الكندي الشامي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  ق  -  مجهول ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3416",
      "hadith_no": "3416",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وحميد بن عبد الرحمن الرؤاسي، عن مغيرة بن زياد، عن عبادة بن نسى، عن الأسود بن ثعلبة، عن عبادة بن الصامت، قال علمت ناسا من أهل الصفة الكتاب والقرآن فأهدى إلى رجل منهم قوسا فقلت ليست بمال وأرمي عنها في سبيل الله عز وجل لآتين رسول الله صلى الله عليه وسلم فلأسألنه فأتيته فقلت يا رسول الله رجل أهدى إلى قوسا ممن كنت أعلمه الكتاب والقرآن وليست بمال وأرمي عنها في سبيل الله ‏.‏ قال ‏\"‏ إن كنت تحب أن تطوق طوقا من نار فاقبلها ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydah ibn as-Samit:                     I taught some persons of the people of Suffah writing and the Qur'an. A man of them presented to me a bow. I said: It cannot be reckoned  property; may I shoot with it in Allah's path? I must come to the Apostle of of Allah (ﷺ) and ask him (about it). So I came to him and said : Messenger of Allah (ﷺ), one of those whom I have been teaching writing and the Qur'an has presented me a bow, and as it cannot be reckoned property, may I shoot with it in Allah's path? He said: If you want to have a necklace of fire on you, accept it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "17002",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2241",
      "hadith_no": "2241",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا مغيرة بن زياد الموصلي، عن عبادة بن نسى، عن الأسود بن ثعلبة، عن عبادة بن الصامت، قال علمت ناسا من أهل الصفة القرآن والكتابة فأهدى إلى رجل منهم قوسا فقلت ليست بمال وأرمي عنها في سبيل الله فسألت رسول الله  صلى الله عليه وسلم  عنها فقال ‏\"‏ إن سرك أن تطوق بها طوقا من نار فاقبلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     \"I taught people from Ahtus-Suffah\" Qur'an and how to write, and one of them gave me a bow. I said: 'It is not money, and I can shoot (with it) for the sake of Allah., I asked the Messenger of Allah (ﷺ) about it and he said: 'If it would please you to have a necklace of fire placed around your neck, then accept it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "19947",
        "17002",
        "40"
      ]
    }
  ],
  "total_hadiths": 2
}