{
  "id": "17046",
  "name": "'Abdur Rahman bin 'Amr bin 'Absa عبد الرحمن بن عمرو بن عبسة",
  "full_name": "'Abdur Rahman bin 'Amr bin 'Absa عبد الرحمن بن عمرو بن عبسة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ت  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5172",
      "name": "'Arbad bin Sariyya al-Salmi ( عرباض بن سارية السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5166",
      "name": "'Utba bin Abd al-Slmy ( عتبة بن عبد السلمي أبو الوليد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11422",
      "name": "Khalid bin Ma'dan خالد بن معدان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19913",
      "name": "Damrah bin Habib al-Zubaidi ضمرة بن حبيب بن صهيب الزبيدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11720",
      "name": "Muhammad bin Ziyad al-Alhani محمد بن زياد الألهاني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4607",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا ثور بن يزيد، قال حدثني خالد بن معدان، قال حدثني عبد الرحمن بن عمرو السلمي، وحجر بن حجر، قالا أتينا العرباض بن سارية وهو ممن نزل فيه ‏{‏ ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه ‏}‏ فسلمنا وقلنا أتيناك زائرين وعائدين ومقتبسين ‏.‏ فقال العرباض صلى بنا رسول الله صلى الله عليه وسلم ذات يوم ثم أقبل علينا فوعظنا موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال قائل يا رسول الله كأن هذه موعظة مودع فماذا تعهد إلينا فقال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبدا حبشيا فإنه من يعش منكم بعدي فسيرى اختلافا كثيرا فعليكم بسنتي وسنة الخلفاء المهديين الراشدين تمسكوا بها وعضوا عليها بالنواجذ وإياكم ومحدثات الأمور فإن كل محدثة بدعة وكل بدعة ضلالة ‏\"‏ ‏.‏",
      "text_en": " Narrated Irbad ibn Sariyah:                     AbdurRahman ibn Amr as-Sulami and Hujr ibn Hujr said: We came to Irbad ibn Sariyah who was among those about whom the following verse was revealed: \"Nor (is there blame) on those who come to thee to be provided with mounts, and when thou saidst: \"I can find no mounts for you.\"  We greeted him and said: We have come to see you to give healing and obtain benefit from you.  Al-Irbad said: One day the Messenger of Allah (ﷺ) led us in prayer, then faced us and gave us a lengthy exhortation at which the eyes shed tears and the hearts were afraid.  A man said: Messenger of Allah! It seems as if it were a farewell exhortation, so what injunction do you give us?  He then said: I enjoin you to fear Allah, and to hear and obey even if it be an Abyssinian slave, for those of you who live after me will see great disagreement. You must then follow my sunnah and that of the rightly-guided caliphs. Hold to it and stick fast to it. Avoid novelties, for every novelty is an innovation, and every innovation is an error.",
      "chain": [
        "30007",
        "20733",
        "20415",
        "11422",
        "17046"
      ]
    },
    {
      "hadith_no": "2676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن حجر، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، قال وعظنا رسول الله صلى الله عليه وسلم يوما بعد صلاة الغداة موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال رجل إن هذه موعظة مودع فماذا تعهد إلينا يا رسول الله قال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبد حبشي فإنه من يعش منكم يرى اختلافا كثيرا وإياكم ومحدثات الأمور فإنها ضلالة فمن أدرك ذلك منكم فعليه بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏  وقد روى ثور بن يزيد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ حدثنا بذلك الحسن بن علي الخلال وغير واحد قالوا حدثنا أبو عاصم عن ثور بن يزيد عن خالد بن معدان عن عبد الرحمن بن عمرو السلمي عن العرباض بن سارية عن النبي صلى الله عليه وسلم نحوه والعرباض بن سارية يكنى أبا نجيح ‏.‏ وقد روي هذا الحديث عن حجر بن حجر عن عرباض بن سارية عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Al-'Irbad bin Sariyah:                     \"One day after the morning Salat, the Messenger of Allah (ﷺ) exhorted us to the extent that the eyes wept and the hearts shuddered with fear. A man said: 'Indeed this is a farewell exhortation. [So what] do you order us O Messenger of Allah?' He said: 'I order you to have Taqwa of Allah, and to listen and obey, even in the case of a Ethiopian slave. Indeed, whomever among you lives, he will see much difference. Beware of the newly invented matters, for indeed they are astray. Whoever among you sees that, then he must stick to my Sunnah and the Sunnah of the rightly guided Khulafa', click to it with the molars.'\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17046",
        "5172"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن بشر بن منصور، وإسحاق بن إبراهيم السواق، قالا حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ضمرة بن حبيب، عن عبد الرحمن بن عمرو السلمي، أنه سمع العرباض بن سارية، يقول وعظنا رسول الله  صلى الله عليه وسلم  موعظة ذرفت منها العيون ووجلت منها القلوب فقلنا يا رسول الله إن هذه لموعظة مودع فماذا تعهد إلينا قال ‏\"‏ قد تركتكم على البيضاء ليلها كنهارها لا يزيغ عنها بعدي إلا هالك من يعش منكم فسيرى اختلافا كثيرا فعليكم بما عرفتم من سنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ وعليكم بالطاعة وإن عبدا حبشيا فإنما المؤمن كالجمل الأنف حيثما قيد انقاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Amr As-Sulami that:                     He heard Al-'Irbad bin Sariyah say: \"The Messenger of Allah (ﷺ) delivered a moving speech to us which made our eyes flow with tears and made our hearts melt. We said: 'O Messenger of Allah. This is a speech of farewell. What did you enjoin upon us?' He said: 'I am leaving you upon a (path of) brightness whose night is like its day. No one will deviate from it after I am gone but one who is doomed. Whoever among you lives will see great conflict. I urge you to adhere to what you know of my Sunnah and the path of the Rightly-Guided Caliphs, and cling stubbornly to it. And you must obey, even if (your leader is) an Abyssinian leader. For the true believer is like a camel with a ring in its nose; wherever it is driven, it complies.\"",
      "chain": [
        "30123",
        "20033",
        "20675",
        "19913",
        "17046",
        "5172"
      ]
    }
  ],
  "total_hadiths": 3
}