{
  "id": "17058",
  "name": "Malik bin Abi Maryam مالك بن أبي مريم الحكمي",
  "full_name": "Malik bin Abi Maryam مالك بن أبي مريم الحكمي",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "18138",
      "name": "Hatm bin Hryth al-Ta'iy حاتم بن حريث الطائي المحري",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3688",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن حاتم بن حريث، عن مالك بن أبي مريم، قال دخل علينا عبد الرحمن بن غنم فتذاكرنا الطلاء فقال حدثني أبو مالك الأشعري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليشربن ناس من أمتي الخمر يسمونها بغير اسمها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Ghanam:                     Malik ibn AbuMaryam said: AbdurRahman ibn Ghanam entered upon us and we discussed tila' and he said: AbuMalik al-Ash'ari told me that he heard the Messenger of Allah (ﷺ) say: Some of my people will assuredly drink wine calling it by another name.",
      "chain": [
        "30007",
        "20650",
        "20675",
        "18138",
        "17058"
      ]
    },
    {
      "hadith_no": "4156",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا معن بن عيسى، عن معاوية بن صالح، عن حاتم بن حريث، عن مالك بن أبي مريم، عن عبد الرحمن بن غنم الأشعري، عن أبي مالك الأشعري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليشربن ناس من أمتي الخمر يسمونها بغير اسمها يعزف على رءوسهم بالمعازف والمغنيات يخسف الله بهم الأرض ويجعل منهم القردة والخنازير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Malik Ash’ari that the Messenger of Allah(ﷺ) said:                      “People among my nation will drink wine, calling it byanother name, and musical instruments will be played for them andsinging girls (will sing for them). Allah will cause the earth toswallow them up, and will turn them into monkeys and pigs.”",
      "chain": [
        "11184",
        "30112",
        "20675",
        "18138",
        "17058",
        "5152",
        "5372"
      ]
    }
  ],
  "total_hadiths": 2
}