{
  "id": "1722",
  "name": "'Asim bin 'Adiy bin al-Jadd ( عاصم بن عدي بن الجد البلوي ( رضي الله عنه",
  "full_name": "'Asim bin 'Adiy bin al-Jadd ( عاصم بن عدي بن الجد البلوي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "45",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "Ally B.'Amr B.'Auf",
      "Ally B.'Ubaid B.Zayd",
      "Badr",
      "Uhud",
      "Khadaq"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "1721",
      "name": "Ma'n bin 'Adiy bin al-Jadd ( معن بن عدي بن الجد البلوي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "399",
      "name": "Sahl bin Sa'd bin Malik ( سهل بن سعد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1975",
      "hadith_no": "1975",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، ح وحدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن أبي البداح بن عاصم، عن أبيه، أن رسول الله صلى الله عليه وسلم رخص لرعاء الإبل في البيتوتة يرمون يوم النحر ثم يرمون الغد ومن بعد الغد بيومين ويرمون يوم النفر ‏.‏",
      "text_en": " Narrated Abu al-Baddah b. 'Asim:                     On the authority of his father 'Asim: The Messenger of Allah (ﷺ) gave permission to the herdsmen of the camels not to pass night at Mina and asked them to throw pebbles on the day of sacrifice, and to throw pebbles at the jamrahs the next day and the following two days, and on the day of their return.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "30485",
        "20029",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    },
    {
      "id": "jami-al-tirmidhi-955",
      "hadith_no": "955",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عبد الرزاق، أخبرنا مالك بن أنس، حدثني عبد الله بن أبي بكر، عن أبيه، عن أبي البداح بن عاصم بن عدي، عن أبيه، قال رخص رسول الله صلى الله عليه وسلم لرعاء الإبل في البيتوتة أن يرموا يوم النحر ثم يجمعوا رمى يومين بعد يوم النحر فيرمونه في أحدهما ‏.‏ قال مالك ظننت أنه قال في الأول منهما ثم يرمون يوم النفر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو أصح من حديث ابن عيينة عن عبد الله بن أبي بكر ‏.‏",
      "text_en": " Abi Al-Baddah bin Asim bin Adi narrated from his father:                     \"The Messenger of Allah permitted the camel herders who were in the camp (at Mina) to stone on the Day of An-Nahr then to gather the stoning of two days after the Day of An-Nahr, so that they stoned them during one of them.\" Malik said: \"I think that he said about the first of them: 'They they should stone on the day of departure.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    },
    {
      "id": "sunan-an-nasai-3069",
      "hadith_no": "3069",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا مالك، قال حدثنا عبد الله بن أبي بكر، عن أبيه، عن أبي البداح بن عاصم بن عدي، عن أبيه، أن رسول الله صلى الله عليه وسلم رخص للرعاة في البيتوتة يرمون يوم النحر واليومين اللذين بعده يجمعونهما في أحدهما ‏.‏",
      "text_en": " It was narrated from al-Baddah bin Asim bin Adiyy from his father, that:                     the Messenger of Allah granted a concession to some caemel herders, allowoing them to not stay overnight in Mina, and allowing them to stone the Jimar on the Da of Sacrifice, then to combine the stoning of two days after sacrifice, so that they could do it one of the two days.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    },
    {
      "id": "sunan-an-nasai-3466",
      "hadith_no": "3466",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو داود، قال حدثنا عبد العزيز بن أبي سلمة، وإبراهيم بن سعد، عن الزهري، عن سهل بن سعد، عن عاصم بن عدي، قال جاءني عويمر - رجل من بني العجلان - فقال أى عاصم أرأيتم رجلا رأى مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل يا عاصم سل لي رسول الله صلى الله عليه وسلم ‏.‏ فسأل عاصم عن ذلك النبي صلى الله عليه وسلم فعاب رسول الله صلى الله عليه وسلم المسائل وكرهها ‏.‏ فجاءه عويمر فقال ما صنعت يا عاصم فقال صنعت أنك لم تأتني بخير كره رسول الله صلى الله عليه وسلم المسائل وعابها ‏.‏ قال عويمر والله لأسألن عن ذلك رسول الله صلى الله عليه وسلم ‏.‏ فانطلق إلى رسول الله صلى الله عليه وسلم فسأله فقال له رسول الله صلى الله عليه وسلم ‏\"‏ قد أنزل الله عز وجل فيك وفي صاحبتك فائت بها ‏\"‏ ‏.‏ قال سهل وأنا مع الناس عند رسول الله صلى الله عليه وسلم فجاء بها فتلاعنا فقال يا رسول الله والله لئن أمسكتها لقد كذبت عليها ‏.‏ ففارقها قبل أن يأمره رسول الله صلى الله عليه وسلم بفراقها فصارت سنة المتلاعنين ‏.‏",
      "text_en": " It was narrated from Sahl bin Sa'd, from 'Asim bin 'Adiyy who said:                      \"Uwaimir, a man from Banu 'Ajlan, came and said: 'O 'Asim, what do you think if a man sees another man with his wife, should he kill him and be killed in retaliation, or what should he do? O 'Asim, ask the Messenger of Allah about that for me.'\" So 'Asim asked the Messenger of Allah about that, and the Messenger of Allah disapproved of the question and criticized the asking of too many questions. Then 'Uwaimir came to him and said: \"What happened, O 'Asim?\" 'Asim said to 'Uwaimir: \"What happened?! You have not brought me any good. The Messenger of Allah disapproved of the question I asked.\" 'Uwaimir said: \"By Allah, I will go and ask the Messenger of Allah.\" So he went to the Messenger of Allah and asked him. The Messenger of Allah said: \"Allah the Mighty and Sublime has revealed (something) concerning you and your wife, so bring her here.\" Sahl said: \"I was among the people in the presence of the Messenger of Allah and he brought her and they engaged in the procedure of Li'an. He said: 'O Messenger of Allah, by Allah! If I keep her I would have been telling lies about her.' So he parted from her before the Messenger of Allah told him to separate from her, and that became the way of Li'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "30002",
        "32017",
        "20150",
        "11013",
        "399",
        "1722"
      ]
    },
    {
      "id": "sunan-ibn-majah-3152",
      "hadith_no": "3152",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عبد الله بن أبي بكر، عن عبد الملك بن أبي بكر، عن أبي البداح بن عاصم، عن أبيه، أن النبي  صلى الله عليه وسلم  رخص للرعاء أن يرموا يوما ويدعوا يوما ‏.‏",
      "text_en": " It wasnarrated from Abu Baddah bin ‘Asim, from his father, that theProphet (ﷺ) granted permission for some shepherds to stone one dayand to not stone (the next) day.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "11104",
        "19953",
        "1722"
      ]
    },
    {
      "id": "sunan-ibn-majah-3153",
      "hadith_no": "3153",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا مالك بن أنس، ح وحدثنا أحمد بن سنان، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، حدثني عبد الله بن أبي بكر، عن أبيه، عن أبي البداح بن عاصم، عن أبيه، قال رخص رسول الله  صلى الله عليه وسلم  لرعاء الإبل في البيتوتة أن يرموا يوم النحر ثم يجمعوا رمى يومين بعد النحر فيرمونه في أحدهما - قال مالك ظننت أنه قال في الأول منهما - ثم يرمون يوم النفر ‏.‏",
      "text_en": " It wasnarrated from Abu Baddah bin ‘Asim that his father said:                      “TheMessenger of Allah (ﷺ) granted permission to some camel herdersregarding staying (in Mina),* and allowing them to stone the Pillarson the Day of Sacrifice, then to combine the stoning of two daysafterthe sacrifice, so that they could do it on one of the twodays.”**Malik said: “I think that he said: ‘On the first ofthe first of thetwo days, then they could stone them on the day ofdeparture (fromMina).’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20001",
        "30297",
        "20033",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    }
  ],
  "total_hadiths": 6
}