{
  "id": "17533",
  "name": "'Amr bin Waqid عمرو بن واقد",
  "full_name": "'Amr bin Waqid عمرو بن واقد",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ت  ق  -  متروك ]"
    ],
    "tags": [
      "Client",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2340",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن المبارك، حدثنا عمرو بن واقد، حدثنا يونس بن حلبس، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزهادة في الدنيا ليست بتحريم الحلال ولا إضاعة المال ولكن الزهادة في الدنيا أن لا تكون بما في يديك أوثق مما في يدى الله وأن تكون في ثواب المصيبة إذا أنت أصبت بها أرغب فيها لو أنها أبقيت لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو إدريس الخولاني اسمه عائذ الله بن عبد الله ‏.‏ وعمرو بن واقد منكر الحديث ‏.‏",
      "text_en": " Abu Dharr narrated that the Prophet (s.a.w) said:                     \"Abstinence in the world is not by prohibiting (oneself) the lawful nor by neglecting wealth , but  abstinence in the world is that you not hold more firmly to what is in your hand than to what is in the hand of Allah, and that you be more hopeful of the rewards that come with an affliction that you may suffer if it remain with you.\"",
      "chain": [
        "30025",
        "30382",
        "17533",
        "11027",
        "23"
      ]
    },
    {
      "hadith_no": "4214",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن محمد النفيلي، حدثنا عمرو بن واقد، عن يونس بن حلبس، عن أبي إدريس الخولاني، قال لما عزل عمر بن الخطاب عمير بن سعيد عن حمص، ولى معاوية فقال الناس عزل عميرا وولى معاوية ‏.‏ فقال عمير لا تذكروا معاوية إلا بخير فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم اهد به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قال وعمرو بن واقد يضعف ‏.‏",
      "text_en": " Narrated Abu Idris Al-Khawlani:                     \"When 'Umar bin Al-Khattab removed 'Umair bin Sa'd as governor of Hims, he appointed Mu'awiyah. The people said: 'He has removed 'Umair and appointed Mu'awiyah.' So 'Umair said: 'Do not mentioned Mu'awiyah except with good, for indeed, I heard the Messenger of Allah (ﷺ) saying: \"O Allah guide (others) by him.\"",
      "chain": [
        "11222",
        "30352",
        "17533",
        "11027"
      ]
    }
  ],
  "total_hadiths": 2
}