{
  "id": "18",
  "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
  "full_name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "10",
      "date_gregorian": "613",
      "date_display": [
        "10 BH",
        "613 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "693",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh",
      "Preacher"
    ],
    "tags": [
      "Quraish",
      "B.'Adi",
      "Early Muslim",
      "Emigrant",
      "Ridwan",
      "Khandaq",
      "Makki"
    ]
  },
  "parents": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "124",
      "name": "Zaynab bint Maz'un ( زينب بنت مظعون بن حبيب الجمحية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "11811",
      "name": "Safiyya bint Abi 'Ubaid al-Thaqafi صفية بنت أبي عبيد بن مسعود الثقفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "siblings": [
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "560",
      "name": "'Abdur Rahman bin 'Umar ( عبد الرحمن الأكبر بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11813",
      "name": "Waqid bin 'Abdullah ibn 'Umar واقد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11814",
      "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11815",
      "name": "'Umar bin 'Abdullah Ibn 'Umar عمر بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11816",
      "name": "Bilal bin 'Abdullah bin 'Umar بلال بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11819",
      "name": "Zayd bin 'Abdullah bin 'Umar زيد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "114",
      "name": "Zayd ibn al-Khattab ( زيد بن الخطاب بن نفيل العدوي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "182",
      "name": "Suhayb bin Sinan ar-Rumi ( صهيب بن سنان بن مالك الرومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11813",
      "name": "Waqid bin 'Abdullah ibn 'Umar واقد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11814",
      "name": "'Abdullah bin 'Abdullah Ibn 'Umar عبد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11815",
      "name": "'Umar bin 'Abdullah Ibn 'Umar عمر بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11816",
      "name": "Bilal bin 'Abdullah bin 'Umar بلال بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11819",
      "name": "Zayd bin 'Abdullah bin 'Umar زيد بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11817",
      "name": "'Ubaidullah bin 'Abdullah bin 'Umar عبيد الله بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "8",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن موسى، قال أخبرنا حنظلة بن أبي سفيان، عن عكرمة بن خالد، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بني الإسلام على خمس شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، والحج، وصوم رمضان ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          Allah's Apostle said: Islam is based on (the following) five      (principles):     1. To testify that none has the right to be worshipped but Allah and      Muhammad is Allah's Apostle.     2. To offer the (compulsory congregational) prayers dutifully and      perfectly.     3. To pay Zakat (i.e. obligatory charity) .     4. To perform Hajj. (i.e. Pilgrimage to Mecca)     5. To observe fast during the month of Ramadan.",
      "chain": [
        "20340",
        "11243",
        "11709",
        "18"
      ]
    },
    {
      "hadith_no": "24",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك بن أنس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم مر على رجل من الأنصار وهو يعظ أخاه في الحياء، فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعه فإن الحياء من الإيمان ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah (bin 'Umar):                          Once Allah's Apostle passed by an Ansari (man) who was admonishing to      his brother regarding Haya'. On that Allah's Apostle said, \"Leave him      as Haya' is a part of faith.\" (See Hadith No. 8)",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "25",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد المسندي، قال حدثنا أبو روح الحرمي بن عمارة، قال حدثنا شعبة، عن واقد بن محمد، قال سمعت أبي يحدث، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          Allah's Apostle said: \"I have been ordered (by Allah) to fight against     the people until they testify that none has the right to be worshipped     but Allah and that Muhammad is Allah's Apostle, and offer the prayers      perfectly and give the obligatory charity, so if they perform that,      then they save their lives and property from me except for Islamic laws     and then their reckoning (accounts) will be done by Allah.\"",
      "chain": [
        "30351",
        "20221",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "61",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وإنها مثل المسلم، فحدثوني ما هي ‏\"‏‏.‏ فوقع الناس في شجر البوادي‏.‏ قال عبد الله ووقع في نفسي أنها النخلة، فاستحييت ثم قالوا حدثنا ما هي يا رسول الله قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Apostle ?\" He replied, \"It is the date-palm tree.\"",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "62",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، حدثنا عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وإنها مثل المسلم، حدثوني ما هي ‏\"‏‏.‏ قال فوقع الناس في شجر البوادي‏.‏ قال عبد الله فوقع في نفسي أنها النخلة، ثم قالوا حدثنا ما هي يا رسول الله قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree. The others then asked, \"Please inform us what is that tree, O Allah's Apostle?\" He replied, \"It is the date-palm tree.\"",
      "chain": [
        "30463",
        "20160",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "72",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال قال لي ابن أبي نجيح عن مجاهد، قال صحبت ابن عمر إلى المدينة فلم أسمعه يحدث عن رسول الله صلى الله عليه وسلم إلا حديثا واحدا، قال كنا عند النبي صلى الله عليه وسلم فأتي بجمار فقال ‏\"‏ إن من الشجر شجرة مثلها كمثل المسلم ‏\"‏‏.‏ فأردت أن أقول هي النخلة، فإذا أنا أصغر القوم فسكت، قال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     We were with the Prophet and fresh dates of a palm tree were brought to him. On that he said, \"Amongst the trees, there is a tree which resembles a Muslim.\" I wanted to say that it was the datepalm tree but as I was the youngest of all (of them) I kept quiet. And then the Prophet said, \"It is the date-palm tree.\"",
      "chain": [
        "30026",
        "20005",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، عن حمزة بن عبد الله بن عمر، أن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم أتيت بقدح لبن، فشربت حتى إني لأرى الري يخرج في أظفاري، ثم أعطيت فضلي عمر بن الخطاب ‏\"‏‏.‏ قالوا فما أولته يا رسول الله قال ‏\"‏ العلم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"While I was sleeping, I saw that a cup full of milk was brought to me and I drank my fill till I noticed (the milk) its wetness coming out of my nails. Then I gave the remaining milk to `Umar Ibn Al-Khattab\" The companions of the Prophet asked, \"What have you interpreted (about this dream)? \"O Allah's Apostle ,!\" he replied, \"(It is religious) knowledge.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "116",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عبد الرحمن بن خالد، عن ابن شهاب، عن سالم، وأبي، بكر بن سليمان بن أبي حثمة أن عبد الله بن عمر، قال صلى بنا النبي صلى الله عليه وسلم العشاء في آخر حياته، فلما سلم قام فقال ‏\"‏ أرأيتكم ليلتكم هذه، فإن رأس مائة سنة منها لا يبقى ممن هو على ظهر الأرض أحد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once the Prophet led us in the `Isha' prayer during the last days of his life and after finishing it (the prayer) (with Taslim) he said: \"Do you realize (the importance of) this night?\" Nobody present on the surface of the earth tonight will be living after the completion of one hundred years from this night.\"",
      "chain": [
        "30233",
        "20023",
        "20376",
        "11013",
        "11011",
        "11547",
        "18"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وهي مثل المسلم، حدثوني ما هي ‏\"‏‏.‏ فوقع الناس في شجر البادية، ووقع في نفسي أنها النخلة‏.‏ قال عبد الله فاستحييت‏.‏ فقالوا يا رسول الله، أخبرنا بها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏ قال عبد الله فحدثت أبي بما وقع في نفسي فقال لأن تكون قلتها أحب إلى من أن يكون لي كذا وكذا‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once Allah's Apostle said, \"Amongst the trees there is a tree, the leaves of which do not fall and is like a Muslim, tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas and I thought of the date-palm tree but felt shy (to answer). The others asked, \"O Allah's Apostle! inform us of it.\" He replied, \"it is the date-palm tree.\" I told my father what had come to my mind and on that he said, \"Had you said it I would have preferred it to such and such a thing that I might possess.\"",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "133",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثني قتيبة بن سعيد، قال حدثنا الليث بن سعد، قال حدثنا نافع، مولى عبد الله بن عمر بن الخطاب عن عبد الله بن عمر،‏.‏ أن رجلا، قام في المسجد فقال يا رسول الله، من أين تأمرنا أن نهل فقال رسول الله صلى الله عليه وسلم ‏\"‏ يهل أهل المدينة من ذي الحليفة، ويهل أهل الشأم من الجحفة، ويهل أهل نجد من قرن ‏\"‏‏.‏ وقال ابن عمر ويزعمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ويهل أهل اليمن من يلملم ‏\"‏‏.‏ وكان ابن عمر يقول لم أفقه هذه من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Umar said: \"A man got up in the mosque and said: O Allah's Apostle 'At which place you order us that we should assume the Ihram?' Allah's Apostle replied, 'The residents of Medina should assure the Ihram from Dhil-Hulaifa, the people of Syria from Al-Juhfa and the people of Najd from Qarn.\" Ibn `Umar further said, \"The people consider that Allah's Apostle had also said, 'The residents of Yemen should assume Ihram from Yalamlam.' \" Ibn `Umar used to say, \"I do not: remember whether Allah's Apostle had said the last statement or not?\"",
      "chain": [
        "30367",
        "20023",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم‏.‏ وعن الزهري، عن سالم، عن ابن عمر، عن النبي صلى الله عليه وسلم أن رجلا سأله ما يلبس المحرم فقال ‏\"‏ لا يلبس القميص ولا العمامة ولا السراويل ولا البرنس ولا ثوبا مسه الورس أو الزعفران، فإن لم يجد النعلين فليلبس الخفين وليقطعهما حتى يكونا تحت الكعبين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man asked the Prophet : \"What (kinds of clothes) should a Muhrim (a Muslim intending to perform `Umra or Hajj) wear? He replied, \"He should not wear a shirt, a turban, trousers, a head cloak or garment scented with saffron or Wars (kinds of perfumes). And if he has no slippers, then he can use Khuffs (socks made from thick fabric or leather) but the socks should be cut short so as to make the ankles bare.\" (See Hadith No. 615, Vol. 2).",
      "chain": [
        "20404",
        "20177",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن عبد الله بن عمر، أنه كان يقول إن ناسا يقولون إذا قعدت على حاجتك، فلا تستقبل القبلة ولا بيت المقدس‏.‏ فقال عبد الله بن عمر لقد ارتقيت يوما على ظهر بيت لنا، فرأيت رسول الله صلى الله عليه وسلم على لبنتين مستقبلا بيت المقدس لحاجته‏.‏ وقال لعلك من الذين يصلون على أوراكهم، فقلت لا أدري والله‏.‏ قال مالك يعني الذي يصلي ولا يرتفع عن الأرض، يسجد وهو لاصق بالأرض‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     People say, \"Whenever you sit for answering the call of nature, you should not face the Qibla or Baitul-Maqdis (Jerusalem).\" I told them. \"Once I went up the roof of our house and I saw Allah's Apostle answering the call of nature while sitting on two bricks facing Baitul-Maqdis (Jerusalem) (but there was a screen covering him. ' (Fath-al-Bari, Page 258, Vol. 1).",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "148",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، عن عبيد الله، عن محمد بن يحيى بن حبان، عن واسع بن حبان، عن عبد الله بن عمر، قال ارتقيت فوق ظهر بيت حفصة لبعض حاجتي، فرأيت رسول الله صلى الله عليه وسلم يقضي حاجته مستدبر القبلة مستقبل الشأم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     I went up to the roof of Hafsa's house for some job and I saw Allah's Apostle answering the call of nature facing Sham (Syria, Jordan, Palestine and Lebanon regarded as one country) with his back towards the Qibla. (See Hadith No. 147).",
      "chain": [
        "30308",
        "20157",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا يزيد بن هارون، قال أخبرنا يحيى، عن محمد بن يحيى بن حبان، أن عمه، واسع بن حبان، أخبره أن عبد الله بن عمر أخبره قال لقد ظهرت ذات يوم على ظهر بيتنا، فرأيت رسول الله صلى الله عليه وسلم قاعدا على لبنتين مستقبل بيت المقدس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once I went up the roof of our house and saw Allah's Apostle answering the call of nature while sitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).",
      "chain": [
        "20184",
        "20472",
        "20031",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "174",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وقال أحمد بن شبيب حدثنا أبي، عن يونس، عن ابن شهاب، قال حدثني حمزة بن عبد الله، عن أبيه، قال كانت الكلاب تبول وتقبل وتدبر في المسجد في زمان رسول الله صلى الله عليه وسلم فلم يكونوا يرشون شيئا من ذلك‏.‏",
      "text_en": " And narrated      Hamza bin 'Abdullah:                      My father said. \"During the lifetime of Allah's      Apostle, the dogs used to urinate, and pass through the mosques (come      and go), nevertheless they never used to sprinkle water on it (urine      of the dog.)\"",
      "chain": [
        "30120",
        "20238",
        "20475",
        "11013",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "193",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أنه قال كان الرجال والنساء يتوضئون في زمان رسول الله صلى الله عليه وسلم جميعا‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                      \"During the lifetime of Allah's Messenger () men and women used to perform ablution together.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أصبغ بن الفرج المصري، عن ابن وهب، قال حدثني عمرو، حدثني أبو النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم أنه مسح على الخفين‏.‏ وأن عبد الله بن عمر سأل عمر عن ذلك فقال نعم إذا حدثك شيئا سعد عن النبي صلى الله عليه وسلم فلا تسأل عنه غيره‏.‏ وقال موسى بن عقبة أخبرني أبو النضر أن أبا سلمة أخبره أن سعدا حدثه فقال عمر لعبد الله‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin Abi Waqqas said, \"The Prophet passed wet hands over his Khuffs (socks made from thick fabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and added, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about it.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "20390",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "246",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وقال عفان حدثنا صخر بن جويرية، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أراني أتسوك بسواك، فجاءني رجلان أحدهما أكبر من الآخر، فناولت السواك الأصغر منهما، فقيل لي كبر‏.‏ فدفعته إلى الأكبر منهما ‏\"‏‏.‏ قال أبو عبد الله اختصره نعيم عن ابن المبارك عن أسامة عن نافع عن ابن عمر‏.‏",
      "text_en": " Narrated Ibn 'Umar:                      The Prophet () said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"",
      "chain": [
        "30106",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "287",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، قال حدثنا الليث، عن نافع، عن ابن عمر، أن عمر بن الخطاب، سأل رسول الله صلى الله عليه وسلم أيرقد أحدنا وهو جنب قال ‏\"‏ نعم إذا توضأ أحدكم فليرقد وهو جنب ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I asked Allah's Apostle \"Can any one of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution, he can sleep while he is Junub.\"",
      "chain": [
        "30367",
        "20023",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جويرية، عن نافع، عن عبد الله، قال استفتى عمر النبي صلى الله عليه وسلم أينام أحدنا وهو جنب قال ‏\"‏ نعم، إذا توضأ ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     `Umar asked the Prophet \"Can anyone of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال ذكر عمر بن الخطاب لرسول الله صلى الله عليه وسلم أنه تصيبه الجنابة من الليل، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ توضأ واغسل ذكرك ثم نم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab told Allah's Apostle, \"I became Junub at night.\" Allah's Apostle replied, \"Perform ablution after washing your private parts and then sleep.\"",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "329",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال رخص للحائض أن تنفر، إذا حاضت‏.‏   وكان ابن عمر يقول في أول أمره إنها لا تنفر‏.‏ ثم سمعته يقول تنفر إن رسول الله صلى الله عليه وسلم رخص لهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar formerly used to say that she should not leave but later on I heard him saying, \"She may leave, since Allah's Apostle gave them the permission to leave (after Tawaf-Al-Ifada).\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17",
        "18"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عاصم بن علي، قال حدثنا ابن أبي ذئب، عن الزهري، عن سالم، عن ابن عمر، قال سأل رجل رسول الله صلى الله عليه وسلم فقال ما يلبس المحرم فقال ‏\"‏ لا يلبس القميص ولا السراويل ولا البرنس ولا ثوبا مسه الزعفران ولا ورس، فمن لم يجد النعلين فليلبس الخفين وليقطعهما حتى يكونا أسفل من الكعبين ‏\"‏‏.‏ وعن نافع عن ابن عمر عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A person asked Allah's Apostle, \"What should a Muhrim wear?\" He replied, \"He should not wear shirts, trousers, a burnus (a hooded cloak), or clothes which are stained with saffron or Wars (a kind of perfume). Whoever does not find a sandal to wear can wear Khuffs (socks made from thick fabric or leather), but these should be cut short so as not to cover the ankles.",
      "chain": [
        "20430",
        "20177",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا عمرو بن دينار، قال سألنا ابن عمر عن رجل، طاف بالبيت العمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة، وقد كان لكم في رسول الله أسوة حسنة‏.‏ وسألنا جابر بن عبد الله فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     I asked Ibn `Umar, \"Can a person who has performed the Tawaf around the Ka`ba for `Umra but has not performed the (Sa`i) Tawaf of Safa and Marwa, have a sexual relation with his wife?\" Ibn `Umar replied \"When the Prophet reached Mecca he performed the Tawaf around the Ka`ba (circumambulated it seven times) and offered a two-rak`at prayer (at the place) behind the station (of Abraham) and then performed the Tawaf (Sa`i) of Safa and Marwa, and verily in Allah's Apostle you have a good example.\" Then we put the same question to Jabir bin `Abdullah and he too replied, \"He should not go near his wife (for sexual relation) till he has finished the Tawaf of Safa and Marwa.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "403",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك بن أنس، عن عبد الله بن دينار، عن عبد الله بن عمر، قال بينا الناس بقباء في صلاة الصبح إذ جاءهم آت فقال إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن، وقد أمر أن يستقبل الكعبة فاستقبلوها، وكانت وجوههم إلى الشأم، فاستداروا إلى الكعبة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the people were offering the Fajr prayer at Quba' (near Medina), someone came to them and said: \"It has been revealed to Allah's Apostle tonight, and he has been ordered to pray facing the Ka`ba.\" So turn your faces to the Ka`ba. Those people were facing Sham (Jerusalem) so they turned their faces towards Ka`ba (at Mecca).",
      "chain": [
        "30355",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم سابق بين الخيل التي أضمرت من الحفياء، وأمدها ثنية الوداع، وسابق بين الخيل التي لم تضمر من الثنية إلى مسجد بني زريق، وأن عبد الله بن عمر كان فيمن سابق بها‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle ordered for a horse race; the trained horses were to run from a place called Al-Hafya' to Thaniyat Al-Wada` and the horses which were not trained were to run from Al-Thaniya to the Masjid (mosque of) Bani Zuraiq. The sub narrator added: Ibn `Umar was one of those who took part in the race.",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ اجعلوا في بيوتكم من صلاتكم، ولا تتخذوها قبورا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet had said, \"Offer some of your prayers (Nawafil) at home, and do not take your houses as graves.\"",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "433",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين، فإن لم تكونوا باكين فلا تدخلوا عليهم، لا يصيبكم ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Do not enter (the places) of these people where Allah's punishment had fallen unless you do so weeping. If you do not weep, do not enter (the places of these people) because Allah's curse and punishment which fell upon them may fall upon you.\"",
      "chain": [
        "30103",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن عبيد الله، قال حدثني نافع، قال أخبرني عبد الله، أنه كان ينام وهو شاب أعزب لا أهل له في مسجد النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Umar said: I used to sleep in the mosque of the Prophet while I was young and unmarried.",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "446",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يعقوب بن إبراهيم بن سعد، قال حدثني أبي، عن صالح بن كيسان، قال حدثنا نافع، أن عبد الله، أخبره أن المسجد كان على عهد رسول الله صلى الله عليه وسلم مبنيا باللبن، وسقفه الجريد، وعمده خشب النخل، فلم يزد فيه أبو بكر شيئا، وزاد فيه عمر وبناه على بنيانه في عهد رسول الله صلى الله عليه وسلم باللبن والجريد، وأعاد عمده خشبا، ثم غيره عثمان، فزاد فيه زيادة كثيرة، وبنى جداره بالحجارة المنقوشة والقصة، وجعل عمده من حجارة منقوشة، وسقفه بالساج‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     In the lifetime of Allah's Apostle the mosque was built of adobes, its roof of the leaves of date-palms and its pillars of the stems of date-palms. Abu Bakr did not alter it. `Umar expanded it on the same pattern as it was in the lifetime of Allah's Apostle by using adobes, leaves of date-palms and changing the pillars into wooden ones. `Uthman changed it by expanding it to a great extent and built its walls with engraved stones and lime and made its pillars of engraved stones and its roof of teak wood.",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، وقتيبة، قالا حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قدم مكة، فدعا عثمان بن طلحة، ففتح الباب، فدخل النبي صلى الله عليه وسلم وبلال وأسامة بن زيد وعثمان بن طلحة، ثم أغلق الباب، فلبث فيه ساعة ثم خرجوا‏.‏ قال ابن عمر فبدرت فسألت بلالا فقال صلى فيه‏.‏ فقلت في أى قال بين الأسطوانتين‏.‏ قال ابن عمر فذهب على أن أسأله كم صلى‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"The Prophet arrived at Mecca and sent for `Uthman bin Talha. He opened the gate of the Ka`ba and the Prophet, Bilal, Usama bin Zaid and `Uthman bin Talha entered the Ka`ba and then they closed its door (from inside). They stayed there for an hour, and then came out.\" Ibn `Umar added, \"I quickly went to Bilal and asked him (whether the Prophet had prayed). Bilal replied, 'He prayed in it.' I asked, 'Where?' He replied, 'Between the two pillars.' \"Ibn `Umar added, \"I forgot to ask how many rak`at he (the Prophet) had prayed in the Ka`ba.\"",
      "chain": [
        "20283",
        "30367",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "472",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر بن المفضل، عن عبيد الله، عن نافع، عن ابن عمر، قال سأل رجل النبي صلى الله عليه وسلم وهو على المنبر ما ترى في صلاة الليل قال ‏\"‏ مثنى مثنى، فإذا خشي الصبح صلى واحدة، فأوترت له ما صلى ‏\"‏‏.‏ وإنه كان يقول اجعلوا آخر صلاتكم وترا، فإن النبي صلى الله عليه وسلم أمر به‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"While the Prophet was on the pulpit, a man asked him how to offer the night prayers. He replied, 'Pray two rak`at at a time and then two and then two and so on, and if you are afraid of the dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the witr for all the rak`at which you have offered.\" Ibn `Umar said, \"The last rak`at of the night prayer should be odd, for the Prophet ordered it to be so.",
      "chain": [
        "30175",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وهو يخطب فقال كيف صلاة الليل فقال ‏\"‏ مثنى مثنى، فإذا خشيت الصبح فأوتر بواحدة، توتر لك ما قد صليت ‏\"‏‏.‏ قال الوليد بن كثير حدثني عبيد الله بن عبد الله أن ابن عمر حدثهم أن رجلا نادى النبي صلى الله عليه وسلم وهو في المسجد‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man came to the Prophet while he was delivering the sermon and asked him how to offer the night prayers. The Prophet replied, 'Pray two rak`at at a time and then two and then two and so on and if you are afraid of dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the with for all the rak`at which you have prayed.\" Narrated 'Ubaidullah bin `Abdullah bin `Umar: A man called the Prophet while he was in the mosque.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أنس بن عياض، قال حدثنا موسى بن عقبة، عن نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم كان ينزل بذي الحليفة حين يعتمر، وفي حجته حين حج، تحت سمرة في موضع المسجد الذي بذي الحليفة، وكان إذا رجع من غزو كان في تلك الطريق أو حج أو عمرة هبط من بطن واد، فإذا ظهر من بطن واد أناخ بالبطحاء التي على شفير الوادي الشرقية، فعرس ثم حتى يصبح، ليس عند المسجد الذي بحجارة، ولا على الأكمة التي عليها المسجد، كان ثم خليج يصلي عبد الله عنده، في بطنه كثب كان رسول الله صلى الله عليه وسلم ثم يصلي، فدحا السيل فيه بالبطحاء حتى دفن ذلك المكان الذي كان عبد الله يصلي فيه‏.‏",
      "text_en": " The narrated Hadith is about the various places on the way from Medina to Mecca where the Prophet () prayed and is not translated.",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "485",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وأن عبد الله بن عمر حدثه أن النبي صلى الله عليه وسلم صلى حيث المسجد الصغير الذي دون المسجد الذي بشرف الروحاء، وقد كان عبد الله يعلم المكان الذي كان صلى فيه النبي صلى الله عليه وسلم يقول ثم عن يمينك حين تقوم في المسجد تصلي، وذلك المسجد على حافة الطريق اليمنى، وأنت ذاهب إلى مكة، بينه وبين المسجد الأكبر رمية بحجر أو نحو ذلك‏.‏",
      "text_en": " See translation for hadith 484 above",
      "chain": [
        "18"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وأن ابن عمر كان يصلي إلى العرق الذي عند منصرف الروحاء، وذلك العرق انتهاء طرفه على حافة الطريق، دون المسجد الذي بينه وبين المنصرف، وأنت ذاهب إلى مكة‏.‏ وقد ابتني ثم مسجد، فلم يكن عبد الله يصلي في ذلك المسجد، كان يتركه عن يساره ووراءه، ويصلي أمامه إلى العرق نفسه، وكان عبد الله يروح من الروحاء، فلا يصلي الظهر حتى يأتي ذلك المكان فيصلي فيه الظهر، وإذا أقبل من مكة فإن مر به قبل الصبح بساعة أو من آخر السحر عرس حتى يصلي بها الصبح‏.‏",
      "text_en": " See translation for hadith 484 above",
      "chain": [
        "18"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وأن عبد الله حدثه أن النبي صلى الله عليه وسلم كان ينزل تحت سرحة ضخمة دون الرويثة عن يمين الطريق، ووجاه الطريق في مكان بطح سهل، حتى يفضي من أكمة دوين بريد الرويثة بميلين، وقد انكسر أعلاها، فانثنى في جوفها، وهي قائمة على ساق، وفي ساقها كثب كثيرة‏.‏",
      "text_en": " See translation for hadith 484 above",
      "chain": [
        "18"
      ]
    },
    {
      "hadith_no": "488",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وأن عبد الله بن عمر حدثه أن النبي صلى الله عليه وسلم صلى في طرف تلعة من وراء العرج وأنت ذاهب إلى هضبة عند ذلك المسجد قبران أو ثلاثة، على القبور رضم من حجارة عن يمين الطريق، عند سلمات الطريق، بين أولئك السلمات كان عبد الله يروح من العرج بعد أن تميل الشمس بالهاجرة، فيصلي الظهر في ذلك المسجد‏.‏",
      "text_en": " See translation for hadith 484 above",
      "chain": [
        "18"
      ]
    },
    {
      "hadith_no": "489",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وأن عبد الله بن عمر حدثه أن رسول الله صلى الله عليه وسلم نزل عند سرحات عن يسار الطريق، في مسيل دون هرشى، ذلك المسيل لاصق بكراع هرشى، بينه وبين الطريق قريب من غلوة، وكان عبد الله يصلي إلى سرحة، هي أقرب السرحات إلى الطريق وهى أطولهن‏.‏",
      "text_en": " See translation for hadith 484 above",
      "chain": [
        "18"
      ]
    },
    {
      "hadith_no": "494",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا عبد الله بن نمير، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا خرج يوم العيد أمر بالحربة فتوضع بين يديه، فيصلي إليها والناس وراءه، وكان يفعل ذلك في السفر، فمن ثم اتخذها الأمراء‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Whenever Allah's Apostle came out on `Id day, he used to order that a Harba [??] (a short spear) to be planted in front of him (as a Sutra for his prayer) and then he used to pray facing it with the people behind him and used to do the same while on a journey. After the Prophet , this practice was adopted by the Muslim rulers (who followed his traditions).",
      "chain": [
        "30313",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "498",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن عبيد الله، أخبرني نافع، عن عبد الله، أن النبي صلى الله عليه وسلم كان يركز له الحربة فيصلي إليها‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet used to get a Harba planted in front of him (as a Sutra) and pray behind it.",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جويرية، عن نافع، عن ابن عمر، قال دخل النبي صلى الله عليه وسلم البيت وأسامة بن زيد وعثمان بن طلحة وبلال، فأطال ثم خرج، وكنت أول الناس دخل على أثره فسألت بلالا أين صلى قال بين العمودين المقدمين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet entered the Ka`ba along with Usama bin Zaid, `Uthman bin Talha and Bilal and remained there for a long time. When they came out, I was the first man to enter the Ka`ba. I asked Bilal \"Where did the Prophet pray?\" Bilal replied, \"Between the two front Pillars.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم دخل الكعبة وأسامة بن زيد وبلال وعثمان بن طلحة الحجبي فأغلقها عليه ومكث فيها، فسألت بلالا حين خرج ما صنع النبي صلى الله عليه وسلم قال جعل عمودا عن يساره، وعمودا عن يمينه، وثلاثة أعمدة وراءه، وكان البيت يومئذ على ستة أعمدة، ثم صلى‏.‏ وقال لنا إسماعيل حدثني مالك وقال عمودين عن يمينه‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Umar said, \"Allah's Apostle entered the Ka`ba along with Usama bin Zaid, Bilal and `Uthman bin Talha Al-Hajabi and closed the door and stayed there for some time. I asked Bilal when he came out, 'What did the Prophet do?' He replied, 'He offered prayer with one pillar to his left and one to his right and three behind.' In those days the Ka`ba was supported by six pillars.\" Malik said: \"There were two pillars on his (the Prophet's) right side.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا أبو ضمرة، قال حدثنا موسى بن عقبة، عن نافع، أن عبد الله، كان إذا دخل الكعبة مشى قبل وجهه حين يدخل، وجعل الباب قبل ظهره، فمشى حتى يكون بينه وبين الجدار الذي قبل وجهه قريبا من ثلاثة أذرع، صلى يتوخى المكان الذي أخبره به بلال أن النبي صلى الله عليه وسلم صلى فيه‏.‏ قال وليس على أحدنا بأس إن صلى في أى نواحي البيت شاء‏.‏",
      "text_en": " Narrated Nafi':                      Whenever 'Abdullah entered the Ka'bah, he used to go ahead leaving the door of the Ka'bah behind him. He would proceed on till the remaining distance between him and the opposite wall about three cubits. Then he would off prayer there where the Prophet () had offered Salat, as Bilal informed me. Ibn 'Umar said, \"It does not matter for any of us to offer prayers at any place inside the Ka'bah.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا معتمر، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه كان يعرض راحلته فيصلي إليها‏.‏ قلت أفرأيت إذا هبت الركاب‏.‏ قال كان يأخذ هذا الرحل فيعدله فيصلي إلى آخرته  أو قال مؤخره  وكان ابن عمر  رضى الله عنه  يفعله‏.‏",
      "text_en": " Narrated Nafi`:                     \"The Prophet used to make his she-camel sit across and he would pray facing it (as a Sutra).\" I asked, \"What would the Prophet do if the she-camel was provoked and moved?\" He said, \"He would take its camel-saddle and put it in front of him and pray facing its back part (as a Sutra). And Ibn `Umar used to do the same.\" (This indicates that one should not pray except behind a Sutra).",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "552",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذي تفوته صلاة العصر كأنما وتر أهله وماله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Whoever misses the `Asr prayer (intentionally) then it is as if he lost his family and property.\"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني إبراهيم، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أنه أخبره أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما بقاؤكم فيما سلف قبلكم من الأمم كما بين صلاة العصر إلى غروب الشمس، أوتي أهل التوراة التوراة فعملوا حتى إذا انتصف النهار عجزوا، فأعطوا قيراطا قيراطا، ثم أوتي أهل الإنجيل الإنجيل فعملوا إلى صلاة العصر، ثم عجزوا، فأعطوا قيراطا قيراطا، ثم أوتينا القرآن فعملنا إلى غروب الشمس، فأعطينا قيراطين قيراطين، فقال أهل الكتابين أى ربنا أعطيت هؤلاء قيراطين قيراطين، وأعطيتنا قيراطا قيراطا، ونحن كنا أكثر عملا، قال قال الله عز وجل هل ظلمتكم من أجركم من شىء قالوا لا، قال فهو فضلي أوتيه من أشاء ‏\"‏‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     My father said, \"I heard Allah's Apostle saying, 'The period of your stay as compared to the previous nations is like the period equal to the time between the `Asr prayer and sunset. The people of the Torah were given the Torah and they acted (upon it) till midday then they were exhausted and were given one Qirat (of gold) each. And then the people of the Gospel were given the Gospel and they acted (upon it) till the `Asr prayer then they were exhausted and were! given one Qirat each. And then we were given the Qur'an and we acted (upon it) till sunset and we were given two Qirats each. On that the people of both the scriptures said, 'O our Lord! You have given them two Qirats and given us one Qirat, though we have worked more than they.' Allah said, 'Have I usurped some of your right?' They said, 'No.' Allah said: \"That is my blessing I bestow upon whomsoever I wish.\"",
      "chain": [
        "30105",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "564",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال سالم أخبرني عبد الله، قال صلى لنا رسول الله صلى الله عليه وسلم ليلة صلاة العشاء  وهى التي يدعو الناس العتمة  ثم انصرف فأقبل علينا فقال ‏\"‏ أرأيتم ليلتكم هذه فإن رأس مائة سنة منها لا يبقى ممن هو على ظهر الأرض أحد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     \"One night Allah's Apostle led us in the `Isha' prayer and that is the one called Al-`Atma [??] by the people. After the completion of the prayer, he faced us and said, \"Do you know the importance of this night? Nobody present on the surface of the earth tonight will be living after one hundred years from this night.\" (See Hadith No. 575).",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "571",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود، قال أخبرنا عبد الرزاق، قال أخبرني ابن جريج، قال أخبرني نافع، قال حدثنا عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم شغل عنها ليلة، فأخرها حتى رقدنا في المسجد، ثم استيقظنا ثم رقدنا ثم استيقظنا، ثم خرج علينا النبي صلى الله عليه وسلم ثم قال ‏\"‏ ليس أحد من أهل الأرض ينتظر الصلاة غيركم ‏\"‏‏.‏ وكان ابن عمر لا يبالي أقدمها أم أخرها إذا كان لا يخشى أن يغلبه النوم عن وقتها، وكان يرقد قبلها‏.‏ قال ابن جريج قلت لعطاء وقال سمعت ابن عباس، يقول أعتم رسول الله صلى الله عليه وسلم ليلة بالعشاء حتى رقد الناس واستيقظوا، ورقدوا واستيقظوا، فقام عمر بن الخطاب فقال الصلاة‏.‏ قال عطاء قال ابن عباس فخرج نبي الله صلى الله عليه وسلم كأني أنظر إليه الآن، يقطر رأسه ماء، واضعا يده على رأسه فقال ‏\"‏ لولا أن أشق على أمتي لأمرتهم أن يصلوها هكذا ‏\"‏‏.‏ فاستثبت عطاء كيف وضع النبي صلى الله عليه وسلم على رأسه يده كما أنبأه ابن عباس، فبدد لي عطاء بين أصابعه شيئا من تبديد، ثم وضع أطراف أصابعه على قرن الرأس ثم ضمها، يمرها كذلك على الرأس حتى مست إبهامه طرف الأذن مما يلي الوجه على الصدغ، وناحية اللحية، لا يقصر ولا يبطش إلا كذلك وقال ‏\"‏ لولا أن أشق على أمتي لأمرتهم أن يصلوا هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Juraij from Nafi`:                     `Abdullah bin `Umar said, \"Once Allah's Apostle was busy (at the time of the `Isha'), so the prayer was delayed so much so that we slept and woke up and slept and woke up again. The Prophet came out and said, 'None amongst the dwellers of the earth but you have been waiting for the prayer.\" Ibn `Umar did not find any harm in praying it earlier or in delaying it unless he was afraid that sleep might overwhelm him and he might miss the prayer, and sometimes he used to sleep before the `Isha' prayer. Ibn Juraij said, \"I said to `Ata', 'I heard Ibn `Abbas saying: Once Allah's Apostle delayed the `Isha' prayer to such an extent that the people slept and got up and slept again and got up again. Then `Umar bin Al-Khattab I, stood up and reminded the Prophet I of the prayer.' `Ata' said, 'Ibn `Abbas said: The Prophet came out as if I was looking at him at this time, and water was trickling from his head and he was putting his hand on his head and then said, 'Hadn't I thought it hard for my followers, I would have ordered them to pray (`Isha' prayer) at this time.' I asked `Ata' for further information, how the Prophet had kept his hand on his head as he was told by Ibn `Abbas. `Ata' separated his fingers slightly and put their tips on the side of the head, brought the fingers downwards approximating them till the thumb touched the lobe of the ear at the side of the temple and the beard on the face. He neither slowed nor hurried in this action but he acted like that. The Prophet said: \"Hadn't I thought it hard for my followers I would have ordered them to pray at this time.\"",
      "chain": [
        "30277",
        "20121",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "583",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى بن سعيد، عن هشام، قال أخبرني أبي قال، أخبرني ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحروا بصلاتكم طلوع الشمس ولا غروبها ‏\"‏‏.‏ وقال حدثني ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا طلع حاجب الشمس فأخروا الصلاة حتى ترتفع، وإذا غاب حاجب الشمس فأخروا الصلاة حتى تغيب ‏\"‏‏.‏ تابعه عبدة‏.‏",
      "text_en": " Narrated Hisham's father:                     Ibn `Umar said, \"Allah's Apostle said, 'Do not pray at the time of sunrise and at the time of sunset.' \" Ibn `Umar said, \"Allah's Apostle said, 'If the edge of the sun appears (above the horizon) delay the prayer till it becomes high, and if the edge of the sun disappears, delay the prayer till it sets (disappears completely).' \"",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "18"
      ]
    }
  ],
  "total_hadiths": 2813
}