{
  "id": "18017",
  "name": "Artah bin al-Mundhir bin al-Aswad أرطاة بن المنذر بن الأسود",
  "full_name": "Artah bin al-Mundhir bin al-Aswad أرطاة بن المنذر بن الأسود",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "163",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18561",
      "name": "'Abdullah bin Ghabir,Abu 'Amir al-Alhani عبد الله بن غابر أبو عامر الألهاني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28238",
      "name": "Shryh bin Yazid al-Hdrmy شريح بن يزيد الحضرمي أبو حيوة الحمصي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20447",
      "name": "'Isam bin Khalid عصام بن خالد الحضرمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3050",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أشعث بن شعبة، حدثنا أرطاة بن المنذر، قال سمعت حكيم بن عمير أبا الأحوص، يحدث عن العرباض بن سارية السلمي، قال نزلنا مع النبي صلى الله عليه وسلم خيبر ومعه من معه من أصحابه وكان صاحب خيبر رجلا ماردا منكرا فأقبل إلى النبي صلى الله عليه وسلم فقال يا محمد ألكم أن تذبحوا حمرنا وتأكلوا ثمرنا وتضربوا نساءنا فغضب يعني النبي صلى الله عليه وسلم وقال ‏\"‏ يا ابن عوف اركب فرسك ثم ناد ألا إن الجنة لا تحل إلا لمؤمن وأن اجتمعوا للصلاة ‏\"‏ ‏.‏ قال فاجتمعوا ثم صلى بهم النبي صلى الله عليه وسلم ثم قام فقال ‏\"‏ أيحسب أحدكم متكئا على أريكته قد يظن أن الله لم يحرم شيئا إلا ما في هذا القرآن ألا وإني والله قد وعظت وأمرت ونهيت عن أشياء إنها لمثل القرآن أو أكثر وأن الله عز وجل لم يحل لكم أن تدخلوا بيوت أهل الكتاب إلا بإذن ولا ضرب نسائهم ولا أكل ثمارهم إذا أعطوكم الذي عليهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Irbad ibn Sariyah as-Sulami:                     We alighted with the Prophet (ﷺ) at Khaybar, and he had his companions with him. The chief of Khaybar was a defiant and abominable man.  He came to the Prophet (ﷺ) and said: Is it proper for you, Muhammad, that you slaughter our donkeys, eat our fruit, and beat our women?  The Prophet (ﷺ) became angry and said: Ibn Awf, ride your horse, and call loudly: Beware, Paradise is lawful only for a believer, and that they (the people) should gather for prayer.  They gathered and the Prophet (ﷺ) led them in prayer, stood up and said: Does any of you, while reclining on his couch, imagine that Allah has prohibited only that which is to be found in this Qur'an? By Allah, I have preached, commanded and prohibited various matters as numerous as that which is found in the Qur'an, or more numerous. Allah has not permitted you to enter the houses of the people of the Book without permission, or beat their women, or eat their fruits when they give you that which is imposed on them.",
      "chain": [
        "31167",
        "28050",
        "18017",
        "17017",
        "5172"
      ]
    }
  ],
  "total_hadiths": 1
}