{
  "id": "18019",
  "name": "al-Azhar bin 'Abdullah al-Harazi أزهر بن عبد الله",
  "full_name": "al-Azhar bin 'Abdullah al-Harazi أزهر بن عبد الله",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "Himsi",
      "Al-Harazi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Hims",
        "ar": "Hims",
        "ckb": "Hims"
      }
    ],
    "tags_display": [
      {
        "en": "Himsi",
        "ar": "Himsi",
        "ckb": "Himsi"
      },
      {
        "en": "Al-Harazi",
        "ar": "Al-Harazi",
        "ckb": "Al-Harazi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4382",
      "hadith_no": "4382",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان، حدثنا أزهر بن عبد الله الحرازي، أن قوما، من الكلاعيين سرق لهم متاع فاتهموا أناسا من الحاكة فأتوا النعمان بن بشير صاحب النبي صلى الله عليه وسلم فحبسهم أياما ثم خلى سبيلهم فأتوا النعمان فقالوا خليت سبيلهم بغير ضرب ولا امتحان ‏.‏ فقال النعمان ما شئتم إن شئتم أن أضربهم فإن خرج متاعكم فذاك وإلا أخذت من ظهوركم مثل ما أخذت من ظهورهم ‏.‏ فقالوا هذا حكمك فقال هذا حكم الله وحكم رسوله صلى الله عليه وسلم ‏.‏ قال أبو داود إنما أرهبهم بهذا القول أى لا يجب الضرب إلا بعد الاعتراف ‏.‏",
      "text_en": " Azhar ibn Abdullah al-Harari said:                      Some goods of the people of Kila' were stolen. They accused some men of the weavers (of theft). They came to an-Nu'man ibn Bashir, the companion of the Prophet (ﷺ). He confined them for some days and then set them free.  They came to an-Nu'man and said: You have set them free without beating and investigation. An-Nu'man said: What do you want? You want me to beat them. If your goods are found with them, then it is all right; otherwise, I shall take (retaliation) from your back as I have taken from their backs.  They asked: Is this your decision?  He said: This is the decision of Allah and His Apostle (ﷺ).Abu Dawud said: By this statement he frightened them ; that is, beating is not necessary except after acknowledgement.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "10921",
        "18019"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4597",
      "hadith_no": "4597",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5085",
      "hadith_no": "5085",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا كثير بن عبيد، حدثنا بقية بن الوليد، عن عمر بن جعثم، قال حدثني الأزهر بن عبد الله الحرازي، قال حدثني شريق الهوزني، قال دخلت على عائشة رضى الله عنها فسألتها بم كان رسول الله صلى الله عليه وسلم يفتتح إذا هب من الليل فقالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان إذا هب من الليل كبر عشرا وحمد عشرا وقال ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏ عشرا وقال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ عشرا واستغفر عشرا وهلل عشرا ثم قال ‏\"‏ اللهم إني أعوذ بك من ضيق الدنيا وضيق يوم القيامة ‏\"‏ ‏.‏ عشرا ثم يفتتح الصلاة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Shariq al-Hawzani and I came to Aisha (Allah be pleased with her) and asked her: By which (prayer) the Messenger of Allah (ﷺ) began when he woke up at night? She replied: You asked me about a thing which no one asked me before. When he woke up at night, he uttered: \"Allah is Most Great\" ten times, and uttered \"Praise be to Allah\" ten times, and said \"Glory be to Allah and I begin with His praise\" ten times, and said: \"Glory be to the King, the Most Holy\" ten times, and asked Allah's pardon ten times, and said: \"There is no god but Allah\" ten times, and then said: \"O Allah! I seek refuge in Thee from the strait of the Day of resurrection,\" ten times. He then began the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "18019"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-4874",
      "hadith_no": "4874",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني صفوان بن عمرو، قال حدثني أزهر بن عبد الله الحرازي، عن النعمان بن بشير، أنه رفع إليه نفر من الكلاعيين أن حاكة سرقوا متاعا فحبسهم أياما ثم خلى سبيلهم فأتوه فقالوا خليت سبيل هؤلاء بلا امتحان ولا ضرب ‏.‏ فقال النعمان ما شئتم إن شئتم أضربهم فإن أخرج الله متاعكم فذاك وإلا أخذت من ظهوركم مثله ‏.‏ قالوا هذا حكمك ‏.‏ قال هذا حكم الله عز وجل ورسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that:                     a group of the Kala'iyin complaned to him about some people who had stolen some goods, shoe detained them for several days, and then he let them go. They came and said: \"You let them go without any pressure (to make them admit to their crime) or beating?\" An-Nu'man said: \"What do you want? If you wish, I will beat them, and if Allah brings back your goods thereby, all well and good. Otherwise I will take retaliation from your backs (by beating you) likewise.\" They said: \"is this your ruling?\" He said: \"This is the ruling of Allah and His Messenger \"(Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20644",
        "10921",
        "18019",
        "274"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "Follower (Tabi') [5th Generation]",
    "ar": "تابعي [الجيل الخامس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
  }
}