{
  "id": "18048",
  "name": "Isma'il bin Muslim bin Aby إسماعيل بن مسلم بن أبي",
  "full_name": "Isma'il bin Muslim bin Aby إسماعيل بن مسلم بن أبي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ تمييز  -  صدوق ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11165",
      "name": "Salm Abu al-Ghyth al-Madni سالم أبو الغيث المدني مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11155",
      "name": "Thur bin Zayd al-Dayli ثور بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3427",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثني أحمد بن صالح، حدثنا ابن أبي فديك، عن عبيد الله، - يعني ابن هرير - عن أبيه، عن جده، رافع - هو ابن خديج - قال نهى رسول الله صلى الله عليه وسلم عن كسب الأمة حتى يعلم من أين هو ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     The Messenger of Allah (ﷺ) forbade earnings of a slave-girl unless it is known from where it came.",
      "chain": [
        "30226",
        "20172",
        "18048",
        "1986"
      ]
    },
    {
      "hadith_no": "5173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن داود المنكدري، قال حدثنا ابن أبي فديك، عن الضحاك، عن إبراهيم بن حنين، عن أبيه، عن عبد الله بن عباس، عن علي، قال نهاني رسول الله صلى الله عليه وسلم ولا أقول نهاكم عن تختم الذهب وعن لبس القسي وعن لبس المفدم والمعصفر وعن القراءة راكعا ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me- but I do not say that he forbade you- from wearing rings of gold, and from wearing Al-Qassi, and from wearing Al-Mufaddam (garments dyed deep red) and Al-Mu'asfar (garments dyed with safflower), and from reciting Qur'an while bowing.\"",
      "chain": [
        "32007",
        "20172",
        "18048",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا ابن أبي فديك، عن عبد المهيمن بن عباس بن سهل بن سعد الساعدي، عن أبيه، عن جده، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا صلاة لمن لا وضوء له ولا وضوء لمن لم يذكر اسم الله عليه ولا صلاة لمن لا يصلي على النبي  صلى الله عليه وسلم  ولا صلاة لمن لا يحب الأنصار ‏\"‏ ‏.‏",
      "text_en": " It was narrated by 'Abdul-Muhaimin bin 'Abbas bin Sahl bin Sa'd As-Sa'idi, from his father, from his grandfather, that:                     The Prophet said: \"There is no prayer for one who does not have ablution, and there is no ablution for one who does not mention the Name of Allah (before it). There is no prayer for one who does not send blessing, (Salat) upon the Prophet, and there is no prayer for one who does not love the Ansar.\" (Da'if)Another chain with similar wording.",
      "chain": [
        "30285",
        "20172",
        "18048"
      ]
    },
    {
      "hadith_no": "3594",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا ابن أبي فديك، عن عبد المهيمن بن عباس بن سهل بن سعد الساعدي، عن أبيه، عن جده، قال إني لأعرف يوم أحد من جرح وجه رسول الله  صلى الله عليه وسلم  ومن كان يرقئ الكلم من وجه رسول الله  صلى الله عليه وسلم  ويداويه ومن يحمل الماء في المجن وبما دووي به الكلم حتى رقأ ‏.‏ قال أما من كان يحمل الماء في المجن فعلي وأما من كان يداوي الكلم ففاطمة أحرقت له حين لم يرقأ قطعة حصير خلق فوضعت رماده عليه فرقأ الكلم ‏.‏",
      "text_en": " It wasnarrated from ‘Abdul-Muhaimin bin ‘Abbas bin Sahl bin Sa’dAs-Sa’idi, from his father, that his grandfather said:                      “On theDay ofUhud, I recognized the one who wounded the face of theMessenger ofAllah (ﷺ), the one who was washing the blood from theface of theMessenger of Allah (ﷺ) and treating him, and the onewho wasbringing the water in a shield, and with what the wound wastreateduntil the bleeding stopped. The one who was carrying thewater in theshield was ‘Ali. The one who was treating the woundwas Fatimah. Whenthe bleeding would not stop, she burned a piece ofa worn out mat andapplied the ashes to it (the wound), then thebleeding stopped.",
      "chain": [
        "30285",
        "20172",
        "18048"
      ]
    }
  ],
  "total_hadiths": 4
}