{
  "id": "18069",
  "name": "Ayoub bin Qtn أيوب بن قطن",
  "full_name": "Ayoub bin Qtn أيوب بن قطن",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ق  -  لين الحديث ]"
    ],
    "tags": [
      "al-Kundi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4062",
      "name": "Ubayy bin 'Umara ( أبي بن عمارة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28545",
      "name": "Muhammad bin Yazid bin Sinan محمد بن يزيد بن سنان الجزري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "158",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، حدثنا عمرو بن الربيع بن طارق، أخبرنا يحيى بن أيوب، عن عبد الرحمن بن رزين، عن محمد بن يزيد، عن أيوب بن قطن، عن أبى بن عمارة، - قال يحيى بن أيوب وكان قد صلى مع رسول الله صلى الله عليه وسلم للقبلتين - أنه قال يا رسول الله أمسح على الخفين قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال يوما قال ‏\"‏ يوما ‏\"‏ ‏.‏ قال ويومين قال ‏\"‏ ويومين ‏\"‏ ‏.‏ قال وثلاثة قال ‏\"‏ نعم وما شئت ‏\"‏ ‏.‏ قال أبو داود رواه ابن أبي مريم المصري عن يحيى بن أيوب عن عبد الرحمن بن رزين عن محمد بن يزيد بن أبي زياد عن عبادة بن نسى عن أبى بن عمارة قال فيه حتى بلغ سبعا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم وما بدا لك ‏\"‏ قال أبو داود وقد اختلف في إسناده وليس هو بالقوي ورواه ابن أبي مريم ويحيى بن إسحاق السيلحيني عن يحيى بن أيوب وقد اختلف في إسناده ‏.‏",
      "text_en": " Narrated Ubayy ibn Umarah:                     I asked: Messenger of Allah (ﷺ) may I wipe over the socks? He replied: Yes. He asked: For one day? He replied: For one day. He again asked: And for two days? He replied: For two days too. He again asked: And for three days? He replied: Yes, as long as you wish.Abu Dawud said: Another version says: He asked him about the period until he reached the period of seven days. The Messenger of Allah (ﷺ) replied: Yes, as long as you wish (i.e. there is no time limit).Abu Dawud said: There is a variance in the chain of narrators of this tradition. The chain is not strong.Another chain from Yahya b. Ayyub is also disputed.",
      "chain": [
        "30020",
        "30206",
        "20379",
        "34204",
        "18069",
        "30526"
      ]
    },
    {
      "hadith_no": "600",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا حرملة بن يحيى، وعمرو بن سواد المصريان، قالا حدثنا عبد الله بن وهب، أنبأنا يحيى بن أيوب، عن عبد الرحمن بن رزين، عن محمد بن يزيد بن أبي زياد، عن أيوب بن قطن، عن عبادة بن نسى، عن أبى بن عمارة، - وكان رسول الله  صلى الله عليه وسلم  قد صلى في بيته القبلتين كلتيهما - أنه قال لرسول الله  صلى الله عليه وسلم  أمسح على الخفين قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال يوما قال ‏\"‏ ويومين ‏\"‏ ‏.‏ قال وثلاثا حتى بلغ سبعا قال له ‏\"‏ وما بدا لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubayy bin 'Imarah, in whose house the Messenger of Allah performed prayer facing both prayer direction, that :                     He said to the Messenger of Allah: \"Can I wipe over my leather socks?\" He said: \"Yes.\" He said: \"For one day?\" He said: \"For two days?\" He said: \"For three?\" And so on, until the number reached seven. He (the Prophet) said: \"For as long as you see fit.\"",
      "chain": [
        "30487",
        "30443",
        "20029",
        "20379",
        "28545",
        "18069"
      ]
    }
  ],
  "total_hadiths": 2
}