{
  "id": "18108",
  "name": "Thamama bin Wa'il, Abu Thafal ثمامة بن وائل بن حصين أبو ثفال المري",
  "full_name": "Thamama bin Wa'il, Abu Thafal ثمامة بن وائل بن حصين أبو ثفال المري",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ت  ق  -  مقبول ]",
      "Art/Poetry"
    ],
    "tags": [
      "al-Mari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "12592",
      "name": "Yazid bin Ayad bin J'dbh يزيد بن عياض بن جعدبة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "25",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وبشر بن معاذ العقدي، قالا حدثنا بشر بن المفضل، عن عبد الرحمن بن حرملة، عن أبي ثفال المري، عن رباح بن عبد الرحمن بن أبي سفيان بن حويطب، عن جدته، عن أبيها، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأبي سعيد وأبي هريرة وسهل بن سعد وأنس ‏.‏ قال أبو عيسى قال أحمد بن حنبل لا أعلم في هذا الباب حديثا له إسناد جيد ‏.‏ وقال إسحاق إن ترك التسمية عامدا أعاد الوضوء وإن كان ناسيا أو متأولا أجزأه ‏.‏ قال محمد بن إسماعيل أحسن شيء في هذا الباب حديث رباح بن عبد الرحمن ‏.‏ قال أبو عيسى ورباح بن عبد الرحمن عن جدته عن أبيها ‏.‏ وأبوها سعيد بن زيد بن عمرو بن نفيل ‏.‏ وأبو ثفال المري اسمه ثمامة بن حصين ‏.‏ ورباح بن عبد الرحمن هو أبو بكر بن حويطب ‏.‏ منهم من روى هذا الحديث فقال عن أبي بكر بن حويطب فنسبه إلى جده ‏.‏",
      "text_en": " Rabah bin Abdur-Rahman bin Abi Sufyan bin Huwaitib narrated from his grandmother, from her father; she said (that he said):                     \"I heard Allah's Messenger saying: there is no Wudu for one who does not mention Allah's Name over it.\"",
      "chain": [
        "30395",
        "34041",
        "20212",
        "11878",
        "18108",
        "12091"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا يزيد بن هارون، عن يزيد بن عياض، عن أبي ثفال المري، عن رباح بن عبد الرحمن بن أبي سفيان بن حويطب، عن جدته بنت سعيد بن زيد، عن أبيها، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Rabah Bin Abdur-Rahman bin Abu Sufyan bin Huwaitib narrated :                     the same from his grandmother the daughter of Sa'eed bin Zaid, from her father, from the Prophet.",
      "chain": [
        "30115",
        "20472",
        "12592",
        "18108",
        "12091"
      ]
    }
  ],
  "total_hadiths": 2
}