{
  "id": "18105",
  "name": "Thmamh bin Shrahyl al-Ymany ثمامة بن شراحيل اليماني",
  "full_name": "Thmamh bin Shrahyl al-Ymany ثمامة بن شراحيل اليماني",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Yemen",
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ت  س  -  مقبول ]"
    ],
    "tags": [
      "al-Yemeni",
      "al-Nisa'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18397",
      "name": "Smy bin Qays al-Ymany سمي بن قيس",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "15626",
      "name": "Yahya bin Qays al-Saba'i يحيى بن قيس السبأي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3064",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة بن سعيد الثقفي، ومحمد بن المتوكل العسقلاني، - المعنى واحد - أن محمد بن يحيى بن قيس المأربي، حدثهم أخبرني أبي، عن ثمامة بن شراحيل، عن سمى بن قيس، عن شمير، - قال ابن المتوكل ابن عبد المدان - عن أبيض بن حمال، أنه وفد إلى رسول الله صلى الله عليه وسلم فاستقطعه الملح - قال ابن المتوكل الذي بمأرب - فقطعه له فلما أن ولى قال رجل من المجلس أتدري ما قطعت له إنما قطعت له الماء العد ‏.‏ قال فانتزع منه قال وسأله عما يحمى من الأراك قال ‏\"‏ ما لم تنله خفاف ‏\"‏ ‏.‏ وقال ابن المتوكل ‏\"‏ أخفاف الإبل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abyad ibn Hammal:                     Abyad went to the Messenger of Allah (ﷺ) and asked him for assigning him (the mines of) salt as fief. (The narrator Ibn al-Mutawakkil said: which was in Ma'arib.) So he assigned it to him as a fief. When he returned, a man in the meeting asked: Do you know what you have assigned him as a fief? You have assigned him the perennial spring water. So he took it back from him. He asked him about protecting land which had arak trees growing in it. He replied: He could have such as was beyond the region where the hoofs (of camels) went.The narrator Ibn al-Mutwakkil said: \"that is the camel hoofs.\"",
      "chain": [
        "30367",
        "11222",
        "18105"
      ]
    },
    {
      "hadith_no": "1380",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "قال قلت لقتيبة بن سعيد حدثكم محمد بن يحيى بن قيس المأربي، حدثني أبي، عن ثمامة بن شراحيل، عن سمى بن قيس، عن شمير، عن أبيض بن حمال، أنه وفد إلى رسول الله صلى الله عليه وسلم فاستقطعه الملح فقطع له فلما أن ولى قال رجل من المجلس أتدري ما قطعت له إنما قطعت له الماء العد ‏.‏ قال فانتزعه منه ‏.‏ قال وسأله عما يحمى من الأراك قال ‏\"‏ ما لم تنله خفاف الإبل ‏\"‏ ‏.‏ فأقر به قتيبة وقال نعم ‏.‏  حدثنا ابن أبي عمر، حدثنا محمد بن يحيى بن قيس المأربي، بهذا الإسناد نحوه ‏.‏ المأرب ناحية من اليمن ‏.‏ قال وفي الباب عن وائل وأسماء بنت أبي بكر ‏.‏ قال أبو عيسى حديث أبيض بن حمال حديث غريب ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في القطائع يرون جائزا أن يقطع الإمام لمن رأى ذلك ‏.‏",
      "text_en": " Narrated Shumair:                     that Abyad bin Hammal visited the Messenger of Allah (ﷺ) who asked him to set aside a reserve of salt(a mine). So he reserved it for him. As he was turning away, a man in the gathering said: \"Do you know what you reserved for him ? You merely reserved stagnant water for him.\" He (Shumair) said: \"So he left him.\" He (Shumair) said: \"So he asked him (the Prophet (ﷺ)) about making a private pasture of Arak (a type of tree).\" He said: \"As long as it is not harmed by the hooves of the camels.\"So I (At-Tirmidhi) recited that before Qutaibah and he said: \"Yes\".(Another chain) with similar meaning.",
      "chain": [
        "11222",
        "18105"
      ]
    }
  ],
  "total_hadiths": 2
}