{
  "id": "18112",
  "name": "Jabir bin Yazid bin al-Aswad جابر بن يزيد بن الأسود",
  "full_name": "Jabir bin Yazid bin al-Aswad جابر بن يزيد بن الأسود",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ د  ت  س  -  ثقة ثقة ]"
    ],
    "tags": [
      "al-Khuza'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "219",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يعلى بن عطاء، حدثنا جابر بن يزيد بن الأسود العامري، عن أبيه، قال شهدت مع النبي صلى الله عليه وسلم حجته فصليت معه صلاة الصبح في مسجد الخيف ‏.‏ قال فلما قضى صلاته وانحرف إذا هو برجلين في أخرى القوم لم يصليا معه فقال ‏\"‏ على بهما ‏\"‏ ‏.‏ فجيء بهما ترعد فرائصهما فقال ‏\"‏ ما منعكما أن تصليا معنا ‏\"‏ ‏.‏ فقالا يا رسول الله إنا كنا قد صلينا في رحالنا ‏.‏ قال فلا تفعلا إذا صليتما في رحالكما ثم أتيتما مسجد جماعة فصليا معهم فإنها لكما نافلة ‏\"‏ ‏.‏ قال وفي الباب عن محجن الديلي ويزيد بن عامر ‏.‏ قال أبو عيسى حديث يزيد بن الأسود حديث حسن صحيح ‏.‏ وهو قول غير واحد من أهل العلم وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق قالوا إذا صلى الرجل وحده ثم أدرك الجماعة فإنه يعيد الصلوات كلها في الجماعة وإذا صلى الرجل المغرب وحده ثم أدرك الجماعة قالوا فإنه يصليها معهم ويشفع بركعة ‏.‏ والتي صلى وحده هي المكتوبة عندهم ‏.‏",
      "text_en": " Jabir hin Yazid hin Al-Aswad [Al-Amir] narrated that his father said:                     \"I attended Hajj with the Prophet. I prayed the Subh (Fajr) prayer with him in Masjid AI-Khaif.\" He said: \"When the Prophet finished, he turned (from the Qiblah) and saw two men at the back of the people who had not prayed with him. He said, 'Bring them to me.' So I brought then while they were shuddering with fear. He said: 'What prevented you from praying with us?\" They said: 'O Messenger of Allah!' We prayed at our camp.' So he said: 'Do not do that; when you pray in your camp then you come to a Masjid with a congregation, then pray with them. That will be a voluntary prayer for you.'\"",
      "chain": [
        "30242",
        "20468",
        "10986",
        "18112"
      ]
    },
    {
      "hadith_no": "858",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا هشيم، قال حدثنا يعلى بن عطاء، قال حدثنا جابر بن يزيد بن الأسود العامري، عن أبيه، قال شهدت مع رسول الله صلى الله عليه وسلم صلاة الفجر في مسجد الخيف فلما قضى صلاته إذا هو برجلين في آخر القوم لم يصليا معه قال ‏\"‏ على بهما ‏\"‏ ‏.‏ فأتي بهما ترعد فرائصهما فقال ‏\"‏ ما منعكما أن تصليا معنا ‏\"‏ ‏.‏ قالا يا رسول الله إنا قد صلينا في رحالنا ‏.‏ قال ‏\"‏ فلا تفعلا إذا صليتما في رحالكما ثم أتيتما مسجد جماعة فصليا معهم فإنها لكما نافلة ‏\"‏ ‏.‏",
      "text_en": " Jabir bin Yazid bin Al-Aswad Al Amir told us that his father said:                      \"I attended Fajr prayer with the Messenger of Allah (ﷺ)in Masjid Al Khaif. When he  finished praying, he saw two men at the back of the people who had not prayed with him. He said: 'Bring them here.' So they were brought to him, trembling. He said: 'What kept you from praying with us? They said: '0 Messenger of Allah (ﷺ) we has already prayed in our lodgings.' He said: 'Do not do that. If you have already prayed in your lodgings, then you come to a Masjid in which there is a congregation, then pray with them, and it will be a voluntary prayer for you.\"'",
      "chain": [
        "30249",
        "20468",
        "10986",
        "18112"
      ]
    }
  ],
  "total_hadiths": 2
}