{
  "id": "18127",
  "name": "Ja'far bin Sa'd bin Smrh جعفر بن سعد بن سمرة",
  "full_name": "Ja'far bin Sa'd bin Smrh جعفر بن سعد بن سمرة",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ د  -  مستور ]"
    ],
    "tags": [
      "al-Fazari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "975",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن داود بن سفيان، حدثنا يحيى بن حسان، حدثنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان بن سمرة، عن أبيه، سليمان بن سمرة عن سمرة بن جندب، أما بعد أمرنا رسول الله صلى الله عليه وسلم إذا كان في وسط الصلاة أو حين انقضائها فابدءوا قبل التسليم فقولوا ‏\"‏ التحيات الطيبات والصلوات والملك لله ثم سلموا على اليمين ثم سلموا على قارئكم وعلى أنفسكم ‏\"‏ ‏.‏ قال أبو داود سليمان بن موسى كوفي الأصل كان بدمشق ‏.‏ قال أبو داود دلت هذه الصحيفة على أن الحسن سمع من سمرة ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) commanded us (to recite) when we sit in the middle of the prayer or at its end before the salutation: The adorations of the tongue, all good things, acts of worship, and the Kingdom are due to Allah. Then give salutation to the right side; then salute your reciter (i.e. the imam) and yourselves.Abu Dawud said: Sulaiman b. Musa hails from Kufah and he lives in Damascus.Abu Dawud said: This collection of traditions indicates that al-Hasan (al-Basri) heard traditions from Samurah (b. Jundub).",
      "chain": [
        "20300",
        "10880",
        "18127"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن داود بن سفيان، حدثنا يحيى بن حسان، حدثنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان عن سمرة بن جندب، قال أما بعد فإن رسول الله صلى الله عليه وسلم كان يأمرنا أن نخرج الصدقة من الذي نعد للبيع ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) used to order us to pay the sadaqah (zakat) on what we prepared for trade.",
      "chain": [
        "20300",
        "10880",
        "18127",
        "394"
      ]
    },
    {
      "hadith_no": "2560",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن داود بن سفيان، حدثني يحيى بن حسان، أخبرنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان بن سمرة عن سمرة بن جندب، أما بعد فإن النبي صلى الله عليه وسلم سمى خيلنا خيل الله إذا فزعنا وكان رسول الله صلى الله عليه وسلم يأمرنا إذا فزعنا بالجماعة والصبر والسكينة وإذا قاتلنا ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) named our cavalry \"the Cavalry of Allah,\" when we were struck with panic, and when panic overtook us, the Messenger of Allah (ﷺ) commanded us to be united, to have patience and perseverance; and to be so when we fought.",
      "chain": [
        "20300",
        "10880",
        "18127"
      ]
    },
    {
      "hadith_no": "2716",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن داود بن سفيان، قال حدثنا يحيى بن حسان، قال حدثنا سليمان بن موسى أبو داود، قال حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان بن سمرة عن سمرة بن جندب، قال أما بعد وكان رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كتم غالا فإنه مثله ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: To begin with, anyone who conceals one who has been dishonest about booty is like him.",
      "chain": [
        "20300",
        "10880",
        "18127",
        "394"
      ]
    },
    {
      "hadith_no": "2787",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن داود بن سفيان، حدثنا يحيى بن حسان، أخبرنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان بن سمرة عن سمرة بن جندب، أما بعد قال رسول الله صلى الله عليه وسلم ‏\"‏ من جامع المشرك وسكن معه فإنه مثله ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     To proceed, the Messenger of Allah (ﷺ) said: Anyone who associates with a polytheist and lives with him is like him.",
      "chain": [
        "20300",
        "10880",
        "18127",
        "394"
      ]
    }
  ],
  "total_hadiths": 5
}