{
  "id": "18155",
  "name": "Habib bin al-Nu'man al-Asady حبيب بن النعمان الأسدي",
  "full_name": "Habib bin al-Nu'man al-Asady حبيب بن النعمان الأسدي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ق  -  مقبول ]"
    ],
    "tags": [
      "B.Asad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن موسى البلخي، حدثنا محمد بن عبيد، حدثني سفيان، - يعني العصفري - عن أبيه، عن حبيب بن النعمان الأسدي، عن خريم بن فاتك، قال صلى رسول الله صلى الله عليه وسلم صلاة الصبح فلما انصرف قام قائما فقال ‏\"‏ عدلت شهادة الزور بالإشراك بالله ‏\"‏ ‏.‏ ثلاث مرار ثم قرأ ‏{‏ فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور * حنفاء لله غير مشركين به ‏}‏ ‏.‏",
      "text_en": " Narrated Khuraym Ibn Fatik:                     The Messenger of Allah (ﷺ) offered the morning prayer. When he finished it, he stood up and said three times: False witness has been made equivalent to attributing a partner to Allah. He then recited: \"So avoid the abomination of idols and avoid speaking falsehood as people pure of faith to Allah, not associating anything with Him.",
      "chain": [
        "30221",
        "30213",
        "15349",
        "18155",
        "4127"
      ]
    },
    {
      "hadith_no": "2469",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن عبيد، حدثنا سفيان، وهو ابن زياد العصفري عن أبيه، عن حبيب بن النعمان الأسدي، عن خريم بن فاتك الأسدي، أن رسول الله صلى الله عليه وسلم صلى صلاة الصبح فلما انصرف قام قائما فقال ‏\"‏ عدلت شهادة الزور بالشرك بالله ‏\"‏ ‏.‏ ثلاث مرات ثم تلا هذه الآية ‏(‏واجتنبوا قول الزور ‏)‏ إلى آخر الآية ‏.‏ قال أبو عيسى هذا عندي أصح ‏.‏ وخريم بن فاتك له صحبة وقد روى عن النبي صلى الله عليه وسلم أحاديث وهو مشهور ‏.‏",
      "text_en": " Khuraim bin Fatik Al-Asadi narrated that the Messenger of Allah (s.a.w) performed the Subh (Fajr)prayer. Then when he turned  he got up to stand and said:                     \"O you people! False witness is tantamount to Shirk with Allah.\"Saying it three times, then he recited this Ayah And shun false speech Until the end of the Ayah.",
      "chain": [
        "30553",
        "30213",
        "20012",
        "20016",
        "18155",
        "4127"
      ]
    },
    {
      "hadith_no": "2372",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن عبيد، حدثنا سفيان العصفري، عن أبيه، عن حبيب بن النعمان الأسدي، عن خريم بن فاتك الأسدي، قال صلى النبي صلى الله عليه وسلم الصبح فلما انصرف قام قائما فقال ‏\"‏ عدلت شهادة الزور بالإشراك بالله ‏\"‏ ‏.‏ ثلاث مرات ثم تلا هذه الآية ‏{‏واجتنبوا قول الزور حنفاء لله غير مشركين به‏}‏‏.‏",
      "text_en": " It was narrated that Khuraim bin Fatik Al-Asadi said that :                     the Prophet(ﷺ) prayed the Morning prayer, and when he had finished, he stood up and said: “Bearing false witness is equivalent to associating others with Allah,” three times. Then he recited this Verse: “And shun lying speech (false statements), Hunafa' Lillah (i.e., worshiping none but Allah), not associating partners (in worship) to Him.”",
      "chain": [
        "30201",
        "30213",
        "15349",
        "18155",
        "4127"
      ]
    }
  ],
  "total_hadiths": 3
}