{
  "id": "18189",
  "name": "al-Husain bin Qays al-Rhby الحسين بن قيس الرحبي",
  "full_name": "al-Husain bin Qays al-Rhby الحسين بن قيس الرحبي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Abandoned",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ ت  ق  -  متروك ]"
    ],
    "tags": [
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2601",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا حصين بن نمير أبو محصن، حدثنا حسين بن قيس الرحبي، حدثنا عطاء بن أبي رباح، عن ابن عمر، عن ابن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تزول قدما ابن آدم يوم القيامة من عند ربه حتى يسأل عن خمس عن عمره فيما أفناه وعن شبابه فيما أبلاه وماله من أين اكتسبه وفيم أنفقه وماذا عمل فيما علم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث ابن مسعود عن النبي صلى الله عليه وسلم إلا من حديث الحسين بن قيس ‏.‏ وحسين بن قيس يضعف في الحديث من قبل حفظه ‏.‏ وفي الباب عن أبي برزة وأبي سعيد ‏.‏",
      "text_en": " Ibn Mas'ud narrated that the Messenger of Allah (s.a.w) said:                     \"The feet of the son of Adam shall not move from before his Lord on the Day of Judgement, until he is asked about five things: about his life and what he did with it, about his youth and what he wore it out in, about his wealth and how he earned it and spent it upon, and what he did with what he knew.\"",
      "chain": [
        "30430",
        "18195",
        "18189",
        "11029",
        "18",
        "16"
      ]
    }
  ],
  "total_hadiths": 1
}