{
  "id": "18195",
  "name": "Husayn bin Nmyr al-Kndy Thm حصين بن نمير",
  "full_name": "Husayn bin Nmyr al-Kndy Thm حصين بن نمير",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ تمييز  -  مجهول ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3410",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا حصين بن نمير، عن حصين بن عبد الرحمن، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خرج علينا النبي صلى الله عليه وسلم يوما قال ‏\"‏ عرضت على الأمم، ورأيت سوادا كثيرا سد الأفق فقيل هذا موسى في قومه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once came to us and said, \"All the nations were displayed in front of me, and I saw a large multitude of people covering the horizon. Somebody said, 'This is Moses and his followers.' \"",
      "chain": [
        "30175",
        "18195",
        "15097",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5811",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا حصين بن نمير، عن حصين بن عبد الرحمن، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خرج علينا النبي صلى الله عليه وسلم يوما فقال ‏\"‏ عرضت على الأمم فجعل يمر النبي معه الرجل والنبي معه الرجلان، والنبي معه الرهط، والنبي ليس معه أحد، ورأيت سوادا كثيرا سد الأفق فرجوت أن يكون أمتي، فقيل هذا موسى وقومه‏.‏ ثم قيل لي انظر‏.‏ فرأيت سوادا كثيرا سد الأفق فقيل لي انظر هكذا وهكذا‏.‏ فرأيت سوادا كثيرا سد الأفق فقيل هؤلاء أمتك، ومع هؤلاء سبعون ألفا يدخلون الجنة بغير حساب ‏\"‏‏.‏ فتفرق الناس ولم يبين لهم، فتذاكر أصحاب النبي صلى الله عليه وسلم فقالوا أما نحن فولدنا في الشرك، ولكنا آمنا بالله ورسوله، ولكن هؤلاء هم أبناؤنا، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ هم الذين لا يتطيرون، ولا يسترقون، ولا يكتوون، وعلى ربهم يتوكلون ‏\"‏‏.‏ فقام عكاشة بن محصن فقال أمنهم أنا يا رسول الله قال ‏\"‏ نعم ‏\"‏‏.‏ فقام آخر فقال أمنهم أنا فقال ‏\"‏ سبقك بها عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once came out to us and said, \"Some nations were displayed before me. A prophet would pass in front of me with one man, and another with two men, and another with a group of people. and another with nobody with him. Then I saw a great crowd covering the horizon and I wished that they were my followers, but it was said to me, 'This is Moses and his followers.' Then it was said to me, 'Look'' I looked and saw a big gathering with a large number of people covering the horizon. It was said, \"Look this way and that way.' So I saw a big crowd covering the horizon. Then it was said to me, \"These are your followers, and among them there are 70,000 who will enter Paradise without (being asked about their) accounts. \" Then the people dispersed and the Prophet did not tell who those 70,000 were. So the companions of the Prophet started talking about that and some of them said, \"As regards us, we were born in the era of heathenism, but then we believed in Allah and His Apostle . We think however, that these (70,000) are our offspring.\" That talk reached the Prophet who said, \"These (70,000) are the people who do not draw an evil omen from (birds) and do not get treated by branding themselves and do not treat with Ruqya, but put their trust (only) in their Lord.\" then 'Ukasha bin Muhsin got up and said, \"O Allah's Apostle! Am I one of those (70,000)?\" The Prophet said, \"Yes.\" Then another person got up and said, \"Am I one of them?\" The Prophet said, \" 'Ukasha has anticipated you.\"",
      "chain": [
        "30175",
        "18195",
        "15097",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2349",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا حصين بن نمير، ح وحدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، - المعنى - عن حصين، عن الشعبي، عن عدي بن حاتم، قال لما نزلت هذه الآية ‏{‏ حتى يتبين لكم الخيط الأبيض من الخيط الأسود ‏}‏ ‏.‏ قال أخذت عقالا أبيض وعقالا أسود فوضعتهما تحت وسادتي فنظرت فلم أتبين فذكرت ذلك لرسول الله صلى الله عليه وسلم فضحك فقال ‏\"‏ إن وسادك لعريض طويل إنما هو الليل والنهار ‏\"‏ ‏.‏ قال عثمان ‏\"‏ إنما هو سواد الليل وبياض النهار ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Adi b. Hatim:                     When the verse \"Until the white thread of dawn appear to you distinct from its black thread\" was revealed, I took a white rope and a black rope, and placed them beneath my pillow ; and then I looked at them, byt they were not clear to me. So I mentioned it to the Messenger of Allah (ﷺ). He laughed and said: Your pillow is so broad and lengthy ; that is (i.e. means) night and day. The version of the narrator 'Uthman has: That is the blackness of night and whiteness of day.",
      "chain": [
        "30175",
        "18195",
        "30203",
        "15097",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "2579",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، حدثنا حصين بن نمير، حدثنا سفيان بن حسين، ح وحدثنا علي بن مسلم، حدثنا عباد بن العوام، أخبرنا سفيان بن حسين، - المعنى - عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أدخل فرسا بين فرسين ‏\"‏ ‏.‏ يعني وهو لا يؤمن أن يسبق ‏\"‏ فليس بقمار ومن أدخل فرسا بين فرسين وقد أمن أن يسبق فهو قمار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If one enters a horse with two others when he is not certain that it cannot be beaten, it is not gambling; but when one enters a horse with two others when he is certain it cannot be beaten, it is gambling.",
      "chain": [
        "30175",
        "18195",
        "20655",
        "30261",
        "20431",
        "20655",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا حصين بن نمير، عن ابن أبي ليلى، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يتوارث أهل ملتين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث جابر إلا من حديث ابن أبي ليلى ‏.‏",
      "text_en": " Jabir narrated that the Prophet(S.A.W) said:                     \" The people of two religions do not inherit from each other.\"",
      "chain": [
        "30430",
        "18195",
        "11196",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2601",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا حصين بن نمير أبو محصن، حدثنا حسين بن قيس الرحبي، حدثنا عطاء بن أبي رباح، عن ابن عمر، عن ابن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تزول قدما ابن آدم يوم القيامة من عند ربه حتى يسأل عن خمس عن عمره فيما أفناه وعن شبابه فيما أبلاه وماله من أين اكتسبه وفيم أنفقه وماذا عمل فيما علم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث ابن مسعود عن النبي صلى الله عليه وسلم إلا من حديث الحسين بن قيس ‏.‏ وحسين بن قيس يضعف في الحديث من قبل حفظه ‏.‏ وفي الباب عن أبي برزة وأبي سعيد ‏.‏",
      "text_en": " Ibn Mas'ud narrated that the Messenger of Allah (s.a.w) said:                     \"The feet of the son of Adam shall not move from before his Lord on the Day of Judgement, until he is asked about five things: about his life and what he did with it, about his youth and what he wore it out in, about his wealth and how he earned it and spent it upon, and what he did with what he knew.\"",
      "chain": [
        "30430",
        "18195",
        "18189",
        "11029",
        "18",
        "16"
      ]
    },
    {
      "hadith_no": "1731",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسن بن قزعة، عن حصين بن نمير، عن حصين بن عبد الرحمن، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza from his father that:                     The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "34055",
        "18195",
        "15097",
        "11423",
        "11346",
        "4046"
      ]
    }
  ],
  "total_hadiths": 7
}