{
  "id": "1820",
  "name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
  "full_name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "42",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "Bali",
      "B.Quda'a",
      "Ally B.Haritha",
      "Aqaba 2",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "1918",
      "name": "'Uqba bin Niyar ( عقبة بن نيار ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11192",
      "name": "'Abdur Rahman bin Jabir bin 'Abdullah عبد الرحمن بن جابر بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11810",
      "name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "452",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا أبو بردة بن عبد الله، قال سمعت أبا بردة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من مر في شىء من مساجدنا أو أسواقنا بنبل، فليأخذ على نصالها، لا يعقر بكفه مسلما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda bin `Abdullah:                     (on the authority of his father) The Prophet said, \"Whoever passes through our mosques or markets with arrows should hold them by their heads lest he should injure a Muslim.\"",
      "chain": [
        "20040",
        "20256",
        "1820"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا حسين، عن زائدة، عن عبد الملك بن عمير، قال حدثني أبو بردة، عن أبي موسى، قال مرض النبي صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إنه رجل رقيق، إذا قام مقامك لم يستطع أن يصلي بالناس‏.‏ قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ فعادت فقال ‏\"‏ مري أبا بكر فليصل بالناس، فإنكن صواحب يوسف ‏\"‏‏.‏ فأتاه الرسول فصلى بالناس في حياة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     \"The Prophet became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
      "chain": [
        "30311",
        "11278",
        "20320",
        "11368",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "2261",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن قرة بن خالد، قال حدثني حميد بن هلال، حدثنا أبو بردة، عن أبي موسى  رضى الله عنه  قال أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين، فقلت ما علمت أنهما يطلبان العمل‏.‏ فقال ‏\"‏ لن أو لا نستعمل على عملنا من أراده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     I went to the Prophet with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they want employment.\" The Prophet said, \"No, we do not appoint for our jobs anybody who demands it earnestly.\"",
      "chain": [
        "30175",
        "20031",
        "11301",
        "11281",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "2996",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مطر بن الفضل، حدثنا يزيد بن هارون، حدثنا العوام، حدثنا إبراهيم أبو إسماعيل السكسكي، قال سمعت أبا بردة، واصطحب، هو ويزيد بن أبي كبشة في سفر، فكان يزيد يصوم في السفر فقال له أبو بردة سمعت أبا موسى مرارا يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مرض العبد أو سافر، كتب له مثل ما كان يعمل مقيما صحيحا ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim Abu Isma`il As-Saksaki:                     I heard Abu Burda who accompanied Yazid bin Abi Kabsha on a journey. Yazid used to observe fasting on journeys. Abu Burda said to him, \"I heard Abu Musa several times saying that Allah's Apostle said, 'When a slave falls ill or travels, then he will get reward similar to that he gets for good deeds practiced at home when in good health.\"",
      "chain": [
        "30392",
        "20472",
        "11441",
        "1820"
      ]
    },
    {
      "hadith_no": "3011",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان بن عيينة، حدثنا صالح بن حى أبو حسن، قال سمعت الشعبي، يقول حدثني أبو بردة، أنه سمع أباه، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة يؤتون أجرهم مرتين الرجل تكون له الأمة فيعلمها فيحسن تعليمها، ويؤدبها فيحسن أدبها، ثم يعتقها فيتزوجها، فله أجران، ومؤمن أهل الكتاب الذي كان مؤمنا، ثم آمن بالنبي صلى الله عليه وسلم فله أجران، والعبد الذي يؤدي حق الله وينصح لسيده ‏\"‏‏.‏ ثم قال الشعبي وأعطيتكها بغير شىء وقد كان الرجل يرحل في أهون منها إلى المدينة‏.‏",
      "text_en": " Narrated Abu Burda's father:                     The Prophet said, \"Three persons will get their reward twice. (One is) a person who has a slave girl and he educates her properly and teaches her good manners properly (without violence) and then manumits and marries her. Such a person will get a double reward. (Another is) a believer from the people of the scriptures who has been a true believer and then he believes in the Prophet (Muhammad). Such a person will get a double reward. (The third is) a slave who observes Allah's Rights and Obligations and is sincere to his master.\"",
      "chain": [
        "30026",
        "20005",
        "11431",
        "11052",
        "1820"
      ]
    },
    {
      "hadith_no": "3446",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا صالح بن حى، أن رجلا، من أهل خراسان قال للشعبي‏.‏ فقال الشعبي أخبرني أبو بردة عن أبي موسى الأشعري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدب الرجل أمته فأحسن تأديبها، وعلمها فأحسن تعليمها ثم أعتقها فتزوجها، كان له أجران، وإذا آمن بعيسى ثم آمن بي، فله أجران، والعبد إذا اتقى ربه وأطاع مواليه، فله أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle said, \"If a person teaches his slave girl good manners properly, educates her properly, and then manumits and marries her, he will get a double reward. And if a man believes in Jesus and then believes in me, he will get a double reward. And if a slave fears his Lord (i.e. Allah) and obeys his masters, he too will get a double reward.\"",
      "chain": [
        "30118",
        "20025",
        "11431",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "4278",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "قال أبو بردة قالت أسماء فلقد رأيت أبا موسى وإنه ليستعيد هذا الحديث مني‏.‏",
      "text_en": "",
      "chain": [
        "1820"
      ]
    },
    {
      "hadith_no": "4279",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "قال أبو بردة عن أبي موسى، قال النبي صلى الله عليه وسلم ‏\"‏ إني لأعرف أصوات رفقة الأشعريين بالقرآن، حين يدخلون بالليل، وأعرف منازلهم من أصواتهم بالقرآن بالليل، وإن كنت لم أر منازلهم حين نزلوا بالنهار، ومنهم حكيم، إذا لقي الخيل  أو قال العدو  قال لهم إن أصحابي يأمرونكم أن تنظروهم ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "1820",
        "30170"
      ]
    },
    {
      "hadith_no": "5139",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا صالح بن صالح الهمداني، حدثنا الشعبي، قال حدثني أبو بردة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل كانت عنده وليدة فعلمها فأحسن تعليمها، وأدبها فأحسن تأديبها، ثم أعتقها وتزوجها فله أجران، وأيما رجل من أهل الكتاب آمن بنبيه وآمن بي فله أجران، وأيما مملوك أدى حق مواليه وحق ربه فله أجران ‏\"‏‏.‏ قال الشعبي خذها بغير شىء قد كان الرجل يرحل فيما دونه إلى المدينة‏.‏ وقال أبو بكر عن أبي حصين عن أبي بردة عن أبيه عن النبي صلى الله عليه وسلم ‏\"‏ أعتقها ثم أصدقها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda's father:                     Allah's Apostle said, any man who has a slave girl whom he educates properly, teaches good manners, manumits and marries her, will get a double reward And if any man of the people of the Scriptures believes in his own prophet and then believes in me too, he will (also) get a double reward And any slave who fulfills his duty to his master and to his Lord, will (also) get a double reward.\"",
      "chain": [
        "20040",
        "20256",
        "11052",
        "1820"
      ]
    },
    {
      "hadith_no": "7009",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن قرة بن خالد، حدثني حميد بن هلال، حدثنا أبو بردة، عن أبي موسى، قال أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين، أحدهما عن يميني، والآخر عن يساري ورسول الله صلى الله عليه وسلم يستاك فكلاهما سأل‏.‏ فقال ‏\"‏ يا أبا موسى ‏\"‏‏.‏ أو ‏\"‏ يا عبد الله بن قيس ‏\"‏‏.‏ قال قلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما، وما شعرت أنهما يطلبان العمل‏.‏ فكأني أنظر إلى سواكه تحت شفته قلصت فقال ‏\"‏ لن  أو  لا نستعمل على عملنا من أراده، ولكن اذهب أنت يا أبا موسى  أو يا عبد الله بن قيس  إلى اليمن ‏\"‏‏.‏ ثم أتبعه معاذ بن جبل، فلما قدم عليه ألقى له وسادة قال انزل، وإذا رجل عنده موثق‏.‏ قال ما هذا قال كان يهوديا فأسلم ثم تهود‏.‏ قال اجلس‏.‏ قال لا أجلس حتى يقتل‏.‏ قضاء الله ورسوله‏.‏ ثلاث مرات، فأمر به فقتل، ثم تذاكرنا قيام الليل، فقال أحدهما أما أنا فأقوم وأنام، وأرجو في نومتي ما أرجو في قومتي‏.‏",
      "text_en": " Narrated Abu Burda:                     Abu Musa said, \"I came to the Prophet along with two men (from the tribe) of Ash`ariyin, one on my right and the other on my left, while Allah's Apostle was brushing his teeth (with a Siwak), and both men asked him for some employment. The Prophet said, 'O Abu Musa (O `Abdullah bin Qais!).' I said, 'By Him Who sent you with the Truth, these two men did not tell me what was in their hearts and I did not feel (realize) that they were seeking employment.' As if I were looking now at his Siwak being drawn to a corner under his lips, and he said, 'We never (or, we do not) appoint for our affairs anyone who seeks to be employed. But O Abu Musa! (or `Abdullah bin Qais!) Go to Yemen.'\" The Prophet then sent Mu`adh bin Jabal after him and when Mu`adh reached him, he spread out a cushion for him and requested him to get down (and sit on the cushion). Behold: There was a fettered man beside Abu Muisa. Mu`adh asked, \"Who is this (man)?\" Abu Muisa said, \"He was a Jew and became a Muslim and then reverted back to Judaism.\" Then Abu Muisa requested Mu`adh to sit down but Mu`adh said, \"I will not sit down till he has been killed. This is the judgment of Allah and His Apostle (for such cases) and repeated it thrice. Then Abu Musa ordered that the man be killed, and he was killed. Abu Musa added, \"Then we discussed the night prayers and one of us said, 'I pray and sleep, and I hope that Allah will reward me for my sleep as well as for my prayers.'\"",
      "chain": [
        "30175",
        "20031",
        "11301",
        "11281",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "7244",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن قرة، حدثني حميد بن هلال، حدثنا أبو بردة، عن أبي موسى، أن النبي صلى الله عليه وسلم بعثه وأتبعه بمعاذ‏.‏",
      "text_en": " Narrated Abu Musa:                     that the Prophet sent him and sent Mu`adh after him (as rulers to Yemen).",
      "chain": [
        "30175",
        "20031",
        "11301",
        "11281",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "4822",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن سعيد، ومحمد بن حاتم، - واللفظ لابن حاتم - قالا حدثنا يحيى بن سعيد القطان، حدثنا قرة بن خالد، حدثنا حميد بن هلال، حدثني أبو بردة، قال قال أبو موسى أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري فكلاهما سأل العمل والنبي صلى الله عليه وسلم يستاك فقال ‏\"‏ ما تقول يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ قال فقلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل ‏.‏ قال وكأني أنظر إلى سواكه تحت شفته وقد قلصت فقال ‏\"‏ لن أو لا نستعمل على عملنا من أراده ولكن اذهب أنت يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ فبعثه على اليمن ثم أتبعه معاذ بن جبل فلما قدم عليه قال انزل وألقى له وسادة وإذا رجل عنده موثق قال ما هذا قال هذا كان يهوديا فأسلم ثم راجع دينه دين السوء فتهود قال لا أجلس حتى يقتل قضاء الله ورسوله فقال اجلس نعم ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ثلاث مرات ‏.‏ فأمر به فقتل ثم تذاكرا القيام من الليل فقال أحدهما معاذ أما أنا فأنام وأقوم وأرجو في نومتي ما أرجو في قومتي ‏.‏",
      "text_en": " It has been reported on the authority of Abu Musa who said:                      I went to the Holy Prophet (may peace be upon him) and with me were two men from the Ash'ari tribe. One of them was on my right hand and the other on my left. Both of them made a request for a position (of authority) while the Holy Prophet (may peace be upon him) was brushing his teeth with a tooth-stick. He said (to me): Abu Musa (or 'Abdullah b. Qais), what do you say (about the request they have made)? I said: By God Who sent thee on thy mission with truth, they did not disclose to me what they had in their minds, and I did not know that they would ask for a position. The narrator says (while recalling this hadith): I visualise as if I were looking at the miswak of the Holy Prophet (may peace be upon him) between his lips. He (the Holy Prophet) said: We shall not or shall never appoint to the public offices (in our State) those who with to have them, but you may go, Abu Musa (or Abdullah b. Qais) (to take up your assignment). He sent him to Yemen as governor. then he sent Mu'adh b. jabal in his wake (to help him in the discharge of duties). When Mu'adh reached the camp of Abu Musa, the latter (received him and) said: Please get yourself down; and he spread for him a mattress, while there was a man bound hand and foot as a prisoner. Mu'adh said: Who is this? Abu Musa said: He was a Jew. He embraced Islam. Then he reverted to his false religion and became a Jew. Mu'adh said: I won't sit until he is killed according to the decree of Allah and His Apostle (may peace be upon him) (in this case). Abu Musa said: Be seated. It will be done. He said: I won't sit unless he is killed in accordance with the decree of Allah and His Apostle (may peace be upon him). He repeated these words thrice. Then Abu Musa ordered him (to be killed) and he was kilied. Then the two talked of standing in prayer at night. One of them, i. e. Mu'adh, said: I sleep (for a part of the night) and stand in prayer (for a part) and I hope that I shall get the same reward for steeping as I shall get for standing (in prayer).",
      "chain": [
        "30359",
        "38487",
        "20031",
        "11301",
        "11281",
        "1820"
      ]
    },
    {
      "hadith_no": "5334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، - واللفظ لابن أبي خلف - قالا حدثنا زكرياء بن عدي، حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن، أبي أنيسة عن سعيد بن أبي بردة، حدثنا أبو بردة، عن أبيه، قال بعثني رسول الله صلى الله عليه وسلم ومعاذا إلى اليمن فقال ‏\"‏ ادعوا الناس وبشرا ولا تنفرا ويسرا ولا تعسرا ‏\"‏ ‏.‏ قال فقلت يا رسول الله أفتنا في شرابين كنا نصنعهما باليمن البتع وهو من العسل ينبذ حتى يشتد والمزر وهو من الذرة والشعير ينبذ حتى يشتد قال وكان رسول الله صلى الله عليه وسلم قد أعطي جوامع الكلم بخواتمه فقال ‏\"‏ أنهى عن كل مسكر أسكر عن الصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      Allah's Messenger (may peace be upon him) sent me and Mu'adh to Yemen saying: Call people (to the path of righteousness) and give good tidings to the (people), and do not repel them, make things easy for them and do not make things difficult. I (Burda) said: Allah's Messenger, give us a religious verdict about two kinds of drinks which we prepare in Yemen. One is Bit' which is prepared from honey; it is a fermented Nabidh and is strong and turns into wine, and (the second is) Mizr which is prepared from millet and barley. Thereupon, Allah's Messenger (may peace be upon him), who had been gifted with the most eloquent and pithy expressions, said: I forbid you from every intoxicant that keeps you away from prayer.",
      "chain": [
        "30123",
        "30464",
        "30024",
        "11340",
        "11345",
        "1820"
      ]
    },
    {
      "hadith_no": "5613",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عاصم بن كليب، قال سمعت أبا بردة، قال سمعت علي بن أبي طالب، قال نهى أو نهانييعني النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported that he (Allah'. s Apostle) forbade or forbade me. the rest of the hadith is the same.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10778",
        "1820",
        "5"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا حميد بن هلال، حدثني أبو بردة، قال قال أبو موسى قال النبي صلى الله عليه وسلم ‏\"‏ لن نستعمل - أو لا نستعمل - على عملنا من أراده ‏\"‏ ‏.‏",
      "text_en": " Abu Buradah reported the Prophet (ﷺ) as saying:                      \"We will never employ or we shall not employ (the narrator is doubtful) in our work one who wants it.\"",
      "chain": [
        "30007",
        "20031",
        "11301",
        "11281",
        "1820",
        "30170"
      ]
    },
    {
      "hadith_no": "4354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى بن سعيد، - قال مسدد - حدثنا قرة بن خالد، قال حدثنا حميد بن هلال، حدثنا أبو بردة، قال قال أبو موسى أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري فكلاهما سأل العمل والنبي صلى الله عليه وسلم ساكت فقال ‏\"‏ ما تقول يا أبا موسى ‏\"‏ ‏.‏ أو ‏\"‏ يا عبد الله بن قيس ‏\"‏ ‏.‏ قلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل ‏.‏ قال وكأني أنظر إلى سواكه تحت شفته قلصت قال ‏\"‏ لن نستعمل - أو لا نستعمل - على عملنا من أراده ولكن اذهب أنت يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ فبعثه على اليمن ثم أتبعه معاذ بن جبل قال فلما قدم عليه معاذ قال انزل ‏.‏ وألقى له وسادة فإذا رجل عنده موثق قال ما هذا قال هذا كان يهوديا فأسلم ثم راجع دينه دين السوء ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ قال اجلس نعم ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ ثلاث مرات فأمر به فقتل ثم تذاكرا قيام الليل فقال أحدهما معاذ بن جبل أما أنا فأنام وأقوم - أو أقوم وأنام - وأرجو في نومتي ما أرجو في قومتي ‏.‏",
      "text_en": " Abu Burdah said on the authority of Abu Musa :                      I went to the Prophet (ﷺ) while two men who were Ash’ arIs were with me. One of them was on my right and the other on my left side. Bothe of them asked him for employment. The prophet (ﷺ) was silent. He asked : What do you say Abu Musa, or ‘Abd Allah b. Qais (Abu Musa’s name)? I replied: By him who has sent you with truth, they did not inform me of what they had in their hearts, and I did not know that they would ask for an employment. He said  : I have  the scene before my eyes that he had his toothstick below his lip  which receded. He (the prophet) said: We will never or will not put in charge of our work anyone who asks for it. But go, ye, Abu Musa, or ‘Abd Allah b. Qais. He then sent him as a Governor of the Yemen, After him he sent Muadh b. Jabal. When Muadh came to him, he said: come down , and he put a cushion for him.  He saw that a man was chained with him. He asked : What is this? He replied: He was a Jew and he accepted Islam. He then converted to his religion, an evil religion. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (ﷺ). He said: Yes, be seated. He said: I will not sit until he is killed according to the decision of Allah and his Apostle (peace be upon him). He said it three times. He then commanded for it and he was killed. Both of them then discussed the question of prayer and vigilance at night. One of them, probably Muadh, said : So far as I am concerned, I sleep and I keep vigilance: I keep vigilance and I sleep: I hope for the same reward for my sleep as for my vigilance.",
      "chain": [
        "30007",
        "30175",
        "20031",
        "30175",
        "11301",
        "11281",
        "1820"
      ]
    },
    {
      "hadith_no": "1463",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن عبد الرحمن بن جابر بن عبد الله، عن أبي بردة بن نيار، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجلد فوق عشر جلدات إلا في حد من حدود الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث بكير بن الأشج ‏.‏ وقد اختلف أهل العلم في التعزير وأحسن شيء روي في التعزير هذا الحديث ‏.‏ قال وقد روى هذا الحديث ابن لهيعة عن بكير فأخطأ فيه وقال عن عبد الرحمن بن جابر بن عبد الله عن أبيه عن النبي صلى الله عليه وسلم وهو خطأ والصحيح حديث الليث بن سعد إنما هو عبد الرحمن بن جابر بن عبد الله عن أبي بردة بن نيار عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Burdah bun Niyar:                     That the Messenger of Allah (ﷺ) said: \"No one is to be lashed more than ten lashes except for a legal punishment among Allah's punishments.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11154",
        "11005",
        "11192",
        "1820"
      ]
    },
    {
      "hadith_no": "4",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، حدثنا يحيى، - وهو ابن سعيد - قال حدثنا قرة بن خالد، قال حدثنا حميد بن هلال، قال حدثني أبو بردة، عن أبي موسى، قال أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري ورسول الله صلى الله عليه وسلم يستاك فكلاهما سأل العمل قلت والذي بعثك بالحق نبيا ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل فكأني أنظر إلى سواكه تحت شفته قلصت فقال ‏\"‏ إنا لا - أو لن - نستعين على العمل من أراده ولكن اذهب أنت ‏\"‏ ‏.‏ فبعثه على اليمن ثم أردفه معاذ بن جبل رضى الله عنهما ‏.‏",
      "text_en": " It was narrated from Abu Burdah that Abu Musa said:                      \"I came to the Prophet (ﷺ) when he was using the Siwak and with me were two men of the Ash'aris - one on my right and the other on my left - who were seeking to be appointed as officials. I said: 'By the One Who sent you as a Prophet with the truth, they did not tell me why they wanted to come with me and I did not realize that they were seeking to be appointed as officials.' And I could see his Siwak beneath his lip, then it slipped and he said: 'We do not' - or; 'We will never appoint as an official anyone who seeks that. Rather you should go.'\" So he sent his (Abu Musa) to Yemen, then he sent Mu'adh bin Jabal to go after him - may Allah be pleased with them.",
      "chain": [
        "30153",
        "20031",
        "11301",
        "11281",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "4397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن يحيى، ح وأنبأنا عمرو بن علي، قال حدثنا يحيى، عن يحيى بن سعيد، عن بشير بن يسار، عن أبي بردة بن نيار، أنه ذبح قبل النبي صلى الله عليه وسلم فأمره النبي صلى الله عليه وسلم أن يعيد ‏.‏ قال عندي عناق جذعة هي أحب إلى من مسنتين ‏.‏ قال ‏\"‏ اذبحها ‏\"‏ ‏.‏ في حديث عبيد الله فقال إني لا أجد إلا جذعة ‏.‏ فأمره أن يذبح ‏.‏",
      "text_en": " It was narrated from Abu Burdah bin Niyar that he slaughtered (his sacrifice) before the Prophet and the Prophet told him to repeat it. He said:                     \"I have a Jadh'ah she-goat that is dearer to me than two Muslinnahs.\"  He said: \"Sacrifice it,\" According to the Hadith of: Ubaidullah, he said: \"I cannot find anything but a Jadh'ah,\" and he told him to slaughter it. (Sahih )",
      "chain": [
        "30359",
        "20031",
        "20031",
        "30153",
        "20031",
        "11062",
        "11810",
        "1820"
      ]
    },
    {
      "hadith_no": "5677",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سماك، عن القاسم بن عبد الرحمن، عن أبيه، عن أبي بردة بن نيار، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اشربوا في الظروف ولا تسكروا ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا حديث منكر غلط فيه أبو الأحوص سلام بن سليم لا نعلم أن أحدا تابعه عليه من أصحاب سماك بن حرب وسماك ليس بالقوي وكان يقبل التلقين ‏.‏ قال أحمد بن حنبل كان أبو الأحوص يخطئ في هذا الحديث ‏.‏ خالفه شريك في إسناده وفي لفظه ‏.‏",
      "text_en": " It was narrated that Abu Burdah bin Niyar said:                     \"The Messenger of Allah [SAW] said: 'Drink from vessels but do not become intoxicated.'\"",
      "chain": [
        "30480",
        "20327",
        "10770",
        "19896",
        "1820"
      ]
    },
    {
      "hadith_no": "1533",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سعيد بن يحيى بن الأزهر الواسطي، حدثنا أبو معاوية، حدثنا أبو بردة، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال لما أخذوا في غسل النبي  صلى الله عليه وسلم  ناداهم مناد من الداخل لا تنزعوا عن رسول الله  صلى الله عليه وسلم  قميصه ‏.‏",
      "text_en": " It wasnarrated from Abu Buraidah that his father said:                      “When theystartedto wash the Prophet (ﷺ), a voice called out from inside (thehouse)saying: ‘Do not remove the shirt of the Messenger of Allah.’”",
      "chain": [
        "30254",
        "20354",
        "1820",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، أنبأنا معتمر بن سليمان، قال قرأت على الفضيل بن ميسرة عن أبي حريز، أن أبا بردة، حدثه قال أوصى أبو موسى الأشعري حين حضره الموت فقال لا تتبعوني بمجمر ‏.‏ قالوا له أو سمعت فيه شيئا قال نعم من رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Abu Hariz that Abu Burdah said:                      “Abu MusaAsh’arileft instructions, when he was dying, saying: ‘Do not followmewith a censer.’* They said to him: ‘Did you hear somethingconcerning that?’ He said: ‘Yes, from the Messenger of Allah(ﷺ).’”",
      "chain": [
        "20288",
        "1820"
      ]
    },
    {
      "hadith_no": "2699",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن عبد الرحمن بن جابر بن عبد الله، عن أبي بردة بن نيار، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ لا يجلد أحد فوق عشر جلدات إلا في حد من حدود الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Burdah bin Niyar that the Messenger of Allah (ﷺ) used to say:                     “No one should be given more than ten lashes, except in the case of one of the legal punishments of Allah (SWT).”",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11154",
        "11005",
        "11192",
        "1820"
      ]
    }
  ],
  "total_hadiths": 23
}