{
  "id": "18212",
  "name": "Hakeem bin Mu'awiyya al-Numayri حكيم بن معاوية النميري",
  "full_name": "Hakeem bin Mu'awiyya al-Numayri حكيم بن معاوية النميري",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Undefined] [ ت  س  - ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2142",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا أبو قزعة الباهلي، عن حكيم بن معاوية القشيري، عن أبيه، قال قلت يا رسول الله ما حق زوجة أحدنا عليه قال ‏\"‏ أن تطعمها إذا طعمت وتكسوها إذا اكتسيت - أو اكتسبت - ولا تضرب الوجه ولا تقبح ولا تهجر إلا في البيت ‏\"‏ ‏.‏ قال أبو داود ‏\"‏ ولا تقبح ‏\"‏ ‏.‏ أن تقول قبحك الله ‏.‏",
      "text_en": " Narrated Mu'awiyah al-Qushayri:                     Mu'awiyah asked: Messenger of Allah, what is the right of the wife of one of us over him? He replied: That you should give her food when you eat, clothe her when you clothe yourself, do not strike her on the face, do not revile her or separate yourself from her except in the house.Abu Dawud said: The meaning of \"do not revile her\" is, as you say: \"May Allah revile you\".",
      "chain": [
        "20040",
        "20022",
        "18212"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يزيد بن هارون، أخبرنا الجريري، عن حكيم بن معاوية، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة بحر الماء وبحر العسل وبحر اللبن وبحر الخمر ثم تشقق الأنهار بعد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وحكيم بن معاوية هو والد بهز بن حكيم والجريري يكنى أبا مسعود واسمه سعيد بن إياس ‏.‏",
      "text_en": " Hakim bin Mu'awiyah narrated from his father, that the Prophet (s.a.w) said:                     \"Indeed in Paradise there is a sea of water, and a sea of honey,and a sea of milk, and a sea of wine, then the rivers shall split off afterwards.\"",
      "chain": [
        "30160",
        "20472",
        "11286",
        "18212"
      ]
    },
    {
      "hadith_no": "3058",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "وقد روي عن حكيم بن معاوية، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا شؤم وقد يكون اليمن في الدار والمرأة والفرس ‏\"‏ ‏.‏ حدثنا بذلك علي بن حجر حدثنا إسماعيل بن عياش عن سليمان بن سليم عن يحيى بن جابر الطائي عن معاوية بن حكيم عن عمه حكيم بن معاوية عن النبي صلى الله عليه وسلم بهذا ‏.‏",
      "text_en": "",
      "chain": [
        "18212"
      ]
    },
    {
      "hadith_no": "1923",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن شعبة، عن أبي قزعة، عن حكيم بن معاوية، عن أبيه، أن رجلا، سأل النبي  صلى الله عليه وسلم  ما حق المرأة على الزوج قال ‏\"‏ أن يطعمها إذا طعم وأن يكسوها إذا اكتسى ولا يضرب الوجه ولا يقبح ولا يهجر إلا في البيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hakim bin Muawiyah, from his father, that:                     a man asked the Prophet(ﷺ): “What are the right of the woman over her husband?” He said: “That he should feed her as he feeds himself and clothe her as he clothes himself; he should not strike her on the face nor disfigure her, and he should not abandon her except in the house (as a form of discipline).” (Hassan)",
      "chain": [
        "30201",
        "20472",
        "20020",
        "18212"
      ]
    },
    {
      "hadith_no": "2070",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، حدثني سليمان بن سليم الكلبي، عن يحيى بن جابر، عن حكيم بن معاوية، عن عمه، مخمر بن معاوية قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا شؤم وقد يكون اليمن في ثلاثة في المرأة والفرس والدار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hakim bin Mu'awiyah that his paternal uncle Mikhmar bin Mu'awiyah said:                     \"I heard the Messenger of Allah say: 'Do not believe in omens, and good fortune is only to be found in three things: A woman, a horse and a house.\"'",
      "chain": [
        "30288",
        "20736",
        "20730",
        "10978",
        "18212"
      ]
    }
  ],
  "total_hadiths": 5
}