{
  "id": "1822",
  "name": "Sahl bin Abi Hathma ( سهل بن أبى حثمة الحارثى الأنصاري ( رضي الله عنه",
  "full_name": "Sahl bin Abi Hathma ( سهل بن أبى حثمة الحارثى الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "3",
      "date_gregorian": "NA",
      "date_display": [
        "3 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "50",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Haritha",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "1821",
      "name": "Abu Hathma bin Sa'ida ( أبو حثمة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1970",
      "name": "Umm al-Rubayyi' bint Aslam ( أم الربيع بنت أسلم بن الحريش الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "1969",
      "name": "'Amira bint Abi Hathma ( عميرة بنت أبي حثمة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1958",
      "name": "Umm Suhayl bint Abi Hathma ( أم سهيل بنت أبي حثمة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1959",
      "name": "Umayma bint Abi Hathma ( أميمة بنت أبي حثمة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "12771",
      "name": "Muhammad bin Sahl bin Abi Hathama محمد بن سهل بن أبي حثمة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12952",
      "name": "Yahya bin Sahl bin Abi Hathama يحيى بن سهل بن أبي حثمة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12677",
      "name": "Ishaq bin Sahl bin Abi Hathama إسحاق بن سهل بن أبي حثمة الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "167",
      "name": "Muhammad Ibn Maslama ( محمد بن مسلمة بن سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11810",
      "name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12771",
      "name": "Muhammad bin Sahl bin Abi Hathama محمد بن سهل بن أبي حثمة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12460",
      "name": "Muhammad bin Sulaiman bin Abi Hathma محمد بن سليمان بن أبي حثمة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11175",
      "name": "Salah bin Khuwat bin Jubayr صالح بن خوات بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2191",
      "hadith_no": "2191",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال قال يحيى بن سعيد سمعت بشيرا، قال سمعت سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر، ورخص في العرية أن تباع بخرصها يأكلها أهلها رطبا‏.‏ وقال سفيان مرة أخرى إلا أنه رخص في العرية يبيعها أهلها بخرصها، يأكلونها رطبا‏.‏ قال هو سواء‏.‏ قال سفيان فقلت ليحيى وأنا غلام إن أهل مكة يقولون إن النبي صلى الله عليه وسلم رخص في بيع العرايا‏.‏ فقال وما يدري أهل مكة قلت إنهم يروونه عن جابر‏.‏ فسكت‏.‏ قال سفيان إنما أردت أن جابرا من أهل المدينة‏.‏ قيل لسفيان وليس فيه نهى عن بيع الثمر حتى يبدو صلاحه قال لا‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     Allah's Apostle forbade the selling of fruits (fresh dates) for dried dates but allowed the sale of fruits on the 'Araya by estimation and their new owners might eat their dates fresh. Sufyan (in another narration) said, \"I told Yahya (a sub-narrator) when I was a mere boy, 'Meccans say that the Prophet allowed them the sale of the fruits on 'Araya by estimation.' Yahya asked, 'How do the Meccans know about it?' I replied, 'They narrated it (from the Prophet ) through Jabir.' On that, Yahya kept quiet.\" Sufyan said, \"I meant that Jabir belonged to Medina.\" Sufyan was asked whether in Jabir's narration there was any prohibition of selling fruits before their benefit is evident (i.e. no dangers of being spoilt or blighted). He replied that there was none.",
      "usc_msa_ref": "396",
      "chain": [
        "30026",
        "20005",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-2383",
      "hadith_no": "2383",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا زكرياء بن يحيى، أخبرنا أبو أسامة، قال أخبرني الوليد بن كثير، قال أخبرني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر، إلا أصحاب العرايا فإنه أذن لهم‏.‏ قال أبو عبد الله وقال ابن إسحاق حدثني بشير مثله‏.‏",
      "text_en": " Narrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:                     Allah's Apostle forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale.",
      "usc_msa_ref": "569",
      "chain": [
        "30193",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-2702",
      "hadith_no": "2702",
      "source": "Sahih Bukhari",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid went to Khaibar when it had a peace treaty (with the Muslims).",
      "usc_msa_ref": "865",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-3173",
      "hadith_no": "3173",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا مسدد، حدثنا بشر  هو ابن المفضل  حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح، فتفرقا، فأتى محيصة إلى عبد الله بن سهل وهو يتشحط في دم قتيلا، فدفنه ثم قدم المدينة، فانطلق عبد الرحمن بن سهل ومحيصة وحويصة ابنا مسعود إلى النبي صلى الله عليه وسلم، فذهب عبد الرحمن يتكلم فقال ‏\"‏ كبر كبر ‏\"‏‏.‏ وهو أحدث القوم، فسكت فتكلما فقال ‏\"‏ أتحلفون وتستحقون قاتلكم أو صاحبكم ‏\"‏‏.‏ قالوا وكيف نحلف ولم نشهد ولم نر قال ‏\"‏ فتبريكم يهود بخمسين ‏\"‏‏.‏ فقالوا كيف نأخذ أيمان قوم كفار فعقله النبي صلى الله عليه وسلم من عنده‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid set out to Khaibar, the inhabitants of which had a peace treaty with the Muslims at that time. They parted and later on Muhaiyisa came upon `Abdullah bin Sah! and found him murdered agitating in his blood. He buried him and returned to Medina. `Abdur Rahman bin Sahl, Muhaiyisa and Huwaiuisa, the sons of Mas`ud came to the Prophet and `Abdur Rahman intended to talk, but the Prophet said (to him), \"Let the eldest of you speak.\" as `Abdur-Rahman was the youngest:. `Abdur-Rahman kept silent and the other two spoke. The Prophet said, \"If you swear as to who has committed the murder, you will have the right to take your right from the murderer.\" They said, \"How should we swear if we did not witness the murder or see the murderer?\" The Prophet said, \"Then the Jews can clear themselves from the charge by taking Alaska (an oath taken by men that it was not they who committed the murder).\" The!y said, \"How should we believe in the oaths of infidels?\" So, the Prophet himself paid the blood money (of `Abdullah). (See Hadith No. 36 Vol. 9.)",
      "usc_msa_ref": "398",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-4181",
      "hadith_no": "4181",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد القطان، عن يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات، عن سهل بن أبي حثمة، قال يقوم الإمام مستقبل القبلة، وطائفة منهم معه وطائفة من قبل العدو، وجوههم إلى العدو، فيصلي بالذين معه ركعة، ثم يقومون، فيركعون لأنفسهم ركعة ويسجدون سجدتين في مكانهم، ثم يذهب هؤلاء إلى مقام أولئك فيركع بهم ركعة، فله ثنتان، ثم يركعون ويسجدون سجدتين‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     (describing the Fear prayer): The Imam stands up facing the Qibla and one batch of them (i.e. the army) (out of the two) prays along with him and the other batch faces the enemy. The Imam offers one rak`a with the first batch they themselves stand up alone and offer one bowing and two prostrations while they are still in their place, and then go away to relieve the second batch, and the second batch comes (and takes the place of the first batch in the prayer behind the Imam) and he offers the second rak`a with them. So he completes his two-rak`at and then the second batch bows and prostrates two prostrations (i.e. complete their second rak`a and thus all complete their prayer).",
      "usc_msa_ref": "452",
      "chain": [
        "30175",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-4182",
      "hadith_no": "4182",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Salih bin Hathma:                     The Prophet said as above (Hadith 452).",
      "usc_msa_ref": "453",
      "chain": [
        "30175",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sahih-bukhari-7279",
      "hadith_no": "7279",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي ليلى، ح حدثنا إسماعيل، حدثني مالك، عن أبي ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره هو، ورجال، من كبراء قومه أن عبد الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم، فأخبر محيصة أن عبد الله قتل وطرح في فقير أو عين، فأتى يهود فقال أنتم والله قتلتموه‏.‏ قالوا ما قتلناه والله‏.‏ ثم أقبل حتى قدم على قومه فذكر لهم، وأقبل هو وأخوه حويصة  وهو أكبر منه  وعبد الرحمن بن سهل، فذهب ليتكلم وهو الذي كان بخيبر فقال النبي صلى الله عليه وسلم لمحيصة ‏\"‏ كبر كبر ‏\"‏‏.‏ يريد السن، فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم، وإما أن يؤذنوا بحرب ‏\"‏‏.‏ فكتب رسول الله صلى الله عليه وسلم إليهم به، فكتب ما قتلناه‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ أفتحلف لكم يهود ‏\"‏‏.‏ قالوا ليسوا بمسلمين‏.‏ فوداه رسول الله صلى الله عليه وسلم من عنده مائة ناقة حتى أدخلت الدار‏.‏ قال سهل فركضتني منها ناقة‏.‏",
      "text_en": " Narrated Abu Laila bin `Abdullah bin `Abdur-Rahman bin Sahl:                     Sahl bin Abi Hathma and some great men of his tribe said, `Abdullah bin 'Sahl and Muhaiyisa went out to Khaibar as they were struck with poverty and difficult living conditions. Then Muhaiyisa was informed that `Abdullah had been killed and thrown in a pit or a spring. Muhaiyisa went to the Jews and said, \"By Allah, you have killed my companion.\" The Jews said, \"By Allah, we have not killed him.\" Muhaiyisa then came back to his people and told them the story. He, his elder brother Huwaiyisa and `Abdur-Rahman bin Sahl came (to the Prophet) and he who had been at Khaibar, proceeded to speak, but the Prophet said to Muhaiyisa, \"The eldest! The eldest!\" meaning, \"Let the eldest of you speak.\" So Huwaiyisa spoke first and then Muhaiyisa. Allah's Apostle said, \"The Jews should either pay the blood money of your (deceased) companion or be ready for war.\" After that Allah's Apostle wrote a letter to the Jews in that respect, and they wrote that they had not killed him. Then Allah's Apostle said to Huwaiyisa, Muhaiyisa and `Abdur-Rahman, \"Can you take an oath by which you will be entitled to take the blood money?\" They said, \"No.\" He said (to them), \"Shall we ask the Jews to take an oath before you?\" They replied, \"But the Jews are not Muslims.\" So Allah's Apostle gave them one-hundred she-camels as blood money from himself. Sahl added: When those she-camels were made to enter the house, one of them kicked me with its leg.",
      "usc_msa_ref": "302",
      "chain": [
        "30355",
        "20001",
        "20208",
        "20001",
        "1822"
      ]
    },
    {
      "id": "sahih-muslim-1984",
      "hadith_no": "1984",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن، القاسم عن أبيه، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بأصحابه في الخوف فصفهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Yazid b. Ruman told on the authority of Salih b. Khawwat on the authority of one who prayed in time of danger with Allah's Messenger (may peace he upon him) at the Battle of Dhat ar-Riqa' that a group formed a row and prayed along with him, and a group faced the enemy. He led the group which was along with him in a rak'ah, then remained standing while they finished the prayer by themselves. Then they departed and formed a row facing the enemy. Then the second group came and he led them in the remaining rak'ah, after which he remained seated while they finished the prayer themselves. He then led them in salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sahih-muslim-3971",
      "hadith_no": "3971",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه عمرو الناقد، وابن، نمير قالا حدثنا سفيان بن عيينة، عن يحيى بن، سعيد عن بشير بن يسار، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم نحو حديثهم ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Sahl b. Abu Hathma.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "30212",
        "20005",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sahih-muslim-3972",
      "hadith_no": "3972",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحسن الحلواني، قالا حدثنا أبو أسامة، عن الوليد، بن كثير حدثني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة الثمر بالتمر إلا أصحاب العرايا فإنه قد أذن لهم ‏.‏",
      "text_en": " Sahl b. Abu Hathma reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, i. e. exchange of fresh dates with dry dates. except in case of those to whom donations of some trees have been made. It is for them that concession has been given.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "130115",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "id": "sahih-muslim-4434",
      "hadith_no": "4434",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يحيى، - وهو ابن سعيد - عن بشير، بن يسار عن سهل بن أبي حثمة، - قال يحيى وحسبت قال - وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا محيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم فذهب عبد الرحمن ليتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر ‏\"‏ ‏.‏ الكبر في السن فصمت فتكلم صاحباه وتكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم ‏\"‏ ‏.‏ أو ‏\"‏ قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏",
      "text_en": " Sahl b. Abu Hathma and Rafi' b. Khadij reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid went out and as they reached Khaibar they were separated. Then Muhayyisa found 'Abdullah b. Sahl having been killed. He buried him, and then came to Allah's Messenger (may peace be upon him). They were Huwayyisa b. Mas'ud and 'Abd al-Rahman b. Sahl, and he (the latter one) was the youngest of the people (those three who had come to seek an interview with the Holy Prophet) began to talk before his Companions (had spoken). Thereupon Allah's Messenger (may peace be upon him) said:                      The eldest one (eldest in regard to age should speak). So he kept quiet, and his companions (Muhayyisa and Huwayyisa) began to speak, and he ('Abd al Rahman) spoke along with them and they narrated to Allah's Messenger (may peace be upon him) the murder of 'Abdullah b. Sahl. Thereupon he said to them: Are you prepared to take fifty oaths so that you may be entitled (to blood-wit) of your companion (or your man who has murdered)? They said: How can we take an oath on a matter which we have not witnessed? He (the Holy Prophet) said: Then the Jews will exonerate themselves by fifty oaths. They said: How can we accept the oaths of people who are unbelievers? When Allah's Messenger (may peace be upon him) saw that, he himself paid his blood-wit.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-4435",
      "hadith_no": "4435",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد، الله بن سهل انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن وابنا عمه حويصة ومحيصة إلى النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغر منهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر - أو قال - ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏",
      "text_en": " Sahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b. Sahl went towards Khaibar and they separated near the palm-trees. 'Abdullah b. Sahl was killed. They accused the Jews (for this act). And there came to Allah's Apostle (may peace be upon him) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (may peace be upon him) said:                      Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b. Sahl). Thereupon Allah's Messenger (may peace be upon him) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (may peace be upon him) paid the blood wit for him. Sahl said: As one day I entered the fold a she-camel amongst those camels hit me with its leg.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986",
        "1920"
      ]
    },
    {
      "id": "sahih-muslim-4436",
      "hadith_no": "4436",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا القواريري، حدثنا بشر بن المفضل، حدثنا يحيى بن سعيد، عن بشير بن، يسار عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم ‏.‏ نحوه ‏.‏ وقال في حديثه فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏ ولم يقل في حديثه فركضتني ناقة ‏.‏",
      "text_en": " Sahl b. Abu Hathma has narrated this hadith through another chain of transmitters with a slight variation of words, but no mention has been made of the hitting by the she-camel.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sahih-muslim-4441",
      "hadith_no": "4441",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا بشر بن عمر، قال سمعت مالك بن أنس، يقول حدثني أبو ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره عن رجال، من كبراء قومه أن عبد، الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتى محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في عين أو فقير فأتى يهود فقال أنتم والله قتلتموه ‏.‏ قالوا والله ما قتلناه ‏.‏ ثم أقبل حتى قدم على قومه فذكر لهم ذلك ثم أقبل هو وأخوه حويصة وهو أكبر منه وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال رسول الله صلى الله عليه وسلم لمحيصة ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب رسول الله صلى الله عليه وسلم إليهم في ذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا بمسلمين ‏.‏ فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم رسول الله صلى الله عليه وسلم مائة ناقة حتى أدخلت عليهم الدار ‏.‏ فقال سهل فلقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " Abu Laila 'Abdullah b. 'Abd al-Rahman b. Sahl reported that the elderly persons of (the tribe) had informed Sahl b. Abu Hathma that 'Abdullah b. Sahl and Muhayyisa went out to Khaibar under some distress which had afflicted them. Muhayyisa came and informed that Abdutlah b. Sahl had been killed, and (his dead body) had been thrown in a well or in a ditch. He came to the Jews and said:                      By Allah, it is you who have killed him. They said: By Allah, we have not killed him. He then came to his people, and made mention of that to them. Then came he and his brother Huwayyisa, and he was older than he, and 'Abd al-Rahman b. Sahl. Then Muhayyisa went to speak, and it was he who had accompanied ('Abdullah) to Khaibar, whereupon Allah's Messenger (may peace be upon him) said to Muhayyisa: Observe greatness of the great (he meant the seniority of age). Then Huwayyisa spoke and then Muhayyisa also spoke. Thereupon Allah's Messenger (may peace be upon him) said: They should either pay blood-wit for your companion, or be prepared for war. Allah's Messenger (may peace be upon him) wrote about it to them (to the Jews). They wrote: Verily, by Allah, we have not killed him. Thereupon Allah's Messenger (may peace be upon him) said to Huwayyisa and Muhayyisa and Abd al-Rahman: Are you prepared to take oath in order to entitle yourselves for the blood-wit of your companion? They said: No. He (the Holy Prophet) said: Then the Jews will take oath (of their innocence). They said: They are not Muslims. Allah's Messenger (may peace be upon him), however, himself paid the blood-wit to them and sent to them one hundred camels until they entered into their houses, Sahl said: One red she-camel among them kicked me.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20211",
        "20001",
        "1822"
      ]
    },
    {
      "id": "sunan-abi-daud-1237",
      "hadith_no": "1237",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن النبي صلى الله عليه وسلم صلى بأصحابه في خوف فجعلهم خلفه صفين فصلى بالذين يلونه ركعة ثم قام فلم يزل قائما حتى صلى الذين خلفهم ركعة ثم تقدموا وتأخر الذين كانوا قدامهم فصلى بهم النبي صلى الله عليه وسلم ركعة ثم قعد حتى صلى الذين تخلفوا ركعة ثم سلم ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah:                     The Prophet (ﷺ) prayed in time of danger and divided them (the people) behind him in two rows. He then led those who were near him in one rak'ah. Then he stood and remained standing till those who were in second row offered one rak'ah. Thereafter they came forward and those who were in front of them (in the first row) stepped backward. The Prophet (ﷺ) led them in one rak'ah of prayer. He sat down till those who were in the second row completed on rak'ah. He then uttered the salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sunan-abi-daud-3010",
      "hadith_no": "3010",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا الربيع بن سليمان المؤذن، حدثنا أسد بن موسى، حدثنا يحيى بن زكريا، حدثني سفيان، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال قسم رسول الله صلى الله عليه وسلم خيبر نصفين نصفا لنوائبه وحاجته ونصفا بين المسلمين قسمها بينهم على ثمانية عشر سهما ‏.‏",
      "text_en": " Sahl bin Abi Hathmah said “The Apostle of Allaah(ﷺ) divide Khaibar into two halves. One half was reserved for his emergency and needs, the other half was meant for the Muslims. He divided among them into eighteen portions.”",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "28040",
        "20005",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-abi-daud-3363",
      "hadith_no": "3363",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن عيينة، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمر بالتمر ورخص في العرايا أن تباع بخرصها يأكلها أهلها رطبا ‏.‏",
      "text_en": " Narrated Sahl b. Abi Khathmah:                     The Messenger of Allah (ﷺ) forbade the sale of fruits for dried dates, but gave license regarding the 'araya for its sale on the basis of a calculation of their amount. But those who buy them can eat them when fresh.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20005",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-abi-daud-3372",
      "hadith_no": "3372",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثني يونس، قال سألت أبا الزناد عن بيع الثمر، قبل أن يبدو، صلاحه وما ذكر في ذلك فقال كان عروة بن الزبير يحدث عن سهل بن أبي حثمة عن زيد بن ثابت قال كان الناس يتبايعون الثمار قبل أن يبدو صلاحها فإذا جد الناس وحضر تقاضيهم قال المبتاع قد أصاب الثمر الدمان وأصابه قشام وأصابه مراض عاهات يحتجون بها فلما كثرت خصومتهم عند النبي صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم كالمشورة يشير بها ‏\"‏ فإما لا فلا تتبايعوا الثمرة حتى يبدو صلاحها ‏\"‏ ‏.‏ لكثرة خصومتهم واختلافهم ‏.‏",
      "text_en": " Yunus said:                      I asked Abu Zinad about the sale of fruits before they were clearly in good condition, and what was said about it. He replied: Urwah ibn az-Zubayr reports a tradition from Sahl ibn Abi Hathmah on the authority of Zayd ibn Thabit who said: The people used to sell fruits before they were clearly in good condition. When the people cut off the fruits, and were demanded to pay the price, the buyer said: The fruits have been smitten by duman, qusham and murad fruit diseases on which they used to dispute. When their disputes which were brought to the Prophet (ﷺ) increased, the Messenger of Allah (ﷺ) said to them as an advice: No, do not sell fruits till they are in good condition, due to a large number of their disputes and differences.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11061",
        "10511",
        "1822",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-4520",
      "hadith_no": "4520",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن عبيد، - المعنى - قالا حدثنا حماد بن زيد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد الله بن سهل، انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن بن سهل وابنا عمه حويصة ومحيصة فأتوا النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغرهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ أو قال ‏\"‏ ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال قال سهل دخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏ قال أبو داود رواه بشر بن المفضل ومالك عن يحيى بن سعيد قال فيه ‏\"‏ أتحلفون خمسين يمينا وتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ولم يذكر بشر دما وقال عبدة عن يحيى كما قال حماد ورواه ابن عيينة عن يحيى فبدأ بقوله ‏\"‏ تبرئكم يهود بخمسين يمينا يحلفون ‏\"‏ ‏.‏ ولم يذكر الاستحقاق قال أبو داود وهذا وهم من ابن عيينة ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah and Rafi' b. Khadij:                     Muhayyasah b. Mas'ud and 'Abd Allah b. Sahl came to Khaibar and parted (from each other) among palm trees. 'Abd Allah b. Sahl was killed. The Jews were blamed (for the murder). 'Abd al-Rahman b. Sahl and Huwayyasah and Muhayyasah, the sons of his uncle (Mas'ud) came to the Prophet (ﷺ). 'Abd al-Rahman, who was the youngest, spoke about his brother, but the Messenger of Allah (ﷺ) said to him: (Respect) the elder, (respect) the elder or he said: Let the eldest begin. They then spoke about their friend and the Messenger of Allah (ﷺ) said: Fifty of you should take oaths regarding a man from them (the Jews) and he should be entrusted (to him) with his rope (in his neck). They said: It is a matter which we did not see. How can we take oaths ? He said: The Jews exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah! they are a people who are infidels. So the Messenger of Allah (ﷺ) paid them bloodwit himself. Sahl said: Once I entered the resting place of their camels, and the she-camel struck me with her lef. Hammad said this or (something) similar to it.Abu Dawud said: Another version transmitted by Yahya b. Sa'id has: Would you swear fifty oaths and make you claim regarding your friend or your slain man ? Bishr, the transmitter, did mention blood. 'Abdah transmitted it from Yahya as transmitted by Hammad. Ibn 'Uyainah has also transmitted it from Yahya, and began with his words: The Jew will exonerate themselves by fifty oaths which they will swear. He did not mention the claim.Abu Dawud said: This is a misunderstanding on the part of Ibn 'Uyainah.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30213",
        "20022",
        "11062",
        "11810",
        "1822",
        "1986",
        "1920"
      ]
    },
    {
      "id": "sunan-abi-daud-4521",
      "hadith_no": "4521",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني مالك، عن أبي ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره هو، ورجال، من كبراء قومه أن عبد الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود فقال أنتم والله قتلتموه ‏.‏ قالوا والله ما قتلناه ‏.‏ فأقبل حتى قدم على قومه فذكر لهم ذلك ثم أقبل هو وأخوه حويصة - وهو أكبر منه - وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب إليهم رسول الله صلى الله عليه وسلم بذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا مسلمين فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم مائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " Sahl b. Abi Hathmah and some senior men of the tribe told that 'Abd Allah b. Abi Sahl and Muhayyasah came to Khaibar on account of the calamity (i.e. famine) that befall them. Muhayyasah came and told the 'Abd Allah b. Sahl had been killed and thrown in a well or stream. He hen came to the Jews and said:                      I swear by Allah, you have killed him. They said: We swear by Allah, we have not killed him. He then proceeded and came to his tribe  and mentioned this to them. Then he, his brother Huwayyasah, who was older to him, and 'Abd al-Rahman b. Sahl came forward (to the Prophet). Muhayyasah began to speak. It was he who was at Khaibar. The Messenger of Allah (ﷺ) then said to him: Let the eldest (speak), let the eldest (speak), meaning age. So Huwayyasah spoke, and after him Muhayyasah spoke. The Messenger of Allah (ﷺ) then said: They should either pay the bloodwit for you friend or they should be prepared for war. So the Messenger of Allah (ﷺ) wrote to them about it. They wrote (in reply): We swear by Allah, we have not killed him. The Messenger of Allah (ﷺ) then said to Huwayyasah, Muhayyasah and 'Abd al-Rahman: Will you take an oath and thus have the claim to the blood of your friend ? They said: No. He (the Prophet) said: The Jews will then take an oath. They said: They are not Muslims. Then the Messenger of Allah (ﷺ) himself paid the bloodwit. The Messenger of Allah (ﷺ) then sent on one hundred she-camels and they were entered in their house. Sahl said: A red she-camel of them gave me a kick.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "1822"
      ]
    },
    {
      "id": "jami-al-tirmidhi-565",
      "hadith_no": "565",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، حدثنا يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أنه قال في صلاة الخوف قال يقوم الإمام مستقبل القبلة وتقوم طائفة منهم معه وطائفة من قبل العدو ووجوهم إلى العدو فيركع بهم ركعة ويركعون لأنفسهم ركعة ويسجدون لأنفسهم سجدتين في مكانهم ثم يذهبون إلى مقام أولئك ويجيء أولئك فيركع بهم ركعة ويسجد بهم سجدتين فهي له ثنتان ولهم واحدة ثم يركعون ركعة ويسجدون سجدتين ‏.‏",
      "text_en": " Sahl bin Abi Hathmah said about Salat Al-Khawf:                     \"The Imam stands facing the Qiblah while a group of them stand with him, and a group is before the enemy, facing the enemy. He leads them in a Rak'ah, and they perform a bowing by themselves, and they perform two prostrations in their places. Then they go to take the position of the others and the others come (for prayers). He (the Imam) bows for one Rak'ah with them and performs two prostrations with them. That is two for him and one for them, then they perform one bowing and two prostrations.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "jami-al-tirmidhi-566",
      "hadith_no": "566",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "قال أبو عيسى قال محمد بن بشار سألت يحيى بن سعيد عن هذا الحديث، فحدثني عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم بمثل حديث يحيى بن سعيد الأنصاري ‏.‏ وقال لي يحيى اكتبه إلى جنبه ولست أحفظ الحديث ولكنه مثل حديث يحيى بن سعيد الأنصاري ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ لم يرفعه يحيى بن سعيد الأنصاري عن القاسم بن محمد وهكذا روى أصحاب يحيى بن سعيد الأنصاري موقوفا ورفعه شعبة عن عبد الرحمن بن القاسم بن محمد ‏.‏",
      "text_en": " (Abu Eisa said:                     ) Muhammad bin Bash-har said:\"I asked Yahya bin Sa'eed (narrators in no. 565) about this Hadith. So he narrated it to me from Shu'bah, from Abdur-Rahman bin Al-Qasim, from his father, from Salih bin Khawwat, from Sahl bin Abi Hathmah, from the Prophet - the same as the Hadith of Yahya bin Sa'eed Al-Ansari. And he (Yahya) said to me: \"Write it next to it. He did not memorize the Hadith better though, rather it is the same Hadith as that of Yahya bin Sa'eed Al-Ansari'\" (a Hadith similar to no. 565, with a different chain of narrators)",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1303",
      "hadith_no": "1303",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الحلواني الخلال، حدثنا أبو أسامة، عن الوليد بن كثير، حدثنا بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن بيع المزابنة الثمر بالتمر إلا لأصحاب العرايا فإنه قد أذن لهم وعن بيع العنب بالزبيب وعن كل ثمر بخرصه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Bushair bin Yasar, the freed slave of Banu Harithah:                     Rafi' bin Khadij and Sahl bin Abi Hathmah narrated to him that the Messenger of Allah (ﷺ) prohibited Al-Muzabanah sales, (buying) fruits with dried dates, except for those who practice Al-'Araya - for he permitted it for them - and from buying grapes with raisins, and from every fruit by its estimation.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20318",
        "11230115",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1422",
      "hadith_no": "1422",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال يحيى وحسبت عن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هناك ثم إن محيصة وجد عبد الله بن سهل قتيلا قد قتل فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم ذهب عبد الرحمن ليتكلم قبل صاحبيه قال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ فصمت وتكلم صاحباه ثم تكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏  حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، نحو هذا الحديث بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم في القسامة وقد رأى بعض فقهاء المدينة القود بالقسامة ‏.‏ وقال بعض أهل العلم من أهل الكوفة وغيرهم إن القسامة لا توجب القود وإنما توجب الدية ‏.‏ آخر أبواب الديات والحمد لله ‏.‏",
      "text_en": " Narrated Sahl bin Abi Hatamah:                     Yahya (one of the narrators) said: And I think it was from Rafi' bin Khadij - that 'Abdullah bin Sahl bin Zaid and Muhaiysah bin Mas'ud bin Zaid went out and when they reached Khaibar they separated while there. Then Muhayyisah found 'Abdullah bin Sahl murdered [so he buried him]. Then he went to the Messenger of Allah (ﷺ) along with Huwayyisah bin Mas'ud and Abdur-Rahman bin Sahl. The youngest of the people, Abdur-Rahman, went to speak ahead of his companions. The Messenger of Allah (ﷺ) said to him: \"Let the eldest of you speak.\" So he was silent and two companions spoke. So he conversed with them and they mentioned to the Messenger of Allah (ﷺ) about the murder of 'Abdullah bin Sahl. He said to them: \"If fifty of you can swear an oath then you will have the right against the murderer.\" They said: \"How can we take an oath when we did not witness it?\" He said: \"Then fifty of Jews can swear to clear the charge with you?\" They said: \"How could we accept the oaths of a disbelieving people?\" So when he saw that, the Messenger of Allah (ﷺ) paid the blood-money.\" (Another Chain) from Sahl bin Abi Hathman and Rafi' bin Khadij, and the meaning is similar to this Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-748",
      "hadith_no": "748",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا علي بن حجر، وإسحاق بن منصور، قالا حدثنا سفيان، عن صفوان بن سليم، عن نافع بن جبير، عن سهل بن أبي حثمة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى أحدكم إلى سترة فليدن منها لا يقطع الشيطان عليه صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Abi Hathmah said:                      \"When anyone of you prays toward a Sutra, let him get close to it and not allow the Shaitan to sever his prayer for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "30313",
        "20005",
        "11177",
        "11059",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-1536",
      "hadith_no": "1536",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، أن رسول الله صلى الله عليه وسلم صلى بهم صلاة الخوف فصف صفا خلفه وصفا مصافو العدو فصلى بهم ركعة ثم ذهب هؤلاء وجاء أولئك فصلى بهم ركعة ثم قاموا فقضوا ركعة ركعة ‏.‏",
      "text_en": " It was narrated from Salih bin Khawwat, from Sahl bin Abi Hathmah that:                     The Messenger of Allah (ﷺ) led them in offering the fear prayer. Some formed a row behind him and some formed a row facing the enemy. He led them in praying one rak'ah, then they moved away and the others came, and he led them in praying one rak'ah, then they got up and each (group) made up the other rak'ah.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "10530",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-2491",
      "hadith_no": "2491",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، ومحمد بن جعفر، قالا حدثنا شعبة، قال سمعت خبيب بن عبد الرحمن، يحدث عن عبد الرحمن بن مسعود بن نيار، عن سهل بن أبي حثمة، قال أتانا ونحن في السوق فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا خرصتم فخذوا ودعوا الثلث فإن لم تأخذوا أو تدعوا الثلث - شك شعبة - فدعوا الربع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Mas'ud bin Niyar:                     \"Sahl bin Abi Hathmah came to us when we were in the market and said: \"The Messenger of Allah said: When you have estimated, take two-thirds (of the portion you have estimated as Zakah) and leave one-third, and if you do not take (two-thirds) or leave one-third. (One of the reporters) Shu 'bah doubted - leave one quarter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20020",
        "11159",
        "12301",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4542",
      "hadith_no": "4542",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، عن يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، أن النبي صلى الله عليه وسلم نهى عن بيع الثمر حتى يبدو صلاحه ورخص في العرايا أن تباع بخرصها يأكلها أهلها رطبا ‏.‏",
      "text_en": " It was narrated from Sahl bin Abi Hathamah that the Prophet forbade selling fruits before their condition was known, but he granted a concession allowing 'Araya sales by estimate, so its people could eat fresh dates.",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4543",
      "hadith_no": "4543",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الحسين بن عيسى، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال أخبرني بشير بن يسار، أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر إلا لأصحاب العرايا فإنه أذن لهم ‏.‏",
      "text_en": " Rafi bin Khadij and Sahl Bi Abi Hathamah narrated that the Messenger of Allah forbade Muzabanah, which means selling fresh dates still on the tree for dried dates, except in cases of 'Araya, for which he gave permission. (Sahih",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4710",
      "hadith_no": "4710",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني مالك بن أنس، عن أبي ليلى بن عبد الله بن عبد الرحمن الأنصاري، أن سهل بن أبي حثمة، أخبره أن عبد الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهما فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود فقال أنتم والله قتلتموه ‏.‏ فقالوا والله ما قتلناه ‏.‏ ثم أقبل حتى قدم على رسول الله صلى الله عليه وسلم فذكر ذلك له ثم أقبل هو وحويصة وهو أخوه أكبر منه وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ وتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب النبي صلى الله عليه وسلم في ذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ تحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا مسلمين ‏.‏ فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم بمائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " It was narrated from Sahl bin Abi Hathmah that:                     'Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah and he told him that 'Abdullah bin Sahl had been Killed and thrown into a pit, or a well. He came to the Jews and said: \"By Allah, you killed him. \" They said: \"By Allah, we did not kill him.\"Then he went back to the Messenger of Allah and told him about that. Then he and Huwayysah  - his brother who was older than him - and 'Abdur-Rahman bin Sahl, came (to the Prophet). Muhayysah, who was the one who had been at Khaibar, began to speak, but the messenger of Allah said: \"Let the elder speak first,\" So Huwayysah elder speaks first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your comanion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah said to Huwayysah. Muhayysah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the jews swear an oath for you? They said: \"They are not Muslims.\" So the Messenger of Allah paid (the Diyah) himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4711",
      "hadith_no": "4711",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، قال حدثني مالك، عن أبي ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره ورجال، من كبراء قومه أن عبد، الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود وقال أنتم والله قتلتموه قالوا والله ما قتلناه ‏.‏ فأقبل حتى قدم على قومه فذكر لهم ثم أقبل هو وأخوه حويصة وهو أكبر منه وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال رسول الله صلى الله عليه وسلم لمحيصة ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب إليهم رسول الله صلى الله عليه وسلم في ذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا بمسلمين ‏.‏ فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم بمائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " It was narrated from Abu Laila bin 'Abdullah bin 'Abdur-Rahman bin Sahl, from Sahl bin Abi Hathmah, that:                     he informed him, ans some men among the elders of his people, that \"Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah, and he told him that 'Abdullah bin Sahl had been killed and thrown into a pit or well. He came to the Jews and said: \"By Allah, you killed him.\" They said: \"By Allah, we did not kill him.\" Then he went baack to his people and told them about that. Then he and his brother Huwayysah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the prophet). Muhayysah, who was the one who had been at Khaibar, bnegan to speak, but the Messenger of Allah said: \"Let the elder speak first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your companion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the Jews swear an oath for you?\" They said: \"They are not Muslims.\" So the Messenger of Allah paid it himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "30234",
        "20001",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4712",
      "hadith_no": "4712",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال وحسبت قال وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا بمحيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل - وكان أصغر القوم - فذهب عبد الرحمن يتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر في السن ‏\"‏ ‏.‏ فصمت وتكلم صاحباه ثم تكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا وتستحقون صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا كيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطاه عقله ‏.‏",
      "text_en": " It was narrated from Yahya, from Bushair bin Yasa, from Sahl bin Abi Hathmah who said - and I think he said:                     and from Rafi bin Khadij, the two of them said - :\"Abdullah bin Sahl bin Zaid and Muhayysah bin Mas'ud went out until when they reached Khaibar, they went their separate ways. Then Muhayysah found 'Abdullah bin Sahl slain, so he buried him. Then he came to the Mesenger of Allah, along with Huwayysah bin Mas'ud and 'Abdur-Rahman bin Sahl, who was the youngest of them, 'Abdur-Rahman started to speak before his two companions, but the Messenger of Allah said to him: \"Let the clear speak first.\" So he fell silent and his two companions spoke, then he spoke with them. They told the Messenger of Allah about the killing of 'Abdullah bin Sahl, and he said to them: \"Will you swear fifty oaths, then you will receive compensation, or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness what happened?\" he said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"How can we accept the oath of a disbelieving people?\" When the Messenger of Allah saw that, he paid the blood money (himself).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4713",
      "hadith_no": "4713",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عبدة، قال أنبأنا حماد، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أنهما حدثاه أن محيصة بن مسعود وعبد الله بن سهل أتيا خيبر في حاجة لهما فتفرقا في النخل فقتل عبد الله بن سهل فجاء أخوه عبد الرحمن بن سهل وحويصة ومحيصة ابنا عمه إلى رسول الله صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه - وهو أصغر منهم - فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر ليبدأ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم وذكر كلمة معناها ‏\"‏ يقسم خمسون منكم ‏\"‏ ‏.‏ فقالوا يا رسول الله أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم فركضتني ناقة من تلك الإبل ‏.‏",
      "text_en": " It was narrated from Sahl bin Ab Hathmah and Rafi bin Khadij that:                     Muhayysah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah bin Sahl was killed, and 'Abdullah bin Sahl was killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himself Sahl said: \"I entered a Mirbad of theirs, and one of those camels kicked me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4714",
      "hadith_no": "4714",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، أن عبد الله بن سهل، ومحيصة بن مسعود بن زيد، أنهما أتيا خيبر وهو يومئذ صلح فتفرقا لحوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم - وهو أحدث القوم سنا - فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم فتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نحلف ولم نشهد ولم نر قال ‏\"‏ تبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narrated from Sahi bin Abi Hathmah that:                     'Abdullah bin SAahi and Nubayysah bin Mas'ud bin Zaid went o Khaibar, and at that time there was peace treaty. They went their separate ways to about their business, then Muhayysah came upon 'Abdullah in Sahl lying dead in a pool of blood. He buried him, then he came to AL-Madinah. 'Abdur-Rahman bin Sahi. Huwayysah, and Muhayysah came to the Messenger of Allah, and 'Abdur-Rehman started to speak, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we swear an oath when we did not witness, and did not see (what happened)?\" He said: \"The n can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4715",
      "hadith_no": "4715",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر وهي يومئذ صلح فتفرقا في حوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ وهو أحدث القوم فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم وتستحقون قاتلكم أو صاحبكم ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نحلف ولم نشهد ولم نر فقال ‏\"‏ أتبرئكم يهود بخمسين ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narratd that Sahl bin Abi Hatmah said:                     \"Abdullah bin Sahl and Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah bin Sahl lying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman bin Sahl and Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4716",
      "hadith_no": "4716",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول أخبرني بشير بن يسار، عن سهل بن أبي حثمة، أن عبد الله بن سهل الأنصاري، ومحيصة بن مسعود، خرجا إلى خيبر فتفرقا في حاجتهما فقتل عبد الله بن سهل الأنصاري فجاء محيصة وعبد الرحمن أخو المقتول وحويصة بن مسعود حتى أتوا رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال له النبي صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ فتكلم محيصة وحويصة فذكروا شأن عبد الله بن سهل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تحلفون خمسين يمينا فتستحقون قاتلكم ‏\"‏ ‏.‏ قالوا كيف نحلف ولم نشهد ولم نحضر فقال رسول الله صلى الله عليه وسلم ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نقبل أيمان قوم كفار قال فوداه رسول الله صلى الله عليه وسلم ‏.‏ قال بشير قال لي سهل بن أبي حثمة لقد ركضتني فريضة من تلك الفرائض في مربد لنا ‏.‏",
      "text_en": " It was narrated from Sahl bin Abi Hathmah that:                     'Abdullah bin Sahi Al-Anasri and Muhayysah bin Mas'ud went out to Khaibar and went their separate ways to go about their business. 'Abdullah bin Sahl Al-Anasari was killed and Muhayysah. 'Abdur-Rahman, who was the brother of the victim, and Huwayysah, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the prophert said to him: \"Let the elders speak first.\" So Muhayysah and Huwayysah spoke and told him about the case of 'Abdullah bin Sahl. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness (what happened) and we were not there?\" The Messenger of Allah said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself. (One of the narrators) Bushair said: 'One of those camels kicked me in a Mirbad of ours.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20259",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4717",
      "hadith_no": "4717",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال وجد عبد الله بن سهل قتيلا فجاء أخوه وعماه حويصة ومحيصة وهما عما عبد الله بن سهل إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ قالا يا رسول الله إنا وجدنا عبد الله بن سهل قتيلا في قليب من بعض قلب خيبر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من تتهمون ‏\"‏ ‏.‏ قالوا نتهم اليهود ‏.‏ قال ‏\"‏ أفتقسمون خمسين يمينا أن اليهود قتلته ‏\"‏ ‏.‏ قالوا وكيف نقسم على ما لم نر قال ‏\"‏ فتبرئكم اليهود بخمسين أنهم لم يقتلوه ‏\"‏ ‏.‏ قالوا وكيف نرضى بأيمانهم وهم مشركون فوداه رسول الله صلى الله عليه وسلم من عنده ‏.‏ أرسله مالك بن أنس ‏.‏",
      "text_en": " It was narrated that Sahl bin Abi Hathmah said:                     \"Abdullah bin Sahl was found slain, and his brother, and two paternal uncles, Huwayysah and Huwayisaah, who were the paternal uncles of 'Abdullah bin Sahl, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first.\" They said: \"O Messenger of Allah, we found 'Abdullah bin Sahl slain in one of the dry wells of Khaibar.\" The prophet said: \"Whom do you suspect? They said: \"We suspect the Jews.\" He said: \"Will you swear fifty oaths saying that the Jews killed him?\" They said: \"How can we swear an oath about something that we did not see?\" He said: \"Then can the Jews swear fifty oaths declaring that they did not kill him?\" They said:\"How can we accept their oaths, when they are Mushrikun?\" So the Messenger of Allah paid the blood money himself. (Sahih)Malik narrated this in Mursal from.",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-ibn-majah-1317",
      "hadith_no": "1317",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، حدثني يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات، عن سهل بن أبي حثمة، أنه قال في صلاة الخوف قال يقوم الإمام مستقبل القبلة وتقوم طائفة منهم معه وطائفة من قبل العدو ووجوههم إلى الصف فيركع بهم ركعة ويركعون لأنفسهم ويسجدون لأنفسهم سجدتين في مكانهم ثم يذهبون إلى مقام أولئك ويجيء أولئك فيركع بهم ركعة ويسجد بهم سجدتين فهي له ثنتان ولهم واحدة ثم يركعون ركعة واحدة ويسجدون سجدتين ‏.‏ قال محمد بن بشار فسألت يحيى بن سعيد القطان عن هذا الحديث فحدثني عن شعبة عن عبد الرحمن بن القاسم عن أبيه عن صالح بن خوات عن سهل بن أبي حثمة عن النبي  صلى الله عليه وسلم  بمثل حديث يحيى بن سعيد ‏.‏ قال قال لي يحيى اكتبه إلى جنبه ولست أحفظ الحديث ولكن مثل حديث يحيى ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Abu Hathmah that he said concerning thefearprayer:                      “The Imam should stand facing the Qiblah, and a group ofthem should stand with him, and another group should stand in thedirection of the enemy, facing towards the row (of worshippers). Heshould lead them in one Rak’ah, then they should bow and do twoprostrations by themselves where they are. Then they should go andtake the place of the others, and the others should come and pray oneRak’ah, bowing and prostrating with the leader. Then he will haveprayed two Rak’ah and they will have prayed one; then they shouldperform another Rak’ah, bowing and performing two prostrations.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11062",
        "10535",
        "11175",
        "1822"
      ]
    },
    {
      "id": "sunan-ibn-majah-1937",
      "hadith_no": "1937",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن حجاج، عن محمد بن سليمان، عن عمه، سهل بن أبي حثمة عن محمد بن مسلمة، قال خطبت امرأة فجعلت أتخبأ لها حتى نظرت إليها في نخل لها فقيل له أتفعل هذا وأنت صاحب رسول الله  صلى الله عليه وسلم  فقال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا ألقى الله في قلب امرئ خطبة امرأة فلا بأس أن ينظر إليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Muhammad bin Salamah said: “I proposed marriage to a woman, then I hid and waited to see her until I saw her among some date palm trees that belonged to her.” It was said to him: “Do you do such a thing when you are a companion of the Messenger of Allah?” He said: “I heard the Messenger of Allah saying: 'When Allah causes a man to propose to a woman, there is nothing wrong with him looking at her.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20317",
        "20219",
        "1822",
        "167"
      ]
    },
    {
      "id": "sunan-ibn-majah-2779",
      "hadith_no": "2779",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا بشر بن عمر، سمعت مالك بن أنس، حدثني أبو ليلى بن عبد الله بن عبد الرحمن بن سهل بن حنيف، عن سهل بن أبي حثمة، أنه أخبره عن رجال، من كبراء قومه أن عبد، الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وألقي في فقير أو عين بخيبر فأتى يهود فقال أنتم والله قتلتموه ‏.‏ قالوا والله ما قتلناه ‏.‏ ثم أقبل حتى قدم على قومه فذكر ذلك لهم ثم أقبل هو وأخوه حويصة وهو أكبر منه وعبد الرحمن بن سهل فذهب محيصة يتكلم وهو الذي كان بخيبر فقال رسول الله صلى الله عليه وسلم لمحيصة ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب رسول الله صلى الله عليه وسلم إليهم في ذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ تحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا بمسلمين فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم رسول الله صلى الله عليه وسلم مائة ناقة حتى أدخلت عليهم الدار فقال سهل فلقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " It was narrated from Sahl bin Abu Hathmah from the elders of his people that :                     'Abdullah bin Sahl and Muhayyishah set out for Khaibar because of some problem that had arisen. Someone came to Muhayyishah, and he told him that Abdullah bin Sahl had been killed and thrown into a pit or well in Khaibar. He came to the Jews and said: “By Allah, you killed him.” They said: “By Allah, we did not kill him.” Then he went back to his people and told them about that. Then he and his brother Huwayyisah, who was older than him, and 'Abdur-Rahman bin Sahl, came (to the Prophet (ﷺ)). Muhayyisah, who was the one who had been at Khaibar, went and he began to speak, but the Messenger of Allah (ﷺ) said: “Let the elder speak first.” So Huwayyisah spoke, then Muhayyisah spoke. The Messenger of Allah (ﷺ) said: “Either (the Jews) will pay the blood money for your companion, or war will be declared on them.” The Messenger of Allah (ﷺ) sent a letter to that effect (to the Jews) and they wrote back saying: “By Allah, we did not kill him.” The Messenger of Allah (ﷺ) said to Huwayyisah, Muhayyisah and Abdur-Rahman: “Will you swear an oath establishing your claim to the blood money of your companion?” They said: “No” He said: “Should the Jews swear an oath for you?” They said: “They are not Muslims.” So the Messenger of Allah (ﷺ) paid the blood money himself, and he sent one hundred she-camels to them and some of them entered the house. Sahl said: “A red she-camels from among them kicked me.”",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "20211",
        "20001",
        "1822"
      ]
    }
  ],
  "total_hadiths": 40
}