{
  "id": "18243",
  "name": "Khalid bin 'Alqama خالد بن علقمة",
  "full_name": "Khalid bin 'Alqama خالد بن علقمة",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19874",
      "name": "Abd Khayr bin Yazid al-Hamdani عبد خير بن يزيد الهمداني",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "111",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن خالد بن علقمة، عن عبد خير، قال أتانا علي - رضى الله عنه - وقد صلى فدعا بطهور فقلنا ما يصنع بالطهور وقد صلى ما يريد إلا أن يعلمنا فأتي بإناء فيه ماء وطست فأفرغ من الإناء على يمينه فغسل يديه ثلاثا ثم تمضمض واستنثر ثلاثا فمضمض ونثر من الكف الذي يأخذ فيه ثم غسل وجهه ثلاثا ثم غسل يده اليمنى ثلاثا وغسل يده الشمال ثلاثا ثم جعل يده في الإناء فمسح برأسه مرة واحدة ثم غسل رجله اليمنى ثلاثا ورجله الشمال ثلاثا ثم قال من سره أن يعلم وضوء رسول الله صلى الله عليه وسلم فهو هذا ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Abdu Khayr said: Ali came upon us and he had already offered prayer. He called for water. We asked: What will you do with water when you have already offered prayer? - Perhaps to teach us. A utensil containing water and a wash-basin were brought (to him). He poured water from the utensil on his right hand and washed both his hands three times, rinsed the mouth, snuffed up water and cleansed the nose three times. He then rinsed the mouth and snuffed up water with the same hand by which he took water. He then washed his face three times, and washed his right hand three times and washed his left hand three times. He then put his hand in water and wiped his head once. He then washed his right foot thrice and left foot thrice, then said: If one is pleased to know the method of performing ablution of the Messenger of Allah, this is how he did it.",
      "chain": [
        "30175",
        "20469",
        "18243",
        "19874",
        "5"
      ]
    },
    {
      "hadith_no": "112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا الحسين بن علي الجعفي، عن زائدة، حدثنا خالد بن علقمة الهمداني، عن عبد خير، قال صلى علي رضى الله عنه الغداة ثم دخل الرحبة فدعا بماء فأتاه الغلام بإناء فيه ماء وطست - قال - فأخذ الإناء بيده اليمنى فأفرغ على يده اليسرى وغسل كفيه ثلاثا ثم أدخل يده اليمنى في الإناء فتمضمض ثلاثا واستنشق ثلاثا ‏.‏ ثم ساق قريبا من حديث أبي عوانة قال ثم مسح رأسه مقدمه ومؤخره مرة ‏.‏ ثم ساق الحديث نحوه ‏.‏",
      "text_en": " ‘Abd Khair said :                      ‘All offered the dawn prayer and went to Rahbah (a locality in Kufah). He called for water. A boy brought him a vessel containing water and a wash-basin. He held the vessel with his right hand and poured water over his left hand. He washed both of his hands (to the wrist) three times. He then put his right hand in the vessel ( to take water) and rinsed his mouth three times and snuffed up water three times. He then narrated almost the same tradition as narrated by Abu ‘Awanah. He then wiped his head, both its front and back sides, once. He then narrated the tradition in like manner.",
      "chain": [
        "30115",
        "20315",
        "20320",
        "18243",
        "19874",
        "5"
      ]
    }
  ],
  "total_hadiths": 2
}