{
  "id": "18248",
  "name": "Khalid bin al-Lajlaj al-Amiri خالد بن اللجلاج العامري",
  "full_name": "Khalid bin al-Lajlaj al-Amiri خالد بن اللجلاج العامري",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ د  ت  س  -  أوثق الناس ]"
    ],
    "tags": [
      "al-'Amiri",
      "Client",
      "Ally B.Zuhrah",
      "Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "17050",
      "name": "al-'Ala' bin al-Ljlaj العلاء بن اللجلاج",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4435",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبدة بن عبد الله، ومحمد بن داود بن صبيح، قال عبدة أخبرنا حرمي بن حفص، قال حدثنا محمد بن عبد الله بن علاثة، حدثنا عبد العزيز بن عمر بن عبد العزيز، أن خالد بن اللجلاج، حدثه أن اللجلاج أباه أخبره أنه، كان قاعدا يعتمل في السوق فمرت امرأة تحمل صبيا فثار الناس معها وثرت فيمن ثار فانتهيت إلى النبي صلى الله عليه وسلم وهو يقول ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ فسكتت فقال شاب حذوها أنا أبوه يا رسول الله ‏.‏ فأقبل عليها فقال ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ قال الفتى أنا أبوه يا رسول الله ‏.‏ فنظر رسول الله صلى الله عليه وسلم إلى بعض من حوله يسألهم عنه فقالوا ما علمنا إلا خيرا ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أحصنت ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمر به فرجم ‏.‏ قال فخرجنا به فحفرنا له حتى أمكنا ثم رميناه بالحجارة حتى هدأ فجاء رجل يسأل عن المرجوم فانطلقنا به إلى النبي صلى الله عليه وسلم فقلنا هذا جاء يسأل عن الخبيث ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لهو أطيب عند الله من ريح المسك ‏\"‏ ‏.‏ فإذا هو أبوه فأعناه على غسله وتكفينه ودفنه وما أدري قال والصلاة عليه أم لا ‏.‏ وهذا حديث عبدة وهو أتم ‏.‏",
      "text_en": " Narrated Al-Lajlaj al-Amiri:                     I was working in the market. A woman passed carrying a child. The people rushed towards her, and I also rushed along with them.  I then went to the Prophet (ﷺ) while he was asking: Who is the father of this (child) who is with you? She remained silent.  A young man by her side said: I am his father, Messenger of Allah!  He then turned towards her and asked: Who is the father of this child with you?  The young man said: I am his father, Messenger of Allah! The Messenger of Allah (ﷺ) then looked at some of those who were around him and asked them about him. They said: We only know good (about him).  The Prophet (ﷺ) said to him: Are you married?  He said: Yes. So he gave orders regarding him and he was stoned to death.  He (the narrator) said: We took him out, dug a pit for him and put him in it. We then threw stones at him until he died. A man then came asking about the man who was stoned.  We brought him to the Prophet (ﷺ) and said: This man has come asking about the wicked man.  The Messenger of Allah (ﷺ) said: He is more agreeable than the fragrance of musk in the eyes of Allah. The man was his father. We then helped him in washing, shrouding and burying him. (The narrator said:) I do not know whether he said or did not say \"in praying over him.\" This is the tradition of Abdah, and it is more accurate.",
      "chain": [
        "30149",
        "20337",
        "30129",
        "28523",
        "20166",
        "18248"
      ]
    },
    {
      "hadith_no": "4436",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، ح وحدثنا نصر بن عاصم الأنطاكي، حدثنا الوليد، جميعا قالا حدثنا محمد، - قال هشام محمد بن عبد الله الشعيثي - عن مسلمة بن عبد الله الجهني، عن خالد بن اللجلاج، عن أبيه، عن النبي صلى الله عليه وسلم ببعض هذا الحديث ‏.‏",
      "text_en": " A part of tradition has also been transmitted by al-Lajlaj from the Prophet (ﷺ) through a different chain of narrators.",
      "chain": [
        "30288",
        "20398",
        "38662",
        "20733",
        "11035",
        "17541",
        "18248",
        "6444"
      ]
    },
    {
      "hadith_no": "3542",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي قلابة، عن خالد بن اللجلاج، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاني ربي في أحسن صورة فقال يا محمد قلت لبيك ربي وسعديك قال فيم يختصم الملأ الأعلى قلت ربي لا أدري فوضع يده بين كتفى فوجدت بردها بين ثديى فعلمت ما بين المشرق والمغرب قال يا محمد ‏.‏ فقلت لبيك رب وسعديك قال فيم يختصم الملأ الأعلى قلت في الدرجات والكفارات وفي نقل الأقدام إلى الجماعات وإسباغ الوضوء في المكروهات وانتظار الصلاة بعد الصلاة ومن يحافظ عليهن عاش بخير ومات بخير وكان من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏ قال وفي الباب عن معاذ بن جبل وعبد الرحمن بن عائش عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Prophet (ﷺ) said: \"My Lord, Blessed is He and Most High, came to me in the best of appearances. So he said: 'O Muhammad!' I said: 'Here I am O my Lord! And I am at Your service.' He said: 'What is it that the most exalted group busy themselves with?' I said: '[Lord] I do not know.' So He placed His Hand between my shoulders, until I sensed its coolness between my breast, so I knew what was in between the east and the west. He said: 'O Muhammad!' I said: 'Here I am O my Lord! And I am at Your service.' He said: 'What is it that the most exalted group busy themselves with?' I said: 'In the acts that raise ranks and the acts that atone, and in recording the footsteps to the congregation, Isbagh Al-Wudu in difficulties, and awaiting the Salat after the Salat. And whoever preserves them, he shall live in goodness and die upon goodness, and his sins shall be like that on the day upon which his mother bore him.'\"",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11047",
        "18248",
        "17"
      ]
    },
    {
      "hadith_no": "3111",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا حماد بن سلمة، عن سهيل بن أبي صالح، عن صفوان بن سليم، عن خالد بن اللجلاج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في وجه رجل أبدا ولا يجتمع الشح والإيمان في قلب عبد أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"The dust in the cause of Allah and the smoke of Hell will never be combined in a man's face, and stinginess and faith can never be combined in a slave's heart.\"",
      "chain": [
        "30153",
        "20033",
        "20021",
        "11173",
        "11177",
        "18248",
        "13"
      ]
    }
  ],
  "total_hadiths": 4
}