{
  "id": "18261",
  "name": "Khlyfh bin Husayn bin Qays خليفة بن حصين بن قيس",
  "full_name": "Khlyfh bin Husayn bin Qays خليفة بن حصين بن قيس",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-MunQari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5242",
      "name": "Qays bin 'Asim bin Snan ( قيس بن عاصم بن سنان بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "15022",
      "name": "al-Aghr bin al-Sbah al-Tmymy الأغر بن الصباح التميمي المنقري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "355",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير العبدي، أخبرنا سفيان، حدثنا الأغر، عن خليفة بن حصين، عن جده، قيس بن عاصم قال أتيت النبي صلى الله عليه وسلم أريد الإسلام فأمرني أن أغتسل بماء وسدر ‏.‏",
      "text_en": " Narrated Qays ibn Asim:                     I came to the Prophet (ﷺ) with the intention of embracing Islam. He commanded me to take a bath with water (boiled with) the leaves of the lote-tree.",
      "chain": [
        "30169",
        "20012",
        "15022",
        "18261",
        "5242"
      ]
    },
    {
      "hadith_no": "605",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن الأغر بن الصباح، عن خليفة بن حصين، عن قيس بن عاصم، أنه أسلم فأمره النبي صلى الله عليه وسلم أن يغتسل بماء وسدر ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من هذا الوجه ‏.‏ والعمل عليه عند أهل العلم يستحبون للرجل إذا أسلم أن يغتسل ويغسل ثيابه ‏.‏",
      "text_en": " Qais bin Asim narrated that:                     he accepted Islam and the Prophet ordered him to perform Ghusl with water and Sidr.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "15022",
        "18261",
        "5242"
      ]
    },
    {
      "hadith_no": "3623",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا محمد بن يوسف الفريابي، حدثنا قيس بن الربيع، عن الأغر بن الصباح، عن خليفة بن حصين، عن أبي نصر، عن ابن عباس، في قوله تعالى ‏:‏ ‏(‏ إذا جاءكم المؤمنات مهاجرات فامتحنوهن ‏)‏ قال كانت المرأة إذا جاءت النبي صلى الله عليه وسلم لتسلم حلفها بالله ما خرجت من بغض زوجي ما خرجت إلا حبا لله ولرسوله ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " [Abu An-Nasr narrated :                     from Ibn Abbas, regarding the saying of Allah, the Most High: When believing women come to you as emigrants, examine them. He said: “When a woman come to the Prophet to accept Islam, she would have to take and an oath by Allah: ‘I have not left out of anger with my husband, I have not left except out of love for Allah and His Messenger.’”]",
      "chain": [
        "30417",
        "20034",
        "25246",
        "15022",
        "18261"
      ]
    },
    {
      "hadith_no": "3520",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا علي بن ثابت، حدثني قيس بن الربيع، وكان، من بني أسد عن الأغر بن الصباح، عن خليفة بن حصين، عن علي بن أبي طالب، قال أكثر ما دعا به رسول الله صلى الله عليه وسلم عشية عرفة في الموقف ‏\"‏ اللهم لك الحمد كالذي نقول وخيرا مما نقول اللهم لك صلاتي ونسكي ومحياى ومماتي وإليك مآبي ولك رب تراثي اللهم إني أعوذ بك من عذاب القبر ووسوسة الصدر وشتات الأمر اللهم إني أعوذ بك من شر ما تجيء به الريح ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Ali bin Abi Talib said:                     “The most of what the Messenger of Allah supplicated with during the afternoon at Arafat while standing was: ‘O Allah to You is the praise like the one You say, and better than what we say. O Allah, for You is all my Salat, my sacrifice, my living and my dying. And to You is my return, and to You, my Lord, belongs my inheritance. O Allah, indeed, I seek refuge in You from the punishment of the grave, the whispering of the chest, and the diving of the affair. O Allah, indeed, I seek refuge in You from the evil of what the wing brings (Allahumma Lakal-Hamdu, Kalladhi Taqulu, Wa  Khairan Mimma Naqul. Allahumma Laka Salati Wa Nusuki, Wa Mahyaya Wa Mamati, Ilaika Mabi, Wa Laka, Rabbi, Turath. Allahumma Inni A’udhu Bika Min Adhabil-Qabri, Wa Waswasatis-Sadri, WA Shatatil-Amr. Allahumma Inni A’udhu Bika Min Sharri Ma Taji’u Bihir-Rih).”",
      "chain": [
        "38487",
        "28408",
        "25246",
        "15022",
        "18261",
        "5"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، عن الأغر، - وهو ابن الصباح - عن خليفة بن حصين، عن قيس بن عاصم، أنه أسلم فأمره النبي صلى الله عليه وسلم أن يغتسل بماء وسدر ‏.‏",
      "text_en": " It was narrated from Qais bin 'Asim that he accepted Islam, and the Prophet commanded him to perform Ghusl with water and lotus leaves.",
      "chain": [
        "30153",
        "20031",
        "20012",
        "15022",
        "18261",
        "5242"
      ]
    }
  ],
  "total_hadiths": 5
}