{
  "id": "18277",
  "name": "Rabi'ya bin Syf bin Mat' ربيعة بن سيف بن ماتع",
  "full_name": "Rabi'ya bin Syf bin Mat' ربيعة بن سيف بن ماتع",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Alexandria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Ma'fari",
      "Alexandria"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1935",
      "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18421",
      "name": "Shfa bin Mat' شفي بن ماتع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16006",
      "name": "Tabi' bin 'Amir تبيع بن عامر",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10938",
      "name": "Abu 'Abdur Rahman al-Habli عبد الله بن يزيد أبو عبد الرحمن الحبلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20629",
      "name": "Nafi' bin Yazid al-Kula'i نافع بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20378",
      "name": "al-Mufadl bin Fadala bin 'Ubaid المفضل بن فضالة بن عبيد بن ثمامة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26017",
      "name": "Dmam bin Isma'il bin Malik ضمام بن إسماعيل بن مالك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3123",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا المفضل، عن ربيعة بن سيف المعافري، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، قال قبرنا مع رسول الله صلى الله عليه وسلم - يعني ميتا - فلما فرغنا انصرف رسول الله صلى الله عليه وسلم وانصرفنا معه فلما حاذى بابه وقف فإذا نحن بامرأة مقبلة - قال أظنه عرفها - فلما ذهبت إذا هي فاطمة - عليها السلام - فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ ما أخرجك يا فاطمة من بيتك ‏\"‏ ‏.‏ فقالت أتيت يا رسول الله أهل هذا البيت فرحمت إليهم ميتهم أو عزيتهم به ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ فلعلك بلغت معهم الكدى ‏\"‏ ‏.‏ قالت معاذ الله وقد سمعتك تذكر فيها ما تذكر ‏.‏ قال ‏\"‏ لو بلغت معهم الكدى ‏\"‏ ‏.‏ فذكر تشديدا في ذلك فسألت ربيعة عن الكدى فقال القبور فيما أحسب ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     We buried a deceased person in the company of the Messenger of Allah (ﷺ). When we had finished, the Messenger of Allah (ﷺ) returned and we also returned with him. When he approached his door, he stopped, and we saw a woman coming towards him.  He (the narrator) said: I think he recognized her. When she went away, we came to know that she was Fatimah.  The Messenger of Allah (ﷺ) said to her: What brought you out of your house, Fatimah?  She replied: I came to the people of this house, Messenger of Allah, and I showed pity and expressed my condolences to them for their deceased relation.  The Messenger of Allah (ﷺ) said: You might have gone to the graveyard with them.  She replied: I seek refuge in Allah! I heard you referring to what you mentioned.  He said: If you had gone to the graveyard...He then mentioned severe words about it.  I then asked Rabi'ah (a narrator of this tradition) about al-kuda (stony land). He replied: I think it means the graves.",
      "chain": [
        "38715",
        "18277",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، وأبو عامر العقدي قالا حدثنا هشام بن سعد، عن سعيد بن أبي هلال، عن ربيعة بن سيف، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلم يموت يوم الجمعة أو ليلة الجمعة إلا وقاه الله فتنة القبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل ‏.‏ ربيعة بن سيف إنما يروي عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو ولا نعرف لربيعة بن سيف سماعا من عبد الله بن عمرو ‏.‏",
      "text_en": " Abdullah bin Amr narrated that:                     The Messenger of Allah said: \"No Muslim dies on the day of Friday, nor the night of Friday, except that Allah protects him from the trials of the grave.\"",
      "chain": [
        "30160",
        "20033",
        "20443",
        "20519",
        "11169",
        "18277",
        "29"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن فضالة بن إبراهيم، قال حدثنا عبد الله، هو ابن يزيد المقرئ ح وأنبأنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا أبي قال، سعيد حدثني ربيعة بن سيف المعافري، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، قال بينما نحن نسير مع رسول الله صلى الله عليه وسلم إذ بصر بامرأة لا تظن أنه عرفها فلما توسط الطريق وقف حتى انتهت إليه فإذا فاطمة بنت رسول الله صلى الله عليه وسلم قال لها ‏\"‏ ما أخرجك من بيتك يا فاطمة ‏\"‏ ‏.‏ قالت أتيت أهل هذا الميت فترحمت إليهم وعزيتهم بميتهم ‏.‏ قال ‏\"‏ لعلك بلغت معهم الكدى ‏\"‏ ‏.‏ قالت معاذ الله أن أكون بلغتها وقد سمعتك تذكر في ذلك ما تذكر ‏.‏ فقال لها ‏\"‏ لو بلغتها معهم ما رأيت الجنة حتى يراها جد أبيك ‏\"‏ ‏.‏ قال أبو عبد الرحمن ربيعة ضعيف ‏.‏",
      "text_en": " Rabiah bin Saif Al-Mu'afiri narrated from Abu 'Abdur-Rahman Al-Hubuli, from 'Abdullah bin 'Amr, who said:                     \"while we were traveling with the Messenger of Allah, he saw a woman, and did not think that he knew her. When she was halfway to him, he stopped until she reached him, and it was Fatimah, the daughter of the Messenger of Allah. He said to her: 'What brought you out of your house, O Fatimah?' She said: 'I came to the people of this deceased one to pray for mercy for them, and to offer my condolences to them.' He said: 'Perhaps you went with them to Al-Kuda?\" She said: 'Allah forbid that I should go there. I heard what you said about that.' He said: If you had gone there with them, you would never have seen Paradise until the grandfather of your father saw it.\"'",
      "chain": [
        "23033",
        "11168",
        "18277",
        "10938",
        "29"
      ]
    }
  ],
  "total_hadiths": 3
}