{
  "id": "1830",
  "name": "Mahmud bin Labid bin 'Uqba ( محمود بن لبيد بن عقبة بن رافع ( رضي الله عنه",
  "full_name": "Mahmud bin Labid bin 'Uqba ( محمود بن لبيد بن عقبة بن رافع ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "97",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  4  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Abdul Ashhal",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "1832",
      "name": "Labid bin 'Uqba ( لبيد بن عقبة بن رافع بن امرئ القيس ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1951",
      "name": "Umm Manzur bint Mahmud bin Maslama ( أم منظور بنت محمود بن سلمة الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "1831",
      "name": "Manzur bin Labid bin 'Uqba ( منظور بن لبيد بن عقبة بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "389",
      "name": "Shadad bin Aus bin Thabit ( شداد بن أوس بن ثابت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "233",
      "name": "Qatada ibn al-Nu'man ( ذو العينين , قتادة بن النعمان بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1805",
      "name": "Salama bin Salaama bin Waqash ( سلمة بن سلامة بن وقش الأشهلي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12203",
      "name": "'Abdullah bin Abi Umama bin Tha'laba عبد الله بن أبي أمامة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "3172",
      "name": "Rafayda al-Aslamiyya ( رفيدة امرأة من أسلم ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11103",
      "name": "Asim bin 'Umar bin Qatada al-Ansari عاصم بن عمر بن قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11833",
      "name": "Ja'far bin 'Abdullah جعفر بن عبد الله بن الحكم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11154",
      "name": "Bukayr bin 'Abdullah bin al-Ashj بكير بن عبد الله بن الأشج",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، - واللفظ لابن المثنى - قالا حدثنا الضحاك بن مخلد، أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك فأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
      "text_en": " Mahmud b. Labid reported:                      When 'Uthman b. 'Affan intended to build the mosque (of the Prophet) the people did not approve of it. They liked that it should be kept in the same state. Thereupon he said: I heard the Messenger of Allah (may peace be upon him) say: He who built a mosque for Allah, Allah would build a house for him like it in Paradise.",
      "chain": [
        "30022",
        "30170",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "7662",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، كلاهما عن الضحاك، - قال ابن المثنى حدثنا الضحاك بن مخلد، - أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك وأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
      "text_en": " Mahmud b. Labid reported that 'Uthman b. 'Affan decided to rebuild the mosque (of Allah's Apostle in Medina) but the people did not like this idea and they wished that it should be preserved in the same (old) form. Thereupon he (Hadrat 'Uthman) said:                      I heard Allah's Messenger (may peace be upon him) as saying: He who builds a mosque for Allah, Allah would build for him (a house) in Paradise like it.",
      "chain": [
        "30022",
        "30170",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن عجلان، عن عاصم بن عمر بن قتادة بن النعمان، عن محمود بن لبيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أصبحوا بالصبح فإنه أعظم لأجوركم ‏\"‏ ‏.‏ أو ‏\"‏ أعظم للأجر ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported the Messenger of Allah (ﷺ) as saying:                      Offer Fajr prayer at dawn, for it is most productive of rewards to you or most productive of reward.",
      "chain": [
        "20012",
        "10616",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "1673",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن جابر بن عبد الله الأنصاري، قال كنا عند رسول الله صلى الله عليه وسلم إذ جاء رجل بمثل بيضة من ذهب فقال يا رسول الله أصبت هذه من معدن فخذها فهي صدقة ما أملك غيرها ‏.‏ فأعرض عنه رسول الله صلى الله عليه وسلم ثم أتاه من قبل ركنه الأيمن فقال مثل ذلك فأعرض عنه ثم أتاه من قبل ركنه الأيسر فأعرض عنه رسول الله صلى الله عليه وسلم ثم أتاه من خلفه فأخذها رسول الله صلى الله عليه وسلم فحذفه بها فلو أصابته لأوجعته أو لعقرته فقال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي أحدكم بما يملك فيقول هذه صدقة ثم يقعد يستكف الناس خير الصدقة ما كان عن ظهر غنى ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah Al-Ansari:                     While we were sitting with the Messenger of Allah (ﷺ) a man brought him some gold equal in weight to an egg, and said: Messenger of Allah, I have got this from a mine; take it; it is sadaqah. I have no more than this. The Messenger of Allah (ﷺ) turned his attention from him. Then he came to him from his right side and repeated the same words. But he (the Prophet) turned his attention from him. He then came to him from his left side and repeated the same words. But he (again) turned his attention from him. He then came to him from behind. The Messenger of Allah (ﷺ) took it and threw it away. Had it hit him, it would have hurt him or wounded him. The Messenger of Allah (ﷺ) said: One of you brings all that he possesses and says: This is sadaqah. Then he sits down and spreads his hand before the people. The best sadaqah is that which leaves a competence.",
      "chain": [
        "20040",
        "20022",
        "11107",
        "11103",
        "1830",
        "34"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم الأسباطي، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     I heard the Messenger of Allah (ﷺ) say: The official who collects sadaqah (zakat) in a just manner is like him who fights in Allah's path till he returns home.",
      "chain": [
        "11213",
        "20334",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة، - هو ابن سليمان - عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسفروا بالفجر فإنه أعظم للأجر ‏\"‏ ‏.‏ قال وقد روى شعبة والثوري هذا الحديث عن محمد بن إسحاق ‏.‏ قال ورواه محمد بن عجلان أيضا عن عاصم بن عمر بن قتادة ‏.‏ قال وفي الباب عن أبي برزة الأسلمي وجابر وبلال ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ وقد رأى غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين الإسفار بصلاة الفجر ‏.‏ وبه يقول سفيان الثوري ‏.‏ وقال الشافعي وأحمد وإسحاق معنى الإسفار أن يضح الفجر فلا يشك فيه ولم يروا أن معنى الإسفار تأخير الصلاة ‏.‏",
      "text_en": " Rafi bin Khadlj said:                     \"I heard Allah's Messenger saying: 'Perform Fajr at AI-Isfar, for indeed its reward is greater.'\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أبي بكر وعمر وعلي وعبد الله بن عمرو وأنس وابن عباس وعائشة وأم حبيبة وأبي ذر وعمرو بن عبسة وواثلة بن الأسقع وأبي هريرة وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث عثمان حديث حسن صحيح ‏.‏ ومحمود بن لبيد قد أدرك النبي صلى الله عليه وسلم ومحمود بن الربيع قد رأى النبي صلى الله عليه وسلم وهما غلامان صغيران مدنيان ‏.‏",
      "text_en": " Uthman bin Affan narrated that :                     he heard Allah's Messenger say: \"Whoever builds a Masjid for (the sake of) Allah, then Allah will build a similar house for him in Paradise.\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا يزيد بن عياض، عن عاصم بن عمر بن قتادة، ح وحدثنا محمد بن إسماعيل، قال حدثنا أحمد بن خالد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ ويزيد بن عياض ضعيف عند أهل الحديث ‏.‏ وحديث محمد بن إسحاق أصح ‏.‏",
      "text_en": " Rafi bin Khadij narrated:                     \"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"",
      "chain": [
        "30242",
        "20472",
        "12592",
        "11103",
        "34188",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا إسحاق بن محمد الفروي، حدثنا إسماعيل بن جعفر، عن عمارة بن غزية، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن قتادة بن النعمان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أحب الله عبدا حماه الدنيا كما يظل أحدكم يحمي سقيمه الماء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن صهيب وأم المنذر ‏.‏ وهذا حديث حسن غريب ‏.‏ وقد روي هذا الحديث عن محمود بن لبيد عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Qatadah bin An-Nu'man narrated that the Messenger of Allah (s.a.w) said:                     \"When Allah loves a slave, He prevents him from the world, just as one of you prevents his sick from water.\"",
      "chain": [
        "11222",
        "20155",
        "11894",
        "11103",
        "1830",
        "233"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عن قتادة بن النعمان ‏.‏ قال أبو عيسى وقتادة بن النعمان الظفري هو أخو أبي سعيد الخدري لأمه ومحمود بن لبيد قد أدرك النبي صلى الله عليه وسلم ورآه وهو غلام صغير ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20155",
        "11209",
        "11103",
        "1830"
      ]
    },
    {
      "hadith_no": "553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن عجلان، قال حدثني عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أسفروا بالفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that the Prophet (ﷺ) said:                      \"Pray Fajr when the dawn shines.\"",
      "chain": [
        "30359",
        "20031",
        "10616",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "554",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال أخبرنا أبو غسان، قال حدثني زيد بن أسلم، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رجال، من قومه من الأنصار أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أسفرتم بالفجر فإنه أعظم بالأجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mahmud bin Labid, from some men among his people who were of the Ansar, that the Messenger of Allah (ﷺ) said:                      \"The more you delay Fajr, the greater the reward.\"",
      "chain": [
        "38088",
        "30232",
        "20179",
        "11163",
        "11103",
        "1830"
      ]
    },
    {
      "hadith_no": "3401",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني مخرمة، عن أبيه، قال سمعت محمود بن لبيد، قال أخبر رسول الله صلى الله عليه وسلم عن رجل، طلق امرأته ثلاث تطليقات جميعا فقام غضبانا ثم قال ‏\"‏ أيلعب بكتاب الله وأنا بين أظهركم ‏\"‏ ‏.‏ حتى قام رجل وقال يا رسول الله ألا أقتله ‏.‏",
      "text_en": " Makhramah narrated that his father said:                      \"I heard Mahmud bin Labid say: 'The Messenger of Allah was told about a man who had divorced his wife with three simultaneous divorces. He stood up angrily and said: Is the Book of Allah being toyed with while I am still among you? Then a man stood up and said: 'O Messenger of Allah, shall I kill him?'\"",
      "chain": [
        "30584",
        "20029",
        "1830"
      ]
    },
    {
      "hadith_no": "672",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن ابن عجلان، سمع عاصم بن عمر بن قتادة، - وجده بدري - يخبر عن محمود بن لبيد، عن رافع بن خديج، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ أصبحوا بالصبح فإنه أعظم للأجر أو لأجركم ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that:                     The Prophet said: \"Pray the Subh early, for indeed its reward is greater\" or \"your reward.\"",
      "chain": [
        "30269",
        "20005",
        "10616",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "736",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah say: 'Whoever builds a mosque for the sake of Allah, Allah will build something similar for him in Paradise.'\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "1220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال أتانا رسول الله  صلى الله عليه وسلم  في بني عبد الأشهل فصلى بنا المغرب في مسجدنا ثم قال ‏\"‏ اركعوا هاتين الركعتين في بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We came to the MessengerofAllah (ﷺ) with Banu ‘Abdul-Ashhal, and he led us in praying theMaghrib in our mosque. Then he said: ‘Pray these two Rak’ah inyourhouses.’”",
      "chain": [
        "38361",
        "20736",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "1522",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو داود، سليمان بن توبة حدثنا عاصم بن علي، حدثنا قزعة بن سويد، عن حميد الأعرج، عن الزهري، عن محمود بن لبيد، عن شداد بن أوس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا حضرتم موتاكم فأغمضوا البصر فإن البصر يتبع الروح وقولوا خيرا فإن الملائكة تؤمن على ما قال أهل البيت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Shaddad bin Aws that the Messenger of Allah(ﷺ) said:                     “When you come to your dead ones, close their eyes, forthe sightfollows the soul. And say good things, for the Angels sayAmin towhat the members of the household say.”",
      "chain": [
        "20430",
        "24377",
        "11013",
        "1830",
        "389"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، ومحمد بن فضيل، ويونس بن بكير، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Rafi bin Khadij said: “I heard the Messenger of Allah say: 'The person who is appointed to collect the Sadaqah - who does so with sincerity and fairness is like one who foes out to fight for the sake of Allah, until he returns to the house.' ”",
      "chain": [
        "30216",
        "20337",
        "20356",
        "20118",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "4217",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن محمد بن إسحاق، حدثني عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تفتح يأجوج ومأجوج فيخرجون كما قال الله تعالى ‏{وهم من كل حدب ينسلون}‏ فيعمون الأرض وينحاز منهم المسلمون حتى تصير بقية المسلمين في مدائنهم وحصونهم ويضمون إليهم مواشيهم حتى أنهم ليمرون بالنهر فيشربونه حتى ما يذرون فيه شيئا فيمر آخرهم على أثرهم فيقول قائلهم لقد كان بهذا المكان مرة ماء ويظهرون على الأرض فيقول قائلهم هؤلاء أهل الأرض قد فرغنا منهم ولننازلن أهل السماء حتى إن أحدهم ليهز حربته إلى السماء فترجع مخضبة بالدم فيقولون قد قتلنا أهل السماء ‏.‏ فبينما هم كذلك إذ بعث الله دواب كنغف الجراد فتأخذ بأعناقهم فيموتون موت الجراد يركب بعضهم بعضا فيصبح المسلمون لا يسمعون لهم حسا فيقولون من رجل يشري نفسه وينظر ما فعلوا فينزل منهم رجل قد وطن نفسه على أن يقتلوه فيجدهم موتى فيناديهم ألا أبشروا فقد هلك عدوكم ‏.‏ فيخرج الناس ويخلون سبيل مواشيهم فما يكون لهم رعى إلا لحومهم فتشكر عليها كأحسن ما شكرت من نبات أصابته قط ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger ofAllah(ﷺ) said:                      \"Gog and Magog people will be set free and they willemerge as Allah says: \"swoop(ing) down from every mound.\"[21:96]Theywill spread throughout the earth, and the Muslims will flee fromthemuntil the remainder of the Muslims are in their cities andfortresses,taking their flocks with them. They will pass by a riverand drinkfrom it, until they leave nothing behind, and the last ofthem willfollow in their footsteps and one of them will say: 'Therewas oncewater in this place.' They will prevail over the earth, thentheirleader will say: 'These are the people of the earth, and wehavefinished them off. Now let us fight the people of heaven!' Thenoneof them will throw his spear towards the sky, and it will comebackdown smeared with blood. And they will say: 'We have killed thepeople of heaven.' While they are like that, Allah will send a wormlike the worm that is found in the noses of sheep, which willpenetrate their necks and they will die like locusts, one on top ofanother. In the morning the Muslims will not hear any sound fromthem,and they will say: 'Who will sell his soul for the sake ofAllah andsee what they are doing?' A man will go down, havingprepared himselfto be killed by them, and he will find them dead, sohe will call outto them: 'Be of good cheer, for your enemy is dead!'Then the peoplewill come out and let their flocks loose, but theywill not haveanything to graze on except their flesh, and they willbecome very fatas if they were grazing on the best vegetation theyever found.'\"",
      "chain": [
        "30216",
        "20118",
        "11107",
        "11103",
        "1830",
        "38"
      ]
    }
  ],
  "total_hadiths": 19
}