{
  "id": "18312",
  "name": "Ziyad bin Abi Swd'h زياد بن أبي سودة",
  "full_name": "Ziyad bin Abi Swd'h زياد بن أبي سودة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ق  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3080",
      "name": "Maymuna bint Sa'd/Sa'id ( ميمونة بنت سعد/سعيد مولاة رسول الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27430",
      "name": "Sdqh bin Yazid Sm' bint صدقة بن يزيد",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-457",
      "hadith_no": "457",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن سعيد بن عبد العزيز، عن زياد بن أبي سودة، عن ميمونة، مولاة النبي صلى الله عليه وسلم أنها قالت يا رسول الله أفتنا في بيت المقدس فقال ‏\"‏ ائتوه فصلوا فيه ‏\"‏ ‏.‏ - وكانت البلاد إذ ذاك حربا - فإن لم تأتوه وتصلوا فيه فابعثوا بزيت يسرج في قناديله ‏\"‏ ‏.‏",
      "text_en": " Narrated Maymunah ibn Sa'd:                     I said: Messenger of Allah, tell us the legal injunction about (visiting) Bayt al-Muqaddas (the dome of the Rock at Jerusalem). The Messenger of Allah (ﷺ) said: go and pray there. All the cities at that time were effected by war. If you cannot visit it and pray there, then send some oil to be used in the lamps.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20463",
        "20638",
        "18312"
      ]
    },
    {
      "id": "sunan-ibn-majah-1472",
      "hadith_no": "1472",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن عبد الله الرقي، حدثنا عيسى بن يونس، حدثنا ثور بن يزيد، عن زياد بن أبي سودة، عن أخيه، عثمان بن أبي سودة عن ميمونة، مولاة النبي  صلى الله عليه وسلم  قالت قلت يا رسول الله أفتنا في بيت المقدس ‏.‏ قال ‏\"‏ أرض المحشر والمنشر ائتوه فصلوا فيه فإن صلاة فيه كألف صلاة في غيره ‏\"‏ ‏.‏ قلت أرأيت إن لم أستطع أن أتحمل إليه قال ‏\"‏ فتهدي له زيتا يسرج فيه فمن فعل ذلك فهو كمن أتاه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Maimunah the freed (female) slave of the Prophet(ﷺ)said:                      I said: “O Messenger of Allah, tell us about Baitil-Maqdis.”He said: “It is the land of the Resurrection and theGathering. Goand pray there, for one prayer there is like onethousand prayerselsewhere.” I said: “What if I cannot travel and gothere?” Hesaid: “Then send a gift of oil to light its lamps, forwhoever doesthat is like one who goes there.”",
      "usc_msa_ref": "",
      "chain": [
        "38111",
        "20347",
        "20415",
        "18312"
      ]
    }
  ],
  "total_hadiths": 2
}