{
  "id": "18336",
  "name": "al-Sa'ib bin Hbysh السائب بن حبيش",
  "full_name": "al-Sa'ib bin Hbysh السائب بن حبيش",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  -  مقبول ]"
    ],
    "tags": [
      "al-Kula'i",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10878",
      "name": "Ma'dan bin Abi Talha معدان بن أبي طلحة ويقال بن طلحة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-547",
      "hadith_no": "547",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، حدثنا السائب بن حبيش، عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليك بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال زائدة قال السائب يعني بالجماعة الصلاة في الجماعة ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If there are three men in a village or in the desert among whom prayer is not offered (in congregation), the devil has got the mastery over them. So observe (prayer) in congregation), for the wolf eats only the straggling animal. Sa'ib said: By the word Jama'ah he meant saying prayer in company or in congregation.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20320",
        "18336",
        "10878",
        "37"
      ]
    },
    {
      "id": "sunan-an-nasai-847",
      "hadith_no": "847",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة بن قدامة، قال حدثنا السائب بن حبيش الكلاعي، عن معدان بن أبي طلحة اليعمري، قال قال لي أبو الدرداء أين مسكنك قلت في قرية دوين حمص ‏.‏ فقال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليكم بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال السائب يعني بالجماعة الجماعة في الصلاة ‏.‏",
      "text_en": " It was narrated that Ma'din bin Abi Talhah Al-Ya'muri said:                      \"Abu Ad-Darda said to me: 'Where do you live?' I said: 'In a town near Hims.' Abu Ad-Darda said: 'I heard the Messenger of Allah (ﷺ) say: \"There are no three people in a town or encampment among whom prayer is not established, but the Shaitan takes control of them. Therefore, stick to the congregation, for the wolf eats the sheep that strays off on its own.\" (One of the narrators (As Sa'ib) said: \"The congregation means the congregational prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20320",
        "18336",
        "10878"
      ]
    }
  ],
  "total_hadiths": 2
}