{
  "id": "18344",
  "name": "Sa'd Clinet Of Talha سعد أو سعيد مولى طلحة",
  "full_name": "Sa'd Clinet Of Talha سعد أو سعيد مولى طلحة",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ ت  -  مجهول ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "15287",
      "name": "'Abdullah bin 'Abdullah al-Razi عبد الله بن عبد الله أبو جعفر الرازي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2684",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي، حدثنا أبي، حدثنا الأعمش، عن عبد الله بن عبد الله الرازي، عن سعد، مولى طلحة عن ابن عمر، قال سمعت النبي صلى الله عليه وسلم يحدث حديثا لو لم أسمعه إلا مرة أو مرتين حتى عد سبع مرات ولكني سمعته أكثر من ذلك سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كان الكفل من بني إسرائيل لا يتورع من ذنب عمله فأتته امرأة فأعطاها ستين دينارا على أن يطأها فلما قعد منها مقعد الرجل من امرأته أرعدت وبكت فقال ما يبكيك أأكرهتك قالت لا ولكنه عمل ما عملته قط وما حملني عليه إلا الحاجة فقال تفعلين أنت هذا وما فعلته اذهبي فهي لك ‏.‏ وقال لا والله لا أعصي الله بعدها أبدا ‏.‏ فمات من ليلته فأصبح مكتوبا على بابه إن الله قد غفر للكفل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ قد رواه شيبان وغير واحد عن الأعمش نحو هذا ورفعوه وروى بعضهم عن الأعمش فلم يرفعه ‏.‏ وروى أبو بكر بن عياش هذا الحديث عن الأعمش فأخطأ فيه وقال عن عبد الله بن عبد الله عن سعيد بن جبير عن ابن عمر وهو غير محفوظ وعبد الله بن عبد الله الرازي هو كوفي وكانت جدته سرية لعلي بن أبي طالب وروى عن عبد الله بن عبد الله الرازي عبيدة الضبي والحجاج بن أرطاة وغير واحد من كبار أهل العلم ‏.‏",
      "text_en": " Ibn 'Umar said:                     \"I heard the Prophet (s.a.w)  narrating a hadith, not just once or twice, even seven times, but I heard him saying it more than that. I heard him saying: 'There was a man called Al-Kifl among the children of Isra'il who did not restrain himself from committing sins. A woman came to him and he gave her sixty Dinar so he could sleep with her. When he sat up from her, as a man sits up from a woman, she began to tremble and cry, so he said: \"Why are you crying, did I do something to harm you?\" She said: \"No. But it is because of what I did, I only did so out of need.\" He said: \"You did this without having done (it before), so leave me, and it (the money) is for you.\" And then he said: \"By Allah! I will never disobey Allah after that.\" He died during the night and morning came with: \" Indeed Allah has forgiven Al-Kifl\" written upon his door.\"",
      "chain": [
        "11060",
        "15287",
        "18344",
        "18"
      ]
    }
  ],
  "total_hadiths": 1
}