{
  "id": "18383",
  "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان الهاشمي",
  "full_name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان الهاشمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ت  -  مقبول ]"
    ],
    "tags": [
      "B.Hashim",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11441",
      "name": "al-'Awwam bin Hushab العوام بن حوشب بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2037",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، حدثنا جرير، - يعني ابن حازم - حدثني يعلى بن حكيم، عن سليمان بن أبي عبد الله، قال رأيت سعد بن أبي وقاص أخذ رجلا يصيد في حرم المدينة الذي حرم رسول الله صلى الله عليه وسلم فسلبه ثيابه فجاء مواليه فكلموه فيه فقال إن رسول الله صلى الله عليه وسلم حرم هذا الحرم وقال ‏\"‏ من وجد أحدا يصيد فيه فليسلبه ثيابه ‏\"‏ ‏.‏ فلا أرد عليكم طعمة أطعمنيها رسول الله صلى الله عليه وسلم ولكن إن شئتم دفعت إليكم ثمنه ‏.‏",
      "text_en": " Narrated Sulayman ibn AbuAbdullah:                     Sulayman ibn AbuAbdullah said: I saw Sa'd ibn AbuWaqqas seized a man hunting in the sacred territory of Medina which the Messenger of Allah (ﷺ) had declared to be sacred. He took away his clothes from him.  His patrons came to him and spoke to him about it, but he replied: The Messenger of Allah (ﷺ) declared this territory to be sacred, saying: If anyone catches someone hunting in it he should take away from him his clothes. So I shall not return to you a provision which the Messenger of Allah (ﷺ) has given me, but if you wish I shall pay you its price.",
      "chain": [
        "10567",
        "11272",
        "11567",
        "18383"
      ]
    },
    {
      "hadith_no": "1417",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا سفيان بن عيينة، حدثنا سليمان بن أبي مسلم الأحول، خال ابن أبي نجيح سمع طاوسا، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  إذا قام من الليل للتهجد ‏.‏ فذكر نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30357",
        "20005",
        "18383",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2191",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان بن عيينة، عن سليمان بن أبي المغيرة، عن سعيد بن جبير، عن ابن عباس، قال كان الرجل يقوت أهله قوتا فيه سعة وكان الرجل يقوت أهله قوتا فيه شدة فنزلت ‏{من أوسط ما تطعمون أهليكم}‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A man would give his family food that was abundant and another would give his family food that was barely sufficient, then the following was revealed: 'With the Awsat of that with which you feed your families...’”(2)",
      "chain": [
        "11222",
        "20033",
        "20005",
        "18383",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}