{
  "id": "18392",
  "name": "Suliaman al-Mnbhy سليمان المنبهي",
  "full_name": "Suliaman al-Mnbhy سليمان المنبهي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  فق  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "17018",
      "name": "Hameed al-Shamy al-Hmsy حميد الشامي الحمصي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4213",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث بن سعيد، عن محمد بن جحادة، عن حميد الشامي، عن سليمان المنبهي، عن ثوبان، مولى رسول الله صلى الله عليه وسلم قال كان رسول الله صلى الله عليه وسلم إذا سافر كان آخر عهده بإنسان من أهله فاطمة وأول من يدخل عليها إذا قدم فاطمة فقدم من غزاة له وقد علقت مسحا أو سترا على بابها وحلت الحسن والحسين قلبين من فضة فقدم فلم يدخل فظنت أن ما منعه أن يدخل ما رأى فهتكت الستر وفككت القلبين عن الصبيين وقطعته بينهما فانطلقا إلى رسول الله صلى الله عليه وسلم وهما يبكيان فأخذه منهما وقال ‏\"‏ يا ثوبان اذهب بهذا إلى آل فلان ‏\"‏ ‏.‏ أهل بيت بالمدينة ‏\"‏ إن هؤلاء أهل بيتي أكره أن يأكلوا طيباتهم في حياتهم الدنيا يا ثوبان اشتر لفاطمة قلادة من عصب وسوارين من عاج ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     When the Messenger of Allah (ﷺ) went on a journey, the last member of his family he saw was Fatimah, and the first he visited on his return was Fatimah. Once when he returned from an expedition she had hung up a hair-cloth, or a curtain, at her door, and adorned al-Hasan and al-Husayn with silver bracelets. So when he arrived, he did not enter. Thinking that he had been prevented from entering by what he had seen, she tore down the curtain, unfastened the bracelets from the boys and cut them off.  They went weeping to the Messenger of Allah (ﷺ), and when he had taken them from them, he said: Take this to so and so's family. Thawban. In Medina, these are my family, and I did not like them to enjoy their good things in the present life. Buy Fatimah a necklace or asb, Thawban, and two ivory bracelets.",
      "chain": [
        "30175",
        "20258",
        "18897",
        "17018",
        "18392"
      ]
    }
  ],
  "total_hadiths": 1
}