{
  "id": "18396",
  "name": "Smrh bin S'hm al-Quraishi سمرة بن سهم القرشي الأسدي",
  "full_name": "Smrh bin S'hm al-Quraishi سمرة بن سهم القرشي الأسدي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ ت  س  ق  -  مجهول ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "960",
      "name": "Abu Hashim ibn 'Utbah b. Rabi'a ( أبو هاشم بن عتبة بن ربيعة بن عبد شمس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5372",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن قدامة، عن جرير، عن منصور، عن أبي وائل، عن سمرة بن سهم، - رجل من قومه - قال نزلت على أبي هاشم بن عتبة وهو طعين فأتاه معاوية يعوده فبكى أبو هاشم فقال معاوية ما يبكيك أوجع يشئزك أم على الدنيا فقد ذهب صفوها قال كل لا ولكن رسول الله صلى الله عليه وسلم عهد إلى عهدا وددت أني كنت تبعته قال ‏\"‏ إنه لعلك تدرك أموالا تقسم بين أقوام وإنما يكفيك من ذلك خادم ومركب في سبيل الله ‏\"‏ ‏.‏ فأدركت فجمعت ‏.‏",
      "text_en": " It was narrated that Samurah bin Sahm said:                     \"I came to Abu Hashim bin 'Utbah when he was suffering the plague, and Mu'awiyah came to visit him. Abu Hashim wept. Mu'awiyah said to him: 'Why are you weeping? Is it because of some pain that is hurting you, or is it for this world, the best of which has gone?' He said: 'Neither, but the Messenger of Allah [SAW] gave me some advice, which I wish that I had followed. He said: \"Perhaps you will live to see wealth that will be distributed among the people when all that would suffice you of that would be a servant and a mount to ride in the cause of Allah.\" I lived to see that, and I accumulated (wealth).'\"",
      "chain": [
        "20028",
        "11067",
        "11353",
        "18396"
      ]
    }
  ],
  "total_hadiths": 1
}