{
  "id": "18431",
  "name": "Salah bin Abi Aryb صالح بن أبي عريب",
  "full_name": "Salah bin Abi Aryb صالح بن أبي عريب",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Ra'"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19940",
      "name": "Kathir bin Marrah al-Hadrami كثير بن مرة الحضرمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "1600",
      "name": "Khallad bin al-Saib bin Khallad ( خلاد بن السائب بن خلاد الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1608",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يحيى، - يعني القطان - عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة، عن عوف بن مالك، قال دخل علينا رسول الله صلى الله عليه وسلم المسجد وبيده عصا وقد علق رجل منا قنا حشفا فطعن بالعصا في ذلك القنو وقال ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها ‏\"‏ ‏.‏ وقال ‏\"‏ إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Messenger of Allah (ﷺ) entered upon us in the mosque, and he had a stick in his hand. A man hung there a bunch of hashaf. He struck the bunch with the stick, and said: If the owner of this sadaqah (alms) wishes to give a better one than it, he would give. The owner of this sadaqah will eat hashaf on the Day of Judgment.",
      "chain": [
        "38662",
        "20031",
        "11875",
        "18431",
        "19940",
        "10805"
      ]
    },
    {
      "hadith_no": "3116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مالك بن عبد الواحد المسمعي، حدثنا الضحاك بن مخلد، حدثنا عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان آخر كلامه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     The Messenger of Allah (ﷺ) as saying: If anyone's last words are \"There is no god but Allah\" he will enter Paradise.",
      "chain": [
        "11875",
        "18431",
        "19940",
        "32"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال أنبأنا يحيى، عن عبد الحميد بن جعفر، قال حدثني صالح بن أبي عريب، عن كثير بن مرة الحضرمي، عن عوف بن مالك، قال خرج رسول الله صلى الله عليه وسلم وبيده عصا وقد علق رجل قنو حشف فجعل يطعن في ذلك القنو فقال ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب من هذا إن رب هذه الصدقة يأكل حشفا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that  'Awf bin Malik said:                     \"The Messenger of Allah came out with a stick in his hand, and a man had hung up a bunch of dry and bad dates. He started hitting that bunch of dates and said: 'I wish that the one who gave this Sadaqah had given something better than this, for the one who gave these dry, bad dates will eat dry, bad dates on the Day of Resurrection.\"'",
      "chain": [
        "20184",
        "20031",
        "11875",
        "18431",
        "19940",
        "10805"
      ]
    },
    {
      "hadith_no": "1893",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة الحضرمي، عن عوف بن مالك الأشجعي، قال خرج رسول الله  صلى الله عليه وسلم  وقد علق رجل قناء أو قنوا وبيده عصا فجعل يطعن بذلك يدقدق في ذلك القنو ويقول ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Awf bin Malik Al-Ashja'i said: “The Messenger of Allah went out, and a man had hung up one or more bunches of dates. He (the Prophet) had a stick in his hand and he started hitting that bunch of dates repeatedly, saying: 'If the owner of these dates wanted to give in charity, he should have given something better than these. The owner of this charity will eat rotten and shriveled dates on the Day of Resurrection.' ”",
      "chain": [
        "34043",
        "20031",
        "11875",
        "18431",
        "19940",
        "3051"
      ]
    }
  ],
  "total_hadiths": 4
}