{
  "id": "18452",
  "name": "al-Dahhak bin 'Abdur Rahman الضحاك بن عبد الرحمن بن عرزب",
  "full_name": "al-Dahhak bin 'Abdur Rahman الضحاك بن عبد الرحمن بن عرزب",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "105",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ قد  ت  ق  -  ثقة ]"
    ],
    "tags": [
      "Tabarani",
      "al-Ash'ari"
    ]
  },
  "parents": [
    {
      "id": "18635",
      "name": "'Abdur Rahman bin Arzb عبد الرحمن بن عرزب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18635",
      "name": "'Abdur Rahman bin Arzb عبد الرحمن بن عرزب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1021",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، عن حماد بن سلمة، عن أبي سنان، قال دفنت ابني سنانا وأبو طلحة الخولاني جالس على شفير القبر فلما أردت الخروج أخذ بيدي فقال ألا أبشرك يا أبا سنان ‏.‏ قلت بلى ‏.‏ فقال حدثني الضحاك بن عبد الرحمن بن عرزب عن أبي موسى الأشعري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا مات ولد العبد قال الله لملائكته قبضتم ولد عبدي ‏.‏ فيقولون نعم ‏.‏ فيقول قبضتم ثمرة فؤاده ‏.‏ فيقولون نعم ‏.‏ فيقول ماذا قال عبدي فيقولون حمدك واسترجع ‏.‏ فيقول الله ابنوا لعبدي بيتا في الجنة وسموه بيت الحمد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Sinan said:                     \"I buried my son Sinan and Abu Talhah Al-Khawlani was sitting on the rim of the grave. When I wanted to leave he took me by my hand and said: 'Shall I not inform you of some good new O Abu Sinan!' I said: 'Of course.' He said: 'Ad-Dahhak bin Abdur-Rahman bin Arzab narrated to me, from Abu Musa Al-Ash'ari: \"The Messenger of Allah said: 'When a child of the slave (of Allah) died, Allah says to the angels: \"Have you taken the fruits of his work.\" They reply: \"Yes.\" So He says: \"What did My slave say?\" They reply: \"He praised you and mentioned that to You is the return.\" So Allah says: \"Build a house in Paradise for My slave, and name it 'the house of praise.'\"",
      "chain": [
        "38265",
        "20025",
        "20021",
        "18452",
        "41"
      ]
    },
    {
      "hadith_no": "603",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا معلى بن منصور، وبشر بن آدم، قالا حدثنا عيسى بن يونس، عن عيسى بن سنان، عن الضحاك بن عبد الرحمن بن عرزب، عن أبي موسى الأشعري، أن رسول الله  صلى الله عليه وسلم  توضأ ومسح على الجوربين والنعلين ‏.‏ قال المعلى في حديثه لا أعلمه إلا قال والنعلين ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-Ash'ari that:                     The Messenger of Allah performed ablution and wiped over his socks and his sandals.",
      "chain": [
        "11222",
        "30278",
        "30125",
        "20347",
        "14307",
        "18452",
        "41"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا راشد بن سعيد بن راشد الرملي، حدثنا الوليد، عن ابن لهيعة، عن الضحاك بن أيمن، عن الضحاك بن عبد الرحمن بن عرزب، عن أبي موسى الأشعري، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن الله ليطلع في ليلة النصف من شعبان فيغفر لجميع خلقه إلا لمشرك أو مشاحن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Musa Al-Ash’ari that the Messenger of Allah(ﷺ)said:                      “Allah looks down on the night of the middle of Sha’banandforgives all His creation, apart from the idolater and theMushahin.”",
      "chain": [
        "20733",
        "20624",
        "18452",
        "41"
      ]
    }
  ],
  "total_hadiths": 3
}