{
  "id": "18480",
  "name": "'Amir bin Abi 'Amir عامر بن أبي عامر الأشعري",
  "full_name": "'Amir bin Abi 'Amir عامر بن أبي عامر الأشعري",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Jordon",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ت  -  صحبة ]"
    ],
    "tags": [
      "al-Asha'ri",
      "Makhdaram"
    ]
  },
  "parents": [
    {
      "id": "408",
      "name": "Abu 'Amir al-Asha'ari ( أبو عامر الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "408",
      "name": "Abu 'Amir al-Asha'ari ( أبو عامر الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "17059",
      "name": "Malik bin Msrwh مالك بن مسروح",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2079",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا عامر بن أبي عامر الخزاز، حدثنا أيوب بن موسى، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما نحل والد ولدا من نحل أفضل من أدب حسن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث عامر بن أبي عامر الخزاز وهو عامر بن صالح بن رستم الخزاز وأيوب بن موسى هو ابن عمرو بن سعيد بن العاصي ‏.‏ وهذا عندي حديث مرسل ‏.‏",
      "text_en": " Ayyub bin Musa narrated from his father, from his grandfather, that the Messenger of Allah said :                     \"There is no gift that a father gives his son more virtuous than good manners.\"(Daif)",
      "chain": [
        "30395",
        "18480",
        "11241",
        "13125"
      ]
    },
    {
      "hadith_no": "4328",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، وغير، واحد، قالوا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت عبد الله بن ملاذ، يحدث عن نمير بن أوس، عن مالك بن مسروح، عن عامر بن أبي عامر الأشعري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم الحى الأسد والأشعرون لا يفرون في القتال ولا يغلون هم مني وأنا منهم ‏\"‏ ‏.‏ قال فحدثت بذلك معاوية فقال ليس هكذا قال رسول الله قال ‏\"‏ هم مني وإلى ‏\"‏ ‏.‏ فقلت ليس هكذا حدثني أبي ولكنه حدثني قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هم مني وأنا منهم ‏\"‏ ‏.‏ قال فأنت أعلم بحديث أبيك ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث وهب بن جرير ‏.‏ ويقال الأسد هم الأزد ‏.‏",
      "text_en": " Narrated 'Amir bin Abi 'Amir Al-Ash'ari:                     from his father who said: \"The Messenger of Allah (ﷺ) said: 'Blessed are the tribes of Al-Asad and Al-Ash'arun, they flee not from fighting nor do they pilfer the spoils of war. They are from me and I am from them.'\" He ('Amir) said: \"So I narrated that to Mu'awiyah, and he said: \"This is not how the Messenger of Allah (ﷺ) said it, he said: 'They are from me, and for me.' I said, this is not how my father narrated it to me, rather he narrated to me, saying: 'I heard the Messenger of Allah (ﷺ) saying: \"They are from me and I am from them.'\" So he said: 'Then you are more knowledgeable of your father's Hadith.'\"",
      "chain": [
        "38088",
        "20298",
        "11272",
        "28309",
        "19093",
        "17059",
        "18480",
        "408"
      ]
    }
  ],
  "total_hadiths": 2
}