{
  "id": "18505",
  "name": "'Abdullah bin Abi Bakr bin Zayd عبد الله بن أبي بكر بن زيد",
  "full_name": "'Abdullah bin Abi Bakr bin Zayd عبد الله بن أبي بكر بن زيد",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ ت  ص  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-4138",
      "hadith_no": "4138",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، وعبد بن حميد، قالا حدثنا خالد بن مخلد، حدثنا موسى بن يعقوب الزمعي، عن عبد الله بن أبي بكر بن زيد بن المهاجر، أخبرني مسلم بن أبي سهل النبال، أخبرني الحسن بن أسامة بن زيد، أخبرني أبي أسامة بن زيد، قال طرقت النبي صلى الله عليه وسلم ذات ليلة في بعض الحاجة فخرج النبي صلى الله عليه وسلم وهو مشتمل على شيء لا أدري ما هو فلما فرغت من حاجتي قلت ما هذا الذي أنت مشتمل عليه قال فكشفه فإذا حسن وحسين عليهما السلام على وركيه فقال ‏\"‏ هذان ابناى وابنا ابنتي اللهم إني أحبهما فأحبهما وأحب من يحبهما ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Usamah bin Zaid:                     \"I came to the Prophet (ﷺ) one night concerning some need, so the Prophet (ﷺ) came out while he was covering up something, and I did not know what it was. Once I had tended to my need, I said: 'What is this that you were covering up?' So he uncovered it, and I found it was Hasan and Husain [peace be upon them] upon his hips. So he said: 'These are my two sons, and the sons of my daughter. O Allah! Indeed, I love them, so love them, and love those who love them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "30553",
        "30463",
        "20706",
        "18505"
      ]
    }
  ],
  "total_hadiths": 1
}