{
  "id": "18514",
  "name": "'Abdullah bin Rabi'a bin Farqad عبد الله بن ربيعة بن فرقد السلمي",
  "full_name": "'Abdullah bin Rabi'a bin Farqad عبد الله بن ربيعة بن فرقد السلمي",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5164",
      "name": "'Ubaid bin Khalid al-Slmy ( عبيد بن خالد السلمي البهزي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5167",
      "name": "'Utba bin Frqd ( عتبة بن فرقد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "15408",
      "name": "'Amr bin 'Utba bin Farqad عمرو بن عتبة بن فرقد",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "17893",
      "name": "Ma'dd bin Yazid al-Shybany معضد بن يزيد الشيباني",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11041",
      "name": "al-Ashtar al-Nakha'i الأشتر النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11375",
      "name": "'Ali bin al-Aqmar bin 'Amr علي بن الأقمر بن عمرو",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2524",
      "hadith_no": "2524",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن عمرو بن مرة، قال سمعت عمرو بن ميمون، عن عبد الله بن ربيعة، عن عبيد بن خالد السلمي، قال ‏:‏ آخى رسول الله صلى الله عليه وسلم بين رجلين فقتل أحدهما ومات الآخر بعده بجمعة أو نحوها، فصلينا عليه، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ ما قلتم ‏\"‏ ‏.‏ فقلنا ‏:‏ دعونا له، وقلنا ‏:‏ اللهم اغفر له وألحقه بصاحبه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ فأين صلاته بعد صلاته وصومه بعد صومه ‏\"‏ ‏.‏ شك شعبة في صومه ‏:‏ ‏\"‏ وعمله بعد عمله إن بينهما كما بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydullah ibn Khalid as-Sulami:                     The Messenger of Allah (ﷺ) made a brotherhood between two men, one of whom was killed (in Allah's path), and a week or thereabouts later the other died, and we prayed at his funeral). The Messenger of Allah (ﷺ) asked: What did you say? We replied: We prayed for him and said: O Allah, forgive him, and join him to his companion. The Messenger of Allah (ﷺ) said: What about his prayers since the time the other died, and his fasting since the time the other died--the narrator Shu'bah doubted the words, \"his fasting--and his deeds since the time the other died. The distance between them is just like the distance between heaven and earth.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20020",
        "11381",
        "11382",
        "18514",
        "5164"
      ]
    },
    {
      "id": "sunan-an-nasai-672",
      "hadith_no": "672",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، عن شعبة، عن الحكم، عن ابن أبي ليلى، عن عبد الله بن ربيعة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر فسمع صوت رجل يؤذن فقال مثل قوله ثم قال إن هذا لراعي غنم أو عازب عن أهله ‏.‏ فنظروا فإذا هو راعي غنم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20020",
        "11069",
        "11196",
        "18514"
      ]
    },
    {
      "id": "sunan-an-nasai-673",
      "hadith_no": "673",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، عن شعبة، عن الحكم، عن ابن أبي ليلى، عن عبد الله بن ربيعة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر فسمع صوت رجل يؤذن حتى إذا بلغ أشهد أن محمدا رسول الله - قال الحكم لم أسمع هذا عن ابن أبي ليلى - قال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا لراعي غنم أو رجل عازب عن أهله ‏\"‏ ‏.‏ فهبط الوادي فإذا هو براعي غنم وإذا هو بشاة ميتة قال ‏\"‏ أترون هذه هينة على أهلها ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ الدنيا أهون على الله من هذه على أهلها ‏\"‏ ‏.‏",
      "text_en": " [It was narrated from 'Abdullah bin Rubayyi'ah that he was with the Messenger of Allah (ﷺ) on a journey and he heard the voice of a man calling the Adhan, and he said what he said. When he reached the words:                      Ashhadu anna Muhammadan Rasul-Allah (I bear witness that Muhammad is the Messenger of Allah), - Al-Hakam said, \"I did not hear this from Ibn Abi Lailah\" - the Messenger of Allah (ﷺ) said: \"This is a shepherd of a man who is away from his family.\" He went down into the valley and found a shepherd, standing by a dead sheep. He said: \"Do you think that this is worthless to its owners?\" They said: \"Yes.\" He said: \"This world is more worthless to Allah than this (dead sheep) is to its owners.\"]",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20020",
        "11069",
        "11196",
        "18514"
      ]
    }
  ],
  "total_hadiths": 3
}