{
  "id": "18523",
  "name": "'Abdullah bin Sulaiman عبد الله بن سليمان بن جنادة بن أبي أمية",
  "full_name": "'Abdullah bin Sulaiman عبد الله بن سليمان بن جنادة بن أبي أمية",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]"
    ],
    "tags": [
      "al-Azdi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "28061",
      "name": "Bashr bin Rafa'i al-Harithy بشر بن رافع الحارثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3176",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هشام بن بهرام المدائني، أخبرنا حاتم بن إسماعيل، حدثنا أبو الأسباط الحارثي، عن عبد الله بن سليمان بن جنادة بن أبي أمية، عن أبيه، عن جده، عن عبادة بن الصامت، قال كان رسول الله صلى الله عليه وسلم يقوم في الجنازة حتى توضع في اللحد فمر به حبر من اليهود فقال هكذا نفعل ‏.‏ فجلس النبي صلى الله عليه وسلم وقال ‏\"‏ اجلسوا خالفوهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Messenger of Allah (ﷺ) used to stand up for a funeral until the corpse was placed in the grave. A learned Jew (once) passed him and said: This is how we do. The Prophet (ﷺ) sat down and said: Sit down and act differently from them.",
      "chain": [
        "38681",
        "20159",
        "18523",
        "40"
      ]
    },
    {
      "hadith_no": "1020",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا صفوان بن عيسى، عن بشر بن رافع، عن عبد الله بن سليمان بن جنادة بن أبي أمية، عن أبيه، عن جده، عن عبادة بن الصامت، قال كان رسول الله صلى الله عليه وسلم إذا اتبع الجنازة لم يقعد حتى توضع في اللحد فعرض له حبر فقال هكذا نصنع يا محمد ‏.‏ قال فجلس رسول الله صلى الله عليه وسلم وقال ‏\"‏ خالفوهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وبشر بن رافع ليس بالقوي في الحديث ‏.‏",
      "text_en": " Ubadah bin As-Samit said:                     \"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"",
      "chain": [
        "30160",
        "20553",
        "28061",
        "18523",
        "40"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، وعقبة بن مكرم، قالا حدثنا صفوان بن عيسى، حدثنا بشر بن رافع، عن عبد الله بن سليمان بن جنادة بن أبي أمية، عن أبيه، عن جده، عن عبادة بن الصامت، قال كان رسول الله  صلى الله عليه وسلم  إذا اتبع جنازة لم يقعد حتى توضع في اللحد فعرض له حبر فقال هكذا نصنع يا محمد ‏.‏ فجلس رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ خالفوهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “When the Messenger ofAllah (ﷺ) followed a funeral, he would not sit down until it hadbeen placed in the niche-grave. A rabbi came to him and said: ‘Thisiswhat we do, O Muhammad!’ So the Messenger of Allah (ﷺ) satdown andsaid: ‘Be different from them.’”",
      "chain": [
        "30160",
        "30441",
        "20553",
        "28061",
        "18523",
        "40"
      ]
    }
  ],
  "total_hadiths": 3
}