{
  "id": "18554",
  "name": "'Abdullah bin 'Amr bin al-Faghwa' عبد الله بن عمرو بن الفغواء",
  "full_name": "'Abdullah bin 'Amr bin al-Faghwa' عبد الله بن عمرو بن الفغواء",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Not Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Not Thiqah] [ د  -  مستور ]"
    ],
    "tags": [
      "al-Khuza'i"
    ]
  },
  "parents": [
    {
      "id": "5209",
      "name": "'Amr bin al-Faghwa' ( عمرو بن الفغواء ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5209",
      "name": "'Amr bin al-Faghwa' ( عمرو بن الفغواء ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "13548",
      "name": "'Isa bin Ma'mr Hjazy عيسى بن معمر حجازي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا نوح بن يزيد بن سيار المؤدب، حدثنا إبراهيم بن سعد، قال حدثنيه ابن إسحاق، عن عيسى بن معمر، عن عبد الله بن عمرو بن الفغواء الخزاعي، عن أبيه، قال دعاني رسول الله صلى الله عليه وسلم وقد أراد أن يبعثني بمال إلى أبي سفيان يقسمه في قريش بمكة بعد الفتح فقال ‏\"‏ التمس صاحبا ‏\"‏ ‏.‏ قال فجاءني عمرو بن أمية الضمري فقال بلغني أنك تريد الخروج وتلتمس صاحبا ‏.‏ قال قلت أجل ‏.‏ قال فأنا لك صاحب ‏.‏ قال فجئت رسول الله صلى الله عليه وسلم قلت قد وجدت صاحبا ‏.‏ قال فقال ‏\"‏ من ‏\"‏ ‏.‏ قلت عمرو بن أمية الضمري ‏.‏ قال ‏\"‏ إذا هبطت بلاد قومه فاحذره فإنه قد قال القائل أخوك البكري ولا تأمنه ‏\"‏ ‏.‏ فخرجنا حتى إذا كنت بالأبواء قال إني أريد حاجة إلى قومي بودان فتلبث لي قلت راشدا فلما ولى ذكرت قول النبي صلى الله عليه وسلم فشددت على بعيري حتى خرجت أوضعه حتى إذا كنت بالأصافر إذا هو يعارضني في رهط قال وأوضعت فسبقته فلما رآني قد فته انصرفوا وجاءني فقال كانت لي إلى قومي حاجة ‏.‏ قال قلت أجل ومضينا حتى قدمنا مكة فدفعت المال إلى أبي سفيان ‏.‏",
      "text_en": " Narrated Amr ibn al-Faghwa' al-Khuza'i:                     The Messenger of Allah (ﷺ) called me. He intended to send me with some goods to AbuSufyan to distribute among the Quraysh at Mecca after the conquest.  He said: Search for a companion.  Then Amr ibn Umayyah ad-Damri came to me and said: I have been told that you are intending to make a journey and are seeking a companion.  I said: Yes.  He said: I am your companion.  I then went to the Messenger of Allah (ﷺ) and said: I have found a companion.  He asked: Who is he?  I replied: Amr ibn Umayyah ad-Damri.  He said: When you come down to the territory of his people, be careful of him, for a maxim says: If one is your real brother, do not feel safe with him.  So we proceeded, and when I reached al-Abwa', he said to me: I have some work with my people at Waddan, so stay here till I come back. I said: Do not lose your way. When he turned his back, I recalled the words of the Prophet (ﷺ). So I rode my camel and galloped without stopping. When I reached al-Asafir, he was pursuing me with a group of men. So I galloped and forged ahead of him. When he saw me that I had outstripped him, they returned and he came to me.  He said to me: I had some work with my people.  I said: Yes. We then went on until we reached Mecca, and I gave the goods to AbuSufyan.",
      "chain": [
        "30023",
        "36677",
        "20150",
        "11107",
        "13548",
        "18554",
        "5209"
      ]
    }
  ],
  "total_hadiths": 1
}