{
  "id": "18598",
  "name": "'Abdul Hameed bin Bhram عبد الحميد بن بهرام الفزاري المدائني",
  "full_name": "'Abdul Hameed bin Bhram عبد الحميد بن بهرام الفزاري المدائني",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Mada'in"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Fazari",
      "al-Mada'ini"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2697",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد، أخبرنا عبد الله بن المبارك، أخبرنا عبد الحميد بن بهرام، أنه سمع شهر بن حوشب، يقول سمعت أسماء بنت يزيد، تحدث أن رسول الله صلى الله عليه وسلم مر في المسجد يوما وعصبة من النساء قعود فألوى بيده بالتسليم وأشار عبد الحميد بيده ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ قال أحمد بن حنبل لا بأس بحديث عبد الحميد بن بهرام عن شهر بن حوشب ‏.‏ وقال محمد بن إسماعيل شهر حسن الحديث وقوى أمره وقال إنما تكلم فيه ابن عون ثم روى عن هلال بن أبي زينب عن شهر بن حوشب ‏.‏ أنبأنا أبو داود المصاحفي بلخي أخبرنا النضر بن شميل عن ابن عون قال إن شهرا نزكوه ‏.‏ قال أبو داود قال النضر تركوه أى طعنوا فيه وإنما طعنوا فيه لأنه ولي أمر السلطان ‏.‏",
      "text_en": " Narrated Asma bint Yazid:                     that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.",
      "chain": [
        "20025",
        "18598",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "3521",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا روح، عن عبد الحميد بن بهرام، عن شهر بن حوشب، قال قال ابن عباس رضى الله عنهما نهي رسول الله صلى الله عليه وسلم عن أصناف النساء إلا ما كان من المؤمنات المهاجرات قال ‏:‏ ‏(‏ لا يحل لك النساء من بعد ولا أن تبدل بهن من أزواج ولو أعجبك حسنهن إلا ما ملكت يمينك ‏)‏ فأحل الله فتياتكم المؤمنات وامرأة مؤمنة إن وهبت نفسها للنبي وحرم كل ذات دين غير الإسلام ثم قال ‏:‏ ‏(‏ومن يكفر بالإيمان فقد حبط عمله وهو في الآخرة من الخاسرين ‏)‏ وقال ‏:‏ ‏(‏ يا أيها النبي إنا أحللنا لك أزواجك اللاتي آتيت أجورهن وما ملكت يمينك مما أفاء الله عليك ‏)‏ إلى قوله ‏:‏ ‏(‏ خالصة لك من دون المؤمنين ‏)‏ وحرم ما سوى ذلك من أصناف النساء ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من حديث عبد الحميد بن بهرام ‏.‏ قال سمعت أحمد بن الحسن يقول قال أحمد بن حنبل لا بأس بحديث عبد الحميد بن بهرام عن شهر بن حوشب ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"All types of women were prohibited for the Messenger of ALlah (ﷺ) except for the believing women among those who emigrated. (Allah) said: 'It is not lawful for you (to marry other) women after this, nor to change them for other wives even though their beauty attracts you, except those whom your right hand possesses (33:52). - And Allah made your believing girls lawful 'And a believing woman if she offers herself to the Prophet (33:50)' and He made every woman of a religion other than Islam unlawful.\" Then He said: \"And whoever disbelieves in faith then fruitless is his work; and in the Hereafter he will be among the losers (5:5).\" And he said: \"Verily We have made lawful to you your wives, to whom you have paid their due, and those whom your right hands possess - whom Allah has given you\" up to His saying: \"A privilege to only you, not for the (rest of) the believers (33:50).\" He made the other types of women unlawful.\"",
      "chain": [
        "30553",
        "20229",
        "18598",
        "11044",
        "17"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن يوسف، حدثنا عبد الحميد بن بهرام، عن شهر بن حوشب، عن عبد الرحمن بن غنم، عن معاذ بن جبل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'adh bin Jabal said:                     \"The Messenger of Allah (ﷺ) said: 'I have been commanded to fight the people until they testify to La ilaha ill-allah (none has the right to be worshipped but Allah) and that I am the Messenger of Allah, and establish regular prayers and pay Zakat.'\"",
      "chain": [
        "38001",
        "30388",
        "18598",
        "11044",
        "5152",
        "32"
      ]
    },
    {
      "hadith_no": "2532",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن عبد الحميد بن بهرام، عن شهر بن حوشب، عن أسماء بنت يزيد، أن النبي صلى الله عليه وسلم توفي ودرعه مرهونة عند يهودي بطعام ‏.‏",
      "text_en": " It was narrated from Asma' bin Yazid that:                     the Prophet (ﷺ) died while his armor was pawned to a Jew for food.",
      "chain": [
        "30201",
        "20032",
        "18598",
        "11044",
        "84"
      ]
    }
  ],
  "total_hadiths": 4
}