{
  "id": "18655",
  "name": "'Abdul al-Kareem bin Malik عبد الكريم بن مالك الجزري أبو سعيد",
  "full_name": "'Abdul al-Kareem bin Malik عبد الكريم بن مالك الجزري أبو سعيد",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "107",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Jazira",
      "Hiran"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ع  الستة]"
    ],
    "tags": [
      "Client",
      "al-Juzri",
      "al-Hirani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11725",
      "name": "Maqsim bin Bajra مقسم بن بجرة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28523",
      "name": "Muhammad bin 'Abdullah bin 'Alatha محمد بن عبد الله بن علاثة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1743",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال أخبرني الحسن بن مسلم، وعبد الكريم الجزري، أن مجاهدا، أخبرهما أن عبد الرحمن بن أبي ليلى أخبره أن عليا  رضى الله عنه  أخبره أن النبي صلى الله عليه وسلم أمره أن يقوم على بدنه، وأن يقسم بدنه كلها، لحومها وجلودها وجلالها، ولا يعطي في جزارتها شيئا‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet ordered me to supervise the (slaughtering) of Budn (Hadi camel) and to distribute their meat, skins and covering sheets in charity and not to give anything (of their bodies) to the butcher as wages for slaughtering.",
      "chain": [
        "30175",
        "20031",
        "11070",
        "11557",
        "18655",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "4002",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني عبد الكريم، أنه سمع مقسما، مولى عبد الله بن الحارث يحدث عن ابن عباس، أنه سمعه يقول ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ عن بدر، والخارجون، إلى بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The believers who failed to join the Ghazwa of Badr and those who took part in it are not equal (in reward).",
      "chain": [
        "30309",
        "20295",
        "11070",
        "18655",
        "17"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم ح، وحدثني إسحاق، أخبرنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عبد الكريم، أن مقسما، مولى عبد الله بن الحارث أخبره أن ابن عباس  رضى الله عنهما  أخبره ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ عن بدر والخارجون إلى بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Not equal are those believers who sat (at home) and did not join the Badr battle and those who joined the Badr battle.",
      "chain": [
        "30309",
        "20295",
        "11070",
        "30021",
        "20121",
        "11070",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "5010",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا عبد الرزاق، عن معمر، عن عبد الكريم الجزري، عن عكرمة، قال ابن عباس قال أبو جهل لئن رأيت محمدا يصلي عند الكعبة لأطأن على عنقه‏.‏ فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو فعله لأخذته الملائكة ‏\"‏‏.‏ تابعه عمرو بن خالد عن عبيد الله عن عبد الكريم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Jahl said, \"If I see Muhammad praying at the Ka`ba, I will tread on his neck.\" When the Prophet heard of that, he said, \"If he does so, the Angels will snatch him away.\"",
      "chain": [
        "30020",
        "20121",
        "20115",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2665",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن عبد الكريم، عن طاوس، عن ابن، عباس - رضى الله عنهما - قال لا تعب على من صام ولا على من أفطر قد صام رسول الله صلى الله عليه وسلم في السفر وأفطر ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with him) reported:                      Do not condemn one who observes fast, or one who does not observe (in a journey). for the Messenger of Allah (may peace be upon him) observed fast in a journey or he did not observe it (too).",
      "chain": [
        "30216",
        "20032",
        "20012",
        "18655",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2938",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، وأيوب، وحميد، وعبد، الكريم عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة، - رضى الله عنه - أن النبي صلى الله عليه وسلم مر به وهو بالحديبية قبل أن يدخل مكة وهو محرم وهو يوقد تحت قدر والقمل يتهافت على وجهه فقال ‏\"‏ أيؤذيك هوامك هذه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فاحلق رأسك وأطعم فرقا بين ستة مساكين - والفرق ثلاثة آصع - أو صم ثلاثة أيام أو انسك نسيكة ‏\"‏ ‏.‏ قال ابن أبي نجيح ‏\"‏ أو اذبح شاة ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) happened to pass by him at Hudaibiya before entering Mecca in a state of Ibrim and he (Ka'b) was kindling fire under the cooking pot and virmins were creeping on his (Kalb's) face. Thereupon (the Holy Prophet) said:                      Dothese vermins trouble you? He (Ka'b) said: Yes. The Messenger of Allah (way peace be upon him) said: Shave your head and give some quantity of food enough to feed six needy persons (faraq is equal to three sa's), or observe fast for three days or offer sacri- fice of a sacrificial animal. Ibn Najih (one of the narrators) said:\" Or sacrifice a goat.\"",
      "chain": [
        "20012",
        "11254",
        "11015",
        "11279",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "3241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو خيثمة، عن عبد الكريم، عن مجاهد، عن عبد، الرحمن بن أبي ليلى عن علي، قال أمرني رسول الله صلى الله عليه وسلم أن أقوم على بدنه وأن أتصدق بلحمها وجلودها وأجلتها وأن لا أعطي الجزار منها قال ‏\"‏ نحن نعطيه من عندنا ‏\"‏ ‏.‏",
      "text_en": " 'All (Allah be pleased with him) reperted:                      Allah's Messenger (may peace be upon him) put me in charge of his sacrificial animals, that I should give their flesh. skins and saddle cloths as sadaqa, but not to give anything to the butcher, saying: We would pay him ourselves.",
      "chain": [
        "30399",
        "30022",
        "18655",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3245",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عبد، الكريم بن مالك الجزري أن مجاهدا، أخبره أن عبد الرحمن بن أبي ليلى أخبره أن علي بن أبي طالب أخبره أن النبي صلى الله عليه وسلم أمره بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Hadrat 'Ali (Allah be pleased with him).",
      "chain": [
        "38487",
        "20277",
        "11070",
        "18655",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "6511",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن عبد الكريم، عن محمد بن المنكدر، عن جابر، قال جيء بأبي يوم أحد مجدعا فوضع بين يدى النبي صلى الله عليه وسلم ‏.‏ فذكر نحو حديثهم ‏.‏",
      "text_en": " Jabir reported:                      My father was brought in a state that his ears had been cut off and (his dead body) was placed before Allah's Apostle (may peace be upon him), the rest of the hadith is the same.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "18655",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، - يعني ابن سليمان - عن علي بن الحكم البناني، عن أبي الحسن الجزري، عن مقسم، عن ابن عباس، قال إذا أصابها في أول الدم فدينار وإذا أصابها في انقطاع الدم فنصف دينار ‏.‏ قال أبو داود وكذلك قال ابن جريج عن عبد الكريم عن مقسم ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      If one has intercourse in the beginning of the menses,(one should give) one dinar; in case one has intercourse towards the end of the menses, then half a dinar (should be given)",
      "chain": [
        "20249",
        "20532",
        "11605",
        "11725",
        "17",
        "11070",
        "18655"
      ]
    },
    {
      "hadith_no": "1769",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا سفيان، - يعني ابن عيينة - عن عبد الكريم الجزري، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي، - رضى الله عنه - قال أمرني رسول الله صلى الله عليه وسلم أن أقوم على بدنه وأقسم جلودها وجلالها وأمرني أن لا أعطي الجزار منها شيئا وقال ‏\"‏ نحن نعطيه من عندنا ‏\"‏ ‏.‏",
      "text_en": " `Ali said :                      The Messenger of Allah (SWAS) commanded me to take charge of (his) sacrificial camels and to distribute the skins and saddle clothes (after sacrifice) as sadaqah.  He commanded me not to give anything from it to the butcher.  He said we used to give it (the wages) to the butcher ourselves.",
      "chain": [
        "30154",
        "20005",
        "18655",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن عبد الكريم بن مالك الجزري، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، في هذه القصة زاد ‏\"‏ أى ذلك فعلت أجزأ عنك ‏\"‏ ‏.‏",
      "text_en": " It was reported from 'Abdul-Karim bin Malik Al-Jazari, from 'Abdur-Rahman bin Abi Laila, from Ka'b bin Ujrah, regarding this incident (as narrated in on previous hadith), and he added:                      \"Whichever of these you do, it will suffice.\"",
      "chain": [
        "20164",
        "20001",
        "18655",
        "11196"
      ]
    },
    {
      "hadith_no": "3482",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا عبيد الله، - يعني ابن عمرو - عن عبد الكريم، عن قيس بن حبتر، عن عبد الله بن عباس، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب وإن جاء يطلب ثمن الكلب فاملأ كفه ترابا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) forbade the price paid for a dog; if someone comes to ask for the price of a dog, fill his hand-palm with dust.",
      "chain": [
        "30335",
        "30024",
        "18655",
        "15467",
        "17"
      ]
    },
    {
      "hadith_no": "3728",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا ابن عيينة، عن عبد الكريم، عن عكرمة، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم أن يتنفس في الإناء أو ينفخ فيه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) forbade blowing or breathing into a vessel.",
      "chain": [
        "30352",
        "20005",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو توبة، حدثنا عبيد الله، عن عبد الكريم الجزري، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون قوم يخضبون في آخر الزمان بالسواد كحواصل الحمام لا يريحون رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: At the end of time there will be people who will use this black dye like the crops of doves who will not experience the fragrance of Paradise.",
      "chain": [
        "30335",
        "11201",
        "18655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4996",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس النيسابوري، حدثنا محمد بن سنان، حدثنا إبراهيم بن طهمان، عن بديل، عن عبد الكريم، عن عبد الله بن شقيق، عن أبيه، عن عبد الله بن أبي الحمساء، قال بايعت النبي صلى الله عليه وسلم ببيع قبل أن يبعث وبقيت له بقية فوعدته أن آتيه بها في مكانه فنسيت ثم ذكرت بعد ثلاث فجئت فإذا هو في مكانه فقال ‏\"‏ يا فتى لقد شققت على أنا ها هنا منذ ثلاث أنتظرك ‏\"‏ ‏.‏ قال أبو داود قال محمد بن يحيى هذا عندنا عبد الكريم بن عبد الله بن شقيق ‏.‏ قال أبو داود هكذا بلغني عن علي بن عبد الله ‏.‏ قال أبو داود بلغني أن بشر بن السري رواه عن عبد الكريم بن عبد الله بن شقيق ‏.‏",
      "text_en": " Narrated Abdullah ibn AbulHamsa':                     I bought something from the Prophet (ﷺ) before he received his Prophetic commission, and as there was something still due to him I promised him that I would bring it to him at his place, but I forgot. When I remembered three days later, I went to that place and found him there. He said: You have vexed me, young man. I have been here for three days waiting for you.Abu Dawud said: Muhammad b. Yahya said : This is, in our opinion, 'Abd al-Karim b. 'Abd Allah b. Shaqiq (instead of \"from 'Abd al-Karim from 'Abd Allah b. Shaqiq\"). Abu Dawud said: In a similar way I have been informed by 'Ali b. 'Abd Allah.Abu Dawud said: I have been told that Bishr b. al-Sarri transmitted it from 'Abd Allah b. Shaqiq.",
      "chain": [
        "11222",
        "34207",
        "20187",
        "18655",
        "10694"
      ]
    },
    {
      "hadith_no": "137",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن حريث، أخبرنا الفضل بن موسى، عن أبي حمزة السكري، عن عبد الكريم، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كان دما أحمر فدينار وإذا كان دما أصفر فنصف دينار ‏\"‏ ‏.‏ قال أبو عيسى حديث الكفارة في إتيان الحائض قد روي عن ابن عباس موقوفا ومرفوعا ‏.‏ وهو قول بعض أهل العلم ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال ابن المبارك يستغفر ربه ولا كفارة عليه ‏.‏ وقد روي نحو قول ابن المبارك عن بعض التابعين منهم سعيد بن جبير وإبراهيم النخعي وهو قول عامة علماء الأمصار ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"When the blood is red then (give) a Dinar. And when the blood is yellow then half Dinar.\"",
      "chain": [
        "30325",
        "20452",
        "20458",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أبو داود الطيالسي، حدثنا محمد بن مسلم بن أبي الوضاح، هو أبو سعيد المؤدب عن عبد الكريم الجزري، عن مجاهد، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم كان يصلي أربعا بعد أن تزول الشمس قبل الظهر وقال ‏\"‏ إنها ساعة تفتح فيها أبواب السماء وأحب أن يصعد لي فيها عمل صالح ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي أيوب ‏.‏ قال أبو عيسى حديث عبد الله بن السائب حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي أربع ركعات بعد الزوال لا يسلم إلا في آخرهن ‏.‏",
      "text_en": " Abdullah bin As-Sa'ib narrated:                     \"Allah's Messenger would pray four (Rak'ah) after the Zawal of the sun before Az-Zuhr. He said: 'It is an hour in which the gates of the heavens are opened, and I love that a righteous deed should be raised up for me in it.'\"",
      "chain": [
        "20547",
        "167",
        "18655",
        "11028",
        "2065"
      ]
    },
    {
      "hadith_no": "953",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أيوب السختياني، وابن أبي نجيح، وحميد الأعرج، وعبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن النبي صلى الله عليه وسلم مر به وهو بالحديبية قبل أن يدخل مكة وهو محرم وهو يوقد تحت قدر والقمل يتهافت على وجهه فقال ‏\"‏ أتؤذيك هوامك هذه ‏\"‏ ‏.‏ فقال نعم ‏.‏ فقال ‏\"‏ احلق وأطعم فرقا بين ستة مساكين ‏\"‏ ‏.‏ والفرق ثلاثة آصع ‏\"‏ أو صم ثلاثة أيام أو انسك نسيكة ‏\"‏ ‏.‏ قال ابن أبي نجيح ‏\"‏ أو اذبح شاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن المحرم إذا حلق رأسه أو لبس من الثياب ما لا ينبغي له أن يلبس في إحرامه أو تطيب فعليه الكفارة بمثل ما روي عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bin Abu Laila narrated from Ka'b bin Ujrah that:                     The Prophet passed by him while he was at Al-Hudaibiyah, before entering Makkah, and he was a Muhrim. He had lit a fire under a cooking pot and lice were falling all over his face. So he (the Prophet) said: \"Have these lice of yours troubled you?\" He said: \"Yes.\" He said: \"Shave and feed six of the poor with a Faraq\" and a Faraq is three Sa - \"or fast three days, or slaughter a sacrifice.\" Ibn Abi Najih (one of the narrators) said: \"Or slaughter a sheep.\"",
      "chain": [
        "30421",
        "20005",
        "11015",
        "11254",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1888",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عبد الكريم الجزري، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم نهى أن يتنفس في الإناء أو ينفخ فيه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) prohibited breathing in the vessel, or blowing into it.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30421",
        "20005",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3306",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا الحجاج بن محمد، عن ابن جريج، أخبرني عبد الكريم، سمع مقسما، مولى عبد الله بن الحارث يحدث عن ابن عباس، أنه قال  ‏:‏ ‏(‏ لا يستوي القاعدون من المؤمنين غير أولي الضرر ‏)‏ عن بدر والخارجون إلى بدر لما نزلت غزوة بدر قال عبد الله بن جحش وابن أم مكتوم إنا أعميان يا رسول الله فهل لنا رخصة فنزلت ‏:‏ ‏(‏ لا يستوي القاعدون من المؤمنين غير أولي الضرر ‏)‏ و ‏:‏ ‏(‏فضل الله المجاهدين على القاعدين درجة ‏)‏ فهؤلاء القاعدون غير أولي الضرر  ‏:‏ ‏(‏ وفضل الله المجاهدين على القاعدين أجرا عظيما * درجات منه ‏)‏ على القاعدين من المؤمنين غير أولي الضرر ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه من حديث ابن عباس ومقسم يقال هو مولى عبد الله بن الحارث ويقال هو مولى عبد الله بن عباس وكنيته أبو القاسم ‏.‏",
      "text_en": " Narrated Miqsam, the freed slave of 'Abdullah bin Al-Harith:                     from Ibn 'Abbas that he said the Ayah: Not equal are those of the believers who sit, except those who are disabled... (4:95) is about Badr and those went out for Badr. At the time of the battle of Badr, 'Abdullah bin Jahsh and Ibn Umm Maktum said: 'We are blind O Messenger of Allah! So is there an exemption for us?' So the following was revealed: Not equal are those of the believers who sit except those who are disabled. But Allah has preferred those who strive hard and fight above those who sit (at home) by a huge reward (4:95). So these were the people who sat behind, that were not disabled: But Allah has preferred those who strive hard and fight, above those who sit (at home) by a huge reward - they are of levels above those who sit among the believers who did not have an excuse.\"",
      "chain": [
        "30245",
        "11070",
        "18655",
        "17"
      ]
    },
    {
      "hadith_no": "3671",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن عبد الكريم الجزري، عن عكرمة، عن ابن عباس، رضى الله عنهما ‏:‏ ‏(‏ سندع الزبانية ‏)‏ قال قال أبو جهل لئن رأيت محمدا يصلي لأطأن على عنقه ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو فعل لأخذته الملائكة عيانا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ikrimah narrated from Ibn Abbas [may Allah be pleased with them] regarding:                     We will call on the guards of Hell. He said: “Abu Jahl said: ‘If I see Muhammad praying, then I shall stomp upon his neck.’ So the Prophet said: ‘If he does, he will be visibly seized by the angels.’”",
      "chain": [
        "30553",
        "20121",
        "20115",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الكريم بن مالك الجزري، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أنه كان مع رسول الله صلى الله عليه وسلم محرما فآذاه القمل في رأسه فأمره رسول الله صلى الله عليه وسلم أن يحلق رأسه وقال ‏\"‏ صم ثلاثة أيام أو أطعم ستة مساكين مدين مدين أو انسك شاة أى ذلك فعلت أجزأ عنك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kab bin Ujra:                     That he was with the Messenger of Allah in Ihram and he suffered an infestation of head lice. The Messenger of Allah commanded him to shave his head and told him: \"Fast for three days, or fed six poor persons two Mudds earch, or sacrifice a sheep. Whichever one of these you do will be sufficient for you.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2977",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا عبد الرزاق، قال أنبأنا الثوري، عن عبد الكريم الجزري، عن سعيد بن جبير، قال رأيت ابن عمر وذكر نحوه إلا أنه قال وأنا شيخ، كبير ‏.‏",
      "text_en": " It was narrated that Saeed bin Jubair said:                     \"I saw Ibn Umar and he mentioned something similar, except he said: \"and I am an old man.\"",
      "chain": [
        "30375",
        "20121",
        "20012",
        "18655",
        "11050"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم عن علي بن معبد، قال حدثنا موسى بن أعين، عن عبد الكريم الجزري، عن سعيد بن جبير، عن ابن عباس، عن الفضل بن العباس، أنه كان رديف النبي صلى الله عليه وسلم فلم يزل يلبي حتى رمى جمرة العقبة ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas that:                     he was riding behind the Prophet and he continued recite the Talbiyah until he stoned Jamratul Aqabah.",
      "chain": [
        "38204",
        "36046",
        "20465",
        "18655",
        "11050",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال حدثنا حماد بن سلمة، وغيره، عن هارون بن رئاب، عن عبد الله بن عبيد بن عمير، وعبد الكريم، عن عبد الله بن عبيد بن عمير، عن ابن عباس، - عبد الكريم يرفعه إلى ابن عباس وهارون لم يرفعه - قالا جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إن عندي امرأة هي من أحب الناس إلى وهي لا تمنع يد لامس ‏.‏ قال ‏\"‏ طلقها ‏\"‏ ‏.‏ قال لا أصبر عنها ‏.‏ قال ‏\"‏ استمتع بها ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الحديث ليس بثابت وعبد الكريم ليس بالقوي وهارون بن رئاب أثبت منه وقد أرسل الحديث وهارون ثقة وحديثه أولى بالصواب من حديث عبد الكريم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     It was narrated from Ibn 'Abbas that a man came to the Messenger of Allah and said: \"I have a wife who is one of the most beloved of the people to me, but she does not object if anyone touches her.\" He said: \"Divorce her.\" He said: \"I cannot do without her.\" He said: \"Then stay with her as much as you need to.\"",
      "chain": [
        "34188",
        "20472",
        "20021",
        "10974",
        "10643",
        "18655",
        "10643"
      ]
    },
    {
      "hadith_no": "3728",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا أحمد بن سليمان، قال أنبأنا عبيد الله، عن إسرائيل، عن عبد الكريم، عن عطاء، قال نهى رسول الله صلى الله عليه وسلم عن العمرى والرقبى ‏.‏ قلت وما الرقبى قال يقول الرجل للرجل هي لك حياتك ‏.‏ فإن فعلتم فهو جائزة ‏.‏",
      "text_en": " 'Abdul-Karim narrated from 'Ata', who said:                      \"The Messenger of Allah forbade 'Umra and Ruqba.\" I said: \"What is Ruqba?\" He said: \"When one man says to another: 'This belongs to you for the rest of your life.' But if you do that, it is permissible.\"",
      "chain": [
        "38022",
        "11201",
        "20311",
        "18655",
        "11029"
      ]
    },
    {
      "hadith_no": "3867",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا عبيد الله، - يعني ابن عمرو - عن عبد الكريم، عن مجاهد، قال أخذت بيد طاوس حتى أدخلته على ابن رافع بن خديج فحدثه عن أبيه عن رسول الله صلى الله عليه وسلم أنه نهى عن كراء الأرض‏.‏‏ فأبى طاوس فقال سمعت ابن عباس لا يرى بذلك بأسا‏.‏‏ ورواه أبو عوانة عن أبي حصين عن مجاهد قال قال عن رافع مرسلا‏.‏‏",
      "text_en": " It was narrated that Mujahid said:                      \"I took Tawus by the hand and brought him to Ibn Rafi' bin Khadij, and he told him, narrating from his father, that the Messenger of Allah forbade leasing land. Tawus rejected that and said: 'I heard Ibn 'Abbas (say) that he did not see anything wrong with that.'\"",
      "chain": [
        "20387",
        "30024",
        "18655",
        "11028"
      ]
    },
    {
      "hadith_no": "3933",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت معمرا، عن عبد الكريم الجزري، قال قال سعيد بن جبير قال ابن عباس إن خير ما أنتم صانعون أن يؤاجر أحدكم أرضه بالذهب والورق‏.‏‏",
      "text_en": " Sa'eed bin Jubair said:                      \"Ibn 'Abbas said: 'The best thing you can do is for one of you to rent his land out in return for gold and silver.'\"",
      "chain": [
        "30449",
        "20288",
        "20115",
        "18655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا عبيد الله، - وهو ابن عمرو - قال حدثنا عبد الكريم، عن عطاء، عن جابر، قال كنا نأكل لحوم الخيل على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"We used to eat horse meat during the time of the Messenger of Allah.\"",
      "chain": [
        "20387",
        "30024",
        "18655",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4333",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن المثنى، عن عبد الرحمن، عن سفيان، عن عبد الكريم، عن عطاء، عن جابر، قال كنا نأكل لحوم الخيل ‏.‏ قلت البغال قال لا ‏.‏",
      "text_en": " It was narrated from 'Ata, that Jabir said:                     \"we used to eat horseflesh. \": I said: \"And mules?\" He said: \"No",
      "chain": [
        "30170",
        "20033",
        "20012",
        "18655",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5075",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن عبيد الله الحلبي، عن عبيد الله، - وهو ابن عمرو - عن عبد الكريم، عن سعيد بن جبير، عن ابن عباس، رفعه أنه قال ‏\"‏ قوم يخضبون بهذا السواد آخر الزمان كحواصل الحمام لا يريحون رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas, who attributed it to the Prophet [SAW], said:                     \"Some people will dye their hair black like the breasts of pigeons at the end of time, but they will not even smell the fragrance of Paradise.\"",
      "chain": [
        "30024",
        "18655",
        "11050"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عمرو بن الحصين، حدثنا محمد بن عبد الله بن علاثة، عن عبد الكريم الجزري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'The ears are part of the head.'\"",
      "chain": [
        "11222",
        "28523",
        "18655",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا أبو الأحوص، عن عبد الكريم، ح وحدثنا أبو سلمة، يحيى بن خلف حدثنا عبد الأعلى، عن محمد بن إسحاق، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، جميعا عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا أمرها النبي  صلى الله عليه وسلم  أن تأتزر في فور حيضتها ثم يباشرها وأيكم يملك إربه كما كان رسول الله  صلى الله عليه وسلم  يملك إربه",
      "text_en": " It was narrated that 'Aishah said:                     \"If one of us was menstruating, the Messenger of Allah would tell her to tie her waist-wrapper around herself if the bleeding was heavy, then he would embrace her. And who among you can control his desire as the Messenger of Allah used to control his desire?\"",
      "chain": [
        "20327",
        "18655",
        "20246",
        "11107",
        "30201",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا أبو الأحوص، عن عبد الكريم، عن مقسم، عن ابن عباس، قال كان الرجل إذا وقع على امرأته وهي حائض أمره النبي  صلى الله عليه وسلم  أن يتصدق بنصف دينار ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"If a man had intercourse with his wife while she was menstruating, the Prophet commanded him to give half a Dinar in charity.\"",
      "chain": [
        "20327",
        "18655",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن عبد الكريم، عن عمرو بن سعيد، عن عائشة، أن النبي  صلى الله عليه وسلم  دخل عليها فاختبأت مولاة لها فقال النبي  صلى الله عليه وسلم  ‏\"‏ حاضت ‏\"‏ ‏.‏ فقالت نعم ‏.‏ فشق لها من عمامته فقال ‏\"‏ اختمري بهذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Prophet entered upon her, and a freed slave girl of hers concealed herself. The Prophet asked: \"Have her periods begun?\" She said: \"Yes.\" He tore a piece of his turban and said: \"Cover your head with this.\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "18655",
        "10602",
        "53"
      ]
    },
    {
      "hadith_no": "1122",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن أبي حازم، عن إبراهيم بن إسماعيل، عن عبد الكريم، عن مجاهد، وسعيد بن جبير، وعطاء بن أبي رباح، وطاوس، أخبروه عن ابن عباس، أنه أخبرهم أن رسول الله  صلى الله عليه وسلم  كان يجمع بين المغرب والعشاء في السفر من غير أن يعجله شىء ولا يطلبه عدو ولا يخاف شيئا ‏.‏",
      "text_en": " It wasnarrated from Mujahid, Sa’eed bin Jubair, ‘Ata’ bin Abi Rabahand Tawus that Ibn ‘Abbas told them that the Messenger of Allah(ﷺ)used to combine the Maghrib and ‘Isha’ when traveling,although therewas nothing to make him hurry and no enemy pursuinghim, and he wasnot afraid of anything.",
      "chain": [
        "20165",
        "26500",
        "18655",
        "11028",
        "11050",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1471",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا زكريا بن عدي، أنبأنا عبيد الله بن عمرو، عن عبد الكريم، عن عطاء، عن جابر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ صلاة في مسجدي أفضل من ألف صلاة فيما سواه إلا المسجد الحرام وصلاة في المسجد الحرام أفضل من مائة ألف صلاة فيما سواه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Messenger of Allah (ﷺ) said:                     “Oneprayer in my mosque is better than one thousand prayerselsewhere,except the Sacred Mosque, and one prayer in the SacredMosque isbetter than one hundred thousand prayers elsewhere.”",
      "chain": [
        "30464",
        "30024",
        "18655",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله، عن عبد الكريم، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أعطيت أمي حديقة لي وإنها ماتت ولم تترك وارثا غيري فقال رسول الله صلى الله عليه وسلم ‏\"‏ وجبت صدقتك ورجعت إليك حديقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr  bin Shu'aib, from his father, that his grandfather said:                     “A man came to the Prophet (ﷺ) and said: 'I gave my mother a garden of mine, and she has died and has no other heir but me.' The Messenger of Allah(ﷺ) said: 'Your charity is valid and your garden has been returned to you.' ”",
      "chain": [
        "11222",
        "30346",
        "11201",
        "18655",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2709",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان، عن عبد الكريم، عن مجاهد، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ادعى إلى غير أبيه لم يرح رائحة الجنة وإن ريحها ليوجد من مسيرة خمسمائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Amr that the Messenger of Allah (ﷺ) said:                     “Whoever claims to belong to someone other than his father will not smell the fragrance of Paradise, even though its fragrance may be detected from a distance of five hundred years.”",
      "chain": [
        "30269",
        "20005",
        "18655",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "3109",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن عبد الملك بن واقد، حدثنا عبيد الله بن عمرو، عن عبد الكريم، عن عطاء، عن جابر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ عمرة في رمضان تعدل حجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Prophet (ﷺ) said:                      “ ‘UmrahduringRamadan is equivalent to Hajj.”",
      "chain": [
        "30201",
        "30303",
        "30024",
        "18655",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عمران بن محمد بن أبي ليلى، عن أبيه، عن عبد الكريم، عن عبد الله بن الحارث، عن ابن عباس، عن علي بن أبي طالب، قال أتي النبي  صلى الله عليه وسلم  بلحم صيد وهو محرم فلم يأكله ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “The Prophet (ﷺ)broughtsome meat from some game when he was in Ihram, and he did noteatit.”",
      "chain": [
        "30203",
        "25250",
        "18655",
        "912",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "3218",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن عبد الكريم، عن مجاهد، عن ابن أبي ليلى، عن علي بن أبي طالب، قال أمرني رسول الله  صلى الله عليه وسلم  أن أقوم على بدنه وأن أقسم جلالها وجلودها وأن لا أعطي الجازر منها شيئا وقال ‏\"‏ نحن نعطيه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “The Messenger of Allah(ﷺ) commanded me to look after his sacrificial camels, to share outtheir covers and skins, and not to give the butcher any of it. Hesaid: ‘We will give him (his wages).’”",
      "chain": [
        "30269",
        "20005",
        "18655",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3318",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا عمرو بن عبد الله، حدثنا وكيع، عن سفيان، ح وحدثنا محمد بن يحيى، حدثنا عبد الرزاق، حدثنا الثوري، ومعمر، جميعا عن عبد الكريم الجزري، عن عطاء، عن جابر بن عبد الله، قال كنا نأكل لحوم الخيل ‏.‏ قلت فالبغال قال لا ‏.‏",
      "text_en": " It wasnarrated that ‘Ata’ narrated that Jabir bin ‘Abdullah said:                     “Weused to eat the meat of horses.” I said: “And mules?” He said:“No.”",
      "chain": [
        "20032",
        "20012",
        "11222",
        "20121",
        "20012",
        "20115",
        "18655",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن عبد الرحمن المحاربي، حدثنا شريك، عن عبد الكريم، عن عكرمة، عن ابن عباس، قال لم يكن رسول الله  صلى الله عليه وسلم  ينفخ في طعام ولا شراب ولا يتنفس في الإناء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)never blew onto his food or drink, and he did not breathe into thevessel.”",
      "chain": [
        "30216",
        "20587",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا سفيان، عن عبد الكريم، عن عكرمة، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  أن ينفخ في الإناء ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)forbade blowing into the vessel.”",
      "chain": [
        "30357",
        "20012",
        "18655",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3556",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن عبد الرحمن المحاربي، عن شريك، عن عبد الكريم، عن عكرمة، عن ابن عباس، قال لم يكن رسول الله  صلى الله عليه وسلم  ينفخ في الشراب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)didnot blow into his drinks.”",
      "chain": [
        "30216",
        "20587",
        "18655",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 47
}