{
  "id": "18713",
  "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن أوس بن أبي أوس",
  "full_name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن أوس بن أبي أوس",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ta'if"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Ta'ifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3219",
      "name": "Aus bin Hudhayfa al-Thaqafi ( أوس بن حذيفة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11437",
      "name": "'Amr bin Aws bin Abi Aws عمرو بن أوس بن أبي أوس",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11240",
      "name": "Ibrahim bin Maysara al-Ta'ifi إبراهيم بن ميسرة الطائفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20658",
      "name": "'Abdullah bin 'Abdur Rahman bin Ya'la عبد الله بن عبد الرحمن بن يعلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18910",
      "name": "Muhammad bin Sa'id al-Ta'ify محمد بن سعيد الطائفي أبو سعيد المؤذن",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1393",
      "hadith_no": "1393",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، أخبرنا قران بن تمام، ح وحدثنا عبد الله بن سعيد، أخبرنا أبو خالد، - وهذا لفظه - عن عبد الله بن عبد الرحمن بن يعلى، عن عثمان بن عبد الله بن أوس، عن جده، - قال عبد الله بن سعيد في حديثه أوس بن حذيفة - قال قدمنا على رسول الله صلى الله عليه وسلم في وفد ثقيف - قال - فنزلت الأحلاف على المغيرة بن شعبة وأنزل رسول الله صلى الله عليه وسلم بني مالك في قبة له ‏.‏ قال مسدد وكان في الوفد الذين قدموا على رسول الله صلى الله عليه وسلم من ثقيف قال كان كل ليلة يأتينا بعد العشاء يحدثنا ‏.‏ قال أبو سعيد قائما على رجليه حتى يراوح بين رجليه من طول القيام وأكثر ما يحدثنا ما لقي من قومه من قريش ثم يقول لا سواء كنا مستضعفين مستذلين - قال مسدد بمكة - فلما خرجنا إلى المدينة كانت سجال الحرب بيننا وبينهم ندال عليهم ويدالون علينا فلما كانت ليلة أبطأ عن الوقت الذي كان يأتينا فيه فقلنا لقد أبطأت عنا الليلة ‏.‏ قال إنه طرأ على جزئي من القرآن فكرهت أن أجيء حتى أتمه ‏.‏ قال أوس سألت أصحاب رسول الله صلى الله عليه وسلم كيف يحزبون القرآن قالوا ثلاث وخمس وسبع وتسع وإحدى عشرة وثلاث عشرة وحزب المفصل وحده ‏.‏ قال أبو داود وحديث أبي سعيد أتم ‏.‏",
      "text_en": " Narrated Aws ibn Hudhayfah:                     We came upon the Messenger of Allah (ﷺ) in a deputation of Thaqif. The signatories of the pact came to al-Mughirah ibn Shu'bah as his guests. The Messenger of Allah (ﷺ) made Banu-Malik stay in a tent of his.  Musaddad's version says: He was in the deputation of Thaqif which came to the Messenger of Allah (ﷺ). He used to visit and have a talk with us every day after the night prayer.  The version of AbuSa'id says: He remained standing for such a long time (talking to us) that he put his weight sometimes on one leg and sometimes on the other due to his long stay. He mostly told us how his people, the Quraysh, behaved with him.  He would say: We were not equal; we were weak and degraded at Mecca (according to Musaddad's version). When we came over to Medina the fighting began between us; sometimes we overcome them and at other times they overcome us. One night he came late and did not come at the time he used to come.  We asked him: You came late tonight?  He said: I could not recite the fixed part of the Qur'an that I used to recite every day. I disliked to come till I had completed it.  Aws said: I asked the companions of the Messenger of Allah (ﷺ): How do you divide the Qur'an for daily recitation?  They said: Three surahs, five surahs, eleven surahs, thirteen surahs' mufassal surahs.Abu Dawud said: The version of Abu Sa'id is complete.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "25244",
        "30200",
        "20326",
        "20658",
        "18713",
        "3219"
      ]
    },
    {
      "id": "sunan-ibn-majah-1406",
      "hadith_no": "1406",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عبد الله بن عبد الرحمن بن يعلى الطائفي، عن عثمان بن عبد الله بن أوس، عن جده، أوس بن حذيفة قال قدمنا على رسول الله  صلى الله عليه وسلم  في وفد ثقيف فنزلوا الأحلاف على المغيرة بن شعبة وأنزل رسول الله  صلى الله عليه وسلم  بني مالك في قبة له فكان يأتينا كل ليلة بعد العشاء فيحدثنا قائما على رجليه حتى يراوح بين رجليه وأكثر ما يحدثنا ما لقي من قومه من قريش ويقول ‏\"‏ ولا سواء كنا مستضعفين مستذلين فلما خرجنا إلى المدينة كانت سجال الحرب بيننا وبينهم ندال عليهم ويدالون علينا ‏\"‏ ‏.‏ فلما كان ذات ليلة أبطأ عن الوقت الذي كان يأتينا فيه فقلت يا رسول الله لقد أبطأت علينا الليلة ‏.‏ قال ‏\"‏ إنه طرأ على حزبي من القرآن فكرهت أن أخرج حتى أتمه ‏\"‏ ‏.‏ قال أوس فسألت أصحاب رسول الله  صلى الله عليه وسلم  كيف تحزبون القرآن قالوا ثلاث وخمس وسبع وتسع وإحدى عشرة وثلاث عشرة وحزب المفصل ‏.‏",
      "text_en": " It wasnarrated from ‘Uthman bin ‘Abdullah bin Aws that hisgrandfatherAws bin Hudhaifah said:                      “We came to the Messenger of Allah(ﷺ) inthe delegation of Thaqif. The allies of Quraish stayed at thehouseof Mughirah bin Shu’bah, and the Messenger of Allah (ﷺ) campedBani Malik in a tent belonging to him. He used to come to us everynight after the ‘Isha’ and speak to us standing on his two feet,untilhe started to shift his weight from one foot to the other. Mostofwhat he told us was what he had suffered from his people, theQuraish.He said: ‘(The two sides) were not equal. We were weak andoppressedand humiliated, and when we went out to Al-Madinah, theoutcome of thebattles between us varied; sometimes we would defeatthem andsometimes they would defeat us.’ One night he was laterthan heusually was, and I said: ‘O Messenger of Allah, you havecome to uslate tonight.’ He said: ‘It occurred to me that I hadnot read mydaily portion of Qur’an and I did not want to come outuntil I hadcompleted it.’” Aws said: “I asked the Companionsof the Messenger ofAllah (ﷺ): ‘How did you used to divide up theQur’an?’ They said: ‘Athird, a fifth, a seventh, a ninth, aneleventh, a thirteenth, andHizbul-Mufassal.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "18713"
      ]
    }
  ],
  "total_hadiths": 2
}