{
  "id": "18710",
  "name": "'Uthman bin Abi Swd'h عثمان بن أبي سودة المقدسي",
  "full_name": "'Uthman bin Abi Swd'h عثمان بن أبي سودة المقدسي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  د  ت  ق  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11457",
      "name": "Umm al-Darda'a أم الدرداء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "24199",
      "name": "Shbyb bin Shayba bin Abd شبيب بن شيبة بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14307",
      "name": "'Isa bin Snan al-Hnfy عيسى بن سنان الحنفي أبو سنان القسملي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3642",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن الوزير الدمشقي، حدثنا الوليد، قال لقيت شبيب بن شيبة فحدثني به، عن عثمان بن أبي سودة، عن أبي الدرداء، - يعني عن النبي صلى الله عليه وسلم - بمعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu al-Darda through a different chain of narrators to the same effect from the Holy Prophet(ﷺ)",
      "chain": [
        "20733",
        "18710",
        "37"
      ]
    },
    {
      "hadith_no": "2139",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، والحسين بن أبي كبشة البصري، قالا حدثنا يوسف بن يعقوب السدوسي، حدثنا أبو سنان القسملي، هو الشامي عن عثمان بن أبي سودة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عاد مريضا أو زار أخا له في الله ناداه مناد أن طبت وطاب ممشاك وتبوأت من الجنة منزلا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو سنان اسمه عيسى بن سنان ‏.‏ وقد روى حماد بن سلمة عن ثابت عن أبي رافع عن أبي هريرة عن النبي صلى الله عليه وسلم شيئا من هذا ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"Whoever visits the sick, or visits his brother in Allah (faith), a caller calls out: 'May you have goodness and livelihood be good, and may you dwell in an adobe in Paradise.'\"",
      "chain": [
        "30160",
        "20305",
        "18710",
        "13"
      ]
    },
    {
      "hadith_no": "1510",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يوسف بن يعقوب، حدثنا أبو سنان القسملي، عن عثمان بن أبي سودة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من عاد مريضا نادى مناد من السماء طبت وطاب ممشاك وتبوأت من الجنة منزلا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     ‘Whoever visits a sick person, a caller calls from heaven: ‘Mayyou be happy, may your walking be blessed, and may you occupy adignified position in Paradise.’”",
      "chain": [
        "30160",
        "20305",
        "18710",
        "13"
      ]
    },
    {
      "hadith_no": "3807",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن أبي سنان، عن عثمان بن أبي سودة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  مر به وهو يغرس غرسا فقال ‏\"‏ يا أبا هريرة ما الذي تغرس ‏\"‏ ‏.‏ قلت غراسا لي ‏.‏ قال ‏\"‏ ألا أدلك على غراس خير لك من هذا ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ قل سبحان الله والحمد لله ولا إله إلا الله والله أكبر يغرس لك بكل واحدة شجرة في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (ﷺ) passed by him when he was planting a plant, and said: \"O Abu Hurairah, what are you planting?\" I said: \"A plant for me.\" He said: \"Shall I not tell you of a plant that is better than this?\" He said: \"Of course, O Messenger of Allah.\" He said: \"Say: 'Subhan-Allah, wal-hamdu-lillah, wa la ilaha illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah and Allah is the Most Great.)' For each one a tree will be planted for you in Paradise.\"",
      "chain": [
        "30201",
        "30106",
        "20021",
        "18710",
        "13"
      ]
    }
  ],
  "total_hadiths": 4
}