{
  "id": "18745",
  "name": "'Aqeel bin Shubayb عقيل بن شبيب",
  "full_name": "'Aqeel bin Shubayb عقيل بن شبيب",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ بخ  د  س  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20637",
      "name": "Muhammad bin Muhajir bin Abi Muslim محمد بن مهاجر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2543",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن سعيد الطالقاني، حدثنا محمد بن المهاجر الأنصاري، حدثني عقيل بن شبيب، عن أبي وهب الجشمي، - وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ عليكم بكل كميت أغر محجل، أو أشقر أغر محجل، أو أدهم أغر محجل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuWahb al-Jushami,:                     The Messenger of Allah (ﷺ) said: Keep to every dark bay horse with a white blaze and white on the legs, or sorrel with a white blaze and white on the legs , or black with a white blaze and white on the legs.",
      "chain": [
        "30524",
        "26529",
        "18745"
      ]
    },
    {
      "hadith_no": "2544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أبو المغيرة، حدثنا محمد بن مهاجر، حدثنا عقيل بن شبيب، عن أبي وهب، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ عليكم بكل أشقر أغر محجل، أو كميت أغر ‏\"‏ ‏.‏ فذكر نحوه ‏.‏ قال محمد - يعني ابن مهاجر - سألته ‏:‏ لم فضل الأشقر قال ‏:‏ لأن النبي صلى الله عليه وسلم بعث سرية فكان أول من جاء بالفتح صاحب أشقر ‏.‏",
      "text_en": " Narrated AbuWahb:                     The Prophet (ﷺ) said: Keep to every sorrel horse with a white blaze and white on the legs, or dark bay with a white blaze. He then  mentioned something similar. Muhammad ibn al-Muhajir said: I asked him: Why was a sorrel horse preferred? He replied: Because the Prophet (ﷺ) had sent a contingent, and the man who first brought the news of victory was the rider of a sorrel horse.",
      "chain": [
        "38566",
        "20442",
        "20637",
        "18745"
      ]
    },
    {
      "hadith_no": "2553",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن سعيد الطالقاني، أخبرنا محمد بن المهاجر، حدثني عقيل بن شبيب، عن أبي وهب الجشمي، - وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ارتبطوا الخيل وامسحوا بنواصيها وأعجازها ‏\"‏ ‏.‏ أو قال ‏\"‏ أكفالها ‏\"‏ ‏.‏ ‏\"‏ وقلدوها ولا تقلدوها الأوتار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuWahb al-Jushami,:                     The Messenger of Allah (ﷺ) said: Tie the horses, rub down their forelocks and their buttocks (or he said: Their rumps), and put things on their necks, but do not put bowstrings.",
      "chain": [
        "30524",
        "26529",
        "18745"
      ]
    },
    {
      "hadith_no": "4950",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن سعيد الطالقاني، أخبرنا محمد بن المهاجر الأنصاري، قال حدثني عقيل بن شبيب، عن أبي وهب الجشمي، وكانت، له صحبة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسموا بأسماء الأنبياء وأحب الأسماء إلى الله عبد الله وعبد الرحمن وأصدقها حارث وهمام وأقبحها حرب ومرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuWahb al-Jushami:                     The Prophet (ﷺ) said: Call yourselves by the names of the Prophets. The names dearest to Allah are Abdullah and AbdurRahman, the truest are Harith and Hammam, and the worst are Harb and Murrah.",
      "chain": [
        "30524",
        "26529",
        "18745"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا أبو أحمد البزاز، هشام بن سعيد الطالقاني قال حدثنا محمد بن مهاجر الأنصاري، عن عقيل بن شبيب، عن أبي وهب، - وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسموا بأسماء الأنبياء وأحب الأسماء إلى الله عز وجل عبد الله وعبد الرحمن وارتبطوا الخيل وامسحوا بنواصيها وأكفالها وقلدوها ولا تقلدوها الأوتار وعليكم بكل كميت أغر محجل أو أشقر أغر محجل أو أدهم أغر محجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Wahb, who was a Companion of the Prophet, said:                      \"The Messenger of Allah said: 'Call (your children) by the names of the prophets. And the most beloved names to Allah, the Mighty and Sublime, are 'Abdullah and 'Abdur-Rahman. Keep horses; wipe their forelocks and posteriors, and prepare them for Jihad, but do not prepare them to seek vengeance for people killed during the Jahiliyyah. You should seek out Kumait, horses with a white mark on the face and white feet, or red with a white mark on the face and white feet, or black with a white mark on the face and white feet.'\"",
      "chain": [
        "30375",
        "20637",
        "18745"
      ]
    }
  ],
  "total_hadiths": 5
}