{
  "id": "18753",
  "name": "'Ali bin Shmakh علي بن شماخ",
  "full_name": "'Ali bin Shmakh علي بن شماخ",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  -  مقبول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3200",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو، حدثنا عبد الوارث، حدثنا أبو الجلاس، عقبة بن سيار حدثني علي بن شماخ، قال شهدت مروان سأل أبا هريرة كيف سمعت رسول الله صلى الله عليه وسلم يصلي على الجنازة قال أمع الذي قلت قال نعم ‏.‏ قال كلام كان بينهما قبل ذلك ‏.‏ قال أبو هريرة ‏\"‏ اللهم أنت ربها وأنت خلقتها وأنت هديتها للإسلام وأنت قبضت روحها وأنت أعلم بسرها وعلانيتها جئناك شفعاء فاغفر له ‏\"‏ ‏.‏ قال أبو داود أخطأ شعبة في اسم علي بن شماخ قال فيه عثمان بن شماس وسمعت أحمد بن إبراهيم الموصلي يحدث أحمد بن حنبل قال ما أعلم أني جلست من حماد بن زيد مجلسا إلا نهى فيه عن عبد الوارث وجعفر بن سليمان ‏.‏",
      "text_en": " Ali ibn Shammakh said:                      I was present with Marwan who asked AbuHurayrah: Did you hear how the Messenger of Allah (ﷺ) used to pray over the dead? He said: Even with the words that you said. (The narrator said: They exchanged hot words between them before that.) Abu Hurairah said: O Allah, Thou art its Lord. Thou didst create it, Thou didst guide it to Islam, Thou hast taken its spirit, and Thou knowest best its inner nature and outer aspect. We have come as intercessors, so forgive him.Abu Dawud said: Shu'bah made a mistake in mentioning the name of 'Ali b. Shammakh. He said in his version: 'Uthman b. Shammas.Abu Dawud said: I heard Ahmad b. Ibrahim al-Mawsili say that Ahmad b. Hanbal said: In every meeting which I attended with Hammad b. Zaid he forbade to narrate this traditions from 'Abd al-Warith and Ja'far b. Sulaiman.",
      "chain": [
        "30350",
        "20258",
        "18753"
      ]
    }
  ],
  "total_hadiths": 1
}