{
  "id": "18767",
  "name": "'Umara bin Juwayn, Abu Harun عمارة بن جوين أبو هارون العبدي",
  "full_name": "'Umara bin Juwayn, Abu Harun عمارة بن جوين أبو هارون العبدي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Abandoned",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "134",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Abandoned] [ عخ  ت  ق  -  متروك ]"
    ],
    "tags": [
      "al-'Abdi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20715",
      "name": "'Abdullah bin Shwdhb عبد الله بن شوذب الخراساني أبو عبد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24091",
      "name": "al-Hakam bin Abd'h الحكم بن عبدة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11583",
      "name": "Khalid bin Dinar Abu Khalida خالد بن دينار التميمي السعدي أبو خلدة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24207",
      "name": "Salah bin Bashir bin Wada' - al-Mari صالح بن بشير بن وادع - المري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20572",
      "name": "Nwh bin Qays bin نوح بن قيس بن",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2077",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن سفيان، عن أبي هارون العبدي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ضرب أحدكم خادمه فذكر الله فارفعوا أيديكم ‏\"‏ ‏.‏ قال أبو عيسى وأبو هارون العبدي اسمه عمارة بن جوين ‏.‏ قال قال أبو بكر العطار قال علي بن المديني قال يحيى بن سعيد ضعف شعبة أبا هارون العبدي ‏.‏ قال يحيى وما زال ابن عون يروي عن أبي هارون حتى مات ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri  narrated that the Messenger of Allah said :                     \"When one of you beats his servant then he (should) remember Allah and, withhold your hands.\"",
      "chain": [
        "30304",
        "20025",
        "20012",
        "18767",
        "38"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبو داود الحفري، عن سفيان، عن أبي هارون العبدي، قال كنا نأتي أبا سعيد فيقول مرحبا بوصية رسول الله صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الناس لكم تبع وإن رجالا يأتونكم من أقطار الأرضين يتفقهون في الدين فإذا أتوكم فاستوصوا بهم خيرا ‏\"‏ ‏.‏ قال أبو عيسى قال علي قال يحيى بن سعيد كان شعبة يضعف أبا هارون العبدي ‏.‏ قال يحيى بن سعيد ما زال ابن عون يروي عن أبي هارون العبدي حتى مات ‏.‏ قال أبو عيسى وأبو هارون اسمه عمارة بن جوين ‏.‏",
      "text_en": " Narrated Abu Harun [Al-'Abdi]:                     \"We went to Abu Sa'eed and he said: 'Welcome with the exhortation of the Messenger of Allah (ﷺ). Indeed the Prophet (ﷺ) said: \"Surely, the people are followers of you, and men will certainly come to you from the regions of the earth to gain understanding in the religion. So when they come to you exhort them with good.\"",
      "chain": [
        "35047",
        "20668",
        "20012",
        "18767"
      ]
    },
    {
      "hadith_no": "2651",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا نوح بن قيس، عن أبي هارون العبدي، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ يأتيكم رجال من قبل المشرق يتعلمون فإذا جاءوكم فاستوصوا بهم خيرا ‏\"‏ ‏.‏ قال فكان أبو سعيد إذا رآنا قال مرحبا بوصية رسول الله صلى الله عليه وسلم ‏.‏ قال هذا حديث لا نعرفه إلا من حديث أبي هارون عن أبي سعيد الخدري ‏.‏",
      "text_en": " Narrated Abu Harun [Al-'Abdi]:                     from Abu Sa'eed Al-Khudri that the Prophet (ﷺ) said: \"Men will come to you from the direction of the east to learn. So when they come to you then exhort them to good.\" He said: \"When Abu Sa'eed saw us he would say: 'Welcome with the exhortation of the Messenger of Allah, may the peace and blessings of Allah be upon him and his family.'\"",
      "chain": [
        "30367",
        "20572",
        "18767",
        "38"
      ]
    },
    {
      "hadith_no": "4082",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا جعفر بن سليمان، عن أبي هارون العبدي، عن أبي سعيد الخدري، قال إنا كنا لنعرف المنافقين نحن معشر الأنصار ببغضهم علي بن أبي طالب ‏.‏ قال هذا حديث غريب إنما نعرفه من حديث أبي هارون ‏.‏ وقد تكلم شعبة في أبي هارون ‏.‏ وقد روي هذا عن الأعمش عن أبي صالح عن أبي سعيد ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"We, the people of the Ansar, used to recognize the hypocrites, by their hatred for 'Ali bin Abi Talib.\"",
      "chain": [
        "30367",
        "20532",
        "18767",
        "38",
        "11060",
        "11161"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن الحارث بن راشد المصري، حدثنا الحكم بن عبدة، عن أبي هارون العبدي، عن أبي سعيد الخدري، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ سيأتيكم أقوام يطلبون العلم فإذا رأيتموهم فقولوا لهم مرحبا مرحبا بوصية رسول الله  صلى الله عليه وسلم  واقنوهم ‏\"‏ ‏.‏ قلت للحكم ما اقنوهم قال علموهم ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Messenger of Allah said: \"People will come to you seeking knowledge. When you see them say to them, 'Welcome, welcome,' in obedience to the injunctions of the Messenger of Allah and instruct them in knowledge.\"(One of the narrators said) \"I said to Al-Hakam: 'What is 'Iqnuhum?' He said: 'Instruct them.'\"",
      "chain": [
        "36051",
        "24091",
        "18767",
        "38"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا عمرو بن محمد العنقزي، أنبأنا سفيان، عن أبي هارون العبدي، قال كنا إذا أتينا أبا سعيد الخدري قال مرحبا بوصية رسول الله  صلى الله عليه وسلم  ‏.‏ إن رسول الله  صلى الله عليه وسلم  قال لنا ‏\"‏ إن الناس لكم تبع وإنهم سيأتونكم من أقطار الأرض يتفقهون في الدين فإذا جاءوكم فاستوصوا بهم خيرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Harun Al-'Abdi said:                     \"When we came to Abu Sa'eed Al-Khudri, he would say: 'Welcome, in accordance with the injunction of the Messenger of Allah, for the Messenger of Allah said to us: \"The people will follow you; they will come to you from all parts of the earth seeking to understand the religion. So when they come to you, take care of them.\"",
      "chain": [
        "38409",
        "20597",
        "20012",
        "18767"
      ]
    }
  ],
  "total_hadiths": 6
}