{
  "id": "18770",
  "name": "'Amarah bin Gharab عمارة بن غراب اليحصبي",
  "full_name": "'Amarah bin Gharab عمارة بن غراب اليحصبي",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ بخ  د  -  صحابي ]"
    ],
    "tags": [
      "al-Yahsabi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28326",
      "name": "'Abdur Rahman bin Ziyad عبد الرحمن بن زياد بن أنعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "270",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد الله، - يعني ابن عمر بن غانم - عن عبد الرحمن، - يعني ابن زياد - عن عمارة بن غراب، أن عمة، له حدثته أنها، سألت عائشة قالت إحدانا تحيض وليس لها ولزوجها إلا فراش واحد قالت أخبرك بما صنع رسول الله صلى الله عليه وسلم دخل ليلا وأنا حائض فمضى إلى مسجده - قال أبو داود تعني مسجد بيته - فلم ينصرف حتى غلبتني عيني وأوجعه البرد فقال ‏\"‏ ادني مني ‏\"‏ ‏.‏ فقلت إني حائض ‏.‏ فقال ‏\"‏ وإن اكشفي عن فخذيك ‏\"‏ ‏.‏ فكشفت فخذى فوضع خده وصدره على فخذى وحنيت عليه حتى دفئ ونام ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Umarah ibn Ghurab said that his paternal aunt narrated to him that she asked Aisha: What if one of us menstruates and she and her husband have no bed except one? She replied: I relate to you what the Messenger of Allah (ﷺ) had done. One night he entered (upon me) while I was menstruating. He went to the place of his prayer, that is, to the place of prayer reserved (for this purpose) in his house. He did not return until I felt asleep heavily, and he felt pain from cold. And he said: Come near me. I said: I am menstruating. He said: Uncover your thighs. I, therefore, uncovered both of my thighs. Then he put his cheek and chest on my thighs and I lent upon he until he became warm and slept.",
      "chain": [
        "20164",
        "28296",
        "28326",
        "18770",
        "53"
      ]
    }
  ],
  "total_hadiths": 1
}